{
  "positive": [
    {
      "review": "I played Age of Empires as a kid, and this is the worst remaster of a classic ga...*wololo* I love this game, 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I first played this game (AOE I) way back in 1999 and it completely hooked me from the very first week. It was one of those rare games that stayed in your mind even when you were not playing it. So when I spotted it on Steam after so many years, I did not even think twice. I bought it instantly. The nostalgia hit me right away, but at the same time the game still feels fresh, fast paced, and addictive.\r\n\r\nI still play this franchise regularly. Age of Empires II is my all time favourite and in my opinion one of the finest RTS games ever made. I own all the later versions as well, but there is something about the classic feel of AOE II (The next version) that keeps pulling me back. It has that perfect balance of strategy, resource management, and the thrill of building an empire from scratch.\r\n\r\nI do not usually play multiplayer. I mostly stick to single player games against the AI, and trust me, the AI can be brutal when you push the difficulty up. Handling more than three AI opponents at the same time can be exhausting. You are constantly reacting to raids, rebuilding your economy, scouting, and trying to stay one step ahead. It is stressful in a good way and makes every match feel like a proper battle for survival.\r\n\r\nThe graphics have aged gracefully. I love how the Definitive Editions polished everything without losing the original charm. The animations are smooth, the terrain looks richer, and the units are more detailed, yet the game still keeps the classic silhouette and readability that made it easy to play for hours.\r\n\r\nThe scenarios and campaigns deserve a special mention. They are incredibly well designed with a perfect mix of storytelling and challenge. You feel the weight of historical battles and every mission pushes you to think differently. There is always that one moment where you realise you need to change your strategy completely if you want to win.\r\n\r\nEven after all these years, the game remains a masterpiece. The music, the civilisations, the tech tree, the fast decision making, the rush moments, and the late game chaos all come together beautifully. For me this series is not just a game, it is a long term companion. I grew up with it and I am still enjoying it decades later.\r\n\r\nIf you are a strategy fan, this franchise will never disappoint you. It has heart, depth, nostalgia, and incredible replay value. I am really glad it made its way to Steam, because now I get to enjoy it all over again.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game is absolute shit. I've played like half a dozen RTS games and this one is objectively the worst one. The unit pathing AI makes Elder Scrolls Oblivion's AI look like Shodan from System Shock. But i still love it purely out of nostalgia. It was the first game i ever played, the first RTS I ever played, and it gave me a passion for both history and RTS games.\r\n\r\nAlso, if you're a new player, dont bother trying to get into multiplayer. You're gonna keep getting kicked out of lobbies if you don't have any elo and you're not gonna get elo if you dont play any ranked multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "UI is simple, Historical senarios are numerous in number, Good game. Will update after playing more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ah, my good old Age of Empires the true and only real RTS ever made. Few games have managed to capture the magic, strategy, and pure fun that this classic delivers. From historic campaigns to building your empire from nothing, every match feels like stepping into a living battlefield.\nI’ve spent hours and hours playing this, especially after finishing the campaign, teaming up with friends for long, unforgettable matches. The mix of base building, resource management, and tactical combat is still unmatched today.\nTotally recommended. Age of Empires isn’t just a game, it’s a timeless experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, it's not a bad game. But AoE2 is just better in every way. So unless you (like me) feel the need to play through all of the campaign for completion sake, there's really no reason to play it over its sequel.\n\n(EDITING to a tentative Yes, recommend, as the game doesn't deserve to be negatively reviewed. But again -- if you're deciding what to buy, just buy AoE2. Really.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "considerably difficult than aoe 2? maybe because i didnt play it too much back in the day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice QoL improvements.\r\nHad fun in single player so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Baller game. 100% recommend. 5 stars gang if you haven't bought it yet get it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played Age of Empires for over 25 years. It is still good game play and requires thought and planning. The current games on the market are really neat but sometimes, old school is always the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an evergreen, always a pleasure to be back on youth and play this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Giving it a positive review just for the sheer fact that they bothered to include classic graphics. (I'm looking at you, AOE2DE!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Age of Empires: Definitive Edition is a beautifully polished revival of a classic. The updated visuals, remastered soundtrack, and quality-of-life improvements make the original game feel fresh without losing its nostalgic charm. Campaigns are still fun and challenging, and the improved pathfinding makes gameplay smoother than ever.\r\n\r\nIt’s not as modern or complex as newer RTS games, but that’s part of its appeal—simple, strategic, and endlessly replayable.\r\n\r\nA respectful remake of a legend. 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🎮 Age of Empires: Definitive Edition — A Timeless Portal to Civilization and Self-Awareness\r\n\r\nAs a 32-year-old software architect in 2025, I find myself regularly diving into the remastered glory of Age of Empires: Definitive Edition. But this isn’t just a game—it’s a time machine. It takes me back to my 15-year-old self, sitting in a school uniform, wide-eyed and curious, dreaming of building empires and commanding armies. That child still lives within me, and this game is his playground.\r\n\r\n🏛️ A Kingdom Re-imagined, A Memory Rekindled\r\nThe Definitive Edition doesn’t just polish the graphics or refine the mechanics—it reawakens a deep emotional connection. It’s the same game I fell in love with, now dressed in modern elegance. The thrill of constructing a civilization from scratch, strategizing to outwit opponents, and watching my kingdom flourish still gives me goosebumps. It’s not nostalgia—it’s a living, breathing experience that evolves with me.\r\n\r\n🕉️ A Spiritual Bridge to Ancient India\r\nAs an Indian, I find profound resonance in the game’s historical depth. The echoes of the Indus Valley Civilization and the philosophical undertones of Hinduism subtly weave into my gameplay. It’s more than conquest—it’s dharma, karma, and moksha in digital form. I’m not just playing; I’m embodying the creator, protector, and destroyer—living out a cosmic cycle through pixels and strategy.\r\n\r\n🧠 Escaping the Robotic Routine\r\nIn a world where we often feel like cogs in a machine, Age of Empires offers a radical shift. It’s a simulation, yes—but I’m the one in control. The game becomes a matrix where I dictate the flow of civilization. For those few hours, I’m not bound by deadlines or meetings. I’m alive, aware, and immersed in a world where every decision matters.\r\n\r\n🤖 AI That Keeps You on Your Toes\r\nThe AI in this edition is no pushover. It demands your full attention. A momentary lapse in awareness can cost you dearly. But that’s the beauty of it—it keeps you sharp, engaged, and constantly evolving. Every victory feels earned, every defeat a lesson.\r\n\r\n❤️ A Heartfelt Thank You\r\nTo the brilliant minds at Microsoft and the developers who breathed new life into this classic—thank you. You’ve not just entertained us; you’ve helped us reconnect with ourselves. You’ve turned boredom into brilliance, routine into ritual, and childhood dreams into adult joy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its realy fun my kid loves it its good for history and homeschool",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "faithful remaster of the old version, still nostalgic and yet refined",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mainly bought this game for nostagia and I play with cheats so this won't be a fair. However, I would say that this is a pretty basic RTS with no to little difference between the factions, no real story for the campaigns and I prefer the menus, breifings and UI from the orginal. But the animations look nice,(especially the destroyed building ones\n), there's a whole campaign to theach you how to play like with Trading and how to use priest, and they added difficulty settings for new players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of improvements over the 90s version. I enjoy it a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game but community here is not that active like in AOEII",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More limited than the later games but still fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game that started it all. Although AoE2 is better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It would be nice if the public games didn't crash all the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The memory we had of this classic from years ago.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A marvelous redesign of our childhood memories.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like all of the AGE OF EMPIRES My Favourite Game of all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More fun if u enjoy the history of humankind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, works well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So fun to play with my wife 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy to play and not hard to learn",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "brings back memories :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "definitely not as good as the sequel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "e=mc2 stormtrooper",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "PC Gaming Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still my best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "iz good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "epic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "excellent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "C'mon! It's AoE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nostalgia~~~~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time ever I've played [b]Age of Empires[/b]\r\n\r\nThe Definitive Edition is done really well. The game works flawlessly on Windows 11 at 1080p resolution right out the box - no need to look for fixes on the internet in order to make such an old game run on modern PCs\r\n\r\nSince this is the very first AoE game, it's far simpler than the newer AoE games in terms of dialogue and unit variety across different factions - the units and structures look more or less the same, doesn't matter what faction you're playing as\r\n\r\nOne of the issues I have with this game is the really bad pathing of units. Units will get stuck behind other units while moving - especially faster units getting stuck behind much slower units. It would be so much better if the units walked in formation\r\n\r\nThe missions are very simple - usually the game just asks you to steal an artifact and bring it back to your base or to build a certain structure at a specific location. The AI tends to be unreasonably aggressive.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I played Age of Empires as a kid, and this is the worst remaster of a classic ga...*wololo* I love this game, 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "This isn’t a welcoming game. It doesn’t hold your hand, offer adaptive difficulty, or ease you into its systems. But for players who crave a challenge, it delivers a battlefield where every victory feels earned.\n\nI came in with a strategic mindset, experimenting with civilizations, map types, and AI allies to simulate a learning mode. I studied resource placement, refined build orders, and adapted to enemy advances. The enemy AI punished me relentlessly. Even on the easiest difficulty, it floods the map with units while I’m still stabilizing my economy. Ally AI often stands idle as my town center is razed within sight.\n\nThere’s no in-game guidance on civilization bonuses, no pause-and-queue system, and no scaffolding for solo learners. It’s emotionally exhausting. But wins give you the most rewarding feelings ever.\n\nThis game doesn’t respect your time, but it does respect persistent effort. If you’re new to the series and want a fair solo experience, this version may not be for you. But if you’re here to be tested, to earn your victories through grit and adaptation, \"Age of Empires I\" will reward you.\n\nAll of the above was written before doing the campaign. The tutorial is an entire short campaign. As long as you pay attention and read, it's very informative and guides you through a nice beginner's process.\nThe first campaign outside of that is much more story driven and appears meant to hone your learned skills while giving you new ones. These campaigns are more forgiving than custom game AI, much of the ones I've gone through so far allow you plenty of time to build up without bringing legions of cavalry directly to your borders.\nI had thought I could just dive right into custom games and that those were going to be generally more interesting. The campaign at least is a lot more fun for newcomers. I played when I was about 6-7 years old around 1999 ish, but that doesn't make me a veteran.\n\nTL;DR\nI hope you enjoy the game, if you're new, try the tutorial campaign and continue more campaigns from there.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "It's a timeless classic that keeps up extremely well up to this day! \n\nReading negative comments mentioning \"horrible\" pathfinding and units blocking each other... \nGuys, it's a mechanic.. instead of whining you should exploit those things to your advantage. \n\nThe grafical update is very welcome and I cant remember the last time 70h felt so short. The campaign is very fun and I also had a blast playing around in customs vs ai. It's even played online but if you're into a vivid online experience and you want that nostalgic vibe play aoe2. I recommend it to every rts fan. You def cant do wrong when you go for it on sale :)\n\n09/10",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Age of Empires: Definitive Edition brings the classic RTS back with upgraded visuals, remastered audio, and some welcome quality-of-life improvements. The updated graphics are vibrant, and the original charm is largely intact, making it a satisfying hit of nostalgia for longtime fans.\r\n\r\nHowever, despite the facelift, the game still suffers from many of the same issues that plagued the original—clunky pathfinding, dated AI, and a UI that doesn’t quite match modern RTS standards. Multiplayer stability can be inconsistent, and the improvements don’t go far enough to make it truly competitive with more recent strategy titles.\r\n\r\nOverall, it’s a decent remaster that appeals more to purists than to new players. A respectful update, but not a revolutionary one.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I first played this game (AOE I) way back in 1999 and it completely hooked me from the very first week. It was one of those rare games that stayed in your mind even when you were not playing it. So when I spotted it on Steam after so many years, I did not even think twice. I bought it instantly. The nostalgia hit me right away, but at the same time the game still feels fresh, fast paced, and addictive.\r\n\r\nI still play this franchise regularly. Age of Empires II is my all time favourite and in my opinion one of the finest RTS games ever made. I own all the later versions as well, but there is something about the classic feel of AOE II (The next version) that keeps pulling me back. It has that perfect balance of strategy, resource management, and the thrill of building an empire from scratch.\r\n\r\nI do not usually play multiplayer. I mostly stick to single player games against the AI, and trust me, the AI can be brutal when you push the difficulty up. Handling more than three AI opponents at the same time can be exhausting. You are constantly reacting to raids, rebuilding your economy, scouting, and trying to stay one step ahead. It is stressful in a good way and makes every match feel like a proper battle for survival.\r\n\r\nThe graphics have aged gracefully. I love how the Definitive Editions polished everything without losing the original charm. The animations are smooth, the terrain looks richer, and the units are more detailed, yet the game still keeps the classic silhouette and readability that made it easy to play for hours.\r\n\r\nThe scenarios and campaigns deserve a special mention. They are incredibly well designed with a perfect mix of storytelling and challenge. You feel the weight of historical battles and every mission pushes you to think differently. There is always that one moment where you realise you need to change your strategy completely if you want to win.\r\n\r\nEven after all these years, the game remains a masterpiece. The music, the civilisations, the tech tree, the fast decision making, the rush moments, and the late game chaos all come together beautifully. For me this series is not just a game, it is a long term companion. I grew up with it and I am still enjoying it decades later.\r\n\r\nIf you are a strategy fan, this franchise will never disappoint you. It has heart, depth, nostalgia, and incredible replay value. I am really glad it made its way to Steam, because now I get to enjoy it all over again.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A classic game with great gameplay and visual improvements",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I was initially concerned that this definitive edition was going to make too many changes and that it wasn't going to feel like playing the original, but now I don't know if I can ever go back. Gameplay is almost identical to the original (warts and all), but looks and feels like a modern video game. Only played the single player campaigns (all on the hardest difficulty) and had an engaging 80+ hour nostalgia trip. This is the best way to experience the first Age of Empires game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Don't get me wrong, it's not a bad game. But AoE2 is just better in every way. So unless you (like me) feel the need to play through all of the campaign for completion sake, there's really no reason to play it over its sequel.\n\n(EDITING to a tentative Yes, recommend, as the game doesn't deserve to be negatively reviewed. But again -- if you're deciding what to buy, just buy AoE2. Really.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "W game. Good starter game to learn, would recommend AOE2 for a better experience",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's one of my favorite games of all time. The remastered edition didn't just fire up my nostalgia. It made me remember how beautiful the game really was. The historical information before each mission teaches you more than you probably learned in school. The difficulty is sometimes off on some scenarios but overall it's a pleasure to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hmm, how to say this. I think AoE DE is the weakest of all the games in the series.\n\nHowever.\n\nNo DLCs. Everything in a single package. A decently priced package at that, let me add. It’s not as good as later games, but it is still plenty of fun, if simple when it comes to choices, but still requiring some skill to beat the harder campaigns. \n\nOverall, I can recommend it to people who are looking for a retro RTS with plenty of content and a low price tag. And if you end up liking it? AoE2 is out there with much much more content waiting for ya.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Age of Empires: Definitive Edition is a Great Game! The campaigns and the multiplayer replay-ability are top notch quality! One of the greatest RTS games of all time!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "'s a game that reminds me of a time when graphics weren't the most important thing, but rather the plot and gameplay. Playing it again after so long made me feel nostalgic. Excellent!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is absolute shit. I've played like half a dozen RTS games and this one is objectively the worst one. The unit pathing AI makes Elder Scrolls Oblivion's AI look like Shodan from System Shock. But i still love it purely out of nostalgia. It was the first game i ever played, the first RTS I ever played, and it gave me a passion for both history and RTS games.\r\n\r\nAlso, if you're a new player, dont bother trying to get into multiplayer. You're gonna keep getting kicked out of lobbies if you don't have any elo and you're not gonna get elo if you dont play any ranked multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "UI is simple, Historical senarios are numerous in number, Good game. Will update after playing more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ah, my good old Age of Empires the true and only real RTS ever made. Few games have managed to capture the magic, strategy, and pure fun that this classic delivers. From historic campaigns to building your empire from nothing, every match feels like stepping into a living battlefield.\nI’ve spent hours and hours playing this, especially after finishing the campaign, teaming up with friends for long, unforgettable matches. The mix of base building, resource management, and tactical combat is still unmatched today.\nTotally recommended. Age of Empires isn’t just a game, it’s a timeless experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "considerably difficult than aoe 2? maybe because i didnt play it too much back in the day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice QoL improvements.\r\nHad fun in single player so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Baller game. 100% recommend. 5 stars gang if you haven't bought it yet get it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played Age of Empires for over 25 years. It is still good game play and requires thought and planning. The current games on the market are really neat but sometimes, old school is always the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great, love the classic addition the most.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Age of Empires is a great game. The older one has it's flaws but is still a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic game. You can't go wrong with it. So many unique civilizations to choose from. Worth playing if you enjoy RTS games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great remaster of a fantastic classic RTS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excelente nueva versión del clásico RTS, una pena lo difícil que es encontrar partidas en línea. Perfecto para volver a jugar las campañas clásicas. Como siempre el editor de mapas y campañas personalizadas extienden el tiempo de rejugabilidad; lo cual es muy valioso considerando lo lento que puede ser conseguir una partida JcJ.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do play this game,\r\nIts super fun and interactive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished all campaigns, and the nostalgia was great - it really felt good to revisit the classic. That said, some issues are hard to ignore:\r\n\r\n- Factions are too limited (Gauls represented by Greeks/Assyrians feels wrong).\r\n- Biomes, environments, and unit variety are underwhelming.\r\n- AI difficulty is inconsistent. Some missions are too easy, others unexpectedly punishing.\r\n- And most critically, pathfinding is terrible. Units constantly get stuck, and without formations you need to micromanage every move. I really wish the definitive edition had fixed this at the very least.\r\n\r\nOverall, it’s still a good game, especially for older players who grew up with it. But for new players, I wouldn’t recommend it - the flaws stand out too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic graphics with classic rules for building, expanding, and advancing. Get a mixture of warriors, boats, and hunter/gatherers to do your bidding, while trying to beat the AI (or other players) towards the end goal. The built-in campaign, while a bit dated now, does give a good overview of how things in the game work, expanding your abilities and resources each level. Not sure how well the game holds up to modern game play, but for the period that this represents, it was a good adventure with some tough scenarios to overcome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my favorite computer game growing, and certainly one of the great computer games ever made, and especially one of the greatest RTS games ever made. This game put a deep love and fascination for Greco-Roman history as a child in the late 90s, and early 00's. It's mechanics are a little clunky, but it's a great starter game for kids d/t lack of graphic violence, nudity, profanity, and gore that many modern games have, and I occasionally play for the nostalgia. The DE graphics have breathed new life into this jewel, and it scratches an itch for RTS play in the Classical age that isn't scratched by most games. For updated play, I'd highly recommend the Return of Rome expansion for AOE II DE. You get gates, and the better mechanics and graphics of AOE II. \r\n\r\nStill, it's worth adding to your collection however, and playing with your kids. Check it out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is history! Just first game on computer that I ever played in early 90's. It's brilliant strategy game ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an evergreen, always a pleasure to be back on youth and play this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i just loved the game overall and im familiar with the franchise so it brings back memories",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Age of Empires: Definitive Edition is a beautifully polished revival of a classic. The updated visuals, remastered soundtrack, and quality-of-life improvements make the original game feel fresh without losing its nostalgic charm. Campaigns are still fun and challenging, and the improved pathfinding makes gameplay smoother than ever.\r\n\r\nIt’s not as modern or complex as newer RTS games, but that’s part of its appeal—simple, strategic, and endlessly replayable.\r\n\r\nA respectful remake of a legend. 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Upgrade/update on the Original AOE and lovely graphics but similar gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nostalgia reloaded for 5 bucks, was able to play it with my friends from the Netcafe, it felt like 2001 again :D",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "🎮 Age of Empires: Definitive Edition — A Timeless Portal to Civilization and Self-Awareness\r\n\r\nAs a 32-year-old software architect in 2025, I find myself regularly diving into the remastered glory of Age of Empires: Definitive Edition. But this isn’t just a game—it’s a time machine. It takes me back to my 15-year-old self, sitting in a school uniform, wide-eyed and curious, dreaming of building empires and commanding armies. That child still lives within me, and this game is his playground.\r\n\r\n🏛️ A Kingdom Re-imagined, A Memory Rekindled\r\nThe Definitive Edition doesn’t just polish the graphics or refine the mechanics—it reawakens a deep emotional connection. It’s the same game I fell in love with, now dressed in modern elegance. The thrill of constructing a civilization from scratch, strategizing to outwit opponents, and watching my kingdom flourish still gives me goosebumps. It’s not nostalgia—it’s a living, breathing experience that evolves with me.\r\n\r\n🕉️ A Spiritual Bridge to Ancient India\r\nAs an Indian, I find profound resonance in the game’s historical depth. The echoes of the Indus Valley Civilization and the philosophical undertones of Hinduism subtly weave into my gameplay. It’s more than conquest—it’s dharma, karma, and moksha in digital form. I’m not just playing; I’m embodying the creator, protector, and destroyer—living out a cosmic cycle through pixels and strategy.\r\n\r\n🧠 Escaping the Robotic Routine\r\nIn a world where we often feel like cogs in a machine, Age of Empires offers a radical shift. It’s a simulation, yes—but I’m the one in control. The game becomes a matrix where I dictate the flow of civilization. For those few hours, I’m not bound by deadlines or meetings. I’m alive, aware, and immersed in a world where every decision matters.\r\n\r\n🤖 AI That Keeps You on Your Toes\r\nThe AI in this edition is no pushover. It demands your full attention. A momentary lapse in awareness can cost you dearly. But that’s the beauty of it—it keeps you sharp, engaged, and constantly evolving. Every victory feels earned, every defeat a lesson.\r\n\r\n❤️ A Heartfelt Thank You\r\nTo the brilliant minds at Microsoft and the developers who breathed new life into this classic—thank you. You’ve not just entertained us; you’ve helped us reconnect with ourselves. You’ve turned boredom into brilliance, routine into ritual, and childhood dreams into adult joy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Age of Empires from 1997 is not bad but I prefer Age of Empires 2.\r\n\r\nI like the Sequel Age of Empires 2 better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically a reskin with some QOL updates. Get it on a good sale (50%+)\n\nThings that still annoy me or got worse when compared with the AOE: Gold Edition (1998):\n\n-Unit pathfinding is still horrible, \n-Some of the campaigns have some absurd difficulty ramp (more like a wall). \n-Units still get stuck on each other Units destroy each other (your own catapullts, land and sea can ruin your attack)\n-Units will go haywire on their default stance when an enemy passes by and they'll probably die or get stranded trhough the map.\n\nIt's a good game if you have someone to play with. Against AI is bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE the accesability and the wide veriety of things to do and honestly has the best mechenics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its realy fun my kid loves it its good for history and homeschool",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is very much enjoyable in single-player mode, especially if you want to mess around with cheats from the decades past. There are some custom campaigns available online if you want to play it; some are single missions though. The AI and the pathfinding leave much to be desired, but I guess the devs wanted to preserve some form of antiquity when they envisioned this remaster years ago.\r\n\r\nDefinitely worth buying on sale, and a good time-waster if you're waiting around while doing stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "faithful remaster of the old version, still nostalgic and yet refined",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played AoE since the second one and it has always been a cool game to play even while watching tv :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mainly bought this game for nostagia and I play with cheats so this won't be a fair. However, I would say that this is a pretty basic RTS with no to little difference between the factions, no real story for the campaigns and I prefer the menus, breifings and UI from the orginal. But the animations look nice,(especially the destroyed building ones\n), there's a whole campaign to theach you how to play like with Trading and how to use priest, and they added difficulty settings for new players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of improvements over the 90s version. I enjoy it a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blast from the past! such a good game hours of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game but community here is not that active like in AOEII",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "strategy and very challenging but enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed the original AoE and RoR expansion back in the day, this is the game for you. Very little is changed in terms of AI and pathfinding, so if you are looking for that, I would instead recommend AoE II. However, if you enjoyed the original, this is great game for a nostalgia trip, very little has changed except a major improvement to the graphics.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Classic done right! The gameplay is almost exactly as it used to be!\r\n\r\nPS: They reworked the AI too, so it'll be a tad challenging...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I first got this game out of a box of Nutrigrain and I continue to love it until this day. Works flawlessly on Linux Mint.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "The only reason I purchased this game is because I'm a masochist completionist with OCD. \nIs it good? NO.\nThis game is absolute shit, The movements and path tracking are the worst I have ever experienced, the mechanics are clunky as fuck, the standard difficulty somehow manages to be as hard as Dark Souls', the story is nonexistent, the Ai is a fucking joke, and finally, the UI is bullshit. \nAm I gonna finish it even though it took me over 11 hours to finish the first mission? YES.\nAm I into BDSM? ALSO YES.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR Age 1 good, but Age 1 IN Age 2 even better, like stuffed crust pepperoni. Or garlic stuffed olives. Or-\r\n\r\nFirst off let me say that there isn't really anything wrong with the game, it's very good actually and incredibly nostalgic, really the only reason to leave a negative review is purely because this version is pretty much obsolete. You can play the base game AoE 1 campaigns, alongside three brand new ones, in AoE 2 DE with the Return to Rome DLC, and play the extra campaigns from the original Rise of Rome expansion with the Steam Workshop. This matters because AoE 2 is frankly much better and easier to play with tons of QoL improvements this version is missing. Not only that but AoE 2 has a much healthier, consistent player base for online play.\r\n\r\nThat being said, if you're a purist seeking the (mostly) unfiltered experience of AoE 1 without any of the AoE 2 bells and whistles, this is the way to go (I believe this version of AoE 1 technically has higher graphic fidelity as well, if you care about that). And again, the game still kicks ass, it's just that now there's an alternative that's pretty much a strict upgrade. Still love you, AoE 1 <3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tan bueno que estaria si tan solo le pusieran el mismo sistema para organizar unidades como en el 2.\nNo necesita nada mas, pero la verdad asi como esta es pura nostalgia y ya.\nSi no creciste jugando lo la verdad pasa de largo, no vale la pena.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Age of Empires: Definitive Edition is a downgrade. Ugly GUI, subpar soundtrack. Just leave the old games in the past.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder than the original game - the AI has changed.  I loved the original AoE but am giving up on the remaster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get Gold edition and Upatch HD. Much better than this cash grab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is so much worse than I remember it being",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage devs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The pathfinding is horrible, being unable to add new units to an existing group like any other AOE sucks too. Only get this if it's on a $5 or below deal.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "TL;DR Age 1 good, but Age 1 IN Age 2 even better, like stuffed crust pepperoni. Or garlic stuffed olives. Or-\r\n\r\nFirst off let me say that there isn't really anything wrong with the game, it's very good actually and incredibly nostalgic, really the only reason to leave a negative review is purely because this version is pretty much obsolete. You can play the base game AoE 1 campaigns, alongside three brand new ones, in AoE 2 DE with the Return to Rome DLC, and play the extra campaigns from the original Rise of Rome expansion with the Steam Workshop. This matters because AoE 2 is frankly much better and easier to play with tons of QoL improvements this version is missing. Not only that but AoE 2 has a much healthier, consistent player base for online play.\r\n\r\nThat being said, if you're a purist seeking the (mostly) unfiltered experience of AoE 1 without any of the AoE 2 bells and whistles, this is the way to go (I believe this version of AoE 1 technically has higher graphic fidelity as well, if you care about that). And again, the game still kicks ass, it's just that now there's an alternative that's pretty much a strict upgrade. Still love you, AoE 1 <3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only reason I purchased this game is because I'm a masochist completionist with OCD. \nIs it good? NO.\nThis game is absolute shit, The movements and path tracking are the worst I have ever experienced, the mechanics are clunky as fuck, the standard difficulty somehow manages to be as hard as Dark Souls', the story is nonexistent, the Ai is a fucking joke, and finally, the UI is bullshit. \nAm I gonna finish it even though it took me over 11 hours to finish the first mission? YES.\nAm I into BDSM? ALSO YES.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I play for 11h still tryng to complete 1st mision just because enemy have infinive resourse. 10k wood and 10k foog is not enough to beat them. I will just skip this and play AoE2 and aoe4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This edition makes the game looks pretty and it has some minor improvements, but even playing this game with nostalgia included (as I played the original demo and full game long ago), it feels dated, unlike other entries in the series this one just doesn't feel much fun to play at all. Buggy pathfinding, messy AI that have units behaving erratically and often. For a definitive edition, this game needed more quality of life improvements to bring it up to modern standards, in fact I would have preferred to keep older graphics but improve everything else if I had to choose one or the other. As it stands now, maybe some nostalgic people will find some joy in it, but I would highly recommend people to skip it and go after any of the other AoE games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Missing cinematics (as in, they've all been completely removed), bad pathfinding, screenreading AI that uses high APM individual unit tactics that would be impossible for a human to pull off to artificially add difficulty in the laziest developer way possible. Remapped versions of every scenario do not stay true to the original version at all and the difficulty has been heavily skewed away from the massive army and resource tactics that existed prior in exchange for low unit count, constant conflict/tower defense gameplay that takes out everything we enjoyed about the series and replaces it with a beautiful upgraded graphic theme that's hard to argue with, but even harder to justify\n\nIt's clear at this point we won't see a true to spirit remake of any of the Age of Empires games, hopefully a new RTS superstar shows up soon because this one burned out a long time ago",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to try remaster of first AoE game and finish campaigns. Though graphic looks very well and it is definitely big positive difference from the original, it is only positive thing I can say about the game.\n\nTechnology system remains the same. Who doesn't know, technology system is really weird - you research towers in granary (food storage), armor in storage pit, marketplace is building, where you research agriculture, and so on. In second game, this is highly improved. It just doesn't make any sense.\n\nPlaying campaigns was really pain. And here is main and only reason why it sucked and why whole singleplayer experience is just bad: AI and NPC movement is terrible and though it's not completely game breaking, It is trully annoying. Eg.: units are not transparent so they often get frozen on place, because their path of movement is disrupted, units very often choose not shortest way from A to B, but way to point B is very random, almost chaotic, enemy AI sometimes tends to rush you right from the beginning of map.\n\nIf you want mainly play campaign (as me), my advice is to skip this game even on discount. Rather download somewhere the original from 1997 (it looks worse, but AI and NPC movement is normal) or buy AoEII:DE, which also has DLC inluding campaigns from first game.\n\nEven if you are intersted in multiplayer, I recommend you rather go to Age of Empires II.\n\nDon't buy it!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had a lot of fun playing this. every here and there there were problems with saved games, did the most basic things that should solve most problems, didn't work. Still had fun, so I put it aside. The more time passed, the more the problams enhanced. Started using more serius things to handle it, it looked fix, but after a short amount of time it went back to how it was. After doing a lot, and I mean a lot of cleaning of stuff related to it, verified integrity of files and more, when it comes to saved games, it stayed the same. Now it's not even letting me play any saved game. I had a really good time, but after all the things I've done trying to fix it, I'm just flabbergasted. It's very overpriced, the least you could do is make it work.\nHuge disappointment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The control of units is quite frustrating in this 1st version of the Age of Empire Series.  It is clumsy and makes the game difficult to play.  Skip this one and try II or III",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible remaster. Maximum limit of ALL units is only 50 (including workers, ships and warriors). There is no option to remove unnecessary units. In single player campaign a big imbalance, even on easy level the enemy with destroyed economy spawn units and come from behind the map. The developers didn't even bother to make some skins for multiple buildings like houses. This is not a remaster, the game will still be a game from 1997 at its worst.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tan bueno que estaria si tan solo le pusieran el mismo sistema para organizar unidades como en el 2.\nNo necesita nada mas, pero la verdad asi como esta es pura nostalgia y ya.\nSi no creciste jugando lo la verdad pasa de largo, no vale la pena.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game. You will waste toooo much of your life on Voices of Babylon. That missions is trash all around even on the easiest difficulties. Age 2 is much better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is nothing wrong with it - except for the fact that the Return of Rome expansion for AoE2 is the same thing but better. Only buy this if you:\nA. Are really keen to play the campaigns from the original (RoR only has a few of them and a couple of new ones)\nB. Really don't want to buy AoE2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder than the original game - the AI has changed.  I loved the original AoE but am giving up on the remaster.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have to dislike this new Age of Empires because:\r\n\r\n- Heroes can be converted.\r\n\r\n- Heroes who must survive in a campaign can be converted and thus are such an annoying obstacle. \r\nThe worst case is the Caesar Campaign where Hero Caesar is quickly converted after a few wololos of an enemy priest.\r\nThe third game of the Caeser Campaign is the worst case because the Hero unit cannot run away from the enemy priest since they come from all sides and there is no place to hide Hero Caesar from the enemy priests.\r\n\r\n- Heroes cannot heal themselves.\r\n\r\n- Villagers cannot move into a building and thus are helpless during an ambush.\r\n\r\n- Bugged Units cannot move into a transport ship after clicked on it and then the unit runs away into the opposite direction.\r\n\r\n- Bugged transport ship cannot unload the units onto a clicked on place and unload onto the opposite place.\r\n\r\n- Aggressive Stance of a unit makes the unit run away chasing enemies unintelligently and never return to it's place, usually getting killed.\r\n\r\n- Defensive stances makes the unit helpless against range units with more range than the attacked unit and makes that unit not attacking an enemy who is attacking nearby units.\r\nFor example: Mounted Unit of an enemy attacks Siege Unit and the Academy Unit a few steps away from the attacker and Siege Unit is just standing around and not attacking the enemy.\r\n\r\n- When Siege Units are in Defensive Stance, then they might move to the place of the destroyed enemy building they have attacked and thus they get shot by towers who are out of their range.\r\n\r\n- There is no Stance where a Unit attacks an enemy who is attacking the Unit or it's ally regardless of the range and the returning to it's place after the fight is over.\r\n\r\n- Stone throwing units are unintelligent by attacking automatically enemies next to an allied unit and thus killing the allied unit.\r\n\r\n- The Priests automatically chase wounded units instead of standing still and they chase them, if the units run into battle too. The Priests then also run into battle because of chasing the wounded unit for healing.\r\n\r\n- In the market place is the technology for the range improvement of the arrow units and that technology is tied to wood carrying and wood chopping technology, which is absurd.\r\n\r\n- The Choson Legion has less HP than the Choson Legion in the old Age of Empires.\r\n\r\n- The Heavy Catapult of the Hittites has less HP than the Heavy Catapult of the Hittites in the old Age of Empires.\r\n\r\n- The Heavy Horse Archer has 1 Piercing Armor less than the Heavy Horse Archer in the old Age of Empires.\r\n\r\n- The villagers of enemies and allies stand in front of cliffs with ressources onto them which the villagers cannot reach and the villagers stand in front of the cliffs forever until they are killed because the artificial intelligence cannot recognize that the ressources are blocked and thus cannot move on.\r\n\r\n- The villagers of the enemies and allies are wilfully stupid because they never move into a Transport Ship to travel to islands with Gold and Stones to exploit. The villagers of allies and enemies never move into a Transport Ship at all, because the computer is so incompetent.\r\n\r\nIn the old Age of Empires, the Persians cannot develop Wheel which is absurd. The new Age of Empires changed that which was one of the few good improvements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get Gold edition and Upatch HD. Much better than this cash grab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It freezes when launching , than crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My friends and i keep getting disconected from our matches :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The new DLC in AoE2:DE singlehandedly killed off this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so much worse than I remember it being",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Play Gold Edition with the Upatch HD",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage devs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The pathfinding is horrible, being unable to add new units to an existing group like any other AOE sucks too. Only get this if it's on a $5 or below deal.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "TL;DR Age 1 good, but Age 1 IN Age 2 even better, like stuffed crust pepperoni. Or garlic stuffed olives. Or-\r\n\r\nFirst off let me say that there isn't really anything wrong with the game, it's very good actually and incredibly nostalgic, really the only reason to leave a negative review is purely because this version is pretty much obsolete. You can play the base game AoE 1 campaigns, alongside three brand new ones, in AoE 2 DE with the Return to Rome DLC, and play the extra campaigns from the original Rise of Rome expansion with the Steam Workshop. This matters because AoE 2 is frankly much better and easier to play with tons of QoL improvements this version is missing. Not only that but AoE 2 has a much healthier, consistent player base for online play.\r\n\r\nThat being said, if you're a purist seeking the (mostly) unfiltered experience of AoE 1 without any of the AoE 2 bells and whistles, this is the way to go (I believe this version of AoE 1 technically has higher graphic fidelity as well, if you care about that). And again, the game still kicks ass, it's just that now there's an alternative that's pretty much a strict upgrade. Still love you, AoE 1 <3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only reason I purchased this game is because I'm a masochist completionist with OCD. \nIs it good? NO.\nThis game is absolute shit, The movements and path tracking are the worst I have ever experienced, the mechanics are clunky as fuck, the standard difficulty somehow manages to be as hard as Dark Souls', the story is nonexistent, the Ai is a fucking joke, and finally, the UI is bullshit. \nAm I gonna finish it even though it took me over 11 hours to finish the first mission? YES.\nAm I into BDSM? ALSO YES.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I play for 11h still tryng to complete 1st mision just because enemy have infinive resourse. 10k wood and 10k foog is not enough to beat them. I will just skip this and play AoE2 and aoe4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This edition makes the game looks pretty and it has some minor improvements, but even playing this game with nostalgia included (as I played the original demo and full game long ago), it feels dated, unlike other entries in the series this one just doesn't feel much fun to play at all. Buggy pathfinding, messy AI that have units behaving erratically and often. For a definitive edition, this game needed more quality of life improvements to bring it up to modern standards, in fact I would have preferred to keep older graphics but improve everything else if I had to choose one or the other. As it stands now, maybe some nostalgic people will find some joy in it, but I would highly recommend people to skip it and go after any of the other AoE games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Missing cinematics (as in, they've all been completely removed), bad pathfinding, screenreading AI that uses high APM individual unit tactics that would be impossible for a human to pull off to artificially add difficulty in the laziest developer way possible. Remapped versions of every scenario do not stay true to the original version at all and the difficulty has been heavily skewed away from the massive army and resource tactics that existed prior in exchange for low unit count, constant conflict/tower defense gameplay that takes out everything we enjoyed about the series and replaces it with a beautiful upgraded graphic theme that's hard to argue with, but even harder to justify\n\nIt's clear at this point we won't see a true to spirit remake of any of the Age of Empires games, hopefully a new RTS superstar shows up soon because this one burned out a long time ago",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to try remaster of first AoE game and finish campaigns. Though graphic looks very well and it is definitely big positive difference from the original, it is only positive thing I can say about the game.\n\nTechnology system remains the same. Who doesn't know, technology system is really weird - you research towers in granary (food storage), armor in storage pit, marketplace is building, where you research agriculture, and so on. In second game, this is highly improved. It just doesn't make any sense.\n\nPlaying campaigns was really pain. And here is main and only reason why it sucked and why whole singleplayer experience is just bad: AI and NPC movement is terrible and though it's not completely game breaking, It is trully annoying. Eg.: units are not transparent so they often get frozen on place, because their path of movement is disrupted, units very often choose not shortest way from A to B, but way to point B is very random, almost chaotic, enemy AI sometimes tends to rush you right from the beginning of map.\n\nIf you want mainly play campaign (as me), my advice is to skip this game even on discount. Rather download somewhere the original from 1997 (it looks worse, but AI and NPC movement is normal) or buy AoEII:DE, which also has DLC inluding campaigns from first game.\n\nEven if you are intersted in multiplayer, I recommend you rather go to Age of Empires II.\n\nDon't buy it!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had a lot of fun playing this. every here and there there were problems with saved games, did the most basic things that should solve most problems, didn't work. Still had fun, so I put it aside. The more time passed, the more the problams enhanced. Started using more serius things to handle it, it looked fix, but after a short amount of time it went back to how it was. After doing a lot, and I mean a lot of cleaning of stuff related to it, verified integrity of files and more, when it comes to saved games, it stayed the same. Now it's not even letting me play any saved game. I had a really good time, but after all the things I've done trying to fix it, I'm just flabbergasted. It's very overpriced, the least you could do is make it work.\nHuge disappointment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The control of units is quite frustrating in this 1st version of the Age of Empire Series.  It is clumsy and makes the game difficult to play.  Skip this one and try II or III",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible remaster. Maximum limit of ALL units is only 50 (including workers, ships and warriors). There is no option to remove unnecessary units. In single player campaign a big imbalance, even on easy level the enemy with destroyed economy spawn units and come from behind the map. The developers didn't even bother to make some skins for multiple buildings like houses. This is not a remaster, the game will still be a game from 1997 at its worst.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tan bueno que estaria si tan solo le pusieran el mismo sistema para organizar unidades como en el 2.\nNo necesita nada mas, pero la verdad asi como esta es pura nostalgia y ya.\nSi no creciste jugando lo la verdad pasa de largo, no vale la pena.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game. You will waste toooo much of your life on Voices of Babylon. That missions is trash all around even on the easiest difficulties. Age 2 is much better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is nothing wrong with it - except for the fact that the Return of Rome expansion for AoE2 is the same thing but better. Only buy this if you:\nA. Are really keen to play the campaigns from the original (RoR only has a few of them and a couple of new ones)\nB. Really don't want to buy AoE2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder than the original game - the AI has changed.  I loved the original AoE but am giving up on the remaster.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have to dislike this new Age of Empires because:\r\n\r\n- Heroes can be converted.\r\n\r\n- Heroes who must survive in a campaign can be converted and thus are such an annoying obstacle. \r\nThe worst case is the Caesar Campaign where Hero Caesar is quickly converted after a few wololos of an enemy priest.\r\nThe third game of the Caeser Campaign is the worst case because the Hero unit cannot run away from the enemy priest since they come from all sides and there is no place to hide Hero Caesar from the enemy priests.\r\n\r\n- Heroes cannot heal themselves.\r\n\r\n- Villagers cannot move into a building and thus are helpless during an ambush.\r\n\r\n- Bugged Units cannot move into a transport ship after clicked on it and then the unit runs away into the opposite direction.\r\n\r\n- Bugged transport ship cannot unload the units onto a clicked on place and unload onto the opposite place.\r\n\r\n- Aggressive Stance of a unit makes the unit run away chasing enemies unintelligently and never return to it's place, usually getting killed.\r\n\r\n- Defensive stances makes the unit helpless against range units with more range than the attacked unit and makes that unit not attacking an enemy who is attacking nearby units.\r\nFor example: Mounted Unit of an enemy attacks Siege Unit and the Academy Unit a few steps away from the attacker and Siege Unit is just standing around and not attacking the enemy.\r\n\r\n- When Siege Units are in Defensive Stance, then they might move to the place of the destroyed enemy building they have attacked and thus they get shot by towers who are out of their range.\r\n\r\n- There is no Stance where a Unit attacks an enemy who is attacking the Unit or it's ally regardless of the range and the returning to it's place after the fight is over.\r\n\r\n- Stone throwing units are unintelligent by attacking automatically enemies next to an allied unit and thus killing the allied unit.\r\n\r\n- The Priests automatically chase wounded units instead of standing still and they chase them, if the units run into battle too. The Priests then also run into battle because of chasing the wounded unit for healing.\r\n\r\n- In the market place is the technology for the range improvement of the arrow units and that technology is tied to wood carrying and wood chopping technology, which is absurd.\r\n\r\n- The Choson Legion has less HP than the Choson Legion in the old Age of Empires.\r\n\r\n- The Heavy Catapult of the Hittites has less HP than the Heavy Catapult of the Hittites in the old Age of Empires.\r\n\r\n- The Heavy Horse Archer has 1 Piercing Armor less than the Heavy Horse Archer in the old Age of Empires.\r\n\r\n- The villagers of enemies and allies stand in front of cliffs with ressources onto them which the villagers cannot reach and the villagers stand in front of the cliffs forever until they are killed because the artificial intelligence cannot recognize that the ressources are blocked and thus cannot move on.\r\n\r\n- The villagers of the enemies and allies are wilfully stupid because they never move into a Transport Ship to travel to islands with Gold and Stones to exploit. The villagers of allies and enemies never move into a Transport Ship at all, because the computer is so incompetent.\r\n\r\nIn the old Age of Empires, the Persians cannot develop Wheel which is absurd. The new Age of Empires changed that which was one of the few good improvements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get Gold edition and Upatch HD. Much better than this cash grab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It freezes when launching , than crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My friends and i keep getting disconected from our matches :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The new DLC in AoE2:DE singlehandedly killed off this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so much worse than I remember it being",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Play Gold Edition with the Upatch HD",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage devs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The pathfinding is horrible, being unable to add new units to an existing group like any other AOE sucks too. Only get this if it's on a $5 or below deal.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "TL;DR Age 1 good, but Age 1 IN Age 2 even better, like stuffed crust pepperoni. Or garlic stuffed olives. Or-\r\n\r\nFirst off let me say that there isn't really anything wrong with the game, it's very good actually and incredibly nostalgic, really the only reason to leave a negative review is purely because this version is pretty much obsolete. You can play the base game AoE 1 campaigns, alongside three brand new ones, in AoE 2 DE with the Return to Rome DLC, and play the extra campaigns from the original Rise of Rome expansion with the Steam Workshop. This matters because AoE 2 is frankly much better and easier to play with tons of QoL improvements this version is missing. Not only that but AoE 2 has a much healthier, consistent player base for online play.\r\n\r\nThat being said, if you're a purist seeking the (mostly) unfiltered experience of AoE 1 without any of the AoE 2 bells and whistles, this is the way to go (I believe this version of AoE 1 technically has higher graphic fidelity as well, if you care about that). And again, the game still kicks ass, it's just that now there's an alternative that's pretty much a strict upgrade. Still love you, AoE 1 <3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only reason I purchased this game is because I'm a masochist completionist with OCD. \nIs it good? NO.\nThis game is absolute shit, The movements and path tracking are the worst I have ever experienced, the mechanics are clunky as fuck, the standard difficulty somehow manages to be as hard as Dark Souls', the story is nonexistent, the Ai is a fucking joke, and finally, the UI is bullshit. \nAm I gonna finish it even though it took me over 11 hours to finish the first mission? YES.\nAm I into BDSM? ALSO YES.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I play for 11h still tryng to complete 1st mision just because enemy have infinive resourse. 10k wood and 10k foog is not enough to beat them. I will just skip this and play AoE2 and aoe4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This edition makes the game looks pretty and it has some minor improvements, but even playing this game with nostalgia included (as I played the original demo and full game long ago), it feels dated, unlike other entries in the series this one just doesn't feel much fun to play at all. Buggy pathfinding, messy AI that have units behaving erratically and often. For a definitive edition, this game needed more quality of life improvements to bring it up to modern standards, in fact I would have preferred to keep older graphics but improve everything else if I had to choose one or the other. As it stands now, maybe some nostalgic people will find some joy in it, but I would highly recommend people to skip it and go after any of the other AoE games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Missing cinematics (as in, they've all been completely removed), bad pathfinding, screenreading AI that uses high APM individual unit tactics that would be impossible for a human to pull off to artificially add difficulty in the laziest developer way possible. Remapped versions of every scenario do not stay true to the original version at all and the difficulty has been heavily skewed away from the massive army and resource tactics that existed prior in exchange for low unit count, constant conflict/tower defense gameplay that takes out everything we enjoyed about the series and replaces it with a beautiful upgraded graphic theme that's hard to argue with, but even harder to justify\n\nIt's clear at this point we won't see a true to spirit remake of any of the Age of Empires games, hopefully a new RTS superstar shows up soon because this one burned out a long time ago",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to try remaster of first AoE game and finish campaigns. Though graphic looks very well and it is definitely big positive difference from the original, it is only positive thing I can say about the game.\n\nTechnology system remains the same. Who doesn't know, technology system is really weird - you research towers in granary (food storage), armor in storage pit, marketplace is building, where you research agriculture, and so on. In second game, this is highly improved. It just doesn't make any sense.\n\nPlaying campaigns was really pain. And here is main and only reason why it sucked and why whole singleplayer experience is just bad: AI and NPC movement is terrible and though it's not completely game breaking, It is trully annoying. Eg.: units are not transparent so they often get frozen on place, because their path of movement is disrupted, units very often choose not shortest way from A to B, but way to point B is very random, almost chaotic, enemy AI sometimes tends to rush you right from the beginning of map.\n\nIf you want mainly play campaign (as me), my advice is to skip this game even on discount. Rather download somewhere the original from 1997 (it looks worse, but AI and NPC movement is normal) or buy AoEII:DE, which also has DLC inluding campaigns from first game.\n\nEven if you are intersted in multiplayer, I recommend you rather go to Age of Empires II.\n\nDon't buy it!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had a lot of fun playing this. every here and there there were problems with saved games, did the most basic things that should solve most problems, didn't work. Still had fun, so I put it aside. The more time passed, the more the problams enhanced. Started using more serius things to handle it, it looked fix, but after a short amount of time it went back to how it was. After doing a lot, and I mean a lot of cleaning of stuff related to it, verified integrity of files and more, when it comes to saved games, it stayed the same. Now it's not even letting me play any saved game. I had a really good time, but after all the things I've done trying to fix it, I'm just flabbergasted. It's very overpriced, the least you could do is make it work.\nHuge disappointment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The control of units is quite frustrating in this 1st version of the Age of Empire Series.  It is clumsy and makes the game difficult to play.  Skip this one and try II or III",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible remaster. Maximum limit of ALL units is only 50 (including workers, ships and warriors). There is no option to remove unnecessary units. In single player campaign a big imbalance, even on easy level the enemy with destroyed economy spawn units and come from behind the map. The developers didn't even bother to make some skins for multiple buildings like houses. This is not a remaster, the game will still be a game from 1997 at its worst.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tan bueno que estaria si tan solo le pusieran el mismo sistema para organizar unidades como en el 2.\nNo necesita nada mas, pero la verdad asi como esta es pura nostalgia y ya.\nSi no creciste jugando lo la verdad pasa de largo, no vale la pena.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game. You will waste toooo much of your life on Voices of Babylon. That missions is trash all around even on the easiest difficulties. Age 2 is much better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is nothing wrong with it - except for the fact that the Return of Rome expansion for AoE2 is the same thing but better. Only buy this if you:\nA. Are really keen to play the campaigns from the original (RoR only has a few of them and a couple of new ones)\nB. Really don't want to buy AoE2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder than the original game - the AI has changed.  I loved the original AoE but am giving up on the remaster.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have to dislike this new Age of Empires because:\r\n\r\n- Heroes can be converted.\r\n\r\n- Heroes who must survive in a campaign can be converted and thus are such an annoying obstacle. \r\nThe worst case is the Caesar Campaign where Hero Caesar is quickly converted after a few wololos of an enemy priest.\r\nThe third game of the Caeser Campaign is the worst case because the Hero unit cannot run away from the enemy priest since they come from all sides and there is no place to hide Hero Caesar from the enemy priests.\r\n\r\n- Heroes cannot heal themselves.\r\n\r\n- Villagers cannot move into a building and thus are helpless during an ambush.\r\n\r\n- Bugged Units cannot move into a transport ship after clicked on it and then the unit runs away into the opposite direction.\r\n\r\n- Bugged transport ship cannot unload the units onto a clicked on place and unload onto the opposite place.\r\n\r\n- Aggressive Stance of a unit makes the unit run away chasing enemies unintelligently and never return to it's place, usually getting killed.\r\n\r\n- Defensive stances makes the unit helpless against range units with more range than the attacked unit and makes that unit not attacking an enemy who is attacking nearby units.\r\nFor example: Mounted Unit of an enemy attacks Siege Unit and the Academy Unit a few steps away from the attacker and Siege Unit is just standing around and not attacking the enemy.\r\n\r\n- When Siege Units are in Defensive Stance, then they might move to the place of the destroyed enemy building they have attacked and thus they get shot by towers who are out of their range.\r\n\r\n- There is no Stance where a Unit attacks an enemy who is attacking the Unit or it's ally regardless of the range and the returning to it's place after the fight is over.\r\n\r\n- Stone throwing units are unintelligent by attacking automatically enemies next to an allied unit and thus killing the allied unit.\r\n\r\n- The Priests automatically chase wounded units instead of standing still and they chase them, if the units run into battle too. The Priests then also run into battle because of chasing the wounded unit for healing.\r\n\r\n- In the market place is the technology for the range improvement of the arrow units and that technology is tied to wood carrying and wood chopping technology, which is absurd.\r\n\r\n- The Choson Legion has less HP than the Choson Legion in the old Age of Empires.\r\n\r\n- The Heavy Catapult of the Hittites has less HP than the Heavy Catapult of the Hittites in the old Age of Empires.\r\n\r\n- The Heavy Horse Archer has 1 Piercing Armor less than the Heavy Horse Archer in the old Age of Empires.\r\n\r\n- The villagers of enemies and allies stand in front of cliffs with ressources onto them which the villagers cannot reach and the villagers stand in front of the cliffs forever until they are killed because the artificial intelligence cannot recognize that the ressources are blocked and thus cannot move on.\r\n\r\n- The villagers of the enemies and allies are wilfully stupid because they never move into a Transport Ship to travel to islands with Gold and Stones to exploit. The villagers of allies and enemies never move into a Transport Ship at all, because the computer is so incompetent.\r\n\r\nIn the old Age of Empires, the Persians cannot develop Wheel which is absurd. The new Age of Empires changed that which was one of the few good improvements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get Gold edition and Upatch HD. Much better than this cash grab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It freezes when launching , than crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My friends and i keep getting disconected from our matches :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The new DLC in AoE2:DE singlehandedly killed off this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so much worse than I remember it being",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Play Gold Edition with the Upatch HD",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage devs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The pathfinding is horrible, being unable to add new units to an existing group like any other AOE sucks too. Only get this if it's on a $5 or below deal.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "TL;DR Age 1 good, but Age 1 IN Age 2 even better, like stuffed crust pepperoni. Or garlic stuffed olives. Or-\r\n\r\nFirst off let me say that there isn't really anything wrong with the game, it's very good actually and incredibly nostalgic, really the only reason to leave a negative review is purely because this version is pretty much obsolete. You can play the base game AoE 1 campaigns, alongside three brand new ones, in AoE 2 DE with the Return to Rome DLC, and play the extra campaigns from the original Rise of Rome expansion with the Steam Workshop. This matters because AoE 2 is frankly much better and easier to play with tons of QoL improvements this version is missing. Not only that but AoE 2 has a much healthier, consistent player base for online play.\r\n\r\nThat being said, if you're a purist seeking the (mostly) unfiltered experience of AoE 1 without any of the AoE 2 bells and whistles, this is the way to go (I believe this version of AoE 1 technically has higher graphic fidelity as well, if you care about that). And again, the game still kicks ass, it's just that now there's an alternative that's pretty much a strict upgrade. Still love you, AoE 1 <3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only reason I purchased this game is because I'm a masochist completionist with OCD. \nIs it good? NO.\nThis game is absolute shit, The movements and path tracking are the worst I have ever experienced, the mechanics are clunky as fuck, the standard difficulty somehow manages to be as hard as Dark Souls', the story is nonexistent, the Ai is a fucking joke, and finally, the UI is bullshit. \nAm I gonna finish it even though it took me over 11 hours to finish the first mission? YES.\nAm I into BDSM? ALSO YES.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I play for 11h still tryng to complete 1st mision just because enemy have infinive resourse. 10k wood and 10k foog is not enough to beat them. I will just skip this and play AoE2 and aoe4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This edition makes the game looks pretty and it has some minor improvements, but even playing this game with nostalgia included (as I played the original demo and full game long ago), it feels dated, unlike other entries in the series this one just doesn't feel much fun to play at all. Buggy pathfinding, messy AI that have units behaving erratically and often. For a definitive edition, this game needed more quality of life improvements to bring it up to modern standards, in fact I would have preferred to keep older graphics but improve everything else if I had to choose one or the other. As it stands now, maybe some nostalgic people will find some joy in it, but I would highly recommend people to skip it and go after any of the other AoE games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Missing cinematics (as in, they've all been completely removed), bad pathfinding, screenreading AI that uses high APM individual unit tactics that would be impossible for a human to pull off to artificially add difficulty in the laziest developer way possible. Remapped versions of every scenario do not stay true to the original version at all and the difficulty has been heavily skewed away from the massive army and resource tactics that existed prior in exchange for low unit count, constant conflict/tower defense gameplay that takes out everything we enjoyed about the series and replaces it with a beautiful upgraded graphic theme that's hard to argue with, but even harder to justify\n\nIt's clear at this point we won't see a true to spirit remake of any of the Age of Empires games, hopefully a new RTS superstar shows up soon because this one burned out a long time ago",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to try remaster of first AoE game and finish campaigns. Though graphic looks very well and it is definitely big positive difference from the original, it is only positive thing I can say about the game.\n\nTechnology system remains the same. Who doesn't know, technology system is really weird - you research towers in granary (food storage), armor in storage pit, marketplace is building, where you research agriculture, and so on. In second game, this is highly improved. It just doesn't make any sense.\n\nPlaying campaigns was really pain. And here is main and only reason why it sucked and why whole singleplayer experience is just bad: AI and NPC movement is terrible and though it's not completely game breaking, It is trully annoying. Eg.: units are not transparent so they often get frozen on place, because their path of movement is disrupted, units very often choose not shortest way from A to B, but way to point B is very random, almost chaotic, enemy AI sometimes tends to rush you right from the beginning of map.\n\nIf you want mainly play campaign (as me), my advice is to skip this game even on discount. Rather download somewhere the original from 1997 (it looks worse, but AI and NPC movement is normal) or buy AoEII:DE, which also has DLC inluding campaigns from first game.\n\nEven if you are intersted in multiplayer, I recommend you rather go to Age of Empires II.\n\nDon't buy it!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had a lot of fun playing this. every here and there there were problems with saved games, did the most basic things that should solve most problems, didn't work. Still had fun, so I put it aside. The more time passed, the more the problams enhanced. Started using more serius things to handle it, it looked fix, but after a short amount of time it went back to how it was. After doing a lot, and I mean a lot of cleaning of stuff related to it, verified integrity of files and more, when it comes to saved games, it stayed the same. Now it's not even letting me play any saved game. I had a really good time, but after all the things I've done trying to fix it, I'm just flabbergasted. It's very overpriced, the least you could do is make it work.\nHuge disappointment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The control of units is quite frustrating in this 1st version of the Age of Empire Series.  It is clumsy and makes the game difficult to play.  Skip this one and try II or III",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible remaster. Maximum limit of ALL units is only 50 (including workers, ships and warriors). There is no option to remove unnecessary units. In single player campaign a big imbalance, even on easy level the enemy with destroyed economy spawn units and come from behind the map. The developers didn't even bother to make some skins for multiple buildings like houses. This is not a remaster, the game will still be a game from 1997 at its worst.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tan bueno que estaria si tan solo le pusieran el mismo sistema para organizar unidades como en el 2.\nNo necesita nada mas, pero la verdad asi como esta es pura nostalgia y ya.\nSi no creciste jugando lo la verdad pasa de largo, no vale la pena.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game. You will waste toooo much of your life on Voices of Babylon. That missions is trash all around even on the easiest difficulties. Age 2 is much better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is nothing wrong with it - except for the fact that the Return of Rome expansion for AoE2 is the same thing but better. Only buy this if you:\nA. Are really keen to play the campaigns from the original (RoR only has a few of them and a couple of new ones)\nB. Really don't want to buy AoE2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much harder than the original game - the AI has changed.  I loved the original AoE but am giving up on the remaster.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have to dislike this new Age of Empires because:\r\n\r\n- Heroes can be converted.\r\n\r\n- Heroes who must survive in a campaign can be converted and thus are such an annoying obstacle. \r\nThe worst case is the Caesar Campaign where Hero Caesar is quickly converted after a few wololos of an enemy priest.\r\nThe third game of the Caeser Campaign is the worst case because the Hero unit cannot run away from the enemy priest since they come from all sides and there is no place to hide Hero Caesar from the enemy priests.\r\n\r\n- Heroes cannot heal themselves.\r\n\r\n- Villagers cannot move into a building and thus are helpless during an ambush.\r\n\r\n- Bugged Units cannot move into a transport ship after clicked on it and then the unit runs away into the opposite direction.\r\n\r\n- Bugged transport ship cannot unload the units onto a clicked on place and unload onto the opposite place.\r\n\r\n- Aggressive Stance of a unit makes the unit run away chasing enemies unintelligently and never return to it's place, usually getting killed.\r\n\r\n- Defensive stances makes the unit helpless against range units with more range than the attacked unit and makes that unit not attacking an enemy who is attacking nearby units.\r\nFor example: Mounted Unit of an enemy attacks Siege Unit and the Academy Unit a few steps away from the attacker and Siege Unit is just standing around and not attacking the enemy.\r\n\r\n- When Siege Units are in Defensive Stance, then they might move to the place of the destroyed enemy building they have attacked and thus they get shot by towers who are out of their range.\r\n\r\n- There is no Stance where a Unit attacks an enemy who is attacking the Unit or it's ally regardless of the range and the returning to it's place after the fight is over.\r\n\r\n- Stone throwing units are unintelligent by attacking automatically enemies next to an allied unit and thus killing the allied unit.\r\n\r\n- The Priests automatically chase wounded units instead of standing still and they chase them, if the units run into battle too. The Priests then also run into battle because of chasing the wounded unit for healing.\r\n\r\n- In the market place is the technology for the range improvement of the arrow units and that technology is tied to wood carrying and wood chopping technology, which is absurd.\r\n\r\n- The Choson Legion has less HP than the Choson Legion in the old Age of Empires.\r\n\r\n- The Heavy Catapult of the Hittites has less HP than the Heavy Catapult of the Hittites in the old Age of Empires.\r\n\r\n- The Heavy Horse Archer has 1 Piercing Armor less than the Heavy Horse Archer in the old Age of Empires.\r\n\r\n- The villagers of enemies and allies stand in front of cliffs with ressources onto them which the villagers cannot reach and the villagers stand in front of the cliffs forever until they are killed because the artificial intelligence cannot recognize that the ressources are blocked and thus cannot move on.\r\n\r\n- The villagers of the enemies and allies are wilfully stupid because they never move into a Transport Ship to travel to islands with Gold and Stones to exploit. The villagers of allies and enemies never move into a Transport Ship at all, because the computer is so incompetent.\r\n\r\nIn the old Age of Empires, the Persians cannot develop Wheel which is absurd. The new Age of Empires changed that which was one of the few good improvements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get Gold edition and Upatch HD. Much better than this cash grab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It freezes when launching , than crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My friends and i keep getting disconected from our matches :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The new DLC in AoE2:DE singlehandedly killed off this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so much worse than I remember it being",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Play Gold Edition with the Upatch HD",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage devs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The pathfinding is horrible, being unable to add new units to an existing group like any other AOE sucks too. Only get this if it's on a $5 or below deal.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "TL;DR Age 1 good, but Age 1 IN Age 2 even better, like stuffed crust pepperoni. Or garlic stuffed olives. Or-\r\n\r\nFirst off let me say that there isn't really anything wrong with the game, it's very good actually and incredibly nostalgic, really the only reason to leave a negative review is purely because this version is pretty much obsolete. You can play the base game AoE 1 campaigns, alongside three brand new ones, in AoE 2 DE with the Return to Rome DLC, and play the extra campaigns from the original Rise of Rome expansion with the Steam Workshop. This matters because AoE 2 is frankly much better and easier to play with tons of QoL improvements this version is missing. Not only that but AoE 2 has a much healthier, consistent player base for online play.\r\n\r\nThat being said, if you're a purist seeking the (mostly) unfiltered experience of AoE 1 without any of the AoE 2 bells and whistles, this is the way to go (I believe this version of AoE 1 technically has higher graphic fidelity as well, if you care about that). And again, the game still kicks ass, it's just that now there's an alternative that's pretty much a strict upgrade. Still love you, AoE 1 <3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only reason I purchased this game is because I'm a masochist completionist with OCD. \nIs it good? NO.\nThis game is absolute shit, The movements and path tracking are the worst I have ever experienced, the mechanics are clunky as fuck, the standard difficulty somehow manages to be as hard as Dark Souls', the story is nonexistent, the Ai is a fucking joke, and finally, the UI is bullshit. \nAm I gonna finish it even though it took me over 11 hours to finish the first mission? YES.\nAm I into BDSM? ALSO YES.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I play for 11h still tryng to complete 1st mision just because enemy have infinive resourse. 10k wood and 10k foog is not enough to beat them. I will just skip this and play AoE2 and aoe4.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}