{
  "positive": [
    {
      "review": "i am a casual gamer, i hate difficulty, i suck at fighting, i don't strategize, i don't know any of the hollow knight lore and ragequit that game years ago because it was too hard. silksong is one of the greatest games i have ever played.\n\ni like that you can go poshanka together too",
      "voted_up": true,
      "votes_helpful": 674
    },
    {
      "review": "Silksong does what Hollow Knight did well way better, and some things it did badly worse.\n\nPositives:\n\n• Fantastic art design on just about everything, far more varied than Hollow Knight and full of little details.\n• Very satisfying and varied platforming. While there isn't a full on White Palace/ Path of Pain section, similarly challenging platforming bursts are weaved throughout the game.\n• The crests, Silk skills and tools offer great gameplay variety.\n• Very well designed world packed with NPCs.\n• Enjoyable questing system although it does accentuate the backtracking and back & forth aspects which I don't like very much but it is nowhere near as bad as Hollow Knight.\n• Intuitive world design. In Hollow Knight, if you are playing without a guide, it is incredibly easy to get lost for hours on end, trying to find the next upgrade. So much needless backtracking and padding because of that. Not a problem in Silksong.\n\nMixed:\n• The soundtrack is great BUT tracks are on average shorter than Hollow Knight's. Not sure why the composer chose to go with that direction but I'm hoping it'll change for the updates/ DLC.\n\nNegatives:\n• Near every negative in Silksong can be chalked up to what I call excessive TCT - Team Cherry Trolling™. It is there on every step of the way whereas in HK such moments would be a little less frequent: \n- Traps/ even more enemies after already arduous platforming or fighting sections, you don't get a single break really.\n- Bosses that have arenas with debilitating effects (like Maggots, preventing healing), no platforms to stand on at all, add spam DURING boss fights and whole Colosseum-like gauntlets before you can even fight the actual bosses. Other bosses that'd be finely designed, have some extreme visual clutter (Trobbio) or otherwise poorly visible attacks (Lost Lace).\n- Extremely and I mean incessantly annoying flying enemy design, I do not understand what they were thinking when they made enemies that fly away from you constantly, input read your jumps and movement direction for their projectiles and freak around like they are on meth.\n- Cumbersome design = difficulty, apparently. The lack of QoL is very real. I do not understand why Team Cherry still think not displaying your position on the map or withholding the ability to autocollect resources that drop from enemies, basic game features present in like every other game, should be locked behind equipables? Why don't maps update in real time as well? Just unnecessary padding.\n• A negative that isn't specific to Team Cherry as it is present in other 2D games as well, it is however handled horribly in both Hollow Knight games: contact damage. In most other games that have CD, you have to misplay really badly and find yourself inside the enemy to be damaged. Or it could be the version of contact damage I actually like, where it is only active around whatever enemies/ bosses use as a weapon. In Hollow Knight and Silksong on the other hand, touching any single pixel of any enemy or boss at any time will immediately hurt you, sometimes even for 2 Masks worth of damage. You do not pair a system like that with enemies that move erratically and love to jump/ teleport on you, it cheapened the difficulty in HK, Silksong is no different in that regard.\n\nAll in all Silksong is an amazing game that is well worth your time when the experience isn't being dragged down by Team Cherry's juvenile trolling attempts, that I honestly thought they'd grow out of considering they were working on Silksong for near a decade, but nope, if anything they got worse with it. I've been playing Fromsoft games since Demon's Souls and have played pretty much every Soulslike there is out there as well so I have quite a bit of patience when it comes to petty trolling, only the most egregious instances get a reaction out of me but I can imagine how infuriating it would be for others that aren't used to stuff like this, so I absolutely understand the negative reviews and those that ended up dropping the game because such sections/ moments do make Silksong feel like a chore to play, especially throughout Act 3. However if you have the patience to overcome the nonsense, I can't recommend the game enough. Or just mod it out!\n\n🔳 Broken\n🔳 Shovelware\n🔳 Awful\n🔳 Bad\n🔳 Mid\n🔳 Okay\n🔳 Good\n🔳 Great\t\n☑️ Excellent",
      "voted_up": true,
      "votes_helpful": 409
    },
    {
      "review": "If this game consisted of just the flea juggle mini-game and the OSTs it will still be peak and worth the price. Instead they gave us bonus content like the breathtaking Bilewater area and memorable characters with so much depth like Grindle. Absolute cinema, can't wait for the dlcs.",
      "voted_up": true,
      "votes_helpful": 109
    },
    {
      "review": "I unironically think Silksong is one of the best games of the decade.\n\nThe attention to detail, combat and movement system, the visuals, and the music. Really can’t recommend this game enough. To me, it's a huge step forward in all aspects compared to original HK, especially in terms of how the game looks.\n\nWhile it has some flaws, some of which are pretty subjective (like wishes or double damage in some cases, or pretty much a matter of preference), the one that really stood out to me: Silksong has a high entry level and for some players that might be a dealbreaker. While I had the luxury of time I could spend on mastering the game, some people may not.\n\nIf you are struggling, especially in act 1, don’t fret: ask people, don’t be shy to google stuff, or watch a video with hints. No one cares how you play it, as long as you progress and have fun with the game.\n\nP.S. In total have more than 140 hours on multiple saves across different platforms. Not bragging, just FYI that the review is based on that.",
      "voted_up": true,
      "votes_helpful": 115
    },
    {
      "review": "Fun fights, but finding certain items (Pollen Heart) without looking up a guide would have made me drop the game.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Easily one of the very best games I have ever played.\nIt's just iconic moment after iconic moment. The fun never stops!\nI can with complete earnestness say that the wait was worth it. No other game has ever made me sit through a 12 hour playing session before. I was completely obsessed! And I'm still just so engrossed in this game. 100%'ing this game was a pleasure, and I look forward to doing it several more times, hopefully.\n\nThe areas are amazingly detailed and feels so real in this world.\nThe art is amazing.\nThe music is gorgeous.\nThe characters feel realized and memorable.\nThe controls are slick and comfortable.\nThe enemies and bosses perfectly balance frustration and fun! You love to hate them! Seriously, some of these bosses are so much fun that I kinda hoped that their fights would never end.\nOverall, it feels like this game, much like the original Hollow Knight, was designed specifically just for me. It's so atmospheric and fully realized!\nEverything about it just so perfectly culminates into this masterpiece of a game. It's bewildering just how wonderful this game is in every aspect!\nAs I'm sitting here, writing this, I get goosebumps all over just by sheer glee alone. Thinking about my moments with this game just makes me so excited!\n\nMuch like the original Hollow Knight, my only semi-serious critique is that I would love to explore the world even further. I want to go beyond the borders, and crawl within the crevices. Not because what the game presents isn't enough, but instead rather due to me being so deeply invested in its world.\nAnd yet that all can perceived as an inadvertent compliment, as I just loved everything so much that I'm even asking for more!\nI'm super excited for the upcoming free DLCs, and to see what they bring!",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "I didnt get the hype of hollowknight, until I played silksong, the music, the atmosphere, the characters. this game has so much depth to it,  good exploration, a good amount of challenge. And with a moveset and gear system that has a crazy amount of options for a metroidvania. This is a must play for any souls fan. I promise you, you wont be disappointed.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "Great game!!!! Great SEQUEL!!! Great story about little hollow spider who is trying to find her way back home 🕸🕷🕸",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "Worth the wait! (this praise is getting old). The game design exceeded my expectation. They give you so much freedom on choosing your own build with so many tools and abilities and even the combat style itself (crest). That gives me fresh experience on this genre of a game. Not to mention the game has +40 bosses even without DLC. This easily makes you forget of how long you've been waiting for this game to release with all these treats they give you for 20$ (my regional price only 10$ which is insane).",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "If you loved HK1 this won't disappoint. Amazingly atmospheric visuals and soundtrack, crisp sound design, versatile combat mechanics, well designed bossfights and areas. In short, the same elements that made the first game what it was. This is a solid expansion and continuation to the franchise. SHAW.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Pretty good game, ngl.\n\nAt first, I wasn’t a fan because the difficulty felt a bit rough (especially the flying enemies), and almost everything costing money was kind of annoying. But after playing for a while, it stopped bothering me as much, and I really got a feel for how the game works.\n\nOverall, it’s fun and satisfying once you get into it. I genuinely enjoyed my time with it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I've played about 50 hours as of writing this and aside from my own incompetence in not knowing how to use the map correctly, this game is one of the best releases of the 2020's. Of the thousands of games released since the turn of the decade, this sits comfortably in my top 10. I still have a lot to find in the game, so I'll be grinding away when time allows it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I still can't believe this game came out after all these years, haven't been this obsessed in a game in a very very long time. Great Job Team Cherry!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Better than its predecessor and at least for me also game of the year.\nI just love everything about this game, gameplay, visuals, soundtrack etc. etc. and all this quality and yet the devs only ask for 20€, what a steal!\n\nEven the achievements that (usually) require you to replay the entire game in either a limited amount of time or without dying once did not feel like a chore for me at all since it's just such a bliss to get lost in the world of Silksong.\n\n10/10 can't recommend enough!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "[h1]My GOTY[/h1]\n[i]Every review is subjective and aligns with the perception, tastes, preferences and/or interests of the person writing it. I’m someone who views video games as another form of artistic expression, which is why I do NOT assign a score, I don't believe art can be measured or quantified, I’ll simply share my personal experience while avoiding spoilers as much as possible.[/i]\n\nI waited for many years for this game, so much time passed since its presentation that when I finally saw the official announcement from Team Cherry I didn’t know how to react, it was a strange feeling between excited and skeptical. It wasn’t until that fourth of September that I could finally buy it (after Steam fixed its servers xD) and from those first minutes I knew that the wait had been worth it.\nThe [b][u]story[/u][/b]  follows the elements of the first game: you arrive to a kingdom in ruins after its leader made bad decisions and an evil force took over everything, a few NPCs tell you about their tragedies including a talkative sword girl who masters silk and appears a couple of times to put you to the test, then your job is to find out what is behind all of this, only for the character at the end to relive some of their youth traumas related to one of their parents and motivated face the evil that is behind all of this in a place with a very marked lighting contrast (the story is more complex and more interesting than that, but I don’t like spoilers and I found that similarity funny xD). What differs from the first Hollow Knight is the way in which it expands and distributes its world, from the first scenarios it makes clear to you that it is a different environment and that the way in which you must face the challenges is far from its predecessor. Which leads me to the next point, the [b][u]gameplay[/u][/b]: this game demands too much precision both in combat and in the simple movements, since a wrong step or an imprecise attack could make you pay a high price. There was a lot of talk that it was unfair in some fights or that elements like the diagonal jump could ruin the experience, but I think it is only a matter of adapting to this new combat style, I value a lot when they dare to show something different and do not settle only with taking again elements that proved to work in the past.\nThe last section I would like to talk about is the [b][u]music[/u][/b], since just like its map and its story, Silksong expands this repertoire in a big way, among the tracks composed by Christopher Larkin the ones that stand out for me are: [b][i]Enter Pharloom, Bone Bottom, Fourth Chorus, Bellhart, Widow, Phantom, Red Maiden, Choral Chambers, Songclave, Cogwork Dancers, The Choir, Nyleth, Skarrsinger Karmelita, Lost Verdania, Last Dive, Lost Lace and Sister Of The Void. [/i] [/b]\n\n[i]This was the only game in the whole year that I completed in its entirety without stopping to play another, it was the only game that I felt was worth waiting for and playing from its release and it is the only one that for me deserves the title of best game of the year. [/i]",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Was a big Hollow Knight fan but was not thinking much about this prior to it's release, my hype had died, but after playing it, it's since become my favorite game of all time. Incredible art direction, gameplay, movement, combat and to me a great difficulty, albeit overtuned at times. Couldn't have asked for a better second game. (But do play the first game before playing this)\nShaw!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It's so funny to me how people scream that game is to difficult. I'm not saying that game is to easy, but, its just not hollow knight, that was a cake walk and in middle of that game you already didnt know what to do with your money, unless you dying a lot and was loosing all your money constantly. Look... money finally mean something! Bosses that 3 shot you now demending strategy and tool useg, when in H.K. you could just hit 1-3 times and walk back and repit. \n\nNice music, nice animations, a lot more polish (H.K. on release was so broken), story is okay (in my mind story in H.K. was better) and if developers planning free dlcs just like it was with H.K. for 20 buks its absolute steall.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Do the runback. Oh, the runback is challenging. No, you moron The runback wastes my fucking time and hurts my thumb. The boss fight is challenging. The boss fight is what I want to do. Put the fucking  cha fucking challenge in the boss, not in the runback to the boss so my fucking finger hurts. Awful game design. No reason ever for a fucking runback like this in a video game. It adds nothing at all. All it does is piss off the gamer. It reduces my enjoyment of the game. It gives me less time to focus on the boss. It hurts me physically. Stop fucking putting these in games. They suck. We got rid of them on purpose because the only reason runbacks needed to exist was because you had no space on the game cartridge. So, you had to extend the length of your game by putting run backs into the games to make them feel like they were longer. And it wasn't, you know, a ripoff to pay 50, 60, 70 bucks for a game that's 4 hours long. Guess what? This game is 60 fucking hours long. You don't need a runback. Literally doesn't need it at all. -DSPGaming 2025",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I'm a self-declared metroidvania enthusiast and let me tell you, NOTHING comes close when it comes to sheer production value and innovation power in the whole genre. We will be having silksong inspired metroidvanias for YEARS to come because of how fluid hornet's movement is. The map is extremely big, the music is awesome (nothing beats a good orchestral track imo), the game is fun (if sometimes mean and stupid difficult, but not path of pain level difficult). There are other metroidvanias that might be better for you if you can't take this game's difficulty, but Hollow Knight Silksong is definetly... peak.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It has silk, it has song, what depths of depravity could drive a being to desire further?",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Silksong truly has to be one of the games released in 2025 so far. \n\nHornet did a job playing Hornet and the action was in the game. The game has a story and the cutscenes were animated. The NPC's were along with Hornet and the bosses were enemies. The abilities were features. This game really is one of the games of all time, if not the last decade.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Deserves GOTY\nBut there are nitty gritty things I wanna talk about it. \nSo lets talk about it.\n\n**STORY**\n\nStory wise, alot of things are hidden being breakable walls and hidden areas so it sucks that if you miss one (depending on where it is) you could miss a game changing event or just some minor bit of plot that could make you enjoy the game much more. But thats just metroidvania for you so Imma get over it.\n\nAlso its weird that you NEED to exchange a relic for act 3 but you dont need to get all 3 silkhearts. I dont know how TC decided what is required or not but yes it is kinda...rediculous.\n\nOtherwise this gets a golden star in my books. You just need to look in the right places and do as much as you can before you progress to the next act. Pretty simple and easier to understand when you compare it to the more open and vague concepts of hk and other souls like games. So long as you know when and where you need to go to unlock the next act. \n\nTrust me Act 3 is worth it.\n\n**COMBAT**\n\nComparing it to hk, the combat has definetly improved alot but has also nose dived in some places. I have no issues honestly with the frequent updates by nerfing and buffing some gear cause yes people will find ways to exploit certain abilities in the game but doing more testing with others could've prevented some of this. Also yes I confirmed that the difficulty did increase compared to hk because of the increase speed and viscious attacks of some bosses and enemies. \n\nI see no issue with the double damage of the game really except when its for bosses that are hard enough to dodge cause of \n(1) large area of attack with fast attack speed\n(2) difficult to dodge attacks with fast attack speed\n\nunless ofcoarse its one attack move that happens seldom and you can recover enough silk to regenerate. Whats the issue then, TAKE 2 MASKS OF DAMAGE, HEAL 3. ¯\\_(ツ)_/¯\n\nLets not go over enemies that I hate the most but the gaunlets are fun...minus [spoiler]the one in deep rocks, high halls, hunter's march and especially lost verdania. These enemies teleport so fast they kill me everytime mid bind. This is not a git gud moment, its a fix-this-TC-now moment. Even if I managed to do it, what the hell is this?! [/spoiler].\n\nAdditionally I didnt even bother upgrading the nail until I could reach max level because every enemy has a defence multiplier which makes it kinda pointless unless u are max level.  \n\nLiterally everything else, no issue by me  regarding the individual crests and multiple silk skills. Just GIT GUD. But what are these wack yellow tools? [spoiler]Enemies in act 3 are just more annoying not harder cause void gives them 2 of 3 more gimmick attacks making everything less fun imo. [/spoiler]\n\n**ESTHETIC**\n\nYou want some style, look no further than Trobbio.\n\nAnyway\nComparing again to hk, I would say the environments feel is lacking. I wish there were more interactive objects with as beautiful architecture or even just more grass to wack in the world like in the og game but I also understand that this is a game all about running through areas so its not like you really notice that much anyway but that brings me to my next point. These minor details in the og game gave the world more life that I feel siso may be lacking. (this is more specific to the parts of the world you can enter before act 2). Pharloom is meant to be a more technologically evolved world but you only see that in when you reach the Citadel. \n\nDispite me hating it these areas at first, Bilewater, Purtified Ducts, Mount Fay and Hunter's March were done perfectly (minus the Groal the Great runback). Far fields is a worse Greenpath, Sands of Karak is more annoying than challenging when you have to wait for roots to activate before you can continue further in the area (on that note I hate the elevators in shellwood) and Deep Docks is where I go if I want to get killed by a terribly designed npc with a big bomb or die in a pit of lava. Underworks might as well just be the beginning decent into Deep Docks honestly.\n\n[spoiler]My fav areas and arenas are the act 3 boss fight rooms for Crust King Khann, Shrine Guardian Seth, Nyleth, and Skarrsinger Karmelita. But as for everything else in act 3, it just loses its glow which I dont really like but somehow makes shellwood more fun cause now shakra and garmond are helping out in defending it. Feels like a cool co-op. [/spoiler]\n\nThe music is pretty much amazing. I feel like more epic music will be included with later on dlc so Im not worried. The music complements the environments perfectly but only a few boss themes really stand out [spoiler]like widow / first sinner, cogwork dancers, trobbio and even moss mother.Also lost verdania...why must the best environment in the game be one that you can only access once and have some of the most annoyingly fun enemies in the game that I can't seem to hit [/spoiler]\n\nLAST MENTION\n\nDid I mention this game has a bit of trolling \nDid you notice my name (yes we do a bit of trolling)\n\nNow just give me the holy SHAW on top of the godseeker (pantheon) and grim dlc",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A wonderful successor, engaging and demanding.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The silkposts and copium journey from Daily Silksong News and Primacon felt just like yesterday.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "My emotional response to Hollow Knight, 7 years after playing it for the first time, largely comes from its novelty at the time. Silksong, largely being more of the same (although both larger in scope and more refined), does not elicit the same emotional response. Thankfully, the game more than makes up for that by being astoundingly fun to play. The world is not as tightly packed as the first game's, it's much larger, but you have been made substantially faster to compensate, resulting in an experience that feels much more ambitious and open while also allowing you to explore it in ways that range from slow, curious and contemplative to almost breakneck.\n\nThis player freedom is not omnipresent in Silksong, Act 1 is decidedly more linear and railroaded than anything following it but I think it's a design decision worth making if only because of the sheer contrast it creates when sizing it up against the amount of branching paths that the Citadel provides. This is generally one of the most memorable aspects of this game - where Hollow Knight impresses with how deep down it's willing to go, I found Silksong's initial ascent to be perfectly satisfactory but was blown away at how many new paths were available to me once I reached the top, some obvious and signposted, others mystifyingly hidden and out of the way. And there's just so MANY. There were 5 different instances in the game where I said to myself \"Okay, this is the last area in the game.\" and I was wrong every time.\n\nThis is of course not to suggest that the game warrants praise on the strength of its bigness alone. Silksong had some big shoes to fill and an impressive world size by itself would no doubt have come short. It's a good thing, then, that the level design itself is excellent. Team Cherry have taken great strides in making every environment feel convincing and lived in, especially compared to Hollow Knight's more blocky presentation. Exploration is as tight as ever, complemented by an incredibly agile combat system that after having finished the game around 4 times I still am nowhere near getting tired of. A lot has been said about the numerous combat arenas littered throughout the world, and I was initially inclined to agree with the detractors on this one but once I really got the feel of fighting I just kept wanting more. If there's one thing to criticize about the combat it's the crest system. Incredible idea on paper and I really do love the varied movesets of each one but some of the healing mechanics mean that not all crests are created equally, to the point where some just make the game harder across the board whereas none of them should feel blatantly superior to others, especially when the conversation around the difficulty has gotten so volatile without even taking this system into account.\n\nIs the game too hard? Well, yes, or at least it was, and Team Cherry ostensibly agreed, as since release there have been a few balance batches making environmental hazards less deadly and nerfing some bosses. Right now I think the game is in a decent spot balance wise. There's still issues to be addressed, obnoxious boss runbacks, staggered bosses still somehow hitting you for two masks of damage, somewhat punishing platforming challenges and one of the hardest bosses in the game being locked behind a tedious gauntlet that you have to do every time, but to me none of these issues are experience ruining. The game of course rewards exploration, leaving a seemingly insurmountable obstacle and returning to it when you're better equipped is almost always the right option, but something I've realized is that the game also rewards more methodical play. Even the dreaded Bilewater becomes a much more manageable experience when you take the time to properly assess your surroundings and utilize your tools (although it's still admittedly a very evil area).\n\nHere's the thing about that, though: The tool system sucks. Using an expendable resource to use red tools is just unacceptable, it creates an awful negative feedback loop where struggling players are further punished for struggling by depriving them of an option that gave them an edge in combat, and it led to me almost never using them for fear of running out of shards. I think the worry was that tools were so overpowered and flexible that if they just had limited uses between each bench with no currency attached to them they would break the balance of the game, but even that would be preferable to the current implementation, where if you run out of shards you have to go grind for them or buy them using the also very limited amount of rosaries you come across, especially in Act 1. I think it's the game's biggest stumbling point and transforms a unique and varied system into something I almost never wanted to engage with.\n\nThat aside, though, I think Silksong improves over Hollow Knight in almost every aspect; the world is bigger and better, the combat is flashier and more satisfying to pull off, the soundtrack is simply sublime, the story is much more legible and comprehensible, no doubt thanks to the fact that Hornet can converse with the bugs of Pharloom (an obvious design decision but still one that characterizes her amazingly, especially given the game's wonderful writing style). There's so much to adore about this game that even its several shortcomings barely detract from how much I love it. There's already DLC on the way and while I'm a little afraid they'll wind back to the same mistakes they made with Godmaster, I still think it will have some of the best they have to offer.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game has managed to surpass its predecessor in many aspects, which in itself is already a rare gem. I'm in love with this game which, along with Claire Obscure, is the GOTY 2025!!\n\nDifficulty: hard\n100 % achievement difficulty: medium - hard\nGraphics: Superb!\nMusic: Great",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Not many sequences get to live to the expectation left behind from a first game many consider a masterpiece but, Hollow Knight: Silksong does.\nNow that I finished the game I can say that 7 years waiting were actually a quite short amount of time given what Team Cherry delivered with this sequence, the game is phenomenal, on the very sense of the word, it is a Masterpiece.\nYes, they did it again.\n\nIn resume the gameplay, story, characters, voice acting, ART, maps, enemies, bosses, ambience, progression, difficulty, all of that are PHENOMENAL in this game and the music... Yeah, divine. Larkin did an astonishing job with Silksong music and audio design, you can feel how connected the world is with it's music and how much the music itself is important on the lore of the game. \n\nTC kept the price of the game really low for what they gave us, so do not wait for any sales, just pay the full price on this beauty, trust me it is worth every cent.\n\nSHAW ! !",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Silksong is a game about silk... and song. The huge world, the visuals, the story, characters, the music, the deep lore and the fuckin true ending which was some fuckin cinema.\n\nI'm not the best at this game but 80 hours only in my first playthrough? It's amazing! I got the first Hollow Knight in one of the Steam sales, now with Silksong I made sure to not commit the same mistake and paid the full price, it was 100% worth it.\n\nNow with the actual game, yea it is more difficult than the first game, yes you will die a lot, and yes I wish parrying with slower crests actually let you attack/parry again instantly (kinda like what Dead Cells does I guess). It's not a perfect game but by far one of the best I've ever played, it's already on the list of games I wish I could forget to play again.\n\nPlaying the first game isn't reaally necessary to play Silksong but you will regret as you are going to miss a lot of references and lore.\n\nSomething I really wish for the future is to be able to explore the world of Pharloom when it was at it's peak - maybe exploring it via memories, kinda like with Verdania (I'm talking about you Red Coral Gorge)\n\nSo yeah, it's a game worth your time, money and experience.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Как же мы долго ждали, и как же мы стадаем во второй части продолжения великой и любимой Hollow Knight. Всем и никому рекомендую! 10/10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Silksong is a captivating masterpiece that builds upon the legacy of its predecessor while crafting a distinct identity of its own.\n\nOne of the standout elements of Silksong is its music. Composed by the talented Christopher Larkin, the soundtrack is nothing short of breathtaking. The score beautifully complements the game's world, shifting seamlessly between hauntingly melancholic melodies and energetic, pulse-pounding rhythms.\n\nVisually, Silksong is nothing short of a feast for the eyes. The hand-drawn art style, which made the first Hollow Knight a visual gem, is taken to new heights here. The environments are rich in detail, each location brimming with its own unique charm, whether it’s the lush, verdant forests or the more mysterious, darker places.\n\nThen, there’s Hornet. As the main character, she’s not just a compelling protagonist because of her backstory or abilities. Her design is elegant, with flowing movements that make combat feel both tactical and poetic.\n\nJust try it.\n\nP.S. \nGIT GUD",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[h3]Definitely a worthy successor to Hollow Knight.[/h3]\nPersonally, I enjoy it even more than the first game. I’m almost at the 50-hour mark and still haven’t finished my first playthrough - and while I do try to see everything, hunt down collectibles, and clear side quests, the amount of content is impressive even without that. For the price, the game offers a [i]lot[/i] of value.\n\nA small warning: this game is [b]hard[/b]! Maybe it’s just me, but this entry feels noticeably tougher and more punishing than the original. Be ready for a challenge.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Silksong takes everything I loved about Hollow Knight and elevates it with stunning new environments, fluid movement, and fast, elegant combat. Hornet’s acrobatic style makes every fight feel exhilarating, and the world is overflowing with charm, mystery, and atmosphere. If this is the future of Metroidvania games, we’re in good hands. Absolutely worth the wait!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best metroidvanias ever, takes the original Hollow Knight to the next level.\r\nThis long awaited game lives to the hype it created, the visuals, the music, the mechanics, all carefully created to make this game a jewel.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "At times pure rage-bait. Nonetheless, a beautifully crafted game... Sherma best boy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "There aren't enough words in the world for me to describe how much I love HK: Silksong. \n\nDoes it sometimes annoy me with how bad I am at the game? Yes.\nDoes it sometimes make me feel like I'm a terrible gamer and create the need to get better? Yes.\n\nThis sequal in the Hollow Knight series is all I wanted, and more. We've had to wait in radiosilence for years, but my word has the wait been worth it. The visuals AND OST are beautiful in every regard. The characters you meet along the way are incredibly memorable. The sheer amount of content that's pumped into the game is amazing. The combat & mechanics feel fleshed out, fluid, and on point. Had Team Cherry decided to charge € 60 for this installment, I still would've found HKSS a bang for my buck.\n\nThere have been an occasion or two where I felt like an encounter was overtuned (Mind you, I still went back to beat it, even if it cost me hours.). I have yet to finish act 3, but with 87% complete so far, I can safely say that something absolutely terrible needs to happen for me to change my review on this game. \n\n9.5/10 would recommend to anyone who likes difficult games. Now I go back to beating the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "“Jumped in, got wrecked, went again.”\n\nThe game’s fantastic—tough, refined, and absolutely worth the wait.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game was worth the wait.\r\ni was never the best hollow knight player, and i am even worse at silksong, yet, i had a lot of fun, the story was great too and all of the npcs were lovely.\r\nthe game is hard but rewarding, even if you need to take breaks sometime and relax, or look up how to beat the next boss, it's alright, as long as you are still having fun.\r\nthe quests in the game was also very nice, i really liked fulfilling each and every one of them that i found.\r\n\r\ni normally do not write reviews, so i am sorry that it is a mess, but i hope at least one person sees this review and have fun playing the game. <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Review for the steam awards but I'm gonna drop my belated two cents about whole difficulty discussion.\r\n\r\nI understand how people feel like this is way too hard from the get go and just likes to punish players but I look at it at the perspective of this game starting as a DLC so it kinda has modified HK endgame difficulty and while I don't know if that \"justifies\" the difficulty I feel it gives different perspective of why it is so.\r\n\r\nI have only reached the default ending so I can't really talk about the whole game but I remember a lot of discussions how the difficulty ruined the game from the launch week.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "As good as its predecessor and sometimes even better, the wait was worth it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great atmosphere, fantastic music, instantly likeable characters and one of the most appealing art styles out there. But the gameplay just feels like Team Cherry is trolling you constantly. Still a good game overall but a step down from Hollow Knight.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely beautiful game. Soundtrack, gameplay, and visuals are all done with clear care and patience. A slight increase in difficulty from Hollow Knight but only to the point of encouraging improvement. And as always, GIT GUD.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best sequel/prequel after the first game. Fascinating story, world event or NPC quest are not easy to missed (unless you b-line main objective with no exploring). Some places are annoying to deal with, which give you much challanges. Once you succeeds whether beat up the Boss or the area, muchly feels satisfaction. Would wait another 6 years for another games from Team Cherry.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I expected nothing less from Team Cherry, amazing game from start to finish. I highly recommend if you love metroidvania and you want a good challenge.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing step up from Hollow Knight. Combat and movement feel super fluid and fast, and the visuals + soundtrack are great. I do think Hollow Knight had a smoother difficulty curve, though. The first few hours in Silksong can be pretty tough for new players until you can explore more and get some upgrades.\n\nOverall, an awesome game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "NOTE: I have not completed the game, so I can't say I've seen the full package yet\n\nOverall I believe the game is quite excellent. Some specific encounter or boss runbacks can be a little bit too much for my taste but no matter what I greatly appreciate experiencing the same sort of feelings that the Souls games provided; hitting a wall, learning how to overcome it with the tools I have, and then continuing to push on. I think its a very worthy successor to Hollow Knight. Its difficult for me to say that it is better since Hollow Knight is so excellent, but if you liked that game I don't think you will be disappointed.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I recently got into Act 3 and I just fell on love with the game all over again.\nAlso the choral chambers? Best area in the game, I play that OST on repeat constantly\n\nFor anyone that is considering getting the game but maybe is on the fence about it, do yourself a favor, get it, it is super worth it!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Team Cherry competently improved upon what many considered to be the best Metroidvania of all time. Such a well-made game crafted with love, absolutely worth the wait. Can't wait to see what content will be added down the road. Maybe one DLC will turn into yet another game we will all play in another decade. I wouldn't mind.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I didn't know what to expect when I finally saw the announcement that this game would be coming out on a random Thursday or whatever it was, so when I bought it, and finally set some time aside to play it, I was simply amazed, this game is fantastic! Development heaven for this magnificent video game helped it blossom into such a good product, and I'm happy to say that I've enjoyed all aspects of it. Here's to hoping that the modding community is going to be as boundary breaking as ever! <3\n\nIn modern terms: bussin frfr git gud funy shaw recommend game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hollow knight has always been my favourite game and i have always looked fondly at it , with that being said silksong had a very high bar of expectations. Im glad to say that it was everything i expected it to be if not better the combat and movement is very fast and fun, the map is huge and has secrets all over it to explore just like the first hk, the bosses are tough and the normal enemies are also very tough like micro bosses you wont be able to rush your way through some of them each have some pattern which after you learn can be used against them which was my favourite part. keeping that in mind the game requires you to have alot of patience in order to experience it fully and one should take their sweet time , The game is tough at the start but when you go on exploring you will come across a big array of tools which will help you alot in your journey. Also i would not recommend this game to those who have not played the first hk as silksong will be a very unforgiving.\r\nRegarding the economy i feel like its designed in a much more better way and makes more sense. it was a simple loop where i explored and fought enemies on my way till i found a shop , exhausted my rosaries or converted them into strings then i went back to exploration , never did i feel like i had to struggle for funds and all items are priced well. in hk after exhausting the shop i had too much geo and stopped caring about finding more and even ignored corpse runs sometimes but the endgame shop hit me with some of the most expensive items which i did not have funds for neverthless i got em in next playthrough and finished the game.\r\nalso if you do plan on getting this, before starting just head into your sound settings and set sound to 7 and music to 10 or you wont be able to hear the beatiful soundtrack clearly.\r\n\r\nTip : For those who struggling with bile water hear me out [spoiler] Do not go into bile water directly after getting faydown cloak, first go to songclave there you will find the missing merchants quest, that quest will take you into the memorium and will show you a hidden path there, when you are outside after finding her on the right side on that bridge there will be a breakable wall which will lead you towards putrid ducts , if you explore that place good enough , you will find a tool called wreath of purity on the rightmost part of map, after you get that , equip and feel free to enjoy bile water.[/spoiler]. this is why i did not struggle as much in bile water and had a much easier time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My cat loves watching me play this, 10/10.\n(Also beautiful artstyle, music, the gameplay is tough but rewarding, it is a little confusing to find your way around but that was to be expected after Hollow Knight. Wish I could play this for the first time again. Silksong finally releasing was beyond surreal, like a long standing dream come true, and it managed to live up to expectations.)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’m a casual gamer and I usually just play to relax, but Silksong blew me away. It’s stylish, fast, and unbelievably fun. Every new area made me want to keep going, and the whole experience just felt special from start to finish..",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Well worth the price. For $19.99 USD you get...\n-Engaging and challenging gameplay\n-Beautiful art and fun character designs\n-A fitting and beautiful soundtrack, my favorite being [spoiler] Clockwork Core [/spoiler]\n\nThere were many times during my casual playthrough where I got frustrated and had to take breaks. What was really satisfying was overcoming those challenging parts and making my way through the game spoiler-free. After my first playthrough and 100%-ing my original save file, I attempt to do steel soul playthroughs and also try to get through the game as fast as I can on non permadeath. \n\nI am a long time fan of the original Hollow Knight and try to keep up with the lore and story of both of the games now because it is very intriguing and subtle. The story and lore is told not just through dialogue but also the environment and also the enemies you fight. \n\nIf you are a fan of challenging games or metroidvanias I would give this game a shot and the first game as well, they are reasonably priced. Team Cherry is very generous with their content updates being free in the first game, I would expect Silksong to have free content updates as well in the future.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game made it worth it to sacrifice my firstborn during the dark ages of the Silksanity",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "For eight years, Hollow Knight reigned supreme as the greatest metroidvania of all time. Several pretenders tried to dethrone it, and although their efforts were valiant and they stood on their own as phenomenal games, all have failed - the Kingdom of Hallownest was too enchanting and expansive, its inhabitants too memorable; a few could match or surpass the mechanical aspects of Hollow Knight, but none could evoke its wanderlust or compete with it in style. It's unsurprising, then, that it took Team Cherry to slay the dragon of their own making.\r\n\r\nSilksong is a tour de force so astounding it would be unbelievable coming from almost any other studio. The game's setting, the Kingdom of Pharloom, managed to capture what made Hallownest special, but it's by no means a copy. You could tell both worlds were designed by the same team, but both are original and thematically different. There is also a clear evolution in a technical aspect regarding the visuals and sound design; Hollow Knight is a beautiful and melodious game, but there is so much attention to detail and polish in Silksong that it feels almost surreal at times. When you are playing this game - if you have not already - take some time and pay attention to the sound effects and animations for things like trapdoors bulging under your weight, or just look at the background and listen to the enemies, the music, or the amazing singing of the characters that you'll meet along your journey. Silksong is so engrossing that it makes some of HK's areas seem dull in comparison, which is a batshit insane statement, but it's true.\r\n\r\nThe protagonist and plot are also reminiscent of the original, but altogether different; Hornet is our heroine and a community darling from the first game. They were wise in not making her a mute passerby, but an actual main actress and moving force in Pharloom. Her dialogue is well-written and appropriate, respecting her personality from the first game but developing her as a character. Hornet's interactions with the inhabitants of Pharloom are great and memorable, especially because many of them are also fantastic characters and fit the story's theme perfectly. I liked Silksong's plot better than Hollow Knight's, and I suspect that will be the experience for the majority of people; the Knight was a good instrument to showcase Hallownest, but Hornet managed to do the same with Pharloom while being an actual character with feelings and desires. Also, Sherma is the GOAT, and I love his song; they MUST sing it at the Game Awards this year.\r\n\r\nAs for the gameplay, I guess I will start with the elephant in the room that dominated the discourse around the game: the difficulty. HK is a \"souls-inspired\" game that was also considered hard by the gaming community at large, but it was quite balanced, tending towards easy for the most part; doing Pantheon Five or a Steelsoul run is probably the only genuinely hard challenge the game has without any of the crazy mods. Silksong is exactly the same. I'm still puzzled by how this difficulty discourse got this intense; my leading theory is that it's a mix of new casual players drawn by the IP's fame, and old HK players blinded by nostalgia and handicapped by a stubbornness to play Silksong like the original. They were pretty good at HK after playing the game like four times, so how come they are struggling in Silksong? Surely it's the diagonal pogo, or the fact that there are more double damage sources! No, must be the endless runbacks when you die to a boss! Game is tedious, not hard guys, I'm totally not dying 20 times to Savage Beastfly, a boss with two moves ;-)\r\n\r\nI could not care less if someone cheeses a Souls game, that is part of the fun: use the mimic summon or nuke the boss with spells, go ahead. Here, the problem seems to be the opposite: the devs went through a monumental effort to empower the player and the enemies whilst maintaining the base of HK's combat; they succeeded, but could not predict players would REFUSE to have fun with the new tools and Hornet's increased speed and power. It's Doom Eternal vs. Doom 2016 all over again; Doom Eternal is mechanically superior, but some people seem incapable of having fun or learning: \"I only used the shotgun to beat Doom 2016, why can't I do it on Eternal? Why is everything so fast? Why do I need to use all of the tools the game gives me to beat it? BAD GAME!\". I know this little rant sounded very mean and elitist, but it really isn't - plenty of gamers with little to no mechanical skill will beat this game and love it. Some people just can't leave their pride or stubbornness at the door. It is what it is. If people post reviews bitching about the difficulty of a game made to be challenging and marketed as such, like Sekiro or Elden Ring, they will do it here.\r\n\r\nHopefully, I have dissuaded you from listening to the nonsense about this being too difficult, so I can now gush about how much they improved the gameplay from the original. Team Cherry designed Silksong to be a faster and more aggressive version of Hollow Knight, aiming for a higher skill ceiling and more variety in combat. Hornet starts similarly to the Knight in HK -except for healing, which is much faster and can be done while airborne - but becomes blisteringly faster as the game continues; the running ability, in particular, greatly improves map exploration and is such a \"feels good\" mechanic that it makes it hard to play HK again without the game feeling too slow. You can also swap her entire moveset by using different archetypes called crests, adding variety that the original lacked entirely. Charms are also adapted to be more proactive, becoming tools. Some tools are passives, reminiscent of charms, but a huge chunk are active damage-dealing gadgets that must be actively used by the player; they make your offensive options more flexible and often will deal as much, if not more, damage to the boss compared to your regular attacks. \r\n\r\nBosses and regular enemies rise to the occasion; they are faster and have more intricate movesets to match your new arsenal. The bosses, in particular, are yet another highlight. The quality of your average Silksong boss is much, much higher than Hollow Knight's; the final act is filled to the brim with challenging and fun boss fights. Some of them are so good that it made me pretty sad we don't have panthons on Silksong yet, where we can easily rematch them. The higher quality is not surprising, as HK's best bosses are all DLC bosses; Team Cherry learned a lot, and the more they create, the better they get. Future Silksong DLC will go hard, is what I'm saying.\r\n\r\nIt would have been easy to copy Hollow Knight, but they went the distance in every area they could: better visuals, perfect audio design, memorable characters with lovely songs, faster and more engaging gameplay, some of the best boss fights in any game ever, another brilliantly interconnected and fascinating world that is a character all on its own, a protagonist full of personality and great chemistry with the rest of the cast, a main plotline filled with meaning and hope that I can't talk about as to not spoil you. I think the only nitpick I have is that the \"economy\" of the game is about 10% too stingy with you; literally everything else is pure cinema.\r\n\r\nTeam Cherry had every reason to play it safe and be unimaginative when dealing with the sequel to a game that was nearly perfect. Instead, yet again, they shot for the stars; it is no surprise that they landed among them.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "this game has good graphics but the thing that is hard to do is playing on PC with the controle\r\nlove this game guys",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun until you go to the bilewater or putrified ducts and meet your worst nightmares",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "price is cheap \nthe play style is perfect \nthe bosses are 3x harder than the old game \nthe style of bosses changed a lot before you need to focus on the boss here u need to focus on other stuff too \ni don't like that if you touch the boss he take 2 hearts that a big issue i mean its okay if i got hit with the abilty but if i touch his body i get 2 heart that's to much \noverall the game is fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "10/10 best DLC of all time\r\nIncredible game, well balanced, harder in some ways but more forgiving than HK in some! If you're a fan of HK, this is a must! \r\nI can't wait for this journey to continue!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Silksong became my introduction to metroidvania-style adventures, and I’m genuinely glad it happened with Hornet as my guide. A memorable, elegant, and surprisingly emotional adventure.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Silksong es una experiencia increíblemente pulida: arte precioso, animaciones fluidas y un mundo lleno de misterio. El ritmo es más dinámico que en el juego original, y Hornet aporta un estilo de combate más ágil y expresivo. La exploración engancha desde el primer minuto y la música vuelve a ser una maravilla. Si te gustó Hollow Knight, este juego es un imprescindible.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Silksong is absolutely stunning. The music sets the perfect atmosphere, blending beauty and tension as you explore. The art style feels alive, with every area and character radiating personality. Combat is fast and satisfying, demanding skill and precision without ever feeling unfair. Every battle feels earned, every victory rewarding. A true masterpiece in design and sound.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As expected another masterwork by Team Cherry that improved upon the original in basically every aspects. \nOn the surface you can tell right away from every background and meshes that everything looks more detailed compared to the original. I still remember being blown away by the first game art style, yet they now look 'dated' just because Team Cherry went beyond with Silksong.\n\nContent wise you can definitely see in some places they went with quantity over quality with this game (they did that too with HK's Godhome tbf). \n\nI have no complaint though, the pricing itself is already completely ridiculous, basically cost just $10 in my region.\nI would have paid a full $50 at launch for this game.\n\nOverall, Silksong is a masterpiece that belongs in the Metroidvania highest levels of pantheon (pun not intended).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love this game! In my opinion, it's a huge step forward from Hollow Knight in every aspect.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Basically Hollow Knight 2 with a different protagonist, some improved and interesting mechanics. Art-style and music are awesome. Most bosses are very well designed and fun to learn and fight.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is a masterpiece.  Fantastic sequel to something that was already perfect.  Not much else I can type to convey how incredible this experience was playing through and getting 100% completion.  It just draws you in and makes you feel a sort of joy very few games do.  10/10 absolutely.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Silksong definitely improved on many aspects of the first game: visuals, level design, gameplay and story are some of the examples that come to mind. \n\nIt also greatly increased the difficulty, but at the same time they offer you many tools and spells to defeat the tougher enemies. Some battles you can simply cheese your win by overusing tools and staying at a safe distance, but you'll have to get over the first hurdles of the game to achieve that.\n\nWhile I love the story of this game, it did feel like the mystery present in the first one was toned down due to Hornet being a character that can actually express her thoughts and speak them to the player.\n\nStill, this is a 10/10 GOTY for me!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Boy, where do I start, because I absolutely loved the game and it ended up being the only thing I really got into after finishing Blue Prince this summer.\nAt first I wanted to just slap a thumbs up on it and write SHAW!!! or GARAMA!, but Silksong deserves better, so instead I’m going to thank Team Cherry for what they pulled off. They kept us in silence for almost seven years and then dropped the game on my birthday, which was a nice surprise. It took me a good 100+ hours to 100% the game, and I genuinely loved it.\n\nThe animations are amazing, and the combat and platforming are great. Everything you can do feels good, so the overall presentation is excellent. As mentioned before, the game doesn’t lack content at all. It keeps you engaged the whole time, and hitting 100% took me around 110ish hours. It has almost as much to offer as the original, maybe a bit less, but definitely nothing to complain about.\n\nI loved the platforming even though it’s way harder than the first game, especially without pogo from the beginning. As for combat, I enjoyed it more here because of how agile Hornet is. The game gives you around 60 tools, most of them combat-focused, but I barely used them. They were fun at first, but mid-game I stopped bothering, since I didn’t feel like they helped much or were necessary.\nNon-combat tools, though, were very appreciated and actually useful.\n\nThe crest system was fun to explore at first, but once I found the best setup for me, I stuck with it and didn’t switch again. The ideas behind the system are cool, and the community discovering secret exploits with crest and tool combos is something I’ll always appreciate in games. But personally, I feel like I experimented more with charms and tools in the original Hollow Knight than in Silksong and I also feel like it was way more well done in the first one too. Loved the concepts, just didn’t end up enjoying them as much as I expected.\n\nStory-wise, I didn’t really care that much, but I loved almost every character and the voice acting way more than in the first game.\n\nI also liked the amount of sidequests, but a few of them felt like chores. Stuff like “kill 25 of this enemy type” would’ve been fine if the number was, like, 5. Luckily those weren’t too common, so I can ignore it.\n\nNow for the boss fights.\nI pretty much loved almost every boss in the game. I’d say there are two types: the “duel” bosses and the more “gimmicky” ones. The duel-style bosses were incredible. Fast, fun, cleanly presented. Those fights were so good that sometimes I was actually sad when they ended.\n\nThe gimmicky bosses were hit-or-miss. Some were really fun, but some felt so underwhelming I just couldn’t be bothered. I spent 6 hours on Beastfly for no real reason other than being stubborn, and it wasn’t fun at all. There’s also a palestag fight that was a straight 1/10 experience.\nBut out of 46 bosses, a handful being boring or unfun is honestly fine.\n\nOh, and Bilewater. If you’ve beaten the game, you already know what I mean. If you haven't, I’ll let you discover it yourself. I get it, I probably suck at the game, but some of the runbacks were so unnecessary I don’t know what the devs were going for.\n\nI’m sure I’m missing some points and might add them later, but overall, if you’re thinking about buying the game, I’d say go for it.\n\nTL:DR I personally loved the game and would give it a solid 9/10.\nIf you liked Hollow Knight or metroidvanias in general, this is a must-play. I still can’t decide which one is better, but both games are great, especially for the price you pay.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I would have recommended everyone to play this game except for the fact that it has Bilewater in it.\nPlay through the whole game and once you reach Bilewater, close the game and uninstall it so you never have to experience that pain.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the most awaited games i ever know, and for the first time in a long long time, the game didnt dissapoint and was much more than i expected.\n\nNominated for \"Best Game You Suck At Award\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolute peak, the wait was definitely more than worth it!\nThis Song sure is Silk",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this game is so good. but so hard. but also so good. but also so hard.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Silksong is a masterpiece. I recommend it to any who can afford it to play it through to the end. It is a love letter to gaming as a whole, and it is clear that it was made with passion and love- which is rare in the gaming industry. The visuals are stunning. The way the world connects and how you slowly open it up throghout your journey is incredibly fun, and it expands on the original masterfully.\r\n\r\nThe one issue I have with the game is sometimes the difficulty will feel like it's a smidge too much. That being said, though I did get frustrated a few times, I persevered and finished the game through to the final boss- though I will admit I did mod it just a tad for accessibility.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[h1]It's Perfect, Perfect! Down To The Last Minute Detail.[/h1]\n\nWell, it's finally here. After seven years of radio silence, Hollow Knight: Silksong is finally here, and it's amazing! I know this is a unanimous sentiment towards the game and my positive review comes fashionably late. Since Team Cherry take their sweet time developing this game, I might as well savor it bit by bit in my pace. This is the best metroidvania I have ever played. Calling it \"just another Hollow Knight\" is objectively correct yet woefully wrong. Silksong inherits all that makes the first game so enjoyable and doubles down in content, in variety, and in quality. Every step I take in Pharloom is another opportunity to marvel at this phenomenal art. I cannot stress enough how much I love this game.\n\n[h2]Things I Love About Silksong:[/h2]\n\n[b]1. A Gorgeous World To Explore[/b]\nA feast to the gleaming eyes, to the indulging ears, and to the adventurous heart.\n[list]\n[*]Comparing to Hollow Knight's melancholy tone, Silksong's overall tone is more vibrant. The color schemes are brighter. Each area is more detailed than those in the first game. The world of Pharloom feels more alive and to a degree cheerful than Hallownest.\n[*]The world is not just beautiful to behold. The platforming and biome gimmicks are really fun to traverse. Taking in Hornet's inherent agility and the new \"diagonal pogo\", platforming in the first area is already a demanding test to your skill, and quite frankly, one of the most satisfying test to conquer. \n[*]The soundtracks are noticeably different. Instead of having a familiar, unifying tune, each soundtrack is a unique piece of its own. It's impressive how diverse they are.\n[*]As for rewarding exploration, Silksong does not disappoint at all. Secrets are all over the area. You will always find something new and interesting at the end of the road: cracked walls, hidden passages that connect the two main areas, ceiling lights that look out of place, and of course the classic \"come back here when you get X ability\".\n[*]I also love how \"optional\" Double Jump is in this game. You can reach roughly 80% of the map by just pogoing on the enemies or your tools.\n[*]Granting wishes is the new quest system in Silksong. These wishes are not just your average time-filler content. They contribute to the world-building and even incentivize you to explore previous areas a little deeper. Even some wishes as simple as fetch quests or currency sinks can offer visible differences in the settlement they are requested.\n[*]On the same note, pay attention to what the NPCs said, especially those who have just arrived. They might give you a direction on a certain point of interest that is not marked on the map.\n[/list]\n\n[b]2. Combat & Tools[/b]\nMore variety, more fun.\n[list]\n[*]Hornet herself is so agile and diagonal pogo offers so much mobility. Usually pogoing off enemies is a way to remain airborne for a little while to avoid damage, but in Silksong pogoing gives you so much momentum to maneuver in the air. You can of course launch yourself higher so that enemies' attacks can't reach you, or you can bounce forward and immediately attack the back of your enemies. \n[*]Crest is the new item that can drastically alter your combat style. There are seven crests in the game. Each of them offers different tool slots, attack pattern, and binding. You can have the Wanderer Crest to let you re-experience Little Ghost's move set, or you can have the Architect Crest that turns your needle into a power drill.\n[*]Tools replace the usual charm system in the first game. They are categorized in four sections: first is the Silk Skills. These are the equivalent of Spells and some doubles as gating abilities; second we have the offensive tools. These are consumable attacks you can weave in between your regular attacks and are replenished with shell shards at the bench; third and fourth are the enhancement tools that allow you to upgrade certain aspect of your attacks or Hornet herself.\n[*]Combining all these new stuff together, the build-craft potential in Silksong already skyrockets by tenfold. I simply cannot decide which one is my favorite because they are all equally powerful. Beast Crest gives you so much forward momentum. The forward pogoing followed immediately with Delver's Drill is so satisfying to pull off; Reaper Crest's extra silk generation is perfect for Wispfire Lantern and pretty much any Silk Skills you desire. Additionally, equip Volt Filament to make your skills extra tingly; Architect Crest is the perfect \"random BS go!\" With Quick Sling that you throw extra items and Pollip Pouch that gives tools additional flavor, you can even kill bosses without using regular attacks once. Fair warning though, this burns through your reserved shards fast.\n[/list]\n\n[b]3. Other Compliments[/b]\n[list]\n[*]Boss fights are glorious but deadly performance between two(usually) strong and competent dancers.\n[*]Love the species' occupation consistency here. \n[*]Act 3 is just cherry on top.\n[*]The denizens of the Pharloom are so lovely.\n[*]Shakra is the new cartographer, and she is amazing. Her humming is just as memorable as Cornifer's. She can even help you fight off enemies if you bring them towards her.\n[*]Hornet gives her comments on every single beast she defeats is a nice touch.\n[*]Hornet is such a well-written protagonist, a polite hunter who is not afraid to retaliate should you mistake her kindness as weakness.\n[*]If I have a nickel every time someone approaches Hornet inappropriately and gets slapped by her, I would have four nickels. It ain't much but it's funny how this scenario happens four times throughout the game.\n[*]Fleas are so cute. I love their struggling noises(?.\n[/list]\n\n[h2]Things I Dislike About Silksong:[/h2]\n\n[b]A List of Complaints[/b]\nOf course this game is not without its flaws. Since a lot of them have been discussed to death by the fans, I will just briefly mention them here and add some of my own complaints.\n[list]\n[*]Two mask damage is so prevalent that health upgrades feel really inconsequential.\n[*]I think removing the whole shards system and letting tools replenish freely on bench could encourage people to engage in this system more often, instead of having a \"fear of wasting consumables\" syndrome.\n[*]Early game rosary economic is abysmal. You gain so little and need to spend a lot; late game rosary economic is ridiculous. You gain so much but have few things to spend on.\n[*]Needolin and Clawline should not cost silk outside of combat.\n[*]I wish crafting tools on the go were not exclusive to Architect Crest.\n[*]Some hatches and doors should just remain open.\n[*]Comparing to the original trailer, there are a lot of cut contents in the final product, especially the Coral region.\n[/list]\n\n中文小簡評\n→絲綢之歌出了，粉絲狂喜，所有平台大當機，遊戲內容比想像的還要豐富，價格又這麼親民，說真的評論什麼的也不必看，直接買就對了。\n→承襲一代細緻場景搭配簡單角色設計的獨特風格，絲綢之歌擁有比一代更加亮麗的世界觀、更加動聽的音樂饗宴、更加細緻的關卡設計、更具挑戰性的跳台與戰鬥，大幅度滿足你對類銀河系惡魔城期望與驚喜。\n→最大的亮點就是向下跳砍的更動，改成45度角向下俯衝，需要同時將搖桿往左下拉並攻擊讓許多玩家哀鴻遍野。我是沒有這個問題，畢竟遊戲開場就有很多機會讓你練習，反而是這項改動新增的變化讓我非常驚豔，45度角跳砍不僅讓你有更多餘韻在空中移動，甚至是戰鬥時也能讓你體驗主角的靈活性，輕輕鬆鬆繞過敵人攻擊攻其不備。\n→戰鬥更不用說，各式絲綢技能、強化工具、消耗武具、甚至是改變回血與普通攻擊模組的紋章，玩法變化硬生生比前做多了十倍，絕對能讓你研究出許多好玩的配置。\n→關鍵技能除了探索戰鬥雙重用途外，彼此相互搭配甚至能取代二段跳的重要性，讓你探索將近八成的區域。\n→遊戲也有加入了支線「願望系統」，這些願望不僅能讓你更深入探索特定區域找到新的隱藏通道，城鎮也會因你的幫忙更加壯大。\n→有一點很重要，NPC講的話要仔細看，特別是突然出現的那種，他們會點出一些值得你去看看的興趣點。\n→所有NPC真的都好有個性好可愛啊！\n→幹嘛把跳蚤做那麼可愛啦！\n→為了響應遊戲主旨「歌」，文筆與配音似乎比前作更加生動，許多對話都頗有詩意。尤其喜歡主角的塑造，先前以為黃蜂是個高冷的獵手，殊不知絲綢之歌裡黃蜂溫文有禮，行為舉止坦蕩且謙虛，不吝嗇讚美他人，同時堅持自己的底線不輕易妥協。\n→當然遊戲也不免有缺點，但大多都被粉絲討論到極限我就不再贅述了：很多敵人都能一次打掉兩血以致於單個面具升級顯得非常無感、前期錢難賺又有太多地方要花，後期錢太好賺但沒地方花。\n→飛針跟弦針應該改為在戰鬥外不需要花費絲綢。\n→碎片系統個人絕對可以完全拋棄，武具需要消耗碎片補充很容易出現和消耗道具相同「我最好省著用，萬一沒打贏浪費掉了怎麼辦？」的情況。\n→隨時隨地做工具的技能不應該侷限於單一紋章。\n→與第一部宣傳片相比，似乎有很多區域被砍掉了。\n\n[quote=author]If you like what I write, please consider a follow to [url=https://store.steampowered.com/curator/45738167/]my curator[/url] page, thanks!\n如果你喜歡我寫的東西，可以追蹤[url=https://store.steampowered.com/curator/45738167/]我的鑑賞家[/url]喔！[/quote]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Great game. Well worth the wait, but damn it is rough with its difficulty. Each health and silk upgrade is so small that it can feel like a disappointment when after going through a tough challenge your reward is 1/4 of a health upgrade rather than a new tool or ability. It is clear this game expects you to have beaten the first game to get good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is not hyperbole when I say that this game is outstanding. When I think of the moments from my first playthrough - those memories in my head live right alongside some of my earliest, most impactful gaming memories. I was nervous going into this game - I did not believe that a sequel could get any better than its original material. I had put off playing this game for two months after its release. I am very offline and so I stayed away from a lot of the initial internet reaction and conversation. I didn't want that stuff to bias me. I wanted to experience the game on its own merits.\n\nI am glad to say it did not disappoint. Everything from the art design, to mechanics and story had me completely mesmerized. The music convoked a myriad of emotions (throughout the entirety of the game, I played with the music all the way up). I had no idea that my heart still had room to fall in love with another video game. I have not been motivated to try any new games recently. I either am quickly fatigued or generally disinterested. Hollow Knight: Silksong reverted me back into that nerdy, little kid I was those many years ago. I was fully enraptured by the game, embracing each enemy and area with a childlike sense of discovery. As someone who grew up with Metroid, Zelda, and later on Dark Souls - I can say that this game stands at the pinnacle of those genres. It is more than a \"Souls-like\" or \"Metroidvania\". Team Cherry has embraced all of what made those games fun for me as a kid - while evolving the mechanics (yet not fully overwhelming me with new ideas).\n\nI want to thank Team Cherry and all of the folks who worked on this game. Thank you for this wonderful experience. I don't know where this game \"ranks\" or what \"score\" I would give it. I don't think I can quantify how good this game felt. The only thing I can say is that it made me feel like a kid again. Thank you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hollow Knight disclaimer:  112% completion but didn't beat the trial of the fools let alone the pantheon of the gods.\r\nSilksong is a fantastic game.\r\n Brutal? Yes. Obnoxiously so? A lot of the time. Memorable? Yes, in all the best ways, from the world design to the responsive combat mechanics, charming NPC interactions all complemented by an amazing soundtrack (I listened to it on a whim at work recently and was hit with PTSD during certain scores) this is the best soulslike metroidvania I have ever played and maybe even my favourite game of all time.\r\nAfter a necessary lengthy break to lower my blood pressure (induced by Bilewater) once completeting act II, I am both excited and terrified by the prospect of act III. \r\nThis is my personal pick for game of year and I am thankful to Team Cherry for taking 7 years to craft what is in my opinion the quintessential platform action adventure game of the current century. Bravo",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best in all kinds. Audio, music, visual, plot and ofc gameplay\n\n9/10 cuz my butt hurts too much",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its a love, hate relationship, but its so good",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So I really liked Hollow Knight, one of my favorite games, one I kept going back to because of just how good of a game it was overall. I was one of the people eventually in every single Nintendo direct, or Sony State of Play or XBox Partner streams hoping and praying to see Silksong and get a release date, so the hype I had for this game was palpable.\n\nAnd did it live up to it's hype? Yes...yes it did, I have every single achievement in this game and it surpassed Hollow Knight at least in my eyes for the greatest Metroidvania ever made. Exploring in this game is unmatched, every single time I thought I was done finding new areas in this game I'd find another and say \"HOW IS THERE MORE?!\" Checking single wall for any crack or marking a spot on a map that I'm sure lead to some vertical discovery paid off in every single case. Getting lost in Pharloom is the most fun of any Metroidvania to get lost in, it's so incredibly rewarding to find new spots and there's always something that rewards you, not always crazy but SOMETHING.\n\nThe gameplay is buttery smooth Hornet's movement and agility enhanced the gameplay in ways that make you question if The Knight in the original Hollow Knight was just stiff in comparison, he wasn't, it's just that your movement and attack options with Hornet are so far advanced and free flowing it puts all others to shame.\n\nI had no issues with this game's difficulty, but apparently I'm just good at figuring out these kind of platformers, no boss took me more then 3 tries on my initial playthrough and I cleared Steel Soul mode as well. I thought the game was challenging, but fair, but watching other people play who have 0 pattern recognition makes me realize how others could struggle.\n\nI genuinely can’t put into words how much I loved this game. Team Cherry delivered, and I’m here for anything they make in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A masterfully crafted experience, from the gameplay and game feel, to the world map and exploration, the beautiful visuals and sounds, Silksong hits all the notes while remaining incredibly solid, challenging and rewarding throughout.\n\nNot every game must innovate the genre, and Silksong is the perfect example for that, alongside Hollow Knight, it remains as one of the best Metroidlikes / Metroidvanias you could play, the level of polish and love put into the game oozes on the whole adventure. It rewards being creative and observation from the player while exploring, with a control scheme that feels sometimes unreal, moving Hornet around is a joy in itself, that ties itself back into the combat, all around a very good experience.\n\nIt was totally worth the wait, and I can't wait to see what Team Cherry is cooking for the future, of this game or even future projects.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Unfortunate they left out the iconic \"Shaw!\" from the first game, but that barely matters with how much of a banger this game is",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "one the most anticipated games for this decade which went above and beyond our wildest expectations",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great sequel for a great game. I never thought I'd enjoy a game like this but this series have been keeping me occupied for far longer than I thought.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "People have said this game needs a tutorial since it is so difficult. It has one, its called \"Hollow Knight\".",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very anticipated, bought immediately. Certainly a different experience compared to the first game but still very engaging and amazing. Love the new mechanics.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Better than HK in every way. 2025 GOTY contender alongside ninja gaiden 4.\r\n\r\nHornet is much more mobile and powerful compared to the Knight, and the game poses an adequate challenge for her kit. I only wish most crests were more powerful, the fact that you can only evolve one feels like a missed opportunity.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I really love this game. Team Cherry really outdid themself again. I'm so happy I've waited so long. I haven't finished it yet, because I suck at it ofcourse, but none the less I'm completly love struck by hornet and all the characters and the lore and the world and the gameplay. \n\nI love you, team cherry!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great sequel that feels as fun as the original, and certainly a bit more challenging and mechanically interesting than the original. Perhaps a bit less well paced, especially if you are looking for some narrative beats to keep you going. \nIf I was to pick on some of the bad points - difficulty might be a bit frustrating if you go into the game expecting similar pacing to the original. There are more longer combat moments and basic enemies that take longer to beat. Most annoying is an archaic feeling \"run back\" after deaths in a lot of areas that feel like arbitrary wasted time.\nOtherwise, expect a longer bigger game, that I'd recommend playing more gradually to work around these frustrating bits.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent game, absolutely masterpiece.\r\nAt the level of Hollow Knight",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Silksong is i believe a masterpiece; the bad parts were horrible, and the good parts were incredible, but all of it was intentionally crafted, and I think a game that grips you well enough to make you feel truly miserable during certain parts and incredibly engaged and excited during others makes it a masterpiece. not the most consistently enjoyable game, in fact I can't recommend it to many people I'm friends with whom I'd want to share the experience with in good faith especially depending on skill level and a willingness to enjoy even the act of suffering through certain difficult parts and long term mechanics, but a truly masterfully crafted game that expertly delivers on being an overall extremely engaging and meaningful experience, and one that I enjoyed greatly.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Every day I wake up sad, knowing I can never experience Silksong for the first time again.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Hollow Knight: Silksong was given the incredibly difficult task of being the follow up to a modern masterpiece. Not only that, it had seven years of hype building up to its release. Even with a world of expectations placed on it, Silksong manages to meet and often exceed expectations placed on it, but often that will leave many players in the dust if they're not willing to change and evolve in different ways than most players might expect from a sequel. \r\n\r\nSilksong's world is hauntingly beautiful. Unlike the world of Hollow Knight's Hallownest, which presents itself as a long dead kingdom where the turmoil of its conflict has left scars only few can remember, Pharloom's world is still enraptured in a suffocating conflict whose effects can be felt on every character you meet while traversing the world. You can feel the weight of a civilization struggling to survive even as its crumbling institutions fight to take everything it can from its denizens before breathing a final gasp. This heavy feeling, along with a more structured narrative allowed by a non-silent protagonist, makes the world feel incredibly engaging to explore and learn about in ways that the original Hollow Knight simply didn't have the presence to immerse you in.\r\n\r\nHowever, this structured world means the player has a lot more direction than they would in Hollow Knight. The entry and exit points for every new area are a lot more gated or harder to find, which means most playthroughs will end up traveling in a relatively linear path through the game. There are very few points in the game where the path forward isn’t relatively direct. A quest marker takes you to exactly where you need to go, and while there are many side paths and even (in some cases) unmarked side locations you can go to in order to progress the story, it's very rare that the player gets lost exploring some branch of the world without knowing exactly where to go. For some, this is a positive, but I found for me that it made it harder to feel like my journey was truly my own in the same way it was in the original Hollow Knight. I felt like I was on Team Cherry’s wild ride, not a path I carved out for myself. However, the path they presented was amazing and worthy of every bit of praise it receives.\r\n\r\nOne element of Silksong that will turn off many is how punishing the experience is. From its platforming to its exploration to its combat, Silksong punishes you significantly harder for missteps than its counterpart in Hollow Knight. Boss runbacks are long, and many standard enemies do double mask damage, something reserved in the previous game for only end game bosses. I’ve said to a couple people that it really shows that Silksong was originally designed as a DLC for Hollow Knight. Without the baseline skills necessary to complete the previous entry to the series, this game will be a daunting task for many. This adds to the oppressive atmosphere created by every other element of the game, but for some it could be offputting if they aren’t looking to be as engaged with the game’s difficulty as the rest of what the game has to offer.\r\n\r\nThe ways in which Silksong are different from Hollow Knight are palpable and interesting but it succeeds in the ways that it's different. While the flavor is different the quality is through the rough all the same. Team Cherry did a phenomenal job with this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "What a masterpiece!! If you thought that the first Hollow Knight was maybe the best metroidvania ever released then you should try Silksong!! Everything here is upgrated!! One of the best games i ever played! \nTry it now and you won't regret it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Hollow Knight: Silksong[/h1]\n\nThe bug-fantasy hyper-capitalism we didn't know we would get.\n\n[i]Something personal ahead[/i]\nFeel free to skip this part, but perhaps this small paragraph will help you understand my review.\n\n[spoiler]Like so many, I started my journey by playing Hollow Knight years ago. With its nearly 300 hours and many more shared with friends and online content it belongs to my most played games and I can safely say that Hollow Knight is my favorite game of all time. At some point I am going to have to write a review about that game too. I can't go into all the details as to why, but this will perhaps make the expectations a bit clearer, that I had for Silksong. It was the follow-up to one of the most memorable experiences I had in my life. And it had six years to build them up.[/spoiler]\n\n\n[b]Gameplay:[/b]\nWhere do I even start.\n\nHollow Knight revolutionized the Metroidvania-Genre, making other games like it a sub-genre I like to call Hollow-Likes. You've got games of all names and sizes mimicking it, one of the biggest ones clearly being Ori and the Will of the Wisp. So with its own niche in this big name we all awaited the next entry and it only ever had two choices:\n\n1. Revolutionize upon itself or\n2. Just be Hollow Knight 2\n\nSilksong chose none.\n\nStarting to play Silksong was like returning to an old friend that just felt different. The first few minutes I just saw Hollow Knight with wall-ledging. You even could perform the good old fly-pogo-skip to get to the first mossberry, one of the most famous speedrun skips in the original. However something was off. Enough people shared their opinion about the diagonal pogo already, but there was more. Enemies were more aggressive, did more damage, stayed out of reach. With Hollow Knight basically everything rushed to you. In Silksong you had to rush to them.\n\nGetting to that feeling and realization was an interesting journey. Over the course of 80 hours I learned to play like Hornet, not like Ghost. The gameplay feels as smooth, if not smoother, than the first game. Precise, agile, fast, empowering, punishing. Every button press does what it is supposed to do. Every attack flies as it should. Every ledge gets climbed as long as you do it right.\n\nThe beginning was rough with the difficulty curve feeling so different than Hollow Knight’s. What I always loved about the first game was the relatively low entry barrier for its part soulslike DNA. Fighting the False Knight was so easy and so predictable and still you had to get used to the idea of a soulslike-metroidvania. However, with years in the making, the Hollow-Like-Genre now existed.\n\nSo the gloves were off.\n\nSilksong is challenging from the get-go. You run into a wall expecting a smooth start and that threw people off. However after some time everything changes. Once you learn to play as Hornet the game becomes surprisingly easy. Or is it something else that changes?\n\n\n[b]The exploration:[/b]\nLeading to the second big part: The exploration. You've got yourself a world full of wonders, secrets and mysteries, bosses and lore come hand in hand. It never gets old, when you come to a room with something that you marked earlier, just to find that there is A WHOLE NEW AREA you didn't know about right there. I had that feeling with the [spoiler]Sands of Karak[/spoiler] just popping there out of nowhere. I remember being basically done with the game (or so I thought), realizing that according to Steam achievements I was still missing more than five maps.\n\nInterestingly enough I think of Silksong as a much more linear game than Hollow Knight. Every area [i]felt[/i] like it was the only real way to go. Yes, you do learn later on, that there are different routes. But Pharloom was an empire built by a society, not a natural cave being inhabited by different bugs. It was only when I saw people missing other parts of the map than me, that I realized, that perhaps my way to approach an Metroidvania has changed.\n\nAnd yet - the amount of content you could discover was off this world.\n\nHowever, psychology is an interesting thing. I remember the pure joy of Hollow Knight, when beating a boss and hundreds of Geo popping out, charms being unlocked, mask shards being earned - And I remember the emptiness, when beating nearly any boss in [spoiler]Act 1[/spoiler] more often than not just leading to an unlocked story progression and perhaps some shell shards. Early on exploration felt meaningless, because there just were no real rewards and this was only reinforced by the feeling, that early-game-maps for Silksong just weren't as exciting until you reach [spoiler]Bellheart[/spoiler], as too many of them felt same-y once you leave Moss Grotto. This changes, but it does do a bad first impression.\n\nTo me, all of this ties into the world, that Team Cherry wanted to build. But more on that later.\n\nThis problem solved itself with [spoiler]Act 2[/spoiler] big times. I felt the effect setting in incredibly fast once I started that part of the game and I suddenly got rewards so fast, that I actually was progressing as a character. After that, the game got easier as you went. Power came with exploration - after you crossed a certain threshhold. It pains me to say that my itch for exploration was lessened by this simple change. However I do want to emphasize the greatness, that this game’s map goes to. The map and it’s variety is incredible with lore built right into it.\n\nIt should be fun, exploring Pharloom.\n\n\n[b]The story and the Writing:[/b]\nAs with its predecessor the story tells itself through a world built with care and thought. Unlike its predecessor, Silksong is easily understandable by just playing the game. The story is much less obscure, with Hornet actually able to speak as a matter of fact. While the quality of the world is as incredible as the masterpiece that was Hallownest before, to me the story of Silksong was just a bit less intriguing than Hollow Knight. The stakes were lower and the narrative challenge felt more achievable. The world, through being more perceivable, was less mysterious compared to saving and exploring the haunted kingdom of Hallownest.\n\nAnd yet, my heart jumped with joy as I realized, that there is indeed [spoiler]an Act 3[/spoiler]. So take that as a hint, at how good the writing actually is.\n\nI do have to move into heavy spoilers here for the last part of this section.\n[spoiler]I have mentioned one thing many times before: Everything changes, once you leave Act 1 and enter Act 2. To me, this is no coincidence. To me, this screams one thing: Silksong is a story about hyper-capitalism or the nature of cults or whatever. Don't worry please, I won't get into politics here, but just for a moment reminisce about the nature of Pharloom. It is a society built upon many trying to get into the big citadel that have barely nothing. There are no fancy structures in Act 1, the only real city is built out of the bells being thrown away by the citadel. Even in the citadel, there are 2 classes. And to no one’s surprise, once you reach the citadel, you get money, mask shards, tools and all of that galore. This is Team cherry telling us: Yes, there is much wealth in these “holy” halls – but they built this up on the backs of the simple bugs, that offer everything they have for a chance of salvation. Not all, that shines, is gold.\n\nThe citadel is no gold.[/spoiler]\n\n\n[b]Music, graphic and technical stuff:[/b]\nThe music from Christopher Larkin is an enormous feat to bring Team Cherry’s game(s) to life. How can you not love about nearly every music after [spoiler]Act 1[/spoiler], how can you not love the main story boss fights music like [spoiler]Weaver, Clockwork Dancers, Phantom, First Sinner[/spoiler] and so many more? As with so many parts of Silksong, the music just gets better, as you progress through the game. The quality is sheer immense.\n\n[i](The last 20 % of the review are in the comment)[/i]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An absolute masterpiece of a game. Builds upon Hollow Knight in a few ways, such as improved movement and additional methods of fighting. A must play for metroidvania fans, just like the first one.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's so good, every part of this game is created with passion. \nGameplay\nArt\nMusic\nWorld\n10/10.\nIf there is any criticism, the challenge of this game is not for everyone. You must be willing to learn from your mistakes and earn your success. You may get stuck on a challenge, but persistence pays off. It never feels unfair, you just have to \"git gud\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well... What more can I say besides what's already been said? Can you tell me? \nBut whatever, I'm gonna say my opinion. In a few words Silksong is a perfect sequel, it's so perfect that does not feel like a sequel, I mean the art is the same but the combat, the music, even the characters feel different, is like Replaying Hollow Knight, Silksong is like a completely different game, this feeling is completely different from that of the other games, think in a sequel... ready? Ok, If you think in COD sequel well that doesn't count haha, but think in Ghost of Yotei, DS2, Red dead Redemption 2, Dying light 2, etc. All of those sequels feel like the same but more smooth or new or whatever, but Silksong feels like a completely different but nostalgic, you know? It's difficult to me to describe it but I like to think the people can understand me.\nOk perhaps those were not a few words hahaha. To the end I'm gonna say something about the difficulty. Silksong is hard in some parts, there are some bosses who are really hard but not impossible, but for me the platform zones sometimes are really impossible hehehe.\nIn brief: Silksong is a good, fun, beautiful, hard and addictive game, so buy it! \n\nShawwww!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For its price and the hype its worth it \nBut it feels overrated after all\n\nHK1 was so much more fun and offered a feeling of success after bosses\n\nI cant also bear the fact that simple creatures deal 2 damage as if they are a boss while the boss was so much easier to deal with",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Twice as big as the original Hollow Knight, and even better, a steal for 20 dollars.  Perhaps it's even the best Metroidvania I have ever played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just an absolute, unmatched masterpiece. \n\nI jumped on the on the Hollow Knight ship pretty late, about a month before Silksong came out. While I enjoyed the og and gladly 100%, it didn't blow me away. I certainly didn't expect how MUCH the sequel will blow me away. It elevated all the aspects of og in such deep, expansive ways, I don't even know where to begin. The art, as gorgeous as before, is now more diverse and grandiose, and the amount of different unique enemy, boss, and npc designs is astounding. Mechanically, while it is famously very difficult and often punishing, the core game design principle of finding your way around by experimenting with different crests, tools, other knick-knacks, simply going somewhere else, or brute forcing through any challenge through sheer will power makes any encounter a little puzzle that is so much rewarding to solve. It is probably the only sequel that assumes you've played the first game, and builds upon that, which doesn't exactly make this game friendly for newcomers, but I can't help but appreciate this design choice - because it makes you feel like devs trust you well enough to not waste your time with recycling old stuff. The world is massive, and it is equally a massive joy to explore it. And music! Oh, don't let me start on music. Straight up the best original OST of the last few years. Just a handful of really powerful tracks is more memorable and emotional than anything else that came out this year. And yes, I played E33. Hornet is a great protagonist, and uncovering the story of Pharloom through her direct, but also gentle and wise voice is another huge step up from the og. \n\nAnyway, \nPoshanka!",
      "voted_up": true,
      "votes_helpful": 3
    }
  ],
  "negative": [
    {
      "review": "I have love and hate relationship with this game. It is super polished and exploring the map is really fun. Some of the bosses are also super fun to fight. However, significant portion of the game is designed around being \"tedious\" hard than \"fun\" hard as other reviewers mentioned. So many encounters and runbacks are designed to waste your time. Backpedaling flying enemies, multiple massive bosses bloating your screen, platforming sections with little to no checkpoints, and many more issues drag down what could have been a masterpiece of a game.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "How would you rate a game, where 80% are awesome and 20% make you question the sanity of its creators? There's a saying that if you put a spoon of shit into a barrel of honey, you will end up with a barrel of shit. This is how I feel about Silksong.\n\nIt has very high highs and extremely low lows. It's a masterpiece in world building, the level design to some extent, the atmosphere and environmental storytelling are great. Unfortunately, all of it is ruined by game design decisions, which just make the game straight unfun.\n\nThe main issue is that game does not respect your time, and overstays its welcome if you decide to 100% it. In act 2 I installed the teleport mod (and it was the only change I made to the game), because I was just tired of running around the same areas dozens of times. I get it that it's a metroidvania, and you're supposed to explore and do multiple runs of the same areas, but backtracking is really pushed into the unfun zone, especially if you're not following any guides and try to figure everything out on your own. This could have been mitigated by more generous fast travel system, like, porting to benches, or at least having a build in teleport in the game.\n\nSecond issue, and it's a big one, is how the game tries to make you feel. It raised a lot of discussions in the media regarding what makes the game fun, where lies that boundary where game's challenges are to its detriment. There was one video which made a good point, IMO, that we rarely mind the games which are difficult, but not punishing (e.g. Elden Ring), or the games that are relatively easy, but very punishing (most roguelites). Issue with Silksong is that it's both difficult and punishing. Dying is very real, happens often, and the progress setback can be tremendous.\n\nA lot of game design decisions are aimed at forcing you in a constant state of anxiety, where you are afraid of losing your progress and resources. Platforming sections can go for a long time without checkpoints, and death can set you a few minutes back. Bosses have notoriously long runbacks, and often require you to clear a gauntlet before you can even fight them. Your tools use a resource which is not replenished after death. All of this puts a real weight on you to stay alive, and it's not a game where you can one-shot all encounters just by being cautious. A lot of platforming sections and bossfights require you to gradually learn and progress them. \n\nThe idea here is that the more you build the anxiety up, the better it will feel when you finally overcome challenge or reach safety. Problem is that I don't feel anything apart from relief. I kill a boss and my only thought is: thank god I don't have to do it again. The game annoys you more than it makes you feel good.\n\nThere are also smaller game design decisions that just make you annoyed or frustrated. The design of flying enemies, for example. They always try to stay out of your melee range, either doing ranged attacks from the corner of the screen, or just sweeping across with a melee attacks immediately moving out of your range. It can be fun trying to figure the tactics out when you fight them for the first time, but you encounter them just so much and so often that dealing them becomes annoying simply because of how much time they waste.\n\nThe fact that TC loves to put flying enemies in gauntlets or in the middle of the bossfights does not help either. A lot of encounters end up very chaotic, and you're practically forced to tool dump if you want to keep your sanity, and it puts even more weight on you to stay alive. I think, there's a universal agreement that double bossfights don't work unless boss movesets are fully synchronized, or AI is built in a way that it's unlikely that you're fucked by overlapping attacks. TC made masterclass double bossfight in their previous game (Mantis Lords) and some good ones as well (God Eater, Watcher Knights), it's incomprehensible to me how they managed to drop the ball in Silksong so spectacularly. There are a lot of fights where you're not methodically learning the complex movesets, you're just trying to survive the chaos and clutch victory by some luck, without really feeling that you even deserved it. You're just glad its over.\n\nIMO, the main issue of the game is that Team Cherry worked in isolation for so long. They had no outside input, they did not know whom are they balancing the game for, and they ended up making a very niche product which caters either to people who were very good at the original game (speedrunners, pantheon players), or to people who can't have fun without high stakes and anxiety.\n\nI absolutely loved Hollow Knight and finished it 4 times. I managed to 100% Silksong, but I kept going on pure spite. I am done with it, and I am never touching it ever again. I love difficult games, but I prefer my skills and wits being tested, not my patience or tenacity. Unless you know what you're getting yourself into, I do not recommend this game.\n\nIf you still decide to try Silksong, and you don't find some aspects fun, or feel overwhelmed, try out mods. A lot of people reported that they made the game better.",
      "voted_up": false,
      "votes_helpful": 139
    },
    {
      "review": "This is a tough 'would not recommend' for me. It's honestly a 7 or 8 out of 10, but finding the fun in the game is incredibly frustrating at points, and in ways that didn't exist in Hollow Knight. \n\nBoss difficulty? Fine. Runback length? Actually fine, if it's too long there's a shorter way you haven't discovered. The problem for me is the myriad small ways the game just doesn't respect your time:\n\n- MANY important things are very hidden, which means you have to hit every wall in the game if you aren't using a guide. \n- For some strange reason, they added MMO style fetch quests of 'go collect 10 bear belts' all over the game. Most of the quests are fine, and anything where you have to go kill or collect something unique is great. But this? Bleh. And there's so many of them. \n- Once you get about 60% of the way through Act 2, you've explored 95% of the map. The rest of the game has so much backtracking that the back half of the game REALLY drags. And if you want to see all the content in Act 3, you either have to rexplore the entire map again or use a guide. There's a lot of cool stuff to do, but not enough to justify the 70% of the map that has nothing new to it in this act. \n- There is one particularly annoying unskippable cutscene you will see dozens of times that wastes 30 seconds of your life each time for several boss fights in act 3 (if you're there you know what I mean)\n\nSilksong has some incredibly high peaks. There are boss fights that are way more emotional than you'd expect from any metroidvania. The movement and platforming is tight (tighter and more nuanced than Hollow Knight). The art, story, and music are all on point and make for a great sequel. But the map is a little too big, a little too empty at times. The game is a little too long, and there are so many small annoyances that the magic easily gets lost, especially in the back half of the game. I'm going to finish it, but by the time I got to 95% I was ready to just be done. \n\nWould not recommend to anyone unless they really love the metroidvania genre. If you don't, I'd just recommend watching someone else play it instead.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "There are a lot of things to love about Silksong. Highly detailed, smartly designed areas, beautiful music, intricate and complex fighting system, the lore that was developed with sincere care, a ton of secrets to explore... So much truly fantastic stuff that was spoiled for me by a stupidly over-the-top difficulty. \r\n\r\nI get it, there are games that are made to challenge players – and I'm not a stranger to loving such projects. Sekiro and Lies of P made me swear and sweat so much that at some moments I wanted to quit them – or smash my gamepad against the wall. Some episodes of Silksong's predecessor, Hollow Knight, were extremely unforgiving and took everything to beat them—such as the White Palace or the Colosseum final stage. But every time my character died in those games I felt that was fair. It was the lack of skills from my side, my impatience, my misunderstanding of games' rules. Those games were very hard – but fair and rewarding. Every victory in them felt well deserved, well timed and brought something cool as a prize – from a new tool to a cool plot turn. \r\n\r\nBut Silksong... It is just a challenge after challenge after challenge. Like everything the game designer cared about was how to make player's experience more difficult. Enemies have a ridiculous amount of health, and needle upgrades don't help much — especially in the third act. Most of them are almost unreachable for your attacks, since those are pretty evasive fliers. And there are a lot of them. A LOT: developers are obsessed with locking you in in a small room where you have to fight one wave of enemies after another. Bosses constantly spam their minions, so in addition to dealing with one lethal threat with quirky attack patterns you have to monitor another 2-3 less dangerous enemies, wasting your focus in the process. Using combat tools in such situations sounds like a cool concept, but they require resources to craft — and you'll find that you are out of those pretty soon, and must tediously farm them. Now add the fact that almost everything in this game could kill you in 3-4 touches (hi, dear contact damage), polish it with the lack of checkpoints and the need of going through a boring runback across the half of the map on some bosses. And, finally, put some bugs with controls which aren't very user-friendly from the get-go. Now you see the whole picture.\r\n\r\nSilksong is a great game for competitive players whose life is dedicated to gaming, I guess. Unfortunately, I'm not one of them – and can't recommend Silksong to any relatively casual gamer, such as myself. If you are ready to dedicate a huge chunk of your time and energy to master it, and okay with all the pain of this process, you'll be highly rewarded with the things from the first paragraph. Otherwise, just save your money.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Hollow Knight: Silksong pushed me to the absolute limits of how hard a game can be and still have me WANT to keep trying. It demanded possibly too much in some areas and I reached my personal breaking point during Act 3 and the Coral Tower. At this point, I was trying to prove i could complete Act 3 and get the true ending and that I was a good enough gamer or something…\n\nBut it finally hit me that I wasn’t having fun anymore. It pains me to say that because I felt like getting through Act 1 and Act 2 was hard and challenging but doable. Exploring the world and meeting the characters enjoying the soundtrack and the character voices. That was all peak gaming for me, and once I rolled credits twice to do the (2) different actions with the fake end boss… I thought ok maybe Act 3 will provide some memorable bosses or something NEW. I was disappointed to find its basically the same game but less fun and more fetch quests and more gauntlets where waves of enemies with annoying flight patterns and cheap feeling tactics.\n\nI know many people explained in greater detail why they love or hate the arena style gauntlets with waves of enemies, and the reasonable ones I found a nice challenge, and the unreasonable ones made me hate the game. \n\nI think that is the real tragedy of this game is that I LOVE this game in its beautiful brutality and it’s demanding near perfection from me. But the final taste in my mouth will be the Coral Tower and that stupid gauntlets of waves of annoying enemies where I could only get through 3 waves without dying. I could not get to the boss of this section which seems like a cool boss from the videos I’ve seen, but I won’t get to experience it or the other Act 3 bosses. I am left with ironically a HOLLOW feeling inside of me that I wasted 90 hrs on a game that wanted me to fail and in the end, I did fail to complete Act 3. Was this because I am terrible at action games or metroidvania style games? No. I’ve played and beaten everything from Dark Souls 3, Bloodborne, Sekiro to Elden Ring. But with those games, I walked away feeling amazing and that I did something really special. \n\nIn the end, Silksong made me feel hollow inside and made me think I wasted 90 hrs on something that was designed to make me fail anyways. Even though I loved the score the look and feel of the world and the way the game played, the difficulty just always kept me at arms length when I was trying to LOVE this game, it kept telling me it only wanted me to fail. \n\nI can’t recommend this game or that others go though this same experience. To me, it’s not worth it and I rather go play something fun or story driven instead of driven to frustrate me. I want to be challenged yes, but mostly I want to be entertained. Think of how you felt when you finished The Last of Us, God of War, Half Life 2, Elden Ring…most people wanted to start another play through or get all the achievements they missed.\n\nWith Silksong, it will be uninstalled and never played again and any DLC skipped. I could go on and on about why after 90 hrs I am disappointed or dive into why these gauntlets are fair or unfair, but the main theme is I felt hollow and unsatisfied by Silksong despite its many brilliant touches and moments scattered throughout. This game left me empty inside.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "I've been putting this review off to see if there would be any major adjustments to the balance or gameplay, and having given it a couple months, I assume it's unlikely there will be any. I was a fan of Hollow Knight, appreciated a lot of the gameplay, and got pretty far, but never to what I would consider ridiculous levels with Godhome, Speedruns, or Steel Soul. Though I did play modded randomizers because they were interesting. I would freely describe myself as a casual+ kind of player, with mostly average if not below average skills, but ridiculously tenacious.\n\nAfter playing the game for some time, and having gotten partway through Act 2, I just couldn't justify continuing through the game. Act 1 alone was a challenge where I was only just able to make it through by hammering away at every side path I could find, and challenging basically any boss I could find, despite feeling like I wasn't prepared enough even after exhausting any avenue. When I had finally run out of places to explore, I spent hours fighting the Judge, then eventually beat her to startlingly little enjoyment. Going through Act 2, it feels like an endurance test to see how long you can do everything without being hit, but the platforming has jumped beyond Path of Pain from HK, and invented 10 new angles you have to implement in order to get nothing but map progress.\n\nCurrently, I have the option of grinding for potential upgrades in the form of gadgets and tool kits, where I could rework my entire playstyle around whatever I may get, as well as trying the other crests that are offered, but would require me investing brand new memory slots and time practicing and learning to use. My other option for needle upgrade or completion of wishes requiring me to deliver bundles without using fast travel or taking damage across massive sections of the map that I'd be lucky to survive crossing, let alone without damage.\n\nThis may be different for more skillful players, but from my time played, this game doesn't gently suggest anything. You do anything circumstances demand of you, and that includes relearning from start to finish how to play the game. I'm not good enough to play through this seriously, so I just don't want to play.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This is such a great game in terms of the world, story, visuals, music and gameplay mechanics (and the cost of the game is almost ridiculously low) but it’s massively let down by what I am going to call overly sadistic game design. I almost stopped playing the game completely at one point because I was getting so tired of one punishing challenge after another (honestly think I should have just dropped it there for good). I actually said out loud \"I do not play video games to feel this frustrated.\" Worth noting I'm not a slouch when it comes to games, I've beaten plenty of hard ones.\n\nI cannot in good faith recommend this game to most players as this feels tailored towards the elitists who loved the hardest and most punishing challenges in the original HK and wanted basically an entire game's worth of that. In the original the especially hard parts were largely optional whereas here it’s the entire game - it's unrelenting and I felt exhausted by the end of it. I also think the way in which the game is hard feels very unrewarding:\n[list]\n[*]Regular enemies are annoying - they have bloated HP and too many deal double damage.\n[*]Flying enemy AI is beyond frustrating - they always hover just out of reach and pelt you with projectiles.\n[*]Too many hazards deal double damage - it’s overly punishing.\n[*]No contact damage with a stationary enemy should do double damage.\n[*]Too many platforming sections have annoying flying enemies midway through who will almost inevitably hit you while you are trying to navigate the platforming.\n[*]Far too many bosses have regular enemy gauntlets before them. Rather than this be a rare occurrence that fits thematically, it feels like most of the time. It’s just tedious.\n[*]Too many bosses also swarm you with regular enemies and at times you can have almost literally nowhere to go without getting hit if the enemy AI moves in a certain way.\n[*]Bosses have too much HP and become an endurance test unless you start utilising most likely one of a few handful of tactics to eat away at their health (I'm looking at you cogflies, tacks and poison).\n[*]Shard and tool balance is off. I think ideally the game would just be better if you could use your tools to their limits after every bench rest without any shard economy at all, as it can lead to mind-numbing grinding if you use your tools on a boss too many times and fail. And using tools on the bosses feels mandatory when they start getting harder. The additional allowance in tool use could make fighting regular enemies less frustrating as well.\n[*]Some rewards were really underwhelming, consisting of a few beads or shards that were pitiful in quantity.\n[*]I felt like maxing out everything in prep for the final bosses / final boss was mandatory rather than optional, especially given some of the above points.\n[/list]\nTeam Cherry - I think you came extremely close to making an amazing game but lost sight of what is fun and enjoyable. I could happily replay the original HK any time, but I won’t be touching Silksong with a barge pole unless you make serious changes to the difficulty (just add a separate \"hard mode\" for the elitists keeping it as-is).",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Wonderful game!...\n\nDon't play it to beat it though- the difficulty hits multiple walls, and 'git gud' only goes so far. They tweaked the difficulty WAY too high to be anything enjoyable. I made it all the way to Act 3, but then every single challenge was beyond my means with no hope in sight. After 80+ attempts at various arenas or bosses across the map with no progress to speak of, it's time for a long, long break.  And to chime in that this isn't fun anymore. At least Dark Souls was fair.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "девелоперов силксонга демоны иглами кололи в яйца чтобы те не дай бог сделали игру в которую реально приятно играть, душная zaлупа которую буду вспоминать с отвращением, потому что видел красоты локаций и саундтрека первого хк, до которых сиквел не дотягивает",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is more interested in testing your patience rather than your skill.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "This game would be absolutely incredible if it weren't for a handful of baffling design choices and terrible balancing. The world, art, story, music, everything is top tier. Even the combat, if I ignore the balancing issues, is fun and engaging. The game has some genuinely enjoyable sections but partway through act 3 I gave in and installed mods to limit all hits to 1 mask, give more i-frames when taking damage, and allow re-spawning at the start of every room. I wish I'd installed them sooner because my enjoyment of the game increased significantly afterwards. \r\n\r\nThe game is so close but it's problems make it impossible for me to recommend as is. \r\n\r\n---SPOILERS AHEAD---\r\n\r\n1. The damage you take is insane. Enemies frequently deal 2 masks of damage, meaning early game you can take 3-4 hits before death. This doesn't change after you get your first mask upgrade since it only adds 1 health, bringing you to 6, so still 3-4 hits. On top of that enemies more frequently deal 2 masks of damage, along with environmental hazards, meaning you'll be dead in 3 hits more often than not. \r\n\r\n2. You get next to no i-frames on being hit. You will often be hit twice by the same attack or hit into a hazard or another enemy meaning that those 3-6 hits you get depending on how far into the game you are often more like 2-4. \r\n\r\n3. The contact damage is also often 2 masks. Frankly I don't think some enemies in this game should even have contact damage, let alone dealing as much damage as they do when you can get hit into them and by an attack that has already done 2 masks of damage. Worst case you end up bouncing between 3+ enemies because you don't get any recovery time and a single hit turns into a one-shot.\r\n\r\n4. Boss runbacks are tedious at best and brutally frustrating at worst. I understand making the level a part of the boss fight in theory but in practice it just results in frustration as you want to fight the actual boss you're having trouble against so you can improve but it takes literal minutes to arrive in some cases and you'll almost certainly have taken damage along the way. The boss that then does far more damage than is reasonable because of the previous 3 points will kill you in a fraction of the time it took you to get back to it.\r\n\r\n5. Then we  have the healing. On paper its functionally similar to hollow knights heal. But in practice it heals around half as much per amount of silk/soul you have due to the extra damage. Getting interupted when healing and losing not just 1 heal of silk but your entire bar doesn't feel challenging, it feels unfair.\r\n\r\nThe above points all sum up to make this game needlessly punishing, as if the game is expecting you to have mastered every boss's patterns before even having seen it. The game feels designed as though you should never need to recover from a mistake because you shouldn't make them in the first place. \r\n\r\nThat alone would make this game hard to recommend but there's more I'll lay out here:\r\n\r\n- Tools are 90% of the time useless. They feel like the \"pick a superpower and the next person ruins it\" thing. They all either do no where near enough damage to be a sane choice or have such a brutal downside that you'd never consider them with the balance issues I put above.\r\n\r\n- Silk skills are also 90% useless. They take the same resource as your healing which wasn't much of a problem in hollow knight but in silk song, you feel like you desperately need every heal you can salvage so why on earth would you spend silk on frankly underwhelming skills that might not even hit (looking at you rune rage).\r\n\r\n- The shard system just means grinding somewhere every handful of boss attempts to be able to use the tools in the fight, which isn't actually a problem until you get cog flies since, like I said, most tools are useless anyway.\r\n\r\n- The crests are a neat idea but a handful of them feel very hard to justify using. Beast and Witch making healing even less reliable, architect having awkward as hell needle attacks, and only a couple of the crests even having a use able downwards attack really narrows the choice a lot of players will have. I personally used wanderers until I got the witch crest and was so close to going back to wanderers because of the terrible range on witch crest heal and I know for a fact other players have gotten the crest they were excited for and been so disappointed and not used it for similar reasons.\r\n\r\n- Rosaries are hard to come by and hold onto and the game frequently makes you spend them on things that, imo, should not cost money. \r\n\r\n- The game almost discourages exploration. Losing your cocoon because you still hadn't found a bench after 20 minutes of trying to get through an area makes you not want to look around. And when the rewards are often unhelpful like bad tools, shards to make bad tools, or loose rosaries you'll never be able to spend, it really makes you wonder why you would want to explore a new area.\r\n\r\nI'm sure there's more little annoyances I'm forgetting (like void attacks stealing silk for some reason) but I'll wrap up here. This game is so close to being amazing but it feels like team cherry don't want you to play it. In an effort to make hornet feel unwelcome in Pharloom, they've made the player feel unwelcome as well.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I just want to clarify that I love silksong and do strongly recommend the game. The reason for giving it a negative review is exclusively to highlight in a noticeable fashion what I believe is the biggest issue in Silksong versus Hollow Knight: acquiring currency\r\n\r\nNearly every enemy in Hollow Knight drops geo regardless of circumstance (except in the colosseum but you get payed at the end anyways), geo at most bounces a few times on the ground and it doesn't break on spikes meaning you can pick it up with the Gathering Swarm charm.\r\n\r\nSilksong on the other hand decides that only enemies that would carry rosaries for lore will drop them on death. Enemies that would drop rosaries don't if you're fighting them in an \"arena\" setting. Rosaries bounce AND ROLL on top of breaking on spikes (and their equivalents throughout the various areas in the game) meaning that the main use for the magnet tool is to save time picking them up and/or saving any rosaries on the brink of destruction.\r\n\r\nI can also bring up how many enemies do more damage with the relative same amount of health to hollow knight meaning that it's more likely you'll lose your rosaries in Silksong from dying. But I want to put articulate that, as someone who played Steel soul mode to 100% and then some, that my issue is not how hard it is to keep rosaries because of a skill issue. Rather, my problem is that I would rather not have to grind out the remaining amount of rosaries I need for buying both necessary (for completion) and accessory items and that I believe the combination of all the factors I list above is the primary culprit for making acquiring them more of a chore than it has to be. \r\n\r\nI'd be extremely curious to see how many rosaries are lost in a given playthrough due to them breaking and/or how many would be gained if enemies that are supposed to have rosaries always dropped them. \r\n\r\nSuffice to say: I love this game. I'm just curious as to what people's thoughts are on if this aspect is more abrasive than it should be,",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "[h1]Sigh. Here goes.[/h1]\n\nI really wish Steam had a middle rating for this, because Silksong is not a bad game. A lot of it is actually [b]very[/b] good. The environments are gorgeous, Christopher Larkin's soundtrack is incredible, and Hornet's movements are very fluid and satisfying to pull off. It's clear that an enormous amount of craft and love went into building the game, which is why I hate that I'm giving it a thumbs down [b](TL;DR at the bottom).[/b]\n\nMy problem isn't with the art direction, performance, or animation polish. It's not even with the increased enemy damage or the new charm system - I can respect Team Cherry for wanting Silksong to be its own thing and not just be Hollow Knight 2. \n\nMy issue is the game's underlying philosophy, the [b]way[/b] it chooses to be difficult. Silksong often feels like it [b]does not respect the player[/b].\n\nHollow Knight was challenging, but it was also [i]very[/i] consistent. A bench meant safety (with one famous exception). A station meant travel. Risks were rewarded in predictable ways. When the game broke its own rules, it did so both [b]purposefully[/b] [i]and[/i] [b]sparingly[/b]. You always had the sense that even if it was difficult, the game [b]wanted[/b] you to succeed, that even the hardest segments were something you could learn and overcome. From the Forgotten Crossroads to the Path of Pain, the game as a whole never felt like it was out to get you. I can only think of one time where the game made me go \"Seriously?\" - [spoiler]those two Kingsmoulds at the end of the Path of Pain.[/spoiler] For the entirety of the game, there was a quiet trust between the player and the developer. Hollow Knight trusted me, and I, in turn, trusted it.\n\n[b]I found Silksong to be breaking that trust constantly[/b].\n\n\n[h2]\"Gotcha\" Design[/h2]\n\nSilksong often sets up moments that promise relief or reward, only to punish you instead. Some benches are traps, others require repairs that force additional parkour, and some even cost currency per use - all in a game where difficulty is higher and currency is far scarcer than in Hollow Knight. Routes are filled with \"gotcha\" ambushes, punishment disguised as reward, and many encounters and gauntlets that feel designed to exhaust rather than challenge. I remember finishing a tough platforming sequence with barely any health left, only to be locked into a room with a mini-boss that I had no chance of surviving. My reaction wasn't \"Aw man, I'll get 'em next time.\" It was [b]\"You didn't have to do that to me,\"[/b] and that wasn't the first time I had said that. \n\nSomeone else described Silksong as \"beautiful, but dripping with malice\" in their own review, and I have to agree. Hollow Knight's difficulty felt like training to grow stronger, while Silksong's difficulty often feels like someone pushing your shoulder while you lift weights. The latter is technically harder, but not as constructive or as fun as the former.\n\n\n[h2]Intended Tone vs. Execution[/h2]\n\nI didn't realize this until after I stopped playing, but according to Team Cherry, Silksong was intended as a \"perfect jumping-on point for new players.\" If that was truly the goal, then I have to say that the game misses it completely. This does not feel like a welcoming entry to the series. It feels like a game made for people who have already mastered Hollow Knight. Add to this the fact that only a small number of people were involved in playtesting, and it's hard not to come to the conclusion that the experience seems calibrated for a tiny subset of very high-skill players. Unfortunately, not everyone is as great as speedrunners like BlackMoon or fireb0rn.\n\nI can understand the intended tone: Hornet is in an unfamiliar, hostile land. The player should feel uneasy. But the execution comes across as antagonistic rather than atmospheric. If I had to describe it simply, Hallownest felt indifferent to you, while Pharloom feels irritated that you even showed up.\n\n\n[h2]Concluding Thoughts[/h2]\n\nLong rant aside, at some point, I realized I was playing a game that didn’t seem to want me to beat it - a game that no longer extended the quiet trust that Hollow Knight had. Once I noticed that, it became impossible to ignore. The game is definitely beatable, and I commend anyone who has done it - you should feel proud. But after completing Act 1 and a lot of Act 2 in ~24 hours of gameplay, I realized I had simply stopped having fun. Based on what I've heard about the rest of Act 2 and all of Act 3, I have no reason to believe the experience will change. I don't want to force myself to enjoy something just because I wish it were different. If you thrive on relentless challenge, don't mind the additional frustration, or if you play Pantheon 5 for fun, you will love this. And sincerely, I'm glad if you do, because there is a lot to admire here. Team Cherry crafted a game that deserves some love. But for most players - and especially for newcomers - I strongly recommend caution before you buy, or start with Hollow Knight first.\n\n[b]TL;DR[/b] - Silksong is a beautiful game that frequently breaks the quiet trust between developer and player. That trust is what made Hollow Knight’s difficulty feel rewarding, and without it, Silksong’s challenge just isn’t enjoyable for me.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "While I hoped to enjoy this title as much as I loved Hollow Knight, I ultimately found myself unable to connect with it in the same way. A significant reason is what feels like an artificially heightened difficulty — every misstep carries a heavy penalty, and the platforming often feels more like a chore than a challenge. This constant tension does not allow one to simply appreciate the game’s otherwise impressive level design.\nSkill issue? Partly for sure, — there’s certainly a “git gud” element here — but I wasn’t seeking a game that demanded such consistent precision and focus at all times. The experience rarely allows you to relax or take a breather between intense sequences, which ultimately led to fatigue for me instead of engagement. \n\nThat said, the NPCs are a highlight (i am obsessed with Trobio)! Unfortunately, despite this, I found myself having to force play sessions after work rather than looking forward to them. The level design, while intricate, felt repetitive over time, like the same-ish sequence of pogo-like platforming challenges dressed in new environments and textures.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I hate to downvote this game, but the difficulty is unnecessarily high, to the point I have to stop playing the game for multiple days before coming back, unlike in HK.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Hard to be hard with no real point here.\nI finished it in 30 hours or so, not struggling much but the hard parts felt like they are frustrating just because.\nIts not the kind of hard that is fun to play in my opinion, its hard just for the sole purpose of being hard and annoying.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "игра полная хуета, ебал разрабов и фанатов игры в рот\nпрошёл на 100% чисто ради того, чтобы друг меньше выёбывался",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Well, where to start with silk song. First off I played hollow Knight and thoroughly enjoyed it right through to the end, and was hoping to have a similar experience with this game, or so I thought.  Graphics wise the game is visually stunning and the sound effects and score are equally amazing.  Character design for the enemy types and bosses is what you would expect from a Hollow Knight game, quite varied and always something to keep you interested.  However I very quickly started to notice that the difficulty balancing aspect of the game was nothing like Hollow Knight, don't get me wrong I like challenging games and have been a fan of the dark souls games from the very start and have enjoyed playing every one of them to their conclusion.  This is where the game for me personally fails BIG TIME.  Its not that the game is hard, it is, the problem comes from it being increasingly tedious doing the boss fights or sometimes even the arenas.  When your having to fight a boss sometimes over 30 times to win, it just sucks all of the fun out of the game and turns it from a pleasurable experience to a chore.  Sometimes benches are quite a way away from boss areas and you find yourself having to track back so far just to get beaten again until you finally learn the move set of the boss so you can beat it and move on.  It  has the opposite effect of feeling accomplishment and instead makes you feel very frustrated at times.  This is bad game design, and I know a lot of people will probably disagree with this in the comments, but isn't that what most of us play video games for, (enjoyment and a sense of accomplishment).  Without too many spoilers, I decided to punish myself more and do act 3.  This is the part that just outright pissed me off, the race with the speed master.  Which idiot decided it would be a good idea to put a pair of speed anklets in the game and then not let you use them to race a character that can go way faster than you, with increased difficulty every round.  The tiny bit of fun I was having with this game, well this put an end to it.  I don't know about everyone else but I like to relax at the end of a day with a good game, this had the opposite effect and made me even more stressed.  So I cant recommend this game, it is a huge shame because it has so much potential, and could have being an excellent sequel or prequel depending on which camp you are in to the first.  I can only hope the developers listen to the critique and take on board the frustrations when designing their next game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Great game, would not recommend to everyone. The rewards doesn't make up for the frustrations, and sometimes it feels like the game is punishing just for the sake of it. All that said, there are some folks who will still have a great time with the game. I just cannot recommend it to everyone.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "coming from someone who loved the first game, I really disliked some of the game design choices made here.\n-It felt artificially hard with double damage. I want to challenge to come from fun boss design, not reduced health.\n-money was far too scarce, why would you want your players to farm?\n-Not a fan of how many arenas there were. It was a treat in the first game, but a slog here.\n\nThere were some moments that shined, and I really enjoyed some of the classic boss fights. But I hope Team Cherry understands the concerns from their passionate fans for future projects.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "i really want to say i like this game but I find it hard to when everything in it is so infuriating. i wouldn't say this is a bad game. I would even go to say this is a good game. but it feels like every corner you turn the game is trying to say FUCK YOU, KILL YOURSELF. with its annoying platforming, enemy's and tasks. this game has enjoyable parts to it which really makes it a shame that a lot of the game feels like a slog to get through because of the how weirdly difficult everything is. whenever i get on this game it either feels like I'm forcing myself too because my love for the first game but very few times after I've played it i enjoyed my time after. i really tried to enjoy the game and i will still be trying after this review but i couldn't recommend this game to anyone who's isn't already a big fan of hollow knight or likes rage games. it oh so doesn't help when every someone bring up something negative about this game the community says they have a skill issue and to get over it. (oh so one more thing i feel like this game being more parry focused wasn't the best idea since hollow knight wasn't really known for its parry system and this game doesn't really do much to add to it. plus parrying a enemy's relies on you knowing their move set and their attack times so when silk song throws in 100's of different enemy's with different move sets you don't get the chance to properly learn how to parry one before a new enemy's comes along and you have to learn their move set)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hollow Knight is a true masterpiece that anyone can play and enjoy, even if you are like me and never Git Gud, you can still enjoy it and finish it, a perfect game. Sadly Silksong falls short of this, clearly it is not designed for me or people like me that cannot \"Git Gud\".\n\nSilksong feels like its made to waste my time, long boss run backs, boss health is bigger to artificially increase difficulty making fights longer and tedious, boss contact damage dealing 2 masks making the slightest mistake fatal.\n\nOf course all of my complaints are due to me not being skilled enough, I am very sure that players that are not bad will enjoy this game and find many hours of fun. It is not a bad game its just not a game for people like me, so take this as a warning, the magic from the first game might be somewhere here but it is not easy to find, in my opinion it is clear the devs have no idea what made the first game good and so appreciated and they clearly cannot catch that lightning in a bottle again. They got my 20 Euros on this one since Hollow Knight was perfect but whatever they release next will not be on radar as it they clearly are not making games for me.\n\nSilksong is the Dark Souls 2 of the Hollow Knight series, it is not a bad game it can be enjoyed, just not by everyone like the first Hollow Knight. I wish everyone good luck on your \"pilgrimage\", I hope you can find the fun in this game as I could not.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[h1]Beautiful story, artwork, and music trapped by frustrating and unrewarding gameplay[/h1] \r\n\r\nHow many times have I put this game down thinking, \"Do you even want me to play your game?\" \r\n\r\n150 hours in and can't beat Act 3. I'm done. I have a full time job, I just come home from work, attempt a boss, fail, and repeat for the rest of the evening. A week later and I'm usually stuck on the same boss. \r\n\r\nThere is so much damn time wasting in this game. \r\n\r\nDouble damage is not a challenge. It's just a waste of time. \r\n\r\nRunbacks are not a challenge. They're just a waste of time. \r\n\r\nBosses that do AOE attacks that take up 75% of the screen and don't give you enough time to flee from the area are not a challenge. They're just a waste of time. \r\n\r\nBosses that scream in the middle of a fight and cancel your heal are not a challenge. They're just a waste of time. \r\n\r\nWhat's the reason for all the double damage? You have to grind, suffer, and endure countless indignities to get every health upgrade, just to have the same health the knight had in HK1. Every mask upgrade is cheapened because it's not worth a damn till you get another one. \r\n\r\nIt also makes exploration painful. The developers say that if you're having a hard time, explore further. Well, every room is full of flying guys that do homing projectile damage that follow you to the ends of the Earth, and every pit is full of spikes that do two damage. Why explore? It's just more pain, just like everything else in this game. \r\n\r\nWhere's the fun here? At some point I just have to call it. Git Gud isn't an adequate retort, it's just a cover for the many oversights the developers made in this game that trapped their pretty and artistically beautiful game underneath a totally ruthless, unfulfilling, and time-wasting experience.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "to the person who designed Bilewater and Groal: i wish you a long and happy life. i enjoyed the first game to the fullest. but silksong made me regret that i'm unemployed and have time to play video games\n\nupd: honestly the road to act 3 made it even worse",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "[b] English [/b]\n\nMy expectations were high because of the first game, and in a way, it started off well. But, even though some people excuse the fact that the game has to be difficult, there are clear level design problems, making it more frustrating than fun.\n\nI didn't have difficulty with Hollow Knight, but even if you're a pro-player who has the platinum trophy with your hands tied behind your back, this one exceeds the level of difficulty, making it impossible for casual players.\n\nThere are tons of artificial difficulties that I could list: enemies out of reach, too much damage, too little healing, traps, and a lack of flooring in battles, and so on.\n\nThe game has everything to be as good as the first, but for now, my review is negative. When I finish it, maybe I'll change it.\n\n[b] Português [/b]\n\nMinhas expectativas estavam altas por conta do primeiro jogo e, de certo modo, começou até bem. Mas, por mais que passem pano que o jogo tenha que ser difícel, há claros problemas de level design, cehga a ser mais frustante do que divertido. \n\nNão tive dificuldade com o Hollow Knight mas, por mais que você seja um pró-player, que tenha o platinado com as mãos nas costas, este aqui excede o nível de dificuldade que chega a torná-lo impossível para jogadores casuais.\n\nSão dificuladades artificiais aos montes que eu poderia numerá-las, inimigos fora de alcance, muito dano, pouca cura, armadilhas e falta de pisos em batalhas e por aí vai. \n\nO jogo tem tudo para ser tão bom quanto o primeiro mas, por enquanto, minha review é negativa. Quando terminá-lo, talvez eu altere.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is not as good as hollow knight.\r\n\r\nAfter only a few hours in the game a few glaring issues arise:\r\nThings do double damage. This is talked about a lot; it is probably the single biggest thing people talk about in this game. Frankly it is not talked about enough, as it hasent been corrected yet. There is no reason that touching an enemy should do half your health at the start of the game (yes even if its a boss), and if the thought was to make it challenging, I reccomend adding challenge rather than damage. There is a stark different between Difficulty, Punishment, and Unforgiving. Difficulty refers to your ability to use the tools given to succeed at a task, which relates to out-performing enemies or out-skilling platforming or out-exploring unlockables. Punishment refers to if you pay a price for mistakes: loosing a health if you miss your own attack is punishment. Unforgiving is the game shuts off when you make a single mistake. Having an enemy nearly kill you the instant it touches you is Unforgiving, all it does is add time and frusteration to reload the next attempt, and until all hits (or at least a vast majority of them, nearing the 95% mark) do one damage this game will never achieve the love the first one did. A hit based health system means a hit does 1. Period, end of story. If you want a fluctuation in damage, you will have a health bar and you will still balance it so the first boss cant 2-tap you. >:(\r\nThe exploration: the platforming asks for more than is intersting. long vertical jumping puzzles, or horizontal bouncing sections either kill you or drop you back at the bottom for the first mistake. Again, the difference between unforgiving and Punishment, Punishment would be to loose some progress, not all of it plus health. After a long exhausting jaunt through some exploration that had no save, I finally found a save point. I sat on it and it killed me, losing me an hour pf progress. You must be a true idiot to think this is interesting gameplay. You have pulled a prank on the player that causes anger and irritation. You tried to make a video game for fun, are you kidding me? Rocks fall, everyone dies, go home. It just feels a lot like HA HA sucks to be you. Even dark souls didnt do that, yes i know its hard but it still had respect for the player. everything was fully in your control at all times. This game hides traps in the background like a punk trying to make you fail.\r\nI know the developers wanted to make a challenging game, but they failed. They made a game that many dont get through. Again, I dont know where this modern idea that difficulty is measured in how many poeple actually succeed, its very easy to make a broken bad unfun game that isnt actually playable. Boom, perfect difficulty right there. (?)\r\n\r\nTeam cherry, I loved hollow knight to death. Please get your head out of your ass and ghasp for some air. The discussion for quality WILL NOT BEGIN until you have removed double damage, and im sorry that you dont understand that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Tldr: I should have not assumed Silksong's difficulty and should not have played this game first day, or at all. \n\nI will ONLY be talking about my first experience with the game (not the other few playthroughs where I've improved at the game.) There will be a few exceptions.\n\nA bit of info first:\n\nI was one of those people who had waited for the game for around 4 years, and I have to say, I had way more fun WAITING for the game to release than actually playing it. I really wanted to recommend this game to others, but, as said like a million times, the gameplay is punishing.\n\nAs a person who has played Hollow Knight (loved both [spoiler] Absolute Radiance [/spoiler] and platforming through [spoiler] Path of Pain [/spoiler] repeatedly btw), having over ~300+ hours in the game, I assumed that Silksong would be near the same, just a tad harder since Hornet's movement is advanced. The reason why I thought that Silksong's difficulty would be lesser than what it truly is even with the patches, was because there were few gameplay videos to go off of, that being showcase footage and the demo (the only bosses fully showcased being Moss Mother and Lace).\n\nSidenote, I had more fun playing Rain World, because I knew what to expect. The game and community clearly call it a hard game, so, I tolerate deaths and unfair moments in it.\n\nMy experience of my first Silksong gameplay (Only the important parts):\n\n\nBeginning:\nPlaying first day of release, I was SO excited! The graphics is nice, music is nice, [spoiler] Moss Mother [/spoiler] was a good starting boss in my opinion, I was getting used to Hornet's moveset. Gameplay was smooth for me until I got to [spoiler] Bell Beast [/spoiler] boss. Probably the second boss of the game ALREADY deals 2 damage. You only start off with 5 masks, which made said boss pretty frustrating to begin with.\n\nThe main part of Hollow Knight was to explore, so, I tried to with Silksong, now leading to [spoiler] Hunter's March [/spoiler], and fighting [spoiler] Savage Beastfly [/spoiler]. It was torture. I probably spent around an hour or two trying to fight it, because I was still weak, only having 5 masks still, no upgrades. Googling it and finding said boss optional, I found it was a waste of time and energy, dubbing down my experience exploring the game raw.\n\n\nFinally finding my way to [spoiler] Greymoor [spoiler], [spoiler] Moorwing [/spoiler] wasn't any better. It's easier due to the patch, but I played it first day. \n\n\nMiddle:\nMoving on to environmental stuff, [spoiler] Sinner's Road through Bilewater [/spoiler] was REALLY frustrating for me to get through, even in my future playthroughs. Both of those areas have pretty annoying enemies to get around, and the water Hornet could fall into, would make her silk drain down, and when you finally have enough to bind, it will only get rid of the drain, not heal her, making it an annoying experience.\n\nNow things that I actually liked later on, was [spoiler] The Last Judge [/spoiler] bossfight, not the runback. Yes, the boss was difficult at first, but for me, I figured out their pattern, and defeated them. Cool boss fight in my opinion.\n\n\nTowards the end of the game:\nNow [spoiler] the citadel [/spoiler], I'm going to explain two things, [spoiler] The high halls gauntlet [/spoiler] (the worst thing I've dealt with in the game), and of course, the final boss.\n\nEntering [spoiler] the citadel [/spoiler] was a MAGICAL experience, the music, the scenery, it was just really cool that Team Cherry developed such a place in their game. The enemies were pretty annoying, but since I've gotten better with Hornet's moveset throughout the playthrough, I've had a slightly better time avoiding enemies, and fighting when need be.\n\nMy favorite part of the game was fighting the [spoiler] Cogwork Dancers [/spoiler]. They had a unique boss fight style, going on tempo and stuff. It was cool weaving past attacks as they did their robotic movements. After the boss, the [spoiler] Cogwork Statues [/spoiler] rise, telling Hornet to collect types of melodies. It reminded me of the [spoiler] Dreamers [/spoiler] section of Hollow Knight. For me [spoiler] Vaultkeeper and Architect's [/spoiler] melodies were easy to obtain, leaving only [spoiler] the Conductor's [/spoiler] melody.\n\nI thought to myself as I entered the arena 'it can't be that hard, I'd probably fight a boss here or something'. [b] No. [/b] It was a gauntlet with SO much enemies. I had a hard time with the first part before the first [spoiler] Choir Clapper [/spoiler], I thought after the first one, it would be the end, and I'll finally get the last melody, but as soon as I thought it was over, there were [bold] More rounds [/bold] of enemies. After an eternity, I finally get to the [bold] last [/bold] round, which was [bold] two [/bold] [spoiler] Choir Clappers [/spoiler].\n\nAt that point, I thought beating them was impossible. I only had one needle upgrade (even when collecting the second one, I still got clocked at the end multiple times), 5 masks, and wasted all my shell shards using tools on the same rounds of enemies. In total, I spent over [bold] 6 HOURS [/bold] on the gauntlet, no breaks, just back to back fighting and dying to the same enemies. This part of the game made me feel anger like I've never really experienced with games before, it felt like my positivity was sucked out of me.\n\nAt that point of the game, I just wanted to be [bold] done [/bold] with Silksong. Beat the final boss, and leave it for good. I didn't even want to explore the rest of the map to find other probably good bosses, and npcs, items. I was dead inside. Even still, with the experience and skill I've gained from Silksong, I [bold] still [/bold] die to the [spoiler] High Halls Gauntlet for the Conducter's melody [/spoiler] MULTIPLE times, especially on the last round. To whoever had an easy and wonderful time with the gauntlet, I salute you. Yall have patience and skill I could never obtain, especially with this game.\n\nSomehow (probably sheer luck with the [spoiler] Choir Clappers' [/spoiler] attack pattern) I won. Immediately, I wasted no time fighting [spoiler] Lace 2 [/spoiler] (which was fun. Just pure skill and swift movements), and headed for the [bold] final boss [/bold].\n\n[spoiler] Grand Mother Silk [/spoiler] was eerie and graceful to witness, (probably even cooler than Hollow Knight's [spoiler] Absolute Radiance [/spoiler]) even after spoiling myself, because I was getting impatient fighting the gauntlet and thought I would have never won. For me, the final boss was actually EASIER than almost all the other bosses I've fought throughout my playthrough. I felt my mood lighten up a little, defeating the boss.\n\nRating:\nPrice: 10/10 (Perfect, just 5 dollars more than the first game. Not an outrageous 60.)\n\nGraphics: 10/10 (Stunning, just absolute cinema, like the first game.)\n\nMusic: 8/10 (Good, but couldn't enjoy it as much due to just dying all the time or avoiding hazards and enemies during my first playthrough. Some of the game's music are my favorites however.)\n\nGameplay: 3/10 (There's a lot more arenas in the game, I noticed that. I'm mainly giving points to select few bosses, and of course, Hornet's moveset, which is amazing in my opinion.)\n\nStory: 7?/10 (I rushed through the game, I was tired with it. If the game was easier, or if I installed mods to limit difficulty earlier, I would've probably experienced the story with as much awe as how I did with Hollow Knight.)\n\nFinal rating: 6/10\nIf you are a newcomer to Hollow Knight and/or Hollow Knight Silksong's shenanigans. Beware. This game is difficult to play and get used to. Even for people who've played Hollow Knight a lot, it's not the same.\n\n(For the people who might say git gud, I'm just not like others who are used to Silksong. Even with my 10s of hours of gameplay, I still have a hard time, even now. If you think Silksong's easy, cool, it's just that others like me have a hard time with it, even with help.)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Difficulté completement aleatoire, random boss sur le chemin ou il faut 2h, boss de fin battu en 3 try.\r\nUn acte caché avec des tonnes d'heure de jeu apres avoir eu les credit, si on ne sait pas qu'il existe on le rate completement.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is an eye candy, but , if you are not part of the \"Git Gud\" cult and game time is your primary asset, the game will require some mods to be palatable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Quería que me gustase este juego, pero han seguido con la dificultad de las áreas finales de los DLC, que más que difíciles eran obtusas, a nivel de no ser tanto un soulslike o un metroidvania sino a tener que memorizar y repetir cadencias exactas como un juego de ritmo (tipo DDR). Desgraciadamente, tampoco tiene un control tan bueno del personaje para facilitarlo, al menos en mi opinión, siempre me ha parecido que Ori se controla mucho mejor. Los bosses tienen una cantidad de vida ridícula, y muchas segundas fases convierten la pelea en caótica, en un ejercicio de suerte más que de pericia. Frustrante, pero no frustrante que al conseguir avanzar se convierte en \"ah, qué guay, me he cargado al jefe\"... no tengo esa sensación aquí como sí la tengo en dark souls, es más \"ah, me lo he cargado... pues vale\".",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The Game is way harder then regular hollow knight and it ruins the fun hollow knight was when i cant even beat the fifth boss of the game widow.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loved the game; almost 100% completed but the newest update completely broke controller support, my game just crashes everytime I try to do a input. ive tried using steam input and im currently trying to download a old repo but this is just ridiculous. Update: got the depot working for one day, and now steam refuses to launch it without patching. So I cant play a game I paid for without buying a new controller that *might* work. when im this close to finishing it I was recommending it to everyone I could and now I couldnt feel more different",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Amongst other games, I’ve recently played Dark Souls 1 & 3, Sekiro, Elden Ring, and Nine Sols. All these games are punishing, requiring you to get good, but what is clear through the progression of the DS series and franchise beyond is a general minimising of the “run back” needed to boss fights. Silksong goes the opposite direction and makes extremely long and tedious run backs to boss fights, often with tons of hazards so you don’t arrive at the boss with full health. It’s just not fun, in fact, extremely frustrating, and pointlessly extends the time needed to get mastery over a boss.\nThe Nine Sols final boss (3-phase), or Elden Ring Malenia, are great examples of gruelling boss fights at their best - extremely challenging with zero runback. In the end, I used a Nexus Mod Stakes of Marika to cut out the runback for boss fights so I could focus on the fun and challenge the game does have to offer. So yeah, with that Mod, it’s a thumbs up, but without it, a big thumbs down.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Starting this game on the Steam Deck leads to nothing but a black screen with cursor. Running latest stable version.\n\nI was looking for a different kind of debugging.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "10 hours in, no charm, no weapon, no nothing. You are the bottom of the pyramid and you don't feel any progression. Just to make fights an annoyance every boss spawns a thousand mobs while they jump around like a maniac, not to mention they are almost as big as the screen. Every fight have been feeling this way so far, and I don't see how this game is any upgrade to the first one.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love difficult games, a lot of the game just did not feel fun due to the difficulty. The sound direction, art style, atmosphere of the world is all superb. The actual gameplay feels unrewarding and frustrating 70% of the time the other 30% is when it clicks and everything feels great. Then you go back to fighting these awful enemies that fly around and are just a chore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a serious review and not praise disguised as a bad review.\r\nI loved Hollow Knight when I first played it in 2021, and I was super stoked to hear that Silksong was coming out soon. I loved the game all the way from Act 1 to Act 2 and thought of it as a more than worthy sequel. Unfortunately, in Act 3, Team Cherry decided to make every enemy twice as strong, fast, and gave them more shitty projectiles. There are areas where you are forced to fight through these, and it really feels like they ran out of ideas and just decided to make it slop. Only buy this game if you are willing to endure a crappy third of the game, or just miss out on it entirely. Hands down, the most disappointing route they could've taken with Act 3.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Look. I want to like this game. I LOVE the story and worldbuilding. But between ridiculously punishing early boss damage, White Palace level platforming for simple passageways (yes, I know there'll probably be a shortcut after I do it the once) or small rewards, environmental hazards that can deal two hearts of damage or leave you with a long term debuff, having to miss out on experimenting with other crests because I need the easy pogo, the kind of awkward healing...\n\nI won't say I'm a good gamer! I kind of suck! But leave your 'git gud's at the door; I sucked at the original Hollow Knight too, but I had a lot of fun with it. With Hollow Knight I didn't feel like I was immediately forced to download mods to mitigate; an easy mode to halve that two hearts damage, and eventually an environmental damage for all the times I fall into gears and spikes and lava.\n\nNow I'm looking at early to mid-game platforming that I'm used to seeing only in end game content, and I'm sitting here wondering - after having rammed my head into the same stretch for more times than I want to know - am I even having fun any more?\n\nAnd no. The answer is no.\n\nI'm not good at this game. I have issues with keeping track of everything on screen, and having the coordination to hit all the buttons I need; I'm not sure I can be good at this game. But I should still be allowed to enjoy it. And I'm just not enjoying it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like Silksong more than I do. The art style, music, and sound design are all great. The story is fine. I preferred Hollow Knight, but in a game like this, the story isn’t strictly necessary for your enjoyment.\n\nMy problems are all with the game design. Let’s get the most divisive part out of the way first. Yes, it’s hard. Is it too hard? Probably. Some accessibility options would help here. But ultimately, I finished it, and I’m not some no-hit speedrunning god by any stretch.\n\nWhere this game really annoys me is in how many enemies and bosses deal two damage. Narratively, it makes the bosses feel less like threats than regular enemies, because so many of them either deal two damage or one plus an unavoidable follow-up hit. Some people like to say this adds to the challenge, but I can guarantee that the issue would be solved simply by having all enemies deal one damage while halving the player’s health pool. The effect would be the same, but at least you’d have a clear idea of how many hits you can take.\n\nAs it stands, fighting a new enemy feels like a dice roll. “Okay, I have three health left. This is a new enemy. Do I take the risk and fight it, hoping I don’t end up at one health, or do I find a safe spot to heal?”\n\nThat’s terrible design for both the gameplay and the story.\n\nContact damage is another issue. I can accept it for spiky enemies or maybe some bosses, but when you finally stagger a boss, having them deal contact damage while kneeling is absurd. That’s not tension, that’s a joke.\n\nThe interface also needs serious attention. Basic functions like buying or selling in multiples just aren’t there. I’m getting flashbacks to Dark Souls from 2012, and not in a good way.\n\nI had several issues with input ghosting. I’d normally blame my controller, but I’ve never had problems with it before this game. After pushing through three gauntlets, I had to quit and lose all progress because Steam Input completely stopped responding. So if you do get it, disable this immediately.\n\nI want this game to be better, but I doubt my concerns will be heard. I believe Team Cherry is satisfied with the game’s overall design as it is, but I can’t recommend it. Maybe on sale.\n\nThat’s it. The game is finished for me, and my thoughts are out there. I’m not sure I’ll be going back, but we’ll see.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is one of the most uniquely frustrating experiences in gaming history. Moments of greatness topped off by a mountain of hostile design. The game is not designed to be fun in a lot of instances, it's designed to punish and frustrate the player. Maybe that's what you're looking for, certainly I know my opinion is the minority. However, I'm mainly playing the game for my own personal pride at this point. I'm not going to leave it unfinished after 80 hours, though I've come close to quitting many times.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Honestly, this just ain't it. At no point of the game did I enjoy playing it.\n\nHollow Knight 1 was a masterpiece through and through.\nSilksong feels like a chore to play and a downgrade. Waited so many years for nothing.\n\nIt's not about difficulty. For me It was incredibly easy. Bought day 1 - pre boss nerfs. Forced myself to play the default crest just to make the game harder and still beat all bosses 1st-2nd try. Rarely 5th. Had almost finished all of ACT 2 without upgrading the needle (forgot). I even one-shotted the [spoiler]act 3 lava escape[/spoiler] sequence by accident first try. Difficulty is always welcome. It's everything else that bothers me.\n\n--------\n\nPositives\n\nAmazing level design\nSome of the best and smartest platforming challenges. Very satisfying.\nSome bosses are a work of art in their combat and design\nReally challenging fast paced combat\nTons of customization\nLovable characters\nHornet slaps perverts that try to kiss her\n\n--------\n\nNegatives\n\nThe quest system forces wasting an endless amount of time or using guides since the hints are very vague. Like \"go somewhere in X area\" which means backtracking a ginormous area which also difficult to traverse. Also the quest may need finding a hidden path which means hitting every wall just in case. So you're now stuck wasting 30 minutes backtracking to find the quest only to then get frustrated, search it up and understand the hint was misleading in some way. Every time I didn't google a quest guide, was a time I regretted not doing it.\n\n After every skill you unlock, you need to explore the entire world again. Yes, I know. It's a Metroidvania. But there is no indication an area was fully explored. Having a map in this game is worse than not having one. \n Chunks don't get properly separated. You but enter a huge room for a moment, exit, and then the map shows the entire area as if you explored all of it. You end up having to pass through every stage of the map 30+ times. The worst quests are \"Kill X enemy 20 times and deliver their item\". I killed that enemy 1000 times already when I was still exploring the area. But because I got the quest a bit late by accident, WHY do I need to go back and kill these enemies again? And no you can't ignore quests because the next ones will not appear without completing the previous ones. Can't all enemies drop their materials by default so I can keep them and deliver them later?\n\n  And so for the first time in my life I said, screw it. No side quests. I am employed. No way I'm wasting my time on some Ubisoft level chores. But curiosity got the best of me and searched the rewards just in case and got pissed. Key game upgrades like making your weapon stronger which can be done only 4~ times in the entire game are blocked behind time consuming tedious quests. As much as I laughed at IGN for giving a 9/10 due to quests, having now played the game, I am even more pissed at IGN for not giving an even lower rating. Just let me beat a difficult boss or platforming challenge and give me the upgrade. Not force me waste 30-60 minutes on delivery boy duty. I could have played Death Stranding for that with far better sceneries and graphics.\n\n  On another note I'd love to blame inputs for being bad and unresponsive but just like Elden Ring, you get used to the junk and clunkiness after 10-20 hours. You do still die from inputs from time to time but I can forgive that as with most games.\n\n   Lastly. 30% of the game, [spoiler]Act3[/spoiler] is locked behind the \"Castle Inverse\" as I call it. Like in Castlevania. I won't tag this as a spoiler, it's a known fact that all metroidvanias copy the OG, Symphony of the Night. But the prerequisites required to unlock essentially half the game are INSANE. A 30 minute youtube guide that requires 2-4 hours in TEDIOUS chores. No normal player would EVER do these by himself in a normal playthrough. Reddit is filled with players asking how. Vids on youtube with guides have 1mil of combined views. Statistically speaking only 1 in 1000 would unlock half the game playing casually.\n\nEverything in this game is a google simulator. To the point, I would add in the game's store page description a disclaimer \"Googling or 300 hours of your time required to unlock half the game\".\n\n   I was between giving a positive review for the lovable and adorable designs of Hornet, Sherma and Bella.\nBut I honestly cannot. Not a single moment playing this game have I enjoyed my time. As a matter of fact, the game doesn't even respect your time. A shame.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This shit is too hard and it ruins pleasure from the game. I'm so disappointed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Im gonna start off by saying that the game isnt awful, no, its actually quite good when it wants to be, and i hate it. There is nothing i would love to do more than to love this game, but it has so many extremely severe flaws that recommending it to people just isnt possible for me.\r\n\r\nThe main problem is that Silksong tries its damndest to make the player feel like shit whenever theyre struggling, and the small burst of dopamine at the end of a boss fight doesnt make up for the lack of rewards. The rosary economy is horrid, the tool system is niche at best, and is itself a pain to grind for unless you just dont use the tools a lot, in which case they feel like a nice little addition to boost your damage by a small amount, which just doesnt replace the spells from Hollow Knight, at least in my opinion.\r\n \r\nThen theres the enemies. The bosses are fun, some of the most fun ive ever had while playing games by myself, but runbacks, double damage, and the fact that your whole run in a gauntlet/boss can be ended in seconds is just not fun. For example, the gauntlet required to get the conductors memory took me about 2-3 hours on my first try, not even mentioning the parkour before it. Most of that time was spent getting to the last few sets of enemies, where i would proceed to get absolutely railed by the pairing of minibosses in less than half a minute. And what did we get for that hellish sequence? Nothing aside from a checklist on the quest tab. Nothing. So the gauntlets are tedious, the bosses are fun until you have to go through the runback, and god forbid you accidentally stub your toe on a staggered boss while low on hp, because double mask contact damage on stunned bosses is just incredible game design, isnt it? \r\n\r\nItems. Theyre a thing. Great, now why are they such a pain to get? \r\nNeedle upgrades? Have fun doing fetch quests unless you dont want to tickle bosses after Bellhart. Spools? Theyre actually fairly well placed, at least in my experience. \r\nMasks though? Might have gotten 5-6 total mask fragments through acts 1-2, and it felt horrible when facing bosses. There were more points where i was wondering why Team Cherry didnt just give us 3hp instead of 5 at the start, because most things kill you in 3 hits anyways. \r\nTools? Mostly worthless junk to kill annoying enemies without actually fighting them. Rosaries? Theyre atrocious. I feel genuinely richer in real life than in Silksong, and im a highschooler with no proper job.\r\n\r\nTheres the end game segment as well, but in summary, the game is a tedious grind with some spots of gaming that are genuinely better than anything else in the past decade or so of singleplayer gaming, that feels like genuine trash once you get out off the adrenaline rush of finally killing a boss after three hours of struggle.\r\n\r\n***SPOILERS FOR THE ENDGAME***\r\n\r\nAct 3. I wont even try it. I didnt know it existed until a friend of mine told me about it, and after looking through how to get there, i was a bit annoyed, but felt it could be done. Thats until i saw the contents of Act 3. Theres no defending it. Its a grindfest that i cant bother to do just for a measly achievement, and its another part of why i cant recommend the game.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "A disappointing sequel to one of my all time favourite games. It lacks the je ne sais quoi that made the original so special and is a step backwards in many ways.\n   The movement feels worse. The whole flow of combat and action economy is worse the biggest offender being just how long it takes to generate a usable amount of thread being so prohibitive. The charm system has been made needlessly complicated and more restrictive with the addition of crests and typed charm slots. The atmosphere is less lonely and less immersive. The economy is absolutely terrible as several enemies don't even drop rosaries (the in game currency) so there's less reward for fighting them. Last but not least the major progression abilities even the early ones take much longer to unlock so the pacing is worse. \n   Original Hollow Knight I enjoyed so much I would have to force myself to stop playing, Silksong I have force myself to play!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game feels very raw technically. Constant controller issues and lag are very annoying and prevent you from concentrating and enjoying the game. In addition, compared to the first part, the game has become incredibly difficult and boring in some places, as you have to do the same thing hundreds of times until something works and there are no alternatives. And considering the game's controller issues, not all button presses are registered, which makes the game even more difficult.\n\nUPD: I had to buy a terrible USB gamepad for $5 (which the game also doesn't recognize), but I managed to set up a separate profile and trick the game into thinking it's a keyboard, thereby somehow solving the problem that the developers removed support for many gamepads in the latest update :-)\n\nBut still, the game is so difficult that it's no fun at all. Compared to the first part, which I completed for 97% and enjoyed a lot, this is just a failure.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Team Cherry makes me annoyed in more ways than one. I originally played Hollow Knight on the Switch, 112%ed it, and got through all the Pantheons. I would say that it remains one of the best gaming experiences I have ever had thus far. I started to dislike the developers when they couldn't be bothered to give one sentence Tweets updating us on the progress every month or so, because I think that lack of touch with the community that originally backed their indie project is madly disrespectful. I also think now that its out that this lack of communication drives a lot of what is wrong with this game. Silksong was originally intended to be a DLC if I am recalling correctly, but became its own game because Hornet was too large to get through a lot of areas in the base game. With that in mind, it makes sense that a lot of the difficulty likely stems from the fact that this would have been played by experienced players who got through all aspects of the base game and were looking for more challenges after mastering the rest of them. However, I feel once it shifted into becoming its own thing, Silksong should have been more gradual in its introduction to that difficulty. I am not complaining that there are enemies that deal two masks of damage, I am complaining that its an early encounter that respawns once you leave the room. It is stuff like this that simply has ruined the game for me. The drapemite is a really good example. How does something like that, which spawns as commonly as something like a tiktik, come to deal two masks of damage? There were some attacks by bosses even within this game itself that dealt less damage. It is the same amount of damage as the hardest fight in the original, the Radiance. I do not understand how that can be seen as balanced, nor why things like this were not changed slightly on release. The constant flying and projectile-based enemies were also prevalent. Let me ask, which Hollow Knight players were begging for tedious run backs, bodybuilder-tough common enemies, and a bunch of primal aspid wannabes? This game had two playtesters, and it seems both were masochists who's favourite parts of Hollow Knight were the Path of Pain and AbsRad. I will say, at some point these things did get easier to deal with, though. A part of me agrees with the stance that we have simply forgotten what made Hollow Knight so enticing in the first place was the fact that it was difficult. I think there is some truth to that. If all players did was simply breeze through a carbon copy of their original favourite, then there would be no challenge, no dopamine rush, and no fun. There were parts of this game that I deeply enjoyed that did just that for me, even if they were in the minority. I really loved exploring back in areas that were once inaccessible, I really liked granting wishes - even though a lot were just repeating fetching things over and over again - and I loved the fact that we now had a visible personality for the hero. However, to there just weren't enough moments comparable to the uniqueness of Hollow Knight to make it feel good. No moment that felt comparable to getting scammed by the banker, nor the stillness of sitting with Quirrle. The soundtrack wasn't nearly as well done too, with the only memorable pieces to me being in the Cogwork area and fight, as well as the Citadel's music. No City of Tears, no Greenpath, no White Lady, no White Palace where it fits the theme and sounds like heaven. I could recite where each piece played in the original, but this all just felt like lacklustre and forgettable background noise for a large majority of the game. Combat too, to me, stayed very much the same through out. Of course there were crests and tools, but I found myself sticking to only relying on the needle and conserving my silk for heals simply because the use of weapons was too costly, especially when bosses could require a few tries for me, unlike the charms which often had some good combos to try or specific situations that made sense to use them in. Abilities too also suffered, in a few ways. In their introduction, a lot were given right before fights, like the dash and floating ability, leaving you no time to get used to them. While it introduces you quickly to how they can be used in battle, it does not do a very good job at allowing the player time to understand it, where the old set up would have the player gain an ability only after a boss fight. Gauntlets were extremely common as well, but there was little reward, and most things were behind paywalls. Just typical complaints the increasingly annoying community will reply to with a clown emoji and a \"git gud.\" The story was a huge saving grace for me, however. I loved some of the characters and how their roles played out. Some things even made me laugh. The art never deviated from its beauty as well. But I do not have the mental fortitude to subject myself to more of this beyond what I have already done. I gave it an honest shot. I really, really wanted to like it. I knew going in that it would not be Hollow Knight, but I cannot in good faith recommend it when it takes all of the negatives and amplifies them. I was so excited, and now I feel so disappointed. I completed the base ending, and perhaps I will pick it up again and hopefully something will just click and I will adore it, but I just don't right now. And that makes me really sad because I certainly wanted to. Well worth the money though, still better than any other game that came out this year in all honesty. It is obvious a lot went into it, despite my complaints. If you are good at this sort of thing, and you actually enjoy the grind, I would say buy it in a heart beat. Otherwise if you have any remaining sanity given you didn't lose it in the wait, I would say preserve it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "While the game can be gorgeous and has segments that are genuinely fun, it also contains many punishing design choices and lots of gotcha moments. Looking back at the hours I spent on this game, and after reaching 100% completion, I realize I spent more time being annoyed than having fun. That’s a sign the experience just isn’t well-balanced, and it’s not how a game should make players feel. My personal opinion.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Hollow Knight still has my heart, but I can't recommend this game to most people, even if you enjoyed the original installment.\n\n100%'d it, but instead of feeling the \"wow, that was tough but I did it\" feeling I usually get, it was mostly replaced with \"thank GOD that's over\". I can recall a few boss fights I deeply enjoyed [spoiler] (Dancers, Trobbio, Khann) [/spoiler] but more often I found myself just annoyed. I really didn't enjoy the number and density of gauntlets [spoiler] Especially High Halls [/spoiler] and just about every boss had multiple phases. \n\nThe exploration was fun! I did enjoy the theming of several areas, like [spoiler] The Sands, The Mist, and the Choral Chambers [/spoiler] but overall a lot of the areas felt less creative than I would've liked. [spoiler] The coral enemies were really exciting, and I really would've liked a more fleshed out look into what they were outside of the memory. [/spoiler]\n\nLots of other folks have already expressed the usual gripes I could also echo: rosaries are only dropped by a specific subset of enemies, shards are difficult to come by but are a heavily encouraged part of tool crafting, double-damage, contact damage -- the list goes on.\n\nThe story beats were nice but few and far between, and getting to the next one usually requires a pretty difficult fight or three. More of the story is shown through a similar artifact collection system that HK had, but you aren't compensated for them and the lore is often fairly similar to the other pieces. On top of that, I felt a little strange playing as Hornet coming from being the Knight. She knows more about the world than I did (which makes sense), but it also felt like a lot of telling and not a lot of showing when it came to storytelling. [spoiler] For instance, Whiteward and the silk being inserted into the shells of bugs. It became more evident once she mentioned it, but I really couldn't parse what Whiteward was *for* until then. [/spoiler]\n\nI wanted to like the game, and to some extents I really did, but I can't see myself coming back to it or playing through it again, even down the line.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I really loved the first Hollow Knight game, playing it twice on Steam and once on Switch. I was really looking forward to this second entry for a long time. Unfortantly I was let down by many of the design decisions by Team Cherry. \nHollow Knight was a challenging game, and i was expecting the same for the sequel, but the way Team Cherry went to make the game challenging was very poor. Having your character take two hits from most enemies, having what feels like an increased hit point pool for even the most basic/common enemies, a badly designed early economy,  having a second currency for your tools for no reason when they just could of had limited uses after each save point, boss battles that feel like a slog due to not only run backs but how tanky they can be plus regular enemies that spawn during them. \nThere are still things I like. The visuals are great as expected. The world is interesting and the music continues to be great. \nI wish I could recommend this game like I would the first Hollow Knight, but I just can't. It doesn't feel like the fun, challenging first game, but an un-fun and often tedious slog.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game only deserves a rant. This game is hard carried by its art and hype moments. There are only 3 real metroidvania upgrades at most and they are barely used and spread out in inconsistent ways. The build potential is leagues worse and some of the map nav is awful. They lock 1/3 of the game behind a terrible quest line and your reward is [spoiler] infected crossroads but the entire map[/spoiler]. Nearly everything does 2 masks of damage so your first mask is meaningless. Double damage feels meaningless. You still take said double damage even if you stagger a boss. The runbacks add nothing of value. The tool system has a cost to it that incentivizes grinding. They keep throwing enemy gauntlets at you with the entire spritesheet of the area you are in so it all is easy to forget. Silk is just a heal bar and the waste it misinput if you dare try and use it offensively. Unless of course you are at the end of the game where it is even remotely viable. The bosses are just health bloated elite enemies.\nI could continue but to cap it all off this game makes itself hard by being annoying rather than good",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Frustration: The Game.\n\nTeam Cherry created an incredible sequel. Unfortunately, it was too too damn difficult for me, and waaaay to exhausting, especially at the end and in optional areas. Super happy for the devs and for all players who are able to enjoy it in full - I am not gud enough, even after completing original HK 3 times",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I couldn't stand it, the platforming is annoying, the bosses are flashy and cool but I loathed fighting them, especially the final boss.\r\n\r\nIf you can deal with the difficulty and like 2D games it's fine but I'm just miserable playing it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Let me preface this review by saying that the game is mostly well-crafted, it's a great value for its price, I enjoyed most of the content, and I think it's a must-play for a specific audience. I wouldn't have played 58 hours of a game that I didn't enjoy.\r\n\r\nBut if I had to give a binary answer to \"would I recommend this game?\" Definitely not. Not to a general audience.\r\n\r\nI played the entirety of Hollow Knight and liked it a lot which is why I picked up the sequel, but this game is leaps and bounds more challenging than its already-difficult predecessor. Difficulty alone, however, doesn't make a bad game or a game that I wouldn't recommend. It's specific design choices in this game that frequently left me confused and frustrated. To name a few: two masks of damage, flying enemies, enemy jittering (erratically flying away from you and often into you), difficult terrain in arenas, and endless amounts of gauntlets that trap you in tiny rooms with far too many enemies. I genuinely enjoyed a lot of the 1v1 boss fights in this game; some of them even did an amazing job at simulating PvP in an entirely single-player game. I had to attempt a lot of these 1v1 bosses multiple times before I learned their patterns and beat them. Despite the difficulty, these were well-designed fights and felt satisfying to overcome. I feel the same way about a lot of the tough platforming sections in the game (yes, even Mount Fay).\r\n\r\nBut all of that goodwill gets washed away very quickly when you have to challenge gauntlets like Bilewater, High Halls, and especially Coral Tower. Packing loads of smaller mobs and multiple midbosses into a small room and yelling that the floor is lava feels more annoying than creative. And this game has a wealth of creative enemies.\r\n\r\nNow is this a skill issue? Probably. If you love the souls-like genre, have extremely fast reflexes, or are willing to challenge a single segment of the game 50+ times, I'm sure you'll love this game. But if you're an average gamer who's never played Hollow Knight or any other game in the genre before, save yourself the pain and suffering.\r\n\r\nTLDR: GIT GUD",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "10/10 game if it wasnt for bilewater i hate bilewater it is the worst area in the existence of man i bought this game to have a challenge and have fun not get penetrated by a massive frog and have to run a olympic marathon back just to do it again. and no benches either afwul idea who ever came up with the idea of bilewater needs to be publicly hanged",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "for those who think only the negative reviews are correct you are DEAD wrong, this game is awesome",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I got filtered :( I just didn't feel the same kind of reward from this game as other difficult games and I just didn't really have any confidence in that it would become fun. I love the new movement and playstyle of hornet, I just disliked its emphasis on challenge and bosses so early on. HK had a nice gradual buildup of boss difficulty and by the time the game got difficult you had already fallen in love with the game; i think this game takes that love for granted and spits in the face of people who aren't masochistic enough to spend time without reward.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is the first game (in almost 40 years of gaming) I have bought on launch. I did this to support the developers.\nBut I have a love-hate relationship with Hollow Knight. Silksong managed to be even more extreme, in the worst way:\n\nPROS\n- This game is a passion project. You can clearly see that the developers love their craft.\n- The movement is fluid, the gameplay is sharp. Neat platforming, precise collisions.\n- Some ability, tool and item are interesting. Nothing revolutionary, but nice.\n- Hornet’s moveset and agility: very satisfying to move and platforming.\n- Voice acting very appreciated, and the sound design in general is high tier. \n- Some bosses are very fun to fight. Without spoilers, I found very fun every fight with Lace, the one with two identical bosses, the final boss of the game and other ones. \n\nCONS\n- My main complaint is subjective: I didn’t like the setting. Compared to Hallownest, Pharloom is not as much atmospheric and immersive. There is something absolutely not enjoyable for me apart from a few maps. \n- The musical score is nice, but it PALES in comparison to the first Hollow Knight’s. There are no songs that really stand out. I suppose this point is subjective too, but to me it’s very important. Forget the magnificience of the Crossroad’s, Greenpath or City of Tears musics: here you won’t find any of them.\n- The game doubles down of the flaws of Hollow Knight, managing to make them worse: long runbacks for bosses, very few benches (savepoints), hyper-convoluted levels. Obsolete game design.\n- Painful difficulty, designed in this way on purpose. I like difficult games, but this seems artifically inflated to be sadistic against the player and inflate the duration. Many enemies, even normal ones, inflict double damage. A lot of flying enemies are designed to stay away from the player and to be the most annoying possible.\n- This game has a bad economy. The main currency, rosaries, is very scarce. The other currency, shards, is overflowing. I used shards only once of twice during my entire playthrough. Bad design choice. \n- You don’t have the map at the beginning of every level, you don’t know where your character is unless you use a precious slot of you crest. The levels are gigantic sprawlings of corridors, halls, galleries, in the end very similar and confusing. Very similar to Hollow Knight, but worse.\n- This game doesn’t respect your time at all. I felt frustrated many times because the game demanded me to redo parts dozens of time, because there are not a lot of savepoints and fast travels. Silksong wants you to waste your time.\n- Unlike the first Hollow Knight, I didn’t 100%’d Silksong. The game seems to be conceived for people who look up for guides on the internet. I didn’t want to do that, and so I have been frustrated because many things in this game seem to be hidden on purpose, to make them undiscoverable. \n- I have recently known that a lot of this game has only been superficially tested by playtesters. And I had this impression during all my playthrough.\n- No innovation, no improvements, the usual metroidvania formula that, in my opinion, is staling.\n\nIn the end, this was a frustrating experience. Sure, it’s a passion project, I understand the intent of the devs. But here we are witnessing how a game auto-sabotages itself in order to be worse. There are so many bad design choiches that it’s really painful to realize how it could be so much better. I thought I loved metroidvanias, but after this one I’m seriously considering this genre a sort of gimmick to waste your time. I hope that if we will have another Hollov Knight in the future it will have less obsolete game design choices.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After over 20hr of trying to push through and get gud i'm still just frustrated. I love hard games like souls but this is pure frustration and it has ruined my day mot than once. I'm too employed to waste my day's off this upset.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I love metroidvanias as a genre, but I don't like games that are difficult for the sake of being difficult. As others have said, sometimes the game feels more punishing than difficult, to me at least. I feel like a large part of this game's difficulty is needing fast reaction times so when a boss gives a subtle hint about which attack it's about to perform you can dodge it. I don't know if it's just my genetics, or the fact I'm now in my forties, but several bosses I just can't react to fast enough no matter how much times I practice. So I depend on luck being able to get enough hits in, and then healing without being hit. Winning via RNG isn't satisfying, it's just frustrating when you lose. Playing defensively to get an occasional hit while dodging all the difficult attacks makes the boss fights long and boring. Compare to the original Hollow Knight where you can learn the boss move-set and then come up with a tactic to attack it quickly without teenager reaction times. \r\n\r\nThere are other parts of the game design I'm not a fan of, that I feel has a meaningful decrease on my personal enjoyment of the non-boss parts of the game. But games trying to satisfy everyone will please no-one, so I'm fine with the game devs making those choices. Different game devs will make different choices that I like, but fans of Silksong won't like. We can all find games that we like.\r\n\r\nI've got 750 hours in the original Hollow Knight, and I still love that game. I tried starting a new save in Silksong to see if I'd enjoy the early parts of the game more now that I'm more skilled, but the boss fights still demotivate me. So, my recommendation is to play the original Hollow Knight instead.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The first game was a fantastic metroidvenia, and one of the best games ever.\r\nThis game is dark souls number 3197.\r\nMuch more focus on difficulty and combat rather than exploration, and I'm not interested in dark souls #3197.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A great game if you're a jobless masochist with no life. I can't believe Team Cherry spent 6 years to make... this.\n\nHollow Knight was amazing. Hard, but amazing and you could get around to it. Especially with the metroidvania experience of discovering the world around and what happened to it.\n\nSilksong is thrice as large and thrice as hollow. Compared to HK, the lore just seems half baked. I've dropped it halfway through act 3 because I just couldn't care less anymore to go through the slow grind of shards and beads (you're constantly brokenin this game) and the constant punishment.\n\nThe usual autistic dorks will come at this saying \"it's perfect\", \"git gud\" but man... When is hard just hard enough? I have a fucking job. I already grind 8 hours a day with little reward. I play games for fun, and while I enjoy the usual challenge here and there, unlike Hollow Knight, Silksong feels like a second unsatisfying job.\n\nOver the past 6 years, seeing the amount of mods to increase HK to an absurd difficulty, Team Cherry seems to have decided that their target audience is this kind of Dork Souls type and fuck the rest. You need beads to buy basic shit? Grind. Out of shells for tools? Grind (not even Tom Nook dared to do this). You died to a boss? How yet another runback especially designed with traps so you can't get there? Your reward for defeating a boss? Either nothing or get the opportunity to get your ass whopped by another not long after.\n\nMan... Just stop it already. This is not fun. I beat the Crawfather in about an hour, went to the Second Sentinel and decided enough is enough after only 20 mins of trying. This game has exhausted my patience. Team Cherry are free to make games as hard as they want for the niche audience they want. It just won't be me anymore in the future and I don't care what git gudders say.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I am yet to finish but I am at the end of the game. The main reason why I do not recommend this game is platforming difficulty. If you remember white palace from the first game, it was infamous one level. Here is half of the game is white palace. And if you are too fast - you gonna fail, because animations and cooldowns.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Finally done, never playing again. No amount of DLC or \"Tweaks\" can make this one fun for me. Still love the 1st game, Ill go back to that one.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I nominated this game for outstanding visual style in this year's Steam Awards. I can't really nominate it for anything else (well, maybe the soundtrack..). I strongly believe this game would be so, SO much better if it was half its size, without the padding, without the bullshit areas and bullshit arenas and bullshit runbacks. I loved the original Hollow Knight when it came out and I 112%-ed it. But it's been 8 years and other studios have learnt from its mistakes, while Team Cherry did not. I just don't have neither time nor patience for this anymore.\n\n[spoiler]Play Nine Sols instead[/spoiler]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I liked the original Hollow Knight, it was challenging and fun (also frustrating and straight up infuriating sometimes) and I had high hopes that Silksong will be able to replicate it. And oh boy let me tell ya it did... only the amount of challenging+fun and frustrating+infuriating was switched up.\r\n\r\nFirst the good part:\r\n- I think the platforming in this one is on par with and sometimes even better than in the original (although it also has it's issues imo)\r\n- Most of the mandatory bosses and some of the optional ones are fun to fight\r\n- The world looks cool (even though graphically speaking it is not an improvement over the original)\r\n\r\n\r\nThroughout the game I have felt the pain of artificial difficulty, that got poured onto me via gauntlet after gauntlet and comically designed enemies (small ahh bug, takes 4-5 hits with 3 upgrades and deals 2 masks of damage). The game sports some bullshit runbacks to unfun and unimaginative bossfights, with some of them gated behind gauntlets (seriously this has a gauntlet in every 5th room). [spoiler] The whole concept of act 3 is good on paper, but the execution feels so awful. I got out of the abyss and got the 3 bosses marked on the map, that is where I've decided to drop the game, after realising that the already frustrating gauntlet galore just got expanded with the boring beefy \"new\" enemies and the map changes of blocked ways are not showing up on my map. (I know the original game did it with Infested Crossroads, but there was only 1 blocked path, and the enemies got new moves instead of using the old ones with more damage) [/spoiler].",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Silksong has some of the best bosses, artwork/animation and music of any game I've ever played. It is for this reason that it pains me to say that the game fails more than it succeeds by a wide margin. Simply put, the game is not very fun to play the vast majority of the 60-100 hours you'll put into it for an ending. It is a repetitive slog that constantly reminds me of the immense potential being wasted. There are a lot of little game design decisions that irk me (which certainly add up over the playthrough), but I think honestly I just wish the game didn't forgo exploration with tedium at nearly every turn. The game relishes in wasting your time and I don't think I would have completed it if I didn't love playing Hollow Knight.\n\nThere is a lot of discussion here and elsewhere about many of the major flaws (2-mask contact damage, pre-boss gauntlets, fetch quests, runbacks, et al), but a few I don't see enough:\n\nShards are the same mistake as blood vails in Bloodborne. It shouldn't have a cap or really just shouldn't exist at all. Failing at a boss and/or using a lot of tools results in needing to farm, which isn't something one would ever expect to see in a game this long. When you put systems in games you want players to use them, but shards as the resource for creating tools is at odds with this.\n\nThe controls are terrible. The movement system is incredible (except for ledge grabs and some wall collision detection), but, for example, replacing the cloak press-and-hold with the double jump after finally getting it is really stupid. idgaf if it is something you get use to, this kind of control scheme is a solved problem, nobody is going to even notice 30ms to do long press detection to distinguish between double jump/cloak. That or the dedicated lore button could be used instead of letting that eat up an entire face button (also why even add the needle elegy later with the down + Needolin? who cares, just do an action button ffs).\n\nSome of the hitboxes are so bad they have me repeatedly testing things over and over in disbelief. Like the hit I get from the Savage Beastfly where no pixel of Hornet passes through it but it pulls me in and registers a contact hit, or just how generally bad the pogo surfaces are like spinning spike wheels, especially given the quirky hitbox of the diagonal pogo (you dive way too far before your needle is out and it is slightly too short).",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I am extremely torn on whether or not to recommend this game, but I think I am going to go with no. The main reason that even the people in my friend group that where the biggest fans of Hollow Knight have only gotten about half way through the game. The combat is more of just challenging rather than being fun. Lots of people like this kind of challenge, and if that is you, this game is for you. But if not, honestly I  would recommend just watching a playthrough online or something. The game seems to have the same effect on most of the people that I know that play it. It just slowly wears you down until you just don't really want to play it anymore. None of us rage quit. None of us stopped because we can't defeat a boss. We just are not really motivated to play any more.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hallow knight this is not. It's trash compared to the OG. The enemies input scan and are random as heck. Hallow knight took some skill this takes 89% chance. Wanna use a store? Pay to get in and now you have nopney to spend. Wanna go far well get enough cash to pay to get in again. If I could get a refund for this I would. Save bench to save bench is either 30ft or 3 zones and guess what you have to pay to save. Team cherry screwed this sequel hard.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is unnecessarily annoying and removes many of the fun aspects that made the original Hollow Knight such a good game. Boss runbacks are tedious at times and some of the enemy placement and area design are specifically made to annoy the player and nothing else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is basically Hollow Knight, but *more.* More items, larger areas, more areas, more quests. If you like that, buy it. However, it's also got so. much. back-tracking. This is because of the larger areas, and the relative infrequency of fast-travel points and even basic short-cuts. It also feels like a lot of back-tracking, because there's not much to *do* in most areas, besides just beat up enemies. The secrets are all more obvious than in the original, and there's not very instances of you having a new tool, to get something that was previously inaccessible. (Like, needing a double-jump to get to a side-area.) So most of the time, you've finished everything an area has, on the first time through it. Then, you need to back-track again, and again... The NPCs in the game are also somewhat sparse. Worse than that, the ones that *are* in the game feel like they're half-finished because most of their dialog and quests are on invisible timers. If they even said something like \"I'm still researching more areas to explore...\" it'd help a lot. The real kick in the teeth is the waves of non-boss enemies...that they have right before bosses! It's sometimes just a frustrating endurance test, but the one that made me uninstall was where there were eventually *two* big guys who had screen-wide attacks, both being telegraphed at different times - this is a mess to fight. Compare that with the two-monster boss just before this point - it's well-balanced, and the choreography means there's no cheap deaths from getting in sync with one guy and out of sync with another.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Unfortunately, not nearly balanced as well as the original Hollow Knight. Where as the first game was a difficult challenge but still fun, Silksong is much more pure frustration due to long animations, runbacks, and unexpected and intransparent enemy damage. Honestly, it's a shame that this is the final product after years of work.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Most of the reasons why this game is not good have already been addressed by other reviews so I won't expand too much on that, but in short I simply do not recommend Silksong, it's best to just stick to the original Hollow Knight.\n\nThe story is not clear even though your character talks (why did the main antagonist want to capture Hornet in the first place, for the silk? and then what would she do with the silk? and why do all that for Lace in the end?), the combat is frustrating as you pretty much take double damage from everything and your invincibility frames are very short so you can't adjust to boss patterns without dying a lot, the backtracking to the bosses is annoying, the economy is tedious, the callbacks to the first game are barely there (having to play 50 hours just to see anything more than a brief mention to Hallownest by Hornet when talking to an NPC is definitely something, I mean, it's called HOLLOW KNIGHT yet there is no HOLLOW KNIGHT in Silksong).\n\nI get all the hype and the meme'ing about this game, and it's clear that a lot of effort and passion went into this, but if I play a game I want to have FUN, and I can't have FUN if there are so many rough edges. The game had it's good moments but it fell short of what I experienced in the first game. I'd suggest waiting until all DLCs have been released (as I hope there's a Godseeker mode here eventually) but in any case I can't recommend Silksong for now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Many will say that I’m a clumsy, toxic person. But in my opinion, locking important game mechanics behind extremely difficult challenges is unfair. I understand there are people who beat Dark Souls using bananas or drums, but games should be made for everyone, not just for the hardcore audience. In the first part, I got the double jump after defeating a boss — here, it’s hidden behind a challenge that not everyone can complete. What kind of nonsense is that? I believe that very difficult challenges should reward players with bonus items, not essential abilities. I’m sure that this time, many people who bought the game for the first time won’t buy your product again. The next game will probably sell worse. It’s terrible — not only have the bosses and enemies become tankier, making the game more boring and drawn-out, but it also constantly feels like the game is trying to punish you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A game being difficult is fine. It being annoying, is not.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "80% противников летающие, что значит вы будете три минуты прыгать вокруг чтобы выжить и нанести удар. Отличное искусственное растягивание игры. Дайте хорнет зенитное орудие.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a shame this game is so annoyingly difficult. It'd be fun if it weren't.\r\nOften you're wondering around and enjoying things, enjoying the well crafted environments, the character interactions, the music, the story.\r\nAnd then Silksong punches you right in the face, right when you're thinking: \"This is a great game. I really like it.\"\r\nJust to remind you that loving this game is something you're not allowed to do. If you were allowed to, you'd be able to do it all the time. Not just when the game says so.\r\nThe game makes you ram your head into a wall repeatedly. Over, and over, and over.\r\nYou put it down every time it makes you frustrated, and you think \"I'll never touch this terrible, shitty, annoying ass game ever again.\" But you'll come back, because the rest of it is so good that you have to.\r\n\r\nI understand this is a love letter to the soulslike genre. It's a fantastic game for the price, especially with all the effort that was put into it.\r\nBut I can't recommend this to anyone, unless they really like causing themselves emotional damage.\r\nWhich makes me sad. More people should be able to enjoy this game. I wish I was able to enjoy it all the time, instead of when the game says \"You may now enjoy me.\"\r\n\r\nThere are some games that find a nice balance between difficulty and fun, find the right amount of difficulty to grant a feeling of achievement when you win. This is not one of those games. When you win, you only feel achievement for a moment. After that, you're thrown back into the next challenge.\r\n\r\nTL;DR: This game is very good. I wish I could enjoy it more. I wish more people could enjoy it. Don't play it unless you hate yourself.\r\n\r\nAnd for the \"git gud\"ers out there, I'm happy for you. You're able to enjoy the game. I'm not.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "i hate to do this as much as the next guy but i genuinely felt like this game was actively trying to get me to stop playing from almost start to finish, spoilers ahead!\r\n\r\nbefore i begin let me clear up some things: this isn't a \"waaaah game's too difficult / everything does double damage / savage beastfly\" review, i overall found the game's difficult to be mild at best and for a majority of the time easier or comparable to base hollow knight, just about everything dealing 2 masks of damage is a necessity as the game would just be pathetically easy otherwise, without the high damage you could quite literally tank and outheal bosses entirely, something i was STILL capable to in most mid to late game; i also don't think that everything about this game sucks or that silksong is the worst game ever, far from it, the art and music are fantastic, quite literally what you'd expect if you were to think of an enhanced hollow knight, perhaps i may be mis-remembering but it overall felt like the npcs in silksong were much more \"alive\" with many more player interactions which i appreciated; as for the story i can't really say much other than it's ok... but certainly didn't make me salivate to get into the lore and by the end of it i was so exhausted from everything the game pulled that i really just couldn't bother anymore; have you noticed how i haven't talked about the actual GAME yet? yeah let's talk about it.\r\n\r\nHornet's base moveset feels amazing to play with, both fast and versatile, even equipped with a fancy new diagonal pogo move! surely the game is built around it yeah? nope, absolutely not even close and the hitbox of it is absurdly miniscule that using it in combat felt like a hindrance than an actual combat choice, in general the moveset just felt like it didn't belong in the game it was in and i couldn't help but feel that team cherry felt the same, what do i mean by that? well notice how i said \"base\" moveset, Hornet will gain access to different \"crests\" that change her moveset completely apart from meta-movement abilities, most of them are trash compared to the starter crest (keep this in mind), but one crest in particular... just gives you the hollow knight moveset and pogo, with a built in quick slash... the BEST tools (charms) distribution out of any crest AND a 2% chance to deal triple damage for no reason, wtf? i feel sorry to the 90+% of players that used this and robbed themselves out of experiencing silksong, you just played hollow knight 2.\r\nwell ok surely that's not a complete deal breaker right? unfortunately it kinda is? remember how i mentioned almost every other crest just feels useless, because this is a big trend in this game, you'll feel weak no matter what, what do i mean by this? lightning round:\r\n-an impressive amount of tools are completely useless, there's no variety to builds as once you have the best stuff that's what you'll use and what everyone else will tell you to use.\r\n-upgrading your needle literally might as well not be a feature since enemies get a secret damage reduction, because why should you ever feel powerful traversing through early areas in a METROIDVANIA.\r\n-defensive upgrades like extra masks or max silk (soul) are so unbelievably far and few between that by the time you get your 7th mask, which is a huge deal when everything does 2 damage you're probably already done with 60% of the game, the 7th mask would be your SECOND HEALTH UPGRADE.\r\n-the only thing that \"MAY\" make you feel powerful, and this is a BIG may, are red tools, think of them kind of as one time throwing items, again most of them are dogs*** while 3-4 are actually worth using, problem is they require shards to craft, one of the 2 currencies in the game which... i really don't want to get into it but do know that despite making currencies more plentiful and stuff overall costing less in a patch i was STILL grinding for them deep into late-game, (this is accounting never losing ANY on dying twice before retrieving them); anyways, shards have a max capacity and if you're trigger happy with your red tools you've got 4-5 attempts at any given boss before you run out and have to grind because of course you don't get anything refunded if you die, great, safe to say i only ever used red tools when encountering particularly annoying bosses.\r\n\r\n(tl:dr)\r\nthere is still a lot of stuff that i'd like to discuss in detail but it'd be a never-ending loop of things and minor design choices that ticked me off while i was playing so instead, i just want you to know this: this game hates you, the player, you WILL be inconvenienced at every step of the way, you WILL be ridiculed and made a fool of in practically every stage of the game, and just when you're about to say \"surely it can't get worse than this\" for the 4th time, it'll find a way to one up itself once more; Pharloom is an exceptionally dark and depressing place in the hollow knight universe, and so too will be your experience with it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I haven't given up on this game (yet), but it suffers from the same problems around difficulty that Spelunky 2 has. Just because it is a follow-up game doesn't mean it has to be brutally difficult for no reason. Good grief. I don't know where all these indie developers got it in their mind that their follow-up games must be that much harder than the original game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i really, really wanted to like this game, but as it is, the difficulty feels like a massive \"fuck you\" to anybody who wasn't able to 100% hollow knight.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really want to like this game, but there is so much artificial difficulty that I find myself only angered by playing the game. Even beating hard bosses does not give me a sense of accomplishment, but more of a \"I'm glad that's over\" mindset. If you don't want to bang your head against the wall to beat this game, this is not the game for you.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Call me bad but this game has so many little terrible design choices simply for the sake of being difficult. I swear this game is the 'getting over it' of metroidvanias. The difficulty curve is way out of proportion. I don't mind the double damage from enemies, when properly executed it can show a powerful attack, what I DO mind is when the boss's collision hit box also has double damage. It just breaks the immersion for me when the Bosse's butt does as much damage as their sword or weapon. I just feel like there are TOO many ‘F!@k you’ moments in this game. \r\n\r\n(Spoiler warning for part one):\r\n\r\nOh, you just went through a REALLY difficult part of the game and you finally see a bench? Frick you! The bench damages you and you got to restart. Oh, you've been in this VERY difficult area for a while and you see a bench and paid 30 beads to unlock it? FRICK YOU, you got to do this deadly, difficult parkour sequence first in order to unlock it.\r\n\r\nThe straw that broke the camel's back for me was, The Mist. At first, I REALLY liked the Mist. The eerily atmosphere, the music in the background, the way how if you fall through the mist it takes you back to the start instead of damaging you, that’s really cool. But there is a boss fight at the end of it with NO RESPOND POINT before it. So EVERY time you want to attempt to fight that boss, you have to go through ~6 difficult rooms every time! That's ridiculous! And what I thought was a previously cool mechanic before hand, is an absolute rage inducing mechanic now. I dread it now every time I fall down through the mist, needing to restart it YET again.\r\n\"oH, yOu JuSt GoT tO GiT gUd!\". \r\nI play games to have fun and have a good time, and that's just not fun or enjoyable. After a long day from work I don’t want to play a game that makes me rage and frustrated half the time.\r\n   It's Okay to have a game be hard or difficult, just don't make that the default difficulty, jeez! There are some really awesome things about this game, but because of a lot of its game/level design choices, it has been a pretty bad experience for me, and dare I say for most casual gamers out there too.\r\n\r\nI was really looking forward to SilkSong as much as the next guy, but with how terrible my experiences have been, I can’t in good conscience recommend the game. Its mandatory difficulty is holding the game back so much.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have beaten the game, I have reflected on my experience with the game, and i have come to the conclusion that i do not like it that much. There are so many things that were added in seemingly just to annoy you, things that provide nothing whatsoever but drain your time and energy for no reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "What hasn't been said about Silksong? I think on balance the game contains much more that's good than bad, but the bad is so acute and damning that it's not worth a recommendation. Play it if you're curious, skip it if you're not. Many have found almost no fault with the game, their experience is as valid as those who refused to finish it or hated parts of it.\n\nIt's been the doom of many hyped-up games that seemed destined to be instant classics when their developers asked themselves, \"What if it didn't HAVE to be fun?\" Parts of Silksong are confidently and explicitly engineered without fun as a priority. Some players are more okay with this than others, but to me it remains a choice that's hard to rationalize. The game WANTS you to feel frustrated, despondent, it wants you to shout at the screen in frustration, by design.\n\nWith infinite time, infinite money and infinite freedom comes a lack of the pressures that force a game to become elegant and refined. Deadlines and constraints are friends of creativity, they make a project better, no matter how bad it feels to release something that isn't 'perfect.' I'm pretty sure SIlksong would have been better if it had been merely an expansion, or released on a one-year timeline, or had to answer to investors. The game is too big, guaranteed to burn you out across a 40-60-80+ hour playthrough. So much of it feels overdesigned or just in need of pruning or streamlining. Of course for diehard fans, more is better, 'harder' is better, any decision can be rationalized in hindsight.\n\nHollow Knight is still a timeless classic and will be played for generations.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is the personification of beating your head against a wall until the wall breaks. Which isn't fun for most normal people.\r\n\r\nIt does not know when to stop, it does not know when to give it a rest, it's just more more more. More waves of the gauntlet, more platforming with no checkpoints, more health to the bosses healthbar. It isn't \"hard\", it's structurally hostile to the player.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Everything in th is game, and I mean EVERYTHING, is designed to be frustrating. It wasn't designed to be fun, it was designed to be frustrating.\r\nIt's like Team Cherry completely forgot about fun when they made this game and just decided to say a massive 'fuck you' to all of their players.\r\nI love a challenging game, and I love the sense of accomplishment and getting stronger to take on the next challenge. But I haven't felt that a single time in this game.\r\nThere's almost no rewards, and no sense of getting stronger. At the end of the game, I've collected almost everything, and the enemies are far stronger than I am.\r\nIt sucks. I really wanted to love this game. I wanted it to be better than HK, but I'm not seeing it. It's just.... disspointing.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game feels just like an offline League of Legends: toxic, frustrating, and enough to make me question my sanity. I’m too old for games that test my patience like this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Games are supposed to be fun and stress relieving. This game is the exact opposite. It makes you stressed out, angry and anxiety at every corner.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Finished Act 3 just to see if the game gets fun at some point. It really didn't. I like the exploration part of metroidvania games, and to my disappointment the focus of this game is heavily on combat and platforming. I feel like HK had a better balance between these aspects. For me the game felt tedious and a chore to play.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I loved the first one, and I wanted to love this one too.\nYes, I obviously suck. I have no problem to keep trying again and again. But having to run through several screens just to get another shot is simply too much. It all boils down to the fact, that this game just doesn't respect my time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Developers, not just Team Cherry: not every game needs to be a souls-like. \n\nCons:\nMy main gripe is this game never lets me feel like I have mastered *anything*. It's an endless parade of frustration: figure out a boss only to run into another one you have to spend five-ten tries to figure out, then rinse/lather/repeat. \nThe bosses have absurd health bars and can one or two-shot you. Then it's a long run back that includes repetitive platforming challenges that, if you don't point the joystick just so, will eat at your health before you even get back to the boss. \n\"Traps\" are laid all over the map that turn the run backs into walk backs, and make navigation a chore. Yes, you get move upgrades, but the levels are designed in such a way that it feels like Team Cherry specifically wanted to frustrate any player who doesn't have the whole damned thing memorized, which takes away the sense of mastery the move upgrade should give you. \nThere are common enemies that take two health pips when they hit you. You start with five. \nThe money system is equally frustrating; I feel like if I don't farm, I can't buy anything apart from the stuff I need. This dovetails with the run backs -- if you die anywhere, you basically **must** go and get your cocoon when you die, or you lose the currency that you actually need. \n\nPros: the game is beautiful, and obviously TC put a lot of care into making it. It does feel good when you figure out a boss, but it's so fleeting that the enjoyment withers away. \nSherma almost makes the frustration worth it. \n\nI only recommend this if you have a lot of time and immense patience, or are a masochist.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "To hard for most people, mostly in act 3 or act 2.  Don't purchase this game if you don't like really long grinding games with lots of bost fights.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its... fine... \r\n\r\nLet me clarify. The game is fun for a while, but then you get more flying enemy types, bilewater existing as an area you need to go to, hitboxes not actually making any sense as to why they hit you. Sometimes youll parry an attack and it will still hit. And the amount of fucking hidden secret areas behind hidden secret areas is unlike any game ive ever seen. THERE ARE HIDDEN ENTRANCES TO PLACES YOU NEED TO GET TO AND THATS THE ONLY FUCKING ENTRANCE IM LOOKING AT YOU PALE LAKE! \r\n\r\nThis fucking game makes you feel like theres more content but also make you feel schizophrenic after the 12th hidden entrance. \r\n\r\nLet me paint a picture. You are trying to get into the Slab, but the enemy you need to get there is already dead and wont respawn ever. So you go through the motions to get in there to explore. You find the key and open the first door, but now theres another door, so you think, \"Where could that be\". Ill tell you, IN THE FUCKING SLAB! So you try to find another entrance and aren't able to find anything. all of a sudden, you're looking for some lore beneath where the slab would be and you jump in just the right way with just the right fucking velocity while mercury is in retrograde or some shit and theres an entrance you missed because god forbid you have any indication something is there for you to get into the area you wanna get into. GOD this game.\r\n\r\nAnd don't get me started on the 2 damage from tiny enemies. FUCK this game makes me so mad. I loved the first hollowknight. And i was excited to play this one, hell i beat the first ending. What? theres another ending? WDYM i have to do every sidequest to get new quest to play the needolin for the final boss. WTF DO YOU MEAN I CANT JUST PLAY THE NEEDLIN FOR THE BOSS AND ACCESS THE ENDGAME CONTENT!? I swear this game was only made to be a \"Fuck you\" to the fan base. \r\n\r\nI dont hold any of this on team cherry, they have made a really beutiful game. BUT DEAR GOD LET ME PLAY THE GAME WITHOUT HAVING TO WORRY ABOUT FUCKING CEILING SPIDERS AND WATER THAT MAKES YOU UNABLE TO HEAL!!!! GOD",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: This is the mickeys dicksmasher of games\r\n\r\nJokes aside, this game is gorgeous, the gameplay is usually quite fluid and you can see the love that went into both the design of the game and the overall story. It is a great follow up to Hollow Knight in holding to the core ethos, however....\r\nIt hates you.\r\nBetween multiple levels requiring pinpoint timing to navigate, tools having resources you need to farm, most enemies doing two pips of damage (Meaning you realistically can only take three hits tops), healing taking all of your special resource (So you have to essentially play hitless to use special abilities), and a multitude of little insults to your time and progression via long boss runbacks and fake/trapped rest points...\r\n\r\nI really cannot recommend this game to the average or even above average metroidvania fan. Maybe you want a mickeys dicksmasher experience, but I personally prefer my dick unsmashed.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game is way too difficult, spend more time grinding and finding ways to skip areas than actually playing the god damn game, its overated by comparison to other platformers, including its previous title in series.\nDevelopers really took inspiration from Celeste to get bs mechanics, i generally do not find a lot of the gameplay new or interesting, it lacks a lot of character.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "can't recommend in it's current state. there are issues that carried over from HK like the joystick control for nailbouncing being rancid and if the controller disconnects you gotta restart the whole game for it to be recognised again.\n\nI did like a lot of it, but team cherry made some rather bad design choices in attempt to make the game harder, but ending up making it tedious and unfair rather than challenging.\n- too many double dmg enemies\n- bad add spam at certain bosses making certain adds way too hard to deal with (beastfly)\n- some bosses really not giving you openings and being able to force you in a corner if they don't do certain combos that let you dodge past (last judge)\n- the beads dropping only from sentient bugs making them rather scarce unless you find secrets, which is just made worse by being able to lose them easily in parkour rich areas populated by tough enemies (sinner's path)\n- some nailbounces (hunter, beast) being insanely unreliable for parkour\n- enough parkour bits have too little checkpoints\n- some flying enemies being insanely annoying in parkour areas because you gotta use tools or expend silk to reliably kill them and even then they are rather likely to hit you\n\nit could be an amazing game and I don't fully regret buying it, but I'm likely not gonna finish it compared to hollow knight which I finished with the true ending twice over. there are just so many bad design choices in this one that make the game frustrating rather than challenging and I'm kinda done sucking off team cherry for this one. criticism where it's due",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "another game ruined by absolutely retarded friction, i hecking love running around blindfolded looking for maps and invisible walls, those guys probably played dark souls in offline mod hitting every single flat surface to find secrets",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Is it good? Yeah. Would I recommend it? No.\n\nHollow knight was like a coach slapping you on the back and telling you to \"go get em!\" It felt do-able and fair. \nSilksong is like that same guy pushing you to the ground and throwing sand in your eye.\n\nA lot feels like being difficult for the sake of being difficult. It's like an old NES game in that aspect.\nFor example, the giant pit. It isn't hard, it isn't fun, you just misstep and have to walk all the way back. There's no challenge or hard enemies, it is just time consuming. I'm not sure what the vision for that was. To feel burdened? To give the player a sort of anger? It clearly wasn't for some enjoyment aspect since it's anything but that. In games like Getting over it, if you fall, you do lose all that progress. In order to climb back up, however, it's the same skill checks again. A repetition of a challenge you've already overcome to test if you are reliable at it. It's fun in that aspect, A test of might to see if your progression was just a fluke or if you are really getting better. The pit does not offer such nuance. You just walk. That is it. Maybe kill an easy enemy or two.\n\nThere is clearly some artistic vision, but it is severely held back by the brutality of the difficulty and just how unforgiving and unfun it is. Defenders will usually just say to \"get good,\" but when the game is as frustrating as this and discourages you from attempting techniques, it's really hard to push through and keep playing.\n\nI am usually a fan of difficult games, I like a challenge, but when the challenge feels like its all fabricated so they can have said challenge, it loses its touch.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For reference I've played Hollowknight pretty much every \"Soulslike\" game.  I was excited when Silksong  started playing kind of Soulslike... but I'm 44 hours in and I will tell you it gets to the point where it isn't just challenging, but way too tedious and annoying.  Like, I get what the developers were trying to go for, but I personally think they went a bit overboard.  I enjoy a great challenge, but this game just becomes annoyingly difficult all the time that it's not even enjoyable anymore.  I REALLY wanted to love this game too... womp womp.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game but it honestly feels like the developers spent 7 years getting too good at the game and ended up making this impossibly hard. I don't want to spend hours on mandatory gauntlets with 10 waves of enemies. Disappointing, as everything else about this game is amazing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is unbalanced and far too punishing to make it fun. maybe ill play it again when the devs have patched it to make it actually playable for someone like me",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}