{
  "positive": [
    {
      "review": "Мафия 2 вышла целых 15 лет назад, а я до неё только сейчас добрался — и ни капли не жалею. Игра оставляет мощное впечатление атмосферного гангстерского кино с реалистичным сюжетом о цене криминальной жизни. Финал логично подводит черту под всем происходящим, оставляя чувство, что всё было не зря, но и счастливым концом тут даже не пахнет.\r\nНо сюжет проще, чем в первой Мафии (где история Томми Анджело зацепила меня сильнее), зато миссия «Лестница в небо» — отличная отсылка, прям до мурашек.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Легенда видеоигр, игра сравниваемая с ГТА но более серьезном виде - Мафия 2. Вито Скалетта, Джо Барбара, аж слёзы на глаза накатывают. Пытался пройти на 100% достижений, но потом в этом смысла не нашёл, т.к. рано или поздно всё равно я вернусь к ней. В технических моментах игра уже конечно старенькая, но от этого все равно не появляется отвращение к прохождению.\nВердикт: 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A light remake — worth playing if you love the story\nMafia II: Definitive Edition is not a great remake, it still has many \"old\" points: simple gameplay, some outdated mechanics and many bugs/technical issues. However, if you love the story, classic mafia atmosphere, character drama, gangster setting, the game is still worth playing, especially if you have never played the original. However, if you are looking for a \"new\", modern, open and expansive experience, you should consider carefully.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Mafia II is, without a doubt, the crown jewel of the entire trilogy. From the characters to the music, everything just hits perfectly. For a remastered 2010 game, the graphics look shockingly good. The chemistry between Vito and Joe is honestly one of the best parts. Their dialogue is so natural and entertaining that it almost feels like you’re the silent third wheel riding around with them. The story really kicks into high gear near the end (no spoilers), but even before that, the missions and character moments keep things fun. This game will also make you realize that everyone needs a friend like Joe Barbaro… preferably one who causes slightly less chaos, but still. One small gripe: there’s no proper free-ride mode, so if you just want to drive around and vibe, you basically have to hop between chapters like you’re time traveling with a Buick. Minor annoyance, but worth mentioning. Now, the DLCs. Both Jimmy DLCs? Absolute cheeks. I have no clue who woke up at Hangar 13 and said, “You know what Mafia needs? An arcade score system.” The achievements for those DLCs felt like punishment for crimes I didn’t commit. But Joe’s Adventure? Fantastic. Easily makes up for it. It adds great lore and gives you a deeper look into what Joe was up to behind the scenes. The way this game injects itself into Mafia I, how and why Vito and Joe did what they did, it gave me literal goosebumps (being vague to avoid spoilers). Playing Mafia II is definitely a cannon event in everyone's life. Easily the most memorable game of the franchise.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not a fantastic game, but not a horrible game either. The best bit about this game is the story and driving parts, I find the gunplay to just be very typical of any other shooting game. I would say it is worth playing through.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's good but not really definitive. It's a decent remaster but why not just go all out and remake everything like Mafia 1?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Extremely good game does stutter sometimes and bugs on startup, aside from that would definitely recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it drives me mad that some of the npcs in the cut scenes are so poorly done, especially the women. even in the enhanced version some of the main bad guys look like they had zero budget to make them look right. The quality of all the cinematic cut scenes are a noticeably awful blend of higher res textures on some areas and super dated low res details in other areas. But, everything i loved about this game held up and this time around- the city, the cars, and the games overall performance are turned up in comparison to the original. there are some programming flaws in this version but overall, i'd say this game is actually pretty DAMN good. It is nice to experience the destructible environments, the lived-in alleyways, the noisy apartments, the amount of responsiveness the npcs have based on what your character is doing... it's all nicely done. honestly this game deserves updates to make it even more modern. it's one of the best mafia games i've ever played and i think most people who played it on the xbox360 would agree. what's the matta wit you? do you wanna be in the family or not, kid?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mafia II: Definitive Edition still delivers a great story with awesome vibes, even if the “Definitive” part can be hit or miss. The atmosphere and characters hold up incredibly well, but some of the remaster polish is a little rough. Still, it’s a solid mob drama that’s worth playing.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A great game overall, there are a few bugs and the game has aged in both a good and bad way. There are however a few DLC's that I will get back to and play at some time.\r\n\r\n+ story\r\n+ vibes\r\n+gunplay\r\n\r\n- bugs\r\n- I enjoyed Mafia 1 more\r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The only good Mafia game out of the quadrilogy. The other three are varying levels of hot flaming garbage",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Welcome back to Empire Bay, where the cars are shiny, the music is fantastic, and the glitches are now in glorious 4K.\n\nYou play as Vito Scaletta, a war hero who returns home to live the thrilling life of a gangster. And by \"thrilling,\" I mean you will spend a surprising amount of time selling gas station stamps, scrubbing urinals, and driving back and forth across a bridge while your best friend Joe screams at you.\n\nThis \"Definitive\" edition is famous for adding new bugs to a 10-year-old game. You might see characters’ eyes stop blinking, cars falling through the floor, or Vito’s hat deciding to float away to start its own family. It is less of an open-world RPG and more of a \"driving to work simulator\" with occasional tommy guns.\n\nCome for the mob drama, stay because your car is stuck in the pavement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A worthy follow-up to the first installment. Although unrelated to that story, details of a character's fate are made much clearer. Opinions differ on which game is better and I, personally, can't decide. Kudos to the producers for having the restraint to keep gameplay almost identical to the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First I'll start with the good, The game has a great, engaging story and the city itself feels pretty real and lived in. gameplay is overall pretty fun and is definetly worth a playthrough if youre a fan of wiseguys and shootouts. \r\n\r\nHowever the defintive edition is so badly optimized its not even funny, you WILL experience horrible frame drops, theres no if ands whats or buts, even on high tiered hardware, I also found that character models would bug out a lot during cutscenes. Honestly after playing through Mafia definitive edition it kind of hurts me that they didnt put the same care into this game as they did with the first, I mean they only updated some charcter models so during some cutscenes you get a good looking high res character talking to what looks like a ps2 character. but none the less I enjoyed the game and would recommend giving it a playthrough bugs, laziness from the devs and all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia II: Definitive Edition delivers a great story with a strong atmosphere and memorable characters. The world feels alive, and the soundtrack really brings the era to life. Gameplay is straightforward but fun, and the missions keep you engaged. Despite a few technical issues, it’s still a solid and enjoyable experience. Definitely worth playing if you love story-driven games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 – A Timeless Crime Drama Reborn\n\nMafia II: Definitive Edition faithfully preserves the emotional power and cinematic brilliance of the original Mafia II while giving it a modern facelift that lets the story shine brighter than ever. This isn’t just a remaster—it’s a beautifully enhanced version of one of gaming’s most unforgettable crime sagas.\n\nSet in the meticulously crafted 1940s–50s city of Empire Bay, the game immerses you in a world of post-war America filled with jazz, snow-covered streets, neon lights, and the harsh realities of organized crime. The atmosphere is unmatched—every district has personality, every radio song sets the tone, and every visual detail enhances the world’s authenticity.\n\nThe narrative remains the heart of the experience. Vito Scaletta’s journey—from immigrant kid to mafia soldier—is gripping, tragic, and full of razor-sharp writing. The emotional weight of the story, paired with some of the best character chemistry in the genre (especially between Vito and Joe), makes it stand shoulder-to-shoulder with classic mob films like Goodfellas and The Godfather.\n\nGameplay is tight and grounded, offering intense gunfights, dramatic set-piece missions, and driving physics that feel authentic to the era. The upgraded visuals, improved textures, and enhanced lighting breathe new life into every scene, and the remastered soundtrack perfectly captures the period.\n\nWhile not packed with endless open-world distractions, Mafia II: Definitive Edition excels by focusing on what matters most—story, atmosphere, and characters you won’t forget.\n\nA beautifully remastered classic and one of the finest narrative experiences in gaming.\n\n10/10 – Stylish, emotional, and timeless.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game made with heart. I really like it, I have really good memories from my childhood and even now after some years it's still pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story and atmosphere are probably the best parts of this game. It feels alive, and the 1940s–50s vibe goes perfectly with the music radio, voice acting, and style. The storyline is at a medium pace and it gets more interesting the further you get into the story.\n\n(kind of reminds me of GTA)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐ 5/5 – A Timeless Classic\r\n\r\nMafia II is one of those games that sticks with you long after the credits roll. The story is incredible—cinematic, emotional, and full of memorable characters. The atmosphere is perfect, from the snowy streets of Empire Bay to the iconic soundtrack that pulls you right into the 1940s–50s era.\r\n\r\nThe driving can feel a little dated at times, but everything else is so well done that it hardly matters. The missions are fun, the world feels alive, and the pacing keeps you hooked from start to finish.\r\n\r\nIf you love strong storytelling, great voice acting, and classic mob vibes, this game is a must-play. An absolute gem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every time I watch Goodfellas or Casino, it makes me wanna play this. I love this game so much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed Mafia2, the story was so good ;) I thought their were to many timed events, which made the game hard for me at times. I found the boss fight to be fun as well, I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really immersive story, the whole game is a movie and you get to play your role.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good nostalgic game, still a bit of glitch here and there, but the overall experience is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game with an insane twist at the end. I had freakin goosebumps! xD \nExperience this game once!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game for the first time on the Deck so that's the experience I'm reviewing, but with that said the game is great, great story though sometimes the checkpoints can be spaced out pretty far. Also the fist fighting system isn't the greatest, not letting you throw a punch when the AI wants you to dodge and not hit 🫤 it's not a super big deal but can get annoying at certain points. Also the aim assist can be janky as well, not offering any assistance when it should. Also the game only took me 14 hours to beat and I tweaked out my cars and spent time crushing cars for $, so with that being said I would definitely pick this up when it's on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best story of the entire Mafia series. Amazing to say the least.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is goated and really good. The story is even better than the first game. Of course the PC port sucks. Chapter 14 was glitched, other chapters too. The glitches and bugs did not really bug me because i was able to get around them. Have not played the DLCs yet, but i am planning too in the near future. Vito Scaletta is badass.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic mafia story. Although still had some technical issues while being a definitive edition, but still enjoyable. Had a lot of fun playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia 2 was a really enjoyable game, and the story was a lot of fun—especially if you like Mafia-style narratives. The ending was a bit wack, though.\n\nThe DLC is horrible and drags down the 100% significantly.\n\nGame: 7/10\n100%: 2/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia 2 Definitive Edition made me able to replay this game again as OG version broke itself due to newer OS. Story and game itself is great, an absolute classic in gaming world, however for technicalities it's quite mediocre. Game didn't crashed me once, however I've experienced some minor bugs and constant micro stutters. It's playable, but experience is pretty \"meh\" compared to astonishing Mafia 1 Definitive Edition or very unstable, yet much nicer looking Mafia 3 Definitive Edition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game with a lot flaws but a good story and good characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was nicely done, wish it was a remake like 1. The story was engaging with a great soundtrack. later chapters felt a bit rushed but overall a fun game. I wasn't a fan of the dlc's, pretty underwhelming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a worthy successor to the first installment, captivating players with an emotionally engaging and highly varied story that whisks them away to the 1940s and 50s—and doesn't let go quickly. The tone is mature and caters to players who enjoy a fast-paced, high-stakes life.\r\n\r\nFor me, the graphics were perfectly satisfactory, and the driving physics felt refreshingly realistic, especially since I played on the \"Simulation\" mode. The radio music perfectly complements the atmosphere, making it easy to fall in love with the 50s era in particular. While the combat system is varied, it is no longer state-of-the-art in late 2025. Personally, it was more than sufficient and still provided plenty of fun. I also appreciate the realistic difficulty, as you can die relatively quickly if you neglect your cover too much.\r\n\r\nSince I played the Definitive Edition, I only encountered minimal bugs, which were very rare. Over approximately 125 hours of playtime, the game crashed only about four times, which I would certainly consider stable.\r\n\r\nOverall, this is a must-play for all fans of the series and for players who want to dive into a mature setting where societal conventions are secondary.\r\n\r\nRating: 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay, the honest not so great first. No real choices, a few bugs, the game pushes you rather than guides you. That being said, it is  one of the most compelling story games I've ever played. I found myself fully engaged in the characters, and became addicted to what was going to happen next. While the game does not have choices or consequences based on your play style, it is a joy to play. Graphics are awesome - the sound track is excellent. Skill sequences are realistic. Most of all, the game is incredibly historically accurate and immersive. A must play if you enjoy story rich, fantastic graphic games as well as the beauty of old cars and historic detail.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "*chefs kiss*\r\n\r\nnot perfect, but man.\r\n\r\nat its time. this game was top tier, and in a lot of  ways, still is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very engaging story and true to the times, including the themes and vehicles, clothing, weapons. Some minor visual bugs occasionally like people spawning standing inside a car, nothing game breaking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The language used in this game is something you would here in a post-game COD lobby.\nUnclear if the ice was added on the roads before or after the car handling was programmed.\nLeaps better than the first installment, although the game's age shows in its combat, shooting, and driving.  Visuals are alright, but there's like 3 character models per ethnicity.\nSo far, good story telling.\nIt confuses me why topless women are collectables (or why this is even a thing), but dudes shower in the underwear.\nA pretty big negative is the checkpoint system in missions (the game is basically a never ending mission told in chapters).  If you want to fuck around in the city before going to bed, end up in a car chase, crash and die or are shot by the cops, have fun redoing the whole last mission before going to bed... \nNot regretting the Mafia bundle as much.\n\nEdit: finished the main story.  Decent cliché mafia story, and the only real thing this game has going for it.  Each day is another chapter in the 15 chapter story told over several years, following Vito's leap into the life of a gangsta.  This game would have been 100 times better by eliminating the open world.  There are no valuable side-activities.  It's an absolute waste—driving the same highway and roads to pick up and drop off Joe over and over is repetitive and boring and serves as playable load scren while listening to dialogue.  And the driving isn't fun.  The cars slide all over the place, and having the cops chase you for going over 40mph is a nuicance; at times resulting in death and restarting a whole mission.  The gunplay provides a break from the majority of time spent driving; however, the basic-somehow-worse-than-Gears of War-cover based shooting is not fun, and you're most times better off not using cover at all, and playing the shootouts like a round of CSGO.\n\nI still recommend this game for the story alone.  I have no finished a game like this in quiet some time, so I am impressed by the game's ability to keep my attention.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like the old mafia 2, but with different graphic. good game that's with my money!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprised me the difference started replaying on classic then jumped on this one hugely impressed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty good 7/10, but there are a lot of bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia II. \r\nJe to příběh, který se ti pomalu dostane pod kůži, až si uvědomíš, že už jsi jeho součástí.\r\nTemné ulice Empire Bay, studený vítr mezi budovami a tóny starých písní vytváří atmosféru, která tě vtáhne a nepustí.\r\n\r\nJe to svět plný morálních dilemat, zrady a snů, které se vždycky platí příliš vysokou cenou.\r\nKaždý krok, každá jízda nočním městem, každá přestřelka má svou váhu.\r\nA právě to dává příběhu sílu — není o hrdinech, ale o lidech uvězněných mezi tím, co chtějí, a tím, co musí udělat.\r\n\r\nEmoce v Mafii II nejsou přehrané.\r\nJsou syrové, opravdové a bolestně lidské.\r\nVito, Joe, rodina, loajalita… žádná z těch věcí není jednoduchá a právě ta realističnost dělá ten příběh tak nezapomenutelný.\r\n\r\nJe to hra, která tě nechá přemýšlet ještě dlouho po dohrání.\r\nTemná, krásná a neuvěřitelně vtahující.\r\nMafia II ukazuje, že cesta ke snu může být stejně tragická, jako je působivá.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just wrapped up Mafia II and yeah, the story absolutely punched me in the face. The whole thing with Vito trying to help his sister and she ends up seeing him as a monster? Pain. And when Joe refuses to take Vito out later on… dude might be a mess, but that moment proved he’s the realest friend in the game.\r\n\r\nGotta be honest though, the first few chapters were a struggle. Before the prison part, it felt super slow and I was low-key missing the graphics from Mafia 1 Definitive Edition. Missions repeat a lot too — shoot, drive, repeat — but like, I kinda knew what I signed up for.\r\n\r\nCops were way too pressed about everything, and the early pacing almost lost me, but once the story picks up, it actually goes hard. Vito’s loyalty (especially with Leo) carried the whole experience for me.\r\n\r\nI’d recommend this to people who care more about story than flashy gameplay. If you want a giant playground like GTA, this ain’t it. But if you want a crime story that hits emotionally and sticks with you after the credits, it’s worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest franchise of all time even after all these years still as good as the first time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Я не розумію навіщо було випускати Definitive edition, адже у класичній версії все так само)\r\nГра непогана.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia II: Definitive Edition packages the original narrative-driven crime drama with visual upgrades and all previously released DLC. The core story remains unchanged, following Vito Scaletta’s rise through organized crime. Its pacing focuses on character relationships and low-level jobs escalating into large-scale conflict. The narrative tone is grounded and consistent.\n\nThe open world is more of a scenic backdrop than a systems sandbox. Empire Bay offers detailed neighborhoods, era-specific vehicles, and atmospheric weather, but optional activities are limited. The game points players toward story missions rather than emergent gameplay. This design choice keeps attention on characters and plot rather than side content.\n\nGunplay is functional, with cover-based mechanics and period firearms. Combat encounters are brief but impactful, often serving as punctuation for major story beats. Vehicle handling reflects the heavy feel of mid-century cars, demanding momentum control during chases. Some players may find driving physics stiff, though this supports the historical theme.\n\nVisual upgrades include improved lighting, textures, and asset clarity. However, the remaster introduces occasional bugs and performance drops on certain systems. Character models look sharper, but animations show their age. Cutscenes maintain cinematic framing and remain the game’s strongest presentation element.\n\nSound design reinforces the setting. Licensed music anchors the timeline, and radio stations provide cultural context. Voice acting is strong throughout, conveying tension and loyalty across key dialogue scenes. The soundtrack bolsters immersion during both quiet drives and chaotic firefights.\n\nProgression is linear, with no skill trees or extensive customization. Mission variety relies on narrative framing rather than mechanical complexity. This streamlined approach keeps the runtime focused but may disappoint players expecting more RPG-like depth.\n\nOverall, Mafia II: Definitive Edition preserves the original’s narrative strengths while offering modest visual improvements. Performance inconsistencies hold it back from being a definitive upgrade, but the story and atmosphere remain compelling. For players who value character-driven crime drama over open-world activity density, it is still worth experiencing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent Game, waiting to play the latest edition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia 2 is awesome and this is just Mafia 2 but with better graphics. I had some glitches and shit but nothing to horrible with this one. I would highly recommend this one. The story is amazing the game play is solid I love the 50s style cars and clothing. This game is peek. Plus there's playboys with real photos of women's tits. Its all awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished without any bugs.\r\nAdditionally Applied FOV fix because default one is really close and unplayable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good story, my opinion better than mafia 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely have no words, this is probably one of the best games i have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wish they would do a remake, mafia 1 was so much better because of it. but remaster is alright.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistic and cool action game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sorry kid, 60 fps wasn't part of our deal.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "sorry vito,remake wasnt part of the deal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My childhood right here, didn't even know they made a definitive edition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enemies have the ability to one tap you in the finale mission",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "re bueno nose ya es algo viejo pero esta re bueno",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rip joe, rip tommy whoever that guy is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing classic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best story game i have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE BEST GAME EVER MY LIFE IS ON THIS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game i ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good dont ask y",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better then GTA .. by far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "malo roboty wlozone w tego resrajka",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Should've just kept stacking boxes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goood game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Legend game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best of the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i playe it just to collect tits",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well that was amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the mafia  games there awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "+REP R.I.P Joe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The plot is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nostalgia je krasna vec",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUH GET A BAHT ET",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Cinema \n\n\nGOAT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Joe wasn't part of the deal ig",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Best Mafia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7,5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow, so good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Mafia",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I am stopping playing all 2K games as now 2K games install spyware to collect deep personal user info, device info, IP address, GPS location, internet activity-browser history etc for its use/sale to third parties and potentially pass on to US/UK/EU government. Also i will never buy a game again from 2K games. 2K Games and Rockstar belongs to Take-Two Interactive so i will never play or buy a game again from this company this includes future Games like GTA 6 or Red Dead Redemption 3. Good Job Take-Two Interactive i am 100% sure loyal Customers and fans of games like GTA or RDR (one of the very very few games in the gaming industry which have the quality for gamers to must have and must play, cant wait for them to be released etc.) will absolutley loving such methods and practice and will buy ur products nevermind. But in my case i am done with your company for all time.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "One of the worst remasters I've ever played, buggy and lacking any new content and features! The definitive edition for the first Mafia is still infinitely better than this lazy port!",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "game,story is so awesome i really fall in love but the optimization is like sh1t and game always drops when u using car even if you re using strong pc like me and AI IS SO F**KING DISGUSTING",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "A case of a community being blinded by nostalgia and developing a bias for a game that's at best mediocre. \n\nI went into it knowing the things people liked/praised it for (story, minor details, cars/driving mechanics) and what people found lacking and still felt like I was eating flavorless mashed potatoes. The age shows and the game's actual structure (scripts, bugs, mission structure) seem poorly designed/written. For all I know the developers were new to the industry, I didn't research the background of any of the personnel or studio. If they were new and rookies, it shows in the AI, lack of variety in gameplay, focus on minor unimportant details and disregard for larger more crucial details/elements that should've been prioritized. \n\nI believe the development was unstable and 2K wanted the game OUT. Rushed development, unsatisfying product.\n\nStory was lackluster and it felt like the pace was too quick for anything to develop. Character deaths were predictable, ending was VERY underwhelming, (there were meant to be multiple endings and this concept never should've been cut...) the game is short. Characters aren't very charming and there's not enough time given to them for players to feel any sort of attachment. \n\nVito (the main character) has nothing that emphasizes his humanity, for example. Initially it's his family that serves as the human element to him but then this narrative element disintegrates. (I'm getting tired of games failing to write compelling narratives when they get it halfway right then fumble it.)\n\nOverall, an empty experience that lacks the minor details to give it a spirit and charm. Not a bad game but very much a product of the early 2010s and LATE 00s of gaming where I feel like the studio was spread too thin and the experience suffers as a result (many such cases when playing games from this period.)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After playing through this game, I was rather dissapointed. First of all, compared to Mafia I it just seems lay to me that Mafia II is just a remaster. Wonder what they could've done if it was a proper remake. Secondly... I really did not enjo the story. It felt really torn apart and not connected at all what you had to do and why Vito has done what he does. Especially halfway through the game. The gameplay itself was fine really. It did lose some of the charme the first Mafia had and i felt like more enemies were just used for the sake of it. What the game did right again however was the feel and worldbuilding of the town. Like the first mafia everything around you felt like it belonged there and had a purpose in the world. Few games manage to create this feeling with the world around them imo. Alltogether.. for roughly 15hours of gameplay you could absolutely get worse games, tho the fact it's supposed to be some kind of sequel to Mafia really pulls the whole game down a lot. Mainly cause it feels really cheap that it's just a remaster.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I normally don't post reviews and if I do you have to make feel a special type of way and this did. It made me extremely upset and disappointed if it wasn't for the fact I got this in a bundle I would've demanded my money back I wish I could've gotten my time back that I wasted on this from the amount of bugs in the game it definitely wasn't worth my time plus getting soft locked on chapter 13 I'm done I uninstalled this trash and won't be picking it up ever again I hope to one day forget I even played this so called \"definitive edition\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Compare to mafia 1. it’s just a disappointment.\r\nMillions of bugs in this game. Story is lacking.\r\nI’m not sure if the bugs made me hate this game or if the game is simply bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game with problems where u need to do something to play it correctly ...Detele please this mess frm store",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't even know where to start.. I started playing this game right after I finished Mafia Definitive Edition and it was nothing but a huge disappointment.. This game is buggy as hell there are tons of visual bugs alongside game crashing bugs. Throughout my whole playthrough I had about 3 to 5 crashes if not more. Also save system takes you way further back than it should.\n\nVito is an empty canvas with little to no personality or purpose just like most of the other characters in the game and not just the characters, story itself too. I can’t even bring myself to call this a mafia game. In the first half of the game we are not even in the mafia. After that everything goes too fast, too soon I couldn’t even get used to the idea that we are officially in the mafia until it was too late. Vito’s relationship with his family is… existent, I guess, just to make him a bit more tragic. The story… yeah, it has its moments but they are SO FORCED and SO FAKE that I just accepted it as nonexistent.\n\nThe only good thing about this game is Joe..  he’s the only character that actually has some life in him. Also the music is great I enjoyed the radio more than I enjoyed the game itself.\n\nI’m not sure if the bugs made me hate this game or if the game is simply bad, but overall, for me it’s just a disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's much worse than the first Mafia game, still better than most of the modern crap they're making now a days. overall, not a very good game though",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mafia 2 is a great game but this remaster is a lazy cash grab.  It runs poorly with terrible optimisation and hardly looks much better than the original game.  Later levels have a lot of obvious bugs that should have been caught in QA.   If this is your only way to play Mafia 2, then it's fine but if you already have Mafia 2 this is a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Encountered a few game breaking bugs. Waste of time to play. Maybe the old version is better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is a spit shine difference in visuals at the expense of taking up more hard drive space,. Mafia 2 Classic is just under 8gbs for the base game, which is all you need because the DLC sucks ass. You should only buy this for the original Mafia 2, you're better off not bothering with Definitive Edition.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i read a lot of reviews about the original one being far better than the definitive one and its true, this game has a trash checkpoint system , the enemies sometimes spawn out of nowhere and kill you , the overall gameplay had a lot of bugs like in one mission the dialouges were repeated , mafia I definitive edition was so good but this was a disappoitment . As leo said \" Sorry kid , bugs were not a part of our deal\". Play the classic one if you can..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game have problem with saving game. I lost 4 hours gameplay after I die and it has to be played from beginning",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are good, sound design is good, everything is good about this game but...it's kinda overrated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rating: 2/5\n\nNot nearly as good as the first one, and the DE is unfortunately buggy as heck. Combat is horrible, story isn't nearly as good as people say. Only redeemable qualities for me personally is the alright driving and the music, plus the atmosphere is charming for the first few hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow 1st part is way smoother and more responsive than this, its a nightmare to play, feels like this part is much older than the 1st..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disapointed. It doesn't change anything from the original game, and the save system is trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]A bit disappointing[/h1]\r\n\r\nThe game cannot be played with the same immersion degree after the first \"Definitive\" one. To produce a remastered version of the second part instead of a good remake was quite a stupid decision. \r\n\r\nAnd even not taking into consideration the gameplay aspects I cannot call the game interesting due to the plot. It is so plain, so down-to-earth, not having any moral ideas and not leading anywhere actually. One cannot but compare it to the previous that had a perfect organisation and goals.\r\n\r\nThus all the described things lead to the mentioned disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is a very lazy and sloppy Remaster. You can immediately see it in the steam from the vents animations, and further in the game, you will experience numerous visual glitches, as well as constant stutters and FPS drops. I would say that this version is good only for those who are reluctant to install the patch and manually limit the frame rate. Despite that, even those problems cannot spoil a good game at the core.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wasn't a fan of the original Mafia 2 and never beat it so decided to try this \"definitive\" edition now nearly 12 years later.\n\nFirst, the game itself is mediocre. Combat is basic and very annoying, being killed easily in one shot multiple times but also having to shoot enemies five to ten times for them to die. The driving is horrendous. \n\nThe save system is atrocious.\n\nThe open world isn't at all useful for anything but progressing the story which I remember hating when the game came out.\n\nGTA IV and other games like Sleeping Dogs were 10 times better.\n\nThis version is buggy as all hell. Too many to count and many nearly game breaking. \n\nThis is hands down the worst remaster I have ever played.\n\nThe original Mafia is pretty good along with its remake. Mafia III was kind of boring but decent.\n\nThis is easily the worst of the three.\n\nThe only one thing that makes this game acceptable is the story that I haven't finished because I just don't have the patience to waste another minute on this overhyped garbage.\n\nOriginal game is a 4/10\n\nRemaster is a 1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Remember, if just one character shown on the cover isn’t actually in the game — and happens to look a lot like a character who is — that’s a bad sign!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Не понравилось. Ремастер вообще из себя ничего не представляет, никаких особо улучшений. Игра очень старая, и до сих пор так ощущается. Технически всё очень плохо, я столько багов в киберпанке не встречал. Буквально я вынужден перезагружать миссии из-за этого. Также не понятно почему нету сохранений, или хотя бы авто сохранений. Я прошёл 50 процентов миссии, умер, начинай сначала, на, смотри катсцену опять, минус пол часа жизни. Да, тут есть интересные механики, например всё что связано с полицией, а также интеракции в квартире и магазинах, но всё остальное ничего интересного из  себя не представляет. Одни и теже модельки нпс, устаревшие анимации. Я не осилил.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A serious let down in terms of remasters. If you played the original Mafia 2 then you would be advised to stay there and play that version instead. This Definitve Edition, if you can call it that, lacks the shine that the previous Mafia 1 remake has by a long shot. The story finds Vito Scilata in a classic rise to power with his best friend that inevitable leads to a fall before being rescued by elements of the same mafia he ends up pissing off. \n\nGameplay wise this feels like a very serious step back. Sure there are more ways to engage in combat like hand to hand combat but it all feels out of touch. Like it lacks that pinache or something that would have helped make it great. Weapon selection is ok and is a decent improvement over the original but the controls in general just feel almost counter intitaive and less natural at times. \n\nIn terms of remakes. This is by far a BIG let down versus the original. The graphcis themselves look and feel like a massive step back versus the remake of Mafia 1. Almost like a early PS3/late PS2 graphics. Nothing spectucular here. Sure this version does include the original versions DLC that would come out later but when the base game feels like a mess it's hard to really justify it in a way. \n\nSo the questions is should you buy it? For me the answer is a big fat NO. Do not buy. The game just feels like a mess from even just the early goings of it. Odd graphical glitches, a big step back in terms of graphical and gameplay performance. This is simply put. Not worth the money that they are asking for it. BIG thumbs down from me. Not recommeneded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2K Games changed their privacy policy in November 2025. They now have an automatic data miner in their games, selling our information to anyone interested. No games from them. Don't play games you already own; let them go bankrupt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i encounter bugs and crash in this game much more than i did in my entire lifetime playing games since 2004",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game had a good ending. It was overall not that good. Too much walking going from place too place.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every time you die, you lost 10 minutes of your life, why we don't have manuel save. I had to quit for this reasen at chapter 8.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BUGGING AND SHITTING DEFINITIVE EDITION MY ASS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dissing the Irish👎🖕",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n[12:09]\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 120
    },
    {
      "review": "I love Mafia 2, but unfortunately even after 5 years the definitive edition is broken as hell and it's riddled with immense amount of bugs.\n\n\nPlay the original version instead.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "I am stopping playing all 2K games as now 2K games install spyware to collect deep personal user info, device info, IP address, GPS location, internet activity-browser history etc for its use/sale to third parties and potentially pass on to US/UK/EU government. Also i will never buy a game again from 2K games. 2K Games and Rockstar belongs to Take-Two Interactive so i will never play or buy a game again from this company this includes future Games like GTA 6 or Red Dead Redemption 3. Good Job Take-Two Interactive i am 100% sure loyal Customers and fans of games like GTA or RDR (one of the very very few games in the gaming industry which have the quality for gamers to must have and must play, cant wait for them to be released etc.) will absolutley loving such methods and practice and will buy ur products nevermind. But in my case i am done with your company for all time.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "[h1]I have significant issues with this game, particularly with its save system.[/h1]\nThe lack of a proper save mechanism makes it difficult to maintain progress, which can be incredibly frustrating, especially when encountering bugs or disconnections.\n\nAdditionally, the achievement design feels unnecessarily tedious, and some of the DLC missions seem like they’re designed purely to stretch out the gameplay, without adding meaningful content.\n\nAside from the main story — Vito’s storyline, which is somewhat decent — everything else is just flaws. [u](And there’s no cloud save, but since that didn’t actually affect me, I’ll hold off criticizing that for now.)[/u]\n\nAlthough this game has many flaws, I still wanted to give it a positive review at first because of Vito’s story — until I encountered a bug that became the last straw and triggered my outburst.\n\nI’m an [b]Achievement Hunter[/b]. I worked hard to complete all those annoying achievements in the game until there was only one left — the one that requires you to drive 1,000 miles, about 1,610 kilometers, taking over ten hours.\n\nI drove the entire distance manually without using that well-known AFK exploit to farm mileage. So yes, I drove for more than ten hours until I had only about 25 kilometers left.\n\nThat’s right — just 25 kilometers, barely ten more minutes of driving. Like an idiot, I had been manually driving aimlessly on the highway for roughly 1,585 kilometers, wasting over ten hours of my life.\n\nThen I found out I had been disconnected from 2K.\n\nOkay, fine — I quit the game, thinking I’d just finish the remaining 25 kilometers once the connection was back.\n\nBut when I launched the game again, hundreds of kilometers of my progress had vanished. That meant I had to spend several more hours driving all over again.\n\nI was genuinely devastated — and furious.\n\nI rarely give negative reviews. Even when a game has plenty of flaws or isn’t that fun, I usually just skip reviewing it.\n\nBut unless a game really pushes me to my breaking point — yes, this one did exactly that.\n\nThis is the first negative review I’ve ever written since I started leaving reviews on Steam.\n\nI’m not just angry about the bug itself — I’m furious at the utterly inhumane achievement design combined with such a devastating glitch that destroyed an achievement I had almost in my grasp.\n\nAnd then there’s the huge pile of other flaws.\n\nEvery single thing that infuriated me kept piling up, reaching a critical point, until one moment — a trigger, a fuse — set it all off, making me finally explode and break down.\n\nA Steam friend once asked me, [u]“Have you used any save game file from internet?”[/u]\n[u]I said no — I didn't use any save file.[/u]\nBut now… I’ve broken my word.\nYes, I have to use them.\n[h3]This negative review isn’t something I gave — it’s something the game earned all by itself.[/h3]",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "One of the worst remasters I've ever played, buggy and lacking any new content and features! The definitive edition for the first Mafia is still infinitely better than this lazy port!",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Mafia II: Definitive Edition isn’t a remaster — it’s a letdown.\n\nIf, like me, you played Mafia I: DE, loved the story and stunning visuals, and jumped into this expecting the same treatment… I’m sorry to say, this isn’t it. What we actually got is closer to an updated texture pack — the kind you’d normally just download as a free mod. On top of that, the game is sprinkled with bugs and small gameplay hiccups that are more irritating than anything else.\n\nThe story itself? Good. The characters are likable, the voice acting is solid, and there are moments that pull you in. But here’s the problem: the gameplay is boring. Out of my 4.5 hours so far, I’d estimate at least 3 were wasted driving across town, running filler errands (blue cartons, red cartons, white cartons… seriously?), or making endless trips back to my apartment just to sleep and trigger the next chapter. Instead of cutscenes or smart pacing, the game forces you into busywork that kills any momentum the story builds.\n\nI really wanted to love this game — I went in open-minded, ready to enjoy it. But after a while, it’s hard to ignore that it just isn’t that good. I’ll finish it only because I’m playing through the trilogy and I’m already halfway done. But if you’re on the fence? Honestly, save yourself the time. Watch a story recap on YouTube and skip the grind.\n\n10/7/25 Edit: I've finally finished the game and I felt that it is important for me to add this. \nI still think that what I wrote is very relevant and, unfortunately, a huge part of the game. But, I can definitely say there's a HUGE improvement with the pacing of the story and gameplay wise towards the last couple of chapters, which really did get me hooked on the game. \nSadly, I will leave my review as negative but take this edit as a glimmer of light - if you are willing to go through the unimaginably boring mid-game, the end is definitely solid!",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "game,story is so awesome i really fall in love but the optimization is like sh1t and game always drops when u using car even if you re using strong pc like me and AI IS SO F**KING DISGUSTING",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is great, it's hard to decide which is better, the first or the second, but as for the Definitive Edition, it's just awful, the game lags and freezes. I searched the internet and realized that the problem is with the edition, not the computer. The computer is powerful, the drivers too. They just made the edition as unoptimized as possible, while the first Definitive Edition is just great in terms of optimization and graphics. That's why I gave it this rating.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Definitive edition? More like\nbroken edition, the game is good not gonna lie but you can't call this a definitive edition \n\nIt's bugged...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First, the main game is an absolute masterpiece. The classic atmosphere, the incredible soundtrack playing on the radio, and the gripping story that completely pulls you in are phenomenal. The changing seasons, the cars, and the driving all combined to make my 15-hour journey through the story an unforgettable and captivating experience. And let's not forget those special posters you can find in the game... anyone who has played it knows just how amazing and engaging that collectible hunt is. It's pure fan service done right.\n\nHowever, a major warning for my fellow completionists:\n\nThe DLCs are a massive letdown and a chore to get through. Unlike the rich main story, the DLCs have virtually no narrative. They are essentially a repetitive grind: \"Go here, kill this guy, steal this car,\" and repeat the same cycle for 8 to 10 hours. It's incredibly tedious and nerve-wracking. If it weren't for the achievements, I would never have gone anywhere near them. All three DLCs are almost identical, with only one or two stages containing proper cutscenes; the rest are just repetitive filler missions.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A case of a community being blinded by nostalgia and developing a bias for a game that's at best mediocre. \n\nI went into it knowing the things people liked/praised it for (story, minor details, cars/driving mechanics) and what people found lacking and still felt like I was eating flavorless mashed potatoes. The age shows and the game's actual structure (scripts, bugs, mission structure) seem poorly designed/written. For all I know the developers were new to the industry, I didn't research the background of any of the personnel or studio. If they were new and rookies, it shows in the AI, lack of variety in gameplay, focus on minor unimportant details and disregard for larger more crucial details/elements that should've been prioritized. \n\nI believe the development was unstable and 2K wanted the game OUT. Rushed development, unsatisfying product.\n\nStory was lackluster and it felt like the pace was too quick for anything to develop. Character deaths were predictable, ending was VERY underwhelming, (there were meant to be multiple endings and this concept never should've been cut...) the game is short. Characters aren't very charming and there's not enough time given to them for players to feel any sort of attachment. \n\nVito (the main character) has nothing that emphasizes his humanity, for example. Initially it's his family that serves as the human element to him but then this narrative element disintegrates. (I'm getting tired of games failing to write compelling narratives when they get it halfway right then fumble it.)\n\nOverall, an empty experience that lacks the minor details to give it a spirit and charm. Not a bad game but very much a product of the early 2010s and LATE 00s of gaming where I feel like the studio was spread too thin and the experience suffers as a result (many such cases when playing games from this period.)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After playing through this game, I was rather dissapointed. First of all, compared to Mafia I it just seems lay to me that Mafia II is just a remaster. Wonder what they could've done if it was a proper remake. Secondly... I really did not enjo the story. It felt really torn apart and not connected at all what you had to do and why Vito has done what he does. Especially halfway through the game. The gameplay itself was fine really. It did lose some of the charme the first Mafia had and i felt like more enemies were just used for the sake of it. What the game did right again however was the feel and worldbuilding of the town. Like the first mafia everything around you felt like it belonged there and had a purpose in the world. Few games manage to create this feeling with the world around them imo. Alltogether.. for roughly 15hours of gameplay you could absolutely get worse games, tho the fact it's supposed to be some kind of sequel to Mafia really pulls the whole game down a lot. Mainly cause it feels really cheap that it's just a remaster.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a big downgrade compared to the first one (Mafia I DE/Remake). \n\nI'll play it fully when/if a true remake becomes available. \n\nIt will be the definitive version we deserve! This is just a 15-year-old game with a few patches... \n\nNot really worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is broken as hell, it remains the only game I have ever refunded in steam. I don't know if they will ever fix this or not but Mafia II easily remains one of my favourite games of all time, and somehow they managed to make this a letdown. The team should have used significantly more assets and efforts into the remaster. If you ever loved Mafia II, never play the definitive edition as you will be frustrated and be let down like me, buy the game and play the classic one from the past.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I normally don't post reviews and if I do you have to make feel a special type of way and this did. It made me extremely upset and disappointed if it wasn't for the fact I got this in a bundle I would've demanded my money back I wish I could've gotten my time back that I wasted on this from the amount of bugs in the game it definitely wasn't worth my time plus getting soft locked on chapter 13 I'm done I uninstalled this trash and won't be picking it up ever again I hope to one day forget I even played this so called \"definitive edition\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a 100% completion gamer for most steam games I play, this has probably been the most miserable experience I've had. While the main game was fun from what I remember (last played back in September 2022), the Jimmy Vendetta and Joe's Adventures DLCs have been nothing short of abysmal. \r\n\r\nFirstly, in what world is 1000 miles driven in strictly one of the DLCs, not including the main game, anywhere near reasonable? By the time I finished the entire DLC, I had only driven 100 miles. Second, the Massacre achievement for killing 1000 enemies isn't *that* bad, but, after beating the DLC while failing missions repeatedly because the enemy AI just straight up has aimbot and having to replay missions, I only ended the DLC with 400 kills. Not to mention, some of the missions are just straight up dumb with one of them being to drive a car and not have it go under 35 miles per hour for more than 3 seconds otherwise you just straight explode. Also, my game crashed constantly when starting missions. \r\n\r\nI can recommend the main game to anyone, but I would avoid the DLCs altogether, especially if you don't go for achievements in particular.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Compare to mafia 1. it’s just a disappointment.\r\nMillions of bugs in this game. Story is lacking.\r\nI’m not sure if the bugs made me hate this game or if the game is simply bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good story, bald optimization. Could be good as first one. Lazy dickheads. Many bugs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "compared to Mafia 1 def edition it looks rubbish. very dated looking. i only lasted just over an hour and gave up with it. i was excited to play after Mafia 1 as i thought it would look similar or better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game with problems where u need to do something to play it correctly ...Detele please this mess frm store",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't even know where to start.. I started playing this game right after I finished Mafia Definitive Edition and it was nothing but a huge disappointment.. This game is buggy as hell there are tons of visual bugs alongside game crashing bugs. Throughout my whole playthrough I had about 3 to 5 crashes if not more. Also save system takes you way further back than it should.\n\nVito is an empty canvas with little to no personality or purpose just like most of the other characters in the game and not just the characters, story itself too. I can’t even bring myself to call this a mafia game. In the first half of the game we are not even in the mafia. After that everything goes too fast, too soon I couldn’t even get used to the idea that we are officially in the mafia until it was too late. Vito’s relationship with his family is… existent, I guess, just to make him a bit more tragic. The story… yeah, it has its moments but they are SO FORCED and SO FAKE that I just accepted it as nonexistent.\n\nThe only good thing about this game is Joe..  he’s the only character that actually has some life in him. Also the music is great I enjoyed the radio more than I enjoyed the game itself.\n\nI’m not sure if the bugs made me hate this game or if the game is simply bad, but overall, for me it’s just a disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's much worse than the first Mafia game, still better than most of the modern crap they're making now a days. overall, not a very good game though",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mafia 2 is a great game but this remaster is a lazy cash grab.  It runs poorly with terrible optimisation and hardly looks much better than the original game.  Later levels have a lot of obvious bugs that should have been caught in QA.   If this is your only way to play Mafia 2, then it's fine but if you already have Mafia 2 this is a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Encountered a few game breaking bugs. Waste of time to play. Maybe the old version is better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is a spit shine difference in visuals at the expense of taking up more hard drive space,. Mafia 2 Classic is just under 8gbs for the base game, which is all you need because the DLC sucks ass. You should only buy this for the original Mafia 2, you're better off not bothering with Definitive Edition.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i read a lot of reviews about the original one being far better than the definitive one and its true, this game has a trash checkpoint system , the enemies sometimes spawn out of nowhere and kill you , the overall gameplay had a lot of bugs like in one mission the dialouges were repeated , mafia I definitive edition was so good but this was a disappoitment . As leo said \" Sorry kid , bugs were not a part of our deal\". Play the classic one if you can..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game have problem with saving game. I lost 4 hours gameplay after I die and it has to be played from beginning",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are good, sound design is good, everything is good about this game but...it's kinda overrated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rating: 2/5\n\nNot nearly as good as the first one, and the DE is unfortunately buggy as heck. Combat is horrible, story isn't nearly as good as people say. Only redeemable qualities for me personally is the alright driving and the music, plus the atmosphere is charming for the first few hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somehow 1st part is way smoother and more responsive than this, its a nightmare to play, feels like this part is much older than the 1st..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disapointed. It doesn't change anything from the original game, and the save system is trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]A bit disappointing[/h1]\r\n\r\nThe game cannot be played with the same immersion degree after the first \"Definitive\" one. To produce a remastered version of the second part instead of a good remake was quite a stupid decision. \r\n\r\nAnd even not taking into consideration the gameplay aspects I cannot call the game interesting due to the plot. It is so plain, so down-to-earth, not having any moral ideas and not leading anywhere actually. One cannot but compare it to the previous that had a perfect organisation and goals.\r\n\r\nThus all the described things lead to the mentioned disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is a very lazy and sloppy Remaster. You can immediately see it in the steam from the vents animations, and further in the game, you will experience numerous visual glitches, as well as constant stutters and FPS drops. I would say that this version is good only for those who are reluctant to install the patch and manually limit the frame rate. Despite that, even those problems cannot spoil a good game at the core.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No, just No to the Definitive Edition on this title! The textures are nowhere near a suitable 'upgraded' level, not even close - what a mess! I had high expectations for Mafia II after loving the original Mafia and its Definitive Edition upgrade. The face detail, texture maps and animations were amazing in that game, but not in this one - it's terrible. Even the cars look basically textured with the only good looking parts being the glass. And the buildings are no better.\nTo me, this seem's like a re-release with no more than a few hours of upgrading work.\n\nThe trilogy for A$20 is worth it.\nMafia I, for 15 to 20 hours playtime is worth it.\nMafia II, will hurt your eyes after 20 minutes playtime as all graphic upgrades are a facade.\nMafia III, I will say that this one should've been a 'in-between' story like the AC series did with Black Flag and its extra stories. But as for the game so far; I'm impressed with the acting, graphics and the MUSIC! It's a bit like a 1968 version of GTA5 and I feel like Frankin again :)\nMafia: The Old Country, is A$90 and has 'MIXED' reviews - on sale for this one. (this is bad for a AAA title!) After some patches It should be shiny & I look forward playing it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Game is a solid 7.5/10.\n\nWhat really annoyed me as a 100% Achievement Player, were some of the ridiculous achievements.. it felt like big stretching and really ruined the fun of the game. Haven't felt that in any game i 100%'ed so far.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "это просто пиздец, телепорты, челы в текстурах, фразы по 2 раза проговаривают, язык можно менять только через файлы и куча других багов, а разницы в графике не заметил, обычная версия намного лучше",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wasn't a fan of the original Mafia 2 and never beat it so decided to try this \"definitive\" edition now nearly 12 years later.\n\nFirst, the game itself is mediocre. Combat is basic and very annoying, being killed easily in one shot multiple times but also having to shoot enemies five to ten times for them to die. The driving is horrendous. \n\nThe save system is atrocious.\n\nThe open world isn't at all useful for anything but progressing the story which I remember hating when the game came out.\n\nGTA IV and other games like Sleeping Dogs were 10 times better.\n\nThis version is buggy as all hell. Too many to count and many nearly game breaking. \n\nThis is hands down the worst remaster I have ever played.\n\nThe original Mafia is pretty good along with its remake. Mafia III was kind of boring but decent.\n\nThis is easily the worst of the three.\n\nThe only one thing that makes this game acceptable is the story that I haven't finished because I just don't have the patience to waste another minute on this overhyped garbage.\n\nOriginal game is a 4/10\n\nRemaster is a 1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Remember, if just one character shown on the cover isn’t actually in the game — and happens to look a lot like a character who is — that’s a bad sign!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Не понравилось. Ремастер вообще из себя ничего не представляет, никаких особо улучшений. Игра очень старая, и до сих пор так ощущается. Технически всё очень плохо, я столько багов в киберпанке не встречал. Буквально я вынужден перезагружать миссии из-за этого. Также не понятно почему нету сохранений, или хотя бы авто сохранений. Я прошёл 50 процентов миссии, умер, начинай сначала, на, смотри катсцену опять, минус пол часа жизни. Да, тут есть интересные механики, например всё что связано с полицией, а также интеракции в квартире и магазинах, но всё остальное ничего интересного из  себя не представляет. Одни и теже модельки нпс, устаревшие анимации. Я не осилил.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A serious let down in terms of remasters. If you played the original Mafia 2 then you would be advised to stay there and play that version instead. This Definitve Edition, if you can call it that, lacks the shine that the previous Mafia 1 remake has by a long shot. The story finds Vito Scilata in a classic rise to power with his best friend that inevitable leads to a fall before being rescued by elements of the same mafia he ends up pissing off. \n\nGameplay wise this feels like a very serious step back. Sure there are more ways to engage in combat like hand to hand combat but it all feels out of touch. Like it lacks that pinache or something that would have helped make it great. Weapon selection is ok and is a decent improvement over the original but the controls in general just feel almost counter intitaive and less natural at times. \n\nIn terms of remakes. This is by far a BIG let down versus the original. The graphcis themselves look and feel like a massive step back versus the remake of Mafia 1. Almost like a early PS3/late PS2 graphics. Nothing spectucular here. Sure this version does include the original versions DLC that would come out later but when the base game feels like a mess it's hard to really justify it in a way. \n\nSo the questions is should you buy it? For me the answer is a big fat NO. Do not buy. The game just feels like a mess from even just the early goings of it. Odd graphical glitches, a big step back in terms of graphical and gameplay performance. This is simply put. Not worth the money that they are asking for it. BIG thumbs down from me. Not recommeneded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2K Games changed their privacy policy in November 2025. They now have an automatic data miner in their games, selling our information to anyone interested. No games from them. Don't play games you already own; let them go bankrupt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i encounter bugs and crash in this game much more than i did in my entire lifetime playing games since 2004",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game had a good ending. It was overall not that good. Too much walking going from place too place.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every time you die, you lost 10 minutes of your life, why we don't have manuel save. I had to quit for this reasen at chapter 8.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BUGGING AND SHITTING DEFINITIVE EDITION MY ASS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dissing the Irish👎🖕",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n[12:09]\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 120
    },
    {
      "review": "I love Mafia 2, but unfortunately even after 5 years the definitive edition is broken as hell and it's riddled with immense amount of bugs.\n\n\nPlay the original version instead.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "I am stopping playing all 2K games as now 2K games install spyware to collect deep personal user info, device info, IP address, GPS location, internet activity-browser history etc for its use/sale to third parties and potentially pass on to US/UK/EU government. Also i will never buy a game again from 2K games. 2K Games and Rockstar belongs to Take-Two Interactive so i will never play or buy a game again from this company this includes future Games like GTA 6 or Red Dead Redemption 3. Good Job Take-Two Interactive i am 100% sure loyal Customers and fans of games like GTA or RDR (one of the very very few games in the gaming industry which have the quality for gamers to must have and must play, cant wait for them to be released etc.) will absolutley loving such methods and practice and will buy ur products nevermind. But in my case i am done with your company for all time.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "[h1]I have significant issues with this game, particularly with its save system.[/h1]\nThe lack of a proper save mechanism makes it difficult to maintain progress, which can be incredibly frustrating, especially when encountering bugs or disconnections.\n\nAdditionally, the achievement design feels unnecessarily tedious, and some of the DLC missions seem like they’re designed purely to stretch out the gameplay, without adding meaningful content.\n\nAside from the main story — Vito’s storyline, which is somewhat decent — everything else is just flaws. [u](And there’s no cloud save, but since that didn’t actually affect me, I’ll hold off criticizing that for now.)[/u]\n\nAlthough this game has many flaws, I still wanted to give it a positive review at first because of Vito’s story — until I encountered a bug that became the last straw and triggered my outburst.\n\nI’m an [b]Achievement Hunter[/b]. I worked hard to complete all those annoying achievements in the game until there was only one left — the one that requires you to drive 1,000 miles, about 1,610 kilometers, taking over ten hours.\n\nI drove the entire distance manually without using that well-known AFK exploit to farm mileage. So yes, I drove for more than ten hours until I had only about 25 kilometers left.\n\nThat’s right — just 25 kilometers, barely ten more minutes of driving. Like an idiot, I had been manually driving aimlessly on the highway for roughly 1,585 kilometers, wasting over ten hours of my life.\n\nThen I found out I had been disconnected from 2K.\n\nOkay, fine — I quit the game, thinking I’d just finish the remaining 25 kilometers once the connection was back.\n\nBut when I launched the game again, hundreds of kilometers of my progress had vanished. That meant I had to spend several more hours driving all over again.\n\nI was genuinely devastated — and furious.\n\nI rarely give negative reviews. Even when a game has plenty of flaws or isn’t that fun, I usually just skip reviewing it.\n\nBut unless a game really pushes me to my breaking point — yes, this one did exactly that.\n\nThis is the first negative review I’ve ever written since I started leaving reviews on Steam.\n\nI’m not just angry about the bug itself — I’m furious at the utterly inhumane achievement design combined with such a devastating glitch that destroyed an achievement I had almost in my grasp.\n\nAnd then there’s the huge pile of other flaws.\n\nEvery single thing that infuriated me kept piling up, reaching a critical point, until one moment — a trigger, a fuse — set it all off, making me finally explode and break down.\n\nA Steam friend once asked me, [u]“Have you used any save game file from internet?”[/u]\n[u]I said no — I didn't use any save file.[/u]\nBut now… I’ve broken my word.\nYes, I have to use them.\n[h3]This negative review isn’t something I gave — it’s something the game earned all by itself.[/h3]",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "One of the worst remasters I've ever played, buggy and lacking any new content and features! The definitive edition for the first Mafia is still infinitely better than this lazy port!",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Mafia II: Definitive Edition isn’t a remaster — it’s a letdown.\n\nIf, like me, you played Mafia I: DE, loved the story and stunning visuals, and jumped into this expecting the same treatment… I’m sorry to say, this isn’t it. What we actually got is closer to an updated texture pack — the kind you’d normally just download as a free mod. On top of that, the game is sprinkled with bugs and small gameplay hiccups that are more irritating than anything else.\n\nThe story itself? Good. The characters are likable, the voice acting is solid, and there are moments that pull you in. But here’s the problem: the gameplay is boring. Out of my 4.5 hours so far, I’d estimate at least 3 were wasted driving across town, running filler errands (blue cartons, red cartons, white cartons… seriously?), or making endless trips back to my apartment just to sleep and trigger the next chapter. Instead of cutscenes or smart pacing, the game forces you into busywork that kills any momentum the story builds.\n\nI really wanted to love this game — I went in open-minded, ready to enjoy it. But after a while, it’s hard to ignore that it just isn’t that good. I’ll finish it only because I’m playing through the trilogy and I’m already halfway done. But if you’re on the fence? Honestly, save yourself the time. Watch a story recap on YouTube and skip the grind.\n\n10/7/25 Edit: I've finally finished the game and I felt that it is important for me to add this. \nI still think that what I wrote is very relevant and, unfortunately, a huge part of the game. But, I can definitely say there's a HUGE improvement with the pacing of the story and gameplay wise towards the last couple of chapters, which really did get me hooked on the game. \nSadly, I will leave my review as negative but take this edit as a glimmer of light - if you are willing to go through the unimaginably boring mid-game, the end is definitely solid!",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "game,story is so awesome i really fall in love but the optimization is like sh1t and game always drops when u using car even if you re using strong pc like me and AI IS SO F**KING DISGUSTING",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is great, it's hard to decide which is better, the first or the second, but as for the Definitive Edition, it's just awful, the game lags and freezes. I searched the internet and realized that the problem is with the edition, not the computer. The computer is powerful, the drivers too. They just made the edition as unoptimized as possible, while the first Definitive Edition is just great in terms of optimization and graphics. That's why I gave it this rating.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Definitive edition? More like\nbroken edition, the game is good not gonna lie but you can't call this a definitive edition \n\nIt's bugged...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First, the main game is an absolute masterpiece. The classic atmosphere, the incredible soundtrack playing on the radio, and the gripping story that completely pulls you in are phenomenal. The changing seasons, the cars, and the driving all combined to make my 15-hour journey through the story an unforgettable and captivating experience. And let's not forget those special posters you can find in the game... anyone who has played it knows just how amazing and engaging that collectible hunt is. It's pure fan service done right.\n\nHowever, a major warning for my fellow completionists:\n\nThe DLCs are a massive letdown and a chore to get through. Unlike the rich main story, the DLCs have virtually no narrative. They are essentially a repetitive grind: \"Go here, kill this guy, steal this car,\" and repeat the same cycle for 8 to 10 hours. It's incredibly tedious and nerve-wracking. If it weren't for the achievements, I would never have gone anywhere near them. All three DLCs are almost identical, with only one or two stages containing proper cutscenes; the rest are just repetitive filler missions.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A case of a community being blinded by nostalgia and developing a bias for a game that's at best mediocre. \n\nI went into it knowing the things people liked/praised it for (story, minor details, cars/driving mechanics) and what people found lacking and still felt like I was eating flavorless mashed potatoes. The age shows and the game's actual structure (scripts, bugs, mission structure) seem poorly designed/written. For all I know the developers were new to the industry, I didn't research the background of any of the personnel or studio. If they were new and rookies, it shows in the AI, lack of variety in gameplay, focus on minor unimportant details and disregard for larger more crucial details/elements that should've been prioritized. \n\nI believe the development was unstable and 2K wanted the game OUT. Rushed development, unsatisfying product.\n\nStory was lackluster and it felt like the pace was too quick for anything to develop. Character deaths were predictable, ending was VERY underwhelming, (there were meant to be multiple endings and this concept never should've been cut...) the game is short. Characters aren't very charming and there's not enough time given to them for players to feel any sort of attachment. \n\nVito (the main character) has nothing that emphasizes his humanity, for example. Initially it's his family that serves as the human element to him but then this narrative element disintegrates. (I'm getting tired of games failing to write compelling narratives when they get it halfway right then fumble it.)\n\nOverall, an empty experience that lacks the minor details to give it a spirit and charm. Not a bad game but very much a product of the early 2010s and LATE 00s of gaming where I feel like the studio was spread too thin and the experience suffers as a result (many such cases when playing games from this period.)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After playing through this game, I was rather dissapointed. First of all, compared to Mafia I it just seems lay to me that Mafia II is just a remaster. Wonder what they could've done if it was a proper remake. Secondly... I really did not enjo the story. It felt really torn apart and not connected at all what you had to do and why Vito has done what he does. Especially halfway through the game. The gameplay itself was fine really. It did lose some of the charme the first Mafia had and i felt like more enemies were just used for the sake of it. What the game did right again however was the feel and worldbuilding of the town. Like the first mafia everything around you felt like it belonged there and had a purpose in the world. Few games manage to create this feeling with the world around them imo. Alltogether.. for roughly 15hours of gameplay you could absolutely get worse games, tho the fact it's supposed to be some kind of sequel to Mafia really pulls the whole game down a lot. Mainly cause it feels really cheap that it's just a remaster.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a big downgrade compared to the first one (Mafia I DE/Remake). \n\nI'll play it fully when/if a true remake becomes available. \n\nIt will be the definitive version we deserve! This is just a 15-year-old game with a few patches... \n\nNot really worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is broken as hell, it remains the only game I have ever refunded in steam. I don't know if they will ever fix this or not but Mafia II easily remains one of my favourite games of all time, and somehow they managed to make this a letdown. The team should have used significantly more assets and efforts into the remaster. If you ever loved Mafia II, never play the definitive edition as you will be frustrated and be let down like me, buy the game and play the classic one from the past.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I normally don't post reviews and if I do you have to make feel a special type of way and this did. It made me extremely upset and disappointed if it wasn't for the fact I got this in a bundle I would've demanded my money back I wish I could've gotten my time back that I wasted on this from the amount of bugs in the game it definitely wasn't worth my time plus getting soft locked on chapter 13 I'm done I uninstalled this trash and won't be picking it up ever again I hope to one day forget I even played this so called \"definitive edition\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a 100% completion gamer for most steam games I play, this has probably been the most miserable experience I've had. While the main game was fun from what I remember (last played back in September 2022), the Jimmy Vendetta and Joe's Adventures DLCs have been nothing short of abysmal. \r\n\r\nFirstly, in what world is 1000 miles driven in strictly one of the DLCs, not including the main game, anywhere near reasonable? By the time I finished the entire DLC, I had only driven 100 miles. Second, the Massacre achievement for killing 1000 enemies isn't *that* bad, but, after beating the DLC while failing missions repeatedly because the enemy AI just straight up has aimbot and having to replay missions, I only ended the DLC with 400 kills. Not to mention, some of the missions are just straight up dumb with one of them being to drive a car and not have it go under 35 miles per hour for more than 3 seconds otherwise you just straight explode. Also, my game crashed constantly when starting missions. \r\n\r\nI can recommend the main game to anyone, but I would avoid the DLCs altogether, especially if you don't go for achievements in particular.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Compare to mafia 1. it’s just a disappointment.\r\nMillions of bugs in this game. Story is lacking.\r\nI’m not sure if the bugs made me hate this game or if the game is simply bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good story, bald optimization. Could be good as first one. Lazy dickheads. Many bugs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "compared to Mafia 1 def edition it looks rubbish. very dated looking. i only lasted just over an hour and gave up with it. i was excited to play after Mafia 1 as i thought it would look similar or better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game with problems where u need to do something to play it correctly ...Detele please this mess frm store",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't even know where to start.. I started playing this game right after I finished Mafia Definitive Edition and it was nothing but a huge disappointment.. This game is buggy as hell there are tons of visual bugs alongside game crashing bugs. Throughout my whole playthrough I had about 3 to 5 crashes if not more. Also save system takes you way further back than it should.\n\nVito is an empty canvas with little to no personality or purpose just like most of the other characters in the game and not just the characters, story itself too. I can’t even bring myself to call this a mafia game. In the first half of the game we are not even in the mafia. After that everything goes too fast, too soon I couldn’t even get used to the idea that we are officially in the mafia until it was too late. Vito’s relationship with his family is… existent, I guess, just to make him a bit more tragic. The story… yeah, it has its moments but they are SO FORCED and SO FAKE that I just accepted it as nonexistent.\n\nThe only good thing about this game is Joe..  he’s the only character that actually has some life in him. Also the music is great I enjoyed the radio more than I enjoyed the game itself.\n\nI’m not sure if the bugs made me hate this game or if the game is simply bad, but overall, for me it’s just a disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}