{
  "positive": [
    {
      "review": "I don't believe I can put into words how much I love this game. It got added to my Steam family library months and months ago and I played it immediately because it just looked cool, I ended up purchasing it for myself just to support the devs because, my god. Before the recent major updates that has given me more content to work on, I'd literally play through the entire game over and over again.\n\nFirst, the actual gameplay is spectacular. It's just fun, satisfying, hands-down the best cleaning simulator I've played. The before/after of the scenes is pretty remarkable, and everything can be done relatively quickly. A lot of neat mechanics, like detergents, breaking glass/other objects, evidence collection that reveals the story of the scene, UV lights, parkour is even a thing?\n\nThe music of this game is fantastic as well. Another mechanic is collecting music tapes/disks which you can then play from your tablet while you clean from then on out. Each of the songs is a genuine song published somewhere IRL--I'm not exactly certain how they were chosen/if the more recent songs were made for a collab/exactly how all that happened, exactly, but the music and sound is well-thought-out.\n\nAnd then the story. The story is fully cohesive, it's not just random levels to choose from. You play as a janitor named Kovalsky (cleaning crime scenes to cover for murder as opposed to cleaning places post-investigation), and I'm not going to get into it too much for the sake of spoilers, but the guy has a valid reason for what he does and it's easy enough to simultaneously sympathize with him and understand that, y'know, covering up murders is ethically screwed up. Kovalsky's character is sort of a joy to play as, actively commenting on the scene that you're cleaning or the evidence you find. He's sarcastic and sardonic, you can tell he kinda hates what he has to do and covers it with humor. Each of the maps is super varied, and there's a lot of story behind what happened, why the people involved are dead, either tying into the overarching storyline or a separate, fully cohesive story branch. This could easily be a novel, which is saying a LOT for a game that's primarily just the satisfaction of mopping up blood, and why my praises are so high. Some things in this game are absolutely heart-wrenching, do be warned.\n\nNightmare Mode is a newer addition that basically doubled the content. Every chapter being completely reworked and ANOTHER storyline embedded into an already fantastic story. Also some fairly severe horror elements, but very few jumpscares. More like it makes you FEEL like you're going to get jumpscared. It ALSO introduces a music disk system that's an extension of the music tape system I mentioned before. A whole lot of fun.\n\nAnd then the updates. The devs are actively working SO hard on this game. I played and then bought this game around a year ago when it was nothing but one chapter flat-out, and since then, we've gotten Nightmare Mode, two new Community levels, True Cleaner mode on all levels, and a collection of different skins for most of the main items you use for cleaning. I do believe Chapter 2 is on the way as well. In other words, it's well worth the money spent, in my opinion.\n\nAlso, most importantly, you can pet the damn dog and get an achievement for doing it enough times. 10/10 game just for that.",
      "voted_up": true,
      "votes_helpful": 55
    },
    {
      "review": "Recommending this game 100%. The combination of cleaning and terror of the story, and experience is indescribable. Absolute cinema.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "***my review now has an edit***\n\nI have a mixed opinion about this game. \n\nI love the over the top narrative and it definitely is a fun cleaning sim (probably one of the best I've played tbh!), but the use of ai is icking me out to the extremes, and definitely skewing my experience of the game. \n\nI understand it saves a lot on time for the voices and images, but now that the game has over a million sales, the least they could do was hire some actual voice actors, you know? \n\ntldr: fun game, really wish there wasn't ai in it.\n\nEDIT: I have no idea how i missed it? Sorry, I shouldn't have assumed that the voices were ai judging by how they sounded. Now that I know that, it does put my mind a bit at ease. \n\nAnyways- The above is still true! A fun game that has definitely made me laugh while scrubbing away stains.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "Absolutely amazing game — one of the few titles I’ve managed to play almost all the way through. The concept is unique and surprisingly addictive: cleaning up gruesome crime scenes shouldn’t be this fun, but here it just works.\n\nThe first few levels hooked me immediately — I finished them all right after buying the game. Each new location adds small twists that keep the gameplay fresh, whether it’s dealing with trickier stains, hidden clues, or navigating tighter spaces.\n\nPerformance-wise, the game runs smoothly, and the controls are intuitive. Overall, Crime Scene Cleaner is one of those rare games that you just keep playing “for one more level” — and suddenly it’s 2 a.m. and you’re still scrubbing away.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Perfect blend between Viscera Cleanup games and Powerwash Simulator games. Also, they keep pushing out new content BUT I CRAVE MORE 😭",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great game addictive as hell and as of tonight great game to play whilst drunk!\n\nFuture me here, finally finished the game and its got me wanting more so drunk me was right its a great game and so dang fun!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "one of the best games i played in a while, the story is amazing and i had a great time!\nhad a lot of fun getting the badges also\ni recommend it 100% :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "免费增加的噩梦模式基本算免费送了个DLC非常良心，尤其是短路那关设计的很惊艳，值得一个爱的付出奖",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best game in its genre. It is what it is, \r\nbut with a good story and nice secrets to find.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] Let me tell you, I did *not* expect to absolutely LOVE this game so much! [/h1]\nOne of the very few cleaning simulators that is done very very well! It is dynamic, relaxing, fun and at times sad. I seriously appreciate that this game wasn't left in the dust like many simulators and gets updates and new maps, skins were definitely a nice touch.\nLevels are pretty interesting and complex, the puzzle difficulty is adaquate: not overly hard, not overly easy, they do not get boring. Cleaning is a nice comforting routine (although in a gruesome enviroment), there is a variety of tools and a variety of how and when to use these tools, skill tree is simple and doesn't have \"useless\" skills. Game is full of references and jokes, but it also has a serious side.\nTo add in the end, absolutely love the main character, his story is simple, but tragic, which makes me really sympathise with the man, to be honest. Also the dad jokes, oh, the dad jokes, I missed them so much. Voice actor is *great*.\nNot to ramble any further and not to sound like a madman, I'll just tell you: I am a huge fan!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Had a lot of fun playing, started it cause I watched Gab Smolders on YouTube play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It good. Wipe blood. Pickup trash. Toss the deceased. Get jump scared by mannequins. Much recommend !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Why get depressed for not having cleaned my room in a while when I can feel good about having cleaned something at all by playing this game?\n\nAnyway it's fun, the devs have quite the sense of humor. Truth is we're all in a simulation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great relaxing game, sucks when you finish all the maps..just gotta replay again but slower. Needs more maps now tho soon please",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good meditative game. Allows you to relax after a hard day",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10. I love PowerWash Simulator, and Crime Scene Cleaner scratches the same itch and so much more. I hope the team behind it does well enough to make DLCs as I'd love to continue supporting them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, calming. Has a few good 'gotcha' moments in the Nightmare versions, nothing flys at you though. Very good on the 'horror', doesn't make it unplayable. 9/10 game. Worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well worth your money. It's a bit like Powerwash Sim and Viscera Cleanup Sim had a baby - but without any VCD tediousness but with a ton of blood and a nice, cheesy storyline.\r\n\r\nMaps are well-designed, interesting to explore. There's a progression system and tons of hidden secrets and easter eggs to discover.\r\n\r\nThe devs should also be commended because they're the shining example of how things should be done - they added whole game's worth of content in FREE updates (nightmare mode for EVERY level and later on \"communiti patch\" with two new levels).\r\n\r\nYou can also pet the dog, and he's a good boy :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The humor is dark, and the gameplay is good. An excellent chore simulator.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am glad this one doesn't have the Simulator added to its name. Its much more involved and requires a lot more focus then most of them. For example I can play PowerWash Simulator and pay attention to a podcast or lecture quite well. When I play this I am more focused and find I miss most of it. Thats not a bad thing, it means the game engages you more than most games of the same genre, Highly recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Relaxing game to unwind to.  Very similar to Viscera Cleanup Detail, but a bit more polished, and much more forgiving.\r\n\r\nThe new modes add some extra challenges once you've finished the regular maps which is nice.\r\n\r\nFuther, there is an insane number of toy ducks in this game, adding to the quirkyness of it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best cleaning-duty games I've played! \r\n\r\nThe physics aren't as annoying as some others (VCD, I mean you) and hold up the entire game. \r\n\r\nLevels are diverse and engaging, offering plenty of nooks, crannies and secrets. There's reason to play each elvel 3 times; a nightmare mode that transforms the levels in a nightmarish version of the original, which I found entertaining! The True Cleaner mode is basically a hard mode of the original where you can't use every upgrade and can't use your cleaner-sense to see if you missed spots. Both extra modes unlock skins, some of which are really nicely done (laser cleaner and black hole for example).\r\n\r\nThere's an overarching storyline which is well done and adds to the experience. Skill tree to increase effectiveness of your tools and unlock new (better) ones as well.\r\n\r\nAll in all quite a good game. About 40 hours to to all regular levels and nightmare ones (and find all secrets). It'll add another 10-15 (20?) hours to do all maps in True Cleaner as well for the last skins I miss.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been looking for a similar game too Power Wash Simulator and this scratched the itch. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Anyone who likes crime stories and puzzles will enjoy the mix of the two in this cleaning sim. With over the top crime scenes and continuing developments to add to the game this is a game you will want to spend hours playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely good and satisfying cleaning game w tons of levels, level variations, upgrades, and challenges to accomplish. Really love this one, and i still haven't even completed everything yet. Each level feels very unique and fun to explore, and the upgrades also really helped make progression satisfying. Worth the price even if not on sale, highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who got bored of the barely-there story and tool progression in Powerwash Sim and similar games, I was very pleasantly surprised by the depth of this one.  It even has \"new game plus\" type content after finishing the story (which is interesting and entirely voice acted) and bonus levels that add depth (and weirdness) to the world.  Each level is unique with small puzzles and challenges (just enough to make it interesting but not frustrating).  Artwork and design are AAA quality.  Well worth the money, even if not on sale!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I was impressed by how consistent the game was and how creatively PlayWay’s assets were used. Really glad I’ve been following it from the start. \n\nThe story’s cool, it’s got this film noir vibe going on. There's a bunch of music to collect that fits the atmosphere perfectly. The gameplay is both engaging and enjoyable.\nI’m a big fan of Davey Witte’s voice; it spices up Kovalsky’s dry humor nicely. \n\nAlso, the \"Nightmare\" is super creative. I loved the \"escape game\" level, for example. And the new content they've added is pretty solid too. I never had to look up a walkthrough for the secrets, so to me, the game design totally nailed it. \n\nGreat work, guys! Wishing you all the best going forward! <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun to play and I enjoyed the story a lot. I definitely recommend and am very excited to play more maps if they release more. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's something very relaxing about cleaning pools of blood, hauling dead bodies and chopping broken furniture pieces.\n\nThe game is fun, filled with pop-culture references and dad jokes. Moreover, it still gets amazing new updates and maps constantly creating replayability value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an absolute blast. I'm on my way to 100%ing it and they are still making new content. It's different from most simulator games in that the main character has real personality and motivation. I don't think I would have enjoyed this as much without Kovalsky. Also you can pet the dog.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my absolute favourite cleaning games, would absolutely recommend. The additional nightmare mode added so much extra content and challenge, making it even better value for money!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a perfectionist, this was a relaxing and satisfying game. The story and humor though made it even more captivating to play and is personally just a really fun and relaxing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who put over 170 hours into Viscera Cleanup Detail, this game was an absolute no-brainer.\n\nSome nifty cleaning mechanics, good progress indicators (which you can turn off with True Cleaner Mode if desired), nice humor with with some keen pop culture references, some soundtrack bangers, and it's not nearly as jank as VCD. The new Nightmare versions of the maps are a howl (AAAAAH MANNEQUINS) and it has something resembling a story. \n\nWorkshop support would be nice for longevity but you can still get some decent mileage out the stock maps.\n\nIf you clean, get it. Period.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Prepare to sink hours into this game, The sun the set and rise many times before your OCD cleaning habits will be sated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Powerwash Simulator but full of blood and mafia murder. Honestly what more can you ask for? Well, probably a lot, but I personally really enjoyed this game. The levels increase in difficulty in a way that is challenging and take more time to finish, but doesn't make it impossible to get through. The storyline is also well done, and is a lot of fun to follow along as you clean up bodies, blood, and evidence. This game is definitely for patient people, and I will say it can make you motion sick after a while if you're prone to it, but it's definitely worth adding to the library of sit back and chill games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an amazing game. No jump scares, but still eerie enough to creep you out if you get too into it. The new modes with the update are also enjoyable. Love the skins you can get with completion as well! Nothing like cleaning blood with a pile of money hahaha! If you want something spooky, but you clean, this game is for you! 10/10 would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For someone who is an actual crime scene investigator this game is just so much fun for me. I love everything from the mopping, cleaning up trash, and picking up bodies. The best  game I have ever played. I hope the keep up with the updates with different scenarios like body parts or features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game about cleaning and also great story!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game. It feels like it gives me everything that I felt like I was missing from PowerWash Simulator:\r\n- sensible narrative\r\n- reason to use multiple, different tools\r\n- depth to the character that we're playing as\r\n- a character that is actually reacting to the world instead of through characters close to them\r\n- sweet skins and unlockables throughout the course of the game\r\n\r\n10/10 highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I downloaded Crime Scene Cleaner thinking it’d be a cute little cleanup game. Nope. I’m in here scrubbing walls like I’m paying off a felony I didn’t commit. I’ve never had a mop judge me so hard. Every time I miss a spot, it’s like the game whispers, “So… you just don’t care about your life, huh?”\n\nThe blood smears slide around like they’re late for work, the evidence hides better than my ex when rent was due, and I’m out here picking up limbs like it’s just another Tuesday.\n\nBut the worst part? It’s actually so satisfying. I clean one room and suddenly I’m thinking, “Maybe I am a responsible adult.” (Narrator: they were not.)\n\nIf you like chaos, cleaning, and pretending you’re the world’s chillest crime janitor, this is your game.\n10/10 would bleach things I don’t understand again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The perfect game to compliment a podcast or audiobook while still being VERY enjoyable without one. \n\nI originally wanted this game to serve as my time-killer. I needed a game for times that I didn't feel like committing to any particular game (we all know the feeling), and I ended up actually WANTING an excuse to play this game. \n \nCleaning is satisfying, and its the only time you will ever see a room littered with trash and think... [i]Hell yes.[/i] After 100%ing this game, I can say I was only ever overwhelmed twice—both in the same level. The museum... Both times I played this level, on normal and on nightmare, I got off before finishing. Unlock the cleaner sense ability that lets you see missing furniture so you don't lose your mind. \n\nYou will develop your own routine to cleaning, and it is incredibly satisfying to get into that cleaning flow-state. You will fly through levels throwing furniture into adjacent rooms, smashing boxes, throwing bodies down stairs/ledges, and mopping up comical amounts of blood in super quick times. Every level you complete you get a sizeable amount of skill points if you had put in the time to perfect and search everything. Each upgrade feels meaningful and powerful.\n\nThe Nightmare mode shakes things up and gives you basically entirely new levels for you to put your fully upgraded Kowalski to work. Nightmare mode adds double the blood, trash, and bodies, and even gives you puzzles to solve, all whilst being fun and spooky. This mode offers a very satisfying endgame, and you unlock really cool skins for your tools for each nightmare level you beat. \n\nThe game also does not overstay its welcome. I would love more levels, but I feel like it is the perfect length. \nBuy the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly my favourite game. skill tree/perks, good music, story and its funny. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with some horror aspects, but it's not too scary. Recommend to those who like comfy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect game, honestly. Scratches that itch in the brain just right.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a big fan of Viscera Cleanup Detail, I often found it was hard to scratch the same itch with any other cleaning game.\n\nHowever, Crime Scene Cleaner was a pleasant surprise that help to scratch that same itch. It approaches the grimy, messy cleanup job in a more casual way. Cleanup is broken down into larger tasks rather than tedious small fixes like in games like Viscera Cleanup Detail. This isn't a bad thing by any means, as it allows for a more chill and relaxed experience. The ambience and the entertaining story make for a really high-quality, easygoing time just cleaning up your average crime scene.\n\nThe game provides a small skill tree for each of your cleaning aspects, which will ultimately be maxed out as you continue to play the game. There's fun secrets and collectibles to find for the \"explorers\" as well.\n\nAs if the base game wasn't fun enough, the devs have continued to add more things to clean and do. As of this review, they have added Nightmare versions of the base maps of the game, and have even added a brand new community-made map into the game.\n\nThese Nightmare maps are not just a reskin of the base maps, they are re-envisioned and re-adjusted with new things to do, clean, and experience.\n\nCrime Scene Cleaner is a casual and well-polished game in the \"cleaning\" side of gaming. It's hard NOT to recommend this game in it's current state. It's well worth the price, but also goes on sale a fair amount of the time. \n\nHighly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played through the game multiple times before it updated and added the nightmare/ true cleaner modes. I truly loved playing both before and after the update. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an interesting and addictive game. It is a game that should be played by those who have patience and especially by those who like to clean excessively :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good. Satisfying cleaning, no stress choices like cleaning fluids and tools to use, nice stories in some levels, amazing level design. My only critique is some of the puzzle are dumb and make you work for a 'code' that doesnt exist and is e.g. 1111 - but that isnt common.\nI only noticed the Nightmare mode when the 2 new levels came out, but I wish I'd seen them beforehand. This isnt just the same levels for 90% of them, they are often entirely new levels, with more story and some extra, fun mechanics. I love it, and I hope they keep adding them for new levels.\nPS at no point in this game are you under threat, and I have only been jump-scared twice... the band stage and mannequins.\n\nPlease keep supporting this game devs, and we will keep playing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game makes you question every life choice that led you to scrubbing virtual blood at 2 AM.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has got to be my favorite game on steam.  I love everything about it.  There's just something so satisfying about cleaning up blood, trash, and bodies from crime scenes.  Sometimes there are glitches, but I can overlook those because the gameplay is just so well done and addictive.  I enjoy the story too and all the little secrets you can discover.  Great game and I hope to see more levels in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the songs and how calming this game  feels. I defiantly would recommend this game to others. The hacker one was creepy but it was really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crime Scene Cleaner is WELL worth the money. You get hours of gameplay, interesting storylines, and it's very immersive. At first it was just a game for me to wind down and mindlessly play, then slowly I developed a desire to 100% the game. I will hopefully follow through with that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing, I love the different modes for maps that they have added.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly entertaining game, good story to it, I really enjoyed playing it and would recommend it to anyone who is interested in games like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely awesome. Stellar game. 10/10\nLike powerwash simulator, but better and funnier",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My gameplay was literally: I start the map, clean everything, explore a bit, carry the bodies to the van, finish the level, and boooom, an hour has passed without me even noticing. This game is amazing, 10/10. And with the “recent” updates, everything has become even better, including the Nightmare mode, which is awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and relaxing game, recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good games with unexpected secrets. Unock ful skil trees for better gameplay. Definitely satisfying and great storyline. Chill games and slightly spooky.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my new favourite game to help switch off and relax with. Great podcast game. Good fun cleaning up all of the scenes and the story is better than I expected from this type of game. Developer seems cool and are always adding new things too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing story line  great game in general definetly get it along with nightmare and true cleaner modes its a perfect game for the awards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "literaly one of the best games ive ever played, interesting levels, the overall plot is amazing and gripping, difficult and rewarding and there is so much content to go through. I need to see the main character happy for once. also very funny i love those stupid little ducks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my all-time favourite games, and certainly one I go back every month or so to play the story mode again. There's a lot in this game for the price you pay, and I'd urge anyone that even has the thought of buying this game to bite the bullet and get it. There's some levels that are going to infuriate you while you're trying to find the last piece of trash hidden under something, and some levels where you're going to need to step back and mentally prepare yourself for the visuals and... yeah the crime scene I guess.. This isn't just a game about cleaning up gory scenes, you sympathise will a lot of the characters and there's also a dog you can pet so need I say more?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game to rival a certain other bloody cleaning simulation. Very much enjoyed and am still enjoying playing it after a considerable amount of time. Would definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has a lot of levels and gamemodes to enjoy, definitely one of my favorite games if you like cleaning games and chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game with great mechanics, story and a funny mc :) i truly enjoy playing the game and I wish I could just play it foreverrr it's so relaxing and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty fun and addictive. Definitely spent more time on this game than I had expected. It's perfect for some chill and overall fun gameplay. I love the storyline and the dialogue. I’d absolutely recommend it, especially to anyone who enjoys sim games with cleaning/strategy elements, or crime-focused themes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game that's weirdly meditative and thorough.\n\nWish I liked cleaning my actual shit this much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion, Crime Scene Cleaner was *already* the best entry in the surprisingly small \"cleaning simulator\" genre - and that was *before* I came back this year to discover Nightmare mode, essentially an entire additional game with an astounding amount of passion put into it.\r\n\r\nIn terms of the basic game, not only does this scratch the aesthetically pleasing itch that all cleaning games do, but it has a considerable surface area of cleaning options - I find myself trying to be more effective in my cleaning in interesting ways.  Some subtle gameplay to keep you engaged, but never enough to take away from the simple joy of cleaning a messy area.\r\n\r\nThe plot, while simple, is such an excellent addition.  Some very fun narratives to follow, both within each level and across the overall game, and really great voice acting.  Great hidden references and funny moments, but also some disarmingly poignant experiences as well.\r\n\r\nEasy recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i was literally obsessed with the Obsessive Compulsive Cleaners, and now i'm addicted to this game lol\ndevs, u guys killed it~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun, satisfying gameplay with a genuinely intriguing storyline and characters too! One of my favourite games of all time :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you ever wanted to clean up crime scenes and work for a mafia but also end up in a cult this game is perfect for you. 100% would play again if they ever add more to the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the only game i went through the arduous process of steam linking to my ipad, and plugging my ps5 controller into the ipad, so i can play in bed. 10/10, keep up the good work and thank you for always adding updates and new levels!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10 game, it's almost perfect in every way, from cleaning blood, picking up items that help tell a story, the music selection and collectibles, the only thing that isn't perfect is the story itself, it's not the greatest but it's still good. And we also have Dexter the dog, I love the references in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much. It gets dark but I enjoy it so much. Glad they are still working on updates and new content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loveee this game. so satisfying, and also the music is so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great and relaxing game. It's good that the devs are still updating it with new maps and fixes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game.  This game is so relaxing.  I always choose classical music to clean to. I can not get enough of this game.  I recommend this game to anyone who likes cleaning games.  This is the first cleaning game I have tried, and I fell in love with it instantly. No other cleaning game compares to this one, IMO.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is something about this game that is so relaxing and always find myself coming back to it even after a time away. I couldn't recommend this game enough to the horror/cozy game lovers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice, chill, cleaning game with a story and ducks.\n\nWARNING!!! \nI think the devs are plotting something, why else would they give us new content for free? I mean, who does that?!\n\nI also don't trust the ducks...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really enjoyable, I love the combination of relaxing cleaning tasks with gruesome crime scenes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought a cleaning game.\nI became a cleaner.\nNot sure if I’m playing the game, or the game is playing me.\nSend help.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well crafted and design game, the story makes you get hook their is lots of different options and many hidden easter eggs. Overall a satisfying cleaning simulation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A surprisingly fun cleaning sim! I went into it expecting just another Viscera Cleanup Detail, and left with something I enjoyed more and will certainly be more memorable. There were a few things about it I didn't care for a whole lot, the story is meh, the voice acting is not the best, and the script for the characters made me roll my eyes constantly (seriously, the guy quips constantly like he's in a marvel movie) but what made me stay and play was the charm that was in the game. Honestly I feel like this should have been more of a puzzle game than anything, because those were my favorite parts. However, when the game tries to be serious and foreboding, it really does just quickly yank you out of it when a meme pops up out of nowhere (like the idiot sandwich one...)\r\n\r\nI didn't end up finishing all maps on true cleaner, but I got all of the achievements and it took me 22 hours total, with 10 hours being how long it took me to beat the main story and the rest doing mostly Nightmare mode. Would I play this game again? Honestly, probably not. But was it still a memorable and enjoyable time? Absolutely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly my favorite sim game to date. It's not what I expected at first but I'm not disappointed in the slightest. I got the game on release and it just wasn't enough when I finished all the levels. I needed MORE.\nBut since then, the devs have been working so hard to give us more content from harder modes with skins to unlock for your cleaning tools to community levels. I cannot recommend this game enough and highly suggest giving it a go yourself. It's so worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very good game if you need something to pass the time. Also a very good game to plat if you struggle with ADD of ADHD!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and have not even felt the time while cleaning in the game. It is very innovative and what i mostly love about this game other than being indie, is that the creator is very friendly and updated the game constantly! But if you are here to see a review about the game i would just say it is the perfect ''crime scene'' cleaning simulator out there, not boring at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun to play, I love the story so much I really hope there will be more of it :D I love the community levels I hope there will be more of them :D I really recommend this to anyone who likes a story mode with cleaning gameplay :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may say a lot about me that this is my all time favorite sim game. I just like to find the secrets, I swear!\n\nHighly recommend for the cozy gamers who don't mind a mess to clean up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game that has very interesting inter connectivity and world building compared to other games. Base game is fun, voice work is great, and I would highly recommend if people are looking for a good cleaner game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable and relaxing game. More interesting and versatile as one would think going in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very relaxing yet dark which makes sense obviously, I personally dark games especially ones that you don’t have to survive to play it’s just the creepy atmosphere of the the game that makes it very enjoyable. You’ll love this game if you don’t really enjoy survival horror and just atmospheric horror, I do wish when you place your bucket down though that it would stay in place until you move it yourself other than that tho it’s fun. Especially when you complete it and do nightmare mode, I do feel like the art museum in nightmare mode was a little confusing, there wasn’t really much direction of which portal to go into I mean there was but it would also be easier to put signs next to or above the portals so we know where to go, also I think the amount of paintings and artifacts we have to put back into each individual place was a lot also it was slightly annoying trying to find which portal each artifact went into, it would’ve been nice for the artifacts to stay in their designated area. Another thing is that in the level where you have to clean up the old lady’s apartment, there’s not a water thing to get your water from and with the amount of times your bucket will possibly spill while trying to get back into the apartment is kinda annoying but like I said, it’s a really fun and interesting game and way to relax, definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of, if not the best cleaning simulator out there. From the story to the humour and references there is something here for anyone to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. The voice acting is amazing. I love the sound design. I love the fact that the creator didn’t make it’s so we had to pay for the skins and that we actually had to do challenges to get them. Not like I would mind giving this amazing team money. I’ve spent over 44 hours playing this game and will spend more playing it. It’s super repetitive and very nice to chill out too. I played it while taking my driving permit exam. I’m almost done getting all the badges, and I can’t wait to see what is in the future for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Would highly recommend this game as it is very fun, they keep on updating it and adding new stuff as we speak, the price is a bit high but I would say it is worth and you would definitely get your money's worth out of it with how much content is in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly relaxing and addictive, Crime Scene Cleaner is an excellent way to kill some free time. Here's hoping the devs keep the content rolling in. Dexter is the goodest boy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very chill and atmospheric. Great storytelling and I honestly alt-tabbed the game to review it due to the Ozonator Female Voicelines. 10/10 would notice again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i played. addicting and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good lore, good gameplay, good graphics. I love the little secrets inside each level!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Detailed, satisfying, sometimes funny with puzzles and parkour. Buy it !!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just finished all of the missions on story and nightmare modes and i can proudly say that this is genuinely going into my favorite game collection . very fun and the story is really enjoyable too even though it's not the focus of the game . kovalsky's dad humor makes me wanna dunk him in milk and throw him onto the wall 10/10\n\nupdate: i just finished the communti update as well and i don't know how it's possible but it made me love the game even more <3 very cool stuff!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I LOVED this game until the recent levels and use of AI. There was no reason for it, since nothing else had been AI. And now I feel I bought this under false pretenses of believing it was, and always would never have AI art in it. At this point, I think a refund is in order. You can't just bamboozle your customer base with AI art updates.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "while this game was one of my favorites and super fun they recently moved to adding ai generated images in new maps. immediate uninstall. do better, devs.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "the game is fantastic but but unfortunately has ai images so until they remove it i cant recommend",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "i dont know why but the game crashes every time i launch it, ive been trying to play all day and it hasnt worked",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is scuff af i have played 9.5 hours of  this and what a waste of my time at first i loved it made it to chapter 8 and the game basically said fu and reset all my progress and i would have to start over also the damn chairs and shit randomly isnt there for no reason then you cant get 100%.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun in theory frustrating in practice honestly I just spend an hour trying to find a chair and i just couldn't I'm OCD I've gotten a perfect score on everything but that chair broke me fuck this motherfucking game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I picked up this game on a whim during the Halloween sale. It sounded like something that was in my wheelhouse, and I saw reviews commenting that it was similar to Viscera Cleanup Detail, but with voice acting and a bit more of a continuous story.\r\n\r\nI ended up being very disappointed with my purchase, and I wish I'd delved a little deeper before getting stuck in.\r\n\r\nWhile the core gameplay loop is just about what it says on the tin, I found a lot of the \"Bells and Whistles\" that sold me on the game were lacking and downright off-putting. \r\n\r\nI noticed that there were quite a few instances of awkward phrasing or inflection from the voice acting, especially from the main character. After hearing a bit of it, a friend asked if it was AI; I researched into that after they asked, and found that there is a voice actor listed, and the devs have apparently commented on this question before, saying that the voices are not AI-generated. Still, I wonder if they used generative AI to tweak some phrasings or generate further lines from the original voice actor. Either way, though, I found the voice acting to be a real disappointment. \r\n\r\nI also found the story itself to be disjointed and not especially well knit together. It felt like a lot of hints would get sprinkled in to connect a through-thread, but then abandoned, or else not quite bridged.\r\n\r\nFor example, [spoiler] I thought that the game was trying to lay bread crumbs for Big Jim being overly paranoid, and have some sort of payoff for that as the jobs continued, as it became more clear through context clues that he had killed people that weren't out to get him at all. But instead, the payoff was that someone had been out to get him in one of the levels? And there also wasn't really a satisfying resolution to all of that. There didn't even super feel like a payoff for the main character getting the money he needed, it just sort of...ended. [/spoiler]\r\n\r\nAnd to be clear, I would have been perfectly happy to play a lot of disconnected episodes of this type of game; idle, perfectionist cleaning of different locations is an idle sort of game for me, akin to Powerwash Simulator or the aforementioned Viscera Cleanup Detail. However, having a connected story through the levels was a feature that was supposed to set the game apart, and it instead felt like a poorly constructed facade over the bones of the game.\r\n\r\nIt was a lot of these touches that just made me not vibe with the game. In addition, I found out after trying to research about the possibility of the voices being AI that there was some discussion among other players that many of the paintings, photos, and other assets used in the game may have been AI-generated, which distressed me greatly. I've taken great pains to stay away from any games that use generative AI content, and Steam has been pretty good about this, as I understood that any games are required to contain a disclaimer about their use, and this game had no such disclaimer. \r\n\r\nI couldn't find any statement from the devs regarding the use of generative AI one way or the other, but if I'd known that there was wide speculation I probably wouldn't have purchased the game unless I got a definitive answer.\r\n\r\nEven if there weren't generative AI used, though, I honestly thought there were a lot of disappointing things about this game, and I wish I'd spent the time checking out some other games instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BE WARNED, FOR THOSE WITH INTEL GRAPHICS OR INTEGRATED GRAPHICS CARDS, THIS GAME WILL NOT WORK FOR YOU. \n\nI would really love to see why this game is so hyped up, but unfortunately it appears that integrated graphics are not supported. The game crashes if you attempt to play almost instantly, and it remains unplayable. I have never seen a game that fails to support Intel graphics that is so popular. And the fact that it isn't shown or warned anywhere but the little tiny requirements section under all the other information makes it hard to find out why the game didn't work in the first place. If the game becomes playable for users with these hardware limitations I will happily update my review but until then, I cannot reccomend this game for anyone with Intel graphics or integrated graphics cards.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The first few stages are fun, and it is very satisfying to clean up blood and bodies and put furniture back in place. I enjoyed the small stories you explore at each scene, especially the possessed roomba doing a satanic ritual. Top notch entertainment there. \n\nBut everything else is pretty bad. Some of the cleaning tools are buggy, especially in Nightmare mode, and the writing clearly isn't proofread, containing lots of nice immersion-breaking dialectical inconsistencies. \n\nThe main plotline goes literally nowhere - the guy is working for a mob boss to save his daughter and the mob boss becomes increasingly suspicious of people closer to him, calling hits on them and saying that cleaner man is the only one he can trust... foreshadowing, right? Nah. The intrigue is for nothing. I won't say what happens at the end, but imagine the most boring way this story could resolve, and it's that.\n\nThe voice acting is really... weird? It's bad in a very strange way. The accents are all over the place and some of the words are garbled in ways I've never heard. I'm almost tempted to say the voices are AI, but I have no proof of that. Considering the AI used in some of the prop art though, I wouldn't be surprised, and that makes me sad.\n\nOverall, save your money for a different game that does the same premise better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Damn I could have bought 2-3 more interesting games, not this one.\nI regret that I bought it and spent my time and money.\n\nThe game is not what you think it is.\nWish I could refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a hot fix update deleted my save flies!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LOVED this game until the recent levels and use of AI. There was no reason for it, since nothing else had been AI. And now I feel I bought this under false pretenses of believing it was, and always would never have AI art in it. At this point, I think a refund is in order. You can't just bamboozle your customer base with AI art updates.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "while this game was one of my favorites and super fun they recently moved to adding ai generated images in new maps. immediate uninstall. do better, devs.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "the game is fantastic but but unfortunately has ai images so until they remove it i cant recommend",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Pros: Gameplay is fun and the osts are great. Most are torn on tone shifting but I find the edginess hilarious, paired with a dad's voice actor that reminds me a little of postal dude in the manner of speech.\n\nCons: AI slop artworks everywhere. Soured my impression on the game significantly. I don't think the use of AI is disclosed anywhere on the store page, which I think violates ToS, and I wouldn't have bought it if I saw it. Can't recommend it to anyone because of that and I wish I could still refund it in turn of supporting a more transparent indie dev.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "there is AI generated images used for paintings, pictures and posters and it is undisclosed on the store page. honestly, i'm really baffled as to why stock images weren't used; none of the images needed to be custom.\r\ni get that this is the world we live in now but i try to stay as far from generative AI as i can. i decided to just give this game a chance even after i noticed the assets but i continued to feel guilty (especially in an art gallery level which felt particularly ironic) and after finishing the game and digesting my experience i can say i do regret compromising on my morals.\r\ni also have a personal method for gauging how \"worth it\" a game purchase is, that being: if i enjoyed one hour for every dollar spent then it was worth it. while i recognize i could get more time out of this game (if i wanted to) since there is more content like different modes, i dont think it meets my requirements for a good purchase- morals aside.\r\nanyway, ignoring my issues with the AI assets and looking at just the game in a vacuum it is indeed good or at least above average (i think my favorite thing was just the water effect when you mop the floor, it's very satisfying). but honestly, just play powerwash sim or viscera cleanup.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "i dont know why but the game crashes every time i launch it, ive been trying to play all day and it hasnt worked",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is scuff af i have played 9.5 hours of  this and what a waste of my time at first i loved it made it to chapter 8 and the game basically said fu and reset all my progress and i would have to start over also the damn chairs and shit randomly isnt there for no reason then you cant get 100%.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I picked up this game on a whim during the Halloween sale. It sounded like something that was in my wheelhouse, and I saw reviews commenting that it was similar to Viscera Cleanup Detail, but with voice acting and a bit more of a continuous story.\r\n\r\nI ended up being very disappointed with my purchase, and I wish I'd delved a little deeper before getting stuck in.\r\n\r\nWhile the core gameplay loop is just about what it says on the tin, I found a lot of the \"Bells and Whistles\" that sold me on the game were lacking and downright off-putting. \r\n\r\nI noticed that there were quite a few instances of awkward phrasing or inflection from the voice acting, especially from the main character. After hearing a bit of it, a friend asked if it was AI; I researched into that after they asked, and found that there is a voice actor listed, and the devs have apparently commented on this question before, saying that the voices are not AI-generated. Still, I wonder if they used generative AI to tweak some phrasings or generate further lines from the original voice actor. Either way, though, I found the voice acting to be a real disappointment. \r\n\r\nI also found the story itself to be disjointed and not especially well knit together. It felt like a lot of hints would get sprinkled in to connect a through-thread, but then abandoned, or else not quite bridged.\r\n\r\nFor example, [spoiler] I thought that the game was trying to lay bread crumbs for Big Jim being overly paranoid, and have some sort of payoff for that as the jobs continued, as it became more clear through context clues that he had killed people that weren't out to get him at all. But instead, the payoff was that someone had been out to get him in one of the levels? And there also wasn't really a satisfying resolution to all of that. There didn't even super feel like a payoff for the main character getting the money he needed, it just sort of...ended. [/spoiler]\r\n\r\nAnd to be clear, I would have been perfectly happy to play a lot of disconnected episodes of this type of game; idle, perfectionist cleaning of different locations is an idle sort of game for me, akin to Powerwash Simulator or the aforementioned Viscera Cleanup Detail. However, having a connected story through the levels was a feature that was supposed to set the game apart, and it instead felt like a poorly constructed facade over the bones of the game.\r\n\r\nIt was a lot of these touches that just made me not vibe with the game. In addition, I found out after trying to research about the possibility of the voices being AI that there was some discussion among other players that many of the paintings, photos, and other assets used in the game may have been AI-generated, which distressed me greatly. I've taken great pains to stay away from any games that use generative AI content, and Steam has been pretty good about this, as I understood that any games are required to contain a disclaimer about their use, and this game had no such disclaimer. \r\n\r\nI couldn't find any statement from the devs regarding the use of generative AI one way or the other, but if I'd known that there was wide speculation I probably wouldn't have purchased the game unless I got a definitive answer.\r\n\r\nEven if there weren't generative AI used, though, I honestly thought there were a lot of disappointing things about this game, and I wish I'd spent the time checking out some other games instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BE WARNED, FOR THOSE WITH INTEL GRAPHICS OR INTEGRATED GRAPHICS CARDS, THIS GAME WILL NOT WORK FOR YOU. \n\nI would really love to see why this game is so hyped up, but unfortunately it appears that integrated graphics are not supported. The game crashes if you attempt to play almost instantly, and it remains unplayable. I have never seen a game that fails to support Intel graphics that is so popular. And the fact that it isn't shown or warned anywhere but the little tiny requirements section under all the other information makes it hard to find out why the game didn't work in the first place. If the game becomes playable for users with these hardware limitations I will happily update my review but until then, I cannot reccomend this game for anyone with Intel graphics or integrated graphics cards.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun in theory frustrating in practice honestly I just spend an hour trying to find a chair and i just couldn't I'm OCD I've gotten a perfect score on everything but that chair broke me fuck this motherfucking game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first few stages are fun, and it is very satisfying to clean up blood and bodies and put furniture back in place. I enjoyed the small stories you explore at each scene, especially the possessed roomba doing a satanic ritual. Top notch entertainment there. \n\nBut everything else is pretty bad. Some of the cleaning tools are buggy, especially in Nightmare mode, and the writing clearly isn't proofread, containing lots of nice immersion-breaking dialectical inconsistencies. \n\nThe main plotline goes literally nowhere - the guy is working for a mob boss to save his daughter and the mob boss becomes increasingly suspicious of people closer to him, calling hits on them and saying that cleaner man is the only one he can trust... foreshadowing, right? Nah. The intrigue is for nothing. I won't say what happens at the end, but imagine the most boring way this story could resolve, and it's that.\n\nThe voice acting is really... weird? It's bad in a very strange way. The accents are all over the place and some of the words are garbled in ways I've never heard. I'm almost tempted to say the voices are AI, but I have no proof of that. Considering the AI used in some of the prop art though, I wouldn't be surprised, and that makes me sad.\n\nOverall, save your money for a different game that does the same premise better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Damn I could have bought 2-3 more interesting games, not this one.\nI regret that I bought it and spent my time and money.\n\nThe game is not what you think it is.\nWish I could refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a hot fix update deleted my save flies!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LOVED this game until the recent levels and use of AI. There was no reason for it, since nothing else had been AI. And now I feel I bought this under false pretenses of believing it was, and always would never have AI art in it. At this point, I think a refund is in order. You can't just bamboozle your customer base with AI art updates.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "while this game was one of my favorites and super fun they recently moved to adding ai generated images in new maps. immediate uninstall. do better, devs.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "the game is fantastic but but unfortunately has ai images so until they remove it i cant recommend",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Pros: Gameplay is fun and the osts are great. Most are torn on tone shifting but I find the edginess hilarious, paired with a dad's voice actor that reminds me a little of postal dude in the manner of speech.\n\nCons: AI slop artworks everywhere. Soured my impression on the game significantly. I don't think the use of AI is disclosed anywhere on the store page, which I think violates ToS, and I wouldn't have bought it if I saw it. Can't recommend it to anyone because of that and I wish I could still refund it in turn of supporting a more transparent indie dev.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "there is AI generated images used for paintings, pictures and posters and it is undisclosed on the store page. honestly, i'm really baffled as to why stock images weren't used; none of the images needed to be custom.\r\ni get that this is the world we live in now but i try to stay as far from generative AI as i can. i decided to just give this game a chance even after i noticed the assets but i continued to feel guilty (especially in an art gallery level which felt particularly ironic) and after finishing the game and digesting my experience i can say i do regret compromising on my morals.\r\ni also have a personal method for gauging how \"worth it\" a game purchase is, that being: if i enjoyed one hour for every dollar spent then it was worth it. while i recognize i could get more time out of this game (if i wanted to) since there is more content like different modes, i dont think it meets my requirements for a good purchase- morals aside.\r\nanyway, ignoring my issues with the AI assets and looking at just the game in a vacuum it is indeed good or at least above average (i think my favorite thing was just the water effect when you mop the floor, it's very satisfying). but honestly, just play powerwash sim or viscera cleanup.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "i dont know why but the game crashes every time i launch it, ive been trying to play all day and it hasnt worked",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is scuff af i have played 9.5 hours of  this and what a waste of my time at first i loved it made it to chapter 8 and the game basically said fu and reset all my progress and i would have to start over also the damn chairs and shit randomly isnt there for no reason then you cant get 100%.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun in theory frustrating in practice honestly I just spend an hour trying to find a chair and i just couldn't I'm OCD I've gotten a perfect score on everything but that chair broke me fuck this motherfucking game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I picked up this game on a whim during the Halloween sale. It sounded like something that was in my wheelhouse, and I saw reviews commenting that it was similar to Viscera Cleanup Detail, but with voice acting and a bit more of a continuous story.\r\n\r\nI ended up being very disappointed with my purchase, and I wish I'd delved a little deeper before getting stuck in.\r\n\r\nWhile the core gameplay loop is just about what it says on the tin, I found a lot of the \"Bells and Whistles\" that sold me on the game were lacking and downright off-putting. \r\n\r\nI noticed that there were quite a few instances of awkward phrasing or inflection from the voice acting, especially from the main character. After hearing a bit of it, a friend asked if it was AI; I researched into that after they asked, and found that there is a voice actor listed, and the devs have apparently commented on this question before, saying that the voices are not AI-generated. Still, I wonder if they used generative AI to tweak some phrasings or generate further lines from the original voice actor. Either way, though, I found the voice acting to be a real disappointment. \r\n\r\nI also found the story itself to be disjointed and not especially well knit together. It felt like a lot of hints would get sprinkled in to connect a through-thread, but then abandoned, or else not quite bridged.\r\n\r\nFor example, [spoiler] I thought that the game was trying to lay bread crumbs for Big Jim being overly paranoid, and have some sort of payoff for that as the jobs continued, as it became more clear through context clues that he had killed people that weren't out to get him at all. But instead, the payoff was that someone had been out to get him in one of the levels? And there also wasn't really a satisfying resolution to all of that. There didn't even super feel like a payoff for the main character getting the money he needed, it just sort of...ended. [/spoiler]\r\n\r\nAnd to be clear, I would have been perfectly happy to play a lot of disconnected episodes of this type of game; idle, perfectionist cleaning of different locations is an idle sort of game for me, akin to Powerwash Simulator or the aforementioned Viscera Cleanup Detail. However, having a connected story through the levels was a feature that was supposed to set the game apart, and it instead felt like a poorly constructed facade over the bones of the game.\r\n\r\nIt was a lot of these touches that just made me not vibe with the game. In addition, I found out after trying to research about the possibility of the voices being AI that there was some discussion among other players that many of the paintings, photos, and other assets used in the game may have been AI-generated, which distressed me greatly. I've taken great pains to stay away from any games that use generative AI content, and Steam has been pretty good about this, as I understood that any games are required to contain a disclaimer about their use, and this game had no such disclaimer. \r\n\r\nI couldn't find any statement from the devs regarding the use of generative AI one way or the other, but if I'd known that there was wide speculation I probably wouldn't have purchased the game unless I got a definitive answer.\r\n\r\nEven if there weren't generative AI used, though, I honestly thought there were a lot of disappointing things about this game, and I wish I'd spent the time checking out some other games instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BE WARNED, FOR THOSE WITH INTEL GRAPHICS OR INTEGRATED GRAPHICS CARDS, THIS GAME WILL NOT WORK FOR YOU. \n\nI would really love to see why this game is so hyped up, but unfortunately it appears that integrated graphics are not supported. The game crashes if you attempt to play almost instantly, and it remains unplayable. I have never seen a game that fails to support Intel graphics that is so popular. And the fact that it isn't shown or warned anywhere but the little tiny requirements section under all the other information makes it hard to find out why the game didn't work in the first place. If the game becomes playable for users with these hardware limitations I will happily update my review but until then, I cannot reccomend this game for anyone with Intel graphics or integrated graphics cards.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The first few stages are fun, and it is very satisfying to clean up blood and bodies and put furniture back in place. I enjoyed the small stories you explore at each scene, especially the possessed roomba doing a satanic ritual. Top notch entertainment there. \n\nBut everything else is pretty bad. Some of the cleaning tools are buggy, especially in Nightmare mode, and the writing clearly isn't proofread, containing lots of nice immersion-breaking dialectical inconsistencies. \n\nThe main plotline goes literally nowhere - the guy is working for a mob boss to save his daughter and the mob boss becomes increasingly suspicious of people closer to him, calling hits on them and saying that cleaner man is the only one he can trust... foreshadowing, right? Nah. The intrigue is for nothing. I won't say what happens at the end, but imagine the most boring way this story could resolve, and it's that.\n\nThe voice acting is really... weird? It's bad in a very strange way. The accents are all over the place and some of the words are garbled in ways I've never heard. I'm almost tempted to say the voices are AI, but I have no proof of that. Considering the AI used in some of the prop art though, I wouldn't be surprised, and that makes me sad.\n\nOverall, save your money for a different game that does the same premise better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Damn I could have bought 2-3 more interesting games, not this one.\nI regret that I bought it and spent my time and money.\n\nThe game is not what you think it is.\nWish I could refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a hot fix update deleted my save flies!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LOVED this game until the recent levels and use of AI. There was no reason for it, since nothing else had been AI. And now I feel I bought this under false pretenses of believing it was, and always would never have AI art in it. At this point, I think a refund is in order. You can't just bamboozle your customer base with AI art updates.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "while this game was one of my favorites and super fun they recently moved to adding ai generated images in new maps. immediate uninstall. do better, devs.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "the game is fantastic but but unfortunately has ai images so until they remove it i cant recommend",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Pros: Gameplay is fun and the osts are great. Most are torn on tone shifting but I find the edginess hilarious, paired with a dad's voice actor that reminds me a little of postal dude in the manner of speech.\n\nCons: AI slop artworks everywhere. Soured my impression on the game significantly. I don't think the use of AI is disclosed anywhere on the store page, which I think violates ToS, and I wouldn't have bought it if I saw it. Can't recommend it to anyone because of that and I wish I could still refund it in turn of supporting a more transparent indie dev.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "there is AI generated images used for paintings, pictures and posters and it is undisclosed on the store page. honestly, i'm really baffled as to why stock images weren't used; none of the images needed to be custom.\r\ni get that this is the world we live in now but i try to stay as far from generative AI as i can. i decided to just give this game a chance even after i noticed the assets but i continued to feel guilty (especially in an art gallery level which felt particularly ironic) and after finishing the game and digesting my experience i can say i do regret compromising on my morals.\r\ni also have a personal method for gauging how \"worth it\" a game purchase is, that being: if i enjoyed one hour for every dollar spent then it was worth it. while i recognize i could get more time out of this game (if i wanted to) since there is more content like different modes, i dont think it meets my requirements for a good purchase- morals aside.\r\nanyway, ignoring my issues with the AI assets and looking at just the game in a vacuum it is indeed good or at least above average (i think my favorite thing was just the water effect when you mop the floor, it's very satisfying). but honestly, just play powerwash sim or viscera cleanup.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "i dont know why but the game crashes every time i launch it, ive been trying to play all day and it hasnt worked",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}