{
  "positive": [
    {
      "review": "Eternal Return is an exciting and unique game that skillfully combines battle royale, MOBA, and survival elements, making every match feel fresh and strategic. The diverse cast of characters, progression system, and fast-paced gameplay keep it engaging for the long run. The only downside is that ranked matches in Europe seem almost impossible — I tried several times, waited for a long time, but never managed to find a game, which is quite disappointing for such a great title.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "A niche game in EU region, servers are empty. Yet, developers continue to support it and the game is pretty good. Wouldn't really recommend, but you can have some fun, so just give it a try. Better have some two friends to play with, since having a team is much better than solo.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Game was good + unique when it came out every update made it more and more stale and \"e-sport friendly\" like other MOBA game now. \n\nThe QOL updates are good easier to read objective faster item building. More Characters and skins are cools. only problem with update is NN never stick and polish with any of the mechanics keep adding random bullshit and change stuff over and over like bro wtf stick with one plz.\n\nAlso lack of advertising game is too much the game is fun tbh it have really good potential to grow big. NN just stop advertising it after few week of release now the playerbases is just small ad mostly in KR and JP barely anyone play SEA (Asia3) or NA and that's suck.\n\nForcing the game to be squad only are also bad decision since the game really shine in solo .Making it very fun to play in the old days in ranked there's always 4-5 guys hanging around the last zone giving really unique tension now its just team fight between 2-3 teams no more of the survival aspect anymore. I mean the game changed. \nI guess no more \"Black Survival\" it's just \"Eternal Return now\" :(\n\nRight now it just generic BR moba that kinda fun i just wish the game should have grow toward its predecessor.\n7/10 \nthe game is cool but lose so much potentials",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun game, probably a bit rough for beginners, especially in the least populated servers.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This multiplayer game is a well-rounded but it has a small playerbase (for anywhere other than South Korea) and a steep learning curve. Since it is a battle royale your performance in a match is heavily reliant on a mixture of player skill, RNG, and possible teamwork for 3v3s.\n\nEverything else is similar to league of legends when it comes to progression, every character can be unlocked with in-game currency, the bulk of which you get from ranking up your profile from playing matches, and random skins can be acquired too. Skins are far more paywalled and there are seasonal themed battle passes for them. The background lore  for the setting is nice as well.\n\nNew players are forced to fight bots until they reach a certain rank. The initial tutorial has players use Yuki who is the most boring generic character out of the entire game's roster. The map variety isn't as good as it should be. Microtransactions are not micro enough. It's a fine game to play for free and return to every now and then.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "90% played by korean 10% mix of other asians and white dudes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "im goated. jackie main. run them down. rank is ass since battleroyal is about placement not tk-wise. log-in, queue quick match and win ez",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my oomfie got like 3rd in the erbs lcs so thats kinda awesome yeah im flexing my friend because shes good at the game haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When 5v5 is not enough anymore as MOBA. Great improvement from the previous game they made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game gajelas anjay item mythic kalah sama item epig kocag, tapi waifuable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can get a lot of skins without paying any fee\nand the game also has a lot of events",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will be blunt here, theres nothing the game does special or which stands out when compared to other games. \n\nIt is a Battle Royale Moba which has quite a steep learning curve so it will be rough for new players, but will become quite fun after you figure out the mechanics of the game.\n\nBut the game just hits the spot in my brain, which results in me constantly returning to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a game with an early-game system that’s hard to understand and hard to get into, but overall it’s quite fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The combination of top-down MOBA combat with the survival elements of Battle Royale and a deep crafting system is genuinely innovative. The blend creates a unique flow: planning/looting, early skirmish, objective contest, final teamfight.\nThe large and diverse cast of characters (Test Subjects) all have unique kits, ensuring a playstyle for everyone. The character art and design are also fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very niche MOBA esports game; please play it to increase its popularity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've started playing Eternal Return pretty close to its beta release and have been on and off of the game over the years. I originally played with my friends exclusively but then I started queuing squad by myself after the first \"real\" release.\n\nThe game itself is fun in my opinion, I like the battle royal style and the combat a lot. The gameplay, at least from when I last played it, was fairly solid. Yes there was lag, but I'm very sure it was my PC's fault anyway. I truly love the characters, their designs, skins, and stories (even if they never really expanded on the stories too much).\n\nWhat really urks me is when queue times would just take forever. No one was really playing the game a while after the first real release, especially in NA, so it just felt demotivating. This is even worse when you wanted to play ranked, it just felt terrible waiting 15+ minutes for a match only for the timer to restart.\n\nI'll probably pick up the game again in my free time eventually, somehow I keep getting drawn back to it. The game IS fun, the characters are interest in combat and story, it's just not the best experience queuing outside of Asia.\n\n**I haven't played the game since July of this year, so all of my thoughts are from that specific patch. I'm aware there are some changes that people liked and didn't like since then, I just have no thoughts on them at the moment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра Eternal Return — это уникальный микс жанров: напряжённый MOBA-экшен, глубокая рогаликовая система крафта и стратегия выживания на одном огромном острове. Создавайте уникальные сборки для десятков героев, добывайте ресурсы, сражайтесь с другими игроками и монстрами, стремясь стать последним выжившим. Невероятно увлекательная и глубокая игра, которая постоянно развивается.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a 15 year veteran of Dota 1, League, and Dota 2. Eternal Return solves some of the biggest gripes I have in mobas and br's, the latter of which I'm not to big of a fan, until this game. Most champion skills are ripped straight from League and shuffled around the roster, so if you have some number of hours in League, the skills in this game should feel extremely familiar to you. However, some of the more original stuff they have like Debi & Marlene, NiaH, Estelle, Tia and more offer a level of depth and complexity, or just plain fun, that I find missing in League champion kits. I don't think it quite matches Dota 2 in terms of potential complexity, but I find that it's engaging enough in it's current form.\n\nI absolutely despise crafting in games and I'm happy to see that the devs have found a way to make a boring mechanic feel as minimally intrusive as possible. Initial builds are finished in the first 40 seconds or so, and you'll only engage with it very very sparingly from that point onward.\n\nMatch length rarely exceeds 20 minutes, another boon over your traditional MOBA. This really helps with preventing tilt I feel, since you're not going on for 35-45 minutes in a losing effort. My queue times are also really nice since I'm playing on Asia 3. Anywhere between 20 - 90 seconds.\n\nMonetisation is more than fine too. A BP that refunds about 70% of the currency spent is one of the more generous ones I've seen. Along with giving actually nice rewards. However, some of the skins that are available are ludicrously expensive like cotton candy Debi & Marlene. I'm not sure if they were event skins and I just missed the launch time, but it feels like it'll be years before I can get even a single one semi f2p. \n\nFinally, the game has an anime aesthetic. I'm a huge weeb. This isn't a nonsensical gambling simulator like so many other anime \"games\" that have been popping up since 2021 or so. This is a huge win.\n\nOh also it runs fantastically on Linux (Cachy, Cachy-proton, rtx4070). I seem to be unable to use the Steam overlay (used for currency purchases) when I have game recording turned on I think. I haven't really troubleshooted it extensively but I find that it works again when I turn recording off.\n\nMy final score is a 9.5/10. I honestly haven't felt this excited learning about a game since the early days of dota 1 and League. I'm really having a ton of fun right now and I can definitely see myself staying for the long haul.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eternal Return masterfully blends top-down MOBA combat with battle royale survival elements. You choose a character, loot materials, craft gear, and fight to be the last one standing on the island of Lumia. The combination of MOBA-style characters and abilities with crafting and battle royale pacing is fresh and deeply engaging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eternal Return keeps me returning back to it for eternity",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "League of Legends but anime and better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This free to play game is one of very few. The art work is cute and the gameplay is pretty on point. The skins feel very varied and worth getting, and not to mention MOST of the skins, characters and content can be earned in game.  \r\n\r\n      My only gripe is the solo mode is caped at  level 15 which is odd but the player base seems very kind and I have nothing against helping new players who get thrusted into this battle royale. There is a bot training mode which is helpful to get a good feel on the game, however I do think its better to just try against players for the exp, rewards, and  the fact the bots act like they eat glue. \r\n\r\n     over all good game, and I love the peeps I meet here!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down one of the most fun F2P games Ive played. It does things different than other BR's. Sure some things can get frustrating but thats legit every fucking game. Plus all the characters you can play are super fun. A far as free to play games go, its one of the better ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chew we?\nanyhow, would be better if more people played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ">Decided to play Eternal Return\n>Play one match\n>Wipe day 2\n>???\n>Repeat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wat is friends also play a1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY GOOD SHOULD BE MUCH MORE POPULAR THAN IT IS",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "최고의 게임 이터널리턴!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just give it a try its a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "롤보다 나은 거 같긴 해",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun unique game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it, very unique.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hate this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Devs please oce servers...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LoL Arena mode but without being LoL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "camera like wtf man skills combo fk up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "needs more players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "igra dlya dodikov :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Leni Kaniiiiiiiiiiiiiiiiiiiiiiii T///T",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "satisfy your weebs urge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like spamming bombs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "buck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waifu",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "gay",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "sdad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guys come play this game plssss. It might be hard, but it's super fun once you learn it.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "This game is fun, its competitive, and well made. Super DUPER sweaty.\nThe learning curve is steep. I recommend sticking with 1-3 characters as mains. I come from RTS games and DOTA, so its not as difficult to get into it - still difficult.\n\nThe menu music is sexy and I can listen to it looping for hours. The characters have a fun personality, their skills are unique and fun to learn.\n\nAs a team game this suffers from that \"League of Legends\" style hatred that festers due to bad teammates or loss streaks to a point where you're asking yourself: Is this even a game or a job? Ofcourse that's a me skill issue.\n\nAlso it needs more marketing, the queue is pretty long. 10 to 20 minutes to get a game if its not prime time, and you will see the same players fairly often.\n\nMay be better suited for the Asian gamer market, North American players are generally a bit worse with these highly technical games.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Eternal Return is an exciting and unique game that skillfully combines battle royale, MOBA, and survival elements, making every match feel fresh and strategic. The diverse cast of characters, progression system, and fast-paced gameplay keep it engaging for the long run. The only downside is that ranked matches in Europe seem almost impossible — I tried several times, waited for a long time, but never managed to find a game, which is quite disappointing for such a great title.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "A niche game in EU region, servers are empty. Yet, developers continue to support it and the game is pretty good. Wouldn't really recommend, but you can have some fun, so just give it a try. Better have some two friends to play with, since having a team is much better than solo.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I have noticed a lot of reviews mentioning how hard this game is, or talking about advanced mechanics. I promise you don't need any of that to enjoy this game. A lot of the more confusing systems have been streamlined. As long as you understand the very basics of looting and building your items you can get far. The only problem is actually getting a game can take a long time with the low player population.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Game was good + unique when it came out every update made it more and more stale and \"e-sport friendly\" like other MOBA game now. \n\nThe QOL updates are good easier to read objective faster item building. More Characters and skins are cools. only problem with update is NN never stick and polish with any of the mechanics keep adding random bullshit and change stuff over and over like bro wtf stick with one plz.\n\nAlso lack of advertising game is too much the game is fun tbh it have really good potential to grow big. NN just stop advertising it after few week of release now the playerbases is just small ad mostly in KR and JP barely anyone play SEA (Asia3) or NA and that's suck.\n\nForcing the game to be squad only are also bad decision since the game really shine in solo .Making it very fun to play in the old days in ranked there's always 4-5 guys hanging around the last zone giving really unique tension now its just team fight between 2-3 teams no more of the survival aspect anymore. I mean the game changed. \nI guess no more \"Black Survival\" it's just \"Eternal Return now\" :(\n\nRight now it just generic BR moba that kinda fun i just wish the game should have grow toward its predecessor.\n7/10 \nthe game is cool but lose so much potentials",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun game, probably a bit rough for beginners, especially in the least populated servers.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is wonderful and the majority of the players are nice. The game has a great tutorial and you can use any of the characters as long as you work on getting them (it isnt that hard and you dont have to buy any unless you want to)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "As someone who’s played League of Legends for a decade, I wasn’t expecting another MOBA-style game to grab my interest. But Eternal Return managed to do it by mixing in fresh ideas and cutting down on the overwhelming complexity that drives a lot of new players away from the genre.\n\nOverall, I’m enjoying this game more than I thought I would. I played League of Legends for 10 years, so this game wasn’t all that hard to understand. They make it pretty easy for players since there are premade builds for each character. The hardest part, like in any other MOBA, is learning what each character does.\n\nThankfully, unlike League, this game doesn’t have 171 characters you need to memorize just to play properly. That’s one of the main reasons I never got into games like DOTA 2 or Smite — it always felt like a massive time investment just to learn all the character abilities while also figuring out your lane, farming, jungle rotations, and so on.\n\nSo discovering Eternal Return, a game with MOBA-style combat, a nicely sized roster, and some fresh mechanics I haven’t seen in more traditional MOBAs, has been a breath of fresh air.\n\nHowever, a few things are holding the game back. For one, the queue times are long — be ready to wait 5–10 minutes for a match. And if someone goes AFK, everyone gets sent back to queue for another 5–10 minutes. I think this will improve as more people discover the game.\n\nSecond, I swear that about a quarter of the time I use my abilities, they don’t register. Sometimes I have to spam the same ability just to get it to go off. This might be by design — I think your cursor can’t exceed the distance of your skill shots, which prevents them from registering. If that’s true, it’s super annoying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game but, sweaty game often, you have to get pretty good until you can play a bit less sweaty to keep up with other players",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This multiplayer game is a well-rounded but it has a small playerbase (for anywhere other than South Korea) and a steep learning curve. Since it is a battle royale your performance in a match is heavily reliant on a mixture of player skill, RNG, and possible teamwork for 3v3s.\n\nEverything else is similar to league of legends when it comes to progression, every character can be unlocked with in-game currency, the bulk of which you get from ranking up your profile from playing matches, and random skins can be acquired too. Skins are far more paywalled and there are seasonal themed battle passes for them. The background lore  for the setting is nice as well.\n\nNew players are forced to fight bots until they reach a certain rank. The initial tutorial has players use Yuki who is the most boring generic character out of the entire game's roster. The map variety isn't as good as it should be. Microtransactions are not micro enough. It's a fine game to play for free and return to every now and then.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "90% played by korean 10% mix of other asians and white dudes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played on and off since release, and played the other game this company made that was a point and click battle royale crafting game, I think forcing this to be a 3v3 is retarded KEEP SOLO!!! this game was ALWAYS playable solo and even their other game was, literally makes no sense KEEP SOLO AS A MODE!!!. aside from that theyve made it easier to get into with Auto looting items you need for your build and quick craft with shift+Z, the characters are a mix of league of legends kits and something actually unique the game at its core is fun, no p2w fun characters, fun gameplay, just bring back solo lol.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "im goated. jackie main. run them down. rank is ass since battleroyal is about placement not tk-wise. log-in, queue quick match and win ez",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my oomfie got like 3rd in the erbs lcs so thats kinda awesome yeah im flexing my friend because shes good at the game haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When 5v5 is not enough anymore as MOBA. Great improvement from the previous game they made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game gajelas anjay item mythic kalah sama item epig kocag, tapi waifuable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can get a lot of skins without paying any fee\nand the game also has a lot of events",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will be blunt here, theres nothing the game does special or which stands out when compared to other games. \n\nIt is a Battle Royale Moba which has quite a steep learning curve so it will be rough for new players, but will become quite fun after you figure out the mechanics of the game.\n\nBut the game just hits the spot in my brain, which results in me constantly returning to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a game with an early-game system that’s hard to understand and hard to get into, but overall it’s quite fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The combination of top-down MOBA combat with the survival elements of Battle Royale and a deep crafting system is genuinely innovative. The blend creates a unique flow: planning/looting, early skirmish, objective contest, final teamfight.\nThe large and diverse cast of characters (Test Subjects) all have unique kits, ensuring a playstyle for everyone. The character art and design are also fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very niche MOBA esports game; please play it to increase its popularity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've started playing Eternal Return pretty close to its beta release and have been on and off of the game over the years. I originally played with my friends exclusively but then I started queuing squad by myself after the first \"real\" release.\n\nThe game itself is fun in my opinion, I like the battle royal style and the combat a lot. The gameplay, at least from when I last played it, was fairly solid. Yes there was lag, but I'm very sure it was my PC's fault anyway. I truly love the characters, their designs, skins, and stories (even if they never really expanded on the stories too much).\n\nWhat really urks me is when queue times would just take forever. No one was really playing the game a while after the first real release, especially in NA, so it just felt demotivating. This is even worse when you wanted to play ranked, it just felt terrible waiting 15+ minutes for a match only for the timer to restart.\n\nI'll probably pick up the game again in my free time eventually, somehow I keep getting drawn back to it. The game IS fun, the characters are interest in combat and story, it's just not the best experience queuing outside of Asia.\n\n**I haven't played the game since July of this year, so all of my thoughts are from that specific patch. I'm aware there are some changes that people liked and didn't like since then, I just have no thoughts on them at the moment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра Eternal Return — это уникальный микс жанров: напряжённый MOBA-экшен, глубокая рогаликовая система крафта и стратегия выживания на одном огромном острове. Создавайте уникальные сборки для десятков героев, добывайте ресурсы, сражайтесь с другими игроками и монстрами, стремясь стать последним выжившим. Невероятно увлекательная и глубокая игра, которая постоянно развивается.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A much-needed breath of fresh air in the MOBA market. This game is definitely worth your attention. The more I play, the more fun I have. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as veteran moba player like dota and league this one is refreshing and totally snatch the fun with fast pace game play, so I got both adrenalin fun and thrash talking at the same time which is good for mental health :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Great character design. Highly recommended if you like battle royale type games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is good, the optimization is soo bad, keep crashing on my new rig 9070xt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A learning curve like a vertical cliff if you're not familiar with any of the genres in this game, once you get over that it's a solid and unique experience you can't really get in any other game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how many characters you have to choose from so it's never boring playing this game. I hate when games have like 6 people to choose from but this one gives so many it makes it worthwhile to me! There is some learning to do when you first start but if your just here for fun like me I just skim through it all and just go out there and play. So far I recommend it if you like diversity and something new and unique!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well\nIts like a Battleground + Moba type of game (With Crafting)\n\nCharacters are easy to obtain so i would not say its Pay to win game \n\nGame don't have alot players left so u need to Switch between Servers (Europe / America east/West) to find a match\nUssually i waited 15-20 min\n\ni Never was able to find a Protocol match so just search 3 Team Normal or Ranked\n\nTeammates in Automatch is Rng if you get anyone good or no (But thats a normal thing)\n\nu will get often destroyed by people who alrd master the game\n\nits a really hard start for a first timer to understand what to and how mechanics works, so i recommend watching some YT tutorials first\n\nIts Free so u can give it a try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly had the old version of this on my phone i just like the game its fun and easy to learn overtime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mastered rotation timings, agro manipulation, itemization synergies, and CC chains to climb from Gold to Masters. Every mechanic—kiting, passive scaling, turret zoning—executed perfectly. But the low player base means queues are dead, repeat opponents are inevitable, and I’ve been forced to quit despite perfecting the meta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an addicting game I played it before getting brain damage and I actually rememberd the game not how to play though. but still love it after playing it again 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a little complicated but gets easier the more you play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with unique blend of MOBA and Battle Royale. Learning curve is steep, but very rewarding once you get the hang of it. Constant updates and character additions keep it fresh and exciting. Definitely worth checking out if you enjoy strategic gameplay and competition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great characters and music. i've really enjoyed playing it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS AWESOME im still learing how to play but it suits my likeing very well! would totally recocomend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I miss the single player aspect of this game and while the veterans like the teams of three more. I feel like I can't learn things properly with team mates that just complain about beginners.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable game, nice skins and all, nice concept of the game, only player base count is kinda sad.\n\nThis game needs more promotion to reach higher player base and to reduce matchmaking time. I really hope more people play this game and make it more enjoyable for others who wait 5-15 mins for the match to start.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to play with the boys simple to learn once you grasp how to build items and use the build planner like a mix of battle royal game and moba item building but you go look for the items not just buy them from a shop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not bad. Very little advertisement tho... Since it has such a small playerbase, queue can take between 30 seconds and 15 minutes and most of the time you get matched with the same people back to back to back to back...... (EU at least)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Evolution of immortal Soul :Black Survival?\r\nthere is sama character amd theme, but deferent gameplay. make me nostalgic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Survive and thrive on Lumia Island in this cooperative survival game. As a subject of AGLAIA’s secret experiments, you must work with your teammates to search for resources, craft weapons and armor, and hunt for survival. Every decision matters as you navigate the dangers of the island in this eternal survival experiment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, and not p2w at all. i find it very generous with the ingame currency / lootboxes as you can get a ton from achievements, and if you save up you can get a battlepass and a bunch of skins for free! while new players might struggle a bit at the start, i find it super rewarding when you start understanding the mechanics. i see a lot of ppl complain about queue times, but i personally find that it takes about 3-8 minutes to get in a game (which in my book, isn't too bad). my only issue is it seems the devs dont really market the game very much, leading to a lower playerbase (and marketing could solve the queue problem!). coming from league of legends i found this game a super refreshing breath of air as i really enjoy the crafting mechanic as opposed to straight up buying your items with gold. i dont usually write reviews for games, but i've found it really enjoyable and i think its super sad it doesnt have a bigger playerbase.",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "This game is dead on NA, even at peak time I can't start ranked and normal mode takes 5-10+ minutes for a game. Normal games are ridiculously unbalanced with typically one team bulldozing the others (they can't do skill based/ mmr norms because then no one will get to play) . This game has been out for half a decade from what I searched and has had bad player retention outside asia so don't expect a sudden burst of popularity anytime soon. Everyone is some font of a generic anime character so their silhouettes mesh resulting in poor accessibility. If you are coming from league this game is clunkier, there's this input lag that is very small but adds up with actions per minute (more similiar to Dota than League).  Character kits are one of the most cohesive I've seen in MOBA, and even if they are generic anime characters they all fullfill their character fantasy. No matter who you are you will find one character kit you adore. Very fun and unique gameplay locked behind a dead server for anyone not on Asia, a very bad looking UI (Why is Collection and Collectibles different UI options?), and clunkiness despite having some of the hardest (in a good way) character kits I have seen in the genre.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really wouldn't recommend this game as something someone can have fun in- BASELINE- unless you're already really skilled and knowledgeable in a MOBA game \n\nNormally, I wouldn't bring up skill but this game is trying to combine item building, battle royale, and MOBA all into one game. I'm Challenger in League so I can pilot the characters themselves pretty well, but its still not enough for me, so how the hell would someone else fare?\n\nThe learning curve is STILL so insanely steep with every thing else that exists in the game, and how things interact... on top of the fact that, as far as I know, the game has gotten multiple reworks and changes to queues. No idea if solo play is possible still.\n\nThen.. the nail in the coffin. The insanely high skill floor. Steep learning curve. Big barrier to entry. OK whatever. Let's say you play anyway. Congratulations you are now playing vs 20 Lebrons in your lobby that have hundreds upon thousands of hours in the game, and already know how the systems work. So you just kind of die.\n\nThis wasn't so bad when you could solo queue and just brute force with mechanical play.. but you see the point. It's a good game and I still find it fun, its just a shame its so held back by the smaller playerbase of the West, among other things.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TL;DR: its somewhat fun, but you basically lose interest after 15-20 matches.\r\n- 'bad-tier' DPS characters literally cannot compete with other DPS characters even under optimal conditions for their kit, despite being designed as DPS and having little to no support/tank attributes. There are basically some characters you should just never choose ever, even if you like their aesthetic. \r\n\r\n- The flow of the the match is poorly designed. Early game you basically do almost zero damage to anyone, so everyone just walks around and collects materials and basically ignores enemy teams. Late game, basically every team can reach full late-game items even when behind. At that point, the ONLY way to get better gear is to contest some of the rare spawns (Dr. Wickerline, Rifts), and even then some of the items you can build out of the rare drops are only marginally better, and only one person in your team will get to choose one marginally better item per event. There is only a small window in the MID GAME where a player that has been playing well has an equipment/level advantage over others.\r\nIt basically just comes down to which team has the most cracked characters, and how well they can stick together and click buttons on the correct enemy targets.\r\n\r\n- A lot of the characters start feeling very same-y after several matches. The character models tend to blend-in with each other and the environment because everything has a very similar color palette, and all the characters are roughly the same size. There is some decent variation in skills, but overall it doesn't feel like enough. Ult's don't feel very impactful/unique.\r\n\r\nOverall I think this game has a TON of potential, and it IS somewhat fun, but the design team needs to go back to the drawing board and find something that can make the game stand out from the others, something OTHER THAN just the fact that it is a BR-MOBA hybrid.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They say the game is free to play, that's cool right? But wht about when you start playing and there's all these characters you want to play that you don't have, you'll have to pay to be able to get those right? And as you play on, you find all these skins you like but you dont have, you also have to pay to get those as well. And they all cost a lot of money and to top it of they cost USD which makes them cost even more money. If you want everything for free you have to spend a lot of time on the game to be able to get good at the game and if you're not good at the game people will treat you very poorly, not want to play with you label you, say mean things to you, and if you're a girl its even even worst they're sexist towards you. 90% of the people are toxic as hell. Most of the people stop playing for this reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "waste of my time!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuck around before launch because solos made this game stand out. Then they took it away, so I stopped playing. I was told that the \"Lone Wolf\" mode brought solos back, but when I tried to play in the few hours the game allows you to, there weren't enough players to fill a single game. And now they took Lone Wolf away. Fool me once, shame on you. Fool me twice, shame on me.\r\n\r\nI loved this game, and perhaps I'm being too harsh because I know what it once was. But looking at the changes since I've played, I would have a hard time recommending this game. There are way better MOBAs out there if you want to play with a team. I would say that ERBS has a stand-out feature in the crafting system, but between the reduction in item slots and gutting the food mechanic, one might question why crafting still exists anymore. It's sad to say, but I've lost my faith in this game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Back in the day this game used to be something special. After they removed the solos the game gets reworked after rework which is exhausting, and in my personal opinion it gets worse and worse.\n\nShame, because back in the day this game used to be an absolute banger.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I think the game is pretty fun, queue time is just abnormally long.\r\n\r\nThe sound design in this game feels like a mobile game, not the greatest, character designs are ok nothing super special, some characters stand out while others just feel pretty generic anime character.\r\n\r\nGameplay is personally where I think this game does best, it took some time to learn how to play the game, and some help from external sources like youtube videos and such but once you understand how to play the game, it can be a pretty fun little MOBA.\r\n\r\nThere's not enough players to find a game at a reasonable time, and for that I can't recommend the game. You WILL spend more time waiting in queue than playing the game, it's honestly not worth it for what the game is.\r\n\r\nEven with the game taking as long as it does, when you get in a match you either get stomped or it feels like everyone is a bot, teammates and enemies included.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Some first match you will fight a bot/ai player,then when you got a real match/play with real player...oh hell nah. I haven't that good in the game,and from all my experience playing this game is fighting Ai/bots, then you gave me an High tier veteran player who s spend a thousand hour to this game?  Are you kidding me? \n i think this game had SBMM (the same matchmaking system  in COD, this system is made you as new player meet the high tier/high KD player \"to learn the game \" they said lol) Because i'm pretty sure there s a new player in this game, even its just 10-20 players but in match there s no any single one that is a new player, everyone are High tier rank,even in rank  mode you will only meet a smurf account.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Calling it now, adding a verification system is gonna reduce the playerbase even more and possibly straight up remove the few players in non kr lobbies.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Eternal Return is a flaming dumpster fire of suffering — a goddamn migraine masquerading as a game. It throws you into a meat grinder of confusing bullshit where you spend ten minutes crafting garbage just to get obliterated in two seconds by some meta-addicted freak who’s been sweating in the queue since 2021. The matchmaking is a cosmic joke, the servers feel like they’re powered by a hamster on life support, and the UI looks like someone vomited Excel sheets all over your screen. Every match feels like punishment for even daring to exist, and every death leaves you wondering why the hell you wasted your time on this digital diarrhea of chaos. It’s not fun, it’s not fair, it’s just pure, unfiltered pain wrapped in a shiny layer of deceit.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game is dead on NA, even at peak time I can't start ranked and normal mode takes 5-10+ minutes for a game. Normal games are ridiculously unbalanced with typically one team bulldozing the others (they can't do skill based/ mmr norms because then no one will get to play) . This game has been out for half a decade from what I searched and has had bad player retention outside asia so don't expect a sudden burst of popularity anytime soon. Everyone is some font of a generic anime character so their silhouettes mesh resulting in poor accessibility. If you are coming from league this game is clunkier, there's this input lag that is very small but adds up with actions per minute (more similiar to Dota than League).  Character kits are one of the most cohesive I've seen in MOBA, and even if they are generic anime characters they all fullfill their character fantasy. No matter who you are you will find one character kit you adore. Very fun and unique gameplay locked behind a dead server for anyone not on Asia, a very bad looking UI (Why is Collection and Collectibles different UI options?), and clunkiness despite having some of the hardest (in a good way) character kits I have seen in the genre.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wouldn't recommend this game as something someone can have fun in- BASELINE- unless you're already really skilled and knowledgeable in a MOBA game \n\nNormally, I wouldn't bring up skill but this game is trying to combine item building, battle royale, and MOBA all into one game. I'm Challenger in League so I can pilot the characters themselves pretty well, but its still not enough for me, so how the hell would someone else fare?\n\nThe learning curve is STILL so insanely steep with every thing else that exists in the game, and how things interact... on top of the fact that, as far as I know, the game has gotten multiple reworks and changes to queues. No idea if solo play is possible still.\n\nThen.. the nail in the coffin. The insanely high skill floor. Steep learning curve. Big barrier to entry. OK whatever. Let's say you play anyway. Congratulations you are now playing vs 20 Lebrons in your lobby that have hundreds upon thousands of hours in the game, and already know how the systems work. So you just kind of die.\n\nThis wasn't so bad when you could solo queue and just brute force with mechanical play.. but you see the point. It's a good game and I still find it fun, its just a shame its so held back by the smaller playerbase of the West, among other things.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The games NA servers are practically dead. I have currently sat in queue for 15 minutes and we got 2/24 players for a match in standard. This is kind of wild. Not sure what happened with it where no one is online or my match making is busted.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Finding games takes forever and the quality of games is rather low because of that. (EU Server)\r\nGenerally unbalanced normal game mm and ranked was 30min minimum queue time at peak hours last time i played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✧ This game has too many cheaters even there are map cheaters or shoichi swinging knife nonstop and then he alone then used a series of skills to kill the other 3 people in the blink of an eye.\n\n✧ The prices in the store are not reasonable very expensive in a sense.\n\n✧ Currently only the Korean server still has players, but the server response is very slow and greatly affects foreign players, like 100ms suddenly jumps to 200ms, if so the publisher should create this game for Korean players.\n\n✧ Teammates are jerks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matching system is a joke, teaming in plat is already make the rank tier inflation already. Trio to diamond is insane, the quality of the game is really bad. If you play good then you need to carry the other 2 player to win a 3v3 game. Hah funny system, same like league now, care about low elo, not actually tell them to be better is ask our high elo to carry them to make them look better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The abilities and feel of control is very similar to league which I like but the gameplay just is dumb. Don’t really care for the scavenging for items mechanic. Lost just from not speed running item components.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: its somewhat fun, but you basically lose interest after 15-20 matches.\r\n- 'bad-tier' DPS characters literally cannot compete with other DPS characters even under optimal conditions for their kit, despite being designed as DPS and having little to no support/tank attributes. There are basically some characters you should just never choose ever, even if you like their aesthetic. \r\n\r\n- The flow of the the match is poorly designed. Early game you basically do almost zero damage to anyone, so everyone just walks around and collects materials and basically ignores enemy teams. Late game, basically every team can reach full late-game items even when behind. At that point, the ONLY way to get better gear is to contest some of the rare spawns (Dr. Wickerline, Rifts), and even then some of the items you can build out of the rare drops are only marginally better, and only one person in your team will get to choose one marginally better item per event. There is only a small window in the MID GAME where a player that has been playing well has an equipment/level advantage over others.\r\nIt basically just comes down to which team has the most cracked characters, and how well they can stick together and click buttons on the correct enemy targets.\r\n\r\n- A lot of the characters start feeling very same-y after several matches. The character models tend to blend-in with each other and the environment because everything has a very similar color palette, and all the characters are roughly the same size. There is some decent variation in skills, but overall it doesn't feel like enough. Ult's don't feel very impactful/unique.\r\n\r\nOverall I think this game has a TON of potential, and it IS somewhat fun, but the design team needs to go back to the drawing board and find something that can make the game stand out from the others, something OTHER THAN just the fact that it is a BR-MOBA hybrid.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "way too unnecessarily complicated for a MOBA,\n\nand bots are everywhere\n\ndead game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every Character has only one optimized build which kills diversity. And don't expect balance. some characters simply dominate.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They say the game is free to play, that's cool right? But wht about when you start playing and there's all these characters you want to play that you don't have, you'll have to pay to be able to get those right? And as you play on, you find all these skins you like but you dont have, you also have to pay to get those as well. And they all cost a lot of money and to top it of they cost USD which makes them cost even more money. If you want everything for free you have to spend a lot of time on the game to be able to get good at the game and if you're not good at the game people will treat you very poorly, not want to play with you label you, say mean things to you, and if you're a girl its even even worst they're sexist towards you. 90% of the people are toxic as hell. Most of the people stop playing for this reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too horny for a guy like me. The first person you talk to in game is a hot teacher, Immediately turned  the game off.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no balance. if u play sup, teammate cant carry, then u go down, even rank points had bug and every new season will delete your loadout, if u play over 10 characters, u need make all loadout again, sad:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "steam forgot to tell me this was a PvP MOBA two things I HATE!!! \nno review it not the designers fault",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It takes to much time for searching match",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "คนเล่นน้อยหาห้องไม่เจอสักที",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Likes anime girls! but not like this game(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is high tier garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "played for 1 match that was enough",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "waste of my time!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuck around before launch because solos made this game stand out. Then they took it away, so I stopped playing. I was told that the \"Lone Wolf\" mode brought solos back, but when I tried to play in the few hours the game allows you to, there weren't enough players to fill a single game. And now they took Lone Wolf away. Fool me once, shame on you. Fool me twice, shame on me.\r\n\r\nI loved this game, and perhaps I'm being too harsh because I know what it once was. But looking at the changes since I've played, I would have a hard time recommending this game. There are way better MOBAs out there if you want to play with a team. I would say that ERBS has a stand-out feature in the crafting system, but between the reduction in item slots and gutting the food mechanic, one might question why crafting still exists anymore. It's sad to say, but I've lost my faith in this game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Back in the day this game used to be something special. After they removed the solos the game gets reworked after rework which is exhausting, and in my personal opinion it gets worse and worse.\n\nShame, because back in the day this game used to be an absolute banger.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I think the game is pretty fun, queue time is just abnormally long.\r\n\r\nThe sound design in this game feels like a mobile game, not the greatest, character designs are ok nothing super special, some characters stand out while others just feel pretty generic anime character.\r\n\r\nGameplay is personally where I think this game does best, it took some time to learn how to play the game, and some help from external sources like youtube videos and such but once you understand how to play the game, it can be a pretty fun little MOBA.\r\n\r\nThere's not enough players to find a game at a reasonable time, and for that I can't recommend the game. You WILL spend more time waiting in queue than playing the game, it's honestly not worth it for what the game is.\r\n\r\nEven with the game taking as long as it does, when you get in a match you either get stomped or it feels like everyone is a bot, teammates and enemies included.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Some first match you will fight a bot/ai player,then when you got a real match/play with real player...oh hell nah. I haven't that good in the game,and from all my experience playing this game is fighting Ai/bots, then you gave me an High tier veteran player who s spend a thousand hour to this game?  Are you kidding me? \n i think this game had SBMM (the same matchmaking system  in COD, this system is made you as new player meet the high tier/high KD player \"to learn the game \" they said lol) Because i'm pretty sure there s a new player in this game, even its just 10-20 players but in match there s no any single one that is a new player, everyone are High tier rank,even in rank  mode you will only meet a smurf account.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is dead on NA, even at peak time I can't start ranked and normal mode takes 5-10+ minutes for a game. Normal games are ridiculously unbalanced with typically one team bulldozing the others (they can't do skill based/ mmr norms because then no one will get to play) . This game has been out for half a decade from what I searched and has had bad player retention outside asia so don't expect a sudden burst of popularity anytime soon. Everyone is some font of a generic anime character so their silhouettes mesh resulting in poor accessibility. If you are coming from league this game is clunkier, there's this input lag that is very small but adds up with actions per minute (more similiar to Dota than League).  Character kits are one of the most cohesive I've seen in MOBA, and even if they are generic anime characters they all fullfill their character fantasy. No matter who you are you will find one character kit you adore. Very fun and unique gameplay locked behind a dead server for anyone not on Asia, a very bad looking UI (Why is Collection and Collectibles different UI options?), and clunkiness despite having some of the hardest (in a good way) character kits I have seen in the genre.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Calling it now, adding a verification system is gonna reduce the playerbase even more and possibly straight up remove the few players in non kr lobbies.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Eternal Return is a flaming dumpster fire of suffering — a goddamn migraine masquerading as a game. It throws you into a meat grinder of confusing bullshit where you spend ten minutes crafting garbage just to get obliterated in two seconds by some meta-addicted freak who’s been sweating in the queue since 2021. The matchmaking is a cosmic joke, the servers feel like they’re powered by a hamster on life support, and the UI looks like someone vomited Excel sheets all over your screen. Every match feels like punishment for even daring to exist, and every death leaves you wondering why the hell you wasted your time on this digital diarrhea of chaos. It’s not fun, it’s not fair, it’s just pure, unfiltered pain wrapped in a shiny layer of deceit.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wouldn't recommend this game as something someone can have fun in- BASELINE- unless you're already really skilled and knowledgeable in a MOBA game \n\nNormally, I wouldn't bring up skill but this game is trying to combine item building, battle royale, and MOBA all into one game. I'm Challenger in League so I can pilot the characters themselves pretty well, but its still not enough for me, so how the hell would someone else fare?\n\nThe learning curve is STILL so insanely steep with every thing else that exists in the game, and how things interact... on top of the fact that, as far as I know, the game has gotten multiple reworks and changes to queues. No idea if solo play is possible still.\n\nThen.. the nail in the coffin. The insanely high skill floor. Steep learning curve. Big barrier to entry. OK whatever. Let's say you play anyway. Congratulations you are now playing vs 20 Lebrons in your lobby that have hundreds upon thousands of hours in the game, and already know how the systems work. So you just kind of die.\n\nThis wasn't so bad when you could solo queue and just brute force with mechanical play.. but you see the point. It's a good game and I still find it fun, its just a shame its so held back by the smaller playerbase of the West, among other things.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The games NA servers are practically dead. I have currently sat in queue for 15 minutes and we got 2/24 players for a match in standard. This is kind of wild. Not sure what happened with it where no one is online or my match making is busted.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Finding games takes forever and the quality of games is rather low because of that. (EU Server)\r\nGenerally unbalanced normal game mm and ranked was 30min minimum queue time at peak hours last time i played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✧ This game has too many cheaters even there are map cheaters or shoichi swinging knife nonstop and then he alone then used a series of skills to kill the other 3 people in the blink of an eye.\n\n✧ The prices in the store are not reasonable very expensive in a sense.\n\n✧ Currently only the Korean server still has players, but the server response is very slow and greatly affects foreign players, like 100ms suddenly jumps to 200ms, if so the publisher should create this game for Korean players.\n\n✧ Teammates are jerks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matching system is a joke, teaming in plat is already make the rank tier inflation already. Trio to diamond is insane, the quality of the game is really bad. If you play good then you need to carry the other 2 player to win a 3v3 game. Hah funny system, same like league now, care about low elo, not actually tell them to be better is ask our high elo to carry them to make them look better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The abilities and feel of control is very similar to league which I like but the gameplay just is dumb. Don’t really care for the scavenging for items mechanic. Lost just from not speed running item components.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: its somewhat fun, but you basically lose interest after 15-20 matches.\r\n- 'bad-tier' DPS characters literally cannot compete with other DPS characters even under optimal conditions for their kit, despite being designed as DPS and having little to no support/tank attributes. There are basically some characters you should just never choose ever, even if you like their aesthetic. \r\n\r\n- The flow of the the match is poorly designed. Early game you basically do almost zero damage to anyone, so everyone just walks around and collects materials and basically ignores enemy teams. Late game, basically every team can reach full late-game items even when behind. At that point, the ONLY way to get better gear is to contest some of the rare spawns (Dr. Wickerline, Rifts), and even then some of the items you can build out of the rare drops are only marginally better, and only one person in your team will get to choose one marginally better item per event. There is only a small window in the MID GAME where a player that has been playing well has an equipment/level advantage over others.\r\nIt basically just comes down to which team has the most cracked characters, and how well they can stick together and click buttons on the correct enemy targets.\r\n\r\n- A lot of the characters start feeling very same-y after several matches. The character models tend to blend-in with each other and the environment because everything has a very similar color palette, and all the characters are roughly the same size. There is some decent variation in skills, but overall it doesn't feel like enough. Ult's don't feel very impactful/unique.\r\n\r\nOverall I think this game has a TON of potential, and it IS somewhat fun, but the design team needs to go back to the drawing board and find something that can make the game stand out from the others, something OTHER THAN just the fact that it is a BR-MOBA hybrid.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "way too unnecessarily complicated for a MOBA,\n\nand bots are everywhere\n\ndead game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every Character has only one optimized build which kills diversity. And don't expect balance. some characters simply dominate.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They say the game is free to play, that's cool right? But wht about when you start playing and there's all these characters you want to play that you don't have, you'll have to pay to be able to get those right? And as you play on, you find all these skins you like but you dont have, you also have to pay to get those as well. And they all cost a lot of money and to top it of they cost USD which makes them cost even more money. If you want everything for free you have to spend a lot of time on the game to be able to get good at the game and if you're not good at the game people will treat you very poorly, not want to play with you label you, say mean things to you, and if you're a girl its even even worst they're sexist towards you. 90% of the people are toxic as hell. Most of the people stop playing for this reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too horny for a guy like me. The first person you talk to in game is a hot teacher, Immediately turned  the game off.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no balance. if u play sup, teammate cant carry, then u go down, even rank points had bug and every new season will delete your loadout, if u play over 10 characters, u need make all loadout again, sad:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "steam forgot to tell me this was a PvP MOBA two things I HATE!!! \nno review it not the designers fault",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It takes to much time for searching match",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "คนเล่นน้อยหาห้องไม่เจอสักที",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Likes anime girls! but not like this game(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is high tier garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "played for 1 match that was enough",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "waste of my time!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuck around before launch because solos made this game stand out. Then they took it away, so I stopped playing. I was told that the \"Lone Wolf\" mode brought solos back, but when I tried to play in the few hours the game allows you to, there weren't enough players to fill a single game. And now they took Lone Wolf away. Fool me once, shame on you. Fool me twice, shame on me.\r\n\r\nI loved this game, and perhaps I'm being too harsh because I know what it once was. But looking at the changes since I've played, I would have a hard time recommending this game. There are way better MOBAs out there if you want to play with a team. I would say that ERBS has a stand-out feature in the crafting system, but between the reduction in item slots and gutting the food mechanic, one might question why crafting still exists anymore. It's sad to say, but I've lost my faith in this game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Back in the day this game used to be something special. After they removed the solos the game gets reworked after rework which is exhausting, and in my personal opinion it gets worse and worse.\n\nShame, because back in the day this game used to be an absolute banger.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I think the game is pretty fun, queue time is just abnormally long.\r\n\r\nThe sound design in this game feels like a mobile game, not the greatest, character designs are ok nothing super special, some characters stand out while others just feel pretty generic anime character.\r\n\r\nGameplay is personally where I think this game does best, it took some time to learn how to play the game, and some help from external sources like youtube videos and such but once you understand how to play the game, it can be a pretty fun little MOBA.\r\n\r\nThere's not enough players to find a game at a reasonable time, and for that I can't recommend the game. You WILL spend more time waiting in queue than playing the game, it's honestly not worth it for what the game is.\r\n\r\nEven with the game taking as long as it does, when you get in a match you either get stomped or it feels like everyone is a bot, teammates and enemies included.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Some first match you will fight a bot/ai player,then when you got a real match/play with real player...oh hell nah. I haven't that good in the game,and from all my experience playing this game is fighting Ai/bots, then you gave me an High tier veteran player who s spend a thousand hour to this game?  Are you kidding me? \n i think this game had SBMM (the same matchmaking system  in COD, this system is made you as new player meet the high tier/high KD player \"to learn the game \" they said lol) Because i'm pretty sure there s a new player in this game, even its just 10-20 players but in match there s no any single one that is a new player, everyone are High tier rank,even in rank  mode you will only meet a smurf account.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is dead on NA, even at peak time I can't start ranked and normal mode takes 5-10+ minutes for a game. Normal games are ridiculously unbalanced with typically one team bulldozing the others (they can't do skill based/ mmr norms because then no one will get to play) . This game has been out for half a decade from what I searched and has had bad player retention outside asia so don't expect a sudden burst of popularity anytime soon. Everyone is some font of a generic anime character so their silhouettes mesh resulting in poor accessibility. If you are coming from league this game is clunkier, there's this input lag that is very small but adds up with actions per minute (more similiar to Dota than League).  Character kits are one of the most cohesive I've seen in MOBA, and even if they are generic anime characters they all fullfill their character fantasy. No matter who you are you will find one character kit you adore. Very fun and unique gameplay locked behind a dead server for anyone not on Asia, a very bad looking UI (Why is Collection and Collectibles different UI options?), and clunkiness despite having some of the hardest (in a good way) character kits I have seen in the genre.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Calling it now, adding a verification system is gonna reduce the playerbase even more and possibly straight up remove the few players in non kr lobbies.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Eternal Return is a flaming dumpster fire of suffering — a goddamn migraine masquerading as a game. It throws you into a meat grinder of confusing bullshit where you spend ten minutes crafting garbage just to get obliterated in two seconds by some meta-addicted freak who’s been sweating in the queue since 2021. The matchmaking is a cosmic joke, the servers feel like they’re powered by a hamster on life support, and the UI looks like someone vomited Excel sheets all over your screen. Every match feels like punishment for even daring to exist, and every death leaves you wondering why the hell you wasted your time on this digital diarrhea of chaos. It’s not fun, it’s not fair, it’s just pure, unfiltered pain wrapped in a shiny layer of deceit.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wouldn't recommend this game as something someone can have fun in- BASELINE- unless you're already really skilled and knowledgeable in a MOBA game \n\nNormally, I wouldn't bring up skill but this game is trying to combine item building, battle royale, and MOBA all into one game. I'm Challenger in League so I can pilot the characters themselves pretty well, but its still not enough for me, so how the hell would someone else fare?\n\nThe learning curve is STILL so insanely steep with every thing else that exists in the game, and how things interact... on top of the fact that, as far as I know, the game has gotten multiple reworks and changes to queues. No idea if solo play is possible still.\n\nThen.. the nail in the coffin. The insanely high skill floor. Steep learning curve. Big barrier to entry. OK whatever. Let's say you play anyway. Congratulations you are now playing vs 20 Lebrons in your lobby that have hundreds upon thousands of hours in the game, and already know how the systems work. So you just kind of die.\n\nThis wasn't so bad when you could solo queue and just brute force with mechanical play.. but you see the point. It's a good game and I still find it fun, its just a shame its so held back by the smaller playerbase of the West, among other things.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The games NA servers are practically dead. I have currently sat in queue for 15 minutes and we got 2/24 players for a match in standard. This is kind of wild. Not sure what happened with it where no one is online or my match making is busted.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Finding games takes forever and the quality of games is rather low because of that. (EU Server)\r\nGenerally unbalanced normal game mm and ranked was 30min minimum queue time at peak hours last time i played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✧ This game has too many cheaters even there are map cheaters or shoichi swinging knife nonstop and then he alone then used a series of skills to kill the other 3 people in the blink of an eye.\n\n✧ The prices in the store are not reasonable very expensive in a sense.\n\n✧ Currently only the Korean server still has players, but the server response is very slow and greatly affects foreign players, like 100ms suddenly jumps to 200ms, if so the publisher should create this game for Korean players.\n\n✧ Teammates are jerks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matching system is a joke, teaming in plat is already make the rank tier inflation already. Trio to diamond is insane, the quality of the game is really bad. If you play good then you need to carry the other 2 player to win a 3v3 game. Hah funny system, same like league now, care about low elo, not actually tell them to be better is ask our high elo to carry them to make them look better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The abilities and feel of control is very similar to league which I like but the gameplay just is dumb. Don’t really care for the scavenging for items mechanic. Lost just from not speed running item components.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: its somewhat fun, but you basically lose interest after 15-20 matches.\r\n- 'bad-tier' DPS characters literally cannot compete with other DPS characters even under optimal conditions for their kit, despite being designed as DPS and having little to no support/tank attributes. There are basically some characters you should just never choose ever, even if you like their aesthetic. \r\n\r\n- The flow of the the match is poorly designed. Early game you basically do almost zero damage to anyone, so everyone just walks around and collects materials and basically ignores enemy teams. Late game, basically every team can reach full late-game items even when behind. At that point, the ONLY way to get better gear is to contest some of the rare spawns (Dr. Wickerline, Rifts), and even then some of the items you can build out of the rare drops are only marginally better, and only one person in your team will get to choose one marginally better item per event. There is only a small window in the MID GAME where a player that has been playing well has an equipment/level advantage over others.\r\nIt basically just comes down to which team has the most cracked characters, and how well they can stick together and click buttons on the correct enemy targets.\r\n\r\n- A lot of the characters start feeling very same-y after several matches. The character models tend to blend-in with each other and the environment because everything has a very similar color palette, and all the characters are roughly the same size. There is some decent variation in skills, but overall it doesn't feel like enough. Ult's don't feel very impactful/unique.\r\n\r\nOverall I think this game has a TON of potential, and it IS somewhat fun, but the design team needs to go back to the drawing board and find something that can make the game stand out from the others, something OTHER THAN just the fact that it is a BR-MOBA hybrid.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "way too unnecessarily complicated for a MOBA,\n\nand bots are everywhere\n\ndead game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every Character has only one optimized build which kills diversity. And don't expect balance. some characters simply dominate.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They say the game is free to play, that's cool right? But wht about when you start playing and there's all these characters you want to play that you don't have, you'll have to pay to be able to get those right? And as you play on, you find all these skins you like but you dont have, you also have to pay to get those as well. And they all cost a lot of money and to top it of they cost USD which makes them cost even more money. If you want everything for free you have to spend a lot of time on the game to be able to get good at the game and if you're not good at the game people will treat you very poorly, not want to play with you label you, say mean things to you, and if you're a girl its even even worst they're sexist towards you. 90% of the people are toxic as hell. Most of the people stop playing for this reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too horny for a guy like me. The first person you talk to in game is a hot teacher, Immediately turned  the game off.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no balance. if u play sup, teammate cant carry, then u go down, even rank points had bug and every new season will delete your loadout, if u play over 10 characters, u need make all loadout again, sad:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "steam forgot to tell me this was a PvP MOBA two things I HATE!!! \nno review it not the designers fault",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It takes to much time for searching match",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "คนเล่นน้อยหาห้องไม่เจอสักที",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Likes anime girls! but not like this game(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is high tier garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "played for 1 match that was enough",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "waste of my time!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuck around before launch because solos made this game stand out. Then they took it away, so I stopped playing. I was told that the \"Lone Wolf\" mode brought solos back, but when I tried to play in the few hours the game allows you to, there weren't enough players to fill a single game. And now they took Lone Wolf away. Fool me once, shame on you. Fool me twice, shame on me.\r\n\r\nI loved this game, and perhaps I'm being too harsh because I know what it once was. But looking at the changes since I've played, I would have a hard time recommending this game. There are way better MOBAs out there if you want to play with a team. I would say that ERBS has a stand-out feature in the crafting system, but between the reduction in item slots and gutting the food mechanic, one might question why crafting still exists anymore. It's sad to say, but I've lost my faith in this game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Back in the day this game used to be something special. After they removed the solos the game gets reworked after rework which is exhausting, and in my personal opinion it gets worse and worse.\n\nShame, because back in the day this game used to be an absolute banger.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I think the game is pretty fun, queue time is just abnormally long.\r\n\r\nThe sound design in this game feels like a mobile game, not the greatest, character designs are ok nothing super special, some characters stand out while others just feel pretty generic anime character.\r\n\r\nGameplay is personally where I think this game does best, it took some time to learn how to play the game, and some help from external sources like youtube videos and such but once you understand how to play the game, it can be a pretty fun little MOBA.\r\n\r\nThere's not enough players to find a game at a reasonable time, and for that I can't recommend the game. You WILL spend more time waiting in queue than playing the game, it's honestly not worth it for what the game is.\r\n\r\nEven with the game taking as long as it does, when you get in a match you either get stomped or it feels like everyone is a bot, teammates and enemies included.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Some first match you will fight a bot/ai player,then when you got a real match/play with real player...oh hell nah. I haven't that good in the game,and from all my experience playing this game is fighting Ai/bots, then you gave me an High tier veteran player who s spend a thousand hour to this game?  Are you kidding me? \n i think this game had SBMM (the same matchmaking system  in COD, this system is made you as new player meet the high tier/high KD player \"to learn the game \" they said lol) Because i'm pretty sure there s a new player in this game, even its just 10-20 players but in match there s no any single one that is a new player, everyone are High tier rank,even in rank  mode you will only meet a smurf account.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is dead on NA, even at peak time I can't start ranked and normal mode takes 5-10+ minutes for a game. Normal games are ridiculously unbalanced with typically one team bulldozing the others (they can't do skill based/ mmr norms because then no one will get to play) . This game has been out for half a decade from what I searched and has had bad player retention outside asia so don't expect a sudden burst of popularity anytime soon. Everyone is some font of a generic anime character so their silhouettes mesh resulting in poor accessibility. If you are coming from league this game is clunkier, there's this input lag that is very small but adds up with actions per minute (more similiar to Dota than League).  Character kits are one of the most cohesive I've seen in MOBA, and even if they are generic anime characters they all fullfill their character fantasy. No matter who you are you will find one character kit you adore. Very fun and unique gameplay locked behind a dead server for anyone not on Asia, a very bad looking UI (Why is Collection and Collectibles different UI options?), and clunkiness despite having some of the hardest (in a good way) character kits I have seen in the genre.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Calling it now, adding a verification system is gonna reduce the playerbase even more and possibly straight up remove the few players in non kr lobbies.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Eternal Return is a flaming dumpster fire of suffering — a goddamn migraine masquerading as a game. It throws you into a meat grinder of confusing bullshit where you spend ten minutes crafting garbage just to get obliterated in two seconds by some meta-addicted freak who’s been sweating in the queue since 2021. The matchmaking is a cosmic joke, the servers feel like they’re powered by a hamster on life support, and the UI looks like someone vomited Excel sheets all over your screen. Every match feels like punishment for even daring to exist, and every death leaves you wondering why the hell you wasted your time on this digital diarrhea of chaos. It’s not fun, it’s not fair, it’s just pure, unfiltered pain wrapped in a shiny layer of deceit.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wouldn't recommend this game as something someone can have fun in- BASELINE- unless you're already really skilled and knowledgeable in a MOBA game \n\nNormally, I wouldn't bring up skill but this game is trying to combine item building, battle royale, and MOBA all into one game. I'm Challenger in League so I can pilot the characters themselves pretty well, but its still not enough for me, so how the hell would someone else fare?\n\nThe learning curve is STILL so insanely steep with every thing else that exists in the game, and how things interact... on top of the fact that, as far as I know, the game has gotten multiple reworks and changes to queues. No idea if solo play is possible still.\n\nThen.. the nail in the coffin. The insanely high skill floor. Steep learning curve. Big barrier to entry. OK whatever. Let's say you play anyway. Congratulations you are now playing vs 20 Lebrons in your lobby that have hundreds upon thousands of hours in the game, and already know how the systems work. So you just kind of die.\n\nThis wasn't so bad when you could solo queue and just brute force with mechanical play.. but you see the point. It's a good game and I still find it fun, its just a shame its so held back by the smaller playerbase of the West, among other things.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The games NA servers are practically dead. I have currently sat in queue for 15 minutes and we got 2/24 players for a match in standard. This is kind of wild. Not sure what happened with it where no one is online or my match making is busted.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Finding games takes forever and the quality of games is rather low because of that. (EU Server)\r\nGenerally unbalanced normal game mm and ranked was 30min minimum queue time at peak hours last time i played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✧ This game has too many cheaters even there are map cheaters or shoichi swinging knife nonstop and then he alone then used a series of skills to kill the other 3 people in the blink of an eye.\n\n✧ The prices in the store are not reasonable very expensive in a sense.\n\n✧ Currently only the Korean server still has players, but the server response is very slow and greatly affects foreign players, like 100ms suddenly jumps to 200ms, if so the publisher should create this game for Korean players.\n\n✧ Teammates are jerks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matching system is a joke, teaming in plat is already make the rank tier inflation already. Trio to diamond is insane, the quality of the game is really bad. If you play good then you need to carry the other 2 player to win a 3v3 game. Hah funny system, same like league now, care about low elo, not actually tell them to be better is ask our high elo to carry them to make them look better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The abilities and feel of control is very similar to league which I like but the gameplay just is dumb. Don’t really care for the scavenging for items mechanic. Lost just from not speed running item components.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}