{
  "positive": [
    {
      "review": "One of the best 2D platformer I have ever played. Loved everything about this packed with action-adventure gameplay, beautiful music, gorgeous art/visuals and amazing story-telling. Truly phenomenal.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "The smoothest movement mechanics I have ever seen in a game. If you like games like Hollow Knight, you'll like this.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A masterpiece metroidvania which takes everything that made Part 1 special and expands it with more confidence and ambition. The world feels larger, more alive, and more fluid than ever before - every area bursting with detail and color.\n\nAnd the best thing is, on top of demanding platforming, Ori now got real combat and it's fun and dynamic; the new abilities make exploration feel constantly fresh, the movement is just amazing.\n\nI can play this over and over again. Perfect on Steam Deck.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I sat on this game in early 2021, and have only started playing this game about maybe a week ago. I have never been so mad that I sat on a game this long. From the story line to the atmosphere and soundtrack, this game is an masterpiece. The love that was put into this game made it so enjoyable to play. I couldn't recommend this game more. This game is for anyone who truly loves puzzles, exploration, and some beautiful scenery",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "**Ori and the Will of the Wisps – A Near-Perfect Masterpiece (10/10)**\n\nI just finished my second playthrough of *Ori and the Will of the Wisps* and I’m still in awe. Everything about this game feels like it was crafted with pure love.\n\nFrom the very first moment, the visuals absolutely floor you. The hand-painted art style is breathtaking — every layer of parallax, every glowing particle, every blade of grass swaying in the wind looks like a living painting. When you sprint across the glowing sands of the Wellspring or glide through the midnight-blue depths of Luma Pools with the water effects rippling around Ori, it’s genuinely jaw-dropping. This is one of the most beautiful games ever made, period.\n\nThe soundtrack? Moon Studios somehow topped the already legendary *Blind Forest* score. Gareth Coker’s music swells and crashes with your emotions — gentle piano in quiet moments, thunderous orchestral bursts during escapes, heartbreaking strings when the story hits you right in the chest. I still get chills every single time “A Stirring from the Ruins” kicks in.\n\nGameplay is buttery smooth and endlessly satisfying. The movement upgrades feel amazing — triple jump, bash, dash, burrow, glide, grapple… everything flows together so naturally that by the end you’re chaining abilities like a speedrunner even if you’re just playing casually. Combat is weighty and fun (the new spirit weapons feel great), and the chase sequences are some of the most intense, perfectly paced moments in any platformer ever.\n\nAnd the story… oh man. Without spoiling anything, *Will of the Wisps* takes the simple fairy-tale vibe of the first game and gives it real emotional weight. The new characters (especially Ku and the supporting cast) are so endearing, and the ending left me quietly crying in the best way possible. It’s rare for a game to make me care this much about little glowing forest spirits.\n\nYes, there were a few minor launch bugs back in 2020, but on modern hardware (Xbox Series X, PC, or Switch now) it runs flawlessly. If you love Metroidvanias, platformers, beautiful art, or just games that respect your emotions, you owe it to yourself to play *Ori and the Will of the Wisps*. It’s not just one of the best Xbox exclusives — it’s one of the best games of the entire generation.\n\nPlay it. Cry a little. Fall in love. Then immediately start it again on Hard mode like I did. ✨",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I just beat this, after getting it to test out a few new displays (I heard this game has great HDR impact.)  I can't believe this game is so good...holy cow.  If the devs ever see this...thank you for your' work.  I was shockingly moved through the game...the themes are more touching than they have a right to be.  The gameplay is outrageously fun.  This is about as \"fun\" as a game can be to play.  Getting around is just spectacular by the end of the game.  This should be a MUST play for anybody.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "A rock-solid followup. The devs really nailed the visual polish—every scene element has smooth, detailed animations that make the world feel lively, and the extra layering gives the whole game a stronger sense of depth. There are also a lot of smart quality-of-life touches that other Metroidvania-style games should definitely learn from: the death penalty isn’t excessive, there’s no pointless grind or “trash time” and the speedrun challenges are super efficient to retry. Mess up? Boom—instant restart. And when you finish a run, it sends u right back to the starting point eliminating unnecessary waiting or backtracking. Plus, all hidden items can be collected before finishing the game, so you never get permanently locked out just becuz the story moved forward.\n[b]Downsides:[/b] Map opens with an awkward lag and doesn’t remember ur zoom level. The pacing falls off right before the end—there’s one brutally hard area that completely breaks the flow. New soundtrack doesn’t have any standout tracks, mainstory is pretty forgettable, and the guidance toward new areas is really unclear.\n[hr][/hr]\n[h3]Reviews: 7/10[/h3]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ori and the Will of the Wisps is a beautiful and emotional adventure platformer that improves on everything from the first game. The world is stunning, the music is powerful, and the story is touching. The platforming feels smooth and responsive, and the combat is much better than before. It’s challenging but rewarding, and every moment feels meaningful.\n\nOverall, it’s a fantastic game that is visually breathtaking and emotionally unforgettable. Highly recommended. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This was a perfect game. I can't think of a single thing I would improve. The artork is beautiful, the combat is fast, snappy and the hits have weight to them. The story is simple but moving. The progression is seamless. The character even feels \"whispy\" with the quick, sometimes teleporty-snapping whipping movements around the screen. It's all so fluid. 10/10 game. It took me about 20 hours and I got most of the things (didn't collect all the money spirits or buy all the skills).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game, It is beautiful to look at, the art style is timeless, this is the second time I 100% it, and my biased opinion is: masterpiece 9/10 (sorry but the willow's end is shit, really annoying and frustrating, same goes for Srhiek)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Never thought I'd play a game and end up in tears. This is not just a game, but a full experience in the world or Ori.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great metroidvania, super satisfying movement, and the plot and music were great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great music\r\nVisual feast\r\nFull of action & adventure\r\n\r\nAnd most important \"MUSIC\"\r\nLoved this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a rare masterpiece here I am gaming for more than 20 years and and it is very very VERY rare to find such gem. Beautiful story, perfect game playe all is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing - absolutely unique and beautiful experience \n\nNo other words 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll go over the negatives first:\nThe grapple mechanics are annoying and inconsistent, especially during the water wheel part.\nSometimes the characters would randomly start violently shaking\nAnd some of the achievements (notably Immortal) are ridiculously hard without cheesing it somehow, and even then it's frustrating to obtain.\n\nNow as for the pros:\nAmazing story, ending nearly made me cry.\nThe art and graphics are just phenomenal, it feels like every inch of the game has so much life breathed into it.\nThe music and SFX are amazing and blends in with the rest of the game so well.\nThe movement is silky smooth, and the progression is great. By the end of it, it really feels like you can glide through every zone with ease, and yet it still manages to put roadblocks and challenges in front of you while having the entire game open for exploration.\nIt feels like a product of genuine passion, and it's beautiful.\n\nI'm aware this is meant to be a prequel to Ori and the Blind Forest, but I haven't played that game since it's releasee and can't remember much about it, so I can't comment on how well it ties in. Even so, I only bought this game because I remembered how much I enjoyed the previous one, even if it was years ago, and this game not only held up to my high expectations, but exceeded them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! I had a lot of fun playing it. The graphics are also beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The absolute best game I've played ever. The story is so engaging and the combat is so satisfying to play around with.\nThe ending had me bawling my eyes out and mouth dropped to the floor for a solid 10 minutes.\nI would give my life for a third Ori game, the best series of gaming history.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried the first game and it wasn't for me, read about the second and decided to try it. I'm glad I did cause I really enjoyed it.\n\nIt's a fun metroidvania type game with lots of different mobility, and lots of freedom to use it to go where you want.\n\nThey tried to do a lot with this game, and sometimes the movement system gets cluttered, which can be very annoying. The bosses weren't great design, and the last phase of the final boss fight was horribly designed: low visibility, massive RNG elements, and really poor hitboxes. Since it's the last thing you do in the game, it did leave a bad taste in my mouth for an otherwise very enjoyable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The sequel to Ori and The Blind Forest.   \nHaven't played it?  What are you waiting for?  Go play it then come back and buy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ori and the Will of the Wisps eschews its predecessor's fondness for loneliness and some of its mechanical uniqueness for a focus on community and more conventional gameplay mechanics. While a great demonstration of game development learnings and offering up a more realized vision of the world, I cannot help but feel like this game takes on a number of elements from other Metroidvania games in a way that homogenizes the experience.\n\nAs someone who grew to love the isolatory experience of Ori and the Blind Forest, I initially had difficulty getting into Will of the Wisps and dropped the game for a week; I did care about NPCs, side-quests, a currency system, or a slightly deeper focus on combat! However, I wanted to learn why it made these changes. There are some additions made in Will of the Wisps to address critiques of the first game (namely, combat) while other changes were tonal in nature and heighten the climactic narrative scenes that became more of a focus.\n\nSpeed trials are a welcome addition to the game; they offer the player a substantial though not insurmountable challenge to demonstrate their learning of the game's myriad movement abilities. While combat was given more of a focus in Will of the Wisps, it did not get substantially more deep. Weapons and tools you can acquire are generally inferior to the movement abilities you have (with the exception of deeply powerful skill and accessory combination), and they ended up feeling more like accessories to sequence breaking than anything else in my playthrough. A shuriken felt ineffectual in combat yet vital in sniping doors or switches from beyond Ori's normal reach. This game's boss fights felt forgetful with the exception of two shortlived sequences that happen as a part of the fights. Combat trials were boring at best and a slog at worst.\n\nBut at its core, Ori and the Will of the Wisps remains a truly gorgeous game with a heavy focus on exploration. Both Ori games excel at distributing pick-ups in the Metroidvania genre, and Ori's signature Bash skill is an intuitive and powerful ability that makes the duology stand out. It is a series with two games that offer similar but distinct takes on what a Metroidvania game can be.\n\nI am glad I gave Ori and the Will of the Wisps a second chance. It is a deeply beautiful experience that I can easily recommend to anyone of the genre, even if I still very much prefer the things its predecessor did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a beautiful game. I would argue it transcends that and becomes an experience. This is the only game the story ever made me shed a tear. It played wonderfully, the music was a joy, and the story tugged on my heart strings. The ending got me. I experienced one bug during a boss fight where I got stuck in a wall, but I'll take that as the price for this sincerely moving game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "any minor complaints i had about the first game are mostly fixed, and everything that made the first game so special is made even better. beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is way more polished, with improved visuals, combat and movement. It's got almost none of the faults that I had with the first game. Overall just a completely better experience and I can't wait to finish it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am not even done the game, and I can confidently say that this is a fantastically animated, beautifully written, and challenging but fair game. One of the best Metroidvania games I've ever played, truly fantastic, and quite an improvement on the already very good first game. I'm really hoping for a third game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game. The best of its genre probably. Very fluid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My feelings on the game are a bit mixed. Generally speaking it's a good game. It's enjoyable for the most part. HOWEVER\n\nFirst and foremost, there are a lot of things that were improved on:\n- more and varying enemies\n- improved area details\n- more content\n- improved graphics\n- incredibly beautiful music\n- world feels much more alive \n\nHOWEVER, here are my nitpicks:\n- WAY too many abilities (my controller buddies will understand that one)\n- parasitic game design with the abilities \n- puzzles are less creative than from the predecessor\n- story is alright, however it feels like a downgrade from the story of the predecessor and doesn't make a whole lot of sense at certain points\n\nAt times it feels like the game is an Ori game in name alone. I REALLY liked the first game for what it made different from most games. I don't really understand why Ori needed weapons in this game? Especially since they feel a bit off for a character like Ori. \nSure, Sein existed in the predecessor. Which you could technically count as a weapon. And certainly the first game had a lot of different ways to engage with enemies (stomp, throwing them into thorns, throwing glowing balls at them, throwing their own projectiles back, etc.). Perhaps I'm just thrown off that Ori was given swords, a giant frying pan, bows, spears, etc. in this game. Might just be me tho.\nThe sheer amount of different trees that can be found throughout the game make the trees much less special to find over time.\nI remember playing blind forest for the first time and getting very excited for every tree I found. In \"Will of the Wisps\" finding trees does get tiring after a while due to the sheer oversaturation of them (not to mention all the other stuff you can find, like shards). \n\nI kind of wish that Ku would've played a bigger role/would've been playable for longer. \n\nAt times it feels like the devs tried making a different game, but had to use the Ori IP for it (That's just my tinfoil hat theory tho, lmao)\n\nIf you expect puzzles like in \"blind forest\", this is not really the game for you. Stick with the first game.\nThis game focusses much more on combat and for that it's well done. The bosses are challenging and enjoyable (My favorite is Mora). Less abilities or a different way to implement them all would've been preferred from my point of view.\nIf you want a lot of bosses, play the Hollow Knight series instead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ori and the Will of the Wisps — A Breathtaking Journey of Light and Emotion\n\nOri and the Will of the Wisps invites players into a beautifully crafted world filled with wonder, danger, and heartfelt storytelling. From the very first moments, the game showcases a vibrant, hand-painted art style and emotional depth that elevate its platforming adventure into something truly unforgettable.\n\nThe game excels in its fluid movement and refined gameplay. Ori’s expanded abilities make traversal smooth, responsive, and deeply satisfying. Whether you’re dashing through forests, gliding across windswept plains, or navigating intricate platforming challenges, every moment feels buttery smooth and expertly designed.\n\nCombat has been significantly enhanced. A new suite of weapons and abilities adds depth and strategy, making encounters dynamic and rewarding. From fast-paced battles to clever ability combinations, the system offers a welcome layer of complexity without overwhelming players.\n\nExploration and progression are deeply rewarding. The interconnected world encourages curiosity, offering hidden secrets, side quests, and upgrades that enrich the journey. Each new area feels distinct, beautifully animated, and filled with environmental storytelling that draws you deeper into the world’s lore.\n\nVisually and musically, the game is a masterpiece. The stunning art direction, expressive animations, and emotional soundtrack by Gareth Coker create an atmosphere that is both magical and affecting. Every moment—peaceful or intense—is elevated by the game’s impeccable presentation.\n\n[h3]Final Verdict:[/h3]\nOri and the Will of the Wisps is a breathtaking and emotionally resonant masterpiece. With its polished gameplay, gorgeous visuals, and powerful storytelling, it stands among the best platformers ever made. A must-play for fans of world-class 2D adventure.\n\n“A stunning blend of beauty, emotion, and masterful design—an unforgettable experience from start to finish.”\n\nOverall Rating: ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐ 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First playthrough review time.\n\nThis game continues the style of the first one, with smooth platforming and a clear layout. The level design, graphics and gameplay are nice, and each area has different hazards to watch out for. I played both games with a keyboard and mouse, and the controls work well enough for the movements the game asks for.\n\nThe early parts are simple, mainly teaching basic actions. As the game goes on, the paths get more complex and the obstacles become trickier. Some sections rely on quick input, while others need steady timing to avoid mistakes. The difficulty rises at a steady pace, so the progress through the areas stays manageable.\n\nOverall, the game is focused on movement, timing, and careful navigation. The game demands timing and focus in every sections.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A masterpiece, very fluid movements, graphics looks absolutely amazing. One of the best Metroidvania imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is nothing short of AMAZING! The game play is great, the graphics are stunning, the colors are beautiful and the storyline is touching. I wish this game would get more recognition because it is a phenomenal game. I was a little skeptical at first because I the trailers don't show much fighting, mostly just platforming but there is a ton of fighting and, of course, also platforming. Enemies are tough and challenging. The levels are very well made with secret areas that are rewarding to find. This is a 10/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]Ori and the Will of the Wisps[/i] is a masterwork. The game takes everything that made its predecessor great and enhances it, while adding new mechanics that greatly improve gameplay and expand the Ori universe.\n\nIn continuation from its predecessor, the game's visuals, lighting, and audio are as stunning as ever, and character movement and combat are fast and fluid. Worldbuilding extends upon what already exists in the Ori universe, with unique locations such as the coastal and colorful Luma Pools, the dark and scary spider's nest of Mouldwood, the cold and beautiful snowcapped Baur's Peak, and the sandy and desolate Windswept Wastes, all of which center around a magnificent Spirit Willow.\n\nOri's skill kit is greatly enhanced with a variety of weapons to keep enemies at bay and other utilities to aid mobility and survival, allowing for greater variety in the character's build. The environment itself presents new mechanics as well, from bubbles that can be redirected with a gust of wind to sand that can be burrowed through. There are also new monsters and environmental hazards to encounter, extending upon the Ori universe's biodiversity and danger.\n\nOne standout feature the game provides that its predecessor does not is boss fighting, pushing the Ori universe's biodiversity and danger even further. Additionally, boss fights add more variety to completing quests when chase scenes used to define quest resolution. All boss fights serve importance to the story in both heartwarming and heartbreaking ways.\n\nAnd the soundtrack? Gareth Coker takes his music to the next level and surpasses even his amazing soundtrack for the game's predecessor. His music breathes life into every corner of the Ori universe, from environmental tracks, to chase scenes, to boss fights, to every uplifting and heartbreaking moment. His composition and arrangement of percussion, strings, woodwinds, brass, and vocals never cease to amaze and are quintessentially \"Ori\".\n\n[i]Ori and the Will of the Wisps[/i] is truly a masterwork. Are you ready to go on a moving journey and embrace the light?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Smooth movement, smooth gameplay, amazing animations and OUTSTANDING Graphics. There's nothing wrong about this game... Every aspects of what makes a game a game is executed perfectly here.\r\nA huge CONGRATS for the people that made this ONE OF A KIND GAME.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great art style, great story, GREAT gameplay, OUTSTANDING MUSIC!! what more do you want?! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far I’m loving this game. It is running great on my steam deck too. I’m drawn to games I can pick up and put down quickly due to my busy lifestyle and this one is fitting the bill nicely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m so glad my best friend introduced me to this game! Incredibly beautiful and immersive ^^ highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best metroid-venias out there. The visuals and sound of tha game are so uniquie you owe it to yourself to try it just because there is nothing else quite like it. I recomment playing the first one first and than this one to apreciate the progress that the developers have made and for story reasons. The experiences and emotions while playing this game make it stand out as one of my favourites of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved the first Ori, it is one of my favorite metroidvanias. This one is even better, by a lot. So much new stuff added. Great story. Everything is there. Most probably my favorite metroidvanias of all time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great improvement on the first game. I like silksong more, but this is a solid metroidvania. Theres alot more powers/movement stuff than the first game which i like quite a bit. More boss battles and you fight with a sword-like weapon rather than the orb of the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really awesome game. I loved the mix of blind forest and a little bit of hollow knight. You don't often get cute story games in the metroidvania genre so this was really awesome to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have no words. Every single complaint that I had in the first game has been addressed. This is a truly beautiful game and you won't regret playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So cute and such a good story!  I actually liked this one better than the first Ori (which shocked me too!).  If you don't have Ori and the Blind Forest, I would recommend playing it first so you get the whole story.  :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I have ever played. Amazing gameplay, music and story. This game made both me and my gf cry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun platformer/metroidvania with just a few glitches and a decent although predictable story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best games ever released.  Heartfelt story, great platforming, stellar combat, great level progression/area unlocks, beautiful visuals, amazing score, the works.  About as close to a perfect game as you can get.  The level of polish really blows my mind.  The difficulty is balanced, especially with bosses, so while they are challenging it never feels unfair.  Exploration feels fun, and you have all the QoL perks like fast travel so it's never a chore.\n\n I can't think of a single thing I would change, objectively, to improve the experience.  12/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just finished it on my switch and I cannot recommend enough, a masterpiece with another white little guy 🩷",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is easier in the respect of game control and jump-jump-fun (platform jumping) then the previously Ori and the Blind Forest. But it offers more diverse graphic and interactive experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No começo me incomodei um pouco por parecer ter perdido algumas mecânicas que já eram básicas no primeiro jogo, mas retomar elas é legal e parte da jornada. Esse jogo também brilha pela trilha sonora extremamente boa e em momentos certos, além de continuar lindissimo. Tem chefes, vários personagens e algumas mecânicas diferentes também. Uma história emocionante",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Insane graphics, great story, and perfect to lighten up your day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a wonderful and beautiful game. It's really hard though. I wish you could adjust the difficulty during the game without having to start a whole new game. Some of the chase sequences were obnoxiously difficult to do, especially with no mid-part saves. But overall, I still really enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. True masterpiece. Great gameplay, visuals and music.  \nQuite difficult for kids, but my 10 YO daughter eventually learned the controls and finished the game. \nI agree with others, there were tears at the end. One of the most beautiful games I have ever seen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the greatest sequels of all time. I love Blind Forest a lot, but Wisps is truly a labor of love in taking everything Blind Forest did & expanding on it, adding to it, & perfecting it. The combat & movement alone are massively improved from the first game with vastly more variety & fluidity. The visuals & music are probably some of the best out there in the genre. Well worth a pickup any day of the week.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not only this game is goregeous but its music also brings the final touch to this fantastic universe that Ori and the will of the wisps has.\r\nThe bossfights and the chases are all astonishing and again the music added to all that makes the gameplay literal cinema.\r\nThe story is ok but it's not the game's biggest strength.\r\nIt has a solid 12hrs of gameplay  and a lot of playstyles.\r\n10/10 gameplay,\r\n10/10 music,\r\nFantastic game,\r\nMust try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good graphics, a lot of areas, very great music and the story made me cry. The third best metroidvania, behind Hollow Knight and Silksong!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s so hard… but it’s really pretty.\nI do wanna know what’s going on in the story, but the difficulty is kinda killing my curiosity lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if the 1st game was the most beautyful game ive ever played this is the most beautyful game ive ever played squared",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As of writing this, I feel incredibly distressed after finishing the game. Several hours later my throat occasionally gets that lump because of the story. If you are prepared to open your heart and put yourself there, you will most likely get punched in the gut. The gameplay is incredibly smooth, even on MnK (I can't handle controls for Xbox due to having a Playstation controller), secrets feel very fun to get, the progression felt very fair and quite fun to do. As you progress, the new areas offer a variety of different challenges that encourage different playstyles, similarly to the first game but much more in depth. As for what they are, I highly recommend finding out yourself. The world building feels incredibly alive, like actually alive. That, is also something to check out for yourself(Tip: Make sure to take care in what NPC's say to you!)\n\nOverall, considering current market prices, this game honestly is worth the money if you can get it. And as someone who just recently beat the game please take great caution in the speed of which you play. Slow it down and digest the gameplay as much as you can otherwise coming back to it will be difficult if you are emotionally sensitive like me. \n\n10/10 for me personally, but could be different for others. Anyway, I'm going to... find some way to quench the lump in my throat...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of the most beautiful games I've ever played, with an amazing sound track to back it.  The movement is fluid and combat is very enjoyable.  It's easy to get around the map and it doesn't feel very locked from the start, unlike most metroids.  The price is a bit steep so I'd wait for a sale first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10. Story, gameplay, visuals. Story. \n\nBring tissues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Worth checking out ! Great Graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing graphics big map clean movement fun/challenging and genuinely amazing story in every way id put this the third best behind silksong and hollow knight the first game was good but this game is just what you will consider peak so im gonna say it out i recommend this game to people who love story gameplay and graphics plus not to bad of a price to get this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Work of art. Beautiful game with lots of great movement options that feel very fluid. Definitely recommend playing in hard mode if you're used to this type of game, otherwise it might feel a bit too short.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not only were the most prevalent flaws fixed from The Blind Forest, there are so many new features that this feels like a fan project more than the official thing. There are so many hidden details that I wouldn't be surprised a whole separate team worked on each area as if it was their own game. This does require much more skill than The Blind Forest, but it's much more satisfying because of it. The story and graphics, the 2 most honed-in parts, are of course exceptional, no questions asked.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a beautiful masterpiece this game is. Solid gameplay, excellently designed levels to leverage all your power ups, stunning art, a great soundtrack, and a touching storyline.\n\nThis is a major improvement over Ori and the Blind Forest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing, gorgeous, and heartfelt story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game, much better then the first one. Finished 100%, it was fun to gather everything.\r\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still have no idea how they can make a game this smooth and pretty.\nAn excellent game all around, and with a bitter sweet ending, I'm content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The [b]soundtrack is absolutely marvelous[/b] for an indie game, perfectly capturing the atmosphere and enhancing every moment of exploration. However, I don’t think it should be defined as a true [b]Metroidvania[/b]. While it incorporates the familiar elements of the genre—such as backtracking, new abilities, and interconnected map design—the overall experience feels more guided and forgiving. The difficulty is noticeably easy, with most encounters and puzzles offering little resistance compared to classic Metroidvania games.\n\nStill, it’s an enchanting and emotional journey that shines more through its [b]art direction, music, and atmosphere[/b] than its challenge or depth of gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Replayed Ori and the Will of the Wisps. Highly benefitted from a second look because my first playthrough i wasnt in a great headspace and felt like i just had to get through the game and it felt highly derivative of games like Hollow Knight.\n\nSecond playthrough I really connected with it. Its way easier than some of the other metroidvanias, but that might be me being fresh off Silksong who is determined to mash your face into the ground until you choke and scream at you \"are you crying yet?!\" I wouldn't call it \"easy\" compared to games as a whole, its hard, but its not punishing. It doesnt use the bench/bonfire system its got a quicksave function so deaths set you back like a few feet allowing you to immediately retry challenges.\n\nFor a metroidvania its really lacking in the bossfight department. There's two really early ones that sort of set the stage and get me excited for a boss centric design.. but there's only a total of 5 true boss fights in the game. Ori and the Blind Forest was more set on chase sequences. The best part of both Ori's is the movement. Its a joy to move around in these games and Will of the Wisps builds on Blind Forest's frantic and fast paced movement. So its cool to see them lean into that with more chase sequences.\n\nI do wish it was longer, I wish it had more stuff to do and more areas as the story and side quests fit nicely and neatly within each other. Again this might be a side effect of just played silksong, which was for me about 72 hours to 100% the game plus a few things that dont count as percentage that I still havent done. Ori WotW is an easy 16 hour 100% on Normal.\n\nI would recommend playing both as the story is well presented and well told. You'll be lost at the beginning of the second one without playing the first, and I think the first one leans into its own strengths more, where the second kinda borrows mechanics from other metroidvanias, builds it on the fluid movement of the first, and that's where it really finds its stride.\n\nAll said, I highly recommend, 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic, simple as.\n\nI don't even like platformers much and this was still a great enough time that I beat it to completion 4 times with all achievements.\n\nRecommended for all.\n\nDo yourself a favor and DON'T play on Hard difficulty on your first playthrough like I did.  You'll have much more fun on Normal the first time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A worthy sequel that triumphs over it's predecessor, the artstyle is somehow even more beautiful than in the first game, the combat is more fleshed out with quite a few weapon options, the world is bigger and more full of life, with various npcs to chat with and a whole quest system to boot, there are a few new enemies to fight against mainly the various Gorleks who look pretty cool, the villain is another giant owl but this time looks awesome and really menacing, there is some bonus content like the races and arenas to go complete, and they finally added 6 boss fights, they're not amazing and some have a few issues with them but they're serviceable.\r\n\r\nMy biggest critisicm would be that the difficulty settings are just dumb, (mainly looking at hard mode) all they do is just increase or decrease enemy and boss health and damage and the prices of stuff at shops which just feels like a pointless addition, if all a \"hard mode\" does in a game is make enemies take longer to kill and grinding money more tedious then what's even the point, (also the last phase of the final boss is horrible on hard mode just look it up for yourself)\r\n\r\n7/10 it's a direct upgrade from the first game that I would wholeheartedly recommend playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ori and the Will of the Wisps is a pleasant romp of a Metroidvania. It's on the easy side, but the flow and speed of the platforming was a breath of fresh air coming from Silksong.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pure Art \r\nAmazing music that gives you goosebumps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you thought the first game was perfect, they managed to make an even better one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing graphics and really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had this in my backlog for 4 years and wow man what a fantastic game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. Top tier metroidvania. 100% only takes 10 ish hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the most beautiful 2D platformers ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, fast paced and fluid traversal and combat.\r\nGood unlocking.\r\nStory is beautiful.\r\nGraphics are beautiful.\r\nNot sure what else it could've done. The abilities in this game are insane compared to the first one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I only played the game 2 minutes and i already know that its PEAK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Muito melhor doq o primeiro, e aquele já e muito bom. Recomendo de mais.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best metroidvania games I’ve ever played . I enjoy it so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect game fully describe what a 10/10 game is like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game if you like metroidvenia games then this game is probably an all timer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "메트로배니아 중에서는 꽤나 잘 만듬. 그리고 Ori 귀여움",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best metroidvania game ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game to play if you like Platformer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing but it's better than Hollow Knight.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game just love everything about it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is with soul! just play and enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everyone that interests me in this game keeps dying 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stunningly beautiful!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny blue critter",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "like the first one, this still amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game, just give it a chance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like if they made a sequel to hollow knight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'ts such a cute game to play :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "افضل لعبة فيك يادنيا ياعالميه ❤",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, cute, pretty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10, I liked it when ori said my name was ori and i had a will. It was the will of the wisps, and then proceeded to wisp all over the place. Goated game",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "First game to make me slam my desk and rage quit in 10 years. The responsiveness of this game is bad. I press control (dash)  three times and it just doesn't. Try other games. Try keyboard tests. Works fine. I play other game where i use control. All fine. Go back to the time challange. Doesn't respond. What a joke. 10/10 would never buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible experience if you're trying to play with a non-Microsoft controller. In order to get your buttons mapped correctly, you need to jump through hoops with remapping through Steam Big Picture or re-map through a .txt file (which does not work for some people). By default, Square becomes A, X becomes B, and R2 becomes Start.\n\nI just wanna play the game and they make it so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think it is a fantastic game but the ending soured everything for me\nthis is 100% an anger review but I dont care",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "less about problem solving and more about perfect contoller timing and finding well obscured things. no real map markings, to breadcrumb where you need to return to for quest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it has a very low amount of enemy variety. About halfway through you will have seen every enemy the game throws at you. Bosses are few and far between with most being just mechanically boring chase sequences.\n\nThe graphics are pretty, but often hard to read, especially if there are a lot of neon colours on the screen. \n\nAs far as movement unlocks go, there are a few great ones in there, but most are just basic stuff like double jump or dash, or even horrendously reused ones, like triple jump, dashing underwater or dashing in the sand.\n\nAll in all I'd give it a mixed review. The story is cute, but not deep enough to carry the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't rebind controller buttons",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. Not a good sequel to the first game I was expecting.\nReally bad in terms of level design and pretty inferior in music and character design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First game to make me slam my desk and rage quit in 10 years. The responsiveness of this game is bad. I press control (dash)  three times and it just doesn't. Try other games. Try keyboard tests. Works fine. I play other game where i use control. All fine. Go back to the time challange. Doesn't respond. What a joke. 10/10 would never buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible experience if you're trying to play with a non-Microsoft controller. In order to get your buttons mapped correctly, you need to jump through hoops with remapping through Steam Big Picture or re-map through a .txt file (which does not work for some people). By default, Square becomes A, X becomes B, and R2 becomes Start.\n\nI just wanna play the game and they make it so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think it is a fantastic game but the ending soured everything for me\nthis is 100% an anger review but I dont care",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "less about problem solving and more about perfect contoller timing and finding well obscured things. no real map markings, to breadcrumb where you need to return to for quest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it has a very low amount of enemy variety. About halfway through you will have seen every enemy the game throws at you. Bosses are few and far between with most being just mechanically boring chase sequences.\n\nThe graphics are pretty, but often hard to read, especially if there are a lot of neon colours on the screen. \n\nAs far as movement unlocks go, there are a few great ones in there, but most are just basic stuff like double jump or dash, or even horrendously reused ones, like triple jump, dashing underwater or dashing in the sand.\n\nAll in all I'd give it a mixed review. The story is cute, but not deep enough to carry the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't rebind controller buttons",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. Not a good sequel to the first game I was expecting.\nReally bad in terms of level design and pretty inferior in music and character design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First game to make me slam my desk and rage quit in 10 years. The responsiveness of this game is bad. I press control (dash)  three times and it just doesn't. Try other games. Try keyboard tests. Works fine. I play other game where i use control. All fine. Go back to the time challange. Doesn't respond. What a joke. 10/10 would never buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible experience if you're trying to play with a non-Microsoft controller. In order to get your buttons mapped correctly, you need to jump through hoops with remapping through Steam Big Picture or re-map through a .txt file (which does not work for some people). By default, Square becomes A, X becomes B, and R2 becomes Start.\n\nI just wanna play the game and they make it so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think it is a fantastic game but the ending soured everything for me\nthis is 100% an anger review but I dont care",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "less about problem solving and more about perfect contoller timing and finding well obscured things. no real map markings, to breadcrumb where you need to return to for quest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it has a very low amount of enemy variety. About halfway through you will have seen every enemy the game throws at you. Bosses are few and far between with most being just mechanically boring chase sequences.\n\nThe graphics are pretty, but often hard to read, especially if there are a lot of neon colours on the screen. \n\nAs far as movement unlocks go, there are a few great ones in there, but most are just basic stuff like double jump or dash, or even horrendously reused ones, like triple jump, dashing underwater or dashing in the sand.\n\nAll in all I'd give it a mixed review. The story is cute, but not deep enough to carry the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't rebind controller buttons",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. Not a good sequel to the first game I was expecting.\nReally bad in terms of level design and pretty inferior in music and character design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First game to make me slam my desk and rage quit in 10 years. The responsiveness of this game is bad. I press control (dash)  three times and it just doesn't. Try other games. Try keyboard tests. Works fine. I play other game where i use control. All fine. Go back to the time challange. Doesn't respond. What a joke. 10/10 would never buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible experience if you're trying to play with a non-Microsoft controller. In order to get your buttons mapped correctly, you need to jump through hoops with remapping through Steam Big Picture or re-map through a .txt file (which does not work for some people). By default, Square becomes A, X becomes B, and R2 becomes Start.\n\nI just wanna play the game and they make it so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think it is a fantastic game but the ending soured everything for me\nthis is 100% an anger review but I dont care",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "less about problem solving and more about perfect contoller timing and finding well obscured things. no real map markings, to breadcrumb where you need to return to for quest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it has a very low amount of enemy variety. About halfway through you will have seen every enemy the game throws at you. Bosses are few and far between with most being just mechanically boring chase sequences.\n\nThe graphics are pretty, but often hard to read, especially if there are a lot of neon colours on the screen. \n\nAs far as movement unlocks go, there are a few great ones in there, but most are just basic stuff like double jump or dash, or even horrendously reused ones, like triple jump, dashing underwater or dashing in the sand.\n\nAll in all I'd give it a mixed review. The story is cute, but not deep enough to carry the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't rebind controller buttons",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. Not a good sequel to the first game I was expecting.\nReally bad in terms of level design and pretty inferior in music and character design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First game to make me slam my desk and rage quit in 10 years. The responsiveness of this game is bad. I press control (dash)  three times and it just doesn't. Try other games. Try keyboard tests. Works fine. I play other game where i use control. All fine. Go back to the time challange. Doesn't respond. What a joke. 10/10 would never buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible experience if you're trying to play with a non-Microsoft controller. In order to get your buttons mapped correctly, you need to jump through hoops with remapping through Steam Big Picture or re-map through a .txt file (which does not work for some people). By default, Square becomes A, X becomes B, and R2 becomes Start.\n\nI just wanna play the game and they make it so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think it is a fantastic game but the ending soured everything for me\nthis is 100% an anger review but I dont care",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "less about problem solving and more about perfect contoller timing and finding well obscured things. no real map markings, to breadcrumb where you need to return to for quest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it has a very low amount of enemy variety. About halfway through you will have seen every enemy the game throws at you. Bosses are few and far between with most being just mechanically boring chase sequences.\n\nThe graphics are pretty, but often hard to read, especially if there are a lot of neon colours on the screen. \n\nAs far as movement unlocks go, there are a few great ones in there, but most are just basic stuff like double jump or dash, or even horrendously reused ones, like triple jump, dashing underwater or dashing in the sand.\n\nAll in all I'd give it a mixed review. The story is cute, but not deep enough to carry the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't rebind controller buttons",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. Not a good sequel to the first game I was expecting.\nReally bad in terms of level design and pretty inferior in music and character design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First game to make me slam my desk and rage quit in 10 years. The responsiveness of this game is bad. I press control (dash)  three times and it just doesn't. Try other games. Try keyboard tests. Works fine. I play other game where i use control. All fine. Go back to the time challange. Doesn't respond. What a joke. 10/10 would never buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible experience if you're trying to play with a non-Microsoft controller. In order to get your buttons mapped correctly, you need to jump through hoops with remapping through Steam Big Picture or re-map through a .txt file (which does not work for some people). By default, Square becomes A, X becomes B, and R2 becomes Start.\n\nI just wanna play the game and they make it so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think it is a fantastic game but the ending soured everything for me\nthis is 100% an anger review but I dont care",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "less about problem solving and more about perfect contoller timing and finding well obscured things. no real map markings, to breadcrumb where you need to return to for quest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it has a very low amount of enemy variety. About halfway through you will have seen every enemy the game throws at you. Bosses are few and far between with most being just mechanically boring chase sequences.\n\nThe graphics are pretty, but often hard to read, especially if there are a lot of neon colours on the screen. \n\nAs far as movement unlocks go, there are a few great ones in there, but most are just basic stuff like double jump or dash, or even horrendously reused ones, like triple jump, dashing underwater or dashing in the sand.\n\nAll in all I'd give it a mixed review. The story is cute, but not deep enough to carry the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't rebind controller buttons",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. Not a good sequel to the first game I was expecting.\nReally bad in terms of level design and pretty inferior in music and character design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First game to make me slam my desk and rage quit in 10 years. The responsiveness of this game is bad. I press control (dash)  three times and it just doesn't. Try other games. Try keyboard tests. Works fine. I play other game where i use control. All fine. Go back to the time challange. Doesn't respond. What a joke. 10/10 would never buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible experience if you're trying to play with a non-Microsoft controller. In order to get your buttons mapped correctly, you need to jump through hoops with remapping through Steam Big Picture or re-map through a .txt file (which does not work for some people). By default, Square becomes A, X becomes B, and R2 becomes Start.\n\nI just wanna play the game and they make it so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think it is a fantastic game but the ending soured everything for me\nthis is 100% an anger review but I dont care",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "less about problem solving and more about perfect contoller timing and finding well obscured things. no real map markings, to breadcrumb where you need to return to for quest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it has a very low amount of enemy variety. About halfway through you will have seen every enemy the game throws at you. Bosses are few and far between with most being just mechanically boring chase sequences.\n\nThe graphics are pretty, but often hard to read, especially if there are a lot of neon colours on the screen. \n\nAs far as movement unlocks go, there are a few great ones in there, but most are just basic stuff like double jump or dash, or even horrendously reused ones, like triple jump, dashing underwater or dashing in the sand.\n\nAll in all I'd give it a mixed review. The story is cute, but not deep enough to carry the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't rebind controller buttons",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}