{
  "positive": [
    {
      "review": "[h2] 🦘 Dinkum Review 🌿 [/h2]\r\n\r\nI absolutely enjoyed this game! It reminded me of Animal Crossing, but without the day-to-day time limit, and with so much more added on top. The Australian-themed island is charming, the art style is bright and beautiful, and the ambient wildlife sounds are wonderfully relaxing.\r\n\r\nAt the beginning, the game felt a little bare, and I worried I was doing something wrong. But once I went with the flow, things quickly became more exciting. There’s a surprising amount to do as systems start unlocking. My early focus was making money, so I planted lots of fruit and created a lovely orchard. Once the income started rolling in, getting residents to move into my town became much easier. From there, I built up a large farm with different crops and eventually animals, an area I ended up loving and spending tons of time in. As I explored more, I also loved discovering the many different vehicles you can use to get around the island. They make travelling so much easier and add a fun new way to explore the huge map.\r\n\r\nGear progression plays a huge part in Dinkum. Unlocking the mines was tough at first; the enemies were super annoying, and yes, I definitely died a few times. But after getting better equipment, everything felt much more manageable. The mines became less stressful and more rewarding, letting me gather the ores and materials I needed to make my town even prettier.\r\n\r\nI had so much fun completing tasks, collecting bugs and fish for the museum, and even hunting down mighty alphas. There’s just so much to do. I loved having the freedom to design my town exactly how I wanted. I created an epic farming area, a fully equipped workshop for all my machines, and decorated everything with the game’s huge selection of items. Even the clothing options were great, I spent a lot of time mixing and matching outfits.\r\n\r\nThere are plenty of hidden surprises too, including rare character spawns and even a whole new place to explore (no spoilers!). The game also features co-op. I mostly played solo, but when I did play with a friend, we had a blast. Whether you want a cozy day tending crops or a combat-focused day diving into the mines, the game lets you play at your own pace.\r\n\r\nOne thing to note: the game doesn’t explain a lot of its mechanics. I often had to check Discord or YouTube for tips and things I didn’t even know were possible. But honestly, discovering new features was part of the fun.\r\n\r\nI highly, [i]highly[/i] recommend Dinkum. You’ll get tons of hours out of it, and for achievement hunters, it’s not too punishing to reach 100%. The developers are friendly, regularly patch the game, and recently released an amazing update with trains and animal taming, which has been a blast. It really feels like they listen to their community.\r\n\r\nG’day everyone—have fun, mates!🌻\r\n\r\n[quote]Tip: If you want to find more reviews like this, check out our curator page [url=https://store.steampowered.com/curator/41527689/]Moon's Tea House[/url][/quote]",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Animal Crossing: Down Under... finally someone actually adds something new to the same old recipe. Unlike Animal Crossing there is a bit of genuine struggle against the environment to get your town going. And that shake up make this game all the more interested. This is a such a fun game that lets you fight the wilderness while still keeping the essence of an AC-like vibe.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Animal Crossing + Stardew Valley + Minecraft = Dinkum\r\n\r\nFeels very well put together and progression feels satisfying. I've played most of my time solo and it has been very enjoyable by myself. You can find yourself losing many hours to this game if you aren't careful. Throw in some friends? Shenanigans will ensue.\r\n\r\nAlso, bats are super annoying.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Animal Crossing, but better. No waiting, no real time clock, just going at your own pace!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Dinkum isn’t just a cozy game, it’s a fun, evolving co-op experience. If you enjoy chatting, exploring, and building a town with friends, this is one of the most satisfying games to play from day one until now.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Australian Animal Crossing, great way to unwind after work. Solo play friendly.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I’ve been playing Dinkum since long before its official release, and honestly, seeing how far this game has come is amazing. From early access all the way to the full release, Dinkum has always been one of the most fun and comforting co-op games I’ve played.\n\nIt’s a perfect game to enjoy with friends. There’s just so much you can do building your town, exploring, farming, hunting, mining, fishing, decorating, there’s always something to keep you and your friends busy and laughing. The Australian outback vibe also gives the game a cozy but adventurous feel that never gets old.\n\nWhat makes Dinkum even better is the very active developer. Updates keep coming, full of new features, improvements, and quality-of-life changes. Even after the official launch, the dev continues listening to the community and consistently pushes the game forward—and you can really feel that while playing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love me some Dinkum. Being an Aussie myself, I find this game endearing. I love all the slang to Aussie references and even the names of the townspeople. Granted, I haven't made it that far into the game, but I love it for what it is.\n\nGive it a go.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Chill and cute game. Like Animal Crossing but the gameplay is better.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's like a mixture of Animal Crossing and Minecraft, with a sprinkle of Stardew Valley. It's got a lot of awesome components to it: building, character customization, mining, combat, farming (animals and crops), house and character customization, town planning, exploring, collecting, etc.! It's a game full of fun things I am still finding and learning about. I am playing single-player which is a lot of fun but it has multiplayer too!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I bought Dinkum to escape the stresses of competitive FPS games. It's very good for that. I thought maybe it wouldn't be fun solo, but, I was wrong. It's great, even alone. You have to set your own goals, however. When you plan things out and then do complete them it's rewarding.\nIf you are getting burnt out on shooters and want something that is like a mix of Stardew Valley and Animal Crossing, then give it a try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't usually quit a game then restart it then quit and restart. I usually don't pick a game back up after I've put it down, but this one is just special... It has stayed on my mind. It is a game with unique animals from Australia, there's villagers and quests like on animal crossing, but there's also a unique mining aspect and storyline aspect. It is just a really cute and memorable game that's really fun when played with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Quaint and charming, Dinkum is about building a small settlement on a large island, and attracting others to move in.  Although there is no real storyline, it has a lot to unlock and work towards, namely the gaining of licenses to unlock abilities and what you can build, and amassing a fortune.  Its enjoyable to level up your various skills, there always seems to be some goal to look forward to...if you like building and decorating it has that.  I couldnt say its as high calibre as Terraria or SDV, but it has its own little niche and is somewhat uniquely different anyways.\n\nAfter a few dozen hours I started feeling a bit aimless, but am no where near completing my Pedia(record of caught bugs/fish esp) nor of engaging in the big building project of establishing a railroad system across this golden corner of earth.  I think Dinkum means \"honest work\" in Australian - despite it's seeming sparsity I have to recommend, it is an enjoyable piece of work",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Rating: 6.5/10\n\nReview: Dinkum is a very okay game. It's not bad, it changes the generic farming formula a bit, but overall is just fine. I would say this is an upgraded Animal Crossing. Lots of good mechanics used well. Art style is colorful but not vibrant. The daily tasks, NPC's, and crafting can be fun fun to explore and interact with. It is easy to spend a couple hours playing the game and get lost in the charm. \n\nThat being said, there isn't really anything that makes this game special. No hidden lore, no stand out features, no crazy events. It is a very cozy, farming sim. Which once again, is fine. I would have liked to see a bit more options for customizing weapons and tools. It would have been great to be able to keep a larger pool of animals as pets. Having more vibrant buildings or being able to style an NPC's building to fit more in line with how I envisioned the town would have been nice. There is just something a bit lacking is all. Still a decent game.\n\n\nTLDR: Very Okay game. Think Animal crossing but better. Generic Farm Sim. Would Recommend, but keep expectations casual.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely amazing to play with friend(s), great for experienced or beginning players. If you like animal crossing or stardew valley, it's a great mix of both.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a pretty good game. \nThere is alot to be desired.\nOverall i enjoyed my time with Dinkum, there are some serious faults tho. \nAUDIO- cutting a tree sounds like im squishing a plant not cutting a tree, zero sense of impact. \nThe interface using a Controller needs work, the UI does not wrap around huge oversight. \nInventory: not being able to select 1 item only split is really stupid.\ni have a hotkey for combining like items, but not for sorting?\ndealing with underwater rocks or discoveries is just stupid, i have to build i mote just do remove it.\nGame is using X and Right Trigger for many interactions, i fish with x and use right trigger most other times but, clearly the controller setup needs work. \nits not unplayable but its pretty bad.\n\nUpdate 2025 - game is far better then when i reviewed this initially, highly recommended cozy game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Play with the bird - she loves it, I love it. She tends the mincey little animals and crops and I dig holes and build. Win win.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It may look like an animal crossing copy but it’s actually a lot more fun with more stuff to do than animal crossing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dinkum is a fun twist on its genre, offering a unique feeling of progression and open-world gameplay in a setting inspired by the Australian Outback. You’re either going to love the game for the long-term commitment it demands or grow a bit tired of its slow pacing. Either way, I think the game is worth giving a shot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really love the new updates. I also like the fact that the mouths move when I speak via mic! definitely recommend to my cozy gamers out there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Only a couple hours in but the gameplay is enjoyable. Tried it with a friend and the multiplayer worked out very well and we didn't have any issues with lag or connectivity issues. Can't wait to see how far this game will go.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is my most favorite game, I've been playing it for 3 years now. Super excited about the new updates, but...\nWith it now being paired with Krafton I feel like things are going to take a sharp turn. Very disappointed in the dev for selling out to Krafton of all companies, especially with it now being and AI first one at that. Hopefully things continue to go on the same track that started it all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best sit back and relax game of the year!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very enjoyable game, some basic combat elements necessary for crafting. The craft/build/survival element is a perfect blend of fun, cozy and stimulation if youre looking for a game to relax, turn off your troubles for a little bit, and enjoy a peaceful environment. Gives a blend of animal crossing and minecraft. 10/10 highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the more addictive casual games I've ever played. Nothing here to really press you or stress you out. All the time in the world to explore, gather, build, etc. Just good clean fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SOLID game:\r\n\r\nS - Satisfying: From the tactile joy of mining deep shafts for rare ores to harvesting bountiful farms and upgrading tools that actually wear down realistically, every action delivers that dopamine hit of progress. It's a loop so addictive, you'll lose 150+ hours without blinking.\r\n\r\nO - Open-world: A massive, biomes-packed island begs endless exploration—scorching deserts, eucalyptus forests, cool billabongs, and beyond. Unlock permits to expand your horizons, hop on trains for new zones, and build without invisible walls holding you back.\r\n\r\nL - Lively: Your town pulses with personality. Befriend and recruit dozens of villagers who move in, chat, and contribute uniquely. Tame livestock, hunt aggressive wildlife, or just chill with pet wombats—it's a thriving ecosystem of Australian-flavored chaos and charm.\r\n\r\nI - Immersive: Survival feels earned yet forgiving—craft, forage, fish, hunt, and automate with depth that rivals Stardew but amps the Animal Crossing vibes in the rugged outback. Co-op shines for 4-player shenanigans, and seasonal events keep it fresh.\r\n\r\nD - Delightful: Under the grit, it's pure cozy escapism. A charming soundtrack, whimsical details (like bombing kangaroos or fashion farming), and constant updates from the dev make it endlessly replayable. 93% positive on Steam isn't hype—it's fact.\r\n\r\nGrab Dinkum on Steam (or consoles now), fire up a new save, and fair dinkum enjoy the ripper life.\r\n10/10—your next obsession awaits.\r\n\r\nP.S.: written with help of AI.. of course.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This Dev is a LEGEND. Great game that caters to everyone's needs... Great relaxing game altogether. I would highly recommend this to anyone looking for a relaxing sim game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dinkum is my literal favourite game in the whole world, bad day? Dinkum. Good day? Dinkum. It's the one game I could put down for weeks and as soon as I pick it back up it's like I never left, every update and new thing it just gets better even when you don't think it's possible 10/10 love it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It´s a fun game, but the game-loop gets played out rather quickly. It´s like a less complex and more violent Animal Crossing, except for the real time element, which makes that game so addicting. The hunting is fun though, even if I find the cooking pretty tedious and therefore slightly annoying. \n\nI mean it´s still a charming game, and definitelly even better in multiplayer, but with a variety of choices I do not find myself coming back past the maybe 50-60 hour mark, like I do with other similar games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At some point, Dinkum, became the best game to pass time alone... and once I met people that were both really creative and dedicated, I decided that the award for Best Game of the Year would go to Dinkum. It's like playing a better crafted Animal Crossing (even though I have only tried New Leaf, and not for too long either) and with a optional online component, now, the amount of stuff that you can build is unlimited but mind that the game stutters a bit when inside giant man-builded structures, apart from that the OST is really worth listening whether you are a fan of the game or not. For 20€ this is really a bargain, I wish I had more Italian friends to play this gem with!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Cozy Game. My only complaint is being able to place train tracks and other items under bridges.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super cosy game. \n\nps Gaben why so cheap where are the trading cards for nominating and in big sales?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Always a fun game to get back to and have a relaxing day after work. Absolutely love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and lovable game  is fun and  relaxing to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good. You have to regularly fend off crocodiles and obliterate kangaroos, but I assume that's exactly what it's like to live in Australia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So much fun solo or with friends build your ultimate town and enjoy everything about the adventure down under.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this game when I want to escape my stressful day-to-day work to go into the wilderness of the Australian outback to mine ores and fight crocodiles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable game the gameplay is well made and i overall love how much there is to do in this game ♥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Out of all the open world games out there I do enjoy the hunting and gathering style of this game. It is a nice alternative to stardew valley with it's own style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun. casual, and Devs still working hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play casually with friends. We play on and off when we have time and it's easy to jump in where we left off.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is basically Australian Animal Crossing. I think it is so cute and fun, it is also cool that your friends can come to your island and play with you. I am big enjoyer of games with fishing and bug catching and this game does them well, I could fish all day in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and challenging.  A little buggy at first but the updates fixed most of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun! This one is a must play if you like games like Animal crossing and other cute cozy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is the  Australian outback meets Minecraft. There is a lot to do from trying to get NPC's to move to your island to building and designing your town and home along with fishing, fighting, farming and ranching. I would highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played since release on steam with my partner, loads of fun and things to do. after 1 month of playing the game, i went to Australia on a working holiday visa so dinkum gave a good insight on what to expect! 5*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plays like Animal Crossing, looks like Animal Crossing... It's Animal Crossing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, maybe even better than animal crossing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a nice relaxing game. Easy yo learn and easy to get addicted to",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a slow start with some bugs back in the early days, this game has grown so much. With the new addons like the train and the seasonal events, this game keeps you on your toes (hope the crocs dont hear you)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun laid back game. A little survival-esque, but overall very chill and easygoing with options to farm, customize your town, and customize your houses.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got Dinkum in early access and I never even regreted that I got it. I really love this game a lot and I never get dired of it. You can be creative or play it only as a survival game. What I like the most is how the dev James Bandon listens to his commiunity and tries to made some suggestions possible. Even after the full release he surprises everyone with new amazing stuff and posibilitys.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first found Dinkum back in 2022 and what a journey from then till now. I particularly like that the game features a robust multiplayer setup and just feels perpetually warm and cozy to play,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very chill game to play when turning off the brain, I have only played it a handful of times but have really liked it so far!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't review games often but Dinkum is a great game to come home from work, slap on and chill out for a few hours before bed 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having very fun with game, \n\n= Story... well it's fine\n+ Building and upgrading \n+ Farming, mining, and exploring \n+ Music \n\nOverall, a great game to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shaping up to be a decent game has some good bones. Cross over of Animal Crossing and Stardew Valley.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game to just sit back and relax and not think much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a big fan of these types of games. I'd play them all if I could. Thankfully, this was one I had the chance to indulge in. Came back after a long hiatus, 10/10, would build a new town over and over. Very relaxing, especially for something set in Australia ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. It's got a little bit of everything for everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, relaxing, animal crossing vibes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun and relaxing game to play with people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun and cozy Animal Crossing meets Stardew Valley kind of game, but set in a more Australian setting~!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't Steam Deck approved but it works fine when I'm travelling and visiting family! It's like Nintendo's Animal Crossing but doesn't require an entire day cycle just to stop, which as an amazing part about it! And it works great on my PC and my Steam deck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No, you cannot milk a real life wombat for personal or commercial use. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend this game! I've spent hours playing it, rather it be fighting enemies in the mines or just chilling in my garden. You'll never get burned out. Love it!  10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have started playing Dinkum back in 2022, I haven't gotten around to getting back into just yet- I've watched some streamers playing it and I gotta say these developers really out did themselves because I am so excited to go back and start a new world :D 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed the game. The game involved most of my favorite elements farming, gathering, exploring and making connections with characters. The game had a lot going for it and i like the fact that I can take my time and play anyway I want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game that includes a lot of the best parts of animal crossing but without the real life clock to wait for. I've played 60 hours and still feel like I've just scratched the surface of things to do. It's a super cozy game that you can get lost in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, wholesome, little town that gives you various missions to help you learn and progress. The deeper mining is a lot of fun, gearing up and trying for cool loot, both cosmetic and in some ways, game changing. Great with other people, too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Calling it a cozy game is a facade for the endless fight against the Australian Outback and the evil, evil cassowaries. Absolutely amazing. Worth trying the demo at least to see if you like the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still a good freakin game, might visit again after seeing a lot of updates!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game, fun to play w/ gf and friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Animal Crossing + Stardew Valley + Minecraft = Dinkum\n\nPerfect game for Steam Deck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute animals, build your own town, collect a lot of \"Dinks\", very fun(ny) game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game Aussie grown game with plenty to do and explore. Stunning visuals with familiar Australian wildlife. This game sits close to my heart because it feels like home.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While this game shares a lot with Animal Crossing, it does some small but important differences which make the game better for casual players.\nDay and night cycle isn't locked to your system time, one frustrating part of Animal Crossing for me was this where you could easily miss an important event simply because you didn't play on a certain day at a certain time. Dinkum allows you the freedom to play whenever you want without the risk of missing out on content.\nThere is a bunch to do and as I getting closer to 50 hours there is still a lot for me to discover.\nCo-op is nice and simple, friends can jump into your save and can start helping out straight away.\nThe combat can take some time to get used to, as it isn't the smoothest experience, but the game really isn't about this but you will be missing hits and possibly getting killed in a somewhat unfair way. It's easy enough for kids, but can just feel a like janky at first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a casual game with a pretty catchy gameplay loop — complex enough to keep you engaged for longer sessions, but not so niche that it becomes tiring. It’s the perfect kind of game to unwind with after a long day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun and relaxing game with loads of stuff to do. You will not get bored quickly and you always have something to get back to. Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, animal crossing stardew vibes & great with friends. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice, cosy and immersive experience for people who love eploring and experiencing different aspects to gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "เกมดี เล่นเถอะ สนุก แบบฮาเวทมูน ผสม แอนนิมอลครอสซิ่ง ที่บ้าน\n\nแต่แต่งบ้านไม่ค่อนเร้าใจเท่าไหร่ ทุกอย่างต้องวางบนกริด",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really liked the game, it makes me creative and it's challenging in the mines but overall it's perfect but I really wanted some more items in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly, this is a very relaxing farming game with a somewhat long and simple progression system, worth the cash, but I'd get it on sale. if you like harvest moon, and you like stardew esc games, pick it up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic game! A much better version of Animal Crossing. I've had the game since day one of early access and have dabbled in it here and there. The game has come so far and has added so much more content!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really cool game to play with friends.  You can take it at your own pace and just enjoy the quirkiness of it.  The only way I can describe it is like having a 3-D version of Stardew Valley with more building and combat options.  Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to chill to, Stardew like but unique still.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All I got to say is that this game deserves more love, with the amount of content the developers keep adding is amazing. Hope this game gets more attention because it absolutely deserves it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been very simple and relaxing for me in these chaotic times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great little town builder. Lots of recipies and gear to find, super simple coop/ Cute.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Animal Crossing x Stardew x The outback = Dinkum.\n\nMinus the days tied to your RL time, the stress of time forcing you to bed after hours, and world being restricted to a small area.\n\nJust note staying up past midnight makes stamina deplete super fast, but food is your friend. Never sleep till your town looks amazing. Isolate that one villager you dislike to their own island in the middle of the ocean and forget they exist. \n\nPlay alone or with friends, just tell them to bring their own tools if they can, John only sells 1 per day... So was John who you stuffed on the island? Might as well by a teleporter so the villagers stop talking to him when you need to BUY SOMETHING!!! I mean...\n\nLove this game, can't wait for more hairstyles though. Especially longer hair with styles like half ponytails or elvish looking designs.\n\nOh bonus points for the elven ear cosmetic during Dec. A friend told me to mention that...wasn't me...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dinkum is a very fun game.  It's a nice expirience to sit back and relax for a bit while winding down from work.  I would definetly recomend this game for people who enjoy animal crossing games as it has a very similar vibe but your not restrained to just daily activites.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely one of my favorite cozy games. Love sitting back and just vibing while playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very relaxing game. Always fun catching gaters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have enjoyed Dinkum for a while and I enjoy playing this game with my husband. It brings me great joy to play this game and I think if you like crafting sort of games, this is up your alley! Give it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game so much, i hope more content updates in future\r\n\r\nnominated for steam game awards <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game. scratches that animal crossing itch. downside is it only saves at the end of each day, but thats a minor gripe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfectly scratches the crafter gatherer itch and the town designer itch. Unfortunate the dev got Krafton involved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aussie Animal Crossing- a classic in the making. Definitely needs some more overall content (which the dev is doing well on) but fleshes the game and world out more deeply than he even really had to. Big fan of this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alot of fun, very chilled. no pressure. just go do whatever. me and my wife absolutely love this little gem!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I loved the game when it initially released. But I can't in good conscience recommend it now that Krafton is the publisher. (The same publisher who screwed over the Subnautica devs.) Krafton is not a player-friendly publisher. Krafton hates mods, which have been a decent part of this game from the get go. As stated in their EULA, using mods with Dinkum now runs the risk of them *removing your access to the game*.\n\nI wish James all the best in future endeavors... but aligning with such a shady, profit-over-player driven company who's best interest is themselves... is not a good move.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "A fun game with too many bad developer decisions.\n\nThere are too many things that are designed bad, like the save at sleep-system and 3 clicks to pause in singleplayer.\n\nEverything is made to be annoying and grindy instead of being fun. Everything costs too much money for someone just starting out.\n\nThe deep mine is what convinced me to make the review negative. You pay license points, money and materials to build the mine then for some reason you must pay 25k per trip (not even per day). Instead of popping down to just do some fun mining it's a pressure to make sure you get enough loot to justify the cost paid. Also if it's a Sunday and you didn't buy a pass beforehand you're screwed.\n\nThe repair system is equally unbalanced. You pay money and materials to make a repair bench but for every repair you have to always buy an item costing 30k. To get your moneys worth you'll want to fill your inventory with broken tools.\n\nI tried multiplayer before the full release and it was a buggy mess. With the save system as garbage as it is I would never recommend multiplayer. If you have internet issues or if the host has internet issues then an entire days work goes up in smoke.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Since Dev Bendon ultimately sold this game to Krafton, DO NOT BUY THIS GAME. Krafton has a hard-on for putting AI in their games, abusing their staff, and being an all-round awful, anti-player company. Even though Dinkum had so much promise, supporting these types of companies will lead to more dog faeces in this industry.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "It’s a fun game but I’m on steam Deck and I spent well over a hour assigning buttons for every single control needed to be able to play the game and by the time I was done I was highly annoyed.  Devs really need to think more about Steam Deck owners when they develop their games",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "why does every casual survival game have to be so grindy with like almost no real beginning progression.\nlike im being fucking scammed by the ingame grandma npc, like what do you mean 95k for a house deed, im in the middle of fuck all nowhere its not like the navy is going to sink my island for just building a shack. \n\nthis game is not really fun unless you have the compulsion to just grind resources, which is probably the target audience.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Co-op is a buggy mess with game-breaking issues.\nI only play this game co-op, I have no interest playing single player.\nAwful.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After the latest patch, the game is full of ridiculous bugs. One of the worst is this: if you die and click Rebirth, the game just ends — you can’t click anything anymore. The entire interface becomes unresponsive, and you’re forced to restart. Please fix this as soon as possible, it completely breaks the gameplay experience.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's pretty boring.  All the mechanics in this game feel very shallow and are uninteresting. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A good game but now its owned by shitty AI bootlickers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is like animal crossing and it's really good but Krafton as Publisher is unfortunately not good. If I had seen it bevor buying and playing, I might have been considering not even buying it after what happened with subnautica 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game. Boring, devoid of fun, hand holding trash fire. 20 dollars would be better spent by being flushed down the drain.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As of right now? No. It's constantly crashing and locking up. On top of balancing that needs to be done. This game can be great, but it still needs work. I'm hoping to eventually be able to say yes, but I'm currently on crash three of the same day. Spring something or other and my pc does meet reqs unless it now requires windows 11 and they've not said anything to us about that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It starts out fun enough, but eventually gets really dull.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The endgame is not great.  A lot of things feel like they're 2/3rd of the way done.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but some of the mechanics are exhausting. Brief examples: \n1. I have storage crates filled with items. When I'm crafting I have to pull out each item from the bin and then take it to the craft table. Maybe I've been spoiled with cozy game mechanics where it just pulls the items directly from any storage device to craft items. \n2. I have 50 pieces of gum wood and I want to make planks: I need to saw each individual plank. No automation system set up.. or maybe that's later in the game.. idk. \n3. If I go to the direct settings it should automatically pause the game.. creating an actual pause button to do that is doing to much.\n\nOutside of that the game seems to have to much to offer, but the grind mechanics for every single thing is not my type of fun. My take is If you love cozy games this isn't for you. If you love the the grind then you found a gem.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've played the demo last year and enjoyed it for some 7 hours or so.\nBought it and ever since I don't like it.\n\nI feel like it's too hard to play with the hours going by so fast, I need to look out for so many animals that attack me, the shop is closed when I go on an adventure into the world. \nJust no.. I tried to return it but no succes. \nI really want to like it but I can't anymore :( It does not feel cosy to me. \n\nThe size of the map and graphics is good though.\nIt's the game itself that I don't enjoy anymore.\n\nMaybe after a few years i'll try it again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decent game, horrible AI firs company.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Why did Krafton come along to destroy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Krafton is pure garagbage as a company",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I am ashamed of how much time I sank to this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The dev sold out to Krafton, yes the same Krafton that sacked the Subnautica devs so they wouldn't have to pay out their bonuses, and then tried to abuse the legal system to gain access to said devs personal devices under the guise of looking to see if the devs had downloaded any files from the game. Oh, not to mention Krafton are pro-generative-AI. \n\nKrafton also hates the players and has banned all use of Mods in this game, under threat of straight up taking the game out of your steam library if you dare to use mods. Krafton are an anti-consumer, anti-player company who do not deserve your money. Do not buy Dinkum for as long as Krafton is the publisher. I enjoyed Dinkum, the game was fun, but I won't recommend anyone buy a game from this publisher.",
      "voted_up": false,
      "votes_helpful": 186
    },
    {
      "review": "THIS GAME IS SO SHIT, YOU ARE THE WORST FUCKING PROGRAMMER IVE EVER SEEN  FUCKING ACTUALLY QUIT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I loved the game when it initially released. But I can't in good conscience recommend it now that Krafton is the publisher. (The same publisher who screwed over the Subnautica devs.) Krafton is not a player-friendly publisher. Krafton hates mods, which have been a decent part of this game from the get go. As stated in their EULA, using mods with Dinkum now runs the risk of them *removing your access to the game*.\n\nI wish James all the best in future endeavors... but aligning with such a shady, profit-over-player driven company who's best interest is themselves... is not a good move.",
      "voted_up": false,
      "votes_helpful": 117
    },
    {
      "review": "[h2]Ok this game has just become tedious, and not fun[/h2]\n\n[i]Edit: Yeah I got 225h in the game, so sure i got my money’s worth. But it is just not fun anymore. The changes made it feel more of a chore than a chill game.[/i]\n\nI came back to Dinkum after a long break since I already had 225h in it and was excited for new content. But honestly, the game just feels way more tedious now.\n\nThe stamina rework kills it for me. Half your bar gone and you’re crawling everywhere. Gliding used to be smooth, now it sucks. Even power tools drain stamina, which just makes everything slower and less fun.\n\nThe game was always kind of grindy. Farming, animals, decorating, the mines. But at least parts of it was still chill enough to enjoy. Now it’s just extra grind stacked on top of the old grind, and less freedom to play the way you want.\n\nI wanted to love jumping back in, but it really feels like these updates are just downgrades with a few added recipes.",
      "voted_up": false,
      "votes_helpful": 75
    },
    {
      "review": "If you want to play co-op, this will only be a frustrating experience. If you're playing single player, i think the game would be fine.\n\nWhen playing co-op, only the owner of the island can buy and place deeds. Which is a problem, because if players focus on separate things (island guest liked to mine and we were running out of copper) as the host, I didn't spend much time mining because we just shared. We cooperated, like co-op games are meant to. Which means in order to get the deed for a mine shaft, I would have to get from level 1 mining to level 16 mining with a lot a permit points. A former workaround of buying the guest buying the deed on their island and placing it in the host's island does not work. \nThat is by far the biggest issue with this game. If that would be fixed, it would be playable for co-op. Right now, it just isn't.\n\nBut a few small things I think could be fixed are as follows:\nThe game doesn't give you any option to share money, so you end up having to have one person not pay on the town debt at all to save up for house upgrades\nGive more liberty to the 'guest' on the island. They should be able to apply for deeds, pay off the town debt completely, \nThe mine shaft requiring all players to go down is an annoyance. I'm sure its easier to program this way, but it's not a good experience for those getting dragged along.\nThe price of items is quite hard to find. Even on the wiki it can be impossible to find. Maybe if we've sold it before to John, it shows up in a notebook, or if we hover over it in our storage?\n\nMy main thing is having the multi-player mode actually feel like more cooperative in nature. My husband and I spent 8hrs on our world for the game to essentially tell us its working against us. And unfortunately, even though we love the game, we won't be playing until this gets fixed. I sincerely hope one of the developers sees this so they can make some small adjustments, because that's really all it needs to be playable in co-op.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "I played Dinkum during Early Access, quite enjoyed it, and would have recommended it at the time.\n\nHowever.\n\nThe full release comes with a EULA which is so user-unfriendly that I have stopped playing, and I will not be recommending this game to anyone in its current state.\n\nHopefully some day this will be corrected and I will be able to change this to a positive review, but for now I must resignedly downvote.\n\n\nEditing to clarify:\n\nMy attempt to be concise has apparently left room for confusion instead. I am not objecting to the existence of EULAs in general, but to specific, nonstandard, terms in this one. Such as the complete ban on modding without exception for single-player mode or disability accommodations. And the agreement not to harm the publisher's reputation, which would have forbidden me from leaving an honest review if I had played the game since the EULA's implementation.\n\nIt's one thing when a EULA protects the company. But this particular one stifles its game in ways that seem contrary to the developer's intent.",
      "voted_up": false,
      "votes_helpful": 123
    },
    {
      "review": "If you ever plan on playing co-op I would skip this game. \n\n(Most of my hours came from single player 3 years ago. I can't recommend this game at all anymore.)\n\nSingle player, you rarely encounter bugs. There's not a LOT of content, but what's there is comfy and decent. You build up a town, make friends, farm, fish, catch bugs, and mine. It's very similar to Animal Crossing which is what made me want to buy it. It's a cozy and relaxing game even if there's not much to do.\n\nCo-op though? Horrific buggy mess. Only the host can really do ANYTHING, which sucks if you both are actually playing the game. To use the mines, only the host can use the pass and they can't just go up when you go down. It's all or nothing which sucks when people are doing different things. I've also encountered wicked bugs when it comes to helping put items in to build the buildings. Frequently I (the guest) would put everything needed into the building and it would ALL disappear the next day. OR it would start being built but if you log off before it's done, the building restarts. It took us 3 tries to figure out what the fuck was going on with my building, losing an insane amount of materials that are rough to get early game. Many times when sleeping and waking up the next day, I wouldn't be able to wake up and I would lose ALL progress from the day before. BUT all the materials I used stayed used. Lost an insane amount of tools, ore, fish, dinks, anything I did from those days. Losing everything nearly every time I play is a maddening experience when trying to 100% the achievements. Found another bug where if you die, you literally cannot do anything in co-op. You end up dead next to your bed, can't text chat, can press escape to do anything. Literally can only alt-f4, Which again, makes you lose literally everything.\nYou also don't share recipes you get from Franklin, so when one person donates disks, the other person cannot have access to those recipes either. They should absolutely be shared since disks, at least where I'm at in the game, aren't easy to get especially in the quantity we need for all recipes.\n\nAlong with the host being the only person able to do anything, only they can put buildings down. So make sure you figure out who the town planner is before you start so it doesn't become a problem down the line. Similarly to buildings, only the hosts relationships to the npcs matter. As well as only the hosts Licenses matter when it comes to putting stuff down (i.e. the mine) Co-op is basically just single player with a puppy following you around that can't really do much at all. This game would be more fun if Co-op actually functioned like an actual Co-op game, especially since achievements were added. \n\nIf you never plan on playing co-op, it's an okay game. Would absolutely skip if you plan on playing with people and you want to do more than just fish and do nothing.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "A fun game with too many bad developer decisions.\n\nThere are too many things that are designed bad, like the save at sleep-system and 3 clicks to pause in singleplayer.\n\nEverything is made to be annoying and grindy instead of being fun. Everything costs too much money for someone just starting out.\n\nThe deep mine is what convinced me to make the review negative. You pay license points, money and materials to build the mine then for some reason you must pay 25k per trip (not even per day). Instead of popping down to just do some fun mining it's a pressure to make sure you get enough loot to justify the cost paid. Also if it's a Sunday and you didn't buy a pass beforehand you're screwed.\n\nThe repair system is equally unbalanced. You pay money and materials to make a repair bench but for every repair you have to always buy an item costing 30k. To get your moneys worth you'll want to fill your inventory with broken tools.\n\nI tried multiplayer before the full release and it was a buggy mess. With the save system as garbage as it is I would never recommend multiplayer. If you have internet issues or if the host has internet issues then an entire days work goes up in smoke.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Since Dev Bendon ultimately sold this game to Krafton, DO NOT BUY THIS GAME. Krafton has a hard-on for putting AI in their games, abusing their staff, and being an all-round awful, anti-player company. Even though Dinkum had so much promise, supporting these types of companies will lead to more dog faeces in this industry.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "If you expected a negative review just because of the Krafton controversy - surprise! This one will tell you why Dinkum is simply a bad game, and that is after 72 h in release with achievements already added.\n\nThere is practically no story (except \"just build up and move all the NPCs in\") and close to no gameplay progression either. The game gets harder (to bear) by increasing the number of items in crafting recipes - you need the same things, just in dozens this time. Then for a few items it just throws in seasonal event reward trophies into the ingredient list so you can simply get only one or two of them per in-game year.\nThere is the lab which does open up some important things, but once you get one of each of those very few imporant things, that's either it or there is an upgrade to them, but it is of minor relevance and requires an absurd grind.\nThe largest problem though? NPC shops do not sell anything useful really, and only one of each item per day with some (meaningless) exceptions! Wood, stone, meat - you must get all of it yourself, even if you're a billionaire in the end game. And there is no way to automate farming those either. So once you got all important things at the lab, money is useless except for buying decor and replenishing farming seeds from time to time.\nThe time flow is slow, which in itself would be great, except there are things which spawn only at night. And you cannot nap until the evening so enjoy 25 real minutes of just waiting for it to get dark in the game.\nBiomes are predefined at game start and cannot be altered by the player with the exception of some water biomes. Need a larger billabong closer to home? Oh that's just too bad, maybe start a new save.\nWhile unlikely, it is theoretically possible to completely eradicate some plants which produce important crafting ingredients, because the only way to move them is to chop them down, and the number of seeds for replanting them is 0-2 so you can just kill them off is you roll 0's often.\nThe game never explains a thing to you so you will keep tabbing back and forth between Discord or wiki and the game. Good luck remembering to press the actual pause in the menu tab every time, because the time does not stop in the menus and this is also something the game never tells you.\nItem tooltips do not show selling prices of the items or whether they were donated to the museum. Fish and critters cannot be put in containers or stacked - you can place them on the ground, each of them. Enjoy your Great Wall of Harlequin Butterfly. Fish Book and Bug Book need to be held open as if they were a tool to be used. All those can be fixed by mods but this is just such basic QoL that it is a red flag when a released game after years of early access does not have those as features.\nThere are three mine levels of increasing annoyance. Yep, not importance. Once you got all the unique items you wanted from the treasure rooms, level 2 becomes entirely obsolete and you just visit level 1 for ore and level 3 if you desperately need the end game ore.\nYou need to level up farming so much to unlock sprinklers that by the time you get them, you probably stockpiled the crops you needed.\n\nThe list goes on but one thing is clear: it looks cutesy and all in screenshots, but it does not play well. I gave up mid-game. If I were to describe it with one word, my choice would be: annoying.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "It’s a fun game but I’m on steam Deck and I spent well over a hour assigning buttons for every single control needed to be able to play the game and by the time I was done I was highly annoyed.  Devs really need to think more about Steam Deck owners when they develop their games",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Krafton (PUBG, Subnautica, Tango Gameworks) just declared transformation into an \"AI-first\" company, with automated work.\n\nSO what is going to be implemented here, more ai learning and what not?\nWhere is the pre-emptive information about this?",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "This game is fun, if buggy, but I can't recommend it anymore because of the publisher. Krafton are shady scumbags, don't give them your money.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "why does every casual survival game have to be so grindy with like almost no real beginning progression.\nlike im being fucking scammed by the ingame grandma npc, like what do you mean 95k for a house deed, im in the middle of fuck all nowhere its not like the navy is going to sink my island for just building a shack. \n\nthis game is not really fun unless you have the compulsion to just grind resources, which is probably the target audience.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Co-op is a buggy mess with game-breaking issues.\nI only play this game co-op, I have no interest playing single player.\nAwful.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was super addicted while I was still learning the game's systems, but I got to a point where I was left feeling \"... That's it?\". Hard to pinpoint exactly why my overall experience left me feeling negative about the game, but:\n1. Combat (while fun) was pretty glitchy\n2. Inventory management nightmare\n3. I feel like it lacks the careful design and balance that sandbox games need. Starting to feel like \"let's just add more stuff, it's a sandbox game after all!\"\n\nMaybe most importantly, I don't feel like the dev loves his own game. I watched in an interview where he said he doesn't enjoy playing it because he just sees all the things that are wrong with it. And then he talked about some other random games he was excited to play. Just gave me bad vibes that I haven't since been able to shake.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I want to make one thing clear: THIS GAME IS GREAT. It's the publisher that's causing this negative review.\nKrafton is a terrible company. They fired the leads of Subnautica 2 and pushed back the early access release date in an attempt to deny bonuses to employees. If you see that a game is published by Krafton, don't buy it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I loved the game when I first played it in October, it was fun and a nice Cozy game to play with my Girlfriend. But after the animal tracks update, there are so many bugs that it ruins the game for the both of us.  \n\nWe used to be able to take a rowboat out to fish together, now you glitch off of every Vehicle (Including the new trains) whenever you aren't the one controlling it.\n\nCompletely Removed the Night Market,  which is an new feature to the game itself.  \n\nLack of information about what the various tools do. The game tells you next to nothing about *Licenses* do what.  Specially the trapping License.  \n\nNot to mention Many MANY more bugs.  Look into the bugs reports in the steam discussions, you'll see what i mean.\n\nI cannot recommend this game in anyway, shape, or form in its current state.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible Save System, Unstable Multiplayer, i lose tons of progress in multiplayer due to either unforseen bugged out gameplay (game killing bugs) or if my net fails me, a connection status with no way to save the game to checkpoint my progress other than forwarding to the next day with a bed item, also this game tries really hard to be animal crossing when animal crossing has better save functionality, only difference with dinkum is that connecting to the world is 100 times faster than animal crossing, animal crossing being known for dragging it's nuts for 10min to connect players going in and out of the hosts world, oh and locating NPC's in dinkum let alone getting them to move in is one of the more difficult feats of the game, and the museum isn't even that good. 2 rooms with a few windows in them and that's all you get. Hopefully the devs fix the save system at minimum, also the game bugs out if you try to hit it with certain mods, kinda sucks if you ask me, lol. My brother had an old mod installed on dinkum to see sale values of items in his inventory, turns out the mod in the old build used to work but almost completely prevented us from playing together now that the game has achievements after waiting the longest time for the devs to unlock them.\n\nTL;DR: My hopes is that the devs or mod community put in the minimal effort to fix bugs like if you die at midnight while fishing in multiplayer, you can't play the game anymore, you can't mod, you can't save. i'd even remove my negative rating if that happens because technically this games been out for years. And this is coming from an early access player. from 2022",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Krafton sellout and has nintendo switch pre-order exclusives. as an early access player that is yikes",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After the latest patch, the game is full of ridiculous bugs. One of the worst is this: if you die and click Rebirth, the game just ends — you can’t click anything anymore. The entire interface becomes unresponsive, and you’re forced to restart. Please fix this as soon as possible, it completely breaks the gameplay experience.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's pretty boring.  All the mechanics in this game feel very shallow and are uninteresting. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A good game but now its owned by shitty AI bootlickers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is like animal crossing and it's really good but Krafton as Publisher is unfortunately not good. If I had seen it bevor buying and playing, I might have been considering not even buying it after what happened with subnautica 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game. Boring, devoid of fun, hand holding trash fire. 20 dollars would be better spent by being flushed down the drain.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As of right now? No. It's constantly crashing and locking up. On top of balancing that needs to be done. This game can be great, but it still needs work. I'm hoping to eventually be able to say yes, but I'm currently on crash three of the same day. Spring something or other and my pc does meet reqs unless it now requires windows 11 and they've not said anything to us about that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It starts out fun enough, but eventually gets really dull.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The endgame is not great.  A lot of things feel like they're 2/3rd of the way done.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but some of the mechanics are exhausting. Brief examples: \n1. I have storage crates filled with items. When I'm crafting I have to pull out each item from the bin and then take it to the craft table. Maybe I've been spoiled with cozy game mechanics where it just pulls the items directly from any storage device to craft items. \n2. I have 50 pieces of gum wood and I want to make planks: I need to saw each individual plank. No automation system set up.. or maybe that's later in the game.. idk. \n3. If I go to the direct settings it should automatically pause the game.. creating an actual pause button to do that is doing to much.\n\nOutside of that the game seems to have to much to offer, but the grind mechanics for every single thing is not my type of fun. My take is If you love cozy games this isn't for you. If you love the the grind then you found a gem.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've played the demo last year and enjoyed it for some 7 hours or so.\nBought it and ever since I don't like it.\n\nI feel like it's too hard to play with the hours going by so fast, I need to look out for so many animals that attack me, the shop is closed when I go on an adventure into the world. \nJust no.. I tried to return it but no succes. \nI really want to like it but I can't anymore :( It does not feel cosy to me. \n\nThe size of the map and graphics is good though.\nIt's the game itself that I don't enjoy anymore.\n\nMaybe after a few years i'll try it again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decent game, horrible AI firs company.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Why did Krafton come along to destroy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Krafton is pure garagbage as a company",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I am ashamed of how much time I sank to this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The dev sold out to Krafton, yes the same Krafton that sacked the Subnautica devs so they wouldn't have to pay out their bonuses, and then tried to abuse the legal system to gain access to said devs personal devices under the guise of looking to see if the devs had downloaded any files from the game. Oh, not to mention Krafton are pro-generative-AI. \n\nKrafton also hates the players and has banned all use of Mods in this game, under threat of straight up taking the game out of your steam library if you dare to use mods. Krafton are an anti-consumer, anti-player company who do not deserve your money. Do not buy Dinkum for as long as Krafton is the publisher. I enjoyed Dinkum, the game was fun, but I won't recommend anyone buy a game from this publisher.",
      "voted_up": false,
      "votes_helpful": 186
    },
    {
      "review": "THIS GAME IS SO SHIT, YOU ARE THE WORST FUCKING PROGRAMMER IVE EVER SEEN  FUCKING ACTUALLY QUIT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I loved the game when it initially released. But I can't in good conscience recommend it now that Krafton is the publisher. (The same publisher who screwed over the Subnautica devs.) Krafton is not a player-friendly publisher. Krafton hates mods, which have been a decent part of this game from the get go. As stated in their EULA, using mods with Dinkum now runs the risk of them *removing your access to the game*.\n\nI wish James all the best in future endeavors... but aligning with such a shady, profit-over-player driven company who's best interest is themselves... is not a good move.",
      "voted_up": false,
      "votes_helpful": 117
    },
    {
      "review": "[h2]Ok this game has just become tedious, and not fun[/h2]\n\n[i]Edit: Yeah I got 225h in the game, so sure i got my money’s worth. But it is just not fun anymore. The changes made it feel more of a chore than a chill game.[/i]\n\nI came back to Dinkum after a long break since I already had 225h in it and was excited for new content. But honestly, the game just feels way more tedious now.\n\nThe stamina rework kills it for me. Half your bar gone and you’re crawling everywhere. Gliding used to be smooth, now it sucks. Even power tools drain stamina, which just makes everything slower and less fun.\n\nThe game was always kind of grindy. Farming, animals, decorating, the mines. But at least parts of it was still chill enough to enjoy. Now it’s just extra grind stacked on top of the old grind, and less freedom to play the way you want.\n\nI wanted to love jumping back in, but it really feels like these updates are just downgrades with a few added recipes.",
      "voted_up": false,
      "votes_helpful": 75
    },
    {
      "review": "If you want to play co-op, this will only be a frustrating experience. If you're playing single player, i think the game would be fine.\n\nWhen playing co-op, only the owner of the island can buy and place deeds. Which is a problem, because if players focus on separate things (island guest liked to mine and we were running out of copper) as the host, I didn't spend much time mining because we just shared. We cooperated, like co-op games are meant to. Which means in order to get the deed for a mine shaft, I would have to get from level 1 mining to level 16 mining with a lot a permit points. A former workaround of buying the guest buying the deed on their island and placing it in the host's island does not work. \nThat is by far the biggest issue with this game. If that would be fixed, it would be playable for co-op. Right now, it just isn't.\n\nBut a few small things I think could be fixed are as follows:\nThe game doesn't give you any option to share money, so you end up having to have one person not pay on the town debt at all to save up for house upgrades\nGive more liberty to the 'guest' on the island. They should be able to apply for deeds, pay off the town debt completely, \nThe mine shaft requiring all players to go down is an annoyance. I'm sure its easier to program this way, but it's not a good experience for those getting dragged along.\nThe price of items is quite hard to find. Even on the wiki it can be impossible to find. Maybe if we've sold it before to John, it shows up in a notebook, or if we hover over it in our storage?\n\nMy main thing is having the multi-player mode actually feel like more cooperative in nature. My husband and I spent 8hrs on our world for the game to essentially tell us its working against us. And unfortunately, even though we love the game, we won't be playing until this gets fixed. I sincerely hope one of the developers sees this so they can make some small adjustments, because that's really all it needs to be playable in co-op.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "I played Dinkum during Early Access, quite enjoyed it, and would have recommended it at the time.\n\nHowever.\n\nThe full release comes with a EULA which is so user-unfriendly that I have stopped playing, and I will not be recommending this game to anyone in its current state.\n\nHopefully some day this will be corrected and I will be able to change this to a positive review, but for now I must resignedly downvote.\n\n\nEditing to clarify:\n\nMy attempt to be concise has apparently left room for confusion instead. I am not objecting to the existence of EULAs in general, but to specific, nonstandard, terms in this one. Such as the complete ban on modding without exception for single-player mode or disability accommodations. And the agreement not to harm the publisher's reputation, which would have forbidden me from leaving an honest review if I had played the game since the EULA's implementation.\n\nIt's one thing when a EULA protects the company. But this particular one stifles its game in ways that seem contrary to the developer's intent.",
      "voted_up": false,
      "votes_helpful": 123
    },
    {
      "review": "If you ever plan on playing co-op I would skip this game. \n\n(Most of my hours came from single player 3 years ago. I can't recommend this game at all anymore.)\n\nSingle player, you rarely encounter bugs. There's not a LOT of content, but what's there is comfy and decent. You build up a town, make friends, farm, fish, catch bugs, and mine. It's very similar to Animal Crossing which is what made me want to buy it. It's a cozy and relaxing game even if there's not much to do.\n\nCo-op though? Horrific buggy mess. Only the host can really do ANYTHING, which sucks if you both are actually playing the game. To use the mines, only the host can use the pass and they can't just go up when you go down. It's all or nothing which sucks when people are doing different things. I've also encountered wicked bugs when it comes to helping put items in to build the buildings. Frequently I (the guest) would put everything needed into the building and it would ALL disappear the next day. OR it would start being built but if you log off before it's done, the building restarts. It took us 3 tries to figure out what the fuck was going on with my building, losing an insane amount of materials that are rough to get early game. Many times when sleeping and waking up the next day, I wouldn't be able to wake up and I would lose ALL progress from the day before. BUT all the materials I used stayed used. Lost an insane amount of tools, ore, fish, dinks, anything I did from those days. Losing everything nearly every time I play is a maddening experience when trying to 100% the achievements. Found another bug where if you die, you literally cannot do anything in co-op. You end up dead next to your bed, can't text chat, can press escape to do anything. Literally can only alt-f4, Which again, makes you lose literally everything.\nYou also don't share recipes you get from Franklin, so when one person donates disks, the other person cannot have access to those recipes either. They should absolutely be shared since disks, at least where I'm at in the game, aren't easy to get especially in the quantity we need for all recipes.\n\nAlong with the host being the only person able to do anything, only they can put buildings down. So make sure you figure out who the town planner is before you start so it doesn't become a problem down the line. Similarly to buildings, only the hosts relationships to the npcs matter. As well as only the hosts Licenses matter when it comes to putting stuff down (i.e. the mine) Co-op is basically just single player with a puppy following you around that can't really do much at all. This game would be more fun if Co-op actually functioned like an actual Co-op game, especially since achievements were added. \n\nIf you never plan on playing co-op, it's an okay game. Would absolutely skip if you plan on playing with people and you want to do more than just fish and do nothing.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "A fun game with too many bad developer decisions.\n\nThere are too many things that are designed bad, like the save at sleep-system and 3 clicks to pause in singleplayer.\n\nEverything is made to be annoying and grindy instead of being fun. Everything costs too much money for someone just starting out.\n\nThe deep mine is what convinced me to make the review negative. You pay license points, money and materials to build the mine then for some reason you must pay 25k per trip (not even per day). Instead of popping down to just do some fun mining it's a pressure to make sure you get enough loot to justify the cost paid. Also if it's a Sunday and you didn't buy a pass beforehand you're screwed.\n\nThe repair system is equally unbalanced. You pay money and materials to make a repair bench but for every repair you have to always buy an item costing 30k. To get your moneys worth you'll want to fill your inventory with broken tools.\n\nI tried multiplayer before the full release and it was a buggy mess. With the save system as garbage as it is I would never recommend multiplayer. If you have internet issues or if the host has internet issues then an entire days work goes up in smoke.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Since Dev Bendon ultimately sold this game to Krafton, DO NOT BUY THIS GAME. Krafton has a hard-on for putting AI in their games, abusing their staff, and being an all-round awful, anti-player company. Even though Dinkum had so much promise, supporting these types of companies will lead to more dog faeces in this industry.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "If you expected a negative review just because of the Krafton controversy - surprise! This one will tell you why Dinkum is simply a bad game, and that is after 72 h in release with achievements already added.\n\nThere is practically no story (except \"just build up and move all the NPCs in\") and close to no gameplay progression either. The game gets harder (to bear) by increasing the number of items in crafting recipes - you need the same things, just in dozens this time. Then for a few items it just throws in seasonal event reward trophies into the ingredient list so you can simply get only one or two of them per in-game year.\nThere is the lab which does open up some important things, but once you get one of each of those very few imporant things, that's either it or there is an upgrade to them, but it is of minor relevance and requires an absurd grind.\nThe largest problem though? NPC shops do not sell anything useful really, and only one of each item per day with some (meaningless) exceptions! Wood, stone, meat - you must get all of it yourself, even if you're a billionaire in the end game. And there is no way to automate farming those either. So once you got all important things at the lab, money is useless except for buying decor and replenishing farming seeds from time to time.\nThe time flow is slow, which in itself would be great, except there are things which spawn only at night. And you cannot nap until the evening so enjoy 25 real minutes of just waiting for it to get dark in the game.\nBiomes are predefined at game start and cannot be altered by the player with the exception of some water biomes. Need a larger billabong closer to home? Oh that's just too bad, maybe start a new save.\nWhile unlikely, it is theoretically possible to completely eradicate some plants which produce important crafting ingredients, because the only way to move them is to chop them down, and the number of seeds for replanting them is 0-2 so you can just kill them off is you roll 0's often.\nThe game never explains a thing to you so you will keep tabbing back and forth between Discord or wiki and the game. Good luck remembering to press the actual pause in the menu tab every time, because the time does not stop in the menus and this is also something the game never tells you.\nItem tooltips do not show selling prices of the items or whether they were donated to the museum. Fish and critters cannot be put in containers or stacked - you can place them on the ground, each of them. Enjoy your Great Wall of Harlequin Butterfly. Fish Book and Bug Book need to be held open as if they were a tool to be used. All those can be fixed by mods but this is just such basic QoL that it is a red flag when a released game after years of early access does not have those as features.\nThere are three mine levels of increasing annoyance. Yep, not importance. Once you got all the unique items you wanted from the treasure rooms, level 2 becomes entirely obsolete and you just visit level 1 for ore and level 3 if you desperately need the end game ore.\nYou need to level up farming so much to unlock sprinklers that by the time you get them, you probably stockpiled the crops you needed.\n\nThe list goes on but one thing is clear: it looks cutesy and all in screenshots, but it does not play well. I gave up mid-game. If I were to describe it with one word, my choice would be: annoying.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "It’s a fun game but I’m on steam Deck and I spent well over a hour assigning buttons for every single control needed to be able to play the game and by the time I was done I was highly annoyed.  Devs really need to think more about Steam Deck owners when they develop their games",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Krafton (PUBG, Subnautica, Tango Gameworks) just declared transformation into an \"AI-first\" company, with automated work.\n\nSO what is going to be implemented here, more ai learning and what not?\nWhere is the pre-emptive information about this?",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "This game is fun, if buggy, but I can't recommend it anymore because of the publisher. Krafton are shady scumbags, don't give them your money.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "why does every casual survival game have to be so grindy with like almost no real beginning progression.\nlike im being fucking scammed by the ingame grandma npc, like what do you mean 95k for a house deed, im in the middle of fuck all nowhere its not like the navy is going to sink my island for just building a shack. \n\nthis game is not really fun unless you have the compulsion to just grind resources, which is probably the target audience.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Co-op is a buggy mess with game-breaking issues.\nI only play this game co-op, I have no interest playing single player.\nAwful.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was super addicted while I was still learning the game's systems, but I got to a point where I was left feeling \"... That's it?\". Hard to pinpoint exactly why my overall experience left me feeling negative about the game, but:\n1. Combat (while fun) was pretty glitchy\n2. Inventory management nightmare\n3. I feel like it lacks the careful design and balance that sandbox games need. Starting to feel like \"let's just add more stuff, it's a sandbox game after all!\"\n\nMaybe most importantly, I don't feel like the dev loves his own game. I watched in an interview where he said he doesn't enjoy playing it because he just sees all the things that are wrong with it. And then he talked about some other random games he was excited to play. Just gave me bad vibes that I haven't since been able to shake.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I want to make one thing clear: THIS GAME IS GREAT. It's the publisher that's causing this negative review.\nKrafton is a terrible company. They fired the leads of Subnautica 2 and pushed back the early access release date in an attempt to deny bonuses to employees. If you see that a game is published by Krafton, don't buy it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I loved the game when I first played it in October, it was fun and a nice Cozy game to play with my Girlfriend. But after the animal tracks update, there are so many bugs that it ruins the game for the both of us.  \n\nWe used to be able to take a rowboat out to fish together, now you glitch off of every Vehicle (Including the new trains) whenever you aren't the one controlling it.\n\nCompletely Removed the Night Market,  which is an new feature to the game itself.  \n\nLack of information about what the various tools do. The game tells you next to nothing about *Licenses* do what.  Specially the trapping License.  \n\nNot to mention Many MANY more bugs.  Look into the bugs reports in the steam discussions, you'll see what i mean.\n\nI cannot recommend this game in anyway, shape, or form in its current state.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible Save System, Unstable Multiplayer, i lose tons of progress in multiplayer due to either unforseen bugged out gameplay (game killing bugs) or if my net fails me, a connection status with no way to save the game to checkpoint my progress other than forwarding to the next day with a bed item, also this game tries really hard to be animal crossing when animal crossing has better save functionality, only difference with dinkum is that connecting to the world is 100 times faster than animal crossing, animal crossing being known for dragging it's nuts for 10min to connect players going in and out of the hosts world, oh and locating NPC's in dinkum let alone getting them to move in is one of the more difficult feats of the game, and the museum isn't even that good. 2 rooms with a few windows in them and that's all you get. Hopefully the devs fix the save system at minimum, also the game bugs out if you try to hit it with certain mods, kinda sucks if you ask me, lol. My brother had an old mod installed on dinkum to see sale values of items in his inventory, turns out the mod in the old build used to work but almost completely prevented us from playing together now that the game has achievements after waiting the longest time for the devs to unlock them.\n\nTL;DR: My hopes is that the devs or mod community put in the minimal effort to fix bugs like if you die at midnight while fishing in multiplayer, you can't play the game anymore, you can't mod, you can't save. i'd even remove my negative rating if that happens because technically this games been out for years. And this is coming from an early access player. from 2022",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Krafton sellout and has nintendo switch pre-order exclusives. as an early access player that is yikes",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After the latest patch, the game is full of ridiculous bugs. One of the worst is this: if you die and click Rebirth, the game just ends — you can’t click anything anymore. The entire interface becomes unresponsive, and you’re forced to restart. Please fix this as soon as possible, it completely breaks the gameplay experience.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's pretty boring.  All the mechanics in this game feel very shallow and are uninteresting. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A good game but now its owned by shitty AI bootlickers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is like animal crossing and it's really good but Krafton as Publisher is unfortunately not good. If I had seen it bevor buying and playing, I might have been considering not even buying it after what happened with subnautica 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game. Boring, devoid of fun, hand holding trash fire. 20 dollars would be better spent by being flushed down the drain.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As of right now? No. It's constantly crashing and locking up. On top of balancing that needs to be done. This game can be great, but it still needs work. I'm hoping to eventually be able to say yes, but I'm currently on crash three of the same day. Spring something or other and my pc does meet reqs unless it now requires windows 11 and they've not said anything to us about that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It starts out fun enough, but eventually gets really dull.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The endgame is not great.  A lot of things feel like they're 2/3rd of the way done.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but some of the mechanics are exhausting. Brief examples: \n1. I have storage crates filled with items. When I'm crafting I have to pull out each item from the bin and then take it to the craft table. Maybe I've been spoiled with cozy game mechanics where it just pulls the items directly from any storage device to craft items. \n2. I have 50 pieces of gum wood and I want to make planks: I need to saw each individual plank. No automation system set up.. or maybe that's later in the game.. idk. \n3. If I go to the direct settings it should automatically pause the game.. creating an actual pause button to do that is doing to much.\n\nOutside of that the game seems to have to much to offer, but the grind mechanics for every single thing is not my type of fun. My take is If you love cozy games this isn't for you. If you love the the grind then you found a gem.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've played the demo last year and enjoyed it for some 7 hours or so.\nBought it and ever since I don't like it.\n\nI feel like it's too hard to play with the hours going by so fast, I need to look out for so many animals that attack me, the shop is closed when I go on an adventure into the world. \nJust no.. I tried to return it but no succes. \nI really want to like it but I can't anymore :( It does not feel cosy to me. \n\nThe size of the map and graphics is good though.\nIt's the game itself that I don't enjoy anymore.\n\nMaybe after a few years i'll try it again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decent game, horrible AI firs company.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Why did Krafton come along to destroy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Krafton is pure garagbage as a company",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I am ashamed of how much time I sank to this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The dev sold out to Krafton, yes the same Krafton that sacked the Subnautica devs so they wouldn't have to pay out their bonuses, and then tried to abuse the legal system to gain access to said devs personal devices under the guise of looking to see if the devs had downloaded any files from the game. Oh, not to mention Krafton are pro-generative-AI. \n\nKrafton also hates the players and has banned all use of Mods in this game, under threat of straight up taking the game out of your steam library if you dare to use mods. Krafton are an anti-consumer, anti-player company who do not deserve your money. Do not buy Dinkum for as long as Krafton is the publisher. I enjoyed Dinkum, the game was fun, but I won't recommend anyone buy a game from this publisher.",
      "voted_up": false,
      "votes_helpful": 186
    }
  ]
}