{
  "positive": [
    {
      "review": "1,500 hours and counting.  Not sure what else I could say that would add to that.\n\nedit:  I have been accused of not writing a helpful review.  \n\n\"mick Nov 3 @ 9:25pm \nwell you could leave an actual review. that might help.\"\n\nSo I thought I would edit my review to add more information.  Here we go...\n\nTimberborn is a game about Trees.",
      "voted_up": true,
      "votes_helpful": 137
    },
    {
      "review": "I spend too much time on this game. I own plenty of other colony sims - Banished, Against the Storm, Worshippers of Cthulu all come to mind (I know I own more). All of those are fantastic games that bring something unique to the table (I truly recommend those as well). However, something about Timberborn always keeps be coming back. Is it the water mechanics? The woodpunk vibe? The cute beavers trying their best? I honestly can't say, but I have played this game way back when vertical power shafts were a separate building, back when you had to make massive \"stairs\" to transfer power upwards. Every hour felt like I had something to do, every project felt like it had lasting rewards. With each update, what they added always sounded so little - \"made stackable power shafts\" or \"changed platform recipes\" - yet each always made a massive impact on the game in my opinion - and in good ways at that. I really look forward to 1.0 and hopefully one day they will add a third or fourth faction, causing me further decision paralysis when starting a new town.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "This game is hours of fun with each new update bringing lots of new fun to be had.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Can sometimes have a bit of a steep learning curve, and can be unforgiving if you don't manage your beavers properly, but overall an amazing game.  9/10.  10/10 if they ever get the water physics to stop being janky and sloshing around constantly after a drought.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The hydric engineering + changing climatic conditions are fun and challenging. The world building is pretty and rich. Man see menbeavers accomplishing feats of engineering, having children and living happily, man happy!\n\nWhat I miss:\n\n- rain and more immersive/realistic weather;\n- better quality of life, I miss things like templates and undo;\n- load bearing and water load mechanics but that is asking too much.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game. I love the relaxed nature of it, music is great and so many ways to play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good, solid city-builder/simulation game that doesn't require autism to play (lookin @ u factorio). Highly recommend following some of the content creators to get started (JCTheBeard for beginners, Zeddic once you know approximately what you're doing). Has kept me engaged where most games like this don't.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game but suffers from no building keybinds. How can you release a game in 2025 and have no keybinds for buildings?? You have to open the menu and click every time you want to place a path! It's so terrible and clunky. I like this game a lot but if the devs fully release the game with no building keybinds, I will not be playing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A fantasticly fun, cute, and complex city builder, with each map providing an open ended puzzle for you to figure out when you are making your city. You can play against the challenge, or turn off any individual element that adds challenge/stress to the game and just enjoy making an adorable little beaver city diorama. (there's literally a tiny map called diorama)\r\nAs of this review, its still in EA, but there's enough content to make it well worth buying now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun resource manager, supply chain, city building game. Beavers are fking awesome.\r\n\r\nSo far my favorite mechanic is the cycles and droughts.  It creates the importance of building dams, storage facilities, and making sure you're city doesn't flood when the rush of water comes after the drought. \r\n\r\nThe tutorial was perfect. Not overbearing, quick to get through, and sets you up to get into the game and learn the rest naturally. Since then I've been hooked.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Updates are very frequent and even though the game seems to lack an objective, it is a great city builder game, and a ton of mechanics are fun to play with. Cute little beavers zip-lining across your cityscape is very unique and a great feeling to watch all of your little citizens working. Excited to see where this game goes, more of an objective for late game would be great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game reminds me of Banished, but more technical and more detailed, and it's not a bad thing.\n\nBetween Timberborn, Against the Storm, and Farthest Frontier, we city/colony builder players are eating pretty good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bóbr... \nbut seriously, this is a great game. It grabbed me immediately. I wish it had more races but the game is solid either way. Definitely worth the money. Playing God to a bunch of beavers... what more could you want?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game, nearly bug free and about to hit 1.0. Really good price on sale. Very good replayability since your strategy can vary a lot each time, and there are lots of unique maps to play,  and even more made by the community. The difficulty is also extremely customizable, depending on your preferences.\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has certainly come a long way, Still figuring out all the logistics but, its pretty fun to play.  I am not brave enough to play off of normal mode but I enjoy the constant threat of disaster if your not on your toes when a bad tide roles around.  But I also love the satisfaction of knowing my very prepared beavers can tackle any task.\r\n\r\nYou start off with a small batch of tailed folks and have time to get situated before your first drought, but don't waste time getting fresh water stored up. cause drought is a coming.  It has been a  lot of fun watching my little beaver village grow in to a thriving city with the expressed goal of reforestation of the badlands. There are so many unique buildings with so many functions to help your beavers quality of life and efficiency in expansion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A truly fantastic colony simulation game which is more than happy to kill your whole settlement if you're not prepared.\n\nStay hydrated dev team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome builder game, love the water physics mechanics, can't wait for the full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just fanastic. I've watched it develop from near the start. The team really care and can't wait to see where they take it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got 1500 hours in this game, on another platform. great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best colony sim I've ever played. \nIt was cute and replayable when it was released into EA, but it got better with every major update.\nUnique water physics, and verticality for everything finally! I always hated the infinite city sprawl, here I can build the best cities with minimal footprint. With the Ziplines & Tubeways update, literally the sky is the limit... and maybe the amount of incoming water.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun colony builder with some unique mechanics.\nThe  community maps really increase the replayability and add some great challenges.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game with lots of big updates that keep it surprising every time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my favorites games of all time!  I've been playing it in early release for years now, and I'm really excited that they are releasing it.  The early access experience has been great.  Each release was well thought out, from the new features, to the rebalancing as needed, to the support for modding.  I've really enjoyed playing the game and excited to continue!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice and relaxing game, love the beavers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have been playing this game for years, and I still love it. Every update makes the game better and better. Would highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought I'd \"recommended\" this game ages ago but apparently I hadn't so this must be fixed! Definitely one of my all time favourite games. It's got just the right amount of challenge to keep me interested and calmness to be relaxing (the soundtrack is great and hasn't gotten tedious yet) so I want to keep coming back. First played the demo version and it's been great seeing changes and improvements over the years, you can really see the love put into it. I hope to play for many more hours and build countless beaver civilisations. Viva la beaver!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game, i truly get lost playing and i definitely do not get stressed when my beavers are struggling lol I love it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite colony sim game.\nVery good from graphics to sound and theming.\n\nI have two issues:\nLack of threats\nLack of win conditions.\n\n\nThreats: You only need to fear bad water ( think corruption) and draught (no water - duh) The issue with this is that once you get to about mid game you pretty much overcome these by infrastructure upgrades and terraforming (routing bad water away where it doesn't effect you and is more like another small drought).\n\n\nGoals: The above isn't strictly an issue necessarily if you have win conditions and or time constraints but currently those don't exist so the way I play is when I get the itch to play Timberborn I play a new map and take 20 to 30 hours to master (have no danger of death). Then I drop it until I get the itch again. My first time picking up the game I was hooked for 50ish hours which I think is pretty good value.\n\nFixes: Add monsoons. If it could flood it would be harder to find my way to just having no threats to save file.\nAdd win conditions. This would keep me playing to complete the maps and game. Basically a more healthy game loop imo.\n\nTL:DR - Great game. Lack of threats and explicit win conditions can lead to gradual loss of interest but there is still plenty of hours to be had in learning how to overcome the few threats that do exist. I would expect anyone to get 35 hours out of this minimum.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I blink and I've been playing this game for 8 hours without eating. Dangerously delightful. I'm getting married in June, and our wedding cake topper is beavers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game. Goes through evolutions in gameplay as your city grows in complexity, eventually reaching the point where your beavers are technologically advanced enough to relegate tasks to automation. Design is gorgeous and the game runs smooth. An exceptional early access success. Deserves all the praise it's getting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game. After +400 hours of playing it, I can't say it's boring. It becomes repetitious after a while, but the devs have made sure to stir stuff up every once a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timberborn is one of the best city builder games I have played and has incredibly good graphics. I would definitely recommend this to anyone who is interested city builder games. 5 stars!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Timberborn! A colony of beaver engineers and water management. This game has given me many hours of entertainment and pleasure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to learn, tough to master. I've lost myself for near countless hours in my little Beaver world. If you enjoy city builders and resourse management games like Banished, you'll have a great time. I cant wait for future updates. This game is a labour of love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really have been enjoying playing the game, now that I've finally gotten into it. The water physics and terrain manipulation allows for some truly large projects and long gameplay time.\n\nSome more concrete goals, external pressures not involving the climate/environment or even some trading functionality would be a cherry on top, but an overall wonderful game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beaver city-builder that's surprisingly deep. The drought/water cycle adds real tension - you'll panic the first time your colony runs dry. Vertical building is clever, and watching your dam network grow is satisfying. Two factions play differently enough to matter. Can get repetitive in late game, but easily worth it for the \"just one more dam\" factor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Who as a kid never tried to build a dam and reroute water? You can live out those old memories and dreams and create something cool.\r\n\r\nManaging resources and the occasional poisonous water or drought makes for an interesting and fun gameplay loop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and addicting game. A rather unique and quality city builder. The Devs have kept up on adding new stuff to the game. There is a sizable modding community further adding to the game content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, I've been playing for a few years off and on and it has always felt like a polished game rather than early access. I've seen only a couple bugs and nothing game breaking (but note I've never played on experimental). Like some other colony sims, the early game can be difficult and later game becomes pretty easy (even on harder modes/maps), but enough to keep me entertained for a while building megaprojects or making sure the colony can survive without my input or maxing out beaver happiness. Once you're \"done\" with a save there are tons of other maps to try out either vanilla or player made. Only two factions now, and no indication that they'll add more. Beavers are cute.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really intuitive fluid mechanics, power grid systems, and transport systems, integrated with a survival colony builder. 10/10. Banished meets Factorio, with beavers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoy this game as there is alot of maps to play but wanted for faction of different bevears if can. Still liking this game still.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's been in EA for a while but it's a great city builder/colony sim. It's worth more than the $35 it's going for now so grab it while you can.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cozy city builder with a unique twist where managing water and how it interacts with the world is essential.\r\nOh, and awesome beavers to run it all!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "vErY GooD GaMe, love this  type of game, pls do one game with lizards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played day 1, since the game has launched. I really like seeing how the game has progressed since then. a fun, unique city building game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this one surprised me. Beavers rebuilding civilization after humans went extinct sounds gimmicky, but it actually works. The whole water management thing isn't just flavor, it's the core of the game and it's done really well.\n\nDroughts keep you on your toes without being frustrating. You can't just build and forget, there's always some planning ahead involved. It hits that sweet spot where it's challenging enough to stay engaging but not punishing enough to make you quit.\n\nWhat I really like is how the game pushes you toward managing multiple colonies on the same map. At some point, one settlement isn't enough anymore, and you need interdependent districts sharing resources. It's tricky to balance but it feels rewarding when it clicks.\n\nRecent updates added some nice stuff too. The wonders give you long-term goals to work toward, and the new transport options make the multi-colony gameplay way smoother. Keeps things fresh even after many hours.\n\nIf you're into city-builders and want something different, this one's worth checking out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timerborn is one of those games that you keep coming back to. Like where it started and like where it's going/how it deveolped.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game that has a learning curve. Nice a relaxed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A truly great game. Very enjoyably. Easy time sink. Never knew I wanted to keep water so much!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pure love.\r\n\r\nChill City Builder with enhanced water physics. Go ahead and bring glory to the barren lands!\r\n\r\nIt just works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, simple easy to understand mechanics, a fantastic way to relax.\nLooking forward to the official 1.0 release!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super good cozy game. Beavers doing water engineering. Really enjoyed it and the water physics. Once you get bored, turn up the difficulty and stay there for fun gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool and relaxing game. Hours of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an amazing city builder with silly little beavers, plus content is always being added and improved at a consistent pace",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Lots of fun,  I enjoy just improving my city over and over until my processor begins to cry from the shear number of beavers running around on the screen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play from update 5 to now.\nIt's so fun. I also love the mod that lets me manage idle beavers. Automation for unemployed workers is a complete game-changer and dramatically boosts colony efficiency.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game for relaxing, and with mods also a great challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love how it is a calm sandboxy game about cute beavers it is well made and it is also very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a chilled game with cute lil beavers. Have to say this is a game I find very relaxing. Its also very awesome that I can play it, disappear for a while, then when I return, there is a host of updates that make the game all new and fresh. Good work guys! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I guess, it is time to recommend the game, after 118 hours or so. It's good settlement manager, you can put a lot of creativity with terrain, water flow and pathfinding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timberbron is surely one of the best, maybe even the best city builder games out there! I love the theme of the game, with all the bevers and the game being updated shows that the developers want to improve the game. And if you've played the game, you now it can have some difficult challenge especially later on when for example you have a lot of beavers that have noting to do even in spring time and so they don't help with anything and just drain your resources. Hope this helps and; Would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A challenging colony simulator which has been the most fun I've had in a while. It is easy to adapt to and has a great workshop community which can change the game's dynamics whether easier or harder. The map editor is fantastic and with the newer features added the maps can be made much more interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing since EA. The dev team keeps delivering. I've fallen in love with the Iron Teeth. I get addicted each time i open the game and play for hours and hours. Every addition brings more love, more pain, more beavers. I don't want to spoil any second of your next beaver session. Just know, I adore Timberborn!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy it, play it. An early access reaching it's end. Fast approaches the fabled 1.0 version. Worth every single cent and will continue to be for years to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A well-crafted and engaging city builder, which I've sunk hours too during Early Access. It has continued to improve throughout its development, but even in it's current state, this is a game I can strongly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game good take on factory management managing water is fun flowing it around. Death Spirals for food and water to strong.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely amazing game, very soothing and well planned",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's easy enough to learn but hard to complete. Great balance, very satisfying gameplay. Addictive af",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game really scratches the city builder itch for me like no game has in a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent colony sim that trades out complexity of maintaining the colony in for complexity in big terraforming, water flow control, and building projects. Timberborn has both a very gentle start for newbies to the genre as well as enough depth for people who want complexity to seek it out and get rewarded for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive, cute & tough; this world builder focused all around retaining water has more than enough to keep you entertained and it is just about to leave early access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's everything you want in a colony sim game with the wonderful mechanic of the water and the wonderful ways in which you dam it, divert it, move it or store it. I have played this game from the beginning and have only watched it grow and am so excited to see where it continues to go.  I am hoping for some more diverse and interesting environmental or other types of hazards that change up the game play but otherwise all I can say is I love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun different kind of city builder. Can be anywhere from simple to difficult in terms of game play.\nThe beavers are adorable! Can't wait for 1.0",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timberborn is an excellent game! It is mostly chill with just the right amount of stress. It is the perfect game to exercise your ingenuity! The music and ambience is wonderful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. The game sucks you in with its cute graphics, but death is just around the corner with its droughts and badwater tides. Start with simple engineering, slowly grow and expand and you will end up with an intricate setup of power generation and water generation that can withstand even the longest droughts. In addition to that, The two playable factions look and play very differently, so expect to play at least two runs if you want to have seen everything what is in the game. It is worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful and cute game that gets regular updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "having played this game for endless hours, and watching it from a really early stage, I can safely say that this is one of the coziest colony management games on steam, and well those badgers are just so darn cute! \n\n9/10 for the game, because well, there's plenty more the developers are working through and resolving, editing and developing for the game.  so maybe it will be a 10/10 when the final release comes!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy, addictive, intricate, labor of love! I've been playing since year 1. Cant get enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already good years ago. Got better with time. Some updates brought setbacks. The beavers took on the task. They built their shining city on a hill. \n\nTime to start a new colony. Build ever upwards, ever further from the starting hall. Make the earth green again. One map at a time.\n\nThis game speaks to me in ways other city or colony builders could not. The ability to build things on top of each other is just too good to not miss every time I go back to the other side of the fence. And Pile Up is not good enough to get that fix. So I come back to the funny beaver game. Again. And again.\n\nThis is a very good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A neat, fun city builder. The main feature is environmental engineering. Water management to be precise. The game doesn't include direct objectives other than SURVIVE. And it isn't that hard to survive once you get a hang of the mechanics. You will face droughts and \"badwater\". The latter can be a bit tricky to manage. But still, the challenges don't really require you to develop far into the tech \"tree\". So, after the first 10-15 hours, you need to get a bit creative with infrastructure or other big projects in order for this game to shine. Or try harder maps\n\nI hope developers will include missions or something like that in the full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, i love how to developers keep supporting this game with continuos new updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fun, probably my favourite game ever. There is simply no argument to me about how interesting it is, and badtide mechanics are, while hard, still fun when you overcome them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timberborn is a wonderful colony builder focused on survival in a post human world.  Beavers have become farming and even engineering powerhouses capable of transforming the very earth they stand upon.  Look into the modding, it's a wonderful addition to the already awesome gameplay.  \n\nSlam that buy button!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addicting play where the end goal is efficiency. The constraints are merely problems to be solved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very well optimised and incredibly addictive game. The devs let you make it as easy or as difficult as you want which respects the players time. The player though may not respect their own time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun little chill game with plenty of new content dropping, it just keeps getting better and better, worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of fun, unique game for once! created a genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the strategy of this game, the different factions, diificulty levels and the extra things that are added in with every update just make it even more replayable each time I come back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best and addictive game ever. best recommend to all who love building and looking cute beaver. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this off and on through out its development, the group has had a great simple city builder with cute beavers. The tech tree is small and manageable, the water engineering is pretty fun, and slowly building out a map from the hard scrub of a dried dead world into green of grass and trees is really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's frequently updated, has a very cozy atmosphere, and is incredibly satisfying to play once you get past the smaller learning curve. \n\nVery fun game to just play after a really long or stressful day, plus the modding compatibility adds even more replay value. Definitely worth the money, highly recommend in early access. I will be waiting tentatively for the full release :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best sandbox colony sim around, featuring a unique water-physics system, a charming beaver theme, and vertical construction. For an Early Access game, it's surprisingly refined and stable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got so distracted with building my beaver empire I forgot to set up floodgates to deal with the badtide. Got 5 badtides in a row. My entire weekends progress got wiped out by starvation. 10/10 game can't wait to spend next weekend doing it again. beavers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, if you enjoy city builders, then this is a must have! The vibe and atmosphere of this game is incredible. Beavers are the best!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No city builder game has every gotten me so addicted so fast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love timberborn, it fills the empty hole in my sole, i might be addicted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! You can tell the devs really care about this game. The beavers are good at inventory management and you can manage imports/exports between districts and between warehouses within the districts. The UI is well laid out. The game looks great and it looks like 1.0 will look even better. The water physics is fun to play with, I love building dams and reservoirs to survive the droughts and bad tides. If you like city builder/colony management games you'll love Timberborn!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game about beavers and building bases.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mix of survival and city building. The water management is a fun addition to this type of games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun and relaxing game (aside from those times when you accidently get your water engineering wrong and flood everything. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I didn't understand it was just a sandbox game.  I thought it would have a campaign story, with structured objectives.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games been out for nearly 5 years.. no story, no achievements , no puzzles or challenges.. it really is over hyped. all to boot 2 factions. that have been the staples for years. sooooooo no id say save your buckets unless your looking for a mindless builder or you find a sweet sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's gonna be a no for me, which is a shame because the game itself is really nice. It plays well, it's fairly intuitive, it looks nice, the music is great. But it seems to be brutally balanced. And maybe that's just me, this isn't my favorite genre of game and maybe I'm just not as good at it as others are. But at the end of the day, if a game just isn't fun, I don't waste my time on it.\n\nIt's a game of 3 steps forward, 2 steps back, 1 step forward, 3 steps back. Any time you think you have any semblance of progress, something comes through and wipes out 3/4 of your population. So you build even more defense against it the next time, and the next time is even worse.\n\nI get it, disasters are part of the fun. But is it realistic to have a drought every other day? And on top of that there simply isn't enough usable land on these tiny maps to plant enough crops to store to make it through.\n\nIf you're good at it, I applaud you. I found it too frustrating to continue fighting with. My game time is better spent on fun and relaxing games, not games that wipe themselves out every 10 minutes.\n\nIf you want a good challenge, I think you'll like it, but it ain't it for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think this is probably a very good game, but I just didn't have fun with it. 100 minutes in I was still well in the tutorial--and the tutorial just seemed to move so slowly? It would say to build such and such and I'd need to wait for two little guys to deliver the wood--maybe there's a way to get more little guys working on the project, but I couldn't see it. And the fact that the tutorial wouldn't just let you build one of something and move on, but made you build multiples felt very hand-holdy and like they didn't trust the player to make their own informed decisions. You could still build things between-- I built an extra logging site and an extra housing unit. Not trusting the player to be able to figure out on their own how many of something they need made the tutorial drag needlessly.\n\nAlso, considering how much personality the little guys seemed to have, I was a bit disappointed that they didn't do anything regarding their story. Like, I figured out on my own that they stopped work at sundown, all went to drink, then all went to eat, just by observing. It would have been cute to get an update on the families at that point, or even a notice saying \"Your work is done for the day, time to relax\", etc. They seem to have family units. Only getting updates on when babies were born and when they aged up was a bit weird, for instance. Even knowing that a little guy was assigned to a tasked that he excelled at or one he was struggling with-- there are so many options here to give a bit of character to these guys and make you care about them/the world more because of it.\n\nIt also bothered me that I felt like I couldn't speed the game up since these little guys seemed to have the self preservation instincts of a lemming. I kept getting notices that someone was dehydrated. You couldn't click on them to make them get water. You'd just watch them walk all over kingdom come with their little flashing yellow icon without any way of convincing them to drink. This clearly was normal and wasn't going to result in them dying, but the yellow flashing icon along with the red bar in the character panel made me think it was a very real possibility they'd die of thirst the first few times this happened. After following one of the little guys from the time his dehydrated icon popped up to the time he drank, I just stopped caring as these guys do seem to take care of themselves, just not as swiftly as I'd like.\n\nAlso, I personally prefer more colorful (literally color) city builders. This was very brown. And it got browner as you played.\n\nAnd I'm a laptop player which didn't control the best--likely this would control much better for mouse players. \n\nFor anyone who said this was their favorite game, I can see why--the ability to build upwards alone looks like it would be incredible. The way that research worked was cool. I can see there are replanting options, which is great for forests to not remain barren. It looks beautiful. It's just not the kind of city builder I want to play--I prefer city builders with more personality to their characters if you can interact with them, and less hand holding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd love to post my actual review that covered many of the game's aspects and provided a detailed look into what I like and what I don't, but when I changed it from \"yes\" to \"no\" steam decided that it'd be a great idea to delete the entire fucking review and instead ask me if I want a refund on a game I've put 50 hours on. As such, please enjoy an extremely summarized conclusion:\n\nIt's a game that parted from a very solid idea but has barely been developed over 3 years of early access, providing the same flaccid, directionless game it started SEA as, where the player has no goals and no motivation to do anything other than for the sake of it. It will capture your attention for as long as it takes you to realize how hollow and devoid of any substance it is.\n\nThere's no reason why you'd want to expand your food production, because your population don't expand until you make more housing. There's no reason why you'd want to obtain better resources, because they're only used for, at best, convenience. Sure, you'll have to face increasingly longer droughts, but when food never expires and storage is infinitely stackable, is that [i]really[/i] a problem?\n\nThis is a technically competent but creatively bankrupt game that frontloads its only two gimmicks (stackable buildings and water physics), does barely anything with either, and is too afraid to impose any friction or pressure on the player to engage with its mechanics beyond the absolutely baseline level. 4/10.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Overall, I do not recommend this game unless you enjoy overcoming the initial survival challenge, then enjoy building a city after the fact.\n\nTimberborn is a great concept and has a great foundation. The issue is that the survival aspect of the city builder is completely removed  once you've built a reservoir and diverted the bad water to prevent contamination. After that it becomes boring.\n\nI have suggested on multiple occasions now that the devs need to keep the tension in the game by introducing flash flooding and even rain so that the player has to focus on creating a colony that won't flood with ditches to help the water escape as well as ensuring flash floods do not destroy their colony by ensuring more water management and planning is required. Things like this which would have at least extended the tension in the game.\n\nAlas, with 1.0 being announced, there is nothing like that. Just more buildings, but nothing to add to the survival aspect of the game.\n\nDespite my many hours, I do not recommend this game if you're looking for that continual tension in a city builder.\n\nIf you are looking for a survival city builder that has that continual tension, then I recommend Whiskerwood which released recently to EA. There is continual tension throughout the game thanks to the taxes. More experienced players will need to crank the difficulty settings up for it though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state, it's a complete rip-off.\n\nAsking more than 30 euros for this game is robbery, a scam, and I deeply regret buying it because it's not worth it. It's far from ready for version 1.0. The game suffers from numerous shortcomings, making it unsuitable as both a tycoon and a city builder. Development up to version 0.7 (which I've played and is the currently available version) is poor, lazy, and very shoddy.\n\nI don't understand why people are giving positive reviews to an unfinished game that isn't ready for the market. I don't know when we gamers allowed ourselves to be ripped off like this. To elaborate on this criticism:\n\n- The \"soundtrack\" consists of only one track.\n- The \"tutorial\" (if you can even call it that) explains absolutely nothing about a key game mechanic: landscaping.\n- There's no narrative or foundation for gameplay; The player has no clear objective.\n- Numerous buildings are missing, hindering the architectural variety of the settlements.\n- The only \"events\" consist of making the player's life miserable every few clock cycles, and again, without any justification.\n- The industrial chains are very basic and poorly designed, both mathematically and logistically.\n- The technology tree doesn't exist.\n- The factions are mere reconceptualizations of the game, without any real difference or rivalry between them.\n\nI'm not saying that Timberborn, as a concept, could be a great video game someday. What I am saying is that for now, it is precisely that: a CONCEPT, not a video game, and therefore shouldn't be priced like one. \n\nI won't buy anything from this developer in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to like this one. But I think I'm just too used to the speed of other games of the genre- the 3x speed button really does nothing to progress the actual speed of the beavers. It feels frustrating not to have an option that actually feels like anything is being progressed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sobrevalorado. Es uno de esos juegos que compré por las reseñas positivas y no se las merece. Doy una reseña cortita y al pie:\r\n- Es un sandbox. No tiene campaña ni trama de fondo.\r\n- Por más que se te mueran castores, todo el avance que fuiste haciendo hasta el momento hace que los que queden vivos estén sobrados para salir adelante.\r\n- No tiene sistema de penalización como que los castores te destituyan y pierdas. Siempre vas a salir bien parado.\r\n\r\nLo voy a seguir jugando cuando quiera estar tranquilo tomando algo, pero no tiene más gracia que eso.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games just suck not enough explanation on building and upgrade. It's all guess and restart because you didn't know something that could have extremely easily explained with one or two line of text. Lazy and time wasting. I play game to relax not to enrage myself with stupid bad design. Greatly regret buying this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good in 3D Building, yet still shallow in all resource and environmental complexity",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "still makes me mad that I paid for this. every time I have time to play there has been an update that crashes my computer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't quite recommend this game yet. It's easy enough to get a city going, but then it drags. There aren't many clear objectives, unlocking some of the advanced customization things takes quite a while, and some aspects are confusing without a bit more tutorial/instruction on how to manage certain buildings or resources.\nHonestly, I'd like a bit more direction or objectives to hit in order to further the city.\nAlso, when trying to re-work an area due to limited space or having to add additional buildings, it can be extremely tedious with moving the paths which are required to connect the buildings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The tutorial is abysmal\n\nFirst - Put down a lumberjack flag for lumberjacks to cut trees. Nothing happens (oh it needs to be within range of the district. Problem is, you can only see that district range, when clicking on the district building, so when you can't see that range, you are likely going to accidently build a flag 1 tile out of range, need to delete and keep trying until it lands within range.\n\nnext build a path to the flag, (It doesn't show you where or how, but simple enough)\n\nWhen you've connected a path and mark tree's for cutting, the game doesn't tell you that the trees next to your district / flag (in range) can't be cut as they're up a step? (because steps actually count as a path space, why can't players just build steps so it makes more sense with the path, I mean when the Lord God created this world, he made everything, but he never made flippin steps did he!)\n\nok there's some trees on the opposite side, created path, flag and highlighted trees for cutting. They're not doing anything.\n\nAt this point it's hard to tell if the games broken / bugged or whether the dev has just made a counter intuitive tutorial. Maybe it'd be easier ignoring that and trying, but so far not impressed...\n\nUpdate: My wife said \"Try building a path to the trees\"\nShe was correct, we both went huh? as suddenly the beaver can finally WALK to the trees, because there's a path, but to get to the path, he still walked on the dirty grass where he was waiting previously. There are beavers standing all over the grass area's between the log camp and the tree's, but to get to the grass near the tress to cut them, you need to build a path ??????????????? I'd consider this as a bug.\n\nWhy do you need a path to get your beavers to walk from the grass where they are resting, to grass area around the trees so they can cut them? aghhhh\n\nSo NOW knowing that weirdly paths extend the districts borders, you build a water pump, and all the beavers are complaining they're dehydrated ? fml\n\nThat's because it's night time, and rather than get water from the river and drink like any normal beaver, they just stare at the water because they're too dumb to drink it...\n(And they won't use the waterpump to get a drink because they refuse to work at night-time)\n\nImagine waking up with a dry throat in the middle of the night, hard to breathe, but you can't use the tap because it's night time...\n\nMorning comes, and every time my water pump provides a beaver a 1x glass of water, they drink it so there's quite some queue for my beavers waiting for a drink.\n\nI actually hate the design of this game like one of the worst city builders I've ever played in my life, (Logistic wise) and I've played them all (Since city building is my fav genre).\n\nLittle things like \"Depth\" in Water pumps could mean multiple things (Especially at the start of game for newbies) a basic tooltip would be extremely useful to give it some purpose or a popup diagram image to explain why depth is used for. Sure it makes it longer and shorter, but initially it when you are only seeing 1 depth around your camp, it makes little sense.\n\nWHY even at day time can't my water pump satisfy the first of 1 bloody glass of water per silly beaver?\n\nIt just feels like a Uni project where the teachers feedback has been ignored and the logic of so many features / functions is non-existent. Am sad to put this one into my hall of shame collection as I had high hopes, the screenshots look pretty decent, but the games logic ... nope.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this concept a lot but don't think it's ready to recommend buying yet.  In a nutshell, you spend too much of the game not playing it, i.e. not engaging with the actual fun gameplay drivers and cool design concepts and thematic elements, in favor of an oversized obstacle that essentially disables the game for a while.\r\n\r\nThe main point is storing enough water so that your beavers and crops survive the drought.  But I really think the tuning leans far too hard into that drought survival mode, and that the drought would be better served as one component of an overall more balanced game flow.  Bizarrely, the drought gets longer and longer every year, in what comes off as a very contrived difficulty scaling.  Fundamentally there's something really unsatisfying about the removal of the main resource from the map as the primary gameplay driver.  It would work well if a drought was something you have to deal with occasionally, as one of the challenges you have to overcome to make your beavers thrive, but there's plenty more to draw on than to make this such a one-note gameplay cycle - and it creates significant design baggage to have an increasingly long period of relative downtime where you're mostly just finding out if you saved up enough or not.  Interacting with water and rivers and is a cool concept and has a lot of potential (river farms for example/underwater crops), so it's unfortunate to have so much of the game be simply taking that away.  On top of that the implementation is a little weird - it never actually rains at all, the \"drought\" just means the river dries up and eventually slowly comes back.\r\n\r\nA closely related problem is how barebones the map is.  It's a series of very simple blocks, some of which have trees on them and some of which have bushes on them.  In a game about nature, such a brutally simplistic and reductive art direction leaves a lot to be desired and makes the game feel even more like a blank slate in its current state - there's a ton of potential for how to fill this map out and how to make it feel more alive and less like a minimalist sketch.  I say it's a closely related problem because the flow of water and the resulting trees and bushes are the *only* thing making this game world more than a cardboard corpse, and then every in-game year you spend longer and longer having even that taken away.  \r\n\r\nSo I would say this game is 20% of the way there on aesthetics, about 40% of the way there on design tuning, and relies far too much on a overly simplistic drought cycle (where you spend the droughts largely waiting for time to pass while staring at an expanse of brown blocks, similarly to the day-night cycle where you mostly spend the nights hitting fast forward).  But when there's water and daylight, the game flow is great, and the existence of a drought is a cool mechanic and incentive, just one that fundamentally isn't satisfying when it's taking up twice as much oxygen in the room as it should.  If that's fit into a better overall survival picture and the player is given less idle \"wait for time to pass\" gametime and the map is actually brought to life, it'll be a great game because there are really good conceptual ingredients.  There are other rough edges (aside from the excessive simplicity of the game world itself, you can scroll off the edge of it entirely and see just how your beavers' whole world is a literal box floating in a void, for example) but nothing insurmountable.  Overall my guess is this will be worth trying again in a couple years.\r\n\r\nI'll also note that after scanning through a few threads on the suggestion forum they're using, every mod reply I saw was weirdly dismissive and unconstructive.  I'm not sure if it's volunteer mods from the community administrating that site or if it's the devs themselves, but it isn't handled well and reads like you're arguing with other players rather than interacting with devs.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I played for a while. It's not a bad game per se.\nIt's just that I realized I really don't care whether or not a bunch of hat-wearing beavers live or die.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "When I first tried it I refunded it immediately because it felt very shallow. And after four years, it feels like a very polished game that's... still shallow with the single interesting gimmick of fluid dynamics. I will admit it's a neat little gimmick, but I really wanted more out of this game in terms of complexity. \n\nFor example: There's only 4 major base resources (water, wood, metal, \"bad water\"), and a less than 15 things that can be made from them. Power can only be generated by windmills and watermills. There are a bunch of different foods you can make, but they're all \"plant farm with potato instead of carrot, cook it\". Not exactly thrilling, although you might need a hint of napkin math to figure out the tile ratios since everything grows at different speeds.\n\nSo I guess get this if you like monkeying with fluid dynamics, but don't expect anything too deep (heh) from it. The game does provide a reasonable amount of difficulty. I just wanted more from a game trying to stand out in the colony sim market.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "As someone stated, this is more like a sandbox than a game.\n\nPro: there seems to be many things to explore and develop\n\nCons: the lack of global objective is somewhat annoying… During the (short) tutorial, it was ok, but after that, it was tedious. Also the concept of districts seems to be done just to annoy the player.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I didn't understand it was just a sandbox game.  I thought it would have a campaign story, with structured objectives.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games been out for nearly 5 years.. no story, no achievements , no puzzles or challenges.. it really is over hyped. all to boot 2 factions. that have been the staples for years. sooooooo no id say save your buckets unless your looking for a mindless builder or you find a sweet sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's gonna be a no for me, which is a shame because the game itself is really nice. It plays well, it's fairly intuitive, it looks nice, the music is great. But it seems to be brutally balanced. And maybe that's just me, this isn't my favorite genre of game and maybe I'm just not as good at it as others are. But at the end of the day, if a game just isn't fun, I don't waste my time on it.\n\nIt's a game of 3 steps forward, 2 steps back, 1 step forward, 3 steps back. Any time you think you have any semblance of progress, something comes through and wipes out 3/4 of your population. So you build even more defense against it the next time, and the next time is even worse.\n\nI get it, disasters are part of the fun. But is it realistic to have a drought every other day? And on top of that there simply isn't enough usable land on these tiny maps to plant enough crops to store to make it through.\n\nIf you're good at it, I applaud you. I found it too frustrating to continue fighting with. My game time is better spent on fun and relaxing games, not games that wipe themselves out every 10 minutes.\n\nIf you want a good challenge, I think you'll like it, but it ain't it for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think this is probably a very good game, but I just didn't have fun with it. 100 minutes in I was still well in the tutorial--and the tutorial just seemed to move so slowly? It would say to build such and such and I'd need to wait for two little guys to deliver the wood--maybe there's a way to get more little guys working on the project, but I couldn't see it. And the fact that the tutorial wouldn't just let you build one of something and move on, but made you build multiples felt very hand-holdy and like they didn't trust the player to make their own informed decisions. You could still build things between-- I built an extra logging site and an extra housing unit. Not trusting the player to be able to figure out on their own how many of something they need made the tutorial drag needlessly.\n\nAlso, considering how much personality the little guys seemed to have, I was a bit disappointed that they didn't do anything regarding their story. Like, I figured out on my own that they stopped work at sundown, all went to drink, then all went to eat, just by observing. It would have been cute to get an update on the families at that point, or even a notice saying \"Your work is done for the day, time to relax\", etc. They seem to have family units. Only getting updates on when babies were born and when they aged up was a bit weird, for instance. Even knowing that a little guy was assigned to a tasked that he excelled at or one he was struggling with-- there are so many options here to give a bit of character to these guys and make you care about them/the world more because of it.\n\nIt also bothered me that I felt like I couldn't speed the game up since these little guys seemed to have the self preservation instincts of a lemming. I kept getting notices that someone was dehydrated. You couldn't click on them to make them get water. You'd just watch them walk all over kingdom come with their little flashing yellow icon without any way of convincing them to drink. This clearly was normal and wasn't going to result in them dying, but the yellow flashing icon along with the red bar in the character panel made me think it was a very real possibility they'd die of thirst the first few times this happened. After following one of the little guys from the time his dehydrated icon popped up to the time he drank, I just stopped caring as these guys do seem to take care of themselves, just not as swiftly as I'd like.\n\nAlso, I personally prefer more colorful (literally color) city builders. This was very brown. And it got browner as you played.\n\nAnd I'm a laptop player which didn't control the best--likely this would control much better for mouse players. \n\nFor anyone who said this was their favorite game, I can see why--the ability to build upwards alone looks like it would be incredible. The way that research worked was cool. I can see there are replanting options, which is great for forests to not remain barren. It looks beautiful. It's just not the kind of city builder I want to play--I prefer city builders with more personality to their characters if you can interact with them, and less hand holding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd love to post my actual review that covered many of the game's aspects and provided a detailed look into what I like and what I don't, but when I changed it from \"yes\" to \"no\" steam decided that it'd be a great idea to delete the entire fucking review and instead ask me if I want a refund on a game I've put 50 hours on. As such, please enjoy an extremely summarized conclusion:\n\nIt's a game that parted from a very solid idea but has barely been developed over 3 years of early access, providing the same flaccid, directionless game it started SEA as, where the player has no goals and no motivation to do anything other than for the sake of it. It will capture your attention for as long as it takes you to realize how hollow and devoid of any substance it is.\n\nThere's no reason why you'd want to expand your food production, because your population don't expand until you make more housing. There's no reason why you'd want to obtain better resources, because they're only used for, at best, convenience. Sure, you'll have to face increasingly longer droughts, but when food never expires and storage is infinitely stackable, is that [i]really[/i] a problem?\n\nThis is a technically competent but creatively bankrupt game that frontloads its only two gimmicks (stackable buildings and water physics), does barely anything with either, and is too afraid to impose any friction or pressure on the player to engage with its mechanics beyond the absolutely baseline level. 4/10.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Overall, I do not recommend this game unless you enjoy overcoming the initial survival challenge, then enjoy building a city after the fact.\n\nTimberborn is a great concept and has a great foundation. The issue is that the survival aspect of the city builder is completely removed  once you've built a reservoir and diverted the bad water to prevent contamination. After that it becomes boring.\n\nI have suggested on multiple occasions now that the devs need to keep the tension in the game by introducing flash flooding and even rain so that the player has to focus on creating a colony that won't flood with ditches to help the water escape as well as ensuring flash floods do not destroy their colony by ensuring more water management and planning is required. Things like this which would have at least extended the tension in the game.\n\nAlas, with 1.0 being announced, there is nothing like that. Just more buildings, but nothing to add to the survival aspect of the game.\n\nDespite my many hours, I do not recommend this game if you're looking for that continual tension in a city builder.\n\nIf you are looking for a survival city builder that has that continual tension, then I recommend Whiskerwood which released recently to EA. There is continual tension throughout the game thanks to the taxes. More experienced players will need to crank the difficulty settings up for it though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state, it's a complete rip-off.\n\nAsking more than 30 euros for this game is robbery, a scam, and I deeply regret buying it because it's not worth it. It's far from ready for version 1.0. The game suffers from numerous shortcomings, making it unsuitable as both a tycoon and a city builder. Development up to version 0.7 (which I've played and is the currently available version) is poor, lazy, and very shoddy.\n\nI don't understand why people are giving positive reviews to an unfinished game that isn't ready for the market. I don't know when we gamers allowed ourselves to be ripped off like this. To elaborate on this criticism:\n\n- The \"soundtrack\" consists of only one track.\n- The \"tutorial\" (if you can even call it that) explains absolutely nothing about a key game mechanic: landscaping.\n- There's no narrative or foundation for gameplay; The player has no clear objective.\n- Numerous buildings are missing, hindering the architectural variety of the settlements.\n- The only \"events\" consist of making the player's life miserable every few clock cycles, and again, without any justification.\n- The industrial chains are very basic and poorly designed, both mathematically and logistically.\n- The technology tree doesn't exist.\n- The factions are mere reconceptualizations of the game, without any real difference or rivalry between them.\n\nI'm not saying that Timberborn, as a concept, could be a great video game someday. What I am saying is that for now, it is precisely that: a CONCEPT, not a video game, and therefore shouldn't be priced like one. \n\nI won't buy anything from this developer in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to like this one. But I think I'm just too used to the speed of other games of the genre- the 3x speed button really does nothing to progress the actual speed of the beavers. It feels frustrating not to have an option that actually feels like anything is being progressed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sobrevalorado. Es uno de esos juegos que compré por las reseñas positivas y no se las merece. Doy una reseña cortita y al pie:\r\n- Es un sandbox. No tiene campaña ni trama de fondo.\r\n- Por más que se te mueran castores, todo el avance que fuiste haciendo hasta el momento hace que los que queden vivos estén sobrados para salir adelante.\r\n- No tiene sistema de penalización como que los castores te destituyan y pierdas. Siempre vas a salir bien parado.\r\n\r\nLo voy a seguir jugando cuando quiera estar tranquilo tomando algo, pero no tiene más gracia que eso.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games just suck not enough explanation on building and upgrade. It's all guess and restart because you didn't know something that could have extremely easily explained with one or two line of text. Lazy and time wasting. I play game to relax not to enrage myself with stupid bad design. Greatly regret buying this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good in 3D Building, yet still shallow in all resource and environmental complexity",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "still makes me mad that I paid for this. every time I have time to play there has been an update that crashes my computer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't quite recommend this game yet. It's easy enough to get a city going, but then it drags. There aren't many clear objectives, unlocking some of the advanced customization things takes quite a while, and some aspects are confusing without a bit more tutorial/instruction on how to manage certain buildings or resources.\nHonestly, I'd like a bit more direction or objectives to hit in order to further the city.\nAlso, when trying to re-work an area due to limited space or having to add additional buildings, it can be extremely tedious with moving the paths which are required to connect the buildings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The tutorial is abysmal\n\nFirst - Put down a lumberjack flag for lumberjacks to cut trees. Nothing happens (oh it needs to be within range of the district. Problem is, you can only see that district range, when clicking on the district building, so when you can't see that range, you are likely going to accidently build a flag 1 tile out of range, need to delete and keep trying until it lands within range.\n\nnext build a path to the flag, (It doesn't show you where or how, but simple enough)\n\nWhen you've connected a path and mark tree's for cutting, the game doesn't tell you that the trees next to your district / flag (in range) can't be cut as they're up a step? (because steps actually count as a path space, why can't players just build steps so it makes more sense with the path, I mean when the Lord God created this world, he made everything, but he never made flippin steps did he!)\n\nok there's some trees on the opposite side, created path, flag and highlighted trees for cutting. They're not doing anything.\n\nAt this point it's hard to tell if the games broken / bugged or whether the dev has just made a counter intuitive tutorial. Maybe it'd be easier ignoring that and trying, but so far not impressed...\n\nUpdate: My wife said \"Try building a path to the trees\"\nShe was correct, we both went huh? as suddenly the beaver can finally WALK to the trees, because there's a path, but to get to the path, he still walked on the dirty grass where he was waiting previously. There are beavers standing all over the grass area's between the log camp and the tree's, but to get to the grass near the tress to cut them, you need to build a path ??????????????? I'd consider this as a bug.\n\nWhy do you need a path to get your beavers to walk from the grass where they are resting, to grass area around the trees so they can cut them? aghhhh\n\nSo NOW knowing that weirdly paths extend the districts borders, you build a water pump, and all the beavers are complaining they're dehydrated ? fml\n\nThat's because it's night time, and rather than get water from the river and drink like any normal beaver, they just stare at the water because they're too dumb to drink it...\n(And they won't use the waterpump to get a drink because they refuse to work at night-time)\n\nImagine waking up with a dry throat in the middle of the night, hard to breathe, but you can't use the tap because it's night time...\n\nMorning comes, and every time my water pump provides a beaver a 1x glass of water, they drink it so there's quite some queue for my beavers waiting for a drink.\n\nI actually hate the design of this game like one of the worst city builders I've ever played in my life, (Logistic wise) and I've played them all (Since city building is my fav genre).\n\nLittle things like \"Depth\" in Water pumps could mean multiple things (Especially at the start of game for newbies) a basic tooltip would be extremely useful to give it some purpose or a popup diagram image to explain why depth is used for. Sure it makes it longer and shorter, but initially it when you are only seeing 1 depth around your camp, it makes little sense.\n\nWHY even at day time can't my water pump satisfy the first of 1 bloody glass of water per silly beaver?\n\nIt just feels like a Uni project where the teachers feedback has been ignored and the logic of so many features / functions is non-existent. Am sad to put this one into my hall of shame collection as I had high hopes, the screenshots look pretty decent, but the games logic ... nope.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this concept a lot but don't think it's ready to recommend buying yet.  In a nutshell, you spend too much of the game not playing it, i.e. not engaging with the actual fun gameplay drivers and cool design concepts and thematic elements, in favor of an oversized obstacle that essentially disables the game for a while.\r\n\r\nThe main point is storing enough water so that your beavers and crops survive the drought.  But I really think the tuning leans far too hard into that drought survival mode, and that the drought would be better served as one component of an overall more balanced game flow.  Bizarrely, the drought gets longer and longer every year, in what comes off as a very contrived difficulty scaling.  Fundamentally there's something really unsatisfying about the removal of the main resource from the map as the primary gameplay driver.  It would work well if a drought was something you have to deal with occasionally, as one of the challenges you have to overcome to make your beavers thrive, but there's plenty more to draw on than to make this such a one-note gameplay cycle - and it creates significant design baggage to have an increasingly long period of relative downtime where you're mostly just finding out if you saved up enough or not.  Interacting with water and rivers and is a cool concept and has a lot of potential (river farms for example/underwater crops), so it's unfortunate to have so much of the game be simply taking that away.  On top of that the implementation is a little weird - it never actually rains at all, the \"drought\" just means the river dries up and eventually slowly comes back.\r\n\r\nA closely related problem is how barebones the map is.  It's a series of very simple blocks, some of which have trees on them and some of which have bushes on them.  In a game about nature, such a brutally simplistic and reductive art direction leaves a lot to be desired and makes the game feel even more like a blank slate in its current state - there's a ton of potential for how to fill this map out and how to make it feel more alive and less like a minimalist sketch.  I say it's a closely related problem because the flow of water and the resulting trees and bushes are the *only* thing making this game world more than a cardboard corpse, and then every in-game year you spend longer and longer having even that taken away.  \r\n\r\nSo I would say this game is 20% of the way there on aesthetics, about 40% of the way there on design tuning, and relies far too much on a overly simplistic drought cycle (where you spend the droughts largely waiting for time to pass while staring at an expanse of brown blocks, similarly to the day-night cycle where you mostly spend the nights hitting fast forward).  But when there's water and daylight, the game flow is great, and the existence of a drought is a cool mechanic and incentive, just one that fundamentally isn't satisfying when it's taking up twice as much oxygen in the room as it should.  If that's fit into a better overall survival picture and the player is given less idle \"wait for time to pass\" gametime and the map is actually brought to life, it'll be a great game because there are really good conceptual ingredients.  There are other rough edges (aside from the excessive simplicity of the game world itself, you can scroll off the edge of it entirely and see just how your beavers' whole world is a literal box floating in a void, for example) but nothing insurmountable.  Overall my guess is this will be worth trying again in a couple years.\r\n\r\nI'll also note that after scanning through a few threads on the suggestion forum they're using, every mod reply I saw was weirdly dismissive and unconstructive.  I'm not sure if it's volunteer mods from the community administrating that site or if it's the devs themselves, but it isn't handled well and reads like you're arguing with other players rather than interacting with devs.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I played for a while. It's not a bad game per se.\nIt's just that I realized I really don't care whether or not a bunch of hat-wearing beavers live or die.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "When I first tried it I refunded it immediately because it felt very shallow. And after four years, it feels like a very polished game that's... still shallow with the single interesting gimmick of fluid dynamics. I will admit it's a neat little gimmick, but I really wanted more out of this game in terms of complexity. \n\nFor example: There's only 4 major base resources (water, wood, metal, \"bad water\"), and a less than 15 things that can be made from them. Power can only be generated by windmills and watermills. There are a bunch of different foods you can make, but they're all \"plant farm with potato instead of carrot, cook it\". Not exactly thrilling, although you might need a hint of napkin math to figure out the tile ratios since everything grows at different speeds.\n\nSo I guess get this if you like monkeying with fluid dynamics, but don't expect anything too deep (heh) from it. The game does provide a reasonable amount of difficulty. I just wanted more from a game trying to stand out in the colony sim market.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "As someone stated, this is more like a sandbox than a game.\n\nPro: there seems to be many things to explore and develop\n\nCons: the lack of global objective is somewhat annoying… During the (short) tutorial, it was ok, but after that, it was tedious. Also the concept of districts seems to be done just to annoy the player.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I didn't understand it was just a sandbox game.  I thought it would have a campaign story, with structured objectives.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games been out for nearly 5 years.. no story, no achievements , no puzzles or challenges.. it really is over hyped. all to boot 2 factions. that have been the staples for years. sooooooo no id say save your buckets unless your looking for a mindless builder or you find a sweet sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's gonna be a no for me, which is a shame because the game itself is really nice. It plays well, it's fairly intuitive, it looks nice, the music is great. But it seems to be brutally balanced. And maybe that's just me, this isn't my favorite genre of game and maybe I'm just not as good at it as others are. But at the end of the day, if a game just isn't fun, I don't waste my time on it.\n\nIt's a game of 3 steps forward, 2 steps back, 1 step forward, 3 steps back. Any time you think you have any semblance of progress, something comes through and wipes out 3/4 of your population. So you build even more defense against it the next time, and the next time is even worse.\n\nI get it, disasters are part of the fun. But is it realistic to have a drought every other day? And on top of that there simply isn't enough usable land on these tiny maps to plant enough crops to store to make it through.\n\nIf you're good at it, I applaud you. I found it too frustrating to continue fighting with. My game time is better spent on fun and relaxing games, not games that wipe themselves out every 10 minutes.\n\nIf you want a good challenge, I think you'll like it, but it ain't it for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think this is probably a very good game, but I just didn't have fun with it. 100 minutes in I was still well in the tutorial--and the tutorial just seemed to move so slowly? It would say to build such and such and I'd need to wait for two little guys to deliver the wood--maybe there's a way to get more little guys working on the project, but I couldn't see it. And the fact that the tutorial wouldn't just let you build one of something and move on, but made you build multiples felt very hand-holdy and like they didn't trust the player to make their own informed decisions. You could still build things between-- I built an extra logging site and an extra housing unit. Not trusting the player to be able to figure out on their own how many of something they need made the tutorial drag needlessly.\n\nAlso, considering how much personality the little guys seemed to have, I was a bit disappointed that they didn't do anything regarding their story. Like, I figured out on my own that they stopped work at sundown, all went to drink, then all went to eat, just by observing. It would have been cute to get an update on the families at that point, or even a notice saying \"Your work is done for the day, time to relax\", etc. They seem to have family units. Only getting updates on when babies were born and when they aged up was a bit weird, for instance. Even knowing that a little guy was assigned to a tasked that he excelled at or one he was struggling with-- there are so many options here to give a bit of character to these guys and make you care about them/the world more because of it.\n\nIt also bothered me that I felt like I couldn't speed the game up since these little guys seemed to have the self preservation instincts of a lemming. I kept getting notices that someone was dehydrated. You couldn't click on them to make them get water. You'd just watch them walk all over kingdom come with their little flashing yellow icon without any way of convincing them to drink. This clearly was normal and wasn't going to result in them dying, but the yellow flashing icon along with the red bar in the character panel made me think it was a very real possibility they'd die of thirst the first few times this happened. After following one of the little guys from the time his dehydrated icon popped up to the time he drank, I just stopped caring as these guys do seem to take care of themselves, just not as swiftly as I'd like.\n\nAlso, I personally prefer more colorful (literally color) city builders. This was very brown. And it got browner as you played.\n\nAnd I'm a laptop player which didn't control the best--likely this would control much better for mouse players. \n\nFor anyone who said this was their favorite game, I can see why--the ability to build upwards alone looks like it would be incredible. The way that research worked was cool. I can see there are replanting options, which is great for forests to not remain barren. It looks beautiful. It's just not the kind of city builder I want to play--I prefer city builders with more personality to their characters if you can interact with them, and less hand holding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd love to post my actual review that covered many of the game's aspects and provided a detailed look into what I like and what I don't, but when I changed it from \"yes\" to \"no\" steam decided that it'd be a great idea to delete the entire fucking review and instead ask me if I want a refund on a game I've put 50 hours on. As such, please enjoy an extremely summarized conclusion:\n\nIt's a game that parted from a very solid idea but has barely been developed over 3 years of early access, providing the same flaccid, directionless game it started SEA as, where the player has no goals and no motivation to do anything other than for the sake of it. It will capture your attention for as long as it takes you to realize how hollow and devoid of any substance it is.\n\nThere's no reason why you'd want to expand your food production, because your population don't expand until you make more housing. There's no reason why you'd want to obtain better resources, because they're only used for, at best, convenience. Sure, you'll have to face increasingly longer droughts, but when food never expires and storage is infinitely stackable, is that [i]really[/i] a problem?\n\nThis is a technically competent but creatively bankrupt game that frontloads its only two gimmicks (stackable buildings and water physics), does barely anything with either, and is too afraid to impose any friction or pressure on the player to engage with its mechanics beyond the absolutely baseline level. 4/10.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Overall, I do not recommend this game unless you enjoy overcoming the initial survival challenge, then enjoy building a city after the fact.\n\nTimberborn is a great concept and has a great foundation. The issue is that the survival aspect of the city builder is completely removed  once you've built a reservoir and diverted the bad water to prevent contamination. After that it becomes boring.\n\nI have suggested on multiple occasions now that the devs need to keep the tension in the game by introducing flash flooding and even rain so that the player has to focus on creating a colony that won't flood with ditches to help the water escape as well as ensuring flash floods do not destroy their colony by ensuring more water management and planning is required. Things like this which would have at least extended the tension in the game.\n\nAlas, with 1.0 being announced, there is nothing like that. Just more buildings, but nothing to add to the survival aspect of the game.\n\nDespite my many hours, I do not recommend this game if you're looking for that continual tension in a city builder.\n\nIf you are looking for a survival city builder that has that continual tension, then I recommend Whiskerwood which released recently to EA. There is continual tension throughout the game thanks to the taxes. More experienced players will need to crank the difficulty settings up for it though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state, it's a complete rip-off.\n\nAsking more than 30 euros for this game is robbery, a scam, and I deeply regret buying it because it's not worth it. It's far from ready for version 1.0. The game suffers from numerous shortcomings, making it unsuitable as both a tycoon and a city builder. Development up to version 0.7 (which I've played and is the currently available version) is poor, lazy, and very shoddy.\n\nI don't understand why people are giving positive reviews to an unfinished game that isn't ready for the market. I don't know when we gamers allowed ourselves to be ripped off like this. To elaborate on this criticism:\n\n- The \"soundtrack\" consists of only one track.\n- The \"tutorial\" (if you can even call it that) explains absolutely nothing about a key game mechanic: landscaping.\n- There's no narrative or foundation for gameplay; The player has no clear objective.\n- Numerous buildings are missing, hindering the architectural variety of the settlements.\n- The only \"events\" consist of making the player's life miserable every few clock cycles, and again, without any justification.\n- The industrial chains are very basic and poorly designed, both mathematically and logistically.\n- The technology tree doesn't exist.\n- The factions are mere reconceptualizations of the game, without any real difference or rivalry between them.\n\nI'm not saying that Timberborn, as a concept, could be a great video game someday. What I am saying is that for now, it is precisely that: a CONCEPT, not a video game, and therefore shouldn't be priced like one. \n\nI won't buy anything from this developer in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to like this one. But I think I'm just too used to the speed of other games of the genre- the 3x speed button really does nothing to progress the actual speed of the beavers. It feels frustrating not to have an option that actually feels like anything is being progressed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sobrevalorado. Es uno de esos juegos que compré por las reseñas positivas y no se las merece. Doy una reseña cortita y al pie:\r\n- Es un sandbox. No tiene campaña ni trama de fondo.\r\n- Por más que se te mueran castores, todo el avance que fuiste haciendo hasta el momento hace que los que queden vivos estén sobrados para salir adelante.\r\n- No tiene sistema de penalización como que los castores te destituyan y pierdas. Siempre vas a salir bien parado.\r\n\r\nLo voy a seguir jugando cuando quiera estar tranquilo tomando algo, pero no tiene más gracia que eso.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games just suck not enough explanation on building and upgrade. It's all guess and restart because you didn't know something that could have extremely easily explained with one or two line of text. Lazy and time wasting. I play game to relax not to enrage myself with stupid bad design. Greatly regret buying this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good in 3D Building, yet still shallow in all resource and environmental complexity",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "still makes me mad that I paid for this. every time I have time to play there has been an update that crashes my computer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't quite recommend this game yet. It's easy enough to get a city going, but then it drags. There aren't many clear objectives, unlocking some of the advanced customization things takes quite a while, and some aspects are confusing without a bit more tutorial/instruction on how to manage certain buildings or resources.\nHonestly, I'd like a bit more direction or objectives to hit in order to further the city.\nAlso, when trying to re-work an area due to limited space or having to add additional buildings, it can be extremely tedious with moving the paths which are required to connect the buildings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The tutorial is abysmal\n\nFirst - Put down a lumberjack flag for lumberjacks to cut trees. Nothing happens (oh it needs to be within range of the district. Problem is, you can only see that district range, when clicking on the district building, so when you can't see that range, you are likely going to accidently build a flag 1 tile out of range, need to delete and keep trying until it lands within range.\n\nnext build a path to the flag, (It doesn't show you where or how, but simple enough)\n\nWhen you've connected a path and mark tree's for cutting, the game doesn't tell you that the trees next to your district / flag (in range) can't be cut as they're up a step? (because steps actually count as a path space, why can't players just build steps so it makes more sense with the path, I mean when the Lord God created this world, he made everything, but he never made flippin steps did he!)\n\nok there's some trees on the opposite side, created path, flag and highlighted trees for cutting. They're not doing anything.\n\nAt this point it's hard to tell if the games broken / bugged or whether the dev has just made a counter intuitive tutorial. Maybe it'd be easier ignoring that and trying, but so far not impressed...\n\nUpdate: My wife said \"Try building a path to the trees\"\nShe was correct, we both went huh? as suddenly the beaver can finally WALK to the trees, because there's a path, but to get to the path, he still walked on the dirty grass where he was waiting previously. There are beavers standing all over the grass area's between the log camp and the tree's, but to get to the grass near the tress to cut them, you need to build a path ??????????????? I'd consider this as a bug.\n\nWhy do you need a path to get your beavers to walk from the grass where they are resting, to grass area around the trees so they can cut them? aghhhh\n\nSo NOW knowing that weirdly paths extend the districts borders, you build a water pump, and all the beavers are complaining they're dehydrated ? fml\n\nThat's because it's night time, and rather than get water from the river and drink like any normal beaver, they just stare at the water because they're too dumb to drink it...\n(And they won't use the waterpump to get a drink because they refuse to work at night-time)\n\nImagine waking up with a dry throat in the middle of the night, hard to breathe, but you can't use the tap because it's night time...\n\nMorning comes, and every time my water pump provides a beaver a 1x glass of water, they drink it so there's quite some queue for my beavers waiting for a drink.\n\nI actually hate the design of this game like one of the worst city builders I've ever played in my life, (Logistic wise) and I've played them all (Since city building is my fav genre).\n\nLittle things like \"Depth\" in Water pumps could mean multiple things (Especially at the start of game for newbies) a basic tooltip would be extremely useful to give it some purpose or a popup diagram image to explain why depth is used for. Sure it makes it longer and shorter, but initially it when you are only seeing 1 depth around your camp, it makes little sense.\n\nWHY even at day time can't my water pump satisfy the first of 1 bloody glass of water per silly beaver?\n\nIt just feels like a Uni project where the teachers feedback has been ignored and the logic of so many features / functions is non-existent. Am sad to put this one into my hall of shame collection as I had high hopes, the screenshots look pretty decent, but the games logic ... nope.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this concept a lot but don't think it's ready to recommend buying yet.  In a nutshell, you spend too much of the game not playing it, i.e. not engaging with the actual fun gameplay drivers and cool design concepts and thematic elements, in favor of an oversized obstacle that essentially disables the game for a while.\r\n\r\nThe main point is storing enough water so that your beavers and crops survive the drought.  But I really think the tuning leans far too hard into that drought survival mode, and that the drought would be better served as one component of an overall more balanced game flow.  Bizarrely, the drought gets longer and longer every year, in what comes off as a very contrived difficulty scaling.  Fundamentally there's something really unsatisfying about the removal of the main resource from the map as the primary gameplay driver.  It would work well if a drought was something you have to deal with occasionally, as one of the challenges you have to overcome to make your beavers thrive, but there's plenty more to draw on than to make this such a one-note gameplay cycle - and it creates significant design baggage to have an increasingly long period of relative downtime where you're mostly just finding out if you saved up enough or not.  Interacting with water and rivers and is a cool concept and has a lot of potential (river farms for example/underwater crops), so it's unfortunate to have so much of the game be simply taking that away.  On top of that the implementation is a little weird - it never actually rains at all, the \"drought\" just means the river dries up and eventually slowly comes back.\r\n\r\nA closely related problem is how barebones the map is.  It's a series of very simple blocks, some of which have trees on them and some of which have bushes on them.  In a game about nature, such a brutally simplistic and reductive art direction leaves a lot to be desired and makes the game feel even more like a blank slate in its current state - there's a ton of potential for how to fill this map out and how to make it feel more alive and less like a minimalist sketch.  I say it's a closely related problem because the flow of water and the resulting trees and bushes are the *only* thing making this game world more than a cardboard corpse, and then every in-game year you spend longer and longer having even that taken away.  \r\n\r\nSo I would say this game is 20% of the way there on aesthetics, about 40% of the way there on design tuning, and relies far too much on a overly simplistic drought cycle (where you spend the droughts largely waiting for time to pass while staring at an expanse of brown blocks, similarly to the day-night cycle where you mostly spend the nights hitting fast forward).  But when there's water and daylight, the game flow is great, and the existence of a drought is a cool mechanic and incentive, just one that fundamentally isn't satisfying when it's taking up twice as much oxygen in the room as it should.  If that's fit into a better overall survival picture and the player is given less idle \"wait for time to pass\" gametime and the map is actually brought to life, it'll be a great game because there are really good conceptual ingredients.  There are other rough edges (aside from the excessive simplicity of the game world itself, you can scroll off the edge of it entirely and see just how your beavers' whole world is a literal box floating in a void, for example) but nothing insurmountable.  Overall my guess is this will be worth trying again in a couple years.\r\n\r\nI'll also note that after scanning through a few threads on the suggestion forum they're using, every mod reply I saw was weirdly dismissive and unconstructive.  I'm not sure if it's volunteer mods from the community administrating that site or if it's the devs themselves, but it isn't handled well and reads like you're arguing with other players rather than interacting with devs.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I played for a while. It's not a bad game per se.\nIt's just that I realized I really don't care whether or not a bunch of hat-wearing beavers live or die.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "When I first tried it I refunded it immediately because it felt very shallow. And after four years, it feels like a very polished game that's... still shallow with the single interesting gimmick of fluid dynamics. I will admit it's a neat little gimmick, but I really wanted more out of this game in terms of complexity. \n\nFor example: There's only 4 major base resources (water, wood, metal, \"bad water\"), and a less than 15 things that can be made from them. Power can only be generated by windmills and watermills. There are a bunch of different foods you can make, but they're all \"plant farm with potato instead of carrot, cook it\". Not exactly thrilling, although you might need a hint of napkin math to figure out the tile ratios since everything grows at different speeds.\n\nSo I guess get this if you like monkeying with fluid dynamics, but don't expect anything too deep (heh) from it. The game does provide a reasonable amount of difficulty. I just wanted more from a game trying to stand out in the colony sim market.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "As someone stated, this is more like a sandbox than a game.\n\nPro: there seems to be many things to explore and develop\n\nCons: the lack of global objective is somewhat annoying… During the (short) tutorial, it was ok, but after that, it was tedious. Also the concept of districts seems to be done just to annoy the player.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I didn't understand it was just a sandbox game.  I thought it would have a campaign story, with structured objectives.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games been out for nearly 5 years.. no story, no achievements , no puzzles or challenges.. it really is over hyped. all to boot 2 factions. that have been the staples for years. sooooooo no id say save your buckets unless your looking for a mindless builder or you find a sweet sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's gonna be a no for me, which is a shame because the game itself is really nice. It plays well, it's fairly intuitive, it looks nice, the music is great. But it seems to be brutally balanced. And maybe that's just me, this isn't my favorite genre of game and maybe I'm just not as good at it as others are. But at the end of the day, if a game just isn't fun, I don't waste my time on it.\n\nIt's a game of 3 steps forward, 2 steps back, 1 step forward, 3 steps back. Any time you think you have any semblance of progress, something comes through and wipes out 3/4 of your population. So you build even more defense against it the next time, and the next time is even worse.\n\nI get it, disasters are part of the fun. But is it realistic to have a drought every other day? And on top of that there simply isn't enough usable land on these tiny maps to plant enough crops to store to make it through.\n\nIf you're good at it, I applaud you. I found it too frustrating to continue fighting with. My game time is better spent on fun and relaxing games, not games that wipe themselves out every 10 minutes.\n\nIf you want a good challenge, I think you'll like it, but it ain't it for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think this is probably a very good game, but I just didn't have fun with it. 100 minutes in I was still well in the tutorial--and the tutorial just seemed to move so slowly? It would say to build such and such and I'd need to wait for two little guys to deliver the wood--maybe there's a way to get more little guys working on the project, but I couldn't see it. And the fact that the tutorial wouldn't just let you build one of something and move on, but made you build multiples felt very hand-holdy and like they didn't trust the player to make their own informed decisions. You could still build things between-- I built an extra logging site and an extra housing unit. Not trusting the player to be able to figure out on their own how many of something they need made the tutorial drag needlessly.\n\nAlso, considering how much personality the little guys seemed to have, I was a bit disappointed that they didn't do anything regarding their story. Like, I figured out on my own that they stopped work at sundown, all went to drink, then all went to eat, just by observing. It would have been cute to get an update on the families at that point, or even a notice saying \"Your work is done for the day, time to relax\", etc. They seem to have family units. Only getting updates on when babies were born and when they aged up was a bit weird, for instance. Even knowing that a little guy was assigned to a tasked that he excelled at or one he was struggling with-- there are so many options here to give a bit of character to these guys and make you care about them/the world more because of it.\n\nIt also bothered me that I felt like I couldn't speed the game up since these little guys seemed to have the self preservation instincts of a lemming. I kept getting notices that someone was dehydrated. You couldn't click on them to make them get water. You'd just watch them walk all over kingdom come with their little flashing yellow icon without any way of convincing them to drink. This clearly was normal and wasn't going to result in them dying, but the yellow flashing icon along with the red bar in the character panel made me think it was a very real possibility they'd die of thirst the first few times this happened. After following one of the little guys from the time his dehydrated icon popped up to the time he drank, I just stopped caring as these guys do seem to take care of themselves, just not as swiftly as I'd like.\n\nAlso, I personally prefer more colorful (literally color) city builders. This was very brown. And it got browner as you played.\n\nAnd I'm a laptop player which didn't control the best--likely this would control much better for mouse players. \n\nFor anyone who said this was their favorite game, I can see why--the ability to build upwards alone looks like it would be incredible. The way that research worked was cool. I can see there are replanting options, which is great for forests to not remain barren. It looks beautiful. It's just not the kind of city builder I want to play--I prefer city builders with more personality to their characters if you can interact with them, and less hand holding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd love to post my actual review that covered many of the game's aspects and provided a detailed look into what I like and what I don't, but when I changed it from \"yes\" to \"no\" steam decided that it'd be a great idea to delete the entire fucking review and instead ask me if I want a refund on a game I've put 50 hours on. As such, please enjoy an extremely summarized conclusion:\n\nIt's a game that parted from a very solid idea but has barely been developed over 3 years of early access, providing the same flaccid, directionless game it started SEA as, where the player has no goals and no motivation to do anything other than for the sake of it. It will capture your attention for as long as it takes you to realize how hollow and devoid of any substance it is.\n\nThere's no reason why you'd want to expand your food production, because your population don't expand until you make more housing. There's no reason why you'd want to obtain better resources, because they're only used for, at best, convenience. Sure, you'll have to face increasingly longer droughts, but when food never expires and storage is infinitely stackable, is that [i]really[/i] a problem?\n\nThis is a technically competent but creatively bankrupt game that frontloads its only two gimmicks (stackable buildings and water physics), does barely anything with either, and is too afraid to impose any friction or pressure on the player to engage with its mechanics beyond the absolutely baseline level. 4/10.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Overall, I do not recommend this game unless you enjoy overcoming the initial survival challenge, then enjoy building a city after the fact.\n\nTimberborn is a great concept and has a great foundation. The issue is that the survival aspect of the city builder is completely removed  once you've built a reservoir and diverted the bad water to prevent contamination. After that it becomes boring.\n\nI have suggested on multiple occasions now that the devs need to keep the tension in the game by introducing flash flooding and even rain so that the player has to focus on creating a colony that won't flood with ditches to help the water escape as well as ensuring flash floods do not destroy their colony by ensuring more water management and planning is required. Things like this which would have at least extended the tension in the game.\n\nAlas, with 1.0 being announced, there is nothing like that. Just more buildings, but nothing to add to the survival aspect of the game.\n\nDespite my many hours, I do not recommend this game if you're looking for that continual tension in a city builder.\n\nIf you are looking for a survival city builder that has that continual tension, then I recommend Whiskerwood which released recently to EA. There is continual tension throughout the game thanks to the taxes. More experienced players will need to crank the difficulty settings up for it though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state, it's a complete rip-off.\n\nAsking more than 30 euros for this game is robbery, a scam, and I deeply regret buying it because it's not worth it. It's far from ready for version 1.0. The game suffers from numerous shortcomings, making it unsuitable as both a tycoon and a city builder. Development up to version 0.7 (which I've played and is the currently available version) is poor, lazy, and very shoddy.\n\nI don't understand why people are giving positive reviews to an unfinished game that isn't ready for the market. I don't know when we gamers allowed ourselves to be ripped off like this. To elaborate on this criticism:\n\n- The \"soundtrack\" consists of only one track.\n- The \"tutorial\" (if you can even call it that) explains absolutely nothing about a key game mechanic: landscaping.\n- There's no narrative or foundation for gameplay; The player has no clear objective.\n- Numerous buildings are missing, hindering the architectural variety of the settlements.\n- The only \"events\" consist of making the player's life miserable every few clock cycles, and again, without any justification.\n- The industrial chains are very basic and poorly designed, both mathematically and logistically.\n- The technology tree doesn't exist.\n- The factions are mere reconceptualizations of the game, without any real difference or rivalry between them.\n\nI'm not saying that Timberborn, as a concept, could be a great video game someday. What I am saying is that for now, it is precisely that: a CONCEPT, not a video game, and therefore shouldn't be priced like one. \n\nI won't buy anything from this developer in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to like this one. But I think I'm just too used to the speed of other games of the genre- the 3x speed button really does nothing to progress the actual speed of the beavers. It feels frustrating not to have an option that actually feels like anything is being progressed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sobrevalorado. Es uno de esos juegos que compré por las reseñas positivas y no se las merece. Doy una reseña cortita y al pie:\r\n- Es un sandbox. No tiene campaña ni trama de fondo.\r\n- Por más que se te mueran castores, todo el avance que fuiste haciendo hasta el momento hace que los que queden vivos estén sobrados para salir adelante.\r\n- No tiene sistema de penalización como que los castores te destituyan y pierdas. Siempre vas a salir bien parado.\r\n\r\nLo voy a seguir jugando cuando quiera estar tranquilo tomando algo, pero no tiene más gracia que eso.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games just suck not enough explanation on building and upgrade. It's all guess and restart because you didn't know something that could have extremely easily explained with one or two line of text. Lazy and time wasting. I play game to relax not to enrage myself with stupid bad design. Greatly regret buying this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good in 3D Building, yet still shallow in all resource and environmental complexity",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "still makes me mad that I paid for this. every time I have time to play there has been an update that crashes my computer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't quite recommend this game yet. It's easy enough to get a city going, but then it drags. There aren't many clear objectives, unlocking some of the advanced customization things takes quite a while, and some aspects are confusing without a bit more tutorial/instruction on how to manage certain buildings or resources.\nHonestly, I'd like a bit more direction or objectives to hit in order to further the city.\nAlso, when trying to re-work an area due to limited space or having to add additional buildings, it can be extremely tedious with moving the paths which are required to connect the buildings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The tutorial is abysmal\n\nFirst - Put down a lumberjack flag for lumberjacks to cut trees. Nothing happens (oh it needs to be within range of the district. Problem is, you can only see that district range, when clicking on the district building, so when you can't see that range, you are likely going to accidently build a flag 1 tile out of range, need to delete and keep trying until it lands within range.\n\nnext build a path to the flag, (It doesn't show you where or how, but simple enough)\n\nWhen you've connected a path and mark tree's for cutting, the game doesn't tell you that the trees next to your district / flag (in range) can't be cut as they're up a step? (because steps actually count as a path space, why can't players just build steps so it makes more sense with the path, I mean when the Lord God created this world, he made everything, but he never made flippin steps did he!)\n\nok there's some trees on the opposite side, created path, flag and highlighted trees for cutting. They're not doing anything.\n\nAt this point it's hard to tell if the games broken / bugged or whether the dev has just made a counter intuitive tutorial. Maybe it'd be easier ignoring that and trying, but so far not impressed...\n\nUpdate: My wife said \"Try building a path to the trees\"\nShe was correct, we both went huh? as suddenly the beaver can finally WALK to the trees, because there's a path, but to get to the path, he still walked on the dirty grass where he was waiting previously. There are beavers standing all over the grass area's between the log camp and the tree's, but to get to the grass near the tress to cut them, you need to build a path ??????????????? I'd consider this as a bug.\n\nWhy do you need a path to get your beavers to walk from the grass where they are resting, to grass area around the trees so they can cut them? aghhhh\n\nSo NOW knowing that weirdly paths extend the districts borders, you build a water pump, and all the beavers are complaining they're dehydrated ? fml\n\nThat's because it's night time, and rather than get water from the river and drink like any normal beaver, they just stare at the water because they're too dumb to drink it...\n(And they won't use the waterpump to get a drink because they refuse to work at night-time)\n\nImagine waking up with a dry throat in the middle of the night, hard to breathe, but you can't use the tap because it's night time...\n\nMorning comes, and every time my water pump provides a beaver a 1x glass of water, they drink it so there's quite some queue for my beavers waiting for a drink.\n\nI actually hate the design of this game like one of the worst city builders I've ever played in my life, (Logistic wise) and I've played them all (Since city building is my fav genre).\n\nLittle things like \"Depth\" in Water pumps could mean multiple things (Especially at the start of game for newbies) a basic tooltip would be extremely useful to give it some purpose or a popup diagram image to explain why depth is used for. Sure it makes it longer and shorter, but initially it when you are only seeing 1 depth around your camp, it makes little sense.\n\nWHY even at day time can't my water pump satisfy the first of 1 bloody glass of water per silly beaver?\n\nIt just feels like a Uni project where the teachers feedback has been ignored and the logic of so many features / functions is non-existent. Am sad to put this one into my hall of shame collection as I had high hopes, the screenshots look pretty decent, but the games logic ... nope.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}