{
  "positive": [
    {
      "review": "It's unironically the best MMO I played and nothing could ever come close to it. The sound, the world, crafting and the never ending chest runs that we all had a love/hate relationship with. With all the bugs and all the trouble we had with this game, there is nothing like New World, and i doubt there will be. \n\nAmazon being once again greedy and showing us why we shouldn't trust them in the gaming industry, or outside of it. Shutting down the most unique MMO to continue chasing money with some casual AI slop games will hopefully not go in the direction they want it to go. \nSeason 10 was one of the best updates we got, pulled good numbers and people were once again willingly sitting in 7k+ queues to play the game. Barely 2 weeks into the update, we get told that what, that's the end? Ridiculous. A very scummy move after a lot of those people bought battlepasses and spent on the game.\n \nIf you have the game and never got around to trying it, I 100% recommend it, there is a lot of new content. Every mmo player should experience this gem at least once before it shuts down. \n\nHere's to the memories, the countless hours spent on this game and all the friends that we made along the way.",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "The recent news about this game being shut down saddens me greatly...shame...I truly enjoyed this game...I find this very unfair to the players that spent a lot of time playing this, only for corporate greed to end things like this...never getting amazon products again...",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I seriously HATE HATE HATE Amazon games now. Shutting down servers and laying off your dev team is the worst mistake. This started out as a hot mess then became what I want to see in other MMOs. The crafting and life skills in this game were amazing. WHY!?!??!?!?",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "When New World first released, I’ll admit — it was far from perfect. The launch was chaotic: server queues, bugs, exploits, and a game still searching for its true identity. But what’s remarkable isn’t how it started — it’s how it grew. Over time, New World became something truly special: a polished, beautiful, and deeply rewarding world built by a passionate team and an even more passionate community.\n\nThe developers didn’t give up. They listened. Patch by patch, update by update, they turned criticism into progress. The result was an MMO that evolved into one of the most visually stunning, mechanically satisfying, and community-driven games I’ve ever played.\n\nThey added so much over the years:\n\nExpeditions & Mutations that gave endgame players real challenges and teamwork opportunities.\n\nMounts that completely transformed exploration and travel, with their own progression and personality.\n\nSeasonal content and live events that brought the community together again and again.\n\nWorld revamps that made Aeternum’s landscapes breathtaking and alive — from eerie swamps to golden plains.\n\nImproved crafting and trading systems that gave every player a purpose, from blacksmiths to gatherers.\n\nCross-world features, better matchmaking, and player hubs that made it easier than ever to connect.\n\nCombat refinement that made every weapon type fun, responsive, and meaningful in both PvE and PvP.\n\nBut what I’ll remember most isn’t the loot, the grind, or the power levels — it’s the people. The community truly made New World shine. Whether it was teaming up with strangers to defend a fort, forming late-night gathering parties, or sharing laughs as we accidentally pulled every mob in a dungeon, there was always this sense of camaraderie.\n\nGuilds became families. Rivalries became friendships. Even global chat had its moments of pure comedy gold. The players — not just the devs — helped shape what New World became. We gave feedback, we tested, we struggled, and we celebrated together.\n\nI’ve had countless laughs, epic battles, and heartfelt goodbyes across Aeternum. From my first fishing trip gone wrong to the last territory war where we all knew it might be our final one — every moment mattered.\n\nNow, as we approach the end, it’s honestly hard to say goodbye. New World wasn’t just a game — it was a community, a second home, and a reminder of what’s possible when developers and players work together.\n\nThank you to the team at Amazon Games, and thank you to every adventurer who ever swung a sword beside me, crafted potions for me, or revived me when I was face-down in the dirt.\n\nAeternum may fade, but the memories we made there never will.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "This is my most played MMO (by 100's of hours). I adore it, i love the style, feel and playability. Super sad its being shut down, but can understand after so much negativity from the community. Will continue to play till the end.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I love this game, but since they announced to close the servers, I stop playing ;)\nHope I will find similar game like this.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Like all MMOs it did not have a great start, but slowly transitioned to get better with each update. Amazing game to said the least. Spend so many hours farming and crafting, watching the scenery!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I see the negative reviews as a result of the imminent shutdown of the game after next year but this was and IS still a very solid game. Lots of fun and plenty of freedom to play how you want. We still have a full year, so keep the pressure on, get amazon to keep it alive whether that means they sell it or keep it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been playing the game since its release and have now spent almost 4k hours in it. It's very unique, but I would say that the most notable aspects are the combat, audio, and freedom in how you play. There is no other MMORPG that offers the same combat system as New World, not even close. Of course, the game has had many ups and downs, with more downs than ups at times. But the last major update (which brought the Nighthaven expansion) completely turned things around for me personally. Everything about this update was simply excellent. The new area is simply breathtaking. The new raid is super challenging. The new dungeon experience 'Catacombs' (procedurally generated dungeon with multiple boss fights, timed) is very, very fun and challenging.\nI rarely write Steam reviews, but I find the recent barrage of negative reviews for the game simply unfair and incomprehensible. Amazon has, of course, abandoned the development of New World, which is why there will be no new content. However, neither the game itself nor Amazon Games has anything to do with this. The game is still excellent.\nAnd for anyone wondering whether they should still buy the game:\nAsk yourself this question:\nAre you okay with the game possibly being shut down at the end of next year, but you have time until then (so at least over a year) to play and enjoy all the content in New World? Meaning you can easily still spend 1-2k hours on it?\nIf so, then go for it. The game itself is excellent and a very unique experience. For me personally, it would be okay to pay €60 for 1-2k hours of really unique gameplay that no other game will ever deliver.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "honestly one of the best mmrpgs ive played. decided to write this review incase the game shuts down in the far future after 2026. truly one of the most revolutionary western mmo-rpgs youll ever play",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It started out as a game with immense potential and, over the years—despite all the setbacks—grew into a more than solid MMO.\nThe announced shutdown is the biggest blow to the players and the moment Amazon ultimately dug the game’s own grave. Thanks for that, Amazon. \n\nNew World will remain my favorite game and will always have a place in my gamer heart.\nWith the small hope that it might somehow survive…",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to make sure that I submitted a review before you couldn't do so anymore. I'm a really casual MMO gamer, but New World was one of my favorite games of all-time. I wish I spent more time in the game. I kept telling myself I would come back when there was more content, and season 10 was finally everything I wanted and it showed that the game was finally on the right track, but then just as quickly as the celebrations began, the news broke that the game was entering maintenance mode. I'm sad for all of the players who found a home in this game and had it taken away from them. Long live Aeternum.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a nice game. It's not groundbreaking but it is in a good place. I know I haven't played it much (11 hours at the time of this posting) but what I have played has been a good time. \n\nNo more updates? I'm okay with. Closing the servers after 2026? THAT I'm not okay with. Just keep them open. \n\nStop killing good games!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game took over my life for a while. It had a lot of potential, but I can not recommend it now as it will be shutting down the servers.  The world was very pretty, the fishing was relaxing and in depth. But Amazon really didn't give it its all. They said their would be no more paid content once you bought the game, that was a lie. They said there would be no AI implemented into the game, that was a lie. They did not listen to the player base. I hope they sell the rights/assets of this game and a proper developer will take over and make this game as great we all expected it to be. At 454 hours my life revolved around this game for a few months. Sad to see it go.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "New World: Aeternum has been one of those games that pulls you in with its world and keeps you grinding, in the best way possible. It’s fun, addicting, and packed with more content than you might expect at first glance. There’s something deeply satisfying about how the game rewards effort, whether you’re crafting, gathering, questing, or exploring the wild corners of Aeternum. It can be grindy, yes, but that grind gives every achievement a sense of purpose.\r\n\r\nOne of the biggest highlights for me has been the mounts. They completely change how the world feels — speeding across open fields, cutting through dense forests, or climbing up rugged hills never gets old. The attention to detail in mount animations and the way they interact with the terrain adds a level of immersion that feels surprisingly natural. Traveling used to be a bit of a chore in earlier versions, but mounts make exploration exciting again.\r\n\r\nThen there’s Night Haven, a beautifully atmospheric zone that stands out as one of the game’s best additions. The lighting, the eerie glow of the flora, and the subtle background sounds all come together to create a setting that’s both mysterious and peaceful. It’s the kind of place that makes you slow down just to take it all in. The first time I entered Night Haven, I genuinely felt like I’d stepped into another world.\r\n\r\nWhat also struck me is how some areas of Aeternum remind me of World of Warcraft. Not in a copycat way, but in that nostalgic, comforting sense of a vast fantasy world full of distinct biomes and hidden stories. The architecture, the color palettes, and the ambient sounds all bring back memories of exploring Azeroth for the first time. New World manages to capture that same spirit of discovery, where every hill or forest feels like it could hide something worth finding.\r\n\r\nIt’s bittersweet knowing the servers are closing. There’s a sadness that comes with seeing a game you’ve invested time in reach its end. But that shouldn’t stop anyone from experiencing what makes New World special while it’s still around. Even in its final days, Aeternum offers adventure, challenge, and beauty.\r\n\r\nIf you’ve ever loved MMORPGs that reward effort and exploration, don’t miss the chance to dive in before it’s gone. It’s a world worth remembering.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wanted a change from WoW and couldn't get into Guild Wars 2. Man did this game scratch that itch. \n\nThis is a true action combat MMO. It feels good to play. Even the mundane kill/collect quests are fun because the gameplay loop is fun. The graphics are best in genre. Seriously - this game is beautiful. The gathering system is also S-tier.  I didn't find the social elements of the game very intuitive though. I don't think I spoke to anyone in my 50+ hours with the game. I didn't really understand the point of running the expeditions especially at low level. \n\nThat said, this was a solid foundation for an incredible MMO. A rework of the endgame and dungeon system, some technical polish here and there and some more interesting transmog would have made this a serious competitor for WoW.\n\nSadly it was made by the wrong company. Amazon killed this game because their 'little experiment' didn't make billions right off the bat. An MMO is a long-term commitment and sadly they couldn't commit. I'm sad about what's happened to the studio and this game and I wanted to leave my thoughts as I had a really great time with it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is truly special.  Amazon is fumbling massively by discontinuing support.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SO pissed they pulled the plug on this game was my all time come back to game and now it feels hopeless please sell the game for the gamers sake",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, terrible company.   Best MMO on the market and Amazon continually squandered their opportunities.  They released the best update to date and then shut it down.   Total incompetence.   How they just dont put this on Luna and/or make it f2p is insane.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall great game, too bad Amazon sucks and the AI bubble is eating everything.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the most unique MMOs out there. Masterwork design, atmosphere and immersion.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "in my opinion, this game is perfect. I've been playing since launch with over 10,000 hours logged and I am still a long ways from being bored. Sure it was rough at first, but it's since evolved into being the best MMORPG out there. innumerable quality of life improvements have been added as well as so many details to every aspect of the game. And it's free to play! \r\n\r\nThe landscapes are stunning (the quality of light alone is amazing), the diverse and well researched gear, and excellent combat puts it head and shoulders above the rest. \r\n\r\nI'm primarily a solo PVE player and I love the questing, fishing, gathering/harvesting, crafting, economy, and the option to own and decorate three houses per character. You can even create your own furniture! \r\nI would happily be playing this game even if there were a monthly subscription, it's well worth it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game made a huge comeback only to get killed by Amazon.\nThanks to the devs for this amazing journey.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best MMO I ever played. RIP to a game with such high potential. Fuck Snoop Dogg.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It is very sad that this game is shutting down, having played on/off for couple of years now and always enjoyed the game. A very nice sad box and fun, exploring feels real and combat is nice.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This Game was really immersive. I liked it and I saw a great future for it. Too bad that its going down. I will no longer support amazon.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "6000 hours and its been great - but sadly its coming to the end and I don't think there is anything out there good enough to replace it..",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is absolutley the best game I have ever played, the details, quests and adventures with friends has kept me alive and given me a purpose the past 2 years as I went through some horrific real life events.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This review is partially in response to the announcement that the game will be shutting down.\n\nTo preface, I would like to say that I'm hardly New World's number one fan. I've had a lot to complain about the game up until this point, and even still have gripes that will never have the chance to be resolved.\n\nI will don't want to dwell on what I don't like too much, because my gripes are, for the most part, personal preference. Off the top of my head, the monetization of the game was just flat out greedy. And the transmog system was very not good. Everything else, from the poor gearing to the simple combat, are just a matter of preference.\n\nNow for what I think this game does well, or maybe even the best.\n\nThe weapon animations for a few specific weapons are just downright some of the coolest in any mmo I've played. The Void Gauntlet as a whole is definitely one of the coolest weapons in the game even if it wasn't my favorite.\n\nWhile the gathering and crafting system had a number of things holding it back from being great, several were addressed relatively recently. And even if they never added the end point they were wanting crafting to have, it's still what I spent a good deal of my time in the game doing. Not the best crafting system, but not bad.\n\nIt also has one of the best fishing mini-games out of any mmo on the market. Which is an important part to any mmo.\n\nAnd for my absolute favorite part of the game, the thing that kept me from uninstalling the game and had me coming back regularly just to partake in this simple, joyous activity. The instrument system. Not only is it just flat out fun to play the guitar hero-esque minigame, being able to invite people to join in to play different instruments for the full ensemble of a song is just phenomenal. And the songs themselves sound great, kinda wish a few were easier to find sheet music for. The fact you can give anyone listening a buff if they tip you a few gold pieces, as well as just getting the buff yourself, which is stronger the better you play. It's all just phenomenal. And if any other mmo looks at New World as anything but a failure, I hope they can at the very least see this mini-game and take inspiration to make something just as fun for their own game.\n\nAs I said, I'm nowhere near the biggest fan of New World. But I have zero issues saying that the game doesn't deserve to be shut down. It's had a loyal, kool-aid drinking playerbase for its entire lifetime. Sticking with the game through thick and thin. And even if a player doesn't like everything in the game, there's always something in the game to have fun with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ever since beta, this has been one of my favorite games. This game has such a unique combat and movement system, which makes the world feel peaceful and charming. From fighting wars daily to dancing and crawling through town with different faction members, this game has been a blast. While there were/are plenty of bugs and a lengthy grind requirement, this game will forever remain a nostalgic and great experience for me. I wish there was a future for this game, but ultimately understand why there isn’t. It’s been a good run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has made phenomenal progress since I beta tested it. I recently rejoined after seeing some of the updates online. I am so disappointed Amazon is discontinuing this game, because in its current state, it is easily one of the best mmos out there. Amazon, if you read any of these, please don't let this game die. Sell it to someone else if you're not going to run it. There's a good community here that doesn't deserve to be orphaned.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m really sad that the game is being shut down for reasons that make no sense. Is it really so expensive and unprofitable to keep just few servers running and occasionally release paid skins? I’ve played it so much that I can’t even count the hours, even my League of Legends playtime is lower xD I had friends there and a reason to log in every day. I bought skins and customized them because they were fun. The daily chestruns also created tons of jokes, memes, and enjoyable moments. At night you could run into groups farming craft-set hats, hoodies, pants and boots, and join them at any moment.\nI’m truly sad that Amazon’s management simply cut off something that could have lived for years. Yes, maybe it wasn’t massive, but there definitely would have been enough local players. and holymoly why then ppl can buy it here at full price? company just want to make more money before end?\n_______________\nмне очень жаль, что игру закрывают непонятно почему. неужели настолько дорого и неокупаемо оставить работать 1-2 сервера и периодически добавлять платные скины? я играла в нее столько, что не посчитать, даже количество часов в лиге легенд наиграно меньше. у меня там были друзья и причина заходить каждый день. я покупала скины и модифицировала их, потому что они прикольные. ежедневный лут сундуков толпой людей также приносил кучу приколов, мемов и удовольствия. по ночам можно было встретить группы людей, что фармят шапки, кофты, штаны крафт-комплектов и в любой момент присоединиться к ним. \nмне очень жаль, что руководство амазона просто обрубило то, что могло жить еще годы. да, может не массово, но локальные игроки точно были бы.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Right now it doesn’t really have anything exciting to show off, though to be fair, when it first came out it was dope, and that good feeling will always stay with me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've put over a 1,000 hours into New World, grinding, exploring, fighting, crafting, the whole deal. Through all the ups and downs, I stuck with it because the world was beautiful, the combat was satisfying, and the game honestly had something special when it all worked.\n\nThat's why it sucks so much seeing it getting shut down.\n\nIt feels like everything I put into the game, the late nights, the endless farming loops, the gear progression, the PvP hours just evaporated. The worst part? I can't even get onto the game half the time anymore because every time I try, it just reminds me that all those hours are basically stuck in a world that's fading out.\n\nI know MMOs evolve, and some die, but this one hurts. It wasn't perfect, but it had very good potential. A lot of us believed in it and now it's like all that time and effort has nowhere to go but 6ft under.\n\nSo yeah... amazing memories, terrible ending. Wish it didn't have to go out like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fire game, its challenging but not complex. It can get a bit grindy but its very fun. I really liked the fishing aspect of it and how you can buy a little home and decorate it. I didnt play enough to understand how people get points in rating their houses but pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember when I decided to buy it because my favorite streamer was going to play it at the time. I wanted to feel like I was part of a big game from minute one. However, its release wasn't the best; my friends didn't want to play, and well, I decided to drop it.\n\nHowever, a little over a year ago, or to be more precise, with the arrival of Athernum, I decided to give it another chance, along with two other friends. Those were the best months in years.\n\nThis game made me want to play other MMOs once I reached the final part of the game and realized that PvP wasn't for me. However, I didn't find anything like NW out there.\n\nIt's sad to know they're going to shut it down, but I suppose Amazon prefers to invest in AI and lay off employees because, poor things, they're a small company with no money.\n\nGood game, bad company behind it.\n\nIf any developers see this review, thank you so much for your work; it was an incredible game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the first and best MMO's I have played. \nHope players get compensated somehow!\n\nA little sad to see it going away!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent MMO.  Fun classes, excellent combat, nicely paced progression with a compelling story and world.  Even the crafting is fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a graphically stunning game .not to sure of the population  seems a little quiet but there are always people barking for group in world chat so its not abandoned  i enjoy the crafting system myself .its not worthless like wow or to insanely  complicated like swtor. all and all if you go into it open minded i'm sure you will enjoy a few hundred hours of gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New World had its ups and downs, but man… it didn’t deserve to go out like this. Despite the rocky start, the game eventually found its footing — the world design, the atmosphere, the sound of trees falling and battles echoing through Aeternum — it all had so much heart. You could feel the potential every time you logged in.\n\nIt’s honestly heartbreaking seeing it get shut down, not because the community gave up, but because Amazon did. Instead of nurturing a game that had finally started to shine, they’ve decided to chase whatever “Luna AI” project they think will be the next big thing. Sorry, but I’m not interested in AI-driven experiments — I wanted to live in a world, not have one generated by an algorithm.\n\nRIP New World. You had the soul, the look, and the spark of something truly special.\nWe’ll remember Aeternum not for how it ended, but for the adventures we had in it.\n\n💔 Gone too soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "J'ai adoré le jeu, ambiance incroyable j'y joue de temps en temps encore pour admirer et profiter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first mmo and I had the best time since the beginning. Created so many friends along the way and the community was super friendly. Created a tight-knit community where we were doing raids, pvp, mutations, etc. almost every day until they announced they will shut down the servers. Super bummed about that but I'm just glad I got to experience the best times in this game. I love New World but I hate Amazon <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun, sucks no new content and it might shut down starting 2026",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing since launch and have had loads of fun even with taking multiple breaks for months at a time. The world was cool and the players we even better when you got a good community formed. The game sure had its problems throughout its life cycle and it is really a shame to hear its not having anymore content updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is currently, hands down, the best (MMO)RPG out there. Even if a lot of people are unsettled about the discontinuation of Development. \r\n\r\nWill enjoy the rest of the time it is running a lot. \r\nReturned to the game each year and stayed for a while and returned this year for the expansion and I have gotten to like it quite a lot.\r\n\r\nThanks for keeping the Servers running and continuing the updates. <3\r\n\r\nP.S.: Don't let the low play times fool you. I am a Dad and the time sums up my actual playtime. To me that is a lot of time played. ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but i bought it too late, after i found out they will stop the content and the servers next year.. this is so stupid. But overall the game is fun to play, very pretty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am really enjoying playing. Wide possibilities to build you character , many different quest beside a story line. Hugh free roam world. Huge selection of armour builds and wide variety of crafting possibilities.. Loads of different beast to kill. Great music... and so far everything has been entertaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sad they are ending support for this game, such potential wasted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please don’t do review bombing — it doesn’t hurt Amazon, only the real people who made the game and now need to find new jobs. They did their best, and they deserve respect for that.\n\nNew World was a very beautiful and ambitious MMO. The world, the music, and the combat showed how much effort and passion the developers had. It’s sad to see it shutting down, but I want to say thank you to the team who worked so hard on it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Womp Womp... Amazon gave up on there game...  Don't buy as they are shutting down servers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fingers crossed another company takes it over. There is a lot here that I think with more love and care put into it, will be a long lasting MMO. Please don't give up on it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "new world is one of the best games I have played it has a lot to look around and find i have played this game for 7000 hours since day one the game has had a lot of ups and downs through the years since launch the game was put on a loosing path from amazon releasing the game to early before it was ready for launch after being told the game needed 3 more years to make they still launched the game with slow content and full game changes A.G.S. was miss managed by people put in power that had no clue how to run a game company on top of having servers that could not handle the traffic of a AAA game but even with the company amazon handling the company like a top studio with years of mmo exp witch is a joke when this was a start up with no mmo exp or pre built engine for mmo or even given enough time to build a story people could get behind the game is not bad at all the people building the game were amazing the company amazon though throwing money at 12 games and promoting 10 and not building one game on a top tier level any truly good game comes from great stories and great game play that takes time to build and new world was on the right path to make something amazing but amazon was looking for quick and easy money these other guys can do it lol the truth is if you have not played the game and wanna try it you should the fighting system is top tier and pvp is crazy but you have to build and learn the system use new world buddy and new world data base to put your build together and you will have a great time meet cool people go on raids before this game is gone this game will forever be the best game that almost made it to that top gaming best mmo in the world stat the game is best when you dive deep and find hidden elite chests climb a hill that you did not think you could do a box run with your friends run wild do crazy builds dye your gear make a champ buy a house and make it look like home do a war 40 vs 40 this game was the best time i have ever had on a pc or just playing games ........................  after this game ends ill be done gaming most games are ether to hard to learn or over done or over priced or like most of the games out now days you play with other people online full of cheaters trying to make there name on twitch with no sole no real fun new world was a breath of fresh air when every other game is not that fun to fight in new world felt like a relaxing home away from home i know i have bad grammar spelling and all but to tell you the truth if anyone got the chance to get this dev team on building a mmo like new world or got to keep building new world it would be the best game ever made just needed a little more time to build i have met a lot of very cool and amazing people throw new world and im glad i played this game and met people i could call friends thank you if you read this far i hope everyone had enjoyed new world as much as i have and if its gone forever i hope everyone has cool stories to tell about there time playing new world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Es un juego muy entretenido, con mecanicas de combate únicas que no se ven en otros juegos MMO, lastima que llegue tarde, aunque según dicen todo lo bueno apenas había llegado. jeje Despúes de haberle invertido un buen de horas puedo decir, que se puede jugar fácilmente solo, pero es obvio que es mejor con mas personas. Tiene mucho contenido, mapas, enemigos, actividades para entretenerse tanto PVE como PVP, la verdad que es de los pocos juegos que me han atrapado, como todo en la vida nada es perfecto y pues si que hay cosas por ahí como que se desconecta aleatoreamente, pero bueno eso no me ha impedido jugarlo/disfrutarlo, dado que lo van a cerrar, no me quise quedar con las ganas de haberlo tenido y no jugarlo. Pero puedo decir que es un buen juego MMORPG lastima que nunca llegó a tener la cantidad de gente que amazon hubiese querido.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s very sad that after such news, players are posting angry comments here, as if it were the developers’ fault. They all have lost their job! Players quickly forgot why this game was amazing. Huge thanks to the developers for creating such an exceptional experience. The atmosphere, music, and character control options were perfect, amazing dungeons and the whole world.\n\nYou didn’t have to treat this game like a job. A game stops being fun when you have to grind endlessly just to achieve something. Sitting in the same spot for hours, fighting invincible bosses with frustrating mechanics and even more frustrating players — that’s not enjoyable.\n\nNew World was completely different, and that’s what I loved most about it. It was one of the best games I’ve ever played. I truly hope its future unfolds in a way that places it in good hands, so we can enjoy it once again.\n\nFakc u AMAZON",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game had a pretty rough start but you could see the devs had love for the game in the world they created, the sound, the locations - all absolutely stunning.\n\nThankfully, Scott Lane was taken off the project and then we got Katy and things changed massively - regular communications, bug fixes were far quicker than before and there started to be a real link between the devs and the community whilst the game remained one of the prettiest in its genre - honestly the world is a stunning place to be in.\n\nThank you Katy and the devs that have worked on this game, you created something special and close to many peoples hearts.\n\nIf you have not played it yet, do - whilst we know the servers are closing you can still easily get 200 hours out of it and people are continuing to keep the multiplayer stuff alive while we can.\n\nFuck amazon tho, fuck them to the moon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[b]New World on Linux + OptiScaler for Linux[/b]\n\nNew World on Linux feels like keeping an MMO alive by sheer stubbornness — and I love it.\n\nThe game is in maintenance mode now, but Aeternum is still gorgeous, the action combat is fun, and gathering/crafting is oddly relaxing. If you’re a Linux gamer who refuses to boot Windows just to play one MMO, there is still a lot of value here.\n\n[hr]\n\n[b]New World on Linux – Mini Review[/b]\n\nOn Linux with Proton, New World can run well once it’s properly tuned. \nAfter some tweaking and using my tool [b]OptiScaler for Linux[/b], performance went from “borderline slideshow” to actually smooth in cities and large fights.\n\nAnti-cheat and Windows-first decisions are still annoying, but I refuse to boot Windows just to play. \nIf you’re okay with no new content and want an MMO you can enjoy on a free OS, leveraging your own tools instead of brand-imposed chains, [b]New World is still worth playing on Linux[/b]. 🐧💻\n\n[hr]\n\n[b]What is OptiScaler for Linux?[/b]\n\n[url=https://github.com/ind4skylivey/0ptiscaler4linux]OptiScaler for Linux[/url] is basically the intelligent OptiScaler installer that Linux gamers were missing:\n\n[i]“Automatically configures FSR4, XeSS, and DLSS upscaling for massive FPS gains in Linux games. One-command installation. Works with Steam, Proton, and Steam Deck. Supports AMD, Intel, and NVIDIA GPUs.”[/i]\n\nIn plain gamer terms:\n[b]You run a script, and suddenly your games stop feeling like a slideshow.[/b]\n\n[hr]\n\n[b]What it actually does[/b]\n\n[list]\n[*]Detects your GPU (AMD RDNA1/2/3/4, Intel Arc, NVIDIA RTX/GTX) and checks driver capabilities.\n[*]Scans your Steam library and finds games where OptiScaler + FSR4/XeSS/DLSS make sense.\n[*]Generates optimal configs per GPU + per game, choosing between FSR4, XeSS or DLSS and tuning quality vs performance.\n[*]Installs everything with backups and rollback, so if something breaks you’re not rage-reinstalling Proton from scratch.\n[/list]\n\nThe dev (me) reports [b]~50–80% FPS boosts[/b] in heavy titles :)\nNew World isn’t listed as the official poster child, but the tech is the same: smart upscaling + sane GPU profiles + Proton.\n\nOn Arch-based distros (and Steam Deck), there’s even an AUR package:\n[b]optiscaler-universal[/b], which wraps this project directly.\n\n[hr]\n\n[b]TL;DR[/b]\n\n[list]\n[*]New World is in maintenance mode, but still fun.\n[*]Linux + Proton runs it fine once tuned.\n[*]OptiScaler for Linux helps push FPS higher and keep the game playable on a free OS.\n[/list]\n\nIf you’re a stubborn Linux penguin who wants to enjoy Aeternum without Windows chains, this combo is absolutely worth a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played enough MMOs for 6 hours, and then for another 60 or 600 hours, that I can promise you after 6 hours I know how good this game is, and it's a pretty good game.\n\nJust the same I wouldn't normally review it this soon, but the game is getting review bombed by people who think an end to content updates means the game is going to shut down. It might, but this has never happened before. They are overreacting, and even if they aren't overreacting the game is easily worth the asking price. It's messy and there are a lot of small things not to like, but the world is pleasant to be in, the player character is enjoyable to control, and combat feels crisp and clonky like a game should. Sound effects are great, newbie areas aren't abandoned, I'm having more fun than I've had in a new MMO since uh... well... Wildstar. So take all that with as much salt as you like, but I'm recommending it anyway.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Let me preface this; I've been with the game since its release and its 18 hour queues.\nI absolutely love and adore this game, I never understood the hate. I still don't,\n\nLEAVING NEGATIVE REVIEWS ONLY HURTS THE DEVS: Look at other review bombing cases,\nyet another one of my longest played games War Thunder has only seen change because\nof review bombing because its still active and alive. meaning the devs had their job on the line\nAnyone doing this out of pain and anger towards Amazon for this decision, I get it. But you're\nonly hurting the devs chances at getting jobs in the long run. \n\nThe combat is second to none, if basic for an MMO. Some don't like it, I love it.\nPVP being optional, aside from a single region in cutlass. lots of PVE and quest content.\nSound design best in the industry, I genuinely haven't played something else that\ncaptivated and immersed me like New World. Crafting was intuitive, if grindy.\nbut what MMO isn't? they tried making things easier for the general populace of the game.\nThey listened to community feedback and balanced the game they believed would be compromise\nin my eyes nobody was favoured, if they were. PVP would be a lot different. Heck, they even\nhave a button in game with a system for reporting bugs or things you may find or want to see changed.\n\nI've made so many memories, good, bad, weird, but overall most of the memories I will keep in the long run\nare good, on my most stressful of days I could log in. And just be there, in the moment having fun.\n\nIt saddens me greatly to see the game being axed here, but I do not believe that in my own feelings\nI could even bring myself to leave a negative review and hurt the outstanding devs chances at work in the future.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "---{ [b]Gameplay[/b] }---\n☐ Excellent!\n☐ Very Good!\n☑ Good!\n☐ It's just gameplay!\n☐ Mehh!\n☐ Watch paint dry instead!\n\n---{ [b]Graphics[/b] }---\n☐ Reality looks disappointingly ugly in comparison!\n☑ Gorgeous!\n☐ Good!\n☐ Decent!\n☐ Bad!\n☐ Bus Simulator 16 Ultra Low settings!\n☐ $1 Budget game!\n\n---{ [b]Audio[/b] }---\n☐ Eargasm!\n☐ Very good!\n☑ Good!\n☐ Manageable!\n☐ Bad!\n☐ My ears!\n\n---{ [b]Audience[/b] }---\n☐ Fresh out the womb & up!\n☐ 8 & up!\n☐ 13 & up!\n☑ 18 & up!\n☐ 30 & up!\n☐ 60 & up!\n☐ You will never be old enough!\n\n---{ [b]PC Requirements[/b] }---\n☐ Potato!\n☐ Smart toaster!\n☐ Decent!\n☑ Fast!\n☐ Ask your employer if they can give you a 500% pay raise!\n☐ Invest in a Quantum computer!\n☐ Get into a rocket flying at 50% the speed of light. Wait 3 months, return to Earth, then play the game!\n\n---{ [b]Game Size[/b] }---\n☐ Floppy Disk!\n☐ Old Fashioned!\n☐ Workable!\n☑ Big!\n☐ Will eat 20% of your 4TB drive!\n☐ You will want an entire drive just to hold it!\n☐ Ask Google if they have a spare mega-datacenter!\n☐ You will need to invest in a black hole to hold all the data!\n\n---{ [b]Difficulty[/b] }---\n☐ Just press 'W'!\n☐ Easy!\n☑ Easy to learn / Hard to master!\n☐ Significant brain usage!\n☐ Difficult!\n☐ Learned to code in Brainfuck and wrote a whole OS in it! Playing this game is the hardest thing I have done in my life!\n\n---{ [b]Game Time[/b] }---\n☐ The speed of light is slower!\n☐ Short!\n☐ Average!\n☑ Long!\n☐ You'll die before this game runs out of content!\n\n---{ [b]Price[/b] }---\n☐ Worth the price!\n☐ If it's on sale!\n☑ If you find some spare money behind the couch!\n☐ Not recommended!\n☐ Burning your money is better!\n\n---{ [b]Bugs[/b] }---\n☐ Never heard of!\n☑ Minor bugs!\n☐ Can get annoying!\n☐ Cities: Skylines II at launch!\n☐ Developers showing off their bug implementation skills!\n☐ Cyberpunk 2077 at launch!\n\n---{ [b]? / 10[/b] }---\n☐ 1!\n☐ 2!\n☐ 3!\n☐ 4!\n☐ 5!\n☐ 6!\n☐ 7!\n☑ 8!\n☐ 9!\n☐ 10!\n\n---{ [b]Authors[/b] }---\n☑ [url=https://bigflubba.github.io/steam-review-template] Big Flubba [/url] \n☑ [url=https://vojtastruhar.github.io/steam-review-template] Vojtěch Struhár [/url]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, i have almost a thousand hours into the dang thing, good people and even after having mastered everything i still dont run out of stuff to do, but as with any game, ya gotta take a break once in awhile, which is what i did, so now gonna come back and see if i can get ya to give me your gold in the marketplace!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I thought this was a awesome game.   Wish ppl would stop shitting on it .  No other game out there like this one .    Only complaint is not being able to build your own  house",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was great, it took some time (rough start) but it eventually grew to what it is today. All these review bombs makes it a sad. The thing is you're hurting the developers, not Amazon. Game was fun and will be missed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive liked everything from the start. this is my third character playing through and i always come back. this mmo is not like any other, combat system is the best i think and takes skill. The grind i love, the being able to hold towns and everything. i really hope this game stays alive and i know others feel the same way. look at diablo 2 another game i seem to go back too and they remastered it. This game could do the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]This is a brief review left to counteract the review bombing from the game being shut down. I am sad that the game is on maintenance mode BUT, i believe a good game should still have good reviews. Leaving bad reviews could affect the jobs of the hard working people that made this game. Also bad reviews will do nothing to change the mind of executives but good reviews may help someone in their considerations to purchase the IP.  [/i] \n\n\nHonestly, I've tried so many MMOs. WoW, GW2, Neverwinter, ESO, FF14, Wizard 101, Pirate 101, Wakfu, Runescape, Albion, Black Desert, Toontown, Rift, Trove, Dofus, Vindictus, Tera, and probably more that have slipped my mind. None of them have hooked me and made the memories like New World has (Though Albion came close).\n\nWhile the setting isn't your usual MMO fantasy, the uniqueness helps it stand out. The quests and story telling are great, the graphics stand above and beyond other MMOs, and very few games match the wonderful sound design. I could listen to people chop trees and mine ore for HOURS.\n\nThe combat is simple, but stands out from your usual tab-target MMOs in a way that feels good for both PvP and PvE. The Skill Grind is fun in no small part to the excellent visual and sound design I mentioned earlier. Dungeons, Raids, and other late game PvE content encourages teamwork and communication, feeling rewarding when you are successful. The PvP gamemodes are also rewarding, whether it be the minor success of a duel or 3v3 fight or the cheers of joy from winning a War or OPR.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]\"New World: Aeternum – The Ultimate Tree‑Chopping Simulator (With Bonus MMO Features)\"[/h1]\n\nAfter 450+ hours in New World: Aeternum, I can confirm this game is absolutely incredible. Not because of the epic battles, the sprawling expeditions, or the deep lore… but because I’ve become the most dedicated lumberjack Aeternum has ever seen.\n\nWhile others are slaying monsters, conquering territories, and forging legendary weapons, I’m out here living my best life: chopping down trees, bonking rocks, and single‑handedly deforesting entire regions. My axe and pickaxe are basically extensions of my soul at this point. If there’s a tree, I will chop it. If there’s a stone, I will bonk it. My friends call me “the resource guy,” but I prefer “Aeternum’s premier landscaping service.”\n\nThe beauty of New World: Aeternum is that it makes even the simplest tasks feel rewarding. Gathering isn’t just busywork—it’s strangely therapeutic. You start out thinking, “I’ll just grab a few logs,” and suddenly it’s 3 a.m., your inventory is overflowing, and you’re questioning your life choices while still smiling.\n\nOf course, the combat, crafting, and exploration are fantastic too. But let’s be honest: the real endgame is chopping trees until the forest cries uncle.\n\n10/10 would bonk another stone and swing another axe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! So much to do and so many places to roam around in. I am excited to see where this journey takes me!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best MMO of the Modern Era. Had so much potential left in it. Disappointed to see it going away, but will continue to play what I can while we still have it!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Muy bueno gamings, cheapest mmo to date, 60€ for 4 years of gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great.  The devs are great.  Amazon is not great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve only played four MMOs, but this is my absolute favorite. The visuals and sounds are incredible. The world is beautiful. The PvP is a blast. I’ll be so upset if the servers really do get shut down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look how they massacred my boy\n\nIt was the framework for what a modern MMO could be, mismanaged to hell",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's good. It's sad it is dying. Good times and good memories.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best MMO ever made with real aiming combat, and now its sunsetting :(",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best MMO out there. I hope some other GameStudio with vision buys it off. Hard to beat.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Loving the world of Aeternum. I am looking forward to the future of this franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rest in peace new world. so many amazing memories. so many amazing times. been here since beta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game has changed alot since launch, sad to see it shut down",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it good like those elephant ears at carnival's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a great game find some friends to play and have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game has its own quirks but still fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was awesome loved this game wish it Amazons to ruin hopefully they will sell it off before the end",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There is potential for this game/franchise to be amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "R.I.P. New World and the best Combat System.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "pretty good but they are going to delete the game soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS A GOOD GAME, GRAPHICS ARE AMAZING IT JUST LACKS CONTENT A LITTLE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a shame that this game is getting closed down. They had the best combat of all MMOs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Obviously I'm a fan. I've played since late alpha. Best MMO combat (ruined tab target for me). Grounded aesthetic. S-tier sound design and lighting. The world feels like a real place in terms of terrain and geography. Survival/crafting aspects of resource gathering are amazing -- go chop down every tree and mine every boulder, pick up every bush and berry. The most generous monetization of any MMO.\n\nIt has largely addressed and fixed the lack-of-endgame critique and had multiple new weapons, gardening, sailing, casual 50v50 War, and battle royale in the pipeline. Nighthaven is a wonderfully-designed zone in most ways.\n\nIt deserves so much better than it's gotten, and the recent news is depressing.\n\nIt is still great fun and if you join Valhalla you will be able to experience it like a MMO because servers are made for 2000+/- people so it doesn't need a huge pop to feel populated and alive especially during primetime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "May Everfall rest in peace. Best zone in any game ever. I never left and thats probably why the game died. I cant imagine many did.\n\nAlso, I hated that they made it an MMO. The alpha was fucking sick as a survival game. But all the big corporations did a big U turn when it came to survival games. So you get what you get you greedy fucks survival games are the best!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, Amazon has announced the game will shut down at the end of 2026. I would still recommend this, if you have never played it now is a great time to get a ton of content and experience a great game. Nighthaven expansion is beautiful, great job developers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wish I had tried this game a year or two. I really hope Amazon changes their minds about this game or has another studio pick it up to keep the game alive!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best looking MMORPG in the market. Trade skills are very well made and are satisfying.\n\nIt's sad that it won't receive any other large content update. If you are curious about what happened, check the news, won't write it down here. I'll still recommend this game, because it can be fully experienced in one year. There are still plenty of players around with the server merges.\n\nThere is a petition going on about asking amazon to reinstate the devs - Sign it if you'd like to, but I doubt it will change anything ( I signed it ).\n\n- Great job to the actual developers who lost their job - You made a beautiful world. \n- F*ck you amazon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ive been gaming for many years now. From the 80s until this present day. New world after a bumpy start has matured and turned into a butterfly. Its beautiful to play and with the best sound lighting and game play ever. A brilliant turn around by its Devs. So sad i am loosing  my to go to place after a hard days work. I have been here from day one. I am now in my housing quarters sat on my chair with my pets beside me waiting for the lights to out forever. So sad. This is a game so worth saving. i would be happy to pay a sub to keep playing this wonderful game. But the darkness of Amazons greed is approaching. Thank you Devs for you outstanding effort time and love. And to the player base now leaving and gone. Thank you also for the outstanding times we shared. xx",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been having a lot of fun with it and will continue to play regardless of what happens in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While this game had its history of ups and downs over the years, for me it was a truly a memorable experience. In memory of New World, I will always look back on the hours spent here fondly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have greatly enjoyed this game over its lifespan and I am deeply sad to hear about it no longer being supported I am hoping that some other company my pick this game up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun and is worth the effort. Sure it has flaws.\nI'm enjoying almost every aspect of the game. there is a lot of QoL that needs improving and some already has.\nA lot is way better then with the launch.\nCrafting is easier with the fact you can access all the materials (all storage sheds) and not just what is in the city\nAnimations are lagging when the server is busy. (just animations everything still happening)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Was a one of a kind game. Def had its issues but this mmo just was the perfect game when it comes to the MMO genre. Sad to see it go. Would love to see amazon attempt to sell this game off rather then just trash the game. Hope to see a mmo that was similar to this soon, some are somewhat close but have not found one that I enjoyed so much like this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a massive shame Amazon is shutting this game down, it has still massive potential to be a top contender in the mmo market which finds itself mostly uninspired, dominated by ai and mobile game garbage. It's not perfect, but does it really need to be? Exploring the world in itself is a fun experience, the formula is unique for an mmorpg. \r\n\r\nFingers crossed a more competent publisher buys out this IP. The game itself has some fantastic sound design, the animations feel good. The character models are a bit waxxy however but you are easily distracted from that by the beautiful vibrant environments you find yourself exploring through.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, don't do negative reviews to the game just because amazon sucks.\n\nThe game itself is a great MMO with great combat mechanics and a really great crafting system. Let's hope we can find a future to the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favs. Sad that it might be going away but will play as much as I can until then and hope things turn around.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Imagine buying this game not knowing that the servers will shut down soon.\nLet's learn from this and not buy any new game from this company.",
      "voted_up": false,
      "votes_helpful": 159
    },
    {
      "review": "How this is still on steam they should return all the money for the players who bought before news not continuing updates and closing servers at 2026. Steam should talk with amazon and represent us and also return the money to the players.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "Will NEVER buy another amazon game. They finally started to figure it out, as soon as it starts to see success, Amazon closes the studio. \n\nNever support Amazon games. even if they make new games it will be filled with AI slop. Hope the hit to their gaming reputation was worth it. Tarnished your image forever",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Charging $59.99 for a game that is being shutdown is criminal. You SHOULD be refunding everyone who ever purchased this game. This game had SO much potential. Amazon didn't know how to make this flourish. Do right by those who not only BOUGHT your game, but also BOUGHT in game cosmetics!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Bough the game recently since a friend recommended just to see it is not getting new updates and can't refund this should be illegal man smh...",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "how is this game still for sale.... Amazon really is as scummy as it gets",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I specifically bought this game as the Ultimate Edition for the update because I planned to play it long-term with my friends, and then just one week later Amazon pulls this bullshit, fuck you guys!Basically fraud.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "DO NOT BUY!!! Service for this game was announced as going down soon! They shouldn't be able to sell this game anymore.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Revisited the game after some updates. Feels great but it`s going to be aborted by bald Jeff because he needs more money. I don`t recommend to trust Amazon.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "What a waste of potential; I should've known it would end like this from the beginning; it's Amazon Game Studios.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fantastic Game really enjoyed every moment in this game, sadly amazon is FKING retarded and trying to kill this game, I REALLY HOPE SOME COMPANY BUY THIS GAME.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game costing £66.99 on Steam, with servers expected to shut down in around 14 months.\n\n“Servers will remain active through 2026.”\n\nNothing makes me want to play a game more than knowing all my progress, achievements, and time invested will be gone on a finite date.\n\nIt’s honestly baffling that they’d relaunch a full-price version of an MMO already on life support, especially with no clear plan beyond a ticking clock. Charging premium prices for temporary access feels more like a rental than a game purchase.\n\nAt this point, New World: Aeternum isn’t a fresh start — it’s a farewell tour with an entry fee.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "STOP KILLING GAMES. This game is a poster child why we need laws regarding this problem.\n\nAbandoned, yet still being sold for hideous price. Wasted potential. Basically a \"how to\" manual on wasting the potential of an interesting universe and a game that had over 900K players in its peak.\n\nAlso to hell with amazon for how they treated the devs.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "it is ok shut down the server, but i need my Refund for your epic failure",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was a good game but just putting a negative review so people are aware it's shutting down.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Announcing the game is being shutdown after just releasing an update that improved the game and most likely resulted in a whole lot of new purchases is just scummy behaviour.\r\n\r\nDO NOT BUY THIS. It's a massive waste of time/money since it's now being shut down.\r\n\r\nTry another MMO you'll actually enjoy.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Scammed money out of players to shut it down. Pretty sure they also ran a sale event literally a week before they decided to pull the plug just to boost the bottom line.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Played on and off for several years. \n\nFinally bought the Angry Earth Expansion in early October after sitting at level 60 for atleast a year pondering if it was worth it if the only gameplay i really get into anymore us just to fish for a week every couple months, week later its announced the game is shutting down. lol just my luck",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Well, as you can tell, I've had three hours on this game.  I purchased it right before they announced they were shutting the game down, so now I'm out 59.99 and it can't be refunded.  Lucky me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was good until the bot gold farmers ruined it. Now its getting shut down yet still for sale for $90AU. What a scam.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "DO NOT BUY THE GAME - Unfortunately Amazon's greed, has taken one of the most current MMO's and decided it not profitable anymore. Stopping all updates as of October 2025, servers will probably shut down end of 2026. At this point they should just make it free to play until its shut down.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is being discontinued but it's still being sold; I find that shameful, especially considering the price being asked…\nLe jeu va être arrêté mais il est toujours mis en vente, je trouve ça honteux, surtout au vu du prix proposé…",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I bought this game and three days later they announced that it'll be shutting down absolutely disgusting and i played for more than two hours so steam wont refund me my money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If the servers are going to shutdown in 2026 why do you still have full priced packages of the game. There's no singleplayer it's an mmo LMAO.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "LOL, don't even bother developing other games Amazon ... you are done for the gaming community",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i played New world on and off.. But am sad its about to be closed... waste of my money to buy it ... cool game tho",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "One of the most fun games ive played to date. Unfortunate that amazon is such a dogshit company and are trashing the game because they didn't have a good business model for it. Trillion dollar company btw.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game ends in 2026. This was not public when i bought it. Based upon this information, this game is clearly a scam and i want my money back.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game had so much potential, but it's sad to see that it will never live up to that potential. I enjoyed the time I spent playing, but I can't see myself ever returning to the world of Aeternum. Soon enough I won't even be given the choice. Another game to add to the pile of games that I will mourn for a time before ultimately moving on. Add another developer studio and another publisher to my blacklist.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "With this recent news. I will never get any Amazon games. Amazon should have tried to sell the IP.   Great Respect for New Worlds Community... Fucking Corp Dicks",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Imagine releasing the best expansion, the one that may guide the game future with catacombs and a new raid. Nighthaven is a complete success. A dark and gloomy map, amazing ambient, music, lore, content... But then Amazon thought that s***y AI games are the future. \n\nHoping the best for the developers, just f**k you Amazon.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "game never met stride, bricked systems and now they are still selling it even after anouncing its over... selling something for tripple A price when you know it has maybe a year of time left on servers is criminal at best.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Was just thinking about New World and wanted to reinstall it and play again but I am welcomed with a message saying the servers are going offline in 2026??!  Ummmm......Can I have my money back please?  FFS I hate Amazon so much!  Sell the damn game!  Greedy greedy greedy!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game was awesome, came late to it when they didn't have enough server room and then made many of friends and played some great content. And just after they add a new section on the map and added mounts they pull the plug. Good job Amazon, should only stick to what your useful for sending packages.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played this game on launch, enjoyed it, but waited for bugs and what not to be fixed.\nCame back during the player count spike and was enjoying it again.\nThen Amazon cancelled it. \nI will never play any game that Amazon puts out, and you shouldn't either.\nWhat a disgusting, greedy group of people.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Played this game on and off for a few years, loved it honestly, lots of fun.\nAmazon Games is killing it now, the game has had harsh times and good times, but now that it's stabilized they are killing development for it and are soon to shut down the servers, was fun while it lasted I guess.\n\nI will probably steer away from any game made by Amazon Games now, if they are shutting down a 5 year old game that still had plenty of potential, I don't trust them with any of my money going forward.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Amazon being Amazon. Axe 13000 jobs and kill a game making comeback to focus on AI slop Courtroom chaos. Great job!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the only way this review will go positive is if they allow their game to be single-player/hosted co-op. \n\nthe game is going to die, that sucks. sure, it would be \"pointless\" for some people to play as a solo game, but i could see myself re-installing and just enjoying my time without servers. \n\nat least it would be better than an absolute shut-down.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ive heaard thiss game is being shut down it maakes me saad espessaly since its still on steam DONT WAIST YOUR MONEY...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Literally the only good step Amazon was able to get in with the game industry and even that wasn't enough. Of all things an MMO nonetheless. No easy feat. But nah lets shut it down for AI garbage no-one asked for. I have hundreds of hours and though I honestly haven't been on in a while it was amazing to be here from the beginning and watch this game work its hardest to find its identity and see the team pour their heart into it. Can't imagine how the people with THOUSANDS of hours feel. Sucks to think this game has only one direction and that's down 6 ft under\n\nAmazon is so poor that all they have is money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Loved the game... Until Amazon decided to close it right after the last big patch, waste of money. Will never invest money on an amazon game again, crapy company that don't care about their players.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Amazon canceled all development work on this game, but are happy to take money from people who didn't get the memo. Do not buy.\nSad because literally just before that announcement was made the game was in the best place it had ever been. Welcome to the disconnect between corporate executives and the products they oversee. I doubt anyone involved with canceling it have ever played a video game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] WARNING: DO NOT BUY THIS GAME! [/h1]\r\n[i] Also, pardon my English, not a native speaker... [/i]\r\n\r\nAs much as I love the game in it's current state, I cannot recommend this game anymore...\r\nThis game has insane potential, and it was just getting good after ironing out a lot of bugs and gameplay issues.\r\nOver the years the game has been live, they have reworked the leveling experience, added a lot of quality of life stuff based on player feedback, added voice acted npcs, added swimming (believe it or not), added some new weapons, and a lot more endgame content, and also released multiple expansions expanding the already great story, with more yet to come.\r\nThe graphics and sound design is 10/10 and it is simply just breathtaking.\r\nThe player counts have been sky high in certain periods because the players saw that this game had great potential. \r\n\r\nBut however, the reason I cannot recommend this game anymore is because of this:\r\nThe leadership of Amazon has found out that the income generated from New World wasn't high enough to justify the costs of maintenance, salaries and so forth. They then decided it was a good idea to shut down the whole project and the development studio working on this game and the upcoming Lord of the Rings MMO. \r\n\"Why?\" I hear you asking? They rather want to focus on using AI to create a lot of smaller games instead, like \"Courtroom Chaos - Starring Snoop Dogg\" 🤮\r\nThis is so sad because New World is awesome and it is a shame to see it go out like this...\r\n\r\n[i] Hopefully, someone will buy New World and continue developing it 🙏 [/i]",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Making people pay north of 80 AUD for a game to then cut it off is a disgusting and honestly expected from Amazon, never purchasing another of their games. Way to go bald man, how about instead of cutting your hedges you let the servers stay up you bald fat freak. :)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "rug pulled the game after a huge update to pull people in and sell the base game at $60 & battle pass. Cant even refund a a gift that only has 20 hours played thanks to steam supporting amazon actions going to buy all games from 3rd party from now on\n\nThe game is still up for $60 haha stay away from amazon games",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "So, this is going to come from someone who has played from alpha to beta. AGS has ruined any chance that me or anyone I know will ever buy a game from them again. DO NOT TRUST AGS or anything that comes from the Amazon Games side. They will backstab you faster than when they released daggers after New World was canceled.\n\nI have talked to devs and staff of AGS, and the leadership there are brain-dead. They don’t care about their staff, or who works with them, or who plays their game. It’s money, money, money for them.\n\nSo again: NEVER BUY AN AGS GAME. Don’t trust any false hype that they give. Always give the truth and bad reviews. They should not be making games and need to shut down completely.\n\nI’ve advised people to sell their stocks and to not invest. We currently have 1,591 people actively trying to get the truth out and tank Amazon Games. I suggest you join in the fight.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It’s sad to see this game die because of a greedy company.\r\nI really enjoyed it, and I’m honestly going to miss it.\r\nAt least I’ve still got a bunch of screenshots to remember it by.\r\nF*ck you, Amazon.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I started New World with zero expectations, some friends asked me to try it at launch and we ended up on a random Polish server due to low queues (we don't speak polish). Despite not speaking the language, the game quickly became one of my favorites. The world, the combat, wars… it was all amazing.\n\nI met many players and made genuinely great friends over the years, and in that sense New World delivered something special to me.\n\nBut from early on, one issue became impossible to ignore: AGS’ management and decision making regarding the game. There was potential, yet updates, decisions, communication, and long-term planning constantly held the game back. And now, with development ending, it’s hard not to feel that New World could have been something truly great, if only it had been in competent hands.\n\no7 to what could’ve been",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just when the game started to get its wings, Amazon yet again proves that they have absolutely no idea what they're doing. Nice work.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has been abandoned, but don't worry, you can still buy the in game currency.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A literal digital paper weight in my library because it was purchased through Steam. Never buying an Amazon game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't bother anymore they're going to kill the game after a nice cash grab.\nThank god I never spent a dime on cosmetics or the expansion",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was a relatively new player. I would love to recommend it because it really is fun and I'm not generally a fan of MMOs. However, Amazon is dick and I'm upset that this game is getting shut down. Unless you hear that it's getting bought by another dev, don't buy it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Great game tons of fun. Combat is fluid. Weapons are great. World building is amazing. Its a shame amazon canceled this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Theyre shutting the game down and have therefore made it completely worthless. Don't give them money for half finished abandonware.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For people who came back, spent money, and played a ton at the new content release. Only to announce the game would be shuttering. They stole our money and Steam wont honor the refund Amazon stated we could request after the announcement. \n\nThis game was awesome after the last update. \n\nAmazon sucks. Don't buy Amazon games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was a fun game that I returned to from time to time. With the announcement that it will shut down. No point carrying on. I wouldnt bother buying it now as an MMO being a long race with everything its not worth starting now.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I dont Recommend buying this game as it will be shut down next year. This game had promise and i enjoyed my time playing the game. What Amazon is doing with season 10 was great, created spark and re interest in the game. Announcing they are shutting it down after getting more people to buy the game is unforgivable! F*ck Amazon and the greediness that company comes with. Their LOTR game they are making i hope 1000% flops with how they treated this community and game. \n\nI will cherish my memories i made within New worlds World. If this were not being canceled and forgotten by the Devs id 100% recommend this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Man, you guys screwed the pooch on this one. All you had to do is run your servers from AWS, you know, you fukers own them. God forbid you let a small dev team keep their jobs and keep the game running. God forbid you make future money from sales and market items. CLOWNS.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Why is this game still for sale? The servers are shutting down with no offline mode.\n\nAmazon you say? That'll be why.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game getting shut down because amazon games doesn't care. Was a great game and unique.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was a good game... but its shutting down. Don't think I will ever play a game from Amazon again cause of this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Amazon killed this game and cancelled LOTR MMO which was in development to make that slop AI snoop dog game and perphaps other AI games too to put it on their shitty Luna cloud gaming service, weird timeline to live in. I love this game and would recommend but not anymore since they announced no more updates and keeping server on until the end of 2026 and a dead community again when it was thriving right before the announcement.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Loved this game, but now its gonna be gone soon... Thanks Amazon",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a fun game and I enjoyed playing it even with taking longer breaks from it and coming back later. As much as I would like to recommend this game I cannot. Because Amazon (not necessarily the dev team/Amazon Games) decided to pull the plug and focus on \"casual-AI-developed games\" (some stupid reason like that). If you are curious there's still some time to enjoy the game, it's very easy to level up, however I still suggest not buying it.\nAlso\nAll my homies HATE Amazon and AI SLOP.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Servers closing for good. what a waste. will never buy an amazon game again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Peak example why that fucking \"Stop killing games\" need to win. Even if the game remained a dogshit chest running simulator.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "they are cutting off support for the game lmao",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was a good game starting to make a comeback with the new update, but amazon decided to kill it once it started being somewhat popular again",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, if Amazon doesnt pull a Wayfinder and make this sing player, or release source code and let the community drive servers, they can kiss game development goodbye",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So stupid they'd just scuttle the game.  At least try to sell it off to another company like others have. Was fun while it lasted. F*** you Amazon.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I started playing this game just recently, and from what I understand it’s improved massively since it was first released, and has a one time purchase instead of a required subscription model, making it one of the lowest commitment MMOs on the market. Its genuinely fun, which is why it pains me that Amazon is stopping its support over the next year. Don’t buy this game or you’ll be disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I recommend not buying any Amazon games, because lack of support. I'm so disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just started playing spent $50 and now its shutting down wtf i want a refund now",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Disgraceful, here I go paying full price for a game that isn't finished and right when it's starting to head into the right direction they can it. I ain't never heard of an mmo being canned after 5 years. The gall of being one of the richest companies in the world and to shut down your video game after 5 years. Especially after having such an abysmal launch. I shouldn't be surprised, it's Bozos after all, but canning a game after 5 years is still unheard of from a company of the size of Amazon. \n\nDo not buy Amazon products. They support fascism and will not hesitate to fleece you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "started playing this game again only to find out amazon is shutting it down. Thats stupid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game will no longer be supported next year. Kind of a surprise considering the last patch was pretty well received ¯\\_(ツ)_/¯",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You can not even make this shit up:\n\n1. You release a new \"update\" which let new players buy the full game.\n2. You let people buy a battle/season-pass, while you know you know you will shutdown the game (maybe even before the season-pass is expired)\n3. You are just Amazon, and that is the reason why you have the worst reputation in the Gamer-Ecosystem!\n\nI mean EA and Ubisoft suck, BUT YOU, dear Amazon, you are the NEXT LEVEL DISGUSTING!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "developers put a lot of effort and passion in this last expansion including great qol improvements, unfortunately amazon ruined it for everyone.. middle finger to amazon for treating its customers and employees with a lot of dedication like this. Never buying from them a game again",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was planning on trying this out with the latest update, read that they will not be maintaining this any longer so then I'll go play something else.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ehhh, and this is why I will never buy any \"games as a service\" products again, or any future Amazon games if they change their mind in the future. We gamers need to start respecting ourselves, our time, and our money. Because of the hype and people buying things blindly, companies like Amazon treat us the way they do. Shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought the game, 4 days later Amazon Announce its closing, Steam refuse to refund. \n\nGood game, thanks for the 4 days of joy\n\nF Amazon and Steam support",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got into NW once Aeternum came out i tried it initially when it was first released and it was bad then..but after Aeternum it was pretty good...Unfortuntely they did so poorly throughout NW's entire lifespan that the latest update couldn't save it and they are shutting it down.\n\nTBH for a MMO it needs to have a strong first release which this game didn't have which made them loose too many ppl and made people weary of coming to try it due to bad reviews...bad support etc....even if you came out strong with a good release like this aeternum it's only to pull some people back which this did they were avg like 20-30k people pre aeternum and round 50-60k ppl after...but these numbers weren't enough for them to keep things going they lost too much the past few years that they probably need 2-3x that amount to justify staying up..\n\nwell anyways i'm probably not going to purchase any game amazon game going forward same with GGG they both have issues with providing what the people want and listening to their player base...just bad management from the top down def not a studio worthy of our money especially after pretty much a rug pull after selling the latest DLC and saying they are shutting down about a month or so after thats kinda scummy they took the money and tryin to leave while having something in their pocket.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Considered buying after trying free weekend ages ago until seeing it'll shutdown next year. Atrocious price, extremely greedy, for a game that won't be playable that long. Just make it free at this point?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was a great game for half of the first year, after server merges and pay for expansion the game began to die. Now there are no longer updates along with a declining player base.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game idea, ran by a horrible company and horrible devs. DO NOT BUY from scamazon games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Greatest MMO ever made. Surpasses even classic WOW. Unfortunately Amazon would rather kill it off instead of selling the IP.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "New World is shutting down. While to most it seemed inevitable, I'm very surprised it happened during its resurgence. Why you release a good update and Rise of Angry Earth free for everyone then decide to pull the plug is beyond me. What I think they should do is have the game go the way of Wayfinder. The move to an RPG with more focus on solo and co-op content was already made and there's plenty you can still do with the game to make it a fun game to play offline or just with a couple friends. You could do something kind of akin to Final Fantasy 11 and have mercenaries you can hire for overworld content or expeditions which you could either gear up yourself or come with preset kits and act as certain roles (like tank, healer, dps). PvP content can also be reworked into bounties on named corrupted or whatever other factions, and the sieges can be turned into an event that happens every few hours or so where you either can defend your own stronghold from corrupted/lost/ancient enemies or go after theirs.\n\nI digress, I know Amazon isn't going to do anything of the sort but I thought maybe just spitballing some ideas could potentially maybe give the devs some ideas as to what can be done with the game in the remaining year of the game's lifespan. But what do I know, I'm just a consumer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How can i recommend this game, after troll move from amazon?)\n4 years of creating community in the trash\nHope, all yours futures projects dosnt release at all\nCringe",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Devs put out a good update and finally some endgame and what does Amazon do? Kill the game.... Never buying a game from Amazon Games again...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is good but only if they made game under $10 or free now, since they are only keeping servers up through 2026 so 2027 might shutdown if no one buys it from them. still has alot of playing during next year without any updates",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, developers and game designers did amazing, until Amazon decided to dump all that hard work.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Amazon has more than enough money to keep the servers running for those who choose to play. Keep in mind New World is $59.99 and Aeternum is $79.99. Greedily shutting down servers and not offering us any long term play. \n\nWhy not spend some minimal resources and turn this into a dedicated server/single player game?\n\nWhatever, here's your negative review.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "New World is what happens when you hire a bunch of smart people to make an amazing game engine and then fire them and let a bunch of fat stupid retards take over and use that engine to make a giant turd that finally gets flushed down the toilet because everyone working on it is so fat and stupid and smells bad and has a big butt and likes to kiss their own butt.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Amazon shutting down game in 2026, and where is the money?\nWhere is the Single player mode?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game was an amazing breath of fresh air when it first launched. Its hard to build a community like it did in current mmos, However it quickly just fell downhill fast with lack of content at the start and once the hype around it died so too did the community",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't have any problem with the game itself and have enjoyed playing over the years.  I can't recommend it because the plug is being pulled next year.  There's no use spending money on a game that has a definite hard stop at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loved this MMO back in the hay-day and i've had alot of fun memories but i cant recommend it because Amazon would rather kill it for AI slop garbage games than sell this great IP to another studio and maybe fix some of the underlying problems the game has.\n\nThis is the only mmo ive played that has that dark souls esc combat merged with open world exploration nothing comes close. The raids/dungeons were super enjoyable it was kinda difficult to find players via the server chat to squad up with, but once i did i had many hours of fun tackling these dungeons sadly its all dead now because the game is shutting down leaving these moments to be nothing more than distant memories in my head.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In all honesty, it's a good game. I just wish I knew they were shutting down before I spent money on it. It's hard to get started and keep momentum going after learning this game is shutting down. I wish steam would make an exception to refund this game after 44 hours",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Underneath all of it there is a good game. But Amazon decided to shot down an MMO, just 4 years after releasing. This is unacceptable. From the very start Amazon has shown that they do not understand what an MMO is, right after release they were already talking about \"the next thing\", instead of talking about support and expansions for New World. \n\nIt is a real shame, as New World was to me at least, the best new MMO I have played in a long time. \n\nSo, don't buy this game, since Amazon already killed it but still makes it possible for you to buy their dead game.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}