{
  "positive": [
    {
      "review": "This game is so addictive. Plus, there are so many mods to try on Steam Workshop. I even had to forget about my college assignments just for this game. Hahaha jk xD",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "TOO ADDICTIVE! As a small gamer myself, this is the first game with a 100+ hours record on steam. Nothing to explain about, caz its all about experiencing it. Relaxing!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I have lost my soul to the never ending routing of people and cargo, rail is king and I am but a humble servant to the every greater proliferation of rail based transit infrastructure. \r\n\r\nPretty great game, excited for the third one to come out! 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played this game for just 8 hours but it is sooooo adictive I got the game on like a -75% sale ,and even if you get sick of the normal play style just download some mods. W for the game 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Top-tier railway simulator🚉\nIt can't be just me who feels that way.\nI sincerely hope TF3 is well-made.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game for idea for routing and managing the transportation company",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is as complex as you want it to be, but very much a fun time. Almost like Cities Skylines but just transportation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want a virtual model train set, this is a great game for you. If you liked OpenTTD, this is the spiritual successor. If you liked the supply lines in Factorio, this game is also for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Uh... yeah idk it's alright.\r\n\r\n1300 hours in and I'm still drawn back in every single day. Let me preface this by saying I have not touched the campaign, I am exclusively playing with sandbox and infinite money enabled. It's fun. If you have any interest in model railroads or transit design, this game is for you. It's a very vibey games at times, like the way I usually play is just having it on in the background while doing something else, and if I think of something I want to try I'll click on and try it out. It's incredibly good for getting my ideas for a model railroad or idealized transit system out \"on paper\" so to speak.\r\n\r\nThere are several (SEVERAL) things I would change about the game if I was designing it, but it's fairly simple to get around these problems with the incredibly simple mod loader. The mods have probably added like 1000 hours to this game for me. There are thousands to choose from, and some are pretty in depth and useful.\r\n\r\nExcited for the third game, if you like trains this one is probably for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very in depth but very easy to get the hang of if you like tycoon games and management games this will be your cup of tea",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the best tansport management games there is right now for playing on Deck since it was optimized for playing on consoles meanwhile. Playing with a controller needs a bit of getting used to if you've played these kind of games on PC before, but it's a small hurdle for being able to play one of the few more complex management sims available with dedicated controller and thus Deck support (i really wished Skylines devs would care as much). The Linux version even runs more smoothly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lotta fun. Easy to learn hard to master. Very excited for TF2, honestly might just be worth it to wait for that to come out than buy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As allot of you can see, I have gotten some hours on this game. Not that I am good at it, mind you, but it does show how much I absolutely love this game.\n\nThe first game I bought when I was a kiddo was Transport Tycoon Deluxe. And after some install problem, as I know crap all about games and operating systems, I played that game so incredibly much, and to this day I feel that allot of Transport Management games fall short of this gem.\n\nBut Transport Fever 2 is one of the best, and easily picks the number two spot. What I mostly played is teh campaign, as I am a sucker for stories and challenges in these types of games. And it had a really good approach! The route the game took was that of history, guiding you through significant and sometimes insignificant moments in history in which YOU have to manage the transportation of goods and people. I really got into it, and finished chapter one before I knew it.\n\nSee, the game divides itself into three \"chapters\"  and every chapter has about five to six mission, each in a different part of the world, but filtered by year.  A unique concept it is not, but it is fun and as a history idiot, I loved every second of this. The farthest I came was Chapter two, the mission in communist China. But, idiot that I am, I forgot to turn on Steam Cloud and now, after doing a fresh intall on my PC, I need to start back at the beginning, for the thrid time.\n\nBut dont get me wrong, I have absolutely no problem in doing that. Its a good game, and I find it relaxing to hover just above my train with the camera and just take it all in and enjoy the ride. Though it does take some time to get used to making lines that use more than 2 different transportation methods (first boat, then truck for example), I just cannot help but get that same feeling as I did when I was a kid and played Transport Tycoon Deluxe. Is it the same? No. But its damn good. So if ya love transport management games, grab this one, especially when its on discount. And remember, they developers are working on Transport Fever 3, and I cannot wait!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been very fun. I am a large fan of locomotives, and this game has plenty of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Transport Fever 2 – Steam Deck Gameplay – 2025 Review\n\nIf you’ve ever dreamed of running your own transport empire, building cities, and watching tiny digital people live their lives while you create a borderline tyrannical bus schedule, then Transport Fever 2 might be your next obsession.\n\nBut like any great journey, it has smooth tracks… and some bumps that will make you mutter, “why would you do this to me, game?”\n\n🚂 PROS\n🎨 Stunning Graphics\n\nTransport Fever 2 is so pretty you might forget you're playing a logistics game and not browsing high-end travel brochures. Vehicles shine, landscapes pop, and the Steam Deck screen handles it all gracefully.\n\n🏙️ Realistic, Detailed Design\n\nBuildings, vehicles, and environments look like miniature handcrafted models placed inside a living museum.\nZooming in feels like inspecting a high-end diorama.\n\n🚛 Excellent Transport Models\n\nTrains? Gorgeous.\nPlanes? Gorgeous.\nShips? Gorgeous.\nEven the trucks look like they were lovingly designed by someone who secretly wanted to work at a luxury car studio.\n\n🌆 Lively, Growing Cities\n\nYour cities evolve realistically—population growth, density, industry shifts. It’s satisfying watching your infrastructure fuel their development.\n\n🎮 Engaging Campaign Mode\n\nFun, humorous, and surprisingly gripping.\nYou start “just one scenario,” then suddenly your coffee is cold and it’s three hours later.\n\n👁️ Fantastic View Modes (Ride-Along & Follow Cameras)\n\nOne of the best parts of the game:\nRide a train across the entire map\nFollow a bus through dense traffic\nTrail a random citizen as they commute\n\nThese cinematic, travel-documentary-style views make the world feel alive and are weirdly relaxing.\nIt’s easy to lose time just… sightseeing.\nIn a transport simulator.\nAnd it’s glorious.\n\n🧰 CONS\n\n🍼 Tutorial Ends Too Early\nGreat start, then suddenly it’s like the tutorial says,\n“Okay, you’re a transport magnate now. Bye!”\nYou’re left holding 28 unprofitable routes and a dream.\n\n📘 Steep Learning Curve for New Players\nOnce the tutorial leaves you on your own, the game unloads industry chains, maintenance needs, line balancing, and financial management all at once.\nIt’s like being handed the keys to a Boeing 747 because you once rode a bicycle.\n\n🎯 FINAL VERDICT\n\nHighly Recommended — especially on Steam Deck.\nTransport Fever 2 delivers impressive performance, beautiful visuals, deep gameplay, and endless replayability. Whether you're a veteran tycoon or willing to learn through a few early bankruptcies, this is a rewarding simulation experience.\n\nAnd with Transport Fever 3 arriving in 2026, the hype is absolutely real.\nIf TF2 is the foundation, TF3 is shaping up to be something truly special.\n\nUntil then, TF2 is absolutely worth your time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is awesome but a few months ago it just started rubber banding constantly out of no where which made it unplayable :/ i have tried several things and several times to fix it, cuz id like to play it some more, but the rubber banding is too excruciating and constant.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’ve only played a few hours of Transport Fever 2, but I’m really liking it so far. The game does a great job of letting you build up a transport empire at your own pace, and there’s something really satisfying about watching your buses, trains, ships, and planes all moving in sync.\r\n\r\nThe visuals are surprisingly good — seeing your cities grow and your routes come to life feels great. The tutorials do a decent job of easing you in, though there’s still a lot to learn if you’re new to this kind of simulation game. It can be a bit overwhelming at first, but once things start to click, it’s really rewarding.\r\n\r\nPerformance has been smooth for me, and I like how much freedom the game gives you to design routes and manage your network. Even in just a short amount of time, I can see how deep and addictive it could become.\r\n\r\nOverall, Transport Fever 2 is shaping up to be a great transport sim. If you like building, optimizing routes, and watching your world grow, it’s definitely worth checking out.\r\nRating: 👍 (so far!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game, highly addictive, and can be extrodinarily challanging if you miss manage something. However as of late, I've noticed the game have tendency to crash but it often happens after a few hours of playtime. Thankfully the game auto saves when it crashes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is actually exactly the kind of game I have been looking for for years!\r\nA bit of a mix between Railroad Tycoon 3 and Cities Skylines, but with better graphics, minus some features, plus other features. The music gets a bit tiresome after some time but just put your own on then.\r\nThe missions are entertaining, and once you discover free to play, especially sandbox mode, you're addicted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great management game. super chill but also surprisingly deep once you get into it. had a blast building up my routes and watching everything run smoothly. best of luck on the sequel - really looking forward to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vastly improves upon what was already great about the first game, addressing the few shortcomings it did have.\r\n\r\nI love the addition of wildlife, really adds to the life to the game!\r\n\r\nIt's simply the more of the same but better. There's really not much else I can say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brill game for anyway. You must download stuff from the Workshop though for it to be fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a decent game with lots of mods and the workshop allows so many different things. However it could get a bit boring if you are doing the same thing over and over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best empire creator with also cities skylines II. It Is Better with mods but details. I really recommend to play this game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll admit, at first it took me some time to appreciate this game. It felt kinda frustrating in the beginning, but it was largely because I didn't understand some of the mechanics and how to certain situations. But if you take the time to watch a YouTube video or two, and play the campaign to digest it a little better, you'll really appreciate the game and the developers for letting you be free to make your own choices. Get it if you're on the fence at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just fantastically brilliant. This is one of the few games I've become completely addicted to and think about a lot even when I'm not playing it, over the past few years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the perfect resource management game.  Fantastic graphics and ultimate game play.  Whether you are a train geek or someone who enjoys the challenge of managing resources and manufacturing items to supply to towns.  It is great to see the villages turn into towns and cities if you get it all rights.\r\n\r\nI am definitely looking forward to TF3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very clever. addicting, \"one more turn\" (tho game is turnless) feeling. like an old CIV game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great but it's economy and core gameplay are way too simple. I'd love for different gauges and catenary voltages, more vehicles and a more realistic physics simulation. Looking forward to the third game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A día de hoy el mejor en cuanto a transporte. Muchas de las funcionalidades del viejo Transport Tycoon II pero con unos gráficos muy actualizados con perspectiva libre (no isométrica) y unas opciones de construcción de vías de transporte muy buenas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game if you know how the basics work, very addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for those who are into trucks, trains and buses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The programme is constantly crashing. In the past week or so it keeps crashing. Not good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you don't have the space and resources to have an actual hobby railroad in your home this is the closest thing you're going to get to having the real thing, with the added bonus of no tear down and rebuild. If you're interested in logistics and transportation, this will scratch that itch without having to be an urban planner like In City Skylines or other games of that type.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm like 400 hours in. Free mode, with the bigger maps. Vast improvement on TF1 which was already awesome. Hours of building and optimising lines at scale, infinite possibilities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, you download mods and get hooked on it 10/10 would get hooked again (i did)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got the game yesterday during an insanely cheap sale, and I’ve got to say, it’s really fun. Depending on when you start, progress can be a little slow, but even if you get bored, there are tons of mods to try from the Steam Workshop or you could try out sandbox mode if you perfer building over economy. Highly recommend.\nBonus:\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n(Pretty nice graphics on higher settings)\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n(Really fun when you get the hand of it)\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n(Id say its pretty nice)\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n(Might be a bit hard for younger players)\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n(Bigger city = Better computer. Will be pretty slow for low end devices)\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n(Not really that big, i downloaded only 14gb)\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n(A bit hard to start but easy to get the hang of)\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n(The only real grind it just building)\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n(The campaign mode has a pretty nice story aspect to it but is only optional)\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n(Prepare to spend the rest of your life playing)\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n(Id say its worth the price but recommend buying on sale)\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n(A few tiny bugs here and there)\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Addicting. Little hard to figure out at first highly recommend running the campaign before entering free mode",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoy discovering this game. It has been a great way for me to spend some time and have some fun without needing to think too much or focus on missions. The community is also excellent and there is plenty of content available online. I am looking forward to the new game coming out next year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game can be played for hours on end as you progress through time and grow your company's influence. The vast range of mods ensures you have variety and difficulty added to the experience. Some mods may corrupt your game though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, hours just melt away. An all time classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was very good\r\ni bought in offer 500 rupee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "please help i have spent too long in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with trains, that's all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game Can't Wait For Transport Fever 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Just one more...\" and it's already 2AM.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I want the third one to come out, but this one is good as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helps me construct and relax",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cities skylines but you deal with more traffic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't wait to play the number 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah, it's pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is o much FUNNNNNNNNN!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really hard but fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Transport Chess. I never get tired of this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It seems to be a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best investment that i never made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing. True work!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kinda fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent with mods",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "happy holoween evary body",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its just good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like trains.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "penjamin + train pov",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TRAIN GO BRR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love playing very relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like trains",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Test",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ik ben een trein",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "YES :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love trains !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jooo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like trains",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NICE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trainssssssss",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[hr][/hr] \r\n[hr][/hr] \r\n[hr][/hr] \r\n[hr][/hr] \r\n[hr][/hr] \r\nGood!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "traintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintraintrain",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": ")",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished all campaign missions. Game is nice, its like scale railway model.\r\nFor a railroad fan is a good game, I don't know if it's also good for a plane, cars or ships fan. I play trains most.\r\nadvantages:\r\n+ 121 hours of fun,\r\n+ nice maps, landscapes,\r\n+ works good on my Ryzen 5 3600 + Rtx 4060 8GB\r\n\r\nthere are small disadvantages:\r\n- train when change direction on train station do it \"magically\" without uncoupling locomotive, game should show here advantage of multiple units where you have cabins on both ends and you don't need uncoupling,\r\n- there are some funny inaccuracies. For example: when you are on mission in Japan diesel locomotives are Russian made. Probably fixable with some mods. You see cars similar to Lada 2107 in western cities etc. Maybe Lada entusiasts in Miami order this lovely cars because they bored with fullsize sedans and SUV's.\r\n- a few small scale missions with greater emphasis on economics whould be nice.\r\n\r\nApart from that minor flaws game is great and I'm waiting for the Transport Fever 3.",
      "voted_up": true,
      "votes_helpful": 71
    },
    {
      "review": "The visuals are decent, with detailed environments and vehicle models. However, they may not stand out compared to other modern simulation games, and some players might find the graphics somewhat dated.\n\nThe game play involves designing transportation routes, managing logistics, and balancing the economy. It provides a fair amount of depth, but the interface can be complex and sometimes unintuitive, especially for new players. The game offers both campaign and sandbox modes, but the learning curve can be steep.\n\nPerformance is generally stable, though large networks can cause lag on less powerful PCs. The user interface is functional but can feel cluttered, requiring some time to get used to.\n\nSound design is typical for the genre, with engine noises and ambient sounds, but it doesn't particularly stand out. The music is unobtrusive but may become repetitive.\nend its lifespan and add variety, but official content updates have been somewhat limited.\n\nTransport Fever 2 offers a solid transportation management experience, but it may not appeal to everyone. Its complexity can be off-putting for casual players, and the visuals, while serviceable, aren’t groundbreaking. It’s worth considering if you enjoy detailed logistics games and are willing to invest time into learning its systems.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "A fairly straightforward yet attractive logistics game, where you carry freight and/or people to intended destinations using different modes of transportation in order to grow cities and generate profit. It is most compelling when trying to create the most efficient transportation lines and hubs when factoring in industry chains, city needs, and geography. Once you start generating large profits, it is not hard to 'beat' any map by linking all cities and industries, but fortunately replayability is good with different biomes and a random map generator. The graphics and soundtrack/sound effects are good.",
      "voted_up": true,
      "votes_helpful": 12
    }
  ],
  "negative": [
    {
      "review": "It is with heavy hand that I decided to choose not recommend. I actually really enjoy the game, however, the couple of things that do not work, simply surpass any joy I had.\r\n\r\nThe good:\r\nThe tasks and scenarios are very well thought out (loved tongue-in-cheek German-speaking tourist tasks in Mallorca, H. Hughes and the movie of Genghis Khan and radioactive sand etc...). \r\n\r\nThe bitter:\r\nHowever, so many things you are just supposed to guess. The game explains only absolute basics in very beginning, which for most part, it is sufficient. But then the routes do not function or there is goal to reach in campaign and there is 9 times out of 10 simply no hint/warning/information why and how. Except when there is obvious issues like 2 trains on same tracks. \r\nI have once again gotten stuck, and this time I think I will just not return.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hard and unforgiving to learn. I have no idea what I'm doing wrong most of the time and constantly have to google things or ask for help online.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fairly polished and good-looking game, but unfortunately the economy model is so simple you can just exploit it by setting up fake demand for two goods, then arbitrarily shipping infinite amounts back and forth between two distant spots.\r\n\r\nGame is probably good if you're looking to just sandbox build a bunch of complicated cargo hubs and watch it go, but if you're looking for an actual economic challenge, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rail laying is extremely finicky. Crisscrossing rails doesn't work properly. The game doesn't select the best terrain modifications when laying rail or roads. Routes that should work don't but you can fix it by demolishing and rebuilding exactly as you had it which wastes time and resources. Production and delivery doesn't work in the way you expect or even like other transportation games. Diagnostic tools to figure out routing problems barely exist and often give an incorrect answer. Neither free play nor the campaign offer a tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically unplayable. The tutorial tells you to do things but not how. You will get stuck not able to deliver things because you have something in the wrong place but there is not possible way to know how to do it. The UI is overly complex also. I've never seen a building game with such a massive learning curve.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While game itself is a nice clone of old good Transport Tycoon with some improvements (mostly graphic), it has a serious drawback - campaign. Missions in campaign often has very vague description, barely indicating what players should do in what way. During Siberian mission only I've encoutered problem with mission with advertisement (there was no clue that it should be done in specific way) and with conspiracy mission (as nowhere was indicate how to recognise houses in question). And this fact, that many times during campaign player has to look through help and walkthroughs to simply find a solution (often far from any logic) is a bit annoying. Otherwise game is not that bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trains are stupid, stops only at platforms where is cargo. No idea how signals works, After experience with TT/D and Mashinky, this looks like disaster :-(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Guess what I downloaded? A puzzle game!\r\nSpent my 4 Hours in game trying to figure out why supply of whiskey isn't reaching the pub.\r\nSpoiler: Never figured it out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many different tries to make this work.  So I earned enough money to build a complete line.   Crude to refine.  Refine to fuel.  Fuel to town.  All at the same time so the load manager would not freak out.   The load manager freaked out anyway.  Will post a screenshot.  At first it gave me the refined.  Then my trucks started backing up.   AGAIN.  Trains / trucks - it make no difference.   A game that decides on its own  NO - is a NO BUY review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow. 5 minutes was all i could take. Literally no instructions. Rotate the Depot....great how TF do I rotate things exactly?? Screw this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Confusing UI, bad tutorial. Dissapointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The in-game tutorial in the campaigns is appalling bad.  I don't know who is responsible for this, but it's like the creator built it with all the in-house knowledge, but didn't look at it from the beginner's perspective at all. Terrible in that there's instructions, but not how to execute the instructions.  Suggested buildings are not in the menu of choices named the same.  When you get stuck there's no suggestions or demonstrations.  I've spend good money on this game but can't seem to get ahead.  When I look at Youtube videos for help, they seem similarly perplexed.  Why is this so poorly supported from a training view.",
      "voted_up": false,
      "votes_helpful": 122
    },
    {
      "review": "The missions are fine but I want to play more sandbox mode. The game is just a clicker, it's so easy to earn money. There is no challenge. In sandbox there are industries everywhere, even if you select as few as possible. There is no logic in how they are placed. They are just spread all over the map. \n\nYou earn so much money. It’s a great idea to start with a loan, but after you build one train line (even on hard difficulty) you can quickly pay it off. There is no challenge at all. I started with everything set to as difficult as possible. This is a bit sad since it could be a really nice game. \n\nQuite hard to get an overview of what each line earns. I think it’s per year, but a train can take over a year (!) to travel, so what’s shown can vary a lot.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Tutorial has a lot of bugs and badly explained objectives.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It is so painfull to play this game. I don't know if i am just unlucky but it has been a bug fest so far.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is fun but only buy it if it is under $5. It has a LOT of rough edges that will likely never be fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm not sure, I like the graphics and gameplay. What annoys me is the trains can't automatically find paths like in OpenTTD, That should be changed for the third one. Other than that I don't mind it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Tortuous and patronising campaign - I gave up doing the cheesy extra missions in chapter 1 and have stopped altogether after the first main mission of chapter 2. Buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane... what, why? And then there's the core of the game - routing of goods - which is frustrating to set up and easy to break, the lack of any competition given what you're doing, the music - which thankfully you can switch off - and because I've been sitting around waiting, the jarring, immersion breaking things. English street names and announcements across the planet. Announcements for passengers to Birmingham or Canada being made at airports when you've literally just started to build the first plane in existence for travel. One or two of these would be tolerable, but put together they're painful. The third instalment looks pretty, but unless the mechanics change, it won't be on my list.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is possibly a great game but I wasn't able to pass the horrendous tutorial.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Campaign is an important aspect of a game. Well, this game's campaign was clearly designed by a sadistic noob who's only goal was to inflict as much pain as possible on all the idiots buying this product based on the very positive reviews thinking they might find an inch of enjoyment in completing the campaign. But no, there is no enjoyment. There is no challenge, there is only pain. Stupid, silly missions, no teaching on the complex dynamics of the game, just idiotic tasks that require you to destroy all you've done over and over again and to wait unnecessarily long time to complete painstakingly idiotic tasks that go against any logic. I don't care, at this point, how good the free play is, because after spending 80 hours completing the campaign I'm literally exhausted. And I completed it because I kept hoping that it would get better. But no, it doesn't. The last mission (Shanghai) was the apex of idiocy and whoever designed it should be banned from ever working in the gaming industry for 10 generations.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Has one of the most unintuitive train line networking system to ever exist. It will make you scratch your head, and it will make you ask even god himself what and why does it not or do work (He does not even dare answer for not even he knows). \n\nThis must be how it feels to be a programmer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was honestly excited to try this game out, but ended up disappointed in the 2.4 hrs that I played this game. The game's overall mechanics feel complex in regards to being a first-time player. I played the tutorial missions and as others stated, the game does not tell you where to go. You click on an objective and it doesn't tell you the exact specifics. Overall, the game is not for me. I got the game on sale and got the deluxe and the game left a bad taste. Will not be playing this game and not even the 3rd one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I kept on playing the game expecting it to get harder or complicated. Unfortunately the game lack depth. Even though you are granted with some options it still fails to feel nuanced.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For some reason I find it very difficult to play buildings in the tutorial, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sad to leave a negative review to a great game (I've played the first one and expect the third one as well). \n\nThe only issue is that at a very frequently used tab, the've implement a white screen that literally destroys your eyes. Have you ever played CSGO? Prepare to be flashbanged every time you open the core tab of the game. \n\nThe issue has been reported to the devs but they did nothing throughout the years. \n\nReally disappointed. I will give the benefit of the doubt to the new release but I will enter sceptical at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is with heavy hand that I decided to choose not recommend. I actually really enjoy the game, however, the couple of things that do not work, simply surpass any joy I had.\r\n\r\nThe good:\r\nThe tasks and scenarios are very well thought out (loved tongue-in-cheek German-speaking tourist tasks in Mallorca, H. Hughes and the movie of Genghis Khan and radioactive sand etc...). \r\n\r\nThe bitter:\r\nHowever, so many things you are just supposed to guess. The game explains only absolute basics in very beginning, which for most part, it is sufficient. But then the routes do not function or there is goal to reach in campaign and there is 9 times out of 10 simply no hint/warning/information why and how. Except when there is obvious issues like 2 trains on same tracks. \r\nI have once again gotten stuck, and this time I think I will just not return.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hard and unforgiving to learn. I have no idea what I'm doing wrong most of the time and constantly have to google things or ask for help online.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not recommended, great concept ruined by bugs\r\n\r\nI really wanted to like Transport Fever 2. The idea is right up my alley, build networks, optimise logistics, watch cities grow, and on the surface it looks great. But the amount of bugs and confusion in the campaign has completely killed it for me.\r\n\r\nPlaying through the campaign, the missions are often convoluted and very unclear. Objectives are worded in a way where you’re never quite sure what exactly the game wants you to do or how it expects you to do it. I spent more time fighting the UI and trying to guess the logic behind the tasks than actually enjoying the transport building.\r\n\r\nThe worst part is the resource system. A lot of the resource gathering and allocation seems automated, but it regularly assigns lines to resources that simply aren’t available. When I tried to fix it by setting the platforms/terminals manually, it still didn’t work properly, trucks would happily drive back and forth with empty loads even though there were goods waiting, or they’d ignore the platform assignment and behave as if nothing had changed.\r\n\r\nAfter enough missions like this, it stopped being fun and just became frustrating. When the core loop is “debug the game” instead of “build a transport empire,” it’s time to put it down. Until the campaign logic and resource handling are cleaned up, I can’t recommend this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fairly polished and good-looking game, but unfortunately the economy model is so simple you can just exploit it by setting up fake demand for two goods, then arbitrarily shipping infinite amounts back and forth between two distant spots.\r\n\r\nGame is probably good if you're looking to just sandbox build a bunch of complicated cargo hubs and watch it go, but if you're looking for an actual economic challenge, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rail laying is extremely finicky. Crisscrossing rails doesn't work properly. The game doesn't select the best terrain modifications when laying rail or roads. Routes that should work don't but you can fix it by demolishing and rebuilding exactly as you had it which wastes time and resources. Production and delivery doesn't work in the way you expect or even like other transportation games. Diagnostic tools to figure out routing problems barely exist and often give an incorrect answer. Neither free play nor the campaign offer a tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While game itself is a nice clone of old good Transport Tycoon with some improvements (mostly graphic), it has a serious drawback - campaign. Missions in campaign often has very vague description, barely indicating what players should do in what way. During Siberian mission only I've encoutered problem with mission with advertisement (there was no clue that it should be done in specific way) and with conspiracy mission (as nowhere was indicate how to recognise houses in question). And this fact, that many times during campaign player has to look through help and walkthroughs to simply find a solution (often far from any logic) is a bit annoying. Otherwise game is not that bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trains are stupid, stops only at platforms where is cargo. No idea how signals works, After experience with TT/D and Mashinky, this looks like disaster :-(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Guess what I downloaded? A puzzle game!\r\nSpent my 4 Hours in game trying to figure out why supply of whiskey isn't reaching the pub.\r\nSpoiler: Never figured it out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically unplayable. The tutorial tells you to do things but not how. You will get stuck not able to deliver things because you have something in the wrong place but there is not possible way to know how to do it. The UI is overly complex also. I've never seen a building game with such a massive learning curve.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many different tries to make this work.  So I earned enough money to build a complete line.   Crude to refine.  Refine to fuel.  Fuel to town.  All at the same time so the load manager would not freak out.   The load manager freaked out anyway.  Will post a screenshot.  At first it gave me the refined.  Then my trucks started backing up.   AGAIN.  Trains / trucks - it make no difference.   A game that decides on its own  NO - is a NO BUY review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow. 5 minutes was all i could take. Literally no instructions. Rotate the Depot....great how TF do I rotate things exactly?? Screw this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Confusing UI, bad tutorial. Dissapointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The in-game tutorial in the campaigns is appalling bad.  I don't know who is responsible for this, but it's like the creator built it with all the in-house knowledge, but didn't look at it from the beginner's perspective at all. Terrible in that there's instructions, but not how to execute the instructions.  Suggested buildings are not in the menu of choices named the same.  When you get stuck there's no suggestions or demonstrations.  I've spend good money on this game but can't seem to get ahead.  When I look at Youtube videos for help, they seem similarly perplexed.  Why is this so poorly supported from a training view.",
      "voted_up": false,
      "votes_helpful": 122
    },
    {
      "review": "The missions are fine but I want to play more sandbox mode. The game is just a clicker, it's so easy to earn money. There is no challenge. In sandbox there are industries everywhere, even if you select as few as possible. There is no logic in how they are placed. They are just spread all over the map. \n\nYou earn so much money. It’s a great idea to start with a loan, but after you build one train line (even on hard difficulty) you can quickly pay it off. There is no challenge at all. I started with everything set to as difficult as possible. This is a bit sad since it could be a really nice game. \n\nQuite hard to get an overview of what each line earns. I think it’s per year, but a train can take over a year (!) to travel, so what’s shown can vary a lot.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Tutorial has a lot of bugs and badly explained objectives.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It is so painfull to play this game. I don't know if i am just unlucky but it has been a bug fest so far.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is fun but only buy it if it is under $5. It has a LOT of rough edges that will likely never be fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm not sure, I like the graphics and gameplay. What annoys me is the trains can't automatically find paths like in OpenTTD, That should be changed for the third one. Other than that I don't mind it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Tortuous and patronising campaign - I gave up doing the cheesy extra missions in chapter 1 and have stopped altogether after the first main mission of chapter 2. Buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane... what, why? And then there's the core of the game - routing of goods - which is frustrating to set up and easy to break, the lack of any competition given what you're doing, the music - which thankfully you can switch off - and because I've been sitting around waiting, the jarring, immersion breaking things. English street names and announcements across the planet. Announcements for passengers to Birmingham or Canada being made at airports when you've literally just started to build the first plane in existence for travel. One or two of these would be tolerable, but put together they're painful. The third instalment looks pretty, but unless the mechanics change, it won't be on my list.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is possibly a great game but I wasn't able to pass the horrendous tutorial.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Campaign is an important aspect of a game. Well, this game's campaign was clearly designed by a sadistic noob who's only goal was to inflict as much pain as possible on all the idiots buying this product based on the very positive reviews thinking they might find an inch of enjoyment in completing the campaign. But no, there is no enjoyment. There is no challenge, there is only pain. Stupid, silly missions, no teaching on the complex dynamics of the game, just idiotic tasks that require you to destroy all you've done over and over again and to wait unnecessarily long time to complete painstakingly idiotic tasks that go against any logic. I don't care, at this point, how good the free play is, because after spending 80 hours completing the campaign I'm literally exhausted. And I completed it because I kept hoping that it would get better. But no, it doesn't. The last mission (Shanghai) was the apex of idiocy and whoever designed it should be banned from ever working in the gaming industry for 10 generations.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Has one of the most unintuitive train line networking system to ever exist. It will make you scratch your head, and it will make you ask even god himself what and why does it not or do work (He does not even dare answer for not even he knows). \n\nThis must be how it feels to be a programmer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was honestly excited to try this game out, but ended up disappointed in the 2.4 hrs that I played this game. The game's overall mechanics feel complex in regards to being a first-time player. I played the tutorial missions and as others stated, the game does not tell you where to go. You click on an objective and it doesn't tell you the exact specifics. Overall, the game is not for me. I got the game on sale and got the deluxe and the game left a bad taste. Will not be playing this game and not even the 3rd one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I kept on playing the game expecting it to get harder or complicated. Unfortunately the game lack depth. Even though you are granted with some options it still fails to feel nuanced.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For some reason I find it very difficult to play buildings in the tutorial, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sad to leave a negative review to a great game (I've played the first one and expect the third one as well). \n\nThe only issue is that at a very frequently used tab, the've implement a white screen that literally destroys your eyes. Have you ever played CSGO? Prepare to be flashbanged every time you open the core tab of the game. \n\nThe issue has been reported to the devs but they did nothing throughout the years. \n\nReally disappointed. I will give the benefit of the doubt to the new release but I will enter sceptical at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is with heavy hand that I decided to choose not recommend. I actually really enjoy the game, however, the couple of things that do not work, simply surpass any joy I had.\r\n\r\nThe good:\r\nThe tasks and scenarios are very well thought out (loved tongue-in-cheek German-speaking tourist tasks in Mallorca, H. Hughes and the movie of Genghis Khan and radioactive sand etc...). \r\n\r\nThe bitter:\r\nHowever, so many things you are just supposed to guess. The game explains only absolute basics in very beginning, which for most part, it is sufficient. But then the routes do not function or there is goal to reach in campaign and there is 9 times out of 10 simply no hint/warning/information why and how. Except when there is obvious issues like 2 trains on same tracks. \r\nI have once again gotten stuck, and this time I think I will just not return.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hard and unforgiving to learn. I have no idea what I'm doing wrong most of the time and constantly have to google things or ask for help online.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not recommended, great concept ruined by bugs\r\n\r\nI really wanted to like Transport Fever 2. The idea is right up my alley, build networks, optimise logistics, watch cities grow, and on the surface it looks great. But the amount of bugs and confusion in the campaign has completely killed it for me.\r\n\r\nPlaying through the campaign, the missions are often convoluted and very unclear. Objectives are worded in a way where you’re never quite sure what exactly the game wants you to do or how it expects you to do it. I spent more time fighting the UI and trying to guess the logic behind the tasks than actually enjoying the transport building.\r\n\r\nThe worst part is the resource system. A lot of the resource gathering and allocation seems automated, but it regularly assigns lines to resources that simply aren’t available. When I tried to fix it by setting the platforms/terminals manually, it still didn’t work properly, trucks would happily drive back and forth with empty loads even though there were goods waiting, or they’d ignore the platform assignment and behave as if nothing had changed.\r\n\r\nAfter enough missions like this, it stopped being fun and just became frustrating. When the core loop is “debug the game” instead of “build a transport empire,” it’s time to put it down. Until the campaign logic and resource handling are cleaned up, I can’t recommend this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fairly polished and good-looking game, but unfortunately the economy model is so simple you can just exploit it by setting up fake demand for two goods, then arbitrarily shipping infinite amounts back and forth between two distant spots.\r\n\r\nGame is probably good if you're looking to just sandbox build a bunch of complicated cargo hubs and watch it go, but if you're looking for an actual economic challenge, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rail laying is extremely finicky. Crisscrossing rails doesn't work properly. The game doesn't select the best terrain modifications when laying rail or roads. Routes that should work don't but you can fix it by demolishing and rebuilding exactly as you had it which wastes time and resources. Production and delivery doesn't work in the way you expect or even like other transportation games. Diagnostic tools to figure out routing problems barely exist and often give an incorrect answer. Neither free play nor the campaign offer a tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While game itself is a nice clone of old good Transport Tycoon with some improvements (mostly graphic), it has a serious drawback - campaign. Missions in campaign often has very vague description, barely indicating what players should do in what way. During Siberian mission only I've encoutered problem with mission with advertisement (there was no clue that it should be done in specific way) and with conspiracy mission (as nowhere was indicate how to recognise houses in question). And this fact, that many times during campaign player has to look through help and walkthroughs to simply find a solution (often far from any logic) is a bit annoying. Otherwise game is not that bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trains are stupid, stops only at platforms where is cargo. No idea how signals works, After experience with TT/D and Mashinky, this looks like disaster :-(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Guess what I downloaded? A puzzle game!\r\nSpent my 4 Hours in game trying to figure out why supply of whiskey isn't reaching the pub.\r\nSpoiler: Never figured it out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically unplayable. The tutorial tells you to do things but not how. You will get stuck not able to deliver things because you have something in the wrong place but there is not possible way to know how to do it. The UI is overly complex also. I've never seen a building game with such a massive learning curve.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many different tries to make this work.  So I earned enough money to build a complete line.   Crude to refine.  Refine to fuel.  Fuel to town.  All at the same time so the load manager would not freak out.   The load manager freaked out anyway.  Will post a screenshot.  At first it gave me the refined.  Then my trucks started backing up.   AGAIN.  Trains / trucks - it make no difference.   A game that decides on its own  NO - is a NO BUY review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow. 5 minutes was all i could take. Literally no instructions. Rotate the Depot....great how TF do I rotate things exactly?? Screw this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Confusing UI, bad tutorial. Dissapointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The in-game tutorial in the campaigns is appalling bad.  I don't know who is responsible for this, but it's like the creator built it with all the in-house knowledge, but didn't look at it from the beginner's perspective at all. Terrible in that there's instructions, but not how to execute the instructions.  Suggested buildings are not in the menu of choices named the same.  When you get stuck there's no suggestions or demonstrations.  I've spend good money on this game but can't seem to get ahead.  When I look at Youtube videos for help, they seem similarly perplexed.  Why is this so poorly supported from a training view.",
      "voted_up": false,
      "votes_helpful": 122
    },
    {
      "review": "The missions are fine but I want to play more sandbox mode. The game is just a clicker, it's so easy to earn money. There is no challenge. In sandbox there are industries everywhere, even if you select as few as possible. There is no logic in how they are placed. They are just spread all over the map. \n\nYou earn so much money. It’s a great idea to start with a loan, but after you build one train line (even on hard difficulty) you can quickly pay it off. There is no challenge at all. I started with everything set to as difficult as possible. This is a bit sad since it could be a really nice game. \n\nQuite hard to get an overview of what each line earns. I think it’s per year, but a train can take over a year (!) to travel, so what’s shown can vary a lot.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Tutorial has a lot of bugs and badly explained objectives.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It is so painfull to play this game. I don't know if i am just unlucky but it has been a bug fest so far.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is fun but only buy it if it is under $5. It has a LOT of rough edges that will likely never be fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm not sure, I like the graphics and gameplay. What annoys me is the trains can't automatically find paths like in OpenTTD, That should be changed for the third one. Other than that I don't mind it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Tortuous and patronising campaign - I gave up doing the cheesy extra missions in chapter 1 and have stopped altogether after the first main mission of chapter 2. Buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane... what, why? And then there's the core of the game - routing of goods - which is frustrating to set up and easy to break, the lack of any competition given what you're doing, the music - which thankfully you can switch off - and because I've been sitting around waiting, the jarring, immersion breaking things. English street names and announcements across the planet. Announcements for passengers to Birmingham or Canada being made at airports when you've literally just started to build the first plane in existence for travel. One or two of these would be tolerable, but put together they're painful. The third instalment looks pretty, but unless the mechanics change, it won't be on my list.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is possibly a great game but I wasn't able to pass the horrendous tutorial.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Campaign is an important aspect of a game. Well, this game's campaign was clearly designed by a sadistic noob who's only goal was to inflict as much pain as possible on all the idiots buying this product based on the very positive reviews thinking they might find an inch of enjoyment in completing the campaign. But no, there is no enjoyment. There is no challenge, there is only pain. Stupid, silly missions, no teaching on the complex dynamics of the game, just idiotic tasks that require you to destroy all you've done over and over again and to wait unnecessarily long time to complete painstakingly idiotic tasks that go against any logic. I don't care, at this point, how good the free play is, because after spending 80 hours completing the campaign I'm literally exhausted. And I completed it because I kept hoping that it would get better. But no, it doesn't. The last mission (Shanghai) was the apex of idiocy and whoever designed it should be banned from ever working in the gaming industry for 10 generations.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Has one of the most unintuitive train line networking system to ever exist. It will make you scratch your head, and it will make you ask even god himself what and why does it not or do work (He does not even dare answer for not even he knows). \n\nThis must be how it feels to be a programmer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was honestly excited to try this game out, but ended up disappointed in the 2.4 hrs that I played this game. The game's overall mechanics feel complex in regards to being a first-time player. I played the tutorial missions and as others stated, the game does not tell you where to go. You click on an objective and it doesn't tell you the exact specifics. Overall, the game is not for me. I got the game on sale and got the deluxe and the game left a bad taste. Will not be playing this game and not even the 3rd one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I kept on playing the game expecting it to get harder or complicated. Unfortunately the game lack depth. Even though you are granted with some options it still fails to feel nuanced.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For some reason I find it very difficult to play buildings in the tutorial, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sad to leave a negative review to a great game (I've played the first one and expect the third one as well). \n\nThe only issue is that at a very frequently used tab, the've implement a white screen that literally destroys your eyes. Have you ever played CSGO? Prepare to be flashbanged every time you open the core tab of the game. \n\nThe issue has been reported to the devs but they did nothing throughout the years. \n\nReally disappointed. I will give the benefit of the doubt to the new release but I will enter sceptical at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is with heavy hand that I decided to choose not recommend. I actually really enjoy the game, however, the couple of things that do not work, simply surpass any joy I had.\r\n\r\nThe good:\r\nThe tasks and scenarios are very well thought out (loved tongue-in-cheek German-speaking tourist tasks in Mallorca, H. Hughes and the movie of Genghis Khan and radioactive sand etc...). \r\n\r\nThe bitter:\r\nHowever, so many things you are just supposed to guess. The game explains only absolute basics in very beginning, which for most part, it is sufficient. But then the routes do not function or there is goal to reach in campaign and there is 9 times out of 10 simply no hint/warning/information why and how. Except when there is obvious issues like 2 trains on same tracks. \r\nI have once again gotten stuck, and this time I think I will just not return.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hard and unforgiving to learn. I have no idea what I'm doing wrong most of the time and constantly have to google things or ask for help online.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not recommended, great concept ruined by bugs\r\n\r\nI really wanted to like Transport Fever 2. The idea is right up my alley, build networks, optimise logistics, watch cities grow, and on the surface it looks great. But the amount of bugs and confusion in the campaign has completely killed it for me.\r\n\r\nPlaying through the campaign, the missions are often convoluted and very unclear. Objectives are worded in a way where you’re never quite sure what exactly the game wants you to do or how it expects you to do it. I spent more time fighting the UI and trying to guess the logic behind the tasks than actually enjoying the transport building.\r\n\r\nThe worst part is the resource system. A lot of the resource gathering and allocation seems automated, but it regularly assigns lines to resources that simply aren’t available. When I tried to fix it by setting the platforms/terminals manually, it still didn’t work properly, trucks would happily drive back and forth with empty loads even though there were goods waiting, or they’d ignore the platform assignment and behave as if nothing had changed.\r\n\r\nAfter enough missions like this, it stopped being fun and just became frustrating. When the core loop is “debug the game” instead of “build a transport empire,” it’s time to put it down. Until the campaign logic and resource handling are cleaned up, I can’t recommend this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fairly polished and good-looking game, but unfortunately the economy model is so simple you can just exploit it by setting up fake demand for two goods, then arbitrarily shipping infinite amounts back and forth between two distant spots.\r\n\r\nGame is probably good if you're looking to just sandbox build a bunch of complicated cargo hubs and watch it go, but if you're looking for an actual economic challenge, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rail laying is extremely finicky. Crisscrossing rails doesn't work properly. The game doesn't select the best terrain modifications when laying rail or roads. Routes that should work don't but you can fix it by demolishing and rebuilding exactly as you had it which wastes time and resources. Production and delivery doesn't work in the way you expect or even like other transportation games. Diagnostic tools to figure out routing problems barely exist and often give an incorrect answer. Neither free play nor the campaign offer a tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While game itself is a nice clone of old good Transport Tycoon with some improvements (mostly graphic), it has a serious drawback - campaign. Missions in campaign often has very vague description, barely indicating what players should do in what way. During Siberian mission only I've encoutered problem with mission with advertisement (there was no clue that it should be done in specific way) and with conspiracy mission (as nowhere was indicate how to recognise houses in question). And this fact, that many times during campaign player has to look through help and walkthroughs to simply find a solution (often far from any logic) is a bit annoying. Otherwise game is not that bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trains are stupid, stops only at platforms where is cargo. No idea how signals works, After experience with TT/D and Mashinky, this looks like disaster :-(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Guess what I downloaded? A puzzle game!\r\nSpent my 4 Hours in game trying to figure out why supply of whiskey isn't reaching the pub.\r\nSpoiler: Never figured it out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically unplayable. The tutorial tells you to do things but not how. You will get stuck not able to deliver things because you have something in the wrong place but there is not possible way to know how to do it. The UI is overly complex also. I've never seen a building game with such a massive learning curve.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many different tries to make this work.  So I earned enough money to build a complete line.   Crude to refine.  Refine to fuel.  Fuel to town.  All at the same time so the load manager would not freak out.   The load manager freaked out anyway.  Will post a screenshot.  At first it gave me the refined.  Then my trucks started backing up.   AGAIN.  Trains / trucks - it make no difference.   A game that decides on its own  NO - is a NO BUY review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow. 5 minutes was all i could take. Literally no instructions. Rotate the Depot....great how TF do I rotate things exactly?? Screw this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Confusing UI, bad tutorial. Dissapointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The in-game tutorial in the campaigns is appalling bad.  I don't know who is responsible for this, but it's like the creator built it with all the in-house knowledge, but didn't look at it from the beginner's perspective at all. Terrible in that there's instructions, but not how to execute the instructions.  Suggested buildings are not in the menu of choices named the same.  When you get stuck there's no suggestions or demonstrations.  I've spend good money on this game but can't seem to get ahead.  When I look at Youtube videos for help, they seem similarly perplexed.  Why is this so poorly supported from a training view.",
      "voted_up": false,
      "votes_helpful": 122
    },
    {
      "review": "The missions are fine but I want to play more sandbox mode. The game is just a clicker, it's so easy to earn money. There is no challenge. In sandbox there are industries everywhere, even if you select as few as possible. There is no logic in how they are placed. They are just spread all over the map. \n\nYou earn so much money. It’s a great idea to start with a loan, but after you build one train line (even on hard difficulty) you can quickly pay it off. There is no challenge at all. I started with everything set to as difficult as possible. This is a bit sad since it could be a really nice game. \n\nQuite hard to get an overview of what each line earns. I think it’s per year, but a train can take over a year (!) to travel, so what’s shown can vary a lot.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Tutorial has a lot of bugs and badly explained objectives.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It is so painfull to play this game. I don't know if i am just unlucky but it has been a bug fest so far.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is fun but only buy it if it is under $5. It has a LOT of rough edges that will likely never be fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm not sure, I like the graphics and gameplay. What annoys me is the trains can't automatically find paths like in OpenTTD, That should be changed for the third one. Other than that I don't mind it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Tortuous and patronising campaign - I gave up doing the cheesy extra missions in chapter 1 and have stopped altogether after the first main mission of chapter 2. Buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane, buy an aeroplane, sell an aeroplane... what, why? And then there's the core of the game - routing of goods - which is frustrating to set up and easy to break, the lack of any competition given what you're doing, the music - which thankfully you can switch off - and because I've been sitting around waiting, the jarring, immersion breaking things. English street names and announcements across the planet. Announcements for passengers to Birmingham or Canada being made at airports when you've literally just started to build the first plane in existence for travel. One or two of these would be tolerable, but put together they're painful. The third instalment looks pretty, but unless the mechanics change, it won't be on my list.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}