{
  "positive": [
    {
      "review": "I never thought that out of all the games, a racing sim is the one I'd have the most success getting my friends to play together. I always figured it would be something more mainstream and casual. Instead, it is Automobilista 2.\n\nI have thought about this a lot, and I think there are many factors that contribute to it, For example, it is super easy to host a multiplayer lobby for friends to join and AI opponents to race against (which not all racing games/sims have). I often set this up with a good mix of settings for different skill and experience levels:\n\n[list]\n  [*] Fuel consumption, tire wear, and damage enabled, but with damage scaled down and without random mechanical failures or the ability to destroy the car to the point of being completely undrivable.\n  [*] A qualifying session before the race starts, which gives everyone time to feel more comfortable in the car and track.\n  [*] A multiclass race with a range of cars that match the skills and interests of all the participants. For new players, I'll often include the modern Mini Coopers, as they are more forgiving while still being fast and fun. Up to 10 classes are allowed, upping the variety (and allowing for sillier combinations) while allowing me to make sure that non-DLC cars are always available.\n  [*] Any track we want, because only the host needs to own DLC tracks in order to race them in multiplayer.\n  [*] I'll pick different time/day and weather settings between the qualifying and race sessions, to keep things more dynamic, and have the track set to dynamically rubber in as we drive.\n  [*] Penalties on, but with full course yellows disabled.\n[/list]\n\nThe result is some [b]friendly, casual racing that we can all enjoy[/b]. We all have potential to race among ourselves or AI. Those who enjoy the greater simulation and detail can experience it, and those with less experience are given a chance to learn things and aren't punished as hard. Nobody needs to own DLC except for me, but owning the DLC cars provides more variety. \n\nAt the same time, I have the option of making the lobby less casual if I expect that I'll be getting an exclusively more experienced audience. Or I can make it more casual/silly by loading up a dirt track with Opalas and Copa Trucks, turning off penalties, and agreeing that it is okay to race dirty for this session.\n\n[h2]Racing against the AI[/h2]\n\nThe AI is not perfect, but it races the most like humans of any racing AI I have ever seen. It can get defensive, fight for opportunities to pass, make mistakes (especially when under pressure), won't just give players space like in many racing games/sims (unless if their aggression is lowered), have individual skill levels in different situations, etc.\n\nIn our casual lobbies, depending on how I set the AI, many of us may be fighting for positions with AI in faster or slower classes, which means that everyone has a chance to race against something. In single player, the AI is amazing if tuned to your individual skill level, so that you are hitting around average lap times.\n\n[h2]Simulation depth and controls[/h2]\n\nThe realism of the physics is always debated, but the physics are detailed, the cars' features and behaviors are well modeled, weather simulation is among the best, and the controls are good enough (across the range from a fancy force feedback wheel to a Steam Deck). I'm happy with this as it is.\n\nLots of my friends play on a basic controller, and this works well enough. A bunch of us are using various force feedback wheels. Not that I'd recommend it, but one of my friends consistently races on keyboard and can be competitive within our group!\n\n[h2]Content[/h2]\n\nAutomobilista 2 (or AMS2, as it is often referred to) has a ton of base game cars and tracks. It is especially cool that many lesser known (often Brazilian) tracks and series lend a ton of variety that aren't easily found in other games/sims. Owning the DLC is definitely not necessary to have fun, and the base game has a ridiculous amount of value.\n\nAt the same time, the DLC is priced decently compared to other racing sims and generally adds a lot of variety and good quality content. Buying DLC may be necessary if you only care about particular (and often popular) cars and tracks. I said it before, but [b]owning DLC tracks is not necessary to race on the DLC tracks when joining a multiplayer lobby[/b], as long as the host owns them, which is such a consumer-friendly choice.\n\nThere aren't a ton of road cars, as AMS2 is largely focused on motorsport. There [i]is[/i] a good amount of representation when looking at open wheel (17 classes for different F1 seasons!), GT, endurance racing prototypes, historic, etc. cars. I do think that touring cars are a bit of a gap in the roster. Not everything is officially licensed, but this does not bother me and you can always find skin packs published by the community.\n\n[h2]Improvements over time[/h2]\n\nI appreciate that AMS2 has continued to improve with tweaks to the physics, AI, UI, multiplayer networking, force feedback, etc. over time. Besides the stream of DLC releases, there are sometimes additions or updates to the base game or previously released DLC. These continued commitments to improving the game make it easier to recommend.\n\nI wouldn't recommend buying it for this before the feature is released, but a career mode has always been in the plans and is expected in 2026. Part of the idea with all of the content additions has been to flesh out all of the different paths you could take in the career.\n\n[h2]Virtual Reality[/h2]\n\nAMS2 is considered one of the best racing games for VR. Besides everything which isn't VR-specific, the balance it strikes between performance and graphical fidelity really lends itself well to VR, and it has decent UI/UX both in the menus and when racing.\n\nMost of my time in AMS2 has been in VR, and it makes it hard to go back to racing sims that don't have VR support that works or performs at the same level.\n\n[h2]Conclusion[/h2] \n\nYou may be able to find friendly and competitive races online, especially if joining a league and/or using a third party service (like LFM), but this isn't my focus or where AMS2 stands out the most. If you must have a full roster of officially licensed cars in some particular class, you may be disappointed. These aren't the reasons to get the game.\n\nIt is easy for me to recommend Automobilista 2 to any who may have interest in racing. Racing with friends or in single player (with AI in the mix either way) are where it really shines. In these cases, it is easy to tailor the experience as you like. There is a ton of content and variety, especially for the price, especially when on sale. I've had many friends get into AMS2 who previously thought they could never enjoy a sim racing game.\n\nNote that when playing on Linux, you will need to explicitly force it to use Proton, or else the game won't run, because the game has been misconfigured in Steam.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Automobilista 2 is one of my favorite simulations! \nIf you're looking for a simulation experience without the headache of tweaking everything, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Most photo realistic racing sim I’ve ever played.\n\nAutomobilista 2 is criminally underrated. The way this game looks in motion is insane - lighting, reflections, track detail, weather transitions… sometimes it genuinely feels like I’m watching real onboard footage, not playing a game. Night racing in the rain, headlights, reflections in the mirrors - pure madness. And yes, it has full native triple screen support - triples work exactly as they should, no hacks, no pain, the immersion is on a whole different level.\n\nCar handling is insanely satisfying: you feel the weight transfer, the moment when grip starts to go, the car dancing on the edge. Every class has its own character - from old-school classics to modern GTs – nothing feels copy-paste, all the cars feel alive. The sounds are brutal too: engines scream, shifts punch, curbs and bumps are all there in your hands and ears.\n\nThere’s a ton of content: lots of unique Brazilian tracks you don’t see in other sims, legendary circuits, different eras of cars… you can sink hundreds of hours into this and still find something new.\n\nIf you love sim racing and want a game that looks almost like real life and drives amazingly well, Automobilista 2 is an absolute must-have. This game is fucking awesome.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Very in-depth sim with lots of features and cars that come with the game itself. Highly recommend for anyone into sim racing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It has taken a long time for this game to get to a point where I don't feel like its just me having fun with it but like it is legit in a good spot and going to even better places soon.  But now it feels like that the last update has even helped a lot of the cars that were kinda alright before feel much more connected and like you would think.   Game is fantastic and you cant really go wrong with any dlc but the newest pack is hands down the best content on the game currently besides maybe the 90s CART cars.  force feed back on the default option is very good and this sim has the advantage of bumps actually feeling like they effect the car more which plays into how you approach different tracks more.  Makes for much more of a different feeling from car to car as well.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "بسیار بسیار عالی \r\nفورزا موتور اسپرتی که واقعا امکانات داره و دی ال سی درست و حسابی داره\r\nبا هزینه کمتر انگار داری آی ریسینگ بازی می کنی",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of contents, good Ai for offline, good graphics,good sound,good physics,not too demanding on your system and it doesn't cost too much",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've played Assetto Corsa with all the DLC and also Competizione; Automobilista2 is by far my favorite! It's just fun, it seems realistic as far as I can tell, the graphics are fantastic, VR is fantastic, the AI races are fantastic. There's a large selection of cars and tracks from the base game by itself that it will keep you occupied for quite a while. Not to mention there's cars and tracks that are perfect for new drivers that want to try it out. Get it, you won't be disappointed!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is quickly becoming the goto sim for historic racing. Great selection of historic track layouts as well as car classes spanning multiple eras and disciplines. The physics and force feedback are improving constantly and AI is definitely one of the better ones.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "AMS2 might not have as well-tuned/realistic physics and handling as LMU, AC EVO, or AC Rally, but it's still very good and, most importantly, fun.\n\nHaving the sims above, I don't spend much time in AMS2 anymore, but when I do, I always have a great time. No other sim gives you as much variety in cars and tracks, as good VR performance or high FPS with great graphics, and lets you create private lobbies with your friends for free and even fill up empty spots with best-in-class AI.\n\nOn top of that, it's on sale very often, and no other game represents nearly as good a value for money for what it offers.\n\nMore predictable cars are manageable with a controller, so friends without a wheel can join you. Although newer LMU or EA of EVO do it better, those games don't let you create your own lobby for free or even race in the same session in the case of LMU (You'd need to have the same rating and get lucky)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Racing at a classic Kyalami Circuit in South Africa with 70's F1 machinery is so realistic that even the black and white flags are kept apart.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best racing sims, especially for offline racing. Beautiful graphics. Wide range of cars and tracks from new to historical. Good and fair AI.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its what Project cars 3 should have been. Just waiting for career mode but if you can't wait, racing life (third party app) will scratch the itch for now. Keeps getting better with every update!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has exceeded my expectations.  Even though the trial looked and drove horrible, the game itself is well worth the money.  This simulation is perfect.  The cars all handle different, the weather changes, which makes for a more immersive experience.  The graphics are better on here than others with Unreal Engine 4, and 5.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a bit harder to set up on xbox controller but its a pretty solid game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game/sim! I love to spend time and more time playing the AMS2 and making different kinds of race: endurance, sprint races, F1 GP, brazilian local races wth classic cars or multiclasses races. I love classic stock cars and the last generations to, but we dont have the most recent Stock Car (4 cilinders) ou the 2026 cars (V8).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite racing simulation for years, and the devs just keep making it better and better. One of the only few that supports hosting your own server while adding AI to the lobby - which on top behaves really well. Only thing I would wish for, are official regular races and a good ranking/safety rating system, as on LFM, but integrated.\n\nKeep going Reiza!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really fun racing game that has a solid amount of accessibility options. The list of cars and tracks is substantial and the graphics are very good. Although I haven’t yet tried it with my racing wheel and pedal set, it is quite playable using an Xbox controller.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of contents, good Ai for offline, good graphics,good sound,good physics,not too demanding on your system and it doesn't cost too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Automobilista 2 has become my most enjoyable racing sim. VR integration is the best and works great on Linux as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When comparing this game to others in the genre, it may not be a master of a single trade but it has enough content to keep you busy for hours. This is the game we wanted PC/PMR to be. Absolutely fantastic range of content and a lot of niche series and tracks, such as CART and 2005 Endurance, along with Brazilian domestic series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Good physics, good graphics, very detailed cars. Looks awesome in VR. I played Forza Motorsport before and this game so much better, especially considering the price! Great job!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was waiting for Project Motor Racing, this works very well! GripperSim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't know how realistic it is but boy is it fun. In almost every online race I get into thrilling wheel to wheel racing, highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game also fun to play arround with in groups and or making your own turneys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Performance is great in VR, glad I came back to AMS2 after not liking the feeling of it years ago. Don't let the outdated demo steer you away!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whilst the physics on some of the cars might be a bit wonky at times with the default setups (Looking at you LMDh...), the driving experience overall is pretty solid and is a testament to Reiza working around the kinks of the Madness Engine. In terms of content, it's probably one of the most packed sims on the market with all the DLC as of now. You've got most of the big name tracks and a lot of fun little deep cuts sprinkled in (Cleveland my beloved). I highly recommend this game if you have a lot of money to splurge on a hardcore sim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice graphics and well optimized. Very good AI for single player. Lots of tracks and cars. Very good force feed back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very, very good sim absolutely full of content. Definitely under-appreciated in the sim racing world. \nIt's certainly not perfect in terms of multiplayer lobby bugs and other small 'quality of life' features that could be implemented (changing control set without having to go to the main menu, so i can change wheels mid lobby, please?) but every sim title has flaws similar to this. If you can pick this game + extra content up on sale, it's a no brainer. Also, where's the career mode?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game, what project cars 3 (and for that matter, project motor racing) should've been",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OVERVIEW: One of the best games that are just pick up and go. No complicated figeting with Content Manager to make sure all the cars are correct, AMS 2 has built in classes. Multi-Class setup is just one button. Race setups with weather are easy and real weather based on date makes remaking historic races a breeze. \n\nThere is LFM support and we definitely need more drivers there. \n\nVaried car classes and specific setups can provide hours of entertainment, although still somehow limiting. \n\nFFB while great, may lack with some information to the wheel, however, the handling is still very accessible. \n\nThere is a modding scen of heavily dedicated creators that are working tiressly for more content, but again, we need more people in this space. We also need more support from reiza in this sector. \n\nPROS: \nEasy to setup \nAccessible\nActive community\nClassic and new car collection is awesome. \n\nCONS: \nFFB can lack sometimes, but overall is not too bad. \nBase content, while plentiful, could still feel lacking. Game would benefit from a career mod. \nLFM support is there, but no  active players consistently. \n\n\nCONCLUSION: Overall this is a fantastic peace of media that is actively supported with a supportive community to boot. You will most certainly always have something do and a way of racing. I cannot recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a love hate relationship with this sim, but with recent releases I am more appreciative of AMS 2 than ever before, there's something for everyone quite literally, keep improving on the car handling and tire model.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this games, is very realistic with very cars and have a low price with discount",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "feels more like a continuation of project cars than what the actual creator of project cars has made since pcars 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The simulator delivers strong value for the content it offers (especially with the included DLC), though in my view it does not stand as the most realistic option on the market. \n\nAt times, I encountered handling characteristics reminiscent of Project CARS 2, particularly the tendency for certain cars to enter an unrecoverable slide when traction is lost mid-corner—often leading to a full race restart.\n\nThat said, there are also many moments where the driving experience is consistently smooth and rewarding, making long stints genuinely enjoyable.\n\nOverall, for the breadth and quality of its content, I can confidently recommend it. \nIt offers a great deal of fun, and I hope Reiza continues along this trajectory, expanding the title with new content that is very much worth the investment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best sims out there. A mix of different racing series with the complement of vintage cars and tracks for a more historic experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very competent racing sim, that is accessable enough to have new players come in the hobby aswell.\nthe AI is working especially well.\nthe car lineup is very diverse and growing with each patch, same for the racing tracks.\ncan absolutely recommend this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great to play with friends and easily accessible multiplayer without the need for dedicated servers.\nOverall a great Game/Sim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Automobilist delivers on its promise of a fun and engaging multiplayer mode, making every race feel competitive and exciting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun for singeplayer, especially the new 2005 DLC's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR skip to the final paragrah\nAMS2.. where to start. Well this was my first driving sim I purchased on steam and one of the main reason's for creating a steam account. For a still in development game continuously being updated the $25 for the base game content which is a huge amount is well worth it. Really good value for money and easy to jump on to play with friends or offline against AI. Starting off playing many hours on controller(X360) before eventually getting a wheel(Moza R3) I can say it was still playable and enjoyable on controller with the assists all turned off(if I played on controller ever again I would just use them) . In saying that there are some players on the time trial leaderboards in the top10 on controller but for actual racing it's not consistent enough. Catching slides without losing too much momentum and other small corrections cost a lot more time on controller and you will not have consistent lap times in anything but really slow cars or assisted cars on very select tracks. Catching a slide the traditional way by counter steering then turning back into the corner inducing understeer like you need to do in openwheelers constantly is impossible without a wheel unless you are a precision controller player.. which are a few and far between.\n\nI should mention at this point the hardware I am running or have run:\ni7 6700 24GB of DDR3 Ram and GTX 1060 it handled nearly everything apart from the odd framepacing issue/stutter in certain areas of tracks with a lot of cars playing online when league raicng.\nI have upgraded to a 7500f Ryzen 5 system running 32GB DDR5 and currently a 1660Ti which runs even smoother then the old system and also allows a max extended grid which the old cpu struggled with. Gfx settings are still set very similar to the 1060 was so it can maintain a stable 138fps with freesync and 144Hz refresh rate. Have had no stutters on this setup yet.\nController wise I started with my old faithful Xbox360 controller and moved on to a Moza R3 bundle with the SRP Lite pedals with an added shock absorber and reduced travel on the throttle which is very nice to use in this game with it's throttle torque mapping being fairly realistic. The direct drive wheel allows freedom to test different custom ffb configs to find something that works for you since ffb is very subjective. I prefer a more pure direct steering rack forces type of ffb vs having extra 'canned' fx.\n\nThe actual driving itself has come a long long way from when I first got the game and it seemed every car was very happy to leave any corner in a massive powerslide, That was also the fastest way round most corners. One thing I'm not completely sure on is whether this game is aiming to continue making the game more realistic as the differential modelling, throttle torque mapping and tire model are in a decent place with just tweaks to try remove that project cars 2 feel from the game still coming one by one, The floatiness is still there particularly some of the GT3 cars(BMW gen 1...) and it does drive a lot faster lap time wise then other sims and irl. The good parts are cars that can be a bit too powerful and hard to get near the limit like f1 cars are quite accessible in this and the handling model works really nicely for older formula one cars and open wheelers in general. The open wheelers showcase the superior tire model this game has to it's predecessor where the tire actually has some flex in it and progressive loss of grip. These are my favourite cars to drive by far in this game alongside some of the touring cars and other lower powered gems. \nGetting a custom ffb file can completely change the experience and finding a good custom file will go a long way with how much you enjoy this game when you start pushing for the absolute limits. I hold rF2 as the gold standard in ffb and I have not quite been able to get that same feeling when the brakes are on to the point the car is squirreling around on the rear tires and feeling the fronts load up like it happens in real life but it has definitely improved.  \n\nThe game is definitely a much friendlier intro to any driving games more on the sim then arcade side of the spectrum. Using the assists and other controller settings it's playable for nearly anyone, much like AMS1 it has a unique selection of brazilian content, great amount of base content and plenty of dlc to expand with more cars and tracks once the base game isn't enough. I purchased all available dlc after playing for 3 or 4mo but have some more to now get that has been released in the meantime. This is purely to support further development on the game as I believe it still has more potential especially if a dedicated server was available. Latest online play on the day of this review netcode did seem better then the last time I had played online over 6mo before this review date. So online seems to be more stable compared to 6months ago in other words. Most leagues I believe are hosting on JustRace or I assume some use LFM too which I haven't tried(daily officially hosted races or leagues etc.) as netcode had become a big issue causing lots of ruined races. The environment with full weather effects and day night cycles is a really nice aspect of offline or online races especially longer ones.\n\nEven though the driving style may not be completely realistic it is fun, combined with the really good parts which are the performance of the game on older hardware where it really is punching above it's weight, the immersive graphics sounds and overall environment. It still requires a lot of practice to get really fast in the top classes giving plenty of content to challenge the player to master. The dev team are very active with bug fixes and constantly providing updates showing they are committed to improving this game aswell as adding new content so I can only recommend it and hope this rather long review helps someone out there. Great unique game from a great unique studio. Will stay a part of my sim rotation for a long time. A nice game to compliment the first AMS game and other titles where the AI are lacking a bit, some work still needs done on them here but they are on the whole fairly decent in the right class/track combo. The game is moddable but with other games like AMS1 or rF2 in my collection and quality/scope of vanilla content I do not bother risking the stability of the game with mods.\n\nIn a nutshell the game is good for offline and social racing but anything semi competitive it falls apart from a combination of poor online stability and the floaty physics. As tires wear the physics flaws show more and more, tire pressures outside the optimum and you lose grip for no reason. Really is like the DR2.0 of circuit racing games. The good stuff is the range of classes and offline/AI play, perfect for a casual race with a few mates and some AI to bulk out the grid but not much more. I do have hope with the very advanced differential model and tire model they find a sweetspot but as time and more updates pass I have less hope..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best racing sim so far with excellent force feedback, driving physics is really close to reality! Should consider lowering the DLCs expense, make it more affordable for the sim drivers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMS2 in VR is unbeatable and motion is mindblowing. Wish multiplayer was more plentiful but single player with virtual championships are topnotch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, but dificult to master",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got into sim racing through this game, and I couldn't ask for a higher quality or more varied introduction. Incredibly grateful to the team and excited to play more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want peak VR racing experience, this is it. Look no further. I can't play iracing anymore. This is hands down the most fun racing sim I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With updates this has just been getting better and better. \nGraphics are some of the best, with an eclectic array of vehicles with skins that are easy to install and recreate all the greatest eras in racing. \nNot really a online guy, but ai is good and different weather, seasons and night and day cycle's are awesome. Physics I actually enjoy most of the cars, but as with all the Sims out personal preference is a thing. Overal 9.5/10\nIn short just fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For single player SIM racing, this is my go-to. The AI is fantastic, the physics, tire model and FFB feels great. There is a ton of content, cars, tracks etc, the DLCs priced fairly.\r\n\r\nMy only complaint is the weak multiplayer, there is only a simple server browser and thats it.\r\n\r\n9/10 recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just amazing. Best experience out of all sim racers in VR and work perfect with a wheel. Performance is also great, looks good, no smudging like in some other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I use a controller, but certainly believe a wheel would work better. The track selection is good. I like the old variants as the old billboard logos add to it. Cars sound great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is absolutely the best single player racing sim out there and it has super easy to setup multiplayer. The car and track range is jaw dropping. I will never get over how amazing this game is for the price it’s sold at.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the only game I play in VR for sim racing — it’s absolutely amazing! If you tried the demo and didn’t like it, keep in mind that the demo is very limited compared to the full version. I highly recommend it if you have a VR setup. It’s easily the best VR racing experience available right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Single player experience you'll get on any sim, variety of cars and tracks, extremely well optimised 100+ fps on near maxed out settings on a gtx 1080, good netcode (better than iracing), good detailed force feedback, only downside alot of the cars feel very floaty to drive and you can over abuse the slip angle but other than that this is a fantastic simulator. the true project cars 3!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Automobilista 2 is one of those games which just resonate with you whilst you're driving. Open wheel, endurance, GT and many more racing categories just nail that realism perfectly. The AI is fantastic, sure they might be a bit goofy at times but those can be fixed easily and the racing from them is really great. The weather is quite nice although maybe there could be a more detailed setting for customising the weather just for your own personal needs, the day and night cycle is great also though maybe the day sky should be a bit more vibrant and when it turns dusk with overcast clouds usually the sky is this dark blue-ish type colour which i find it a bit unrealistic when its slowly getting into dusk the overcast clouds are still grey. The sounds are amazing and the atmosphere really gives that immersion that you're in an actual race with all the crowds cheering, the music playing in the background and the overall environment of the track feels immersive. Graphics is also something which I wont complain about although texture wise it could be improved by a little or maybe even more because when I'm driving lets say an LMP2 car the cockpit feels too plasticity and very bold and you can really see the difference when comparing LMP2 car from lets say LMU. With car handleling  its quite alright although with some cars like the rental kart it doesn't feel heavy and it is very slippery, based on my experience driving rental karts its a little inaccurate but with other cars the handeling is quite nice. I'm glad AMS2 has been improving the game ever since the start and I'm genuinely surprised at how good the game is and how much can be added.\n\nHere are some ideas from me for the Future:\nGTE Pack including: \n- Ford GT LM Mk.VIII\n- Ferrari 488 GTE Evo (If you get the licence)\n- Corvette C7.R\n- Aston Martin V8 Vantage (2012-2017)\n\nLMP1 (Modern Era) Pack including:\n- Porsche 919 Hybrid (PLS)\n- Toyota TS050\n- Audi R18 e-tron Quattro\n\nGT3 Pack including (All fit well with the IMSA Pack):\n- Ford Mustang GT3 (2024)\n- Ferrari 296 GT3 (If you get the licence)\n- Acura NSX GT3\n\nNASCAR Pack including:\n- Modern Ford Nascar\n- Modern Toyota Nascar\n- Modern Chevy Nascar\n\nModern GT4 Pack including:\n- BMW M4 GT4 (Newer one)\n- Toyota Supra GT4\n- Mclaren Artura GT4\n\nDTM Car Pack including:\n- Audi RS 5 DTM\n- BMW M4 DTM\n- Mercedes AMG C 63 DTM\n\nAdditional Cars including:\n- Acura ARX-6\n- F1 Cars based on 2014-2017 (without halo)\n\nFuture Track Ideas:\n- Bahrain GP\n- Detroit GP\n- Saudi Arabia GP (Jeddah)\n- Abu Dhabi Yas Marine\n- Zandvoort GP\n- Mugello GP circuit\n- Albert Park GP\n\nAdditional Features including:\n- F1 Car customisation (Steering wheel and Nose)\n- Proper flash button for overtaking slower classes\n- Helmet customisation?\n\nHope these ideas spark interest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "grafico muito bom, jogabilidade muito boa e o melhor modo VR. Poderia ter um sistema de rankeadas tipo iracing q ia ser goated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed playing it from a Steam Deck, although I'm looking for games that have a single-player story mode, and this one doesn't have it yet. I recommend it, and I hope the career mode will be added at the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From all racing games that have VR implementation this is my go to for simplicity of setting it up. visuals being decent as well as performance being good I am a 3070ti (laptop) user and I can get decent experience on quest 2. Love it. Also as UK based I love Oulton, cadwell being included. Cars wise I wish they would add the mk3 Mr2 to recreate the mr2 cup that happens on Oulton Cadwell Silverstone but there are some exciting and obscure cars are in here as it's Brazilian dev cars that are domestic such as Puma are great to see. Love the difference to other sims feels great definitely recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it. Comes with a decent collection of cars and championships, and also a nice variety of DLCs if you want to expand on it. Played a ton of different races before feeling like a DLC or two would spice things up.\r\nF1, hypercar races, old races, retro f1, truck races, stock car races, you name it.\r\n\r\nDefinitely a recommendation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing graphic, fun and great value!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would like to add I am reviewing this from the perspective of someone owning a DD wheel and Sim rig.\n\nIn terms of the physics, there are a lot of strange quirks when comes to car rotation and handling. It is extremely forgiving at the grip-limit as opposed to other sim titles. This makes the game a lot easier to drive in compared to other games. It doesn't mean that you need to drive any differently than other sims, its just that once you've pushed the vehicle into an slip condition it is very easy to correct. \n\nI'm not saying this is a bad thing, I'd argue that out of all the games I've played that AMS2 delivers the most fun driving experience I've had out of other sims. I just want to nip this strange elitist community in the ass really. \n\nAMS2 requires little to no fiddling in terms of setup, the game engine is really well optimized and the setup process for a race is incredibly easy. The AI is really well balanced and constantly being changed with each update. The amount of content offered is really impressive as well. \n\nI would say get the base game, and then cherry pick which DLC you are most interested in as opposed to buying it all. (Or do, I'm not your bank)\n\nThe handling on controller is really good too, there is something for everyone in this game. Its not something I can say for other sim-racing titles on the market.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has very diverse tracks and cars, including Formula, GT class, off-road, stock cars, and even go-karts. The car physics still feel good if you play with a gamepad. The only drawback in this game is that there's no Ford Mustang GT3, but overall, this game is worth buying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Should you play this game called automobalista 2 – yes \r\n\r\nWhy? – it is a very solid and polished game. I have in my experience I did not run into any game breaking bugs recently and all of the content seems to be working perfectly well. \r\n\r\nThe good\r\nContent wise – I have never been in a position where I have questioned what to do. But it is becoming stale and a little repetitive. The campaign should be coming soon as of writing and the devs seem to be open to criticism as they are adding different types of cars and a lot of different tracks. \r\n\r\nThe graphics – the best I have seen for most games in the sim category. Runs on a potato and looks good doing it. I run on a moistly medium to low setting and it looks like it’s a movie most of the time. The models are brilliant, and the optimisation is peak I have been running 47 Ish car grids and have been sat at around 50 gpu utilisation stable. 60fps flat. Not real stutters because of the game. And the latency is in the negatives, there is no latency, what you see is in real time. Its great. \r\n\r\nThe online is to be desired but the devs are working on it hopefully. The game is more singleplayer oriented as the AI is the best in any game to this day. \r\n\r\nIn my opinion this is better the asseto Corsa. No argument, and if you disagree fight me. (or message me and I can explain further)\r\n\r\nThe ugly\r\n\r\nHandling model – I have a Logitech g920, so the detail of the handling is lacking at most for me, so I am not going to say much. But what I will say is that they are making it better then what it was a while ago. The floaty handling is slowly going away, the ability to brake aggressively is a lot better than it was also but there is still room for improvement as is for every sim these days. \r\n\r\nThe community, for the most part. Scaring people off because you did not like the game is the worst thing about this game. That’s all really.\r\nThat’s all I can say really. No major game breaking bugs, no massive holes of content or broken promises. The devs rock up at the start of the month, drop some great polished content and then disappear for the rest of it. Its some of the most surprising way of doing it in my opinion. And the best way to keep players sort of exited for what they drop. \r\n\r\nIn conclusion, should you spend your hard stolen cash on this game – yes. Do you buy all of the DLC – no, buy what you want when you want and get the rest on sale. Just don’t be coming into it as demanding and get used to the handling and have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let me be perfectly clear,, this HAS the potential to be something greater than the sum of its roots(Project Cars2)((not a long stones throw i know)) .. but, after playing for a little bit(compared to other Race-Sims) the tire dynamics are just a Chef's kiss,most of the time. Kinda the \"60% of the time it works every time\" vibe going on.. but the flat spot dynamic and a few other concepts and features are just M'wah Chef's kiss..Plus LIVE ACTUAL WEATHER. The names are in old F1 are great and worth the price of the game, when on sale... that being said you don't get a whole lot with the base model, and DLC can get pricey. I don't want to go in on AI play as it seems that every one in the F1 sim and beyond has adopted this only in the cornering will you truly see the level of the AI...i.e. If you are a good driver, and set it to like lets say 85 and below. If you can carry that speed \"in and trough\" racers will catch the drift here :).. your gonna hit a lot of rear ends and rear side quat panels.. they either are moving chicanes or brake check you into next week.. now I know depending on the discipline, back-markers may not have to yield to others.. but in this they seem to either get in their own and others way, or run a screen for the AI in front of you.. plus no save to wrap it all..I do recommend and I do hope they, the Devs., continue on their Buggy Brazilian Quest to have a REALLY GOOD GAME SOON!! thnks and Enjoy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After finding a few communities on discord this is my main sim, I really like the way the car handle and react to my inputs, it feels very natural.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "All the reviews and videos on YT are right, nearly everything works right out of the box with AMS2, no issues, no shutters, no mods to install or anything like that. Just load it up, set your FFB, tweak your graphics and then have fun driving anything from an old 70's box to the latest Hypercars around all sorts of circuits, and you can do it against a bunch of AI who will race you, keep you on your toes, and make you work for the position. 8/10 so far I just wish I had got it sooner when it was like $5 on sale haha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from ACC I wanted a little more variation from just GT3 so I bought this instead of PMR, so glad I did. This sim is awesome. The graphics are easily on par if not better than any more modern titles, the cars look and sound truly amazing. Works great with controller and wheel, the FFB is great, feels a lot like ACC. Also scratches the Gran turismo itch if you don't have a PS5. There's a ton of cars and tracks even in the base version so no need to spend extra on the DLC's if you don't want to but there are a couple I would pick up on sale. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Automobilista 2 is very nice out of box simracing experience especially if you are looking for older race cars and the brazilian racing series are really nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't really know this game existed before I got back into sim racing - but man, it does not disappoint. The feedback through the wheel is incredible! I've done way more laps around Kyalami than I'm proud to admit. What a next level sim racing experience, the real successor to Project CARS 2. Hoping for more road cars soon - and a career mode to grind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome racing sim, one of the best. Outstanding graphics and AI. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks great in vr. You can see I have 233 hours and this is not my main sim racing game. Great range of cars and tracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best single player sim currently on the market, the car behavior is a little weird when compared to other hardcore sims but I just mean that in the way that the cars angle through corners, it still achieves an above average realism it just does it in a different way. Kind of like how iracing has such a strong/sharp front end compared to other sims in terms of it having its own style. If there is ever a time that you either feel like bullying AI or having an incredible cinematic experience this is the place to do it. The modern content is good; but the official historic content is what makes this heads and shoulders above the others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive play countless sims but this one with the tyre contact focus is pretty sweet, love how the GT cars come alive, balanced and good FFB.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not usually a review guy but this deserves one. If you're into sim racing to have fun and mess around with stuff you'd never be able to touch in real life, AMS2 and original Assetto Corsa is what you want. \n\nJust did a 15 lap race in Curitiba where I was fighting with the 3rd place car for about 12 of those laps. He took defensive lines, cut off the apex, blocked my exits, it was AWESOME. I love really all the major sim racing titles other than iRacing because I hate the subscription model, and none of them have given me a better AI racing experience than that one race.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "its the real spiritual successor to project cars",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game once you've got the VR setup right. Very happy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even for a large AAA industry, these devs do very impressive, high quality work. Their team is kept fairly small for good reason. I remember leaving this behind last year with updates and lack of content ongoing. Each update would cause a reset for your tunes, but I happened to distract myself with other sims in the meantime. The only regrets I had in that time was spending so much as a dime on other sims like ACC and iRacing.\r\n\r\nThis is the only sim out there that can make sense with physics and it's effects with the mass of your vehicle. A Porsche will be Rear engine for example so you want tighter springs to compensate with the proper reactions of pumps and undulations on track. This rightly reflects onto tire temps, and wear and is the only sim I know of to do this correctly!\r\nOnline racing is almost dead unfortunately, but I hope that changes soon. There's still a lot of small, but important improvements made by devs just recently. I can't help but notice how polished this game really is on top of so many tracks. I'm able to keep max graphics in 4k and run a solid 120 fps with 50 AI drivers on track. And the AI really shines when you give a chance to train them, you might find them to be very self aware. The devs know there's still work to be done and I can trust them with their future ambitions.\r\n\r\n -Ultrawide HDR 1000Lumins at 120hz\r\nRyzen 9 3900X\r\nRadeon 7900XTX\r\nRam @ 3600",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I need to admit it: Automobilista 2 is my prime simracer right after Assetto Corsa 1 (that's another universe).\r\n\r\nSo I recommend it? Yes, \r\n\r\n...\r\n\r\n-> BUT <- \r\n\r\nThis very case seems to me almost criminal. Let me explain, I mean, Reiza has one of the best rosters of cars, they excels on the passion, dedication and efforts they put into this game, packaged with true care and attention to detail, a truly hommage to motorsport history, specially when it comes to F1 history. Historical tracks are also beautifully recreated; handling, FFB and physics are (for me) god, I love how it feels, and also sounds and looks good, what it's natural due to their Project Cars 2 DNA. This is my confort game, what I return everytime I need to disconnec-Oh, yes, the -> BUT <- thing...\r\n*Cof, cof*\r\n*Clears her throat*^\r\nWell... I CAN'T BELIEVE REIZA HAS COOKED ALL THESE INGREDIENTS ALL TOGETHER SINCE 2020 -> BUT <- THEY DON'T EVEN CARE (at least at the moment) ABOUT AN COMPETITIVE ONLINE SYSTEM. Gosh, they have it already! If it have it implemented, it would be one of the best simracers out there. This is very very sad. :( \r\n\r\nI hope this -> BUT <- will be nothing in the future, I trully hope it. So I recommend it? Again, YES, absolutely... -> BUT <-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best sims for classic endurance racing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let's ride\r\n\r\nLavender Lamborghini, roll up in a blue bikini\r\nBitches on the beaches, lookin' super cute and freaky\r\nAll my friends are princesses, we keep it whipped and creamy\r\nIce cubes on our tongues because we like to keep it freezy\r\nLavender Lamborghini, get out on the right side\r\nChauffeur stayed at home because my girl wanted to ride\r\nLookin' luxe and tastin' plush, I'm feelin' so alive\r\nWanna take it to the highway, come on, let's go for a drive, uh\r\n\r\nAll my life, I've been waitin' for a good time, a good time (Let me ride, let me ride)\r\nAll my life, I've been waitin' for a good time, a good time\r\nSo let me ride, let me ride (Let me ride, let me ride)\r\nAll my life, I've been waitin' for a good time\r\nSo let's ride\r\n\r\n(Vroom, vroom) Bitches know they can't catch me\r\n(Vroom, vroom) Cute, sexy and my ride's sporty\r\n(Vroom, vroom) Those slugs know they can't catch me\r\n(Vroom, vroom) Beep, beep, so let's ride\r\n(Vroom, vroom) Bitches know they can't catch me\r\n(Vroom, vroom) Cute, sexy and my ride's sporty\r\n(Vroom, vroom) Those slugs know they can't catch me\r\n(Vroom, vroom) Beep, beep, so let's ride\r\n\r\nLet's ride\r\nLet's ride\r\nLet's ride\r\nLet's ride\r\n\r\nBubblegum-pink Ferrari, yeah, I'm so bossy\r\nSpeedin' like Alonso just to crash your party\r\nPeople are goin' loco when I'm pullin' up, takin' your papi\r\nDon't think about consequences 'cause they're never gonna stop me, what?\r\n\r\nAll my life, I've been waitin' for a good time, a good time (Let me ride, let me ride)\r\nAll my life, I've been waitin' for a good time, a good time\r\nSo let me ride, let me ride (Let me ride, let me ride)\r\nAll my life, I've been waitin' for a good time\r\nSo let's ride\r\n\r\n(Vroom, vroom) Bitches know they can't catch me\r\n(Vroom, vroom) Cute, sexy and my ride's sporty\r\n(Vroom, vroom) Those slugs know they can't catch me\r\n(Vroom, vroom) Beep, beep, so let's ride\r\n(Vroom, vroom) Bitches know they can't catch me\r\n(Vroom, vroom) Cute, sexy and my ride's sporty\r\n(Vroom, vroom) Those slugs know they can't catch me\r\n(Vroom, vroom) Beep, beep, so let's ride\r\n\r\nBoom, boom, boom\r\nHear me comin' through the radio (Radio)\r\nWatch me go zoom, zoom, zoom\r\nTryin' to catch me, but you're too slow\r\nBoom, boom, boom\r\nHear me comin' through the radio (Know they can't catch me)\r\nWatch me go zoom, zoom, zoom (Know they can't catch me)\r\nTry to catch me, but you're too slow\r\nToo slow, too slow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this alot.  I bought a Moza 5 wheel and pedal set and I haven't been able to get it connected since last March!  So, Im back to Iracing fulltime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't watch the replay after your 1 hour race because the game will crash.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the only sim racer that actually feels good to race on controller.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun sim , especially love the variety of cars and how easy its is to get online race.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great visuals, well optimized and a nice array of tracks and cars to choose from.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is Great and opponent AI is decent. Going through the menu layout and vehicle selection has bugs and is not laptop surface mouse friendly. I enjoy the improvements from my initial purchase once the updates kicked in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "better than most racing sims and plenty of tracks / cars to try out. Good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "most underrated sim, easiest to hop in with friends and create a custom race.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not a fan of simulation racers but this one just feels different. I love that it's still being updated and new content is continuing to be released.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you are looking to play a racing game through VR, this is the one. A lot of people will make the case that Assetto Corsa is the one for realism etc, but this is the game to play through VR for excitement and fun. Is it exactly like real life. Has the feedback that some of the simulators do, no. But it's 8/10 against them, whereas the VR experience if this is a 9/10 they are a 4/10. You'll not be disappointed if VR is what you're looking for. Epic",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My favorite racing simulator.\nDiverse collection of cars and series, good selection of tracks, entertaining AI and great VR-performance.\n\nMost importantly, supports AI opponents in multiplayer lobbies, enabling fun racing against AI with friends.\n\nUpcoming Career mode promises more of good things, and if Reiza keeps on coming with new Car and Track DLCs, I'll be happy for years to come.\nNow if only the game would still get the Alfa Romeo 155 V6 TI DTM car... :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think it is the most realistic traction feeling sim with assetto corsa EVO. You can feel the tires on the track and the edherance almost like a real car. Some other sims have too much traction which is not realistic and others, you feel like you are on the ice... but this one is perfect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoy the variety of cars and tracks. The FFB is good, and the output telemetry works great with my bass shakers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's just fun... I have played iRacing, LMU, ACC, ACE and I always come back. The cars, the tracks, the frequent updates. The fact that they are always improving the physics and improving the game speaks volumes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Edit: after add more in Mechanical Damper in SimPro game/ffb is playable. Game is very well optimized and tyre model is decent, but little floaty. \n\nAmazing multiclass singleplayer game. \n\nOld: I’m using the Simagic Alpha EVO Sport, the FFB experience has been frustrating. The wheel constantly vibrates and feels like it’s fighting me, even after hours of tuning. I tried both Default and Default+ profiles, lowered Gain and FX, and even tested custom FFB files — nothing stopped the buzzing and unnatural resistance. The base is overly sensitive and turns every road texture into harsh vibrations, making it more tiring than immersive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Only modern racing sim (simcade) to have built-in Private Servers with the option to add AI.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "way better than AC not a goddamn subscription like iRacing and ai is very good the demo is HORRIBLY outdated and useless",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have been a fan of classic f1, now i can race against senna",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Heaps of fun on a wheel.  There's no career mode yet, but there are heaps of cars and tracks to keep you busy for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "UNA FOKIN MASA, lastima la AI que es medio pelotuda",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a fun, somewhat easy to drive 'sim' with a controller. Nice!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "alright racing game, but you guys have time to pump out hundred of dollars of DLC but you can't implement a career mode? god knows IF it ever comes, it'll be DLC too lol.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "I want to love this game because it has a lot of cars and tracks with decent graphics and sound, but the physics are weird and the force feedback doesn’t give me enough information on how I should drive. I’m not getting the same level of pleasure and satisfaction as I get in iRacing or Assetto Corsa.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are great. VR is fantastic. But what kills me is the physics. They are so unbelievably terrible. It feels like I'm driving on snow and ice the entire time. Rain physics is what does it for me. By far the worst I've played since Bayou Billy on the Sega Genesis. I'd love to give this game a second shot if they improve the physics in future updates.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I cant recommend this game, The game its self is good. But a big problem i run into is that the campaign still isnt out and the game dosnt save your settings for literally everything. Some times it does load saves but most the time it dosnt and at this point im sick of it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is very bad. The keyboard controls are terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gave up trying to get this game to work with my setup so asked for a refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't bind my Asetek wheel. Also really hurt my hand trying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like it I just think it would be funny to give a negative review with over 1200 hours on the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "alright racing game, but you guys have time to pump out hundred of dollars of DLC but you can't implement a career mode? god knows IF it ever comes, it'll be DLC too lol.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Lack of Career Mode is huge issue. Especially if there is Career Mode button in main menu and it's grayed out! If I knew it then I wouldn't be interesten in this game at all.\nAll my favourite tracks are gone and got released as DLC. Instead they brought a lot of Brazilian tracks which I'm not interested into. I'd consider buying DLC but if game would include Career Mode.\nThe reason why Career Mode is so important for me is it's just great introduction to the game. You learn about mechanics and still have feeling you improve more than just repeating custom races. It's just souless.\nReal fun of course begins with multiplayer mode but I'd rather go through at least a little bit ambitious single player mode before I will get ready for multiplayer.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Big time Gran Turismo fan here.  This game has decent graphics, however the collision and weight distribution/steering physics are garbage.  car slides around, even with adequate braking.  if another car is thinking about touching you then you lose the ability to steer through a turn.  lastly, if you collide with a vehicle they just bounce around the track like they weigh nothing.  even at half price, i am likely going to request my money back and return this heap.  deciding factor/big red flag for me, the game is 5 years old, yet career mode has still not been developed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Devs have been promising a career mode since 2020, 5 years later and they still do not have a career mode.\r\n\r\nThere is over 100$ USD in DLC but no career mode...",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Every time they drop an update I have issues with my wheel and pedals and have to spend waaay too much time re- configuring  everything,  I like to be able to jump in when I have the time and start racing, not troubleshoot for hours. \nWHEN I can get the game to work properly with my Logitech G Pro setup the game is great but having to go through so much BS to get there is not worth my time anymore.  I never have any issues with other games like Assetto Corsa (OG) , Dirt Rally 2.0 , EA WRC, Forza Motorsport, they are all good, but this game always seems to screw everything up every time they update it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I hate it, I want to love this game so much. The DLC content historic and current cars and tracks is amazing and better than in any other game. However I cannot get a feel for the cars at all. It feels like im drifting non stop and cannot tell where the grip is compared to other racing titles. I don't know if this is a controller specific thing but its a huge shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game because it has a lot of cars and tracks with decent graphics and sound, but the physics are weird and the force feedback doesn’t give me enough information on how I should drive. I’m not getting the same level of pleasure and satisfaction as I get in iRacing or Assetto Corsa.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are great. VR is fantastic. But what kills me is the physics. They are so unbelievably terrible. It feels like I'm driving on snow and ice the entire time. Rain physics is what does it for me. By far the worst I've played since Bayou Billy on the Sega Genesis. I'd love to give this game a second shot if they improve the physics in future updates.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very bad. The keyboard controls are terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gave up trying to get this game to work with my setup so asked for a refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't bind my Asetek wheel. Also really hurt my hand trying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like it I just think it would be funny to give a negative review with over 1200 hours on the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "alright racing game, but you guys have time to pump out hundred of dollars of DLC but you can't implement a career mode? god knows IF it ever comes, it'll be DLC too lol.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Lack of Career Mode is huge issue. Especially if there is Career Mode button in main menu and it's grayed out! If I knew it then I wouldn't be interesten in this game at all.\nAll my favourite tracks are gone and got released as DLC. Instead they brought a lot of Brazilian tracks which I'm not interested into. I'd consider buying DLC but if game would include Career Mode.\nThe reason why Career Mode is so important for me is it's just great introduction to the game. You learn about mechanics and still have feeling you improve more than just repeating custom races. It's just souless.\nReal fun of course begins with multiplayer mode but I'd rather go through at least a little bit ambitious single player mode before I will get ready for multiplayer.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Big time Gran Turismo fan here.  This game has decent graphics, however the collision and weight distribution/steering physics are garbage.  car slides around, even with adequate braking.  if another car is thinking about touching you then you lose the ability to steer through a turn.  lastly, if you collide with a vehicle they just bounce around the track like they weigh nothing.  even at half price, i am likely going to request my money back and return this heap.  deciding factor/big red flag for me, the game is 5 years old, yet career mode has still not been developed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Devs have been promising a career mode since 2020, 5 years later and they still do not have a career mode.\r\n\r\nThere is over 100$ USD in DLC but no career mode...",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Every time they drop an update I have issues with my wheel and pedals and have to spend waaay too much time re- configuring  everything,  I like to be able to jump in when I have the time and start racing, not troubleshoot for hours. \nWHEN I can get the game to work properly with my Logitech G Pro setup the game is great but having to go through so much BS to get there is not worth my time anymore.  I never have any issues with other games like Assetto Corsa (OG) , Dirt Rally 2.0 , EA WRC, Forza Motorsport, they are all good, but this game always seems to screw everything up every time they update it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I hate it, I want to love this game so much. The DLC content historic and current cars and tracks is amazing and better than in any other game. However I cannot get a feel for the cars at all. It feels like im drifting non stop and cannot tell where the grip is compared to other racing titles. I don't know if this is a controller specific thing but its a huge shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game because it has a lot of cars and tracks with decent graphics and sound, but the physics are weird and the force feedback doesn’t give me enough information on how I should drive. I’m not getting the same level of pleasure and satisfaction as I get in iRacing or Assetto Corsa.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are great. VR is fantastic. But what kills me is the physics. They are so unbelievably terrible. It feels like I'm driving on snow and ice the entire time. Rain physics is what does it for me. By far the worst I've played since Bayou Billy on the Sega Genesis. I'd love to give this game a second shot if they improve the physics in future updates.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very bad. The keyboard controls are terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gave up trying to get this game to work with my setup so asked for a refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't bind my Asetek wheel. Also really hurt my hand trying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like it I just think it would be funny to give a negative review with over 1200 hours on the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "alright racing game, but you guys have time to pump out hundred of dollars of DLC but you can't implement a career mode? god knows IF it ever comes, it'll be DLC too lol.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Lack of Career Mode is huge issue. Especially if there is Career Mode button in main menu and it's grayed out! If I knew it then I wouldn't be interesten in this game at all.\nAll my favourite tracks are gone and got released as DLC. Instead they brought a lot of Brazilian tracks which I'm not interested into. I'd consider buying DLC but if game would include Career Mode.\nThe reason why Career Mode is so important for me is it's just great introduction to the game. You learn about mechanics and still have feeling you improve more than just repeating custom races. It's just souless.\nReal fun of course begins with multiplayer mode but I'd rather go through at least a little bit ambitious single player mode before I will get ready for multiplayer.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Big time Gran Turismo fan here.  This game has decent graphics, however the collision and weight distribution/steering physics are garbage.  car slides around, even with adequate braking.  if another car is thinking about touching you then you lose the ability to steer through a turn.  lastly, if you collide with a vehicle they just bounce around the track like they weigh nothing.  even at half price, i am likely going to request my money back and return this heap.  deciding factor/big red flag for me, the game is 5 years old, yet career mode has still not been developed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Devs have been promising a career mode since 2020, 5 years later and they still do not have a career mode.\r\n\r\nThere is over 100$ USD in DLC but no career mode...",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Every time they drop an update I have issues with my wheel and pedals and have to spend waaay too much time re- configuring  everything,  I like to be able to jump in when I have the time and start racing, not troubleshoot for hours. \nWHEN I can get the game to work properly with my Logitech G Pro setup the game is great but having to go through so much BS to get there is not worth my time anymore.  I never have any issues with other games like Assetto Corsa (OG) , Dirt Rally 2.0 , EA WRC, Forza Motorsport, they are all good, but this game always seems to screw everything up every time they update it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I hate it, I want to love this game so much. The DLC content historic and current cars and tracks is amazing and better than in any other game. However I cannot get a feel for the cars at all. It feels like im drifting non stop and cannot tell where the grip is compared to other racing titles. I don't know if this is a controller specific thing but its a huge shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game because it has a lot of cars and tracks with decent graphics and sound, but the physics are weird and the force feedback doesn’t give me enough information on how I should drive. I’m not getting the same level of pleasure and satisfaction as I get in iRacing or Assetto Corsa.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are great. VR is fantastic. But what kills me is the physics. They are so unbelievably terrible. It feels like I'm driving on snow and ice the entire time. Rain physics is what does it for me. By far the worst I've played since Bayou Billy on the Sega Genesis. I'd love to give this game a second shot if they improve the physics in future updates.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very bad. The keyboard controls are terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gave up trying to get this game to work with my setup so asked for a refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't bind my Asetek wheel. Also really hurt my hand trying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like it I just think it would be funny to give a negative review with over 1200 hours on the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "alright racing game, but you guys have time to pump out hundred of dollars of DLC but you can't implement a career mode? god knows IF it ever comes, it'll be DLC too lol.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Lack of Career Mode is huge issue. Especially if there is Career Mode button in main menu and it's grayed out! If I knew it then I wouldn't be interesten in this game at all.\nAll my favourite tracks are gone and got released as DLC. Instead they brought a lot of Brazilian tracks which I'm not interested into. I'd consider buying DLC but if game would include Career Mode.\nThe reason why Career Mode is so important for me is it's just great introduction to the game. You learn about mechanics and still have feeling you improve more than just repeating custom races. It's just souless.\nReal fun of course begins with multiplayer mode but I'd rather go through at least a little bit ambitious single player mode before I will get ready for multiplayer.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Big time Gran Turismo fan here.  This game has decent graphics, however the collision and weight distribution/steering physics are garbage.  car slides around, even with adequate braking.  if another car is thinking about touching you then you lose the ability to steer through a turn.  lastly, if you collide with a vehicle they just bounce around the track like they weigh nothing.  even at half price, i am likely going to request my money back and return this heap.  deciding factor/big red flag for me, the game is 5 years old, yet career mode has still not been developed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Devs have been promising a career mode since 2020, 5 years later and they still do not have a career mode.\r\n\r\nThere is over 100$ USD in DLC but no career mode...",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Every time they drop an update I have issues with my wheel and pedals and have to spend waaay too much time re- configuring  everything,  I like to be able to jump in when I have the time and start racing, not troubleshoot for hours. \nWHEN I can get the game to work properly with my Logitech G Pro setup the game is great but having to go through so much BS to get there is not worth my time anymore.  I never have any issues with other games like Assetto Corsa (OG) , Dirt Rally 2.0 , EA WRC, Forza Motorsport, they are all good, but this game always seems to screw everything up every time they update it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I hate it, I want to love this game so much. The DLC content historic and current cars and tracks is amazing and better than in any other game. However I cannot get a feel for the cars at all. It feels like im drifting non stop and cannot tell where the grip is compared to other racing titles. I don't know if this is a controller specific thing but its a huge shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game because it has a lot of cars and tracks with decent graphics and sound, but the physics are weird and the force feedback doesn’t give me enough information on how I should drive. I’m not getting the same level of pleasure and satisfaction as I get in iRacing or Assetto Corsa.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are great. VR is fantastic. But what kills me is the physics. They are so unbelievably terrible. It feels like I'm driving on snow and ice the entire time. Rain physics is what does it for me. By far the worst I've played since Bayou Billy on the Sega Genesis. I'd love to give this game a second shot if they improve the physics in future updates.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very bad. The keyboard controls are terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gave up trying to get this game to work with my setup so asked for a refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't bind my Asetek wheel. Also really hurt my hand trying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like it I just think it would be funny to give a negative review with over 1200 hours on the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "alright racing game, but you guys have time to pump out hundred of dollars of DLC but you can't implement a career mode? god knows IF it ever comes, it'll be DLC too lol.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Lack of Career Mode is huge issue. Especially if there is Career Mode button in main menu and it's grayed out! If I knew it then I wouldn't be interesten in this game at all.\nAll my favourite tracks are gone and got released as DLC. Instead they brought a lot of Brazilian tracks which I'm not interested into. I'd consider buying DLC but if game would include Career Mode.\nThe reason why Career Mode is so important for me is it's just great introduction to the game. You learn about mechanics and still have feeling you improve more than just repeating custom races. It's just souless.\nReal fun of course begins with multiplayer mode but I'd rather go through at least a little bit ambitious single player mode before I will get ready for multiplayer.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Big time Gran Turismo fan here.  This game has decent graphics, however the collision and weight distribution/steering physics are garbage.  car slides around, even with adequate braking.  if another car is thinking about touching you then you lose the ability to steer through a turn.  lastly, if you collide with a vehicle they just bounce around the track like they weigh nothing.  even at half price, i am likely going to request my money back and return this heap.  deciding factor/big red flag for me, the game is 5 years old, yet career mode has still not been developed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Devs have been promising a career mode since 2020, 5 years later and they still do not have a career mode.\r\n\r\nThere is over 100$ USD in DLC but no career mode...",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Every time they drop an update I have issues with my wheel and pedals and have to spend waaay too much time re- configuring  everything,  I like to be able to jump in when I have the time and start racing, not troubleshoot for hours. \nWHEN I can get the game to work properly with my Logitech G Pro setup the game is great but having to go through so much BS to get there is not worth my time anymore.  I never have any issues with other games like Assetto Corsa (OG) , Dirt Rally 2.0 , EA WRC, Forza Motorsport, they are all good, but this game always seems to screw everything up every time they update it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I hate it, I want to love this game so much. The DLC content historic and current cars and tracks is amazing and better than in any other game. However I cannot get a feel for the cars at all. It feels like im drifting non stop and cannot tell where the grip is compared to other racing titles. I don't know if this is a controller specific thing but its a huge shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game because it has a lot of cars and tracks with decent graphics and sound, but the physics are weird and the force feedback doesn’t give me enough information on how I should drive. I’m not getting the same level of pleasure and satisfaction as I get in iRacing or Assetto Corsa.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are great. VR is fantastic. But what kills me is the physics. They are so unbelievably terrible. It feels like I'm driving on snow and ice the entire time. Rain physics is what does it for me. By far the worst I've played since Bayou Billy on the Sega Genesis. I'd love to give this game a second shot if they improve the physics in future updates.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very bad. The keyboard controls are terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gave up trying to get this game to work with my setup so asked for a refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't bind my Asetek wheel. Also really hurt my hand trying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like it I just think it would be funny to give a negative review with over 1200 hours on the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "alright racing game, but you guys have time to pump out hundred of dollars of DLC but you can't implement a career mode? god knows IF it ever comes, it'll be DLC too lol.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Lack of Career Mode is huge issue. Especially if there is Career Mode button in main menu and it's grayed out! If I knew it then I wouldn't be interesten in this game at all.\nAll my favourite tracks are gone and got released as DLC. Instead they brought a lot of Brazilian tracks which I'm not interested into. I'd consider buying DLC but if game would include Career Mode.\nThe reason why Career Mode is so important for me is it's just great introduction to the game. You learn about mechanics and still have feeling you improve more than just repeating custom races. It's just souless.\nReal fun of course begins with multiplayer mode but I'd rather go through at least a little bit ambitious single player mode before I will get ready for multiplayer.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Big time Gran Turismo fan here.  This game has decent graphics, however the collision and weight distribution/steering physics are garbage.  car slides around, even with adequate braking.  if another car is thinking about touching you then you lose the ability to steer through a turn.  lastly, if you collide with a vehicle they just bounce around the track like they weigh nothing.  even at half price, i am likely going to request my money back and return this heap.  deciding factor/big red flag for me, the game is 5 years old, yet career mode has still not been developed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Devs have been promising a career mode since 2020, 5 years later and they still do not have a career mode.\r\n\r\nThere is over 100$ USD in DLC but no career mode...",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Every time they drop an update I have issues with my wheel and pedals and have to spend waaay too much time re- configuring  everything,  I like to be able to jump in when I have the time and start racing, not troubleshoot for hours. \nWHEN I can get the game to work properly with my Logitech G Pro setup the game is great but having to go through so much BS to get there is not worth my time anymore.  I never have any issues with other games like Assetto Corsa (OG) , Dirt Rally 2.0 , EA WRC, Forza Motorsport, they are all good, but this game always seems to screw everything up every time they update it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I hate it, I want to love this game so much. The DLC content historic and current cars and tracks is amazing and better than in any other game. However I cannot get a feel for the cars at all. It feels like im drifting non stop and cannot tell where the grip is compared to other racing titles. I don't know if this is a controller specific thing but its a huge shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game because it has a lot of cars and tracks with decent graphics and sound, but the physics are weird and the force feedback doesn’t give me enough information on how I should drive. I’m not getting the same level of pleasure and satisfaction as I get in iRacing or Assetto Corsa.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are great. VR is fantastic. But what kills me is the physics. They are so unbelievably terrible. It feels like I'm driving on snow and ice the entire time. Rain physics is what does it for me. By far the worst I've played since Bayou Billy on the Sega Genesis. I'd love to give this game a second shot if they improve the physics in future updates.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very bad. The keyboard controls are terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gave up trying to get this game to work with my setup so asked for a refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't bind my Asetek wheel. Also really hurt my hand trying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like it I just think it would be funny to give a negative review with over 1200 hours on the game.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}