{
  "positive": [
    {
      "review": "great game. since it's not being updated anymore, it is kinda held up by mods.\r\n\r\ncore gameplay loop is fun, but some nations in the campaign mode are much more difficult than others to start (germany is much harder to campaign than france, for example)\r\n\r\nif you do decide to try the campaign mode, some tips:\r\n\r\n-make fast ships, as speed also affects how many turns your ships take to go places\r\n-fight wars one at a time. you can tell the gov. not to threaten war of you dont want to\r\n-at the start of the campaign (turn 0 if you will), all ships you build are completed immediately. this changes starting turn 1, so build lots of ships first, as they will be fully stocked and crewed too\r\n-start early, i recommend 1910 for any nation. your shipbuilding capacity will limit you on what hulls you can use and how big your ships can be, even if they aren't capped (CA weight limit at 16500 tonnes, for example). you can build this up in the finances tab.\r\n-start on easy. TRUST ME, IT'S WORTH IT!\r\n-make at least one alliance that's not in your home region (europe, america, asia), you can use their ports to resupply and repair, and they can use yours too.\r\n-try and take at least one canal quickly (suez, kiel, panama, etc.). it gives you lots of much appreciated control late game\r\n\r\nthe campaign only last until DEC 1965, so have fun, and try to gain as much safe glory as you can.\r\n\r\noh, and when you complete a campaign, it deletes the save file for it.\r\n\r\ncustom battles is the main reason you buy this game, as you have access to everything, and can use parts from other nations if you turn on unlock: all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "immensely addicting,Immersive, deep Naval warfare game. it is designed for the detail oriented person. it is so satisfying to design and build your own ship and watch it succeed against rival navies. however you are only Chief of the Navy. you can suggest a path to your government but they may ignore you. beware overbuilding. you can get fired for running out of money or losing in battles or because the government just loses faith in you. The game spans from the 1890`s to the 1960`s.  Huge changes in tech and tactics evolve and you must keep up or head for the Unemployment Lines. Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've loved every second i have played on ultimate admiral dreadnoughts although there are some things that i wish were slightly diffrent but there are mods out there to mix that although for people new to moding its a little diffacult to figure out but still love this game and deffintly recommend\r\n(sorry for terrible spelling)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a perfect game.  Sometimes an infuriating game.  But you can design your own ships and then sail them out and fight other ships.  That's very satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very cool and fun. I don't know how to get my ships to move where i want them to when they are in a formation, but the AI controls are decent and you can target ships manually if you need to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, dont listen to the critiques if you loved the naval combat from total war napoleon and empire, but want way more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it works fine and its great so yeah get it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sandbox is good, campaign... not so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its so cool control US marine!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Belli Dura Despicio",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's hard, i like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BATTLESHIPS, FULL BROADSIDE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "boat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love late age of steam and steel naval history, and have studied the tactics, ships, etc. of that period, this will scratch a particular itch for you no other game ever will.  It has issues, sure, and doesn't 100% accurately reflect history, but that's fine.  It's a video game; not a history book or documentary.\r\n\r\nIt gives you that *feel* of designing these behemoths and their support ships, of finding the balance of speed, armor and firepower, etc.  It asks you to make decisions like, \"Is this ship worth refitting, or should I scrap it, for instance.  This kind of question often comes up at moments when a war is definitely coming, or even ongoing.  So even though it's going to have limited utility, that hull may actually still make a difference with just a few upgrades, or might get sunk the first time it encounters stiff resistance.\r\n\r\nThe whole game is about making those decisions constantly, and while the combat is actually pretty excellent for what it is, once you grasp the nature of naval combat of this era, you'll find that it's very, very frequently your ship's designs and your overarching, admiral-level decisions that bring about victory or defeat.\r\n\r\nDid you balance the trifecta of speed, defense, and offense effectively?  Did you research the right technologies?  Did you allot your resources in a way that let you keep up with the technology of the adversary you now have to face?  Should you have put some of those resources you used to build two giant battleships into maybe more destroyers and light cruisers to give yourself better sea control, or will your two monsters showing up let you devastate the enemy fleet to such an extent they justify that expenditure?\r\n\r\nThere are more detailed sims of this type, but none that feel this satisfying.  This is the only one that gives you that graphical, 3D image of a turret being blown nearly into orbit after a magazine detonation, or of just sitting and looking at this *thing* -- this floating war crime -- that you designed.  That also has the effect of making it feel legitimately painful when you see one sinking; it hits your pride to know that you spent the brainpower, time, and in-game resources to create this beast that is now simply gone.\r\n\r\nThe design process itself is immensely fun; the game's greatest asset.  Ship components are based off their respective navies' actual designs, but allow for so much rearrangement that you can really come up with some interesting what-ifs, like, \"What if the BIsmarcks had three triples instead of four twins?\"  It also tends to teach you that history created the ships it did for reasons.  There's a definite advantage, in the endgame, to the general configuration used for the Yamato and Iowa class; the classic, \"Fast Battleships,\" for instance.  That doesn't mean you have to use that configuration, though.  You can do something wild, and might be shocked at how well it works.  Want to use a battleship hull to build what amounts to a slow, heavily armored, 20-inch gun Monitor?  Nothing's stopping you except whether you've developed the tech.\r\n\r\nI'll probably end up with at least another thousand hours in this game before I hang it up for good, and still might find myself coming back to it for a quick jaunt from time to time long after that.  It's just that good at being what it is.  If you love this period of naval history, you can't go wrong here.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "All the negative reviews talking about how the developer shut down are missing the point. It's actually a good thing that game labs shut down and heres why.\n\nBecause there are no more patches this game is now a stable base for modders to pick up where the developers left off. The patches were not good for a long time and generally caused more problems than they solved.\n\nI recommend not playing vanilla and using the dreadnought improvement project mod by BrotherMunro.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "I wish voting was on a scale rather than the y/n that Steam provides, because then I would give it a 3/5. I bought this game for the ship builder which I found to be lacking and restrictive, but kept playing it for the campaign. \n\n[b] TLDR: If you want a shipbuilder, [u]skip this one[/u], but if you want a cool campaign then it's fine (though you should probably use a modded version of the game to fix the AI's poor balancing) [/b]\n\nIt's worth mentioning that I have also only played the game with the \"Dreadnoughts Improvement Project\" mod as I was told to steer away from Vanilla due to it's ineffective AI, so all of my opinions are with that in mind. \n\nLet's start with the pros:\n- I've found the campaigns pretty fun, it feels like a naval version of Empire at War. It's worth mentioning that it's only worth playing at the hardest difficulty or else the AI will struggle to replace losses in battle. But the actual battles are really fun and so is managing all your fleets and ships on the map mode. I have heard that the AI is even worse in Vanilla but I haven't played with Vanilla\n- Battles on the Tactical level level are really fun, I like seeing my ships shoot things and when you actually concentrate a ton of battleships into a line formation against the enemy it is super satisfying \n- The game can be played over a 60 year span (1890-1950) and actually features playable nations like the Qing Dynasty (which is always ignored in most games like this)\n\nAnd now for the cons:\n- When it comes to the ship builder, I was disappointed. It's very restrictive and forces you to a few different hulls with specific snap points and doesn't like to let you go unconventional. The trailer is misleading. You can't really freely choose the exact shape of the hull and max displacement is tied with length when it should be a combination of length/width/beam. Nevertheless, there are a surprisingly large amount of different hulls with more than a few uniquely designed for specific nations and their building styles of the time. \n- The ship designer feels really clunky, sort of like some of the early Sprocket versions except Sprocket actually got way better and became what all of these in depth sandboxes should strive to be. If this game could follow a similar path it could become much better, but that seems unlikely due to drama with the production team. Currently, the designer almost feels like a chore to work with, I don't really have fun due to how it restricts my creativity and it still takes me an exhaustively long time to design vessels\n- There really needs to be a way to export my designs from the campaign to the shared designs, I want to be able to see my ships in use by AI nations during other campaigns but don't want to spend hours essentially reconstructing all of my ships a second time in the designer\n- This is a minor gripe but the map view cuts at the center of the Pacific. While this isn't game-breaking, ships can still teleport across the gap from the left side of the map to the right, but it's definitely very irritating and distracting. An infinitely scrollable map like in HOI4 would've been much better\n- A multiplayer mode is sold seperately as a DLC. I wasn't planning on playing with multiplayer but that alone feels scummy and held me off from purchasing the game for a long while because I didn't like where the morals of the studio were at.\n- The game has good bones and a lot of the major work has already been put in place. It has potential to be really good, but I doubt that the production team will put more effort into it, especially with them announcing a 'last update' already. We will likely have to rely on modders to make the game better.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "despite the game no longer getting updates it is fun however ai is unbalnced at times so play custom battles for a while",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i become germany\ntake europe and half the ussr and britian\nbefriend USA\nbuild more bismarks than i have destroyers \nearn 11 billion a month\nmake the bismark look like a torpedo boat compared to it\ngets fucked over by italy by killing 40 of my ships\nsends my whole fleet\nevery country now pays me to not go to war with them\n10/10 game",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Honestly, if you love early 20th century naval warfare, or anything up to the 60's definently get this game, was worth the 30 bucks",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "great game. since it's not being updated anymore, it is kinda held up by mods.\r\n\r\ncore gameplay loop is fun, but some nations in the campaign mode are much more difficult than others to start (germany is much harder to campaign than france, for example)\r\n\r\nif you do decide to try the campaign mode, some tips:\r\n\r\n-make fast ships, as speed also affects how many turns your ships take to go places\r\n-fight wars one at a time. you can tell the gov. not to threaten war of you dont want to\r\n-at the start of the campaign (turn 0 if you will), all ships you build are completed immediately. this changes starting turn 1, so build lots of ships first, as they will be fully stocked and crewed too\r\n-start early, i recommend 1910 for any nation. your shipbuilding capacity will limit you on what hulls you can use and how big your ships can be, even if they aren't capped (CA weight limit at 16500 tonnes, for example). you can build this up in the finances tab.\r\n-start on easy. TRUST ME, IT'S WORTH IT!\r\n-make at least one alliance that's not in your home region (europe, america, asia), you can use their ports to resupply and repair, and they can use yours too.\r\n-try and take at least one canal quickly (suez, kiel, panama, etc.). it gives you lots of much appreciated control late game\r\n\r\nthe campaign only last until DEC 1965, so have fun, and try to gain as much safe glory as you can.\r\n\r\noh, and when you complete a campaign, it deletes the save file for it.\r\n\r\ncustom battles is the main reason you buy this game, as you have access to everything, and can use parts from other nations if you turn on unlock: all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun little game of wit and madness with sprinkles of autistic delight! If you're into strategy, heavy metal, and taking over the world in the great tradition of Pinky and the Brain, this is your stop!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic naval strategy game! Hundreds of hours played and each time yields a new challenge or interesting battle. Highly recommend this game if you love building.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "immensely addicting,Immersive, deep Naval warfare game. it is designed for the detail oriented person. it is so satisfying to design and build your own ship and watch it succeed against rival navies. however you are only Chief of the Navy. you can suggest a path to your government but they may ignore you. beware overbuilding. you can get fired for running out of money or losing in battles or because the government just loses faith in you. The game spans from the 1890`s to the 1960`s.  Huge changes in tech and tactics evolve and you must keep up or head for the Unemployment Lines. Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've loved every second i have played on ultimate admiral dreadnoughts although there are some things that i wish were slightly diffrent but there are mods out there to mix that although for people new to moding its a little diffacult to figure out but still love this game and deffintly recommend\r\n(sorry for terrible spelling)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a perfect game.  Sometimes an infuriating game.  But you can design your own ships and then sail them out and fight other ships.  That's very satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very cool and fun. I don't know how to get my ships to move where i want them to when they are in a formation, but the AI controls are decent and you can target ships manually if you need to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, happy combination of:\nrelaxing (when your enemies are stricken and you send out a pair of light cruisers to raid their ports); \ninvolving (making a 1000 little adjustments and compromises to design the best ship for its role);\nchallenging (playing as a weaker country and... trying to survive your first 10 years or so...!) and;\ngreat fun (using your little creations to blast huge chunks out of the enemy battleships, dodging torpedoes, launching your monstrous new dreadnought on an unsuspecting foe...!). \n\n10/10; I usually play with DIP mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely loved it. ability to make real life ships and your own custom designs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "altogh this game has some problems and things it could improve it is still one of if not my favorit game of all time, such a shame it no longer gets any updates. Worth every peny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is \"early access\" - it was never finished even though it was released. It has lots of bugs and crashes. They are consistent so once you learn them you can avoid them. I bought this knowing what I was getting into, there's really no other game like this one out there. So buyer beware.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It feels like putting a needle through a hole playing the sotry mode(I think that's not wat it's called). \r\n\r\nI like it when my battleship armada misses all it's shots and my torpedoes just don't explode \r\n\r\ndefinitely 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is unique, I really enjoy it. \n\nHowever it needs a lot more development and we are not going to see that since the devs left it to its fate.\n\nIf it does not bother you that the game is like 70% finished, give it a try because it is fun in my pov.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So close yet so far...\r\n\r\nI'm torn that there are no more updates. Its still fun yet so incomplete. Perhaps it'll be better on the next one boys. :'(",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not much to say. Perfect game. You build it, you battle it. Rinse repeat. Fun every time. We a 'Build-your-boat' title for the age of sail though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it wary intresting, low it alot.\ndo miss coop motiplayer and mod suport",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would highly recommend this game. If you like strategy games than this is an outstanding one in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big guns on Big Boats, nothing more needs to be said.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've put 4000+ hours into it, ive had way more fun than I've had with most other games",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "i  think its good cuz you can desgin ships (sorry for the bad spelling).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "boat. boat go boom. boat game. boat good",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Personally one of my favorite video games of all time hopefully see UAD2 at some point because I loved every second  of playing this game and to be frank there is not a another game that offers the same experience so kind of said to see the end of future development for this game. But if you want to research tech balance funding and building new cutting edge vessels vs building as many cheap glass cannons as you can than this the game for you. I love nothing more than catching a large enemy force out at sea with superior tech and design to send them to the bottom of the ocean. Would happily invest thousands of dollars to see second version of this tittle come out in the next few years. 10 out 10 would recommend if you are a naval nerd looking for a somewhat casual experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cuts right to what i was looking for in a game!  Hats off to the team and I would love to see continued updates or even a version 2.  Love the modeling!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic Game. Love building the ships and seeing how they do against the enemy. Sometimes good sometimes bad. Anyone who likes building warships and playing a game where the economy matters and happiness matters and actually fighting the battles I highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, dont listen to the critiques if you loved the naval combat from total war napoleon and empire, but want way more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I built Yamato and won my first 1v1.  Yeah, Yammy is OP.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a fun game but defiantly wait for a sale if you plan on buying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun and it scratches an itch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HELP ME I CAN'T ESCAPE THIS GAME\n\nSAVE YOURSELVES BEFORE ITS TOO LATE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it works fine and its great so yeah get it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sandbox is good, campaign... not so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "laggy but fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its so cool control US marine!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Belli Dura Despicio",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "built very french boat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's hard, i like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BATTLESHIPS, FULL BROADSIDE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "boat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game but you need a nice pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very fun game to play 9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "feet are yummy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love late age of steam and steel naval history, and have studied the tactics, ships, etc. of that period, this will scratch a particular itch for you no other game ever will.  It has issues, sure, and doesn't 100% accurately reflect history, but that's fine.  It's a video game; not a history book or documentary.\r\n\r\nIt gives you that *feel* of designing these behemoths and their support ships, of finding the balance of speed, armor and firepower, etc.  It asks you to make decisions like, \"Is this ship worth refitting, or should I scrap it, for instance.  This kind of question often comes up at moments when a war is definitely coming, or even ongoing.  So even though it's going to have limited utility, that hull may actually still make a difference with just a few upgrades, or might get sunk the first time it encounters stiff resistance.\r\n\r\nThe whole game is about making those decisions constantly, and while the combat is actually pretty excellent for what it is, once you grasp the nature of naval combat of this era, you'll find that it's very, very frequently your ship's designs and your overarching, admiral-level decisions that bring about victory or defeat.\r\n\r\nDid you balance the trifecta of speed, defense, and offense effectively?  Did you research the right technologies?  Did you allot your resources in a way that let you keep up with the technology of the adversary you now have to face?  Should you have put some of those resources you used to build two giant battleships into maybe more destroyers and light cruisers to give yourself better sea control, or will your two monsters showing up let you devastate the enemy fleet to such an extent they justify that expenditure?\r\n\r\nThere are more detailed sims of this type, but none that feel this satisfying.  This is the only one that gives you that graphical, 3D image of a turret being blown nearly into orbit after a magazine detonation, or of just sitting and looking at this *thing* -- this floating war crime -- that you designed.  That also has the effect of making it feel legitimately painful when you see one sinking; it hits your pride to know that you spent the brainpower, time, and in-game resources to create this beast that is now simply gone.\r\n\r\nThe design process itself is immensely fun; the game's greatest asset.  Ship components are based off their respective navies' actual designs, but allow for so much rearrangement that you can really come up with some interesting what-ifs, like, \"What if the BIsmarcks had three triples instead of four twins?\"  It also tends to teach you that history created the ships it did for reasons.  There's a definite advantage, in the endgame, to the general configuration used for the Yamato and Iowa class; the classic, \"Fast Battleships,\" for instance.  That doesn't mean you have to use that configuration, though.  You can do something wild, and might be shocked at how well it works.  Want to use a battleship hull to build what amounts to a slow, heavily armored, 20-inch gun Monitor?  Nothing's stopping you except whether you've developed the tech.\r\n\r\nI'll probably end up with at least another thousand hours in this game before I hang it up for good, and still might find myself coming back to it for a quick jaunt from time to time long after that.  It's just that good at being what it is.  If you love this period of naval history, you can't go wrong here.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "All the negative reviews talking about how the developer shut down are missing the point. It's actually a good thing that game labs shut down and heres why.\n\nBecause there are no more patches this game is now a stable base for modders to pick up where the developers left off. The patches were not good for a long time and generally caused more problems than they solved.\n\nI recommend not playing vanilla and using the dreadnought improvement project mod by BrotherMunro.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "I wish voting was on a scale rather than the y/n that Steam provides, because then I would give it a 3/5. I bought this game for the ship builder which I found to be lacking and restrictive, but kept playing it for the campaign. \n\n[b] TLDR: If you want a shipbuilder, [u]skip this one[/u], but if you want a cool campaign then it's fine (though you should probably use a modded version of the game to fix the AI's poor balancing) [/b]\n\nIt's worth mentioning that I have also only played the game with the \"Dreadnoughts Improvement Project\" mod as I was told to steer away from Vanilla due to it's ineffective AI, so all of my opinions are with that in mind. \n\nLet's start with the pros:\n- I've found the campaigns pretty fun, it feels like a naval version of Empire at War. It's worth mentioning that it's only worth playing at the hardest difficulty or else the AI will struggle to replace losses in battle. But the actual battles are really fun and so is managing all your fleets and ships on the map mode. I have heard that the AI is even worse in Vanilla but I haven't played with Vanilla\n- Battles on the Tactical level level are really fun, I like seeing my ships shoot things and when you actually concentrate a ton of battleships into a line formation against the enemy it is super satisfying \n- The game can be played over a 60 year span (1890-1950) and actually features playable nations like the Qing Dynasty (which is always ignored in most games like this)\n\nAnd now for the cons:\n- When it comes to the ship builder, I was disappointed. It's very restrictive and forces you to a few different hulls with specific snap points and doesn't like to let you go unconventional. The trailer is misleading. You can't really freely choose the exact shape of the hull and max displacement is tied with length when it should be a combination of length/width/beam. Nevertheless, there are a surprisingly large amount of different hulls with more than a few uniquely designed for specific nations and their building styles of the time. \n- The ship designer feels really clunky, sort of like some of the early Sprocket versions except Sprocket actually got way better and became what all of these in depth sandboxes should strive to be. If this game could follow a similar path it could become much better, but that seems unlikely due to drama with the production team. Currently, the designer almost feels like a chore to work with, I don't really have fun due to how it restricts my creativity and it still takes me an exhaustively long time to design vessels\n- There really needs to be a way to export my designs from the campaign to the shared designs, I want to be able to see my ships in use by AI nations during other campaigns but don't want to spend hours essentially reconstructing all of my ships a second time in the designer\n- This is a minor gripe but the map view cuts at the center of the Pacific. While this isn't game-breaking, ships can still teleport across the gap from the left side of the map to the right, but it's definitely very irritating and distracting. An infinitely scrollable map like in HOI4 would've been much better\n- A multiplayer mode is sold seperately as a DLC. I wasn't planning on playing with multiplayer but that alone feels scummy and held me off from purchasing the game for a long while because I didn't like where the morals of the studio were at.\n- The game has good bones and a lot of the major work has already been put in place. It has potential to be really good, but I doubt that the production team will put more effort into it, especially with them announcing a 'last update' already. We will likely have to rely on modders to make the game better.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "despite the game no longer getting updates it is fun however ai is unbalnced at times so play custom battles for a while",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i become germany\ntake europe and half the ussr and britian\nbefriend USA\nbuild more bismarks than i have destroyers \nearn 11 billion a month\nmake the bismark look like a torpedo boat compared to it\ngets fucked over by italy by killing 40 of my ships\nsends my whole fleet\nevery country now pays me to not go to war with them\n10/10 game",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Honestly, if you love early 20th century naval warfare, or anything up to the 60's definently get this game, was worth the 30 bucks",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "great game. since it's not being updated anymore, it is kinda held up by mods.\r\n\r\ncore gameplay loop is fun, but some nations in the campaign mode are much more difficult than others to start (germany is much harder to campaign than france, for example)\r\n\r\nif you do decide to try the campaign mode, some tips:\r\n\r\n-make fast ships, as speed also affects how many turns your ships take to go places\r\n-fight wars one at a time. you can tell the gov. not to threaten war of you dont want to\r\n-at the start of the campaign (turn 0 if you will), all ships you build are completed immediately. this changes starting turn 1, so build lots of ships first, as they will be fully stocked and crewed too\r\n-start early, i recommend 1910 for any nation. your shipbuilding capacity will limit you on what hulls you can use and how big your ships can be, even if they aren't capped (CA weight limit at 16500 tonnes, for example). you can build this up in the finances tab.\r\n-start on easy. TRUST ME, IT'S WORTH IT!\r\n-make at least one alliance that's not in your home region (europe, america, asia), you can use their ports to resupply and repair, and they can use yours too.\r\n-try and take at least one canal quickly (suez, kiel, panama, etc.). it gives you lots of much appreciated control late game\r\n\r\nthe campaign only last until DEC 1965, so have fun, and try to gain as much safe glory as you can.\r\n\r\noh, and when you complete a campaign, it deletes the save file for it.\r\n\r\ncustom battles is the main reason you buy this game, as you have access to everything, and can use parts from other nations if you turn on unlock: all",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a fun little game of wit and madness with sprinkles of autistic delight! If you're into strategy, heavy metal, and taking over the world in the great tradition of Pinky and the Brain, this is your stop!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my favorite game, hands down, but it is not a polished or finished game. i have spent more than 1300 hours on this game over the course of 4 years and i love it, however there are still problems.\r\n\r\n1. the ai ship designs are Bad at the best of time \r\n\r\n2. the game runs slow and will often freeze or crash\r\n\r\n3. you there is a ton of RNG  which can completely destroy a run \r\n\r\n4. the game is no longer updated and wasn't finished\r\n\r\ndespite all of that, i still feel this a good game that is extremely fun if a bit infuriating. the ship combat is fun and tense. the ship design is both simple and easy while still having lots of options and choices, and there is a good mix of turn based and real time strategy. it is completely different from anything else i've played.\r\n\r\nif you are interested in this game and you buy it, do these three things: first play the first tutorial missions.  then after doing that, download one of the Dreadnought improvement project mods (if your wondering what those are look up BrotherMunro, DIP on youtube), and look up some tutorials on the games basics. if you do that or even just play around with the game for a few hours you'll realise that this isn't a flyout or form the depths, but a much more simple but fun game. however its still best experenced with the DIP mods and even then there is still a lot of frustration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall it is a good game. The developers spent some time ensuring accurate  ballistic performance and for the most part the hulls and attachments are historically accurate. There are some issues with the game. Some USA hulls have strange boxes where the superstructure should be. This detracts from the historical feel for those who like to play USA. The second issue is the fleet commands in battle are a little wonky. To center on a  division of a fleet requires a double click but often it combines the fleet into a single unit which requires breaking the fleet into individual ships then reforming it by divisions. A laborious process. Also the player torpedoes seem rather stupid, frequently failing to launch but the AI's torpedoes seem to always launch and are fired by Davy Crocket. In battle unless you hugely outnumber the AI fight you own battles. The AI auto resolve tends to break even or favor the AI. Most experienced players know to fight your own battles but that is the fun of the game anyway.  The ability to build warships is broken. Ship repairs in Puerto Rico count against you ship building tonnage which should be based on continental USA ports. This results in heavy penalties if you exceed the building limit. This SUCKS as ship repairs are auto completed in port and sometimes the ships are auto removed from the fleet and placed in a port. Also, sometimes I need that tonnage for an invasion but now I am short. The most aggravating issue is the AI pulling the players ships out of port on missions during war. That carefully  crafted exactly 100K ton fleet I need for an invasion is now 75K tons and when the ships come back, they typically need repairs so the IA takes other undamaged ships next turn. Now my 100K ton fleet is down to 50K tones and inadequate for the invasion I had planned.  This makes the game more active but overall really SUCKS.. I wish they would add a toggle to turn this off. Theoretically you can change the ships status in port to prevent this but most of the time the AI pulls the ships before the player has a chance to change the ships status. \r\n\r\nOverall this is a god game but needs some tweaks to be a great game. I started playing with beta and the devs did a good job, showed they really tried to get things right. But, they just stopped short of that finale polish to put the game over the top.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "immensely addicting,Immersive, deep Naval warfare game. it is designed for the detail oriented person. it is so satisfying to design and build your own ship and watch it succeed against rival navies. however you are only Chief of the Navy. you can suggest a path to your government but they may ignore you. beware overbuilding. you can get fired for running out of money or losing in battles or because the government just loses faith in you. The game spans from the 1890`s to the 1960`s.  Huge changes in tech and tactics evolve and you must keep up or head for the Unemployment Lines. Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've loved every second i have played on ultimate admiral dreadnoughts although there are some things that i wish were slightly diffrent but there are mods out there to mix that although for people new to moding its a little diffacult to figure out but still love this game and deffintly recommend\r\n(sorry for terrible spelling)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a perfect game.  Sometimes an infuriating game.  But you can design your own ships and then sail them out and fight other ships.  That's very satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very cool and fun. I don't know how to get my ships to move where i want them to when they are in a formation, but the AI controls are decent and you can target ships manually if you need to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, happy combination of:\nrelaxing (when your enemies are stricken and you send out a pair of light cruisers to raid their ports); \ninvolving (making a 1000 little adjustments and compromises to design the best ship for its role);\nchallenging (playing as a weaker country and... trying to survive your first 10 years or so...!) and;\ngreat fun (using your little creations to blast huge chunks out of the enemy battleships, dodging torpedoes, launching your monstrous new dreadnought on an unsuspecting foe...!). \n\n10/10; I usually play with DIP mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely loved it. ability to make real life ships and your own custom designs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "altogh this game has some problems and things it could improve it is still one of if not my favorit game of all time, such a shame it no longer gets any updates. Worth every peny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is \"early access\" - it was never finished even though it was released. It has lots of bugs and crashes. They are consistent so once you learn them you can avoid them. I bought this knowing what I was getting into, there's really no other game like this one out there. So buyer beware.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It feels like putting a needle through a hole playing the sotry mode(I think that's not wat it's called). \r\n\r\nI like it when my battleship armada misses all it's shots and my torpedoes just don't explode \r\n\r\ndefinitely 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is unique, I really enjoy it. \n\nHowever it needs a lot more development and we are not going to see that since the devs left it to its fate.\n\nIf it does not bother you that the game is like 70% finished, give it a try because it is fun in my pov.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So close yet so far...\r\n\r\nI'm torn that there are no more updates. Its still fun yet so incomplete. Perhaps it'll be better on the next one boys. :'(",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pretty good, dont listen to the critiques if you loved the naval combat from total war napoleon and empire, but want way more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not much to say. Perfect game. You build it, you battle it. Rinse repeat. Fun every time. We a 'Build-your-boat' title for the age of sail though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it wary intresting, low it alot.\ndo miss coop motiplayer and mod suport",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would highly recommend this game. If you like strategy games than this is an outstanding one in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big guns on Big Boats, nothing more needs to be said.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've put 4000+ hours into it, ive had way more fun than I've had with most other games",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Super addicting and tickles the tism",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i  think its good cuz you can desgin ships (sorry for the bad spelling).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Personally one of my favorite video games of all time hopefully see UAD2 at some point because I loved every second  of playing this game and to be frank there is not a another game that offers the same experience so kind of said to see the end of future development for this game. But if you want to research tech balance funding and building new cutting edge vessels vs building as many cheap glass cannons as you can than this the game for you. I love nothing more than catching a large enemy force out at sea with superior tech and design to send them to the bottom of the ocean. Would happily invest thousands of dollars to see second version of this tittle come out in the next few years. 10 out 10 would recommend if you are a naval nerd looking for a somewhat casual experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cuts right to what i was looking for in a game!  Hats off to the team and I would love to see continued updates or even a version 2.  Love the modeling!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I built Yamato and won my first 1v1.  Yeah, Yammy is OP.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a fun game but defiantly wait for a sale if you plan on buying",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game wasn't cheap and for it to be abandoned by the game developers is borderline criminal. I believe that partial refunds should be issued. The game was nowhere near finished when the final update was released.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Bit late to the party but\r\n\r\nThe core game ideas and loop is very fun. The whole designing element of the game is obviously it's standout feature, and I haven't really found another game like it. Campaigns are fun too, if not a little chaotic. \r\n\r\nHowever... The dev team discontinuing this leaves it in a state where it's just not ready. This game still has bugs it shouldn't, the UI is atrocious and battles can be tedious to manage the larger they are, and the AI struggles to keep up with both designing competent ships and implementing modern technology onto said ships, making this somewhat of a curb stomp even on legendary when you know what you're doing. \r\n\r\nI wouldn't buy the game. It had fantastic potential, but with the game no longer receiving updates, it'll never be what it should have been. Mods like DIP do improve some aspects of it (though I find DIP exacerbates the horrific torpedo spam of the AI and makes the game miserable), but overall? You'd best spend your money elsewhere.\r\n\r\nAlso my 1100-ish hours are mostly spent AFK in a screen somewhere in the campaign lol.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bought this when it wasn't abandoned. Still too many bugs. Abandoned games aren't really worth buying, especially not one this expensive. I might play it from time to time, but only if I can't think of literally anything else to do. Quite disappointing how this game turned out.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game is a sold 5/10 in its current state. The 5pts in there are great, and you'll feel like the game was on the road to a  7 or 8 of 10. But then the devs abandoned development after dropping a rushed 1.0 patch and a few hotfixes. So you have a game with great bones that is either A) missing the meat or B) is a buggy mess. Beyond that, the core feature of the game, building your own dreadnought battleships, is just.... flat without reasons to do it. But the campaign itself is half an idea, and the weakest overall feature. Dreadnought Improvement Project (mod) improves this a bit, but the core is just too thin to build on. Battles beyond a certain size are just a slog. And after two or three campaigns you realize youre basically building the same ships over and over and over gain. Predreadnoughts get a 12\" battery till you hit 14\" mk 2s. 14\" belt is optimal till then. 5/6\" casemates. Triple expansion engines. Over and over. On and on. Every nation. Till you hit the next set of techs and move forward to the dreadnoughts, and start building *them* along your standard template. The battles dont change they just space out. DDs and CAs lose fleet share to CLs with long range torpedoes. And  if you wanna break the design system, its super easy to do (just build BCs with like 10 quad torp launchers). \n\nBuy this game, and dream of what could have been with a deeper, more replayable campaign mechanic. This game was a casualty of COVID lockdowns and never recovered from, its weird way-too-early hype cycle, the dev's stubborn refusal to put the game on steam while the hype was hottest, and the stubborn resistance to building a campaign in favor of patching in new hulls and constantly having to redo their esoteric ship balancing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is extremely laggy for the campaign. Submarines completely ruin the game, by being stupidly effective and just a matter of probability on winning, depending on whether they are detected or not. The limitation on invading one territory at the time just slows down the campaign horribly. \r\n\r\nGame is buggy, extremely fun in its high moments, but let down by very obvious game meta and mechanics. Unfortunate because I want to love this game, but dang it is stupid frustrating too often.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "First video makes it look like you can control far more about the ship then you can. Truth is you pick a class and you can only put things from near that time frame on it. You can not change a ships size or add more spots for guns. Best graphics of the three games like this I played. worst amount of ship editing of the three.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant seem to get through to the end of a large battle without the game freezing up. \r\nAnd its not the my computer is a potato kind of lock up, it typicly happens after most of the ships on both sides have been sunk and the battle is starting to come to an end.\r\nNo issues when I have 30 to 40 ships on both sides but when that number gets down to a dozen total or less then suddenly the game decides that's to much to process and stops responding.\r\nThis makes playing the campaign an effort in futility especialy with the game not creating auto save points, so if you forget to save for a bit you could be set back hours of playtime when the game stops responding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have fun, but it's pretty bad. \r\n\r\nUnfortunately, there's not really much like it, so it's probably worth it if you really want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While the ship designer and combat are great, just about everything else isn't. The campaign is deeply flawed (want to improve relations with France? roll a dice lmao) and if you're not one of the larger countries with giant GDPs your naval budget will suffer if you want to stay competitive, all while other countries admirals are sacked for excessive naval expenditures every couple months.. and then continues to spend excessively. Meaning the AI isn't punished for this at all because a new admiral gets into office and does the exact same things. Its a lose condition for you, though.\n\nThere isnt much player agency. Aforementioned dice roll relations, and you can only *influence* the government on certain things. I.e. peace treaties. After sitting in your 20-hour campaign you finally get to war, they fold instantly and lose a couple BBs (because the AI sucks at building ships - ill get to that later), ask for peace, but you want a greater reward at the end so you want to fight on. Tough shit because their admiral 'intervened' and managed to get a peace treaty, meaning you only get some 300M$ as reparations. Woohoo. The justification being \"you're only the head of admiralty, not the government\" - which is just terrible justification?? I should have more control - games are meant to be fun and this isn't it.\nYour research department is controlled via a slider and assigning priorities. You can't tell them to make a Mk.III 16\" gun, they have to make a 20\" Mk.I first. This also goes for the other 2 sliders, transport capacity (increases gdp) and crew training, minus assignable priorities. There isn't much depth.\nYour port capacity is increased solely by GDP. This means you cant expand ports of strategic importance (i.e. Pearl Harbour) any meaningful amount. It might expand by 20k tons over the course of 10 years, but by that time you've gone from ~40k ton dreadnoughts to ~80k ton modern battleships. Small ports end up being largely useless because of this.\n\nThe AI just isn't really a good opponent. Their CLs and DDs will have high top speeds and next to no armor while also building hundreds of them. Which they will then send directly towards you in swarms in the hopes of getting some torpedo hits (which they hardly do - and if they do, they dont do much) to then get mulched by your battle line. Rinse and repeat. Many many times my ships have ended an engagement with >90% structural/buoyancy while having decimated a multitude of enemy ships. I'm actually at greater risk of running out of ammo.\nAs for their capital ships, they'll end up designing 'modern' battleships with 4 different calibers of secondary guns, all more or less randomly generated. Same for barrel length. And even if they have access to Modern II armor (the best and lightest armor available) they will still often go for Krupp III instead. Or Coinc. II rangefinders (max being V). They'll also block off significant portions of their turret traverse with 2\" guns. Or use Mk.1 guns which have terrible rates of fire and even worse accuracy.. and then try to snipe with it.\n\nNow for the campaign. Submarines are implemented terribly. You can't go to actual battle, instead all of it being auto-resolve. So your battleship taskforce surrounded with 12 destroyers all equipped with the most powerful depth charges available, RDF, and state-of-the-art sonar and radar can end up losing your brand new superbattleship to 3 enemy submarines. And then there's minefields. Again you cant do anything about these so your new modern battleship can get their shit rocked by minefields despite your ships having amazing minesweeping capability. And then theres land wars.. which you cant control at all. You can be losing provinces while dominating the sea and theres nothing you can really do about it. Honestly i think the game should have just said that land wars are trench warfare (unlike real life) so the seas make the major difference - or give us control over the army.\nEngaging enemy taskforces is awful - you can plot an interception course to engage their fleets while being closer to the interception point than them (and with higher cruising speeds) and they'll somehow slip right by with no combat. You also have no control over minor allies. You can play as the USA and Canada can end up allying with Italy due to random chance. There's no way to influence this.\nThe type of government you have (for democracy, who's voted into office) also affects gameplay, but theres no way to change this.\nThe map also lacks the most basic of QoL. It doesn't wrap around at all, and it doesnt even teleport your camera to the other side at bare minimum.\n\nOverall the best way to describe the campaign (as someone else put it) is \"watching TV\". You can't influence much of anything so you're just sitting there watching what comes on.\n\nDon't buy unless some modder comes along and fixes the game. Except pirate it instead of giving money to the developers who released this (\"\"finished\"\") product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This dev is now notorious for starting early access titles, collecting paychecks, and then abandoning the projects.  Well done, Chaps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was abandoned without ever being properly completed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the trailer shows that you can change portions of the hull but you cannot do that in game there are only premade hulls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dosnt matter what you do you cant sink anything and distroyers sink your battleship with its guns pure crap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fucking awful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could've been one of the greats....",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Developers were all fired by parent company because they wouldnt monetize the game aggressively enough, with no plans to continue/finish the game's development. Parent company has left paid MP DLC and main game on store for full price. Vote with your wallet, teach them to be better, dont buy this game.\n\nTheres also various issues with the game, single player campaigns are boring because diplomacy was last priority, there is no real flavor, etc.",
      "voted_up": false,
      "votes_helpful": 205
    },
    {
      "review": "Ultimate Admiral: Dreadnoughts is a game I genuinely want to love. Theres a deep, satisfying joy in designing ships, testing them in custom battles, and seeing your fleets go toe-to-toe with AI adversaries. The ship designer is complex, detailed, and rewarding, letting you tinker with hulls, turrets, armor, funnels, and weight distribution in ways that actually affect combat performance. For anyone who gets a thrill imagining themselves as a naval genius, this game scratches that itch beautifully.\n\nUnfortunately, the campaign that ties it all together never quite feels finished, even in its final release state. The economy is a constant uphill battle. Your budget  supposedly tied to your nations GDP  almost never grows in a meaningful way. In practice, progress depends on random events rather than strategic management. Youre constantly scraping by, running deficits just to stay competitive, and the game punishes you for it. Go bankrupt and youll get bailed out, but at the cost of your nations GDP and a scolding reminder that you did it wrong.\n\nMeanwhile, the AI seems to play by a completely different set of rules. It never suffers from budget problems, fielding massive fleets and advanced technologies well beyond its means. Youll get notifications of rival admirals being fired for incompetence, but theyll still be back next turn with a stronger navy. If you suffer the same fate, its game over. The AI can lose entire wars and governments, but as long as it still controls one port, it never truly loses.\n\nThe games endless barrage of random events doesnt help. Most of them feel irrelevant or punishing  decisions that boil down to how much money or prestige do you want to lose today? Rarely do these choices benefit the player, and they break up the flow of gameplay without adding meaningful depth.\n\nDiplomacy is, bluntly, a joke. Trying to improve relations is like rolling dice in a smoky bar  the results are random, arbitrary, and often illogical. Sometimes nations warm up to you, sometimes theyre insulted by your generosity. Prestige  another meter you can lose the game from  constantly hangs over your head like a guillotine. The result is a diplomacy system that feels punitive rather than strategic.\n\nThen theres the war itself. Despite being the Admiral, you have little actual control over the wars you fight. You can design the ships, but you cant influence when, where, or how battles occur. Land combat happens off-screen with a progress bar, and naval bombardment  something youd assume would matter  seems to have no effect at all. Even peace negotiations are bizarre: you might crush an enemy fleet, only for them to refuse to cede territory despite total defeat.\n\nThe campaign map adds its own frustrations. It scrolls like its dragging an anchor, with sluggish movement and awkward UI placement. Naval invasions are guesswork  you dont know how much tonnage you need until its too late, and the cameras springy edge behavior makes navigating the map a chore. The International Date Line splits the map in half, but instead of looping naturally, you have to scroll all the way around just to reach the other side. Its tedious, clunky, and baffling.\n\nThe tutorials, while extensive, feel outdated and occasionally broken. Some missions cant even be completed due to changes in stats and game mechanics since their creation. While learning to build and fight doesnt require them, the tutorials neglected state reflects the same rough edges seen throughout the campaign.\n\nTheres so much potential here. The ship designer and combat engine are genuinely impressive  few games capture the majesty and brutality of naval warfare this well. But the campaign layer meant to give all that context feels like its constantly working against you. Between the broken economy, rule-breaking AI, shallow diplomacy, and a UI that fights for your attention, Ultimate Admiral: Dreadnoughts feels like a brilliant prototype trapped in development hell.\n\nScore: 6/10  A naval dream weighed down by its own bureaucracy.",
      "voted_up": false,
      "votes_helpful": 78
    },
    {
      "review": "DO NOT BUY THIS\n\nNot beacuse the game is bad, but beacuse the publishers fired the developers once they refused to milk the game. Fuck you game labs, hope you go bankrupt.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Development is dead. The game will not be finished. This is what everyone is warning you about when early access games come up. It is a good concept with a lot of good assets. It is almost there. Another year and some more development funding would have made it great. But that won't happen. I bought in early and enjoyed the journey, but we didn't get there. I wish the devs well wherever they may be working now and hope this experience makes the industry better.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "man i really wish this game was finished, trying to extract any amount of fun from the game in its current state has you either playing an update where everything is so slow you'll be able to build a full ship before the turn resolves or a mod that just sucks all the fun out, god damn you game-labs bring these devs back",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "A really fun game that I have spent quite a bit of time in just designing the ships. Unfortunately as others have stated, the devs were laid off by game-labs since they refused to heavily montize the game. \n\nIf you truly want it, wait for a sale!!",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Good game but it has been abandoned and is not complete",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I bought this game mainly due to a certain content creator that I watched and still occasionally watch from time to time, iykyk. After a while though, the game got stale fast. The campaign was for for awhile, but the AI loves to use destroyers for the most part and flood the waters with torpedoes, making the battle end really fast if your ships lack torpedo protection. Also, the design process the AI uses when it comes to building the ships makes them vulnerable as well, making them prone to flash fires, ammo detonations or just really badly armored making the battle boring and not challenging. Overtime as the months go on in the campaign and you unlock \"the best of the best\", the battles don't feel very fulfilling. Even when you face another nation that's close to your strength, you can decimate them pretty easily if they use poorly designed ships.\n\n\nThere are still some bugs in the game that I've seen, though they don't effect the game performance in any way, just some cosmetic quirks here and there. The game was fun while it lasted, but now I think I'm going to stop playing it after I'm done with my last campaign, which I'm close to finishing.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "apparently game-labs is a fail, i had high hopes for this game but after this i certainly wont be buying any of their games again",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Stillfront drifting toward the CCP Games trajectory is a warning glyph worth heeding. When a studio pivots too hard toward monetizationoverpriced DLCs, neglected core games, and acquisition over polishthey risk alienating the very communities that built their legend.\n\nSee : https://www.stillfront.com/en/the-board-of-directors-of-stillfront-has-resolved-to-exercise-its-authorisation-to-acquire-own-shares-9/\n\nWill not be buying ANY of their games or giving them any more money until they fix this buggy overpriced game.  \nActual value : $15 no $34\n\nUNINSTALLED AND SHELVED....I got better naval simulators other than this garbage abandonware.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game should be called \"Destroyers\" instead of \"Dreadnoughts.\" I spent about 300 hours playing the campaign, and I haven't seen a game with such wasted potential in a long time. The AI only uses destroyers and spams us with dozens, making battles irritating and repetitive to the point of exhaustion. Our opponent barely uses formations at all, instead attacking us with \"wild horde\" tactics. The designs generated by the AI are hideous. The game sometimes tries, clumsily, to pretend to be something like Hearts of Iron. In my opinion, the game needs a few more patches. The only positive thing is the shipbuilding editor.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This game wasn't cheap and for it to be abandoned by the game developers is borderline criminal. I believe that partial refunds should be issued. The game was nowhere near finished when the final update was released.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Bought this when it wasn't abandoned. Still too many bugs. Abandoned games aren't really worth buying, especially not one this expensive. I might play it from time to time, but only if I can't think of literally anything else to do. Quite disappointing how this game turned out.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I have really done nothing but play skirmish on this, and for what I use it for, I love it, but it is not a finished game. There are multitudes of bugs that haven't been addressed, nor will they ever because the developers were all let go. If you can get this on sale, then by all means, go for it. There might be mods that fix issues, but I just can't give this game a positive review.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bit late to the party but\r\n\r\nThe core game ideas and loop is very fun. The whole designing element of the game is obviously it's standout feature, and I haven't really found another game like it. Campaigns are fun too, if not a little chaotic. \r\n\r\nHowever... The dev team discontinuing this leaves it in a state where it's just not ready. This game still has bugs it shouldn't, the UI is atrocious and battles can be tedious to manage the larger they are, and the AI struggles to keep up with both designing competent ships and implementing modern technology onto said ships, making this somewhat of a curb stomp even on legendary when you know what you're doing. \r\n\r\nI wouldn't buy the game. It had fantastic potential, but with the game no longer receiving updates, it'll never be what it should have been. Mods like DIP do improve some aspects of it (though I find DIP exacerbates the horrific torpedo spam of the AI and makes the game miserable), but overall? You'd best spend your money elsewhere.\r\n\r\nAlso my 1100-ish hours are mostly spent AFK in a screen somewhere in the campaign lol.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "You know, ordinarily I would upvote a game that lets me scratch the autistic desire to craft naval equipment, seeing as I myself am on the spectrum, but after Game Labs fired the devs I kinda just feel depressed? For those who read the reviews, this game was a joy to die for for me and the parent company nuked it, all because the developers had the best interests of the player at heart. \r\n\r\nPlease, vote with your wallets. Don't buy a dead game with a trash campaign. The campaign issues were detailed in another review. That was the only feature besides the ship editor that were worth anything.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I saw the game from some streamers videos.\nThe game in streams looks fine, but when you install it. although it doesnt have any fancy graphic, but its slow and laggy, even on high end PCs. \nThe game also have several design errors, no matter what you do, it wont launch the ship.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Had to play the campaign for a few hours just so I could find out that it freezes whenever I go into a fight.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sadly this absolutely great concept was implemented by devs that suffered under a horrible combination of lack of foresight, time stress and sometimes surprisingly low coding skills. This makes the game barely enjoyable when heavily modded and largely unplayable without. Especially as the final version includes a save game breaking bug which is only fixable by downloading a mod. The problem with modding is that some things are unchangeable and fundamentally broken, e.g. the Penetration Calculation.....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a sold 5/10 in its current state. The 5pts in there are great, and you'll feel like the game was on the road to a  7 or 8 of 10. But then the devs abandoned development after dropping a rushed 1.0 patch and a few hotfixes. So you have a game with great bones that is either A) missing the meat or B) is a buggy mess. Beyond that, the core feature of the game, building your own dreadnought battleships, is just.... flat without reasons to do it. But the campaign itself is half an idea, and the weakest overall feature. Dreadnought Improvement Project (mod) improves this a bit, but the core is just too thin to build on. Battles beyond a certain size are just a slog. And after two or three campaigns you realize youre basically building the same ships over and over and over gain. Predreadnoughts get a 12\" battery till you hit 14\" mk 2s. 14\" belt is optimal till then. 5/6\" casemates. Triple expansion engines. Over and over. On and on. Every nation. Till you hit the next set of techs and move forward to the dreadnoughts, and start building *them* along your standard template. The battles dont change they just space out. DDs and CAs lose fleet share to CLs with long range torpedoes. And  if you wanna break the design system, its super easy to do (just build BCs with like 10 quad torp launchers). \n\nBuy this game, and dream of what could have been with a deeper, more replayable campaign mechanic. This game was a casualty of COVID lockdowns and never recovered from, its weird way-too-early hype cycle, the dev's stubborn refusal to put the game on steam while the hype was hottest, and the stubborn resistance to building a campaign in favor of patching in new hulls and constantly having to redo their esoteric ship balancing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a really good game at its core and it is really fun to play, especially the campaign. The real only major problem I have encountered is when you update the game and launch it your saves are evaporated. which is infuriating because i had 2 saves on separate versions of the game that i had spent 40+ hours on. The first one was lost because i didn't know of this problem. the second one was because i had uninstalled the game for a bit and reinstalled it and there must have been a hotfix or something because my save was gone. overall good game and really fun campaign if you dont mind your save being deleted with any update.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is extremely laggy for the campaign. Submarines completely ruin the game, by being stupidly effective and just a matter of probability on winning, depending on whether they are detected or not. The limitation on invading one territory at the time just slows down the campaign horribly. \r\n\r\nGame is buggy, extremely fun in its high moments, but let down by very obvious game meta and mechanics. Unfortunate because I want to love this game, but dang it is stupid frustrating too often.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "First video makes it look like you can control far more about the ship then you can. Truth is you pick a class and you can only put things from near that time frame on it. You can not change a ships size or add more spots for guns. Best graphics of the three games like this I played. worst amount of ship editing of the three.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant seem to get through to the end of a large battle without the game freezing up. \r\nAnd its not the my computer is a potato kind of lock up, it typicly happens after most of the ships on both sides have been sunk and the battle is starting to come to an end.\r\nNo issues when I have 30 to 40 ships on both sides but when that number gets down to a dozen total or less then suddenly the game decides that's to much to process and stops responding.\r\nThis makes playing the campaign an effort in futility especialy with the game not creating auto save points, so if you forget to save for a bit you could be set back hours of playtime when the game stops responding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have fun, but it's pretty bad. \r\n\r\nUnfortunately, there's not really much like it, so it's probably worth it if you really want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved the game during development and followed it up till the time I wrote this. It's an amazing sandbox that if you want to design your own ships and have them fight it out, maybe play a campaign that helps pit you against foes and strategically fight with your fleets, and have a childish wonder at little boats duking it out it's perfect.... but.... The Dev's were sacked cause of greed and development ceased and the game was called \"Done/Complete\" when there is obviously so much still unfinished and buggy. Unfinished Abandonware that never should've left Early Access status.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a DEAD GAME. \n\nThe devs abandoned this game in an unfinished state at the end of 2024. It's a shame, there isn't anything quite like it out there. I really love this game, and it would've been amazing if it were ever finished, but I cannot in good conscience recommend it to anyone. It's playable, though pretty non-intuitive and frustrating. \n\nThe ship designer lacks the hull designer shown in all their advertising media, you can only place components on top of historical hulls to design your ships. Placing components anywhere but where the game wants you to is nigh impossible (though can be done with enough finagling), so most ships you make look exactly like the historical ship the hull was based on. The enemy AI does not have this problem, and comes up with all kinds of abominations for you to fight that rarely work effectively and are never as good as player designs. Enemy ships tend to be less accurate and less survivable than player designed ships, making ships that should be contemporaries or even better than what the player can make easy to dispatch. \n\nThe campaign mode is an amazing concept executed poorly. the whole political system makes no sense and always snowballs into global conflict that never ends. It's basically a game of constantly asskissing every other country you're not at war with so they all don't dogpile you. I do like how the army (that you have no control over because you're the head of the navy) fights on land automatically and can even capture provinces, but there is no way coordinate with them. Attacking enemy fleets on the map is very difficult unless they are blockading you and not moving, You have to either bring your ships out to blockade waterways using their circles of control and hope they sail into you (this is never really explained and only kinda works), or leave your fleets in port, set them to sea control on the fleet menu and hope the game generates the encounter you want (it never does). As of the last update, it made training more sailors more expensive and slower, making manpower the limiting factor of having a large fleet instead of money, industrial base, or port space. \n\nThe actual gameplay is OK. Sometimes escort ships using the auto escort functions run themselves head on into enemy fire and kill themselves, but this was something that they actually (mostly) fixed before abandoning the game. The visibility stats of player ships are always much higher than the enemy ships ( IDK if it's just how the AI designs their ships or if they get an artificial buff to their reconnisance), so the enemy always seems to spot you first. While realistic, it's very frustrating when the enemy has a ship that's either the same speed or faster than you and just runs away, making you have to wait for the end game timer to pop up. Without the time compression, battles take a very long time, and the closer you are to the enemy, the less time compression you can use. This means if you wind up chasing an enemy that has the same top speed, you have to either get lucky and score a hit that damages their propulsion (which is very unlikely because you're at top speed and the target is also moving fast), or you have to wait even longer for the end battle option to pop up. This happens more often than you would think, especially after you defeat a country's heavy units and they only have destroyers and torpedo boats left. The campaign continues to generate encounters where you can't catch them, but you can't skip because they'll destroy your merchant ships (which can lead to an economic death spiral).\n\nAll in all, this game is a missed opportunity. Its not even that far off from being good and done. There aren't a lot of games centered around the Dreadnaught Era of history, and this could've been a great one. While the modding scene definitely makes the game better and fixes a lot of the issues, as consumers we shouldn't be encouraging devs to abandoned projects 3/4s of the way through.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The AI goes around my ships and then random outmatched engagements occur. what the hell am i supposed to do to defend??????????????????? Cant get a fucking battle to save my life fleet just chillin in the middle of all this bs and nothing happening fuck this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When i first got it and it was still in development, i could shrug off some of the bugs. But now that the devs are fired and that the game looks to be dead, i cant recomend this game any more, save your money on a game that will continue to up date and that does not have a crap parent company.\n\nIf you still want to buy the game, there are tons of bugs in campaign, and i dont see it being updated.\n\nJust noted from me, pls save you money and get another game instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't recommend this game unfortunately. I haven't played too much, but with the current state of the game, I have no desire to continue playing it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super cool game until they summarily executed the development because they felt like it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didn't like it.\n\nThe tactical ship component is a massive learning curve with very little fun.\n\nThe campaign is a tedious grind with very little fun.\n\nI enjoyed it a bit less than doing my taxes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is absolutely awful, for starters you can't actually design your own hull as shown on the store page, the campaign is boring and over complicated,  the Naval Academy missions are ******** impossible, there are so many rules and borders of where you can place things and how heavy something can be that it leads you to just have to design an entirely different ship than what you originally planned on.  I would 100% get a refund if I could but I had just over double two hours(Steam's refund policy).  Please don't waste your money on this piece of ****.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "DO NOT BUY GAMES FROM THESE DEVS!!! Started off looking good for this game. Devs quickly let it die off because they don't care....Along with all of their other games especially naval action. Devs will blatantly ban from their forums, discord and games, anyone who bad-mouths them. DO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While the ship designer and combat are great, just about everything else isn't. The campaign is deeply flawed (want to improve relations with France? roll a dice lmao) and if you're not one of the larger countries with giant GDPs your naval budget will suffer if you want to stay competitive, all while other countries admirals are sacked for excessive naval expenditures every couple months.. and then continues to spend excessively. Meaning the AI isn't punished for this at all because a new admiral gets into office and does the exact same things. Its a lose condition for you, though.\n\nThere isnt much player agency. Aforementioned dice roll relations, and you can only *influence* the government on certain things. I.e. peace treaties. After sitting in your 20-hour campaign you finally get to war, they fold instantly and lose a couple BBs (because the AI sucks at building ships - ill get to that later), ask for peace, but you want a greater reward at the end so you want to fight on. Tough shit because their admiral 'intervened' and managed to get a peace treaty, meaning you only get some 300M$ as reparations. Woohoo. The justification being \"you're only the head of admiralty, not the government\" - which is just terrible justification?? I should have more control - games are meant to be fun and this isn't it.\nYour research department is controlled via a slider and assigning priorities. You can't tell them to make a Mk.III 16\" gun, they have to make a 20\" Mk.I first. This also goes for the other 2 sliders, transport capacity (increases gdp) and crew training, minus assignable priorities. There isn't much depth.\nYour port capacity is increased solely by GDP. This means you cant expand ports of strategic importance (i.e. Pearl Harbour) any meaningful amount. It might expand by 20k tons over the course of 10 years, but by that time you've gone from ~40k ton dreadnoughts to ~80k ton modern battleships. Small ports end up being largely useless because of this.\n\nThe AI just isn't really a good opponent. Their CLs and DDs will have high top speeds and next to no armor while also building hundreds of them. Which they will then send directly towards you in swarms in the hopes of getting some torpedo hits (which they hardly do - and if they do, they dont do much) to then get mulched by your battle line. Rinse and repeat. Many many times my ships have ended an engagement with >90% structural/buoyancy while having decimated a multitude of enemy ships. I'm actually at greater risk of running out of ammo.\nAs for their capital ships, they'll end up designing 'modern' battleships with 4 different calibers of secondary guns, all more or less randomly generated. Same for barrel length. And even if they have access to Modern II armor (the best and lightest armor available) they will still often go for Krupp III instead. Or Coinc. II rangefinders (max being V). They'll also block off significant portions of their turret traverse with 2\" guns. Or use Mk.1 guns which have terrible rates of fire and even worse accuracy.. and then try to snipe with it.\n\nNow for the campaign. Submarines are implemented terribly. You can't go to actual battle, instead all of it being auto-resolve. So your battleship taskforce surrounded with 12 destroyers all equipped with the most powerful depth charges available, RDF, and state-of-the-art sonar and radar can end up losing your brand new superbattleship to 3 enemy submarines. And then there's minefields. Again you cant do anything about these so your new modern battleship can get their shit rocked by minefields despite your ships having amazing minesweeping capability. And then theres land wars.. which you cant control at all. You can be losing provinces while dominating the sea and theres nothing you can really do about it. Honestly i think the game should have just said that land wars are trench warfare (unlike real life) so the seas make the major difference - or give us control over the army.\nEngaging enemy taskforces is awful - you can plot an interception course to engage their fleets while being closer to the interception point than them (and with higher cruising speeds) and they'll somehow slip right by with no combat. You also have no control over minor allies. You can play as the USA and Canada can end up allying with Italy due to random chance. There's no way to influence this.\nThe type of government you have (for democracy, who's voted into office) also affects gameplay, but theres no way to change this.\nThe map also lacks the most basic of QoL. It doesn't wrap around at all, and it doesnt even teleport your camera to the other side at bare minimum.\n\nOverall the best way to describe the campaign (as someone else put it) is \"watching TV\". You can't influence much of anything so you're just sitting there watching what comes on.\n\nDon't buy unless some modder comes along and fixes the game. Except pirate it instead of giving money to the developers who released this (\"\"finished\"\") product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This dev is now notorious for starting early access titles, collecting paychecks, and then abandoning the projects.  Well done, Chaps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was abandoned without ever being properly completed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the trailer shows that you can change portions of the hull but you cannot do that in game there are only premade hulls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was a good game. The studio was bought out by a shitty publisher who wanted something that they couldn't do and shuttered them before they finished the game. Do not give this new publisher money for this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "dosnt matter what you do you cant sink anything and distroyers sink your battleship with its guns pure crap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately the game feels very unfinished.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Incomplete and abandoned",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Abandoned, laggy, freezing, poor game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DONT TRUST THE TRAILER IT IS NOT LIKE THE GAME AT ALL",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fucking awful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could've been one of the greats....",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Abandoned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Developers were all fired by parent company because they wouldnt monetize the game aggressively enough, with no plans to continue/finish the game's development. Parent company has left paid MP DLC and main game on store for full price. Vote with your wallet, teach them to be better, dont buy this game.\n\nTheres also various issues with the game, single player campaigns are boring because diplomacy was last priority, there is no real flavor, etc.",
      "voted_up": false,
      "votes_helpful": 205
    },
    {
      "review": "Ultimate Admiral: Dreadnoughts is a game I genuinely want to love. Theres a deep, satisfying joy in designing ships, testing them in custom battles, and seeing your fleets go toe-to-toe with AI adversaries. The ship designer is complex, detailed, and rewarding, letting you tinker with hulls, turrets, armor, funnels, and weight distribution in ways that actually affect combat performance. For anyone who gets a thrill imagining themselves as a naval genius, this game scratches that itch beautifully.\n\nUnfortunately, the campaign that ties it all together never quite feels finished, even in its final release state. The economy is a constant uphill battle. Your budget  supposedly tied to your nations GDP  almost never grows in a meaningful way. In practice, progress depends on random events rather than strategic management. Youre constantly scraping by, running deficits just to stay competitive, and the game punishes you for it. Go bankrupt and youll get bailed out, but at the cost of your nations GDP and a scolding reminder that you did it wrong.\n\nMeanwhile, the AI seems to play by a completely different set of rules. It never suffers from budget problems, fielding massive fleets and advanced technologies well beyond its means. Youll get notifications of rival admirals being fired for incompetence, but theyll still be back next turn with a stronger navy. If you suffer the same fate, its game over. The AI can lose entire wars and governments, but as long as it still controls one port, it never truly loses.\n\nThe games endless barrage of random events doesnt help. Most of them feel irrelevant or punishing  decisions that boil down to how much money or prestige do you want to lose today? Rarely do these choices benefit the player, and they break up the flow of gameplay without adding meaningful depth.\n\nDiplomacy is, bluntly, a joke. Trying to improve relations is like rolling dice in a smoky bar  the results are random, arbitrary, and often illogical. Sometimes nations warm up to you, sometimes theyre insulted by your generosity. Prestige  another meter you can lose the game from  constantly hangs over your head like a guillotine. The result is a diplomacy system that feels punitive rather than strategic.\n\nThen theres the war itself. Despite being the Admiral, you have little actual control over the wars you fight. You can design the ships, but you cant influence when, where, or how battles occur. Land combat happens off-screen with a progress bar, and naval bombardment  something youd assume would matter  seems to have no effect at all. Even peace negotiations are bizarre: you might crush an enemy fleet, only for them to refuse to cede territory despite total defeat.\n\nThe campaign map adds its own frustrations. It scrolls like its dragging an anchor, with sluggish movement and awkward UI placement. Naval invasions are guesswork  you dont know how much tonnage you need until its too late, and the cameras springy edge behavior makes navigating the map a chore. The International Date Line splits the map in half, but instead of looping naturally, you have to scroll all the way around just to reach the other side. Its tedious, clunky, and baffling.\n\nThe tutorials, while extensive, feel outdated and occasionally broken. Some missions cant even be completed due to changes in stats and game mechanics since their creation. While learning to build and fight doesnt require them, the tutorials neglected state reflects the same rough edges seen throughout the campaign.\n\nTheres so much potential here. The ship designer and combat engine are genuinely impressive  few games capture the majesty and brutality of naval warfare this well. But the campaign layer meant to give all that context feels like its constantly working against you. Between the broken economy, rule-breaking AI, shallow diplomacy, and a UI that fights for your attention, Ultimate Admiral: Dreadnoughts feels like a brilliant prototype trapped in development hell.\n\nScore: 6/10  A naval dream weighed down by its own bureaucracy.",
      "voted_up": false,
      "votes_helpful": 78
    },
    {
      "review": "DO NOT BUY THIS\n\nNot beacuse the game is bad, but beacuse the publishers fired the developers once they refused to milk the game. Fuck you game labs, hope you go bankrupt.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "man i really wish this game was finished, trying to extract any amount of fun from the game in its current state has you either playing an update where everything is so slow you'll be able to build a full ship before the turn resolves or a mod that just sucks all the fun out, god damn you game-labs bring these devs back",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "A really fun game that I have spent quite a bit of time in just designing the ships. Unfortunately as others have stated, the devs were laid off by game-labs since they refused to heavily montize the game. \n\nIf you truly want it, wait for a sale!!",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "This game wasn't cheap and for it to be abandoned by the game developers is borderline criminal. I believe that partial refunds should be issued. The game was nowhere near finished when the final update was released.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Good game but it has been abandoned and is not complete",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I bought this game mainly due to a certain content creator that I watched and still occasionally watch from time to time, iykyk. After a while though, the game got stale fast. The campaign was for for awhile, but the AI loves to use destroyers for the most part and flood the waters with torpedoes, making the battle end really fast if your ships lack torpedo protection. Also, the design process the AI uses when it comes to building the ships makes them vulnerable as well, making them prone to flash fires, ammo detonations or just really badly armored making the battle boring and not challenging. Overtime as the months go on in the campaign and you unlock \"the best of the best\", the battles don't feel very fulfilling. Even when you face another nation that's close to your strength, you can decimate them pretty easily if they use poorly designed ships.\n\n\nThere are still some bugs in the game that I've seen, though they don't effect the game performance in any way, just some cosmetic quirks here and there. The game was fun while it lasted, but now I think I'm going to stop playing it after I'm done with my last campaign, which I'm close to finishing.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "apparently game-labs is a fail, i had high hopes for this game but after this i certainly wont be buying any of their games again",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Stillfront drifting toward the CCP Games trajectory is a warning glyph worth heeding. When a studio pivots too hard toward monetizationoverpriced DLCs, neglected core games, and acquisition over polishthey risk alienating the very communities that built their legend.\n\nSee : https://www.stillfront.com/en/the-board-of-directors-of-stillfront-has-resolved-to-exercise-its-authorisation-to-acquire-own-shares-9/\n\nWill not be buying ANY of their games or giving them any more money until they fix this buggy overpriced game.  \nActual value : $15 no $34\n\nUNINSTALLED AND SHELVED....I got better naval simulators other than this garbage abandonware.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game should be called \"Destroyers\" instead of \"Dreadnoughts.\" I spent about 300 hours playing the campaign, and I haven't seen a game with such wasted potential in a long time. The AI only uses destroyers and spams us with dozens, making battles irritating and repetitive to the point of exhaustion. Our opponent barely uses formations at all, instead attacking us with \"wild horde\" tactics. The designs generated by the AI are hideous. The game sometimes tries, clumsily, to pretend to be something like Hearts of Iron. In my opinion, the game needs a few more patches. The only positive thing is the shipbuilding editor.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Bit late to the party but\r\n\r\nThe core game ideas and loop is very fun. The whole designing element of the game is obviously it's standout feature, and I haven't really found another game like it. Campaigns are fun too, if not a little chaotic. \r\n\r\nHowever... The dev team discontinuing this leaves it in a state where it's just not ready. This game still has bugs it shouldn't, the UI is atrocious and battles can be tedious to manage the larger they are, and the AI struggles to keep up with both designing competent ships and implementing modern technology onto said ships, making this somewhat of a curb stomp even on legendary when you know what you're doing. \r\n\r\nI wouldn't buy the game. It had fantastic potential, but with the game no longer receiving updates, it'll never be what it should have been. Mods like DIP do improve some aspects of it (though I find DIP exacerbates the horrific torpedo spam of the AI and makes the game miserable), but overall? You'd best spend your money elsewhere.\r\n\r\nAlso my 1100-ish hours are mostly spent AFK in a screen somewhere in the campaign lol.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Bought this when it wasn't abandoned. Still too many bugs. Abandoned games aren't really worth buying, especially not one this expensive. I might play it from time to time, but only if I can't think of literally anything else to do. Quite disappointing how this game turned out.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I have really done nothing but play skirmish on this, and for what I use it for, I love it, but it is not a finished game. There are multitudes of bugs that haven't been addressed, nor will they ever because the developers were all let go. If you can get this on sale, then by all means, go for it. There might be mods that fix issues, but I just can't give this game a positive review.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "You know, ordinarily I would upvote a game that lets me scratch the autistic desire to craft naval equipment, seeing as I myself am on the spectrum, but after Game Labs fired the devs I kinda just feel depressed? For those who read the reviews, this game was a joy to die for for me and the parent company nuked it, all because the developers had the best interests of the player at heart. \r\n\r\nPlease, vote with your wallets. Don't buy a dead game with a trash campaign. The campaign issues were detailed in another review. That was the only feature besides the ship editor that were worth anything.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I saw the game from some streamers videos.\nThe game in streams looks fine, but when you install it. although it doesnt have any fancy graphic, but its slow and laggy, even on high end PCs. \nThe game also have several design errors, no matter what you do, it wont launch the ship.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Had to play the campaign for a few hours just so I could find out that it freezes whenever I go into a fight.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sadly this absolutely great concept was implemented by devs that suffered under a horrible combination of lack of foresight, time stress and sometimes surprisingly low coding skills. This makes the game barely enjoyable when heavily modded and largely unplayable without. Especially as the final version includes a save game breaking bug which is only fixable by downloading a mod. The problem with modding is that some things are unchangeable and fundamentally broken, e.g. the Penetration Calculation.....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a sold 5/10 in its current state. The 5pts in there are great, and you'll feel like the game was on the road to a  7 or 8 of 10. But then the devs abandoned development after dropping a rushed 1.0 patch and a few hotfixes. So you have a game with great bones that is either A) missing the meat or B) is a buggy mess. Beyond that, the core feature of the game, building your own dreadnought battleships, is just.... flat without reasons to do it. But the campaign itself is half an idea, and the weakest overall feature. Dreadnought Improvement Project (mod) improves this a bit, but the core is just too thin to build on. Battles beyond a certain size are just a slog. And after two or three campaigns you realize youre basically building the same ships over and over and over gain. Predreadnoughts get a 12\" battery till you hit 14\" mk 2s. 14\" belt is optimal till then. 5/6\" casemates. Triple expansion engines. Over and over. On and on. Every nation. Till you hit the next set of techs and move forward to the dreadnoughts, and start building *them* along your standard template. The battles dont change they just space out. DDs and CAs lose fleet share to CLs with long range torpedoes. And  if you wanna break the design system, its super easy to do (just build BCs with like 10 quad torp launchers). \n\nBuy this game, and dream of what could have been with a deeper, more replayable campaign mechanic. This game was a casualty of COVID lockdowns and never recovered from, its weird way-too-early hype cycle, the dev's stubborn refusal to put the game on steam while the hype was hottest, and the stubborn resistance to building a campaign in favor of patching in new hulls and constantly having to redo their esoteric ship balancing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is extremely laggy for the campaign. Submarines completely ruin the game, by being stupidly effective and just a matter of probability on winning, depending on whether they are detected or not. The limitation on invading one territory at the time just slows down the campaign horribly. \r\n\r\nGame is buggy, extremely fun in its high moments, but let down by very obvious game meta and mechanics. Unfortunate because I want to love this game, but dang it is stupid frustrating too often.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "First video makes it look like you can control far more about the ship then you can. Truth is you pick a class and you can only put things from near that time frame on it. You can not change a ships size or add more spots for guns. Best graphics of the three games like this I played. worst amount of ship editing of the three.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant seem to get through to the end of a large battle without the game freezing up. \r\nAnd its not the my computer is a potato kind of lock up, it typicly happens after most of the ships on both sides have been sunk and the battle is starting to come to an end.\r\nNo issues when I have 30 to 40 ships on both sides but when that number gets down to a dozen total or less then suddenly the game decides that's to much to process and stops responding.\r\nThis makes playing the campaign an effort in futility especialy with the game not creating auto save points, so if you forget to save for a bit you could be set back hours of playtime when the game stops responding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have fun, but it's pretty bad. \r\n\r\nUnfortunately, there's not really much like it, so it's probably worth it if you really want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved the game during development and followed it up till the time I wrote this. It's an amazing sandbox that if you want to design your own ships and have them fight it out, maybe play a campaign that helps pit you against foes and strategically fight with your fleets, and have a childish wonder at little boats duking it out it's perfect.... but.... The Dev's were sacked cause of greed and development ceased and the game was called \"Done/Complete\" when there is obviously so much still unfinished and buggy. Unfinished Abandonware that never should've left Early Access status.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a DEAD GAME. \n\nThe devs abandoned this game in an unfinished state at the end of 2024. It's a shame, there isn't anything quite like it out there. I really love this game, and it would've been amazing if it were ever finished, but I cannot in good conscience recommend it to anyone. It's playable, though pretty non-intuitive and frustrating. \n\nThe ship designer lacks the hull designer shown in all their advertising media, you can only place components on top of historical hulls to design your ships. Placing components anywhere but where the game wants you to is nigh impossible (though can be done with enough finagling), so most ships you make look exactly like the historical ship the hull was based on. The enemy AI does not have this problem, and comes up with all kinds of abominations for you to fight that rarely work effectively and are never as good as player designs. Enemy ships tend to be less accurate and less survivable than player designed ships, making ships that should be contemporaries or even better than what the player can make easy to dispatch. \n\nThe campaign mode is an amazing concept executed poorly. the whole political system makes no sense and always snowballs into global conflict that never ends. It's basically a game of constantly asskissing every other country you're not at war with so they all don't dogpile you. I do like how the army (that you have no control over because you're the head of the navy) fights on land automatically and can even capture provinces, but there is no way coordinate with them. Attacking enemy fleets on the map is very difficult unless they are blockading you and not moving, You have to either bring your ships out to blockade waterways using their circles of control and hope they sail into you (this is never really explained and only kinda works), or leave your fleets in port, set them to sea control on the fleet menu and hope the game generates the encounter you want (it never does). As of the last update, it made training more sailors more expensive and slower, making manpower the limiting factor of having a large fleet instead of money, industrial base, or port space. \n\nThe actual gameplay is OK. Sometimes escort ships using the auto escort functions run themselves head on into enemy fire and kill themselves, but this was something that they actually (mostly) fixed before abandoning the game. The visibility stats of player ships are always much higher than the enemy ships ( IDK if it's just how the AI designs their ships or if they get an artificial buff to their reconnisance), so the enemy always seems to spot you first. While realistic, it's very frustrating when the enemy has a ship that's either the same speed or faster than you and just runs away, making you have to wait for the end game timer to pop up. Without the time compression, battles take a very long time, and the closer you are to the enemy, the less time compression you can use. This means if you wind up chasing an enemy that has the same top speed, you have to either get lucky and score a hit that damages their propulsion (which is very unlikely because you're at top speed and the target is also moving fast), or you have to wait even longer for the end battle option to pop up. This happens more often than you would think, especially after you defeat a country's heavy units and they only have destroyers and torpedo boats left. The campaign continues to generate encounters where you can't catch them, but you can't skip because they'll destroy your merchant ships (which can lead to an economic death spiral).\n\nAll in all, this game is a missed opportunity. Its not even that far off from being good and done. There aren't a lot of games centered around the Dreadnaught Era of history, and this could've been a great one. While the modding scene definitely makes the game better and fixes a lot of the issues, as consumers we shouldn't be encouraging devs to abandoned projects 3/4s of the way through.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The AI goes around my ships and then random outmatched engagements occur. what the hell am i supposed to do to defend??????????????????? Cant get a fucking battle to save my life fleet just chillin in the middle of all this bs and nothing happening fuck this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When i first got it and it was still in development, i could shrug off some of the bugs. But now that the devs are fired and that the game looks to be dead, i cant recomend this game any more, save your money on a game that will continue to up date and that does not have a crap parent company.\n\nIf you still want to buy the game, there are tons of bugs in campaign, and i dont see it being updated.\n\nJust noted from me, pls save you money and get another game instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't recommend this game unfortunately. I haven't played too much, but with the current state of the game, I have no desire to continue playing it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super cool game until they summarily executed the development because they felt like it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is absolutely awful, for starters you can't actually design your own hull as shown on the store page, the campaign is boring and over complicated,  the Naval Academy missions are ******** impossible, there are so many rules and borders of where you can place things and how heavy something can be that it leads you to just have to design an entirely different ship than what you originally planned on.  I would 100% get a refund if I could but I had just over double two hours(Steam's refund policy).  Please don't waste your money on this piece of ****.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "DO NOT BUY GAMES FROM THESE DEVS!!! Started off looking good for this game. Devs quickly let it die off because they don't care....Along with all of their other games especially naval action. Devs will blatantly ban from their forums, discord and games, anyone who bad-mouths them. DO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This dev is now notorious for starting early access titles, collecting paychecks, and then abandoning the projects.  Well done, Chaps.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While the ship designer and combat are great, just about everything else isn't. The campaign is deeply flawed (want to improve relations with France? roll a dice lmao) and if you're not one of the larger countries with giant GDPs your naval budget will suffer if you want to stay competitive, all while other countries admirals are sacked for excessive naval expenditures every couple months.. and then continues to spend excessively. Meaning the AI isn't punished for this at all because a new admiral gets into office and does the exact same things. Its a lose condition for you, though.\n\nThere isnt much player agency. Aforementioned dice roll relations, and you can only *influence* the government on certain things. I.e. peace treaties. After sitting in your 20-hour campaign you finally get to war, they fold instantly and lose a couple BBs (because the AI sucks at building ships - ill get to that later), ask for peace, but you want a greater reward at the end so you want to fight on. Tough shit because their admiral 'intervened' and managed to get a peace treaty, meaning you only get some 300M$ as reparations. Woohoo. The justification being \"you're only the head of admiralty, not the government\" - which is just terrible justification?? I should have more control - games are meant to be fun and this isn't it.\nYour research department is controlled via a slider and assigning priorities. You can't tell them to make a Mk.III 16\" gun, they have to make a 20\" Mk.I first. This also goes for the other 2 sliders, transport capacity (increases gdp) and crew training, minus assignable priorities. There isn't much depth.\nYour port capacity is increased solely by GDP. This means you cant expand ports of strategic importance (i.e. Pearl Harbour) any meaningful amount. It might expand by 20k tons over the course of 10 years, but by that time you've gone from ~40k ton dreadnoughts to ~80k ton modern battleships. Small ports end up being largely useless because of this.\n\nThe AI just isn't really a good opponent. Their CLs and DDs will have high top speeds and next to no armor while also building hundreds of them. Which they will then send directly towards you in swarms in the hopes of getting some torpedo hits (which they hardly do - and if they do, they dont do much) to then get mulched by your battle line. Rinse and repeat. Many many times my ships have ended an engagement with >90% structural/buoyancy while having decimated a multitude of enemy ships. I'm actually at greater risk of running out of ammo.\nAs for their capital ships, they'll end up designing 'modern' battleships with 4 different calibers of secondary guns, all more or less randomly generated. Same for barrel length. And even if they have access to Modern II armor (the best and lightest armor available) they will still often go for Krupp III instead. Or Coinc. II rangefinders (max being V). They'll also block off significant portions of their turret traverse with 2\" guns. Or use Mk.1 guns which have terrible rates of fire and even worse accuracy.. and then try to snipe with it.\n\nNow for the campaign. Submarines are implemented terribly. You can't go to actual battle, instead all of it being auto-resolve. So your battleship taskforce surrounded with 12 destroyers all equipped with the most powerful depth charges available, RDF, and state-of-the-art sonar and radar can end up losing your brand new superbattleship to 3 enemy submarines. And then there's minefields. Again you cant do anything about these so your new modern battleship can get their shit rocked by minefields despite your ships having amazing minesweeping capability. And then theres land wars.. which you cant control at all. You can be losing provinces while dominating the sea and theres nothing you can really do about it. Honestly i think the game should have just said that land wars are trench warfare (unlike real life) so the seas make the major difference - or give us control over the army.\nEngaging enemy taskforces is awful - you can plot an interception course to engage their fleets while being closer to the interception point than them (and with higher cruising speeds) and they'll somehow slip right by with no combat. You also have no control over minor allies. You can play as the USA and Canada can end up allying with Italy due to random chance. There's no way to influence this.\nThe type of government you have (for democracy, who's voted into office) also affects gameplay, but theres no way to change this.\nThe map also lacks the most basic of QoL. It doesn't wrap around at all, and it doesnt even teleport your camera to the other side at bare minimum.\n\nOverall the best way to describe the campaign (as someone else put it) is \"watching TV\". You can't influence much of anything so you're just sitting there watching what comes on.\n\nDon't buy unless some modder comes along and fixes the game. Except pirate it instead of giving money to the developers who released this (\"\"finished\"\") product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game was abandoned without ever being properly completed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the trailer shows that you can change portions of the hull but you cannot do that in game there are only premade hulls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was a good game. The studio was bought out by a shitty publisher who wanted something that they couldn't do and shuttered them before they finished the game. Do not give this new publisher money for this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "dosnt matter what you do you cant sink anything and distroyers sink your battleship with its guns pure crap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately the game feels very unfinished.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}