{
  "positive": [
    {
      "review": "I heavily regret letting the weird name and the art put me off this game. I didn't play Portia for the same reason. \n\nThis game has taken over my life. It's a little overwhelming until you get the hang of things but it's so worth it.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "I was a huge fan of the first game, even though My Time at Portia felt a bit unpolished. The graphics and animations were a little ugly and the game itself could be glitchy, but the storytelling and mechanics were so good that I could overlook those things.\n\nThis game blows My Time at Portia out of the water. The game has arguably more polish (I can now have long hair that blows in the wind), the mechanics are more in depth, and the lore continues to expand. The characters are just as in depth as the ones from the original title and little references to the first game make this world feel even more alive. All of this to say: Pathea's writing team deserves a raise, the storytelling in the My Time series is incredible. \n\nAnd the soundtrack. Oh my god. You could tell me the Sandstorm soundtrack was from Red Dead 2 and I'd believe you. \n\nI've grown to love the art style, and I'm not sure about how I feel about them changing it so drastically for Evershine. The only thing I have to complain about is the fact that not all of the dialogue is voice acted, which kind of does break my immersion and removes some of that polish.\n\nBut overall, I love this game and I'd definitely recommend it :)",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Absolutely one of the best cozy games I have ever played. 100% recommend it to anyone in love with the genre. This game brought me smiles and tears, and I am very excited for the sequel!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Very enjoyable.  Leisurely paced game.  Can get a bit busy if you take on too many jobs.  Super fun.  Love the story and the characters.  So much to do!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I enjoyed the vanilla game and liked the dlc content but you can enjoy the game without them.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Obožujem to igro, moj najljubši del je vzreja živali, ker so tako prikupne. Rada igram s svojim fantom, ta igra je odlična za pare in ponuja odlično ekipno delo",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Lovely game. Very cute! Similar to Animal Crossing AND you can play it with friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Delightfully charming and relaxing. A great option for Stardew Valley lovers (more focus on production, less on farming, but otherwise very similar gameplay loops), and for those who enjoyed My Time at Portia then this is a very nicely refined and polished sequel. Very happy with my purchase.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the \"My Time\" games. They are nice and chill.\nSandrock is the 2nd game in the series and is more refined compared to the first game (no need to carry most items in your inventory when completing orders for instance). You do a lot of stuff in the My Time games; Build machines, enhance the town you are in, mine, chop wood, clearing dungeons, farm, develop relationships and a ton more. It also has a lot of main and side missions to do. There's basically something happening each day, you'll never get bored.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3600326871 https://steamcommunity.com/sharedfiles/filedetails/?id=3602973117\n\nI would recommend playing Portia first, but it's not required. It's also a really good game. I can't wait for the 3rd game in the series! Graphics are nice and crisp, vo is great and so is the music and missions.\n\n9/10 from me.\n\nhttps://store.steampowered.com/app/666140/My_Time_at_Portia/",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Way more put together than Portia and has a lot more to offer. Love the story line, the character differences in personality and the relationship building. Can't wait for the next 'My Time' Game to release. :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My Time at Sandrock is a charming and surprisingly deep game that kept me hooked from the start. The cast is easily one of the strongest parts of the game, with a wide variety of characters who all feel distinct in design, personality and backstory. The main story is lengthy and engaging, especially the whole ordeal with Logan and his gang. I also enjoyed the freedom to customise the workshop and house in any shape or style I wanted, but the camera in Edit mode needs some work. Also, the machines pulls items from both our chests and inventory, which is one of my favourite features in crafting games like this. \r\n\r\nHowever, the game could use many quality of life fixes, as certain resources require heavy grinding, mounts sometimes get stuck in awkward spots, and the factory does not clearly display required materials for large blueprints. My biggest issue was the save system, which occasionally failed to store progress properly. More than once I loaded the game only to find hours of progress missing, and I am far from alone in having that problem. Voice acting quality is mixed, with some lines sounding stiff or grating, and cutscenes often rush through dialogue at an unnatural pace. Game performance can also dip noticeably with lag and stuttering, especially in late game, even on stronger PCs.\r\n\r\nDespite the flaws, I still had a great time with My Time at Sandrock. I will definitely be keeping an eye out for the developers’ next title, My Time at Evershine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you love Stardew Valley, you will love My Time at Sandrock (MTAS). I was deeply invested in the story and loved the unexpected twists and turns. While definitely a \"feel good\" game, there were definitely some moments of pure suspense and anxious anticipation.  The romance aspect of this game is also excellent, while some romance options have more dialogue and events than others, I felt MTAS fulfilled my high expectations coming off of the back of Baldur's Gate 3/Stardew Valley romance needs/wants. Gameplay wise I had a really great time around the crafting-centered gameplay, intuitive combat, and exploration of mines and gathering of resources, and the multitude of side/main quests the game throws at you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is PHENOMENAL! There's HUNDREDS of hours of content and it's an interesting and involved storyline that sucks you in immediately and never lets go!  Given the hours and hours of game play, this game is a steal on Steam - so grab it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although farming is not the main focus of this game, I find it more relaxing and cozy than Stardew Valley itself. Especially at the beginning, where almost everyone is extremely friendly, loaning you some extra money, free food, and later on even a horse. I really hate when a game sells you this cozy vibe but makes you go through hell at the start and forces you to work like crazy to feel a bit of comfort. This is not the case with this one, and I'll be forever grateful for the relaxing experience. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the My Time games. This one had some interesting story plots I was not expecting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute, progress is consistent enough to not do exactly the same thing over but can be a bit repetitive even with some hazards being added over time. QOL mods look like they are just added to the main game if they are well received which is cool. \r\n\r\nStory is a little predictable but that's not awful. Social aspect is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a -lot- of issues, but none of those issues are a major obstacle to the fun factor. If you want to play Stardew Valley in 3D, this is the game for you.\r\n\r\nGood:\r\n\r\n• Good and long story\r\n• Endearing three-dimensional NPCs\r\n• Satisfying gathering and crafting systems\r\n• Lots of content (every time you've reached the end, the map expands again, and again)\r\n• The game has a quicksave key. This is amazing, especially in regards to mitigating the impact of certain game-breaking bugs (see below).\r\n• The voice acting (at least the English VAs) is amazing, for the most part. And there are a -lot- of recorded lines.\r\n\r\nNeutral:\r\n\r\n• Stamina. Like other games of this type, stamina is required for all actions and only regenerates when you go to sleep. This system is necessary for the game to work, but it's not flawless. For instance, I dislike the fact that combat also costs stamina, in a game where enemies linger around most gathering nodes (meaning you have to choose between either killing the enemies and wasting stamina, or tanking unnecessary hits).\r\n• The character creator is okay, but not amazing. You have free RGB selection of skin and hair colour, but you can only choose from a set of preset faces without any real facial feature fine-tuning possible afterwards. I also find the hairstyles a bit lacking, but that's subjective.\r\n• The music is okay. Not a soundtrack I'd listen to outside of the game though.\r\n• I found the clothing choices somewhat lacking, but that's of course also subjective. The game does have a severe and disturbing lack of black and purple clothes though.\r\n\r\nBad:\r\n\r\n• Bugs. This game has more bugs than any game I've played in recent years (and some of them are quite game-breaking, like broken cutscenes, vanishing NPCs or NPCs that teleport into the sky and are now uninteractable, or outright softlocks as something doesn't load right).\r\n• The performance is not great. The more moving pieces are in the scene, the worse it gets. This also means that the game really struggles if you expand and decorate your workshop to its maximum potential.\r\n• Combat. I was personally not a fan of it. More tedious than anything. There is no depth at all with each weapon type only having a 5-hit key-mash combo, but that part's to be expected in a game like this. But each weapon animation also leaves you completely immobile during the animation (think: Monster Hunter), which is very frustrating in a game where the enemies are constantly moving around while you're fighting them.\r\n• The progression feels a bit \"off\". In the early game you'll never have enough stamina to gather all the resources you need for missions; by endgame you'll have more resources than you'll know what to do with and will be going to bed with a full stamina bar most days, since there's just nothing you can productively spend it on anymore. I would have preferred it if the early game items/commissions cost less resources to make and the late game items/commissions cost considerably more resources to make to balance the stamina consumption a bit better. This is, all things considered, a minor gripe though.\r\n• Commissions (your main way of earning money) are extremely tedious to do. A commission is a villager asking you to build something. They do this by putting up a commission on the commission board. You accept the commission there and then you build the items they want, but in order to actually complete commission, you have to go find and talk to that villager directly. This is extremely frustrating, as (as mentioned above) NPCs randomly teleport across the map or just vanish from the map entirely; alternatively your machines just take too long to make the necessary items and the NPC has gone to bed by then, locking the doors and making the commission not completable on that day (which nets a penalty compared to same-day deliveries). Not to mention that every house, including your own, are a separate instance, separated by a loading screen, so if you have to deliver 4 items to 4 different NPCs in 4 different houses, you have to sit through at least 7 loading screens just to complete those commissions every day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I put way more hours into this game than I expected. Looking forward to the next game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Admittedly this game does still have a few visual bugs, but overall, the story is amazing and well worth the over 100 hours it takes to complete. I love the quality of life improvements that have been made since Portia (which I also loved)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is so much in this game I want to talk about but can't due to spoilers. So to make this simple: you can take your time on the main quests and most side quests! There's pets you can adopt and cuddle!! Its not just restoring a desert town but building a family with them too. 10/10 its the only game I've played for several days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9.5/10. You can pet all the animals in this game, very good game to play with friends. Why -.5? Because of the tree police. The number of times I got caught trying to cut a tree and this guy appears out of nowhere is crazy. Otherwise very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love the My Time series, they're so fun and the story lines are great. My time at Sandrock has some of my favorite characters between the games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! I have it for PC and for my Switch 2. I can't wait for the new installment of this series. The one thing I do not like on the Switch version is that you don't have more than 2 options for upgrading your house. I wish they would change the amount of items you can have on your yard. Otherwise, the game is amazing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game far exceeded my expectations. It reminds me vaguely of Rune Factory, one of my favorite series. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is in my opinion the bestbgame you can buy in Steam if you are looking for something quite relaxed where you feel as though you are making a difference in the world.\nYour actions and what you build as one of the official Builders of Sandrock shape the village and make you feel a sense of progression throughout. \nHe relationships you form through your journey are rewarding and feel realistic, as people want to hang out with you or give you gifts.\nThe combat element is relatively easy and is very enjoyable, I really recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just started playing about a week ago, and haven't been able to stop. The dichotomy of the adorable, vibrant graphics and the terrifying post-apocalyptic storyline running underneath, brings such a deep realism to the world. I love finding new world lore, along with the depth of characters and events that really affect how you play your game is wonderful. Parts of the story really impact your relationship with the Sandrockians, and impact the world around you and I love that part. It keeps things interesting and helps you feel motivated to keep going.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down one of the GREATEST games i have ever played. Not many games achieve the emotional depth, whimsy and creativity this game does. The story is well written, incredibly well paced and by the end you are sad its done but also struck with thesheer magnitude of the impact your actions had in transforming all aspects of Sandrock. Worth every cent and every second",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If I had a dollar for every time a kidnapping occurred in this game, I'd have $3. Which is not a lot of money, but THREE DAMN TIMES?!!?!??! 10/10 would witness 3 kidnappings again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. It's a bit emotional when it comes to Fang. Ugh, my heart! I think the fact that they use voices is what gets to you. The best part is that you get to build (not houses but like bridge parts or a water tower, machines, and things like that). And when you have to fight you grow to be so overpowered it's a piece of cake. I like that. Just a bit of challenge and not something you have to go around fighint endless enemies to try to up your skills.  There are times you have to grind for supplies and skill improvement, but it's useful for commissions. Some like the grind. I like it to a degree. There is farming as well, and I farmed very little the first time around. It's not the focus for sure.  The cooking mechanic is better in Sandrock than it was in Portia, by far. Anyway, Sandrock is an excellent game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool building game with funny and very in depth characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game. There's so much to do. It's everything Portia was but better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A vast improvement from its predecessor My Time at Portia, and a great game even without the comparison. For anyone wondering, you do not have to play My Time at Portia to enjoy and understand this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like playing games that allow building friendships and romantic relationships with NPC's, unfortunately most all of the games I've played don't have much depth with unique characters that I actually want to date, Characters can be so bland that they all seem cut from the same cookie cutter mold. When there's not much personality or style difference separating characters I'll abandon romance all together because I feel they're too similar so whats the point. Rune factory, Harvest moon, Coral Island, Sunnyside to name a few. \r\n Sandrock is a pretty amazing game. All the male/female dating options have a different style and unique personality. I enjoy getting to know each character and finding out more about them. The gameplay is fun and relaxing, it never feels tense or stressful. You can go on fun romantic dates with characters, spend time talking and getting to know more about them, playing different games or riding around on a horse together. I like being a builder instead of a farmer, its really nice building things with the machines in my backyard, and the machine sounds are so soothing which adds to the relaxing atmosphere. \r\n The setting of Sandrock is a desert steampunk cowboy western town which is extremely nice and vastly different than most games of this type, to me it  gives off an amazing Cowboy Bebop vibe that I can't resist. I know the developer Pathea has moved on to working on My time at Evershine but My time at Sandrock is so enjoyable that I wish it was much longer with more characters, stories and DLC. Ive been playing it for nearly 300 hours and haven't reached end game, not that I want too.\r\n I hope Pathea continues to expand on romance and friendship options, no other game I've played even comes close to the depth Pathea has regarding relationship building. Try giving a romance partner the same gift two days in a row and they wont like it as much and they will comment about it. Some NPC's will ask you out, or give you gifts. I was amazed that on my birthday characters were giving me gifts, this really makes the game world seem alive, Sandrock is just amazing if you're into relationship building like I am. I give it 5 stars and highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love the My Time games and Sandrock is no different! Each of the characters have a unique arc with their own quests. I really love the idea of \"flirting\" and how that can affect your relationship with the NPCs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm really enjoying this game. The story is good, the characters are interesting and the game play is fun. The most frustrating part is probably the combat honestly but that is the biggest let down but considering it isn't the focus of the game, it's fine. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is good, but runs into the same issues My Time in Portia had. Mainly the pacing and the endgame grind. I’m sitting at about 63 hours right now, and “How Long to Beat” says the main story averages 83+ hours, but honestly I think I’m done here.\n\nAt this point, every day in the game is basically wake up, reset all my machines, talk to a couple people, and by like noon I’ve already burned through everything and feel like resetting the day. Some missions also expect you to do side quests, but they don’t actually tell you that. And then you’ve got other quests where you hit a milestone and then game wants you to wait 7 in game days, but again doesn't tell you that.\n\nAt this point, I’ve got more than enough resources for everything, but the real wall I hit is the level requirement. My next quest recommends level 45 or 46 or something like that, but the one before it only had me reach level 39. I really don’t feel like grinding combat XP for literal days just to move the story forward. Especially since I think the combat is the weakest and least enjoyable part of the entire game. \n\nSo yeah. Great game overall, but the pacing and the late game grind kinda detract from my overall satisfaction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My Time at Sandrock is an absolute joy to play. I went in as a big fan of My Time at Portia, but honestly, Sandrock feels more fleshed out in almost every way. The animations, character expressions, and overall polish are a clear step up from the first game, and you can really see that the devs tried to make this its own experience while keeping the core builder aspect front and center.\n\nOne thing I appreciate a lot is that there are fewer super time-restrictive quests compared to Portia. It makes the game feel more relaxed and lets you enjoy the world at your own pace instead of constantly stressing about timers. After 70+ hours, I’m still discovering new things and I haven’t even met all the characters yet, which says a lot about how much content and charm is packed into this game.\n\nIf you enjoyed My Time at Portia or just love cozy builder/life-sim games, I can definitely recommend My Time at Sandrock. I’m sure I’ll be sinking many more hours into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game it's a nice and chill game.\nSandrock is the 2nd game in the series and is more refined compared to the first game (no need to carry most items in your inventory when completing orders for instance). You do a lot of stuff in the My Time games. Build machines, enhance the town you are in, mine, chop wood, clearing dungeons, farm, develop relationships and a ton more. It also has a lot of main and side missions to do. There's basically something happening each day, you'll never get bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Corny a bit, but it's fun and has a lot of things going on with it. Not a bad game ultimately!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wonderful. It has a long, engaging plot and the characters feel amazingly unique. The game play is fun, the combat is intuitive, and it's a genuine joy to play this game. I'm a little sad about not being able to interact with my kids in the game (you've got a theme park and I can't even take them on the rides? Major bummer) but otherwise this is such a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game if you enjoy things in the Harvest Moon/Stardew Valley genre.  It’s a 3D action adventure format instead of a top-down 2D and has a focus on resource gathering and crafting instead of farming but otherwise shares a lot of elements.  Time progression focusing on day to day with a larger calendar with seasons, special events, and social aspects with various townsfolk including marriage/kids.  Progression systems related to gathering, crafting, combat, and social game aspects.  It also has a more well defined story than something like Stardew Valley; there is a central questline which a lot of areas and content tend to be gated by in addition to the normal tiers of tools and resource nodes locked behind better tools progression.\r\n\r\nI also really enjoy the setting.  It’s set well into the recovery period after an apocalypse of some kind so you get to have the developing frontier town feeling but with some amount of recovered technology and steampunk-ish flavor.  Something about the optimistic tone you usually have in life/social sim game in the Stardew Valley genre pairs adds a nice balance to the struggle of rebuilding civilization after an apocalypse.  It’s interesting having some of the resource nodes be things like plastic remnant or metal scrap you can recycle into usable materials.  The dungeons are often decaying old-world ruins like a derelict shopping mall or the decaying office buildings.\r\n\r\nThere are absolutely fantastic quality of life features over any other game in this genre, not tying saving to the end of day sleep and a the slider which changes the in-game passage of time vs. real-world passage of time.  I’ve played Stardew Valley in a way where I’ll path through areas to see where I needed go and then restart, sometimes multiple times when something doesn’t go well or I forget to do something before the time window closes.  This allows saves at any time which is great both to check on small things without having to restart an entire day, or just being able to quit at any time without having to either finish everything or abandon the rest of the usable time in that day.  Being able to set time progression to 60% makes me feel less rushed and more likely to get everything I feel I need to do done in a day.\r\n\r\nI think the most negative thing about it is that it is a pretty big time sink.  I played 200 hours of Stardew Valley and 150 hours of My Time at Portia and I’ll probably clock a similar amount in this one.  Overall, it’s a fantastic game in the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got through humble bundle. Always thought it looked a little silly and childish (I'm early 30s) but I also received a word of mouth recommendation from a friend. HOOOOLY CRAP I am spot on target demographic.\nI will now be buying and playing all the other games now. Highly recommend to all the ladies (and non-ladies) looking to romance some adorable and amazing fictional characters. It's so freaking good!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game, I've been playing the my time series since My time at Portia came out. I have both games on multiple platforms. Can't wait for my time at Evershine to come out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an incredible game. The story and characters are great, and there is a ton of playable content. 140+ hours in and I'm still working through quests :) You can tell the devs really put their heart and soul into the game.  10/10, can't wait for future Pathea games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has genuinely fun and interesting gameplay. While it's a typical cozy farming simulator—a genre where many games seem to copy each other—this one proves that the execution is far more important than just having new ideas. The main issue that holds it back is the story, which is hurt by too many \"mid\" characters that the game pushes into the main plot. The visual style is excellent. Overall, the strong gameplay loop makes this a great addition to the genre. 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game and I recommend the entire series to anyone who's looking for a new franchise to get into!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IMO a better stardew, crafting is nice and complex, the game has a lot of internal guides to help you if youre lost, the npcs actaully feel like people with birthdays and like and dislikes and relationships with the other npcs, honestly great game looking forward to the next one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game despite all the characters looking more inbred than a toddler in Alabama",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I thought this looked fun on a whim and 100 hours later I'm giving the hot doctor who won't speak to me scorpions every day just so i can hear him say \"hm\"\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this for my boyfriend, to play [b]multiplayer [/b] with. And well, after 50~ hour we decided we could not do anything more. The story was lacking, elements were missing, the NPC's seemed irrelevant. It just seemed empty and unfinished? This was when the game wasn't finished bear in mind, but from what I've heard, it haven't improved much.\n\nBut [b] singleplayer! [/b] is sooo good! I've got over 150 hours on my save alone, and I still don't feel like I am done with anything in the game. I've got more story, more to collect, not full friends with everyone etc. I can have chill days where I just mine or go in the workshop, or I go out explore on my horse and fight monsters. Everything is voiceacted, and so good.\n\nMulitplayer? Wouldn't recommend\nSingleplayer? 100% yes, a very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE RELEASE ME I WANT 100% BUT HELP I CANT STOP BECAUSE THIS GAME IS A MASTERPIECE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game. Became my all time favorite. Save a horse ride a cowboy ladiessss!!!🤠",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you liked Portia, you're going to love Sandrock!  Quality of like upgrades, plus the pets actually do something!  I recommend slowing time for longer days so you can fit everything in!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like My Time at Portia, you'll love this - QoL improvements (you can upgrade old workstations, things don't need to be on the hotbar to make stuff on the Assembly Station), greater depth of story, fun items designed by Kickstarter backers (I assume but some weapons have 'designed by:' in their descriptions) (also, whomever designed Tony, that's my fav weapon in the game so thanks!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it.  Cozy, decisions and a bit of fighting too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this better than \"My time at Portia\". I feel like there's a bit more of an idea of what to do. Lots of mini quests, commissions, always something to do, and most importantly, conserve water!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My Time at Portia's younger, hotter sister who does just about everything she tried to but better. Tons of QoL upgrades, the townsfolk are way more interesting as characters and genuinely grew on me by the end, and both the main story and side quests feel a lot more fleshed out and cohesive. This is like if the post-apocalypse, desert aesthetic of New Vegas was merged with the general vibes of stardew valley. The comedy is also weirdly on point with some of its self-parody and earned more than a few chuckles out of me. I do wish that the building/yard customization system was a bit more free with the placement of certain objects, but thats a minor gripe. A wider variety of base game outfits would've also been nice; its surprisingly hard to find a nice dress/suit, etc. Meanwhile the bloody commissioner walks around dressed up like an old timey con man and won't tell you who his tailor is (it's probably Vivi).\n\nThat about sums up Sandrock over Portia: stronger writing and tighter gameplay. If this is the progress they made since My Time at Portia, then I will be watching My Time at Evershine with great interest.\n\nAlso fuck Yan. All my homies hate Yan.\n\n8.5 secretly evil conspirators plotting the regions downfall, out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "500+ hours and still playing...MTAS is an excellent game!<3<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An awesome game. Started a new round (my third one) while waiting for Evershine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it gets a little grindy with getting resources but good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My playtime on MTASR alone should indicate my love for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What Works\n\nCrafting & commissions: Crafting feels streamlined, with machines that can be queued and materials pulled from storage, making commissions satisfying and efficient.\n\nDesert survival layer: Scarce water and resources add a layer of planning and strategy to daily routines, keeping gameplay engaging.\n\nQuality-of-life improvements: Saving at any time allows for experimentation without concern for losing progress.\n\nSocial systems: Interactions with characters feel meaningful, with quests and relationship options that make connections rewarding.\n\nRuins exploration: Abandoned ruins are engaging, with varied designs and challenges that make each expedition enjoyable.\n\nWhat Falls Short\n\nPerformance issues: Occasional pop-ins and texture glitches can be distracting.\n\nRepetitive: After completing multiple quests and fighting mobs, the gameplay feels repetitive. \n\nCompared to its predecessor,  My Time At Portia, Sandrock is more polished and strategic, with smoother crafting, exploration, and social systems. Despite minor performance and animation issues, it provides a satisfying and immersive life-sim experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "living my dreams, i have land, money, and a boyfriend (who might or might not be a spy)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pathea listens to the fans.  They deserve everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Un isekai donde reencarnas como albañil\nes mas divertido de lo que suena",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have never been more wanting to collect all the animals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game fun a game you just cant stop playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything about this game is on point",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game so muchhh💖💖",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game!\r\nunique!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sooo good i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright i guess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is OK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pog game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chill vibesssssss mayyyneeee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you played/liked My Time at Portia, you will love this one!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It has content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lop lop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "+",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel a bit mixed right now. While Sandrock is a lovely game with a lot of care obviously put into it, there are a few things that hold it back from being one of my all-time favorite cozy games. For one, it took me 3 tries to even get into the game because it's very overwhelming at the start. I don't know why on my 3rd attempt it just clicked for some reason and I played obsessively, like hours at a time, to the point I didn't even want to stop to eat. And then I realized I was only 1/3rd through the story at 50+ hours... and the person I wanted to romance wasn't even available yet and still wouldn't be for a long time... so I stepped away from the game. Played a few other things. Realized I really wanted to continue the story after all, so I came back and put in another 10 hours, only to barely make a dent in said story. Honestly I just can't do it anymore. I know some people can spend hundreds of hours in one game but I just can't (unless it's Persona or Xenoblade). I prefer games to have a solid 30-50 hours and then move on. So I guess this review is just a counterpoint to all those gushing over the game who have 100+ hours. Yes, it's a great game, and you will get value for your money. But in my case it's just too long for me to get to the stuff I actually want to see and in the meantime I'm too burnt out to continue. Maybe I will try again someday, who knows.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "I heavily regret letting the weird name and the art put me off this game. I didn't play Portia for the same reason. \n\nThis game has taken over my life. It's a little overwhelming until you get the hang of things but it's so worth it.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "For those who played My Time at Portia, this sequel feels more like an evolution than a revolution. If you enjoyed the first game, you’ll have a great time with My Time at Sandrock as well.\n\nIf this is your first encounter with the series, think of it as a 3D version of Stardew Valley — but with a stronger focus on crafting and item production rather than farming, which plays a smaller, supporting role here.\n\nWhether you’re a returning fan or a newcomer, I wholeheartedly recommend giving this game a try.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I was a huge fan of the first game, even though My Time at Portia felt a bit unpolished. The graphics and animations were a little ugly and the game itself could be glitchy, but the storytelling and mechanics were so good that I could overlook those things.\n\nThis game blows My Time at Portia out of the water. The game has arguably more polish (I can now have long hair that blows in the wind), the mechanics are more in depth, and the lore continues to expand. The characters are just as in depth as the ones from the original title and little references to the first game make this world feel even more alive. All of this to say: Pathea's writing team deserves a raise, the storytelling in the My Time series is incredible. \n\nAnd the soundtrack. Oh my god. You could tell me the Sandstorm soundtrack was from Red Dead 2 and I'd believe you. \n\nI've grown to love the art style, and I'm not sure about how I feel about them changing it so drastically for Evershine. The only thing I have to complain about is the fact that not all of the dialogue is voice acted, which kind of does break my immersion and removes some of that polish.\n\nBut overall, I love this game and I'd definitely recommend it :)",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "wish I could forget playing this game, just so I would be able to experience it for the first time all over again",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This game is amazing.\r\nFrom the gameplay to the lore, this game is for casual and hardcore gamers alike. The lore is extremely rich and deep and it will keep you invested. I recommend this to anyone.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Truly a HUGE upgrade after My Time at Portia; very interesting story linking to the environmental, likeable bachelors and bacheloretes, and interesting casts of NPCs that I couldn't help but root. I truly feel like a part of the community even though our house is quite far from town. The combat system also got more enjoyable rather than the previous game. If you quite enjoy their previous series or haven't play any of My Time series, totally try this game! You won't regret it, yeehaw! P.S. can't wait for your next My Time too Pathea!",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Genuinely one of the best games I've ever played. MTaS really has everything you could ever want in an RPG. I'm a 100 hours in and am slowly progressing towards the end of the story, though I know there's a lot left to do. Absolutely loving every second with this game.",
      "voted_up": true,
      "votes_helpful": 9
    }
  ],
  "negative": [
    {
      "review": "I played this game for about 60 hours, enjoyed it, put it down, then came back months later to restart and played another 60 hours.  I would have played past that if I didn't encounter a game-breaking bug at that point that has rendered the game useless to me (I cannot play on any save or any form).  That was more than a year ago and that bug has never been fixed, my reports seem to have been totally ignored, and the cherry on top?  When I googled it, I found out that the exact same bug was present in their previous game, My Time at Portia.  This makes me very skeptical that I will have a positive, bug-free experience with their new game.  It's worth playing... if it works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A game that allows Chinese people to spam hundreds of friend requests and invites to a PRIVATE multiplayer town, with no way to block them on Steam or in game is unacceptaple.\n\nEven after you accept them as a friend, which is the only way to BLOCK them in game, they can still spam you over and over.\n\nTo allow this kind of harassment is enough to make this game non multiplayer functional. It made my friend and I completely stop playing.\n\nThe devs should be forced to give refunds to all players that request it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this because I was promised co-op.  This game doesn't have co-op, it has a half-baked sandbox pile of shit that doesn't include the main storyline.  What the actual fuck is the point?  Incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's fine, but I remember enjoying Portia more. This game's main quest progresses way too slowly. Since the main quest unlocks things, it just feels like a hard lock. There are typically multiple in game days between steps in the main quest and this is where all the time is wasted. Sometimes you could simply skip days, other times you have a \"meet in the evening at this place\" to progress the quest. Maybe you don't actually have to, I haven't risked it...but this means I have to either speed up the game timer or find some way to use the whole day.\n\nThis wasn't a problem early game, but I'd say it's been a slog since about hour 30. Looking at the list of main quests, it doesn't look like I'm even halfway through.\n\nI don't want to be rushed. I like the cozy aspect. I think it would be a lot better if the next quest just triggered immediately instead of days later. I don't think it would ruin any sense of \"realism\"...there's plenty of \"hurry up!\" dialogue that makes you think an actual world is progressing without you; it's not, it will wait for you. Knowing this, I don't see any harm in removing arbitrary delays.\n\nPlenty of other things have improved since Portia but the pacing makes me prefer the first game. Worth playing if you don't mind a very slow experience past the early stages. But I wouldn't say I recommend it.\n\nEdit: And it's so buggy...nothing gamebreaking, just constant annoyances. I don't remember the last game I played that was this buggy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have 113 hours into this game and I played and finished My Time at Portia.  Upon beating the main story I got the Steam achievement “Jewel of the Eufaula – Complete the main story.”… 8.2% of players have that achievement.  I really wanted to like this game, but there are way more bad things than good, so it is uneven and just not a good game in my opinion.\r\n\r\nSo how come only 8.2% of the people playing finsihed the main story?!?!?  Well, the games story plays out of order.  You WILL feel like you have finished the main story about 80 hours in.  The story line will FEEL like the end, but its not.  Everything after that main story end feeling is boring and very repetitive. \r\n\r\nIts like they just threw in some extra crap to keep you busy for no real reason.  They introduce new people you can have relationships with, be friends with and might make you mad you are married to who you have,  they give you armor and weapons you are not high enough level to use, and have ruins that are level 80-90, but no quests or reason to do them… When I bet the game I JUST hit 50, to get to 80 is crazy.\r\n\r\nAlso the pacing of this game is off.  You don’t need to unlock most of the shop land and only need the best workstation (I NEVER used the factory, it was not needed or required to use).  The UI is pretty bad after you use it for a while. ALWAYS having the “new” icon on everything is super annoying and you can’t clear them very easy at all.  The skill tree is super pointless and you end up getting most of the useful stuff very quick then the rest of the game you are just filling blank spot that don’t mean anything.  Why do I want to put points in sword and shield when I use dagger weapons??\r\n\r\nThere are lots of things that make the game more annoying vs helping.  At one point I had to make some bush sculptures, but I needed a certain kind of plant… which I didn’t have and I could only get from growing it.  Growing TAKES FOREVER, so I was locked into playing hours to let the plants grow OR sleep over and over to make time fly.  You also cannot do anything to speed time up.  If I run out of things to do at 3pm, but I need to meet someone at 10pm, I have to find something to do for that time.\r\n\r\nPortia is a MUCH better game outside of the graphic and size of the land (which has its own issues… there is TONS of space, but you don’t and won’t use/see most of it).\r\n\r\nI’ll still give My time at Evershine a chance since they could fix most of the bad things in this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried to like Sandrock. I really did, I put several days into playing the game.\r\n\r\nBut there are just way, way, WAY too many little tiny bad ideas that all pile up into an unplayable mess.\r\n\r\nStamina runs out WAY too quick, you can't even finish a single day before running dry.\r\nFood barely restores ~10 Stamina, IF you're lucky. No point in even carrying any.\r\nEverything costs so much money, you'd have to grind for weeks to buy a rug.\r\nEvery upgrade requires MULTIPLE DAYS to unlock - finishing the entire tree would take MONTHS.\r\nAll of the NPCs have page after page after page of pointless blathering dialog. They just don't shut up!\r\n\r\nAnd the control scheme! Why, for loot's sake, is TRIANGLE the main action key?! It took me ages to relearn the muscle memory when virtually every other game uses Cross as main action. I couldn't find any options to rebind the keys.\r\n\r\nThe game does NOT remind you of enough viable data, so you will most likely miss several important dates. You're punished for cutting down trees \"near the city limits\", but those limits are not shown on the map! So I tried cutting down trees so far out in the desert, they didn't render when viewed from town... and STILL got dinged for it!\r\n\r\nAnd even after spending almost an entire year in-game, my Workshop rating was... 4.\r\n\r\nThis game is disgustingly imbalanced. I 100%'s three other farming sims this year and loved them all; Moonstone Island, Coral Island, and good ol' Stardew Valley. Each had their own minor flaws, but each could be tolerated for what they offered.\r\n\r\nBut Sandrock has ALL of the flaws of those other sims, plus tons more.\r\n\r\nThis just is not a comfortable game to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The lore, story, world bulding, voice acting and art design are very good.\n\nBut anything gameplay-related is ass. I don't even understand it myself. Portia was great vom beginning to finish. But this one is ... painfully slow. They are really similar and as its successor it should be better, right? But it isn't. In Portia, every day seemed like an opportunity and your schedule was tight. Here, it is slow. The pacing is really bad. And the loading times and animation whenever you start a conversation, open the inventory, go through a door etc. are such a time waster.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "в коопе урезан сюжет(полностью)\r\nв коопе уебищный сюжет \r\nв коопе картонные персонажи\r\nв коопе только фарм, картонный уебищный\r\n\r\nпидарасы на разрабах уже делают 3 часть, пока эта незакончена и обещания не выполнены\r\nследующая часть выглядит как такой же кусок говна с древними анимациями, каменными еблами и рагрузками при входе в дом в 2025 году\r\n\r\nбюджет игры 12 миллионов долларов",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game looks alright, wanted to give it a shot on multiplayer with my brother but wasn't able to play hardly any of the game because I spent most of my time in loading screens and in between crashes which happened probably a dozen times. I cant speak to the game itself, it seems ok but the crashes makes it unplayable at least in multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After being out for 2 years the game still has many bugs and lacks QoL features:\r\n- the game not pausing when talking to a character so you have to strain to listen to people while others talk in the background\r\n- no \"auto-play\" setting (which should be on by default anyways) so you have to manually advance every single dialogue line (which is like 80% of the game and gets extremely tedious and annoying)\r\n- only being able to track 2 quests at a time despite being able to take up to 5 commissions a day (3 build, 2 monster hunter), in addition to side/main quests which you may want to ALSO track\r\n- side quests expiring without proper warning and no way to retry them if they expired in the background without your knowledge (the game doesn't sufficiently notify you of quests when they are timed, they rely on you checking in your quest log for every single quest)\r\n- horrible UI where when you pick up an item from a machine and then quickly enter a machine's UI the pickup icons overlay the recipe window so you have to wait a few seconds for that UI element to disappear before you can choose a recipe\r\n- Chinese language/symbols appearing in the English game in certain spots\r\n\r\nIt's clear that the developers didn't care about creating the best possible game, but rather rushing it out the door without proper post-launch support.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A bit on the fence on this one. The biggest issue are the bugs. No complete progression locks yet, but looks to be memory leaks, quests that don't look at existing completion, etc.\n\nA lot of missable content in the game if you don't play a certain way.\n\n\nSome bug examples:\n\n\nThere are bugs like if you complete an objective before receiving the quest, the game has trouble with recognizing it, which could lead to quests that can't be completed if a non-respawning resource/target is required.\n\nThere are invisible walls all over the place instead of logical walls.\n\nAllies (and enemies) that will target each other through walls in certain situations.\n\nCertain progress not being tracked properly when allies do the final hit on a target you almost killed.\n\nJournal progress that isn't tracked properly and new marks that can't be cleared because the progress isn't tracked properly.\n\nThe game also will ignore your current gear for missions if you have better gear.\n\nEnemies and allies can have their AI break; Sandy is especially an issue since Sandy will start teleporting around town, making it effectively impossible to interact.\n\nThere are beneficial bugs too, like certain quest objects will keep respawning until you reach a certain progression.\n\nYou also have issues like where the quest tracker doesn't properly track progression on craftable items and the materials if the item is in the queue.  That one I don't blame them for since it would give a pretty significant hit to performance.\n\nThere are semi-bugs as well and a few annoyances. Annoyances include if your mount walks onto a machine and other overloaded buttons, that you can't set the default to run. (Rolling is faster than running, so that is something that requires generous run button usage until you get a mount).\n\nYou have quest-related items that you can't sell or drop, but can gift and can end up with multiple copies of.\n\nThe game has odd choices where sometimes the game will take you straight to a destination (even if you are in the middle of something) and sometimes the game will give you a choice and sometimes the game will just leave you in place.\n\nA few hitboxes that are just a bit off.\n\nThe broom icon on machines that don't need sweeping.\n\nSome very odd design choices (enemies don't trigger electric fences, but can be damaged by them if you run into the fence, for example).\n\nEnemies can walk on air, making them near-impossible to hit in some cases.\n\netc.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I really want to like this game and review it positively but it's got so many little frustrating things going on that a decent core is really ruined, to the point that I actively quit the game during one such moment and immediately uninstalled it.\n\nThe big things are the random bugs strewn throughout (all the way down to the normal resources near your shop respawning but being invisible for some reason??) which are just quirks at first, but add up, the quest system being seemingly straightforward but doing strange stuff with progression, and for me personally, the thing that drove me insane is the choice to do the \"highlight a new item with a marker until you look at it\" concept, but to the extreme. \n\nI am a person who likes to clear all the little notification flags in a game like this. Every time you find a new thing, it is flagged in your guide, and to get the little flag to go away, you have to pull up the guide, go to the section, probably go to a sub-section, and then half the time, scroll down through a long tiled list of things to find the new one and click on it to have *seen* it, I guess. That would be annoying enough, but not the first game to do something like this, right? Well, guess what, if you pick up a crafting material that you haven't seen before, it's flagged in your inventory, oh wait, no, if you don't have one in your inventory already, it's flagged, whether or not you've seen it before. Again, extra annoying, but I was just sort of putting up with it. That is, until I crafted the station to cook with.\n\nEvery time you open the cooking station, every single item that you can cook with in the window to select from is flagged as if it were a brand new item. Every. Single. Time. WHY?? I thought maybe it was a glitch, and it would go away, but no, every time you go to cook, the game is like HERE'S EVERY ITEM YOU CAN COOK WITH, DO YOU REMEMBER? THEY'RE THE ONLY ONES YOU CAN COOK WITH, BUT YOU DIDN'T LOOK AT EVERY ONE OF THEM THIS PARTICULAR TIME. CHECK IT OUT. (For context, this happening yet again while telling someone about this kind of thing happening is what made me quit and uninstall, it was definitely the last straw of annoyances)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A game that allows Chinese people to spam hundreds of friend requests and invites to a PRIVATE multiplayer town, with no way to block them on Steam or in game is unacceptaple.\n\nEven after you accept them as a friend, which is the only way to BLOCK them in game, they can still spam you over and over.\n\nTo allow this kind of harassment is enough to make this game non multiplayer functional. It made my friend and I completely stop playing.\n\nThe devs should be forced to give refunds to all players that request it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i liked the game, but as i just found out, you can put 200+ hours into the game and once you save sandrock, the game stops showing your saves, making you start all over, even with your save files still there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Exhausting. That’s the best word for this game. I gave it a fair shot with 78 hours logged. At first, it felt like a spiritual successor to Dark Cloud, but it quickly revealed itself as an artificial time sink.\n\nCharacter customization is weak. You can pick a “voice,” but it’s just for grunts while mining or chopping. No actual dialogue.\n\nProgression is slow and padded. You’re constantly waiting for machines to finish, missions to unlock, NPCs to send you plans, etc. To help with this, the game offers ruins, mining, resource gathering, relationships, and exploration, but none of it feels rewarding. Combat is basic and unchallenging. Mines are dull. Once you’ve mined the first level, they are virtually the same. Relic hunting is pointless. The “rewards” given aren’t worth donating the relics, and the Museum felt like an afterthought compared to the previous entry. Raids are mind numbing and I outsourced to the civil corps whenever possible.\n\nRelationships are lifeless. NPCs show up to “play” and walk away before you reach them. Dialogue never changes, even as you grow closer. Outside of main missions, everyone reverts to canned lines.\nExploration is gated and unrewarding. Most treasure chests are junk. Invisible walls block off areas. New zones are locked behind story progression.\n\nEven in 2025, bugs persist. I got stuck in Halloween decor without touching it. During the airship parade, my character glitched into a pickaxe animation loop and couldn’t interact with anything.\n\nToward the end, I realized I wasn’t having fun. I stopped building, skipped days by sleeping early, and sighed every time my character woke up as I dreaded an NPC was waiting for me outside.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this game for about 60 hours, enjoyed it, put it down, then came back months later to restart and played another 60 hours.  I would have played past that if I didn't encounter a game-breaking bug at that point that has rendered the game useless to me (I cannot play on any save or any form).  That was more than a year ago and that bug has never been fixed, my reports seem to have been totally ignored, and the cherry on top?  When I googled it, I found out that the exact same bug was present in their previous game, My Time at Portia.  This makes me very skeptical that I will have a positive, bug-free experience with their new game.  It's worth playing... if it works.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought this because I was promised co-op.  This game doesn't have co-op, it has a half-baked sandbox pile of shit that doesn't include the main storyline.  What the actual fuck is the point?  Incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "GRIND GRIND GRIND THEN WAIT THEN GRIND AGAIN AND AGAIN — im so happy, u can't even imagine\r\n\r\nSolo and co-op modes are totally different. \r\nPlaying solo? Grinding for resources is way tougher. There’s some kind of story but I barely played it because I bought the game to play with a friend so idk how good it really is. \r\nCo-op? Resources drop easy. Feels like u r stuck in this endless loop of build-build-build, zero fun.\r\nThey basically turned co-op into a plain sandbox mode and I don’t get the point. Like, why couldn’t they just add the same story from solo mode and keep sandbox as a separate option? Makes no sense. Im really tired of doing just one mission a day just to get some exp and level up my workshop. Otherwise, there’s nothing new. Progress is slow af.\r\n\r\nI’ve played tons of farming simulators but this one just feels raw and honestly boring as hell. Trust me, u r better off playing Stardew Valley or Minecraft over and over than hoping to find anything new.\r\n\r\nI’ve wanted to try this game since beta but back then there was no multiplayer so it didn’t make much sense for me. Now I finally got it for a really low price.\r\nI fell for all those positive reviews, especially the ones comparing this game to Stardew Valley — but I got totally scammed.\r\n\r\nAnyway, it’s 99% grind and 1% fun. Pretty disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's fine, but I remember enjoying Portia more. This game's main quest progresses way too slowly. Since the main quest unlocks things, it just feels like a hard lock. There are typically multiple in game days between steps in the main quest and this is where all the time is wasted. Sometimes you could simply skip days, other times you have a \"meet in the evening at this place\" to progress the quest. Maybe you don't actually have to, I haven't risked it...but this means I have to either speed up the game timer or find some way to use the whole day.\n\nThis wasn't a problem early game, but I'd say it's been a slog since about hour 30. Looking at the list of main quests, it doesn't look like I'm even halfway through.\n\nI don't want to be rushed. I like the cozy aspect. I think it would be a lot better if the next quest just triggered immediately instead of days later. I don't think it would ruin any sense of \"realism\"...there's plenty of \"hurry up!\" dialogue that makes you think an actual world is progressing without you; it's not, it will wait for you. Knowing this, I don't see any harm in removing arbitrary delays.\n\nPlenty of other things have improved since Portia but the pacing makes me prefer the first game. Worth playing if you don't mind a very slow experience past the early stages. But I wouldn't say I recommend it.\n\nEdit: And it's so buggy...nothing gamebreaking, just constant annoyances. I don't remember the last game I played that was this buggy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have 113 hours into this game and I played and finished My Time at Portia.  Upon beating the main story I got the Steam achievement “Jewel of the Eufaula – Complete the main story.”… 8.2% of players have that achievement.  I really wanted to like this game, but there are way more bad things than good, so it is uneven and just not a good game in my opinion.\r\n\r\nSo how come only 8.2% of the people playing finsihed the main story?!?!?  Well, the games story plays out of order.  You WILL feel like you have finished the main story about 80 hours in.  The story line will FEEL like the end, but its not.  Everything after that main story end feeling is boring and very repetitive. \r\n\r\nIts like they just threw in some extra crap to keep you busy for no real reason.  They introduce new people you can have relationships with, be friends with and might make you mad you are married to who you have,  they give you armor and weapons you are not high enough level to use, and have ruins that are level 80-90, but no quests or reason to do them… When I bet the game I JUST hit 50, to get to 80 is crazy.\r\n\r\nAlso the pacing of this game is off.  You don’t need to unlock most of the shop land and only need the best workstation (I NEVER used the factory, it was not needed or required to use).  The UI is pretty bad after you use it for a while. ALWAYS having the “new” icon on everything is super annoying and you can’t clear them very easy at all.  The skill tree is super pointless and you end up getting most of the useful stuff very quick then the rest of the game you are just filling blank spot that don’t mean anything.  Why do I want to put points in sword and shield when I use dagger weapons??\r\n\r\nThere are lots of things that make the game more annoying vs helping.  At one point I had to make some bush sculptures, but I needed a certain kind of plant… which I didn’t have and I could only get from growing it.  Growing TAKES FOREVER, so I was locked into playing hours to let the plants grow OR sleep over and over to make time fly.  You also cannot do anything to speed time up.  If I run out of things to do at 3pm, but I need to meet someone at 10pm, I have to find something to do for that time.\r\n\r\nPortia is a MUCH better game outside of the graphic and size of the land (which has its own issues… there is TONS of space, but you don’t and won’t use/see most of it).\r\n\r\nI’ll still give My time at Evershine a chance since they could fix most of the bad things in this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried to like Sandrock. I really did, I put several days into playing the game.\r\n\r\nBut there are just way, way, WAY too many little tiny bad ideas that all pile up into an unplayable mess.\r\n\r\nStamina runs out WAY too quick, you can't even finish a single day before running dry.\r\nFood barely restores ~10 Stamina, IF you're lucky. No point in even carrying any.\r\nEverything costs so much money, you'd have to grind for weeks to buy a rug.\r\nEvery upgrade requires MULTIPLE DAYS to unlock - finishing the entire tree would take MONTHS.\r\nAll of the NPCs have page after page after page of pointless blathering dialog. They just don't shut up!\r\n\r\nAnd the control scheme! Why, for loot's sake, is TRIANGLE the main action key?! It took me ages to relearn the muscle memory when virtually every other game uses Cross as main action. I couldn't find any options to rebind the keys.\r\n\r\nThe game does NOT remind you of enough viable data, so you will most likely miss several important dates. You're punished for cutting down trees \"near the city limits\", but those limits are not shown on the map! So I tried cutting down trees so far out in the desert, they didn't render when viewed from town... and STILL got dinged for it!\r\n\r\nAnd even after spending almost an entire year in-game, my Workshop rating was... 4.\r\n\r\nThis game is disgustingly imbalanced. I 100%'s three other farming sims this year and loved them all; Moonstone Island, Coral Island, and good ol' Stardew Valley. Each had their own minor flaws, but each could be tolerated for what they offered.\r\n\r\nBut Sandrock has ALL of the flaws of those other sims, plus tons more.\r\n\r\nThis just is not a comfortable game to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "в коопе урезан сюжет(полностью)\r\nв коопе уебищный сюжет \r\nв коопе картонные персонажи\r\nв коопе только фарм, картонный уебищный\r\n\r\nпидарасы на разрабах уже делают 3 часть, пока эта незакончена и обещания не выполнены\r\nследующая часть выглядит как такой же кусок говна с древними анимациями, каменными еблами и рагрузками при входе в дом в 2025 году\r\n\r\nбюджет игры 12 миллионов долларов",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game looks alright, wanted to give it a shot on multiplayer with my brother but wasn't able to play hardly any of the game because I spent most of my time in loading screens and in between crashes which happened probably a dozen times. I cant speak to the game itself, it seems ok but the crashes makes it unplayable at least in multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After being out for 2 years the game still has many bugs and lacks QoL features:\r\n- the game not pausing when talking to a character so you have to strain to listen to people while others talk in the background\r\n- no \"auto-play\" setting (which should be on by default anyways) so you have to manually advance every single dialogue line (which is like 80% of the game and gets extremely tedious and annoying)\r\n- only being able to track 2 quests at a time despite being able to take up to 5 commissions a day (3 build, 2 monster hunter), in addition to side/main quests which you may want to ALSO track\r\n- side quests expiring without proper warning and no way to retry them if they expired in the background without your knowledge (the game doesn't sufficiently notify you of quests when they are timed, they rely on you checking in your quest log for every single quest)\r\n- horrible UI where when you pick up an item from a machine and then quickly enter a machine's UI the pickup icons overlay the recipe window so you have to wait a few seconds for that UI element to disappear before you can choose a recipe\r\n- Chinese language/symbols appearing in the English game in certain spots\r\n\r\nIt's clear that the developers didn't care about creating the best possible game, but rather rushing it out the door without proper post-launch support.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A bit on the fence on this one. The biggest issue are the bugs. No complete progression locks yet, but looks to be memory leaks, quests that don't look at existing completion, etc.\n\nA lot of missable content in the game if you don't play a certain way.\n\n\nSome bug examples:\n\n\nThere are bugs like if you complete an objective before receiving the quest, the game has trouble with recognizing it, which could lead to quests that can't be completed if a non-respawning resource/target is required.\n\nThere are invisible walls all over the place instead of logical walls.\n\nAllies (and enemies) that will target each other through walls in certain situations.\n\nCertain progress not being tracked properly when allies do the final hit on a target you almost killed.\n\nJournal progress that isn't tracked properly and new marks that can't be cleared because the progress isn't tracked properly.\n\nThe game also will ignore your current gear for missions if you have better gear.\n\nEnemies and allies can have their AI break; Sandy is especially an issue since Sandy will start teleporting around town, making it effectively impossible to interact.\n\nThere are beneficial bugs too, like certain quest objects will keep respawning until you reach a certain progression.\n\nYou also have issues like where the quest tracker doesn't properly track progression on craftable items and the materials if the item is in the queue.  That one I don't blame them for since it would give a pretty significant hit to performance.\n\nThere are semi-bugs as well and a few annoyances. Annoyances include if your mount walks onto a machine and other overloaded buttons, that you can't set the default to run. (Rolling is faster than running, so that is something that requires generous run button usage until you get a mount).\n\nYou have quest-related items that you can't sell or drop, but can gift and can end up with multiple copies of.\n\nThe game has odd choices where sometimes the game will take you straight to a destination (even if you are in the middle of something) and sometimes the game will give you a choice and sometimes the game will just leave you in place.\n\nA few hitboxes that are just a bit off.\n\nThe broom icon on machines that don't need sweeping.\n\nSome very odd design choices (enemies don't trigger electric fences, but can be damaged by them if you run into the fence, for example).\n\nEnemies can walk on air, making them near-impossible to hit in some cases.\n\netc.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I really want to like this game and review it positively but it's got so many little frustrating things going on that a decent core is really ruined, to the point that I actively quit the game during one such moment and immediately uninstalled it.\n\nThe big things are the random bugs strewn throughout (all the way down to the normal resources near your shop respawning but being invisible for some reason??) which are just quirks at first, but add up, the quest system being seemingly straightforward but doing strange stuff with progression, and for me personally, the thing that drove me insane is the choice to do the \"highlight a new item with a marker until you look at it\" concept, but to the extreme. \n\nI am a person who likes to clear all the little notification flags in a game like this. Every time you find a new thing, it is flagged in your guide, and to get the little flag to go away, you have to pull up the guide, go to the section, probably go to a sub-section, and then half the time, scroll down through a long tiled list of things to find the new one and click on it to have *seen* it, I guess. That would be annoying enough, but not the first game to do something like this, right? Well, guess what, if you pick up a crafting material that you haven't seen before, it's flagged in your inventory, oh wait, no, if you don't have one in your inventory already, it's flagged, whether or not you've seen it before. Again, extra annoying, but I was just sort of putting up with it. That is, until I crafted the station to cook with.\n\nEvery time you open the cooking station, every single item that you can cook with in the window to select from is flagged as if it were a brand new item. Every. Single. Time. WHY?? I thought maybe it was a glitch, and it would go away, but no, every time you go to cook, the game is like HERE'S EVERY ITEM YOU CAN COOK WITH, DO YOU REMEMBER? THEY'RE THE ONLY ONES YOU CAN COOK WITH, BUT YOU DIDN'T LOOK AT EVERY ONE OF THEM THIS PARTICULAR TIME. CHECK IT OUT. (For context, this happening yet again while telling someone about this kind of thing happening is what made me quit and uninstall, it was definitely the last straw of annoyances)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A game that allows Chinese people to spam hundreds of friend requests and invites to a PRIVATE multiplayer town, with no way to block them on Steam or in game is unacceptaple.\n\nEven after you accept them as a friend, which is the only way to BLOCK them in game, they can still spam you over and over.\n\nTo allow this kind of harassment is enough to make this game non multiplayer functional. It made my friend and I completely stop playing.\n\nThe devs should be forced to give refunds to all players that request it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i liked the game, but as i just found out, you can put 200+ hours into the game and once you save sandrock, the game stops showing your saves, making you start all over, even with your save files still there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Exhausting. That’s the best word for this game. I gave it a fair shot with 78 hours logged. At first, it felt like a spiritual successor to Dark Cloud, but it quickly revealed itself as an artificial time sink.\n\nCharacter customization is weak. You can pick a “voice,” but it’s just for grunts while mining or chopping. No actual dialogue.\n\nProgression is slow and padded. You’re constantly waiting for machines to finish, missions to unlock, NPCs to send you plans, etc. To help with this, the game offers ruins, mining, resource gathering, relationships, and exploration, but none of it feels rewarding. Combat is basic and unchallenging. Mines are dull. Once you’ve mined the first level, they are virtually the same. Relic hunting is pointless. The “rewards” given aren’t worth donating the relics, and the Museum felt like an afterthought compared to the previous entry. Raids are mind numbing and I outsourced to the civil corps whenever possible.\n\nRelationships are lifeless. NPCs show up to “play” and walk away before you reach them. Dialogue never changes, even as you grow closer. Outside of main missions, everyone reverts to canned lines.\nExploration is gated and unrewarding. Most treasure chests are junk. Invisible walls block off areas. New zones are locked behind story progression.\n\nEven in 2025, bugs persist. I got stuck in Halloween decor without touching it. During the airship parade, my character glitched into a pickaxe animation loop and couldn’t interact with anything.\n\nToward the end, I realized I wasn’t having fun. I stopped building, skipped days by sleeping early, and sighed every time my character woke up as I dreaded an NPC was waiting for me outside.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this game for about 60 hours, enjoyed it, put it down, then came back months later to restart and played another 60 hours.  I would have played past that if I didn't encounter a game-breaking bug at that point that has rendered the game useless to me (I cannot play on any save or any form).  That was more than a year ago and that bug has never been fixed, my reports seem to have been totally ignored, and the cherry on top?  When I googled it, I found out that the exact same bug was present in their previous game, My Time at Portia.  This makes me very skeptical that I will have a positive, bug-free experience with their new game.  It's worth playing... if it works.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought this because I was promised co-op.  This game doesn't have co-op, it has a half-baked sandbox pile of shit that doesn't include the main storyline.  What the actual fuck is the point?  Incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "GRIND GRIND GRIND THEN WAIT THEN GRIND AGAIN AND AGAIN — im so happy, u can't even imagine\r\n\r\nSolo and co-op modes are totally different. \r\nPlaying solo? Grinding for resources is way tougher. There’s some kind of story but I barely played it because I bought the game to play with a friend so idk how good it really is. \r\nCo-op? Resources drop easy. Feels like u r stuck in this endless loop of build-build-build, zero fun.\r\nThey basically turned co-op into a plain sandbox mode and I don’t get the point. Like, why couldn’t they just add the same story from solo mode and keep sandbox as a separate option? Makes no sense. Im really tired of doing just one mission a day just to get some exp and level up my workshop. Otherwise, there’s nothing new. Progress is slow af.\r\n\r\nI’ve played tons of farming simulators but this one just feels raw and honestly boring as hell. Trust me, u r better off playing Stardew Valley or Minecraft over and over than hoping to find anything new.\r\n\r\nI’ve wanted to try this game since beta but back then there was no multiplayer so it didn’t make much sense for me. Now I finally got it for a really low price.\r\nI fell for all those positive reviews, especially the ones comparing this game to Stardew Valley — but I got totally scammed.\r\n\r\nAnyway, it’s 99% grind and 1% fun. Pretty disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's fine, but I remember enjoying Portia more. This game's main quest progresses way too slowly. Since the main quest unlocks things, it just feels like a hard lock. There are typically multiple in game days between steps in the main quest and this is where all the time is wasted. Sometimes you could simply skip days, other times you have a \"meet in the evening at this place\" to progress the quest. Maybe you don't actually have to, I haven't risked it...but this means I have to either speed up the game timer or find some way to use the whole day.\n\nThis wasn't a problem early game, but I'd say it's been a slog since about hour 30. Looking at the list of main quests, it doesn't look like I'm even halfway through.\n\nI don't want to be rushed. I like the cozy aspect. I think it would be a lot better if the next quest just triggered immediately instead of days later. I don't think it would ruin any sense of \"realism\"...there's plenty of \"hurry up!\" dialogue that makes you think an actual world is progressing without you; it's not, it will wait for you. Knowing this, I don't see any harm in removing arbitrary delays.\n\nPlenty of other things have improved since Portia but the pacing makes me prefer the first game. Worth playing if you don't mind a very slow experience past the early stages. But I wouldn't say I recommend it.\n\nEdit: And it's so buggy...nothing gamebreaking, just constant annoyances. I don't remember the last game I played that was this buggy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have 113 hours into this game and I played and finished My Time at Portia.  Upon beating the main story I got the Steam achievement “Jewel of the Eufaula – Complete the main story.”… 8.2% of players have that achievement.  I really wanted to like this game, but there are way more bad things than good, so it is uneven and just not a good game in my opinion.\r\n\r\nSo how come only 8.2% of the people playing finsihed the main story?!?!?  Well, the games story plays out of order.  You WILL feel like you have finished the main story about 80 hours in.  The story line will FEEL like the end, but its not.  Everything after that main story end feeling is boring and very repetitive. \r\n\r\nIts like they just threw in some extra crap to keep you busy for no real reason.  They introduce new people you can have relationships with, be friends with and might make you mad you are married to who you have,  they give you armor and weapons you are not high enough level to use, and have ruins that are level 80-90, but no quests or reason to do them… When I bet the game I JUST hit 50, to get to 80 is crazy.\r\n\r\nAlso the pacing of this game is off.  You don’t need to unlock most of the shop land and only need the best workstation (I NEVER used the factory, it was not needed or required to use).  The UI is pretty bad after you use it for a while. ALWAYS having the “new” icon on everything is super annoying and you can’t clear them very easy at all.  The skill tree is super pointless and you end up getting most of the useful stuff very quick then the rest of the game you are just filling blank spot that don’t mean anything.  Why do I want to put points in sword and shield when I use dagger weapons??\r\n\r\nThere are lots of things that make the game more annoying vs helping.  At one point I had to make some bush sculptures, but I needed a certain kind of plant… which I didn’t have and I could only get from growing it.  Growing TAKES FOREVER, so I was locked into playing hours to let the plants grow OR sleep over and over to make time fly.  You also cannot do anything to speed time up.  If I run out of things to do at 3pm, but I need to meet someone at 10pm, I have to find something to do for that time.\r\n\r\nPortia is a MUCH better game outside of the graphic and size of the land (which has its own issues… there is TONS of space, but you don’t and won’t use/see most of it).\r\n\r\nI’ll still give My time at Evershine a chance since they could fix most of the bad things in this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried to like Sandrock. I really did, I put several days into playing the game.\r\n\r\nBut there are just way, way, WAY too many little tiny bad ideas that all pile up into an unplayable mess.\r\n\r\nStamina runs out WAY too quick, you can't even finish a single day before running dry.\r\nFood barely restores ~10 Stamina, IF you're lucky. No point in even carrying any.\r\nEverything costs so much money, you'd have to grind for weeks to buy a rug.\r\nEvery upgrade requires MULTIPLE DAYS to unlock - finishing the entire tree would take MONTHS.\r\nAll of the NPCs have page after page after page of pointless blathering dialog. They just don't shut up!\r\n\r\nAnd the control scheme! Why, for loot's sake, is TRIANGLE the main action key?! It took me ages to relearn the muscle memory when virtually every other game uses Cross as main action. I couldn't find any options to rebind the keys.\r\n\r\nThe game does NOT remind you of enough viable data, so you will most likely miss several important dates. You're punished for cutting down trees \"near the city limits\", but those limits are not shown on the map! So I tried cutting down trees so far out in the desert, they didn't render when viewed from town... and STILL got dinged for it!\r\n\r\nAnd even after spending almost an entire year in-game, my Workshop rating was... 4.\r\n\r\nThis game is disgustingly imbalanced. I 100%'s three other farming sims this year and loved them all; Moonstone Island, Coral Island, and good ol' Stardew Valley. Each had their own minor flaws, but each could be tolerated for what they offered.\r\n\r\nBut Sandrock has ALL of the flaws of those other sims, plus tons more.\r\n\r\nThis just is not a comfortable game to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "в коопе урезан сюжет(полностью)\r\nв коопе уебищный сюжет \r\nв коопе картонные персонажи\r\nв коопе только фарм, картонный уебищный\r\n\r\nпидарасы на разрабах уже делают 3 часть, пока эта незакончена и обещания не выполнены\r\nследующая часть выглядит как такой же кусок говна с древними анимациями, каменными еблами и рагрузками при входе в дом в 2025 году\r\n\r\nбюджет игры 12 миллионов долларов",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game looks alright, wanted to give it a shot on multiplayer with my brother but wasn't able to play hardly any of the game because I spent most of my time in loading screens and in between crashes which happened probably a dozen times. I cant speak to the game itself, it seems ok but the crashes makes it unplayable at least in multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After being out for 2 years the game still has many bugs and lacks QoL features:\r\n- the game not pausing when talking to a character so you have to strain to listen to people while others talk in the background\r\n- no \"auto-play\" setting (which should be on by default anyways) so you have to manually advance every single dialogue line (which is like 80% of the game and gets extremely tedious and annoying)\r\n- only being able to track 2 quests at a time despite being able to take up to 5 commissions a day (3 build, 2 monster hunter), in addition to side/main quests which you may want to ALSO track\r\n- side quests expiring without proper warning and no way to retry them if they expired in the background without your knowledge (the game doesn't sufficiently notify you of quests when they are timed, they rely on you checking in your quest log for every single quest)\r\n- horrible UI where when you pick up an item from a machine and then quickly enter a machine's UI the pickup icons overlay the recipe window so you have to wait a few seconds for that UI element to disappear before you can choose a recipe\r\n- Chinese language/symbols appearing in the English game in certain spots\r\n\r\nIt's clear that the developers didn't care about creating the best possible game, but rather rushing it out the door without proper post-launch support.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A bit on the fence on this one. The biggest issue are the bugs. No complete progression locks yet, but looks to be memory leaks, quests that don't look at existing completion, etc.\n\nA lot of missable content in the game if you don't play a certain way.\n\n\nSome bug examples:\n\n\nThere are bugs like if you complete an objective before receiving the quest, the game has trouble with recognizing it, which could lead to quests that can't be completed if a non-respawning resource/target is required.\n\nThere are invisible walls all over the place instead of logical walls.\n\nAllies (and enemies) that will target each other through walls in certain situations.\n\nCertain progress not being tracked properly when allies do the final hit on a target you almost killed.\n\nJournal progress that isn't tracked properly and new marks that can't be cleared because the progress isn't tracked properly.\n\nThe game also will ignore your current gear for missions if you have better gear.\n\nEnemies and allies can have their AI break; Sandy is especially an issue since Sandy will start teleporting around town, making it effectively impossible to interact.\n\nThere are beneficial bugs too, like certain quest objects will keep respawning until you reach a certain progression.\n\nYou also have issues like where the quest tracker doesn't properly track progression on craftable items and the materials if the item is in the queue.  That one I don't blame them for since it would give a pretty significant hit to performance.\n\nThere are semi-bugs as well and a few annoyances. Annoyances include if your mount walks onto a machine and other overloaded buttons, that you can't set the default to run. (Rolling is faster than running, so that is something that requires generous run button usage until you get a mount).\n\nYou have quest-related items that you can't sell or drop, but can gift and can end up with multiple copies of.\n\nThe game has odd choices where sometimes the game will take you straight to a destination (even if you are in the middle of something) and sometimes the game will give you a choice and sometimes the game will just leave you in place.\n\nA few hitboxes that are just a bit off.\n\nThe broom icon on machines that don't need sweeping.\n\nSome very odd design choices (enemies don't trigger electric fences, but can be damaged by them if you run into the fence, for example).\n\nEnemies can walk on air, making them near-impossible to hit in some cases.\n\netc.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I really want to like this game and review it positively but it's got so many little frustrating things going on that a decent core is really ruined, to the point that I actively quit the game during one such moment and immediately uninstalled it.\n\nThe big things are the random bugs strewn throughout (all the way down to the normal resources near your shop respawning but being invisible for some reason??) which are just quirks at first, but add up, the quest system being seemingly straightforward but doing strange stuff with progression, and for me personally, the thing that drove me insane is the choice to do the \"highlight a new item with a marker until you look at it\" concept, but to the extreme. \n\nI am a person who likes to clear all the little notification flags in a game like this. Every time you find a new thing, it is flagged in your guide, and to get the little flag to go away, you have to pull up the guide, go to the section, probably go to a sub-section, and then half the time, scroll down through a long tiled list of things to find the new one and click on it to have *seen* it, I guess. That would be annoying enough, but not the first game to do something like this, right? Well, guess what, if you pick up a crafting material that you haven't seen before, it's flagged in your inventory, oh wait, no, if you don't have one in your inventory already, it's flagged, whether or not you've seen it before. Again, extra annoying, but I was just sort of putting up with it. That is, until I crafted the station to cook with.\n\nEvery time you open the cooking station, every single item that you can cook with in the window to select from is flagged as if it were a brand new item. Every. Single. Time. WHY?? I thought maybe it was a glitch, and it would go away, but no, every time you go to cook, the game is like HERE'S EVERY ITEM YOU CAN COOK WITH, DO YOU REMEMBER? THEY'RE THE ONLY ONES YOU CAN COOK WITH, BUT YOU DIDN'T LOOK AT EVERY ONE OF THEM THIS PARTICULAR TIME. CHECK IT OUT. (For context, this happening yet again while telling someone about this kind of thing happening is what made me quit and uninstall, it was definitely the last straw of annoyances)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A game that allows Chinese people to spam hundreds of friend requests and invites to a PRIVATE multiplayer town, with no way to block them on Steam or in game is unacceptaple.\n\nEven after you accept them as a friend, which is the only way to BLOCK them in game, they can still spam you over and over.\n\nTo allow this kind of harassment is enough to make this game non multiplayer functional. It made my friend and I completely stop playing.\n\nThe devs should be forced to give refunds to all players that request it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i liked the game, but as i just found out, you can put 200+ hours into the game and once you save sandrock, the game stops showing your saves, making you start all over, even with your save files still there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Exhausting. That’s the best word for this game. I gave it a fair shot with 78 hours logged. At first, it felt like a spiritual successor to Dark Cloud, but it quickly revealed itself as an artificial time sink.\n\nCharacter customization is weak. You can pick a “voice,” but it’s just for grunts while mining or chopping. No actual dialogue.\n\nProgression is slow and padded. You’re constantly waiting for machines to finish, missions to unlock, NPCs to send you plans, etc. To help with this, the game offers ruins, mining, resource gathering, relationships, and exploration, but none of it feels rewarding. Combat is basic and unchallenging. Mines are dull. Once you’ve mined the first level, they are virtually the same. Relic hunting is pointless. The “rewards” given aren’t worth donating the relics, and the Museum felt like an afterthought compared to the previous entry. Raids are mind numbing and I outsourced to the civil corps whenever possible.\n\nRelationships are lifeless. NPCs show up to “play” and walk away before you reach them. Dialogue never changes, even as you grow closer. Outside of main missions, everyone reverts to canned lines.\nExploration is gated and unrewarding. Most treasure chests are junk. Invisible walls block off areas. New zones are locked behind story progression.\n\nEven in 2025, bugs persist. I got stuck in Halloween decor without touching it. During the airship parade, my character glitched into a pickaxe animation loop and couldn’t interact with anything.\n\nToward the end, I realized I wasn’t having fun. I stopped building, skipped days by sleeping early, and sighed every time my character woke up as I dreaded an NPC was waiting for me outside.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this game for about 60 hours, enjoyed it, put it down, then came back months later to restart and played another 60 hours.  I would have played past that if I didn't encounter a game-breaking bug at that point that has rendered the game useless to me (I cannot play on any save or any form).  That was more than a year ago and that bug has never been fixed, my reports seem to have been totally ignored, and the cherry on top?  When I googled it, I found out that the exact same bug was present in their previous game, My Time at Portia.  This makes me very skeptical that I will have a positive, bug-free experience with their new game.  It's worth playing... if it works.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought this because I was promised co-op.  This game doesn't have co-op, it has a half-baked sandbox pile of shit that doesn't include the main storyline.  What the actual fuck is the point?  Incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "GRIND GRIND GRIND THEN WAIT THEN GRIND AGAIN AND AGAIN — im so happy, u can't even imagine\r\n\r\nSolo and co-op modes are totally different. \r\nPlaying solo? Grinding for resources is way tougher. There’s some kind of story but I barely played it because I bought the game to play with a friend so idk how good it really is. \r\nCo-op? Resources drop easy. Feels like u r stuck in this endless loop of build-build-build, zero fun.\r\nThey basically turned co-op into a plain sandbox mode and I don’t get the point. Like, why couldn’t they just add the same story from solo mode and keep sandbox as a separate option? Makes no sense. Im really tired of doing just one mission a day just to get some exp and level up my workshop. Otherwise, there’s nothing new. Progress is slow af.\r\n\r\nI’ve played tons of farming simulators but this one just feels raw and honestly boring as hell. Trust me, u r better off playing Stardew Valley or Minecraft over and over than hoping to find anything new.\r\n\r\nI’ve wanted to try this game since beta but back then there was no multiplayer so it didn’t make much sense for me. Now I finally got it for a really low price.\r\nI fell for all those positive reviews, especially the ones comparing this game to Stardew Valley — but I got totally scammed.\r\n\r\nAnyway, it’s 99% grind and 1% fun. Pretty disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's fine, but I remember enjoying Portia more. This game's main quest progresses way too slowly. Since the main quest unlocks things, it just feels like a hard lock. There are typically multiple in game days between steps in the main quest and this is where all the time is wasted. Sometimes you could simply skip days, other times you have a \"meet in the evening at this place\" to progress the quest. Maybe you don't actually have to, I haven't risked it...but this means I have to either speed up the game timer or find some way to use the whole day.\n\nThis wasn't a problem early game, but I'd say it's been a slog since about hour 30. Looking at the list of main quests, it doesn't look like I'm even halfway through.\n\nI don't want to be rushed. I like the cozy aspect. I think it would be a lot better if the next quest just triggered immediately instead of days later. I don't think it would ruin any sense of \"realism\"...there's plenty of \"hurry up!\" dialogue that makes you think an actual world is progressing without you; it's not, it will wait for you. Knowing this, I don't see any harm in removing arbitrary delays.\n\nPlenty of other things have improved since Portia but the pacing makes me prefer the first game. Worth playing if you don't mind a very slow experience past the early stages. But I wouldn't say I recommend it.\n\nEdit: And it's so buggy...nothing gamebreaking, just constant annoyances. I don't remember the last game I played that was this buggy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have 113 hours into this game and I played and finished My Time at Portia.  Upon beating the main story I got the Steam achievement “Jewel of the Eufaula – Complete the main story.”… 8.2% of players have that achievement.  I really wanted to like this game, but there are way more bad things than good, so it is uneven and just not a good game in my opinion.\r\n\r\nSo how come only 8.2% of the people playing finsihed the main story?!?!?  Well, the games story plays out of order.  You WILL feel like you have finished the main story about 80 hours in.  The story line will FEEL like the end, but its not.  Everything after that main story end feeling is boring and very repetitive. \r\n\r\nIts like they just threw in some extra crap to keep you busy for no real reason.  They introduce new people you can have relationships with, be friends with and might make you mad you are married to who you have,  they give you armor and weapons you are not high enough level to use, and have ruins that are level 80-90, but no quests or reason to do them… When I bet the game I JUST hit 50, to get to 80 is crazy.\r\n\r\nAlso the pacing of this game is off.  You don’t need to unlock most of the shop land and only need the best workstation (I NEVER used the factory, it was not needed or required to use).  The UI is pretty bad after you use it for a while. ALWAYS having the “new” icon on everything is super annoying and you can’t clear them very easy at all.  The skill tree is super pointless and you end up getting most of the useful stuff very quick then the rest of the game you are just filling blank spot that don’t mean anything.  Why do I want to put points in sword and shield when I use dagger weapons??\r\n\r\nThere are lots of things that make the game more annoying vs helping.  At one point I had to make some bush sculptures, but I needed a certain kind of plant… which I didn’t have and I could only get from growing it.  Growing TAKES FOREVER, so I was locked into playing hours to let the plants grow OR sleep over and over to make time fly.  You also cannot do anything to speed time up.  If I run out of things to do at 3pm, but I need to meet someone at 10pm, I have to find something to do for that time.\r\n\r\nPortia is a MUCH better game outside of the graphic and size of the land (which has its own issues… there is TONS of space, but you don’t and won’t use/see most of it).\r\n\r\nI’ll still give My time at Evershine a chance since they could fix most of the bad things in this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried to like Sandrock. I really did, I put several days into playing the game.\r\n\r\nBut there are just way, way, WAY too many little tiny bad ideas that all pile up into an unplayable mess.\r\n\r\nStamina runs out WAY too quick, you can't even finish a single day before running dry.\r\nFood barely restores ~10 Stamina, IF you're lucky. No point in even carrying any.\r\nEverything costs so much money, you'd have to grind for weeks to buy a rug.\r\nEvery upgrade requires MULTIPLE DAYS to unlock - finishing the entire tree would take MONTHS.\r\nAll of the NPCs have page after page after page of pointless blathering dialog. They just don't shut up!\r\n\r\nAnd the control scheme! Why, for loot's sake, is TRIANGLE the main action key?! It took me ages to relearn the muscle memory when virtually every other game uses Cross as main action. I couldn't find any options to rebind the keys.\r\n\r\nThe game does NOT remind you of enough viable data, so you will most likely miss several important dates. You're punished for cutting down trees \"near the city limits\", but those limits are not shown on the map! So I tried cutting down trees so far out in the desert, they didn't render when viewed from town... and STILL got dinged for it!\r\n\r\nAnd even after spending almost an entire year in-game, my Workshop rating was... 4.\r\n\r\nThis game is disgustingly imbalanced. I 100%'s three other farming sims this year and loved them all; Moonstone Island, Coral Island, and good ol' Stardew Valley. Each had their own minor flaws, but each could be tolerated for what they offered.\r\n\r\nBut Sandrock has ALL of the flaws of those other sims, plus tons more.\r\n\r\nThis just is not a comfortable game to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "в коопе урезан сюжет(полностью)\r\nв коопе уебищный сюжет \r\nв коопе картонные персонажи\r\nв коопе только фарм, картонный уебищный\r\n\r\nпидарасы на разрабах уже делают 3 часть, пока эта незакончена и обещания не выполнены\r\nследующая часть выглядит как такой же кусок говна с древними анимациями, каменными еблами и рагрузками при входе в дом в 2025 году\r\n\r\nбюджет игры 12 миллионов долларов",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game looks alright, wanted to give it a shot on multiplayer with my brother but wasn't able to play hardly any of the game because I spent most of my time in loading screens and in between crashes which happened probably a dozen times. I cant speak to the game itself, it seems ok but the crashes makes it unplayable at least in multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After being out for 2 years the game still has many bugs and lacks QoL features:\r\n- the game not pausing when talking to a character so you have to strain to listen to people while others talk in the background\r\n- no \"auto-play\" setting (which should be on by default anyways) so you have to manually advance every single dialogue line (which is like 80% of the game and gets extremely tedious and annoying)\r\n- only being able to track 2 quests at a time despite being able to take up to 5 commissions a day (3 build, 2 monster hunter), in addition to side/main quests which you may want to ALSO track\r\n- side quests expiring without proper warning and no way to retry them if they expired in the background without your knowledge (the game doesn't sufficiently notify you of quests when they are timed, they rely on you checking in your quest log for every single quest)\r\n- horrible UI where when you pick up an item from a machine and then quickly enter a machine's UI the pickup icons overlay the recipe window so you have to wait a few seconds for that UI element to disappear before you can choose a recipe\r\n- Chinese language/symbols appearing in the English game in certain spots\r\n\r\nIt's clear that the developers didn't care about creating the best possible game, but rather rushing it out the door without proper post-launch support.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A bit on the fence on this one. The biggest issue are the bugs. No complete progression locks yet, but looks to be memory leaks, quests that don't look at existing completion, etc.\n\nA lot of missable content in the game if you don't play a certain way.\n\n\nSome bug examples:\n\n\nThere are bugs like if you complete an objective before receiving the quest, the game has trouble with recognizing it, which could lead to quests that can't be completed if a non-respawning resource/target is required.\n\nThere are invisible walls all over the place instead of logical walls.\n\nAllies (and enemies) that will target each other through walls in certain situations.\n\nCertain progress not being tracked properly when allies do the final hit on a target you almost killed.\n\nJournal progress that isn't tracked properly and new marks that can't be cleared because the progress isn't tracked properly.\n\nThe game also will ignore your current gear for missions if you have better gear.\n\nEnemies and allies can have their AI break; Sandy is especially an issue since Sandy will start teleporting around town, making it effectively impossible to interact.\n\nThere are beneficial bugs too, like certain quest objects will keep respawning until you reach a certain progression.\n\nYou also have issues like where the quest tracker doesn't properly track progression on craftable items and the materials if the item is in the queue.  That one I don't blame them for since it would give a pretty significant hit to performance.\n\nThere are semi-bugs as well and a few annoyances. Annoyances include if your mount walks onto a machine and other overloaded buttons, that you can't set the default to run. (Rolling is faster than running, so that is something that requires generous run button usage until you get a mount).\n\nYou have quest-related items that you can't sell or drop, but can gift and can end up with multiple copies of.\n\nThe game has odd choices where sometimes the game will take you straight to a destination (even if you are in the middle of something) and sometimes the game will give you a choice and sometimes the game will just leave you in place.\n\nA few hitboxes that are just a bit off.\n\nThe broom icon on machines that don't need sweeping.\n\nSome very odd design choices (enemies don't trigger electric fences, but can be damaged by them if you run into the fence, for example).\n\nEnemies can walk on air, making them near-impossible to hit in some cases.\n\netc.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I really want to like this game and review it positively but it's got so many little frustrating things going on that a decent core is really ruined, to the point that I actively quit the game during one such moment and immediately uninstalled it.\n\nThe big things are the random bugs strewn throughout (all the way down to the normal resources near your shop respawning but being invisible for some reason??) which are just quirks at first, but add up, the quest system being seemingly straightforward but doing strange stuff with progression, and for me personally, the thing that drove me insane is the choice to do the \"highlight a new item with a marker until you look at it\" concept, but to the extreme. \n\nI am a person who likes to clear all the little notification flags in a game like this. Every time you find a new thing, it is flagged in your guide, and to get the little flag to go away, you have to pull up the guide, go to the section, probably go to a sub-section, and then half the time, scroll down through a long tiled list of things to find the new one and click on it to have *seen* it, I guess. That would be annoying enough, but not the first game to do something like this, right? Well, guess what, if you pick up a crafting material that you haven't seen before, it's flagged in your inventory, oh wait, no, if you don't have one in your inventory already, it's flagged, whether or not you've seen it before. Again, extra annoying, but I was just sort of putting up with it. That is, until I crafted the station to cook with.\n\nEvery time you open the cooking station, every single item that you can cook with in the window to select from is flagged as if it were a brand new item. Every. Single. Time. WHY?? I thought maybe it was a glitch, and it would go away, but no, every time you go to cook, the game is like HERE'S EVERY ITEM YOU CAN COOK WITH, DO YOU REMEMBER? THEY'RE THE ONLY ONES YOU CAN COOK WITH, BUT YOU DIDN'T LOOK AT EVERY ONE OF THEM THIS PARTICULAR TIME. CHECK IT OUT. (For context, this happening yet again while telling someone about this kind of thing happening is what made me quit and uninstall, it was definitely the last straw of annoyances)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A game that allows Chinese people to spam hundreds of friend requests and invites to a PRIVATE multiplayer town, with no way to block them on Steam or in game is unacceptaple.\n\nEven after you accept them as a friend, which is the only way to BLOCK them in game, they can still spam you over and over.\n\nTo allow this kind of harassment is enough to make this game non multiplayer functional. It made my friend and I completely stop playing.\n\nThe devs should be forced to give refunds to all players that request it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i liked the game, but as i just found out, you can put 200+ hours into the game and once you save sandrock, the game stops showing your saves, making you start all over, even with your save files still there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Exhausting. That’s the best word for this game. I gave it a fair shot with 78 hours logged. At first, it felt like a spiritual successor to Dark Cloud, but it quickly revealed itself as an artificial time sink.\n\nCharacter customization is weak. You can pick a “voice,” but it’s just for grunts while mining or chopping. No actual dialogue.\n\nProgression is slow and padded. You’re constantly waiting for machines to finish, missions to unlock, NPCs to send you plans, etc. To help with this, the game offers ruins, mining, resource gathering, relationships, and exploration, but none of it feels rewarding. Combat is basic and unchallenging. Mines are dull. Once you’ve mined the first level, they are virtually the same. Relic hunting is pointless. The “rewards” given aren’t worth donating the relics, and the Museum felt like an afterthought compared to the previous entry. Raids are mind numbing and I outsourced to the civil corps whenever possible.\n\nRelationships are lifeless. NPCs show up to “play” and walk away before you reach them. Dialogue never changes, even as you grow closer. Outside of main missions, everyone reverts to canned lines.\nExploration is gated and unrewarding. Most treasure chests are junk. Invisible walls block off areas. New zones are locked behind story progression.\n\nEven in 2025, bugs persist. I got stuck in Halloween decor without touching it. During the airship parade, my character glitched into a pickaxe animation loop and couldn’t interact with anything.\n\nToward the end, I realized I wasn’t having fun. I stopped building, skipped days by sleeping early, and sighed every time my character woke up as I dreaded an NPC was waiting for me outside.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this game for about 60 hours, enjoyed it, put it down, then came back months later to restart and played another 60 hours.  I would have played past that if I didn't encounter a game-breaking bug at that point that has rendered the game useless to me (I cannot play on any save or any form).  That was more than a year ago and that bug has never been fixed, my reports seem to have been totally ignored, and the cherry on top?  When I googled it, I found out that the exact same bug was present in their previous game, My Time at Portia.  This makes me very skeptical that I will have a positive, bug-free experience with their new game.  It's worth playing... if it works.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought this because I was promised co-op.  This game doesn't have co-op, it has a half-baked sandbox pile of shit that doesn't include the main storyline.  What the actual fuck is the point?  Incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "GRIND GRIND GRIND THEN WAIT THEN GRIND AGAIN AND AGAIN — im so happy, u can't even imagine\r\n\r\nSolo and co-op modes are totally different. \r\nPlaying solo? Grinding for resources is way tougher. There’s some kind of story but I barely played it because I bought the game to play with a friend so idk how good it really is. \r\nCo-op? Resources drop easy. Feels like u r stuck in this endless loop of build-build-build, zero fun.\r\nThey basically turned co-op into a plain sandbox mode and I don’t get the point. Like, why couldn’t they just add the same story from solo mode and keep sandbox as a separate option? Makes no sense. Im really tired of doing just one mission a day just to get some exp and level up my workshop. Otherwise, there’s nothing new. Progress is slow af.\r\n\r\nI’ve played tons of farming simulators but this one just feels raw and honestly boring as hell. Trust me, u r better off playing Stardew Valley or Minecraft over and over than hoping to find anything new.\r\n\r\nI’ve wanted to try this game since beta but back then there was no multiplayer so it didn’t make much sense for me. Now I finally got it for a really low price.\r\nI fell for all those positive reviews, especially the ones comparing this game to Stardew Valley — but I got totally scammed.\r\n\r\nAnyway, it’s 99% grind and 1% fun. Pretty disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's fine, but I remember enjoying Portia more. This game's main quest progresses way too slowly. Since the main quest unlocks things, it just feels like a hard lock. There are typically multiple in game days between steps in the main quest and this is where all the time is wasted. Sometimes you could simply skip days, other times you have a \"meet in the evening at this place\" to progress the quest. Maybe you don't actually have to, I haven't risked it...but this means I have to either speed up the game timer or find some way to use the whole day.\n\nThis wasn't a problem early game, but I'd say it's been a slog since about hour 30. Looking at the list of main quests, it doesn't look like I'm even halfway through.\n\nI don't want to be rushed. I like the cozy aspect. I think it would be a lot better if the next quest just triggered immediately instead of days later. I don't think it would ruin any sense of \"realism\"...there's plenty of \"hurry up!\" dialogue that makes you think an actual world is progressing without you; it's not, it will wait for you. Knowing this, I don't see any harm in removing arbitrary delays.\n\nPlenty of other things have improved since Portia but the pacing makes me prefer the first game. Worth playing if you don't mind a very slow experience past the early stages. But I wouldn't say I recommend it.\n\nEdit: And it's so buggy...nothing gamebreaking, just constant annoyances. I don't remember the last game I played that was this buggy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have 113 hours into this game and I played and finished My Time at Portia.  Upon beating the main story I got the Steam achievement “Jewel of the Eufaula – Complete the main story.”… 8.2% of players have that achievement.  I really wanted to like this game, but there are way more bad things than good, so it is uneven and just not a good game in my opinion.\r\n\r\nSo how come only 8.2% of the people playing finsihed the main story?!?!?  Well, the games story plays out of order.  You WILL feel like you have finished the main story about 80 hours in.  The story line will FEEL like the end, but its not.  Everything after that main story end feeling is boring and very repetitive. \r\n\r\nIts like they just threw in some extra crap to keep you busy for no real reason.  They introduce new people you can have relationships with, be friends with and might make you mad you are married to who you have,  they give you armor and weapons you are not high enough level to use, and have ruins that are level 80-90, but no quests or reason to do them… When I bet the game I JUST hit 50, to get to 80 is crazy.\r\n\r\nAlso the pacing of this game is off.  You don’t need to unlock most of the shop land and only need the best workstation (I NEVER used the factory, it was not needed or required to use).  The UI is pretty bad after you use it for a while. ALWAYS having the “new” icon on everything is super annoying and you can’t clear them very easy at all.  The skill tree is super pointless and you end up getting most of the useful stuff very quick then the rest of the game you are just filling blank spot that don’t mean anything.  Why do I want to put points in sword and shield when I use dagger weapons??\r\n\r\nThere are lots of things that make the game more annoying vs helping.  At one point I had to make some bush sculptures, but I needed a certain kind of plant… which I didn’t have and I could only get from growing it.  Growing TAKES FOREVER, so I was locked into playing hours to let the plants grow OR sleep over and over to make time fly.  You also cannot do anything to speed time up.  If I run out of things to do at 3pm, but I need to meet someone at 10pm, I have to find something to do for that time.\r\n\r\nPortia is a MUCH better game outside of the graphic and size of the land (which has its own issues… there is TONS of space, but you don’t and won’t use/see most of it).\r\n\r\nI’ll still give My time at Evershine a chance since they could fix most of the bad things in this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried to like Sandrock. I really did, I put several days into playing the game.\r\n\r\nBut there are just way, way, WAY too many little tiny bad ideas that all pile up into an unplayable mess.\r\n\r\nStamina runs out WAY too quick, you can't even finish a single day before running dry.\r\nFood barely restores ~10 Stamina, IF you're lucky. No point in even carrying any.\r\nEverything costs so much money, you'd have to grind for weeks to buy a rug.\r\nEvery upgrade requires MULTIPLE DAYS to unlock - finishing the entire tree would take MONTHS.\r\nAll of the NPCs have page after page after page of pointless blathering dialog. They just don't shut up!\r\n\r\nAnd the control scheme! Why, for loot's sake, is TRIANGLE the main action key?! It took me ages to relearn the muscle memory when virtually every other game uses Cross as main action. I couldn't find any options to rebind the keys.\r\n\r\nThe game does NOT remind you of enough viable data, so you will most likely miss several important dates. You're punished for cutting down trees \"near the city limits\", but those limits are not shown on the map! So I tried cutting down trees so far out in the desert, they didn't render when viewed from town... and STILL got dinged for it!\r\n\r\nAnd even after spending almost an entire year in-game, my Workshop rating was... 4.\r\n\r\nThis game is disgustingly imbalanced. I 100%'s three other farming sims this year and loved them all; Moonstone Island, Coral Island, and good ol' Stardew Valley. Each had their own minor flaws, but each could be tolerated for what they offered.\r\n\r\nBut Sandrock has ALL of the flaws of those other sims, plus tons more.\r\n\r\nThis just is not a comfortable game to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "в коопе урезан сюжет(полностью)\r\nв коопе уебищный сюжет \r\nв коопе картонные персонажи\r\nв коопе только фарм, картонный уебищный\r\n\r\nпидарасы на разрабах уже делают 3 часть, пока эта незакончена и обещания не выполнены\r\nследующая часть выглядит как такой же кусок говна с древними анимациями, каменными еблами и рагрузками при входе в дом в 2025 году\r\n\r\nбюджет игры 12 миллионов долларов",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game looks alright, wanted to give it a shot on multiplayer with my brother but wasn't able to play hardly any of the game because I spent most of my time in loading screens and in between crashes which happened probably a dozen times. I cant speak to the game itself, it seems ok but the crashes makes it unplayable at least in multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After being out for 2 years the game still has many bugs and lacks QoL features:\r\n- the game not pausing when talking to a character so you have to strain to listen to people while others talk in the background\r\n- no \"auto-play\" setting (which should be on by default anyways) so you have to manually advance every single dialogue line (which is like 80% of the game and gets extremely tedious and annoying)\r\n- only being able to track 2 quests at a time despite being able to take up to 5 commissions a day (3 build, 2 monster hunter), in addition to side/main quests which you may want to ALSO track\r\n- side quests expiring without proper warning and no way to retry them if they expired in the background without your knowledge (the game doesn't sufficiently notify you of quests when they are timed, they rely on you checking in your quest log for every single quest)\r\n- horrible UI where when you pick up an item from a machine and then quickly enter a machine's UI the pickup icons overlay the recipe window so you have to wait a few seconds for that UI element to disappear before you can choose a recipe\r\n- Chinese language/symbols appearing in the English game in certain spots\r\n\r\nIt's clear that the developers didn't care about creating the best possible game, but rather rushing it out the door without proper post-launch support.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A bit on the fence on this one. The biggest issue are the bugs. No complete progression locks yet, but looks to be memory leaks, quests that don't look at existing completion, etc.\n\nA lot of missable content in the game if you don't play a certain way.\n\n\nSome bug examples:\n\n\nThere are bugs like if you complete an objective before receiving the quest, the game has trouble with recognizing it, which could lead to quests that can't be completed if a non-respawning resource/target is required.\n\nThere are invisible walls all over the place instead of logical walls.\n\nAllies (and enemies) that will target each other through walls in certain situations.\n\nCertain progress not being tracked properly when allies do the final hit on a target you almost killed.\n\nJournal progress that isn't tracked properly and new marks that can't be cleared because the progress isn't tracked properly.\n\nThe game also will ignore your current gear for missions if you have better gear.\n\nEnemies and allies can have their AI break; Sandy is especially an issue since Sandy will start teleporting around town, making it effectively impossible to interact.\n\nThere are beneficial bugs too, like certain quest objects will keep respawning until you reach a certain progression.\n\nYou also have issues like where the quest tracker doesn't properly track progression on craftable items and the materials if the item is in the queue.  That one I don't blame them for since it would give a pretty significant hit to performance.\n\nThere are semi-bugs as well and a few annoyances. Annoyances include if your mount walks onto a machine and other overloaded buttons, that you can't set the default to run. (Rolling is faster than running, so that is something that requires generous run button usage until you get a mount).\n\nYou have quest-related items that you can't sell or drop, but can gift and can end up with multiple copies of.\n\nThe game has odd choices where sometimes the game will take you straight to a destination (even if you are in the middle of something) and sometimes the game will give you a choice and sometimes the game will just leave you in place.\n\nA few hitboxes that are just a bit off.\n\nThe broom icon on machines that don't need sweeping.\n\nSome very odd design choices (enemies don't trigger electric fences, but can be damaged by them if you run into the fence, for example).\n\nEnemies can walk on air, making them near-impossible to hit in some cases.\n\netc.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I really want to like this game and review it positively but it's got so many little frustrating things going on that a decent core is really ruined, to the point that I actively quit the game during one such moment and immediately uninstalled it.\n\nThe big things are the random bugs strewn throughout (all the way down to the normal resources near your shop respawning but being invisible for some reason??) which are just quirks at first, but add up, the quest system being seemingly straightforward but doing strange stuff with progression, and for me personally, the thing that drove me insane is the choice to do the \"highlight a new item with a marker until you look at it\" concept, but to the extreme. \n\nI am a person who likes to clear all the little notification flags in a game like this. Every time you find a new thing, it is flagged in your guide, and to get the little flag to go away, you have to pull up the guide, go to the section, probably go to a sub-section, and then half the time, scroll down through a long tiled list of things to find the new one and click on it to have *seen* it, I guess. That would be annoying enough, but not the first game to do something like this, right? Well, guess what, if you pick up a crafting material that you haven't seen before, it's flagged in your inventory, oh wait, no, if you don't have one in your inventory already, it's flagged, whether or not you've seen it before. Again, extra annoying, but I was just sort of putting up with it. That is, until I crafted the station to cook with.\n\nEvery time you open the cooking station, every single item that you can cook with in the window to select from is flagged as if it were a brand new item. Every. Single. Time. WHY?? I thought maybe it was a glitch, and it would go away, but no, every time you go to cook, the game is like HERE'S EVERY ITEM YOU CAN COOK WITH, DO YOU REMEMBER? THEY'RE THE ONLY ONES YOU CAN COOK WITH, BUT YOU DIDN'T LOOK AT EVERY ONE OF THEM THIS PARTICULAR TIME. CHECK IT OUT. (For context, this happening yet again while telling someone about this kind of thing happening is what made me quit and uninstall, it was definitely the last straw of annoyances)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A game that allows Chinese people to spam hundreds of friend requests and invites to a PRIVATE multiplayer town, with no way to block them on Steam or in game is unacceptaple.\n\nEven after you accept them as a friend, which is the only way to BLOCK them in game, they can still spam you over and over.\n\nTo allow this kind of harassment is enough to make this game non multiplayer functional. It made my friend and I completely stop playing.\n\nThe devs should be forced to give refunds to all players that request it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i liked the game, but as i just found out, you can put 200+ hours into the game and once you save sandrock, the game stops showing your saves, making you start all over, even with your save files still there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Exhausting. That’s the best word for this game. I gave it a fair shot with 78 hours logged. At first, it felt like a spiritual successor to Dark Cloud, but it quickly revealed itself as an artificial time sink.\n\nCharacter customization is weak. You can pick a “voice,” but it’s just for grunts while mining or chopping. No actual dialogue.\n\nProgression is slow and padded. You’re constantly waiting for machines to finish, missions to unlock, NPCs to send you plans, etc. To help with this, the game offers ruins, mining, resource gathering, relationships, and exploration, but none of it feels rewarding. Combat is basic and unchallenging. Mines are dull. Once you’ve mined the first level, they are virtually the same. Relic hunting is pointless. The “rewards” given aren’t worth donating the relics, and the Museum felt like an afterthought compared to the previous entry. Raids are mind numbing and I outsourced to the civil corps whenever possible.\n\nRelationships are lifeless. NPCs show up to “play” and walk away before you reach them. Dialogue never changes, even as you grow closer. Outside of main missions, everyone reverts to canned lines.\nExploration is gated and unrewarding. Most treasure chests are junk. Invisible walls block off areas. New zones are locked behind story progression.\n\nEven in 2025, bugs persist. I got stuck in Halloween decor without touching it. During the airship parade, my character glitched into a pickaxe animation loop and couldn’t interact with anything.\n\nToward the end, I realized I wasn’t having fun. I stopped building, skipped days by sleeping early, and sighed every time my character woke up as I dreaded an NPC was waiting for me outside.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this game for about 60 hours, enjoyed it, put it down, then came back months later to restart and played another 60 hours.  I would have played past that if I didn't encounter a game-breaking bug at that point that has rendered the game useless to me (I cannot play on any save or any form).  That was more than a year ago and that bug has never been fixed, my reports seem to have been totally ignored, and the cherry on top?  When I googled it, I found out that the exact same bug was present in their previous game, My Time at Portia.  This makes me very skeptical that I will have a positive, bug-free experience with their new game.  It's worth playing... if it works.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought this because I was promised co-op.  This game doesn't have co-op, it has a half-baked sandbox pile of shit that doesn't include the main storyline.  What the actual fuck is the point?  Incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "GRIND GRIND GRIND THEN WAIT THEN GRIND AGAIN AND AGAIN — im so happy, u can't even imagine\r\n\r\nSolo and co-op modes are totally different. \r\nPlaying solo? Grinding for resources is way tougher. There’s some kind of story but I barely played it because I bought the game to play with a friend so idk how good it really is. \r\nCo-op? Resources drop easy. Feels like u r stuck in this endless loop of build-build-build, zero fun.\r\nThey basically turned co-op into a plain sandbox mode and I don’t get the point. Like, why couldn’t they just add the same story from solo mode and keep sandbox as a separate option? Makes no sense. Im really tired of doing just one mission a day just to get some exp and level up my workshop. Otherwise, there’s nothing new. Progress is slow af.\r\n\r\nI’ve played tons of farming simulators but this one just feels raw and honestly boring as hell. Trust me, u r better off playing Stardew Valley or Minecraft over and over than hoping to find anything new.\r\n\r\nI’ve wanted to try this game since beta but back then there was no multiplayer so it didn’t make much sense for me. Now I finally got it for a really low price.\r\nI fell for all those positive reviews, especially the ones comparing this game to Stardew Valley — but I got totally scammed.\r\n\r\nAnyway, it’s 99% grind and 1% fun. Pretty disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's fine, but I remember enjoying Portia more. This game's main quest progresses way too slowly. Since the main quest unlocks things, it just feels like a hard lock. There are typically multiple in game days between steps in the main quest and this is where all the time is wasted. Sometimes you could simply skip days, other times you have a \"meet in the evening at this place\" to progress the quest. Maybe you don't actually have to, I haven't risked it...but this means I have to either speed up the game timer or find some way to use the whole day.\n\nThis wasn't a problem early game, but I'd say it's been a slog since about hour 30. Looking at the list of main quests, it doesn't look like I'm even halfway through.\n\nI don't want to be rushed. I like the cozy aspect. I think it would be a lot better if the next quest just triggered immediately instead of days later. I don't think it would ruin any sense of \"realism\"...there's plenty of \"hurry up!\" dialogue that makes you think an actual world is progressing without you; it's not, it will wait for you. Knowing this, I don't see any harm in removing arbitrary delays.\n\nPlenty of other things have improved since Portia but the pacing makes me prefer the first game. Worth playing if you don't mind a very slow experience past the early stages. But I wouldn't say I recommend it.\n\nEdit: And it's so buggy...nothing gamebreaking, just constant annoyances. I don't remember the last game I played that was this buggy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have 113 hours into this game and I played and finished My Time at Portia.  Upon beating the main story I got the Steam achievement “Jewel of the Eufaula – Complete the main story.”… 8.2% of players have that achievement.  I really wanted to like this game, but there are way more bad things than good, so it is uneven and just not a good game in my opinion.\r\n\r\nSo how come only 8.2% of the people playing finsihed the main story?!?!?  Well, the games story plays out of order.  You WILL feel like you have finished the main story about 80 hours in.  The story line will FEEL like the end, but its not.  Everything after that main story end feeling is boring and very repetitive. \r\n\r\nIts like they just threw in some extra crap to keep you busy for no real reason.  They introduce new people you can have relationships with, be friends with and might make you mad you are married to who you have,  they give you armor and weapons you are not high enough level to use, and have ruins that are level 80-90, but no quests or reason to do them… When I bet the game I JUST hit 50, to get to 80 is crazy.\r\n\r\nAlso the pacing of this game is off.  You don’t need to unlock most of the shop land and only need the best workstation (I NEVER used the factory, it was not needed or required to use).  The UI is pretty bad after you use it for a while. ALWAYS having the “new” icon on everything is super annoying and you can’t clear them very easy at all.  The skill tree is super pointless and you end up getting most of the useful stuff very quick then the rest of the game you are just filling blank spot that don’t mean anything.  Why do I want to put points in sword and shield when I use dagger weapons??\r\n\r\nThere are lots of things that make the game more annoying vs helping.  At one point I had to make some bush sculptures, but I needed a certain kind of plant… which I didn’t have and I could only get from growing it.  Growing TAKES FOREVER, so I was locked into playing hours to let the plants grow OR sleep over and over to make time fly.  You also cannot do anything to speed time up.  If I run out of things to do at 3pm, but I need to meet someone at 10pm, I have to find something to do for that time.\r\n\r\nPortia is a MUCH better game outside of the graphic and size of the land (which has its own issues… there is TONS of space, but you don’t and won’t use/see most of it).\r\n\r\nI’ll still give My time at Evershine a chance since they could fix most of the bad things in this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried to like Sandrock. I really did, I put several days into playing the game.\r\n\r\nBut there are just way, way, WAY too many little tiny bad ideas that all pile up into an unplayable mess.\r\n\r\nStamina runs out WAY too quick, you can't even finish a single day before running dry.\r\nFood barely restores ~10 Stamina, IF you're lucky. No point in even carrying any.\r\nEverything costs so much money, you'd have to grind for weeks to buy a rug.\r\nEvery upgrade requires MULTIPLE DAYS to unlock - finishing the entire tree would take MONTHS.\r\nAll of the NPCs have page after page after page of pointless blathering dialog. They just don't shut up!\r\n\r\nAnd the control scheme! Why, for loot's sake, is TRIANGLE the main action key?! It took me ages to relearn the muscle memory when virtually every other game uses Cross as main action. I couldn't find any options to rebind the keys.\r\n\r\nThe game does NOT remind you of enough viable data, so you will most likely miss several important dates. You're punished for cutting down trees \"near the city limits\", but those limits are not shown on the map! So I tried cutting down trees so far out in the desert, they didn't render when viewed from town... and STILL got dinged for it!\r\n\r\nAnd even after spending almost an entire year in-game, my Workshop rating was... 4.\r\n\r\nThis game is disgustingly imbalanced. I 100%'s three other farming sims this year and loved them all; Moonstone Island, Coral Island, and good ol' Stardew Valley. Each had their own minor flaws, but each could be tolerated for what they offered.\r\n\r\nBut Sandrock has ALL of the flaws of those other sims, plus tons more.\r\n\r\nThis just is not a comfortable game to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "в коопе урезан сюжет(полностью)\r\nв коопе уебищный сюжет \r\nв коопе картонные персонажи\r\nв коопе только фарм, картонный уебищный\r\n\r\nпидарасы на разрабах уже делают 3 часть, пока эта незакончена и обещания не выполнены\r\nследующая часть выглядит как такой же кусок говна с древними анимациями, каменными еблами и рагрузками при входе в дом в 2025 году\r\n\r\nбюджет игры 12 миллионов долларов",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game looks alright, wanted to give it a shot on multiplayer with my brother but wasn't able to play hardly any of the game because I spent most of my time in loading screens and in between crashes which happened probably a dozen times. I cant speak to the game itself, it seems ok but the crashes makes it unplayable at least in multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After being out for 2 years the game still has many bugs and lacks QoL features:\r\n- the game not pausing when talking to a character so you have to strain to listen to people while others talk in the background\r\n- no \"auto-play\" setting (which should be on by default anyways) so you have to manually advance every single dialogue line (which is like 80% of the game and gets extremely tedious and annoying)\r\n- only being able to track 2 quests at a time despite being able to take up to 5 commissions a day (3 build, 2 monster hunter), in addition to side/main quests which you may want to ALSO track\r\n- side quests expiring without proper warning and no way to retry them if they expired in the background without your knowledge (the game doesn't sufficiently notify you of quests when they are timed, they rely on you checking in your quest log for every single quest)\r\n- horrible UI where when you pick up an item from a machine and then quickly enter a machine's UI the pickup icons overlay the recipe window so you have to wait a few seconds for that UI element to disappear before you can choose a recipe\r\n- Chinese language/symbols appearing in the English game in certain spots\r\n\r\nIt's clear that the developers didn't care about creating the best possible game, but rather rushing it out the door without proper post-launch support.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A bit on the fence on this one. The biggest issue are the bugs. No complete progression locks yet, but looks to be memory leaks, quests that don't look at existing completion, etc.\n\nA lot of missable content in the game if you don't play a certain way.\n\n\nSome bug examples:\n\n\nThere are bugs like if you complete an objective before receiving the quest, the game has trouble with recognizing it, which could lead to quests that can't be completed if a non-respawning resource/target is required.\n\nThere are invisible walls all over the place instead of logical walls.\n\nAllies (and enemies) that will target each other through walls in certain situations.\n\nCertain progress not being tracked properly when allies do the final hit on a target you almost killed.\n\nJournal progress that isn't tracked properly and new marks that can't be cleared because the progress isn't tracked properly.\n\nThe game also will ignore your current gear for missions if you have better gear.\n\nEnemies and allies can have their AI break; Sandy is especially an issue since Sandy will start teleporting around town, making it effectively impossible to interact.\n\nThere are beneficial bugs too, like certain quest objects will keep respawning until you reach a certain progression.\n\nYou also have issues like where the quest tracker doesn't properly track progression on craftable items and the materials if the item is in the queue.  That one I don't blame them for since it would give a pretty significant hit to performance.\n\nThere are semi-bugs as well and a few annoyances. Annoyances include if your mount walks onto a machine and other overloaded buttons, that you can't set the default to run. (Rolling is faster than running, so that is something that requires generous run button usage until you get a mount).\n\nYou have quest-related items that you can't sell or drop, but can gift and can end up with multiple copies of.\n\nThe game has odd choices where sometimes the game will take you straight to a destination (even if you are in the middle of something) and sometimes the game will give you a choice and sometimes the game will just leave you in place.\n\nA few hitboxes that are just a bit off.\n\nThe broom icon on machines that don't need sweeping.\n\nSome very odd design choices (enemies don't trigger electric fences, but can be damaged by them if you run into the fence, for example).\n\nEnemies can walk on air, making them near-impossible to hit in some cases.\n\netc.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I really want to like this game and review it positively but it's got so many little frustrating things going on that a decent core is really ruined, to the point that I actively quit the game during one such moment and immediately uninstalled it.\n\nThe big things are the random bugs strewn throughout (all the way down to the normal resources near your shop respawning but being invisible for some reason??) which are just quirks at first, but add up, the quest system being seemingly straightforward but doing strange stuff with progression, and for me personally, the thing that drove me insane is the choice to do the \"highlight a new item with a marker until you look at it\" concept, but to the extreme. \n\nI am a person who likes to clear all the little notification flags in a game like this. Every time you find a new thing, it is flagged in your guide, and to get the little flag to go away, you have to pull up the guide, go to the section, probably go to a sub-section, and then half the time, scroll down through a long tiled list of things to find the new one and click on it to have *seen* it, I guess. That would be annoying enough, but not the first game to do something like this, right? Well, guess what, if you pick up a crafting material that you haven't seen before, it's flagged in your inventory, oh wait, no, if you don't have one in your inventory already, it's flagged, whether or not you've seen it before. Again, extra annoying, but I was just sort of putting up with it. That is, until I crafted the station to cook with.\n\nEvery time you open the cooking station, every single item that you can cook with in the window to select from is flagged as if it were a brand new item. Every. Single. Time. WHY?? I thought maybe it was a glitch, and it would go away, but no, every time you go to cook, the game is like HERE'S EVERY ITEM YOU CAN COOK WITH, DO YOU REMEMBER? THEY'RE THE ONLY ONES YOU CAN COOK WITH, BUT YOU DIDN'T LOOK AT EVERY ONE OF THEM THIS PARTICULAR TIME. CHECK IT OUT. (For context, this happening yet again while telling someone about this kind of thing happening is what made me quit and uninstall, it was definitely the last straw of annoyances)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A game that allows Chinese people to spam hundreds of friend requests and invites to a PRIVATE multiplayer town, with no way to block them on Steam or in game is unacceptaple.\n\nEven after you accept them as a friend, which is the only way to BLOCK them in game, they can still spam you over and over.\n\nTo allow this kind of harassment is enough to make this game non multiplayer functional. It made my friend and I completely stop playing.\n\nThe devs should be forced to give refunds to all players that request it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i liked the game, but as i just found out, you can put 200+ hours into the game and once you save sandrock, the game stops showing your saves, making you start all over, even with your save files still there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Exhausting. That’s the best word for this game. I gave it a fair shot with 78 hours logged. At first, it felt like a spiritual successor to Dark Cloud, but it quickly revealed itself as an artificial time sink.\n\nCharacter customization is weak. You can pick a “voice,” but it’s just for grunts while mining or chopping. No actual dialogue.\n\nProgression is slow and padded. You’re constantly waiting for machines to finish, missions to unlock, NPCs to send you plans, etc. To help with this, the game offers ruins, mining, resource gathering, relationships, and exploration, but none of it feels rewarding. Combat is basic and unchallenging. Mines are dull. Once you’ve mined the first level, they are virtually the same. Relic hunting is pointless. The “rewards” given aren’t worth donating the relics, and the Museum felt like an afterthought compared to the previous entry. Raids are mind numbing and I outsourced to the civil corps whenever possible.\n\nRelationships are lifeless. NPCs show up to “play” and walk away before you reach them. Dialogue never changes, even as you grow closer. Outside of main missions, everyone reverts to canned lines.\nExploration is gated and unrewarding. Most treasure chests are junk. Invisible walls block off areas. New zones are locked behind story progression.\n\nEven in 2025, bugs persist. I got stuck in Halloween decor without touching it. During the airship parade, my character glitched into a pickaxe animation loop and couldn’t interact with anything.\n\nToward the end, I realized I wasn’t having fun. I stopped building, skipped days by sleeping early, and sighed every time my character woke up as I dreaded an NPC was waiting for me outside.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this game for about 60 hours, enjoyed it, put it down, then came back months later to restart and played another 60 hours.  I would have played past that if I didn't encounter a game-breaking bug at that point that has rendered the game useless to me (I cannot play on any save or any form).  That was more than a year ago and that bug has never been fixed, my reports seem to have been totally ignored, and the cherry on top?  When I googled it, I found out that the exact same bug was present in their previous game, My Time at Portia.  This makes me very skeptical that I will have a positive, bug-free experience with their new game.  It's worth playing... if it works.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought this because I was promised co-op.  This game doesn't have co-op, it has a half-baked sandbox pile of shit that doesn't include the main storyline.  What the actual fuck is the point?  Incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "GRIND GRIND GRIND THEN WAIT THEN GRIND AGAIN AND AGAIN — im so happy, u can't even imagine\r\n\r\nSolo and co-op modes are totally different. \r\nPlaying solo? Grinding for resources is way tougher. There’s some kind of story but I barely played it because I bought the game to play with a friend so idk how good it really is. \r\nCo-op? Resources drop easy. Feels like u r stuck in this endless loop of build-build-build, zero fun.\r\nThey basically turned co-op into a plain sandbox mode and I don’t get the point. Like, why couldn’t they just add the same story from solo mode and keep sandbox as a separate option? Makes no sense. Im really tired of doing just one mission a day just to get some exp and level up my workshop. Otherwise, there’s nothing new. Progress is slow af.\r\n\r\nI’ve played tons of farming simulators but this one just feels raw and honestly boring as hell. Trust me, u r better off playing Stardew Valley or Minecraft over and over than hoping to find anything new.\r\n\r\nI’ve wanted to try this game since beta but back then there was no multiplayer so it didn’t make much sense for me. Now I finally got it for a really low price.\r\nI fell for all those positive reviews, especially the ones comparing this game to Stardew Valley — but I got totally scammed.\r\n\r\nAnyway, it’s 99% grind and 1% fun. Pretty disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}