{
  "positive": [
    {
      "review": "for whoever read this rating and struggling whether to buy this game or not. If you like Xcom2 type of gameplay, you'll love this game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I normally don't want to spend >100 hours on a game. I just don't have that much free time. Started as a nostalgia for old-school JAs -- many complain they don't make such games anymore -- and I'd been hooked. Took me 160h to finish, and no regrets. Admittedly, could have completed it quicker, but I enjoyed it slow: planning next steps on the strategic map, shuffling inventory, modding weapons, training and crafting.\n\nBy the end of the game \"typical\" skirmishes tend to get quite repetitive (and easy), so I had to resist the urge not to use auto-resolve. Final and/or \"boss\" battles were all great.\n\nFinished the game with 3 squads. Mercs are elaborate and fun, incl. voice-over, which is why I wanted to use as many as I could. I appreciate game developers investing real effort here, as well as into NPCs. The A.I.M. ecosystem is not something new, and I'm glad the devs did not use this as an excuse to get lazy.\n\nThe variety of quests is impressive, and some are especially witting. I completed all of them. However, I doubt you can do that on the 1ST playthrough without using a game guide. I could not afford the 2ND (cf. no free time as already mentioned), and if you're like me, use a guide / checklist.\n\nAt version 1.5.x -- latest patch as I'm writing this -- no bugs encountered.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "one of my favorite games. unlimited replay value, so many good mods, punishing but ultimately fair difficulty (i would advise you to read a walkthrough for your first playthrough), great story, funny as fuck characters except livewire she is so goddamn annoying, works perfectly under linux i could go on. i think the greatest compliment i can give a game is when i'm unable to put it down after i start playing, like i can grind this shit for 12 hours straight without getting bored and i have adhd lol. \n\nutter masterpiece and the first TBT game i fell in love with, excellent introduction to the genre despite its difficulty, again read a guide also install QoL mods. i'm using:\nshow chance to hit (https://steamcommunity.com/sharedfiles/filedetails/?id=2993428346)\naudaki's UI enhancements (https://steamcommunity.com/sharedfiles/filedetails/?id=3159404303)\npause for mines (https://steamcommunity.com/sharedfiles/filedetails/?id=3048450835)\nno stealth vignette (https://steamcommunity.com/sharedfiles/filedetails/?id=3048788234)\ninterface tweaks (https://steamcommunity.com/sharedfiles/filedetails/?id=3274998887)\nand less intrusive healthbars (https://steamcommunity.com/sharedfiles/filedetails/?id=3277519019)\n\nanother note, if you are on linux with an NVIDIA gpu you have to disable SSR otherwise the game hangs/crashes at launch. protondb page which outlines the tweak: https://www.protondb.com/app/1084160",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A supremely fun tactics and merc company sim disguised as a corny 90s action movie. It's not perfect, but it's a top-tier choice in the turn-based-tactics genre. For a AA game, this has tons of polish: great environments, characters  and animations, solid combat, lots of interesting quests and sidequests. I also love that you get to make your own merc. Playing this after a recent run through XCom: Enemy Unknown makes me really appreciate the lack of RNG wackiness in JA3 (i.e. missing 75% of shots that should hit 75% of the time).",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is a middle way betwen XCOM and Tactical RPG.\n\nBut either way is a great game with a healthy mod scene.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fans of the series will settle in quickly, and anyone who enjoys turn-based tactics will feel right at home. Familiar mechanics like overwatch and holding defensive positions remain intact, but it is the additional layers built on top of these foundations that allow Jagged Alliance 3 to truly shine. It delivers the exact kind of one-more-turn experience many players have been waiting for. The game challenged me in all the right ways through planning, leadership, and patience. Even with its flaws, I wanted to follow the campaign from the first encounter to the final moments, and the journey felt worthwhile. In short, Jagged Alliance has made a real return.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Jagged Alliance 3 gets a lot of things right. Not every facet of it is a straight improvement over Jagged Alliance 2 - for instance merc variety and balancing could be better as well as without mods there are simply too few weapons to my taste. But on the whole it is a reasonably faithful, soulful and quite simply fun game. The good old strategy and tactical layers are there albeit this iteration feels somewhat more limiting at times with its slightly more linear structure and several scripted events that impose certain time limits.\n\nThe new setting is quite unique with there being surprisingly few games inspired by African (and maybe Carribean) culture and geography. The tone has shifted a bit more towards comedy - JA2 was mostly grounded and serious with a little bit of whack and comedic relief here and there and JA3 takes itself less seriously.\n\nOn the technical side JA3 is sufficiently competent - it runs well enough, looks pretty most of the time, has good mod support and mostly just works without there being much to mention. Soundtrack stands out though as it is exceptional with its actual orchestral symphonies and ethnic motifs.\n\nKeep in mind though that Jagged Alliance 3 is a sequel to Jagged Alliance 2, not its phenomenal 1.13 mod. You will be sorely disappointed if indeed you are hoping that JA3 can compete with 1.13 in terms of features and variety.\n\nWith these rather minor caveats in mind I wholeheartedly recommend this game to fans of both the series and the tactical/strategy genre of games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game right before I caught COVID, so I played it extensively in a haze of edibles and cough medicine. I was sick for like a month. It was a lot of fun. Very silly. The game kept me thoroughly entertained.  The only sucky part was the game crashed every so often. I just made sure to save often, so it wasn't a deal breaker, and I'm sure some genius figured out a fix by now.  I was so bummed when I had to go back to work. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "JA3 is great! I used to play JA2 and I loved it, this one is very close to the original, with a some cool new developments. Fans of JA2 will feel instantly at home. I finished the game twice on different difficulties. I am big fan of turn based strategies and this one is a very good one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have played for a sufficient amount of time. JA3 is an improvement on the series. I loved all three versions of the game even JA2 that gets dinged somewhat. JA3 has great challenging game play. Would say JA3 is the king of the top down tactical shooters. Great excitement and involvement. One of the things that make the JA series great was the amount of different and amount of guns in the game. You can develop strategies around them. I can turn buildings and homes into structures of death with melee weapons, shotguns and sub machine guns. Love it. Excellent system of game play.\n\nWhere would I like to see the game or another game based on the same engine? I would like to see a space based RPG with character development where you create your own team. DLCs can be based on character or team level average.  One thing Wasteland 2 got really right.  There is just too many tactical shooter isometric games based on the present and past and the post apocalypse. With a space based RPG the number of weapons you could have would be infinite based upon a civilization technology level. The worlds would be infinite too.  Hostile environments like acidic atmospheres higher G environments where protective equipment is needed. Zero G combat. Power armor/semi-robotic armor. More graphic scenes of NPCs/hostiles being blown away with different weapons and the kind of damage they inflict. You would already have my money. Okay that's enough. Time to get back to playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it, wonderful game I even gave one copy to my friend and my brother, and they loved it too. While certainly not perfect as Jagged 2. The truth is Jagged 2 is rather dated, and while I would recomend it to almost anyone, I would also say it not for everyone who does not have a lot of patience. This on the other hand is more for todays audience, You can play together co-op and it has a lot of mods. The music is awesome, combat can be very engaging, and fun. My only real complaint is some of the balance, and that some features from the previous games had (Jagged 2) are missing, and some features can be a little wierd, but thats what mods are for. Still all in all I still love this game, had loads of fun playing with different friends. I hope they make another one and learn from this, while the misses were few, most of it was exellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jagged Alliance 3 had big shoes to fill an I think it did an excellent job. The game play was immersive with plenty of variety in mechanics to keep the game interesting from start to finish. The characters and mercs were excellent with good dialogue. \r\nIt did feel like the difficulty curve was a bit unbalanced. It was quite difficult early on for some time before becoming relatively easy. There could have been a better difficulty gradient. \r\nDefinitely glad I bought the game. The developer did a good job continuing the legacy of Jagged Alliance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After several rather mediocre (at best) attempts to revive the Jagged Alliance games, JA 3 is a welcomed update to the formula. The game mechanics overall are well implemented and the game is engaging enough (and the situation of the fights not to genereic) to keep you in the game and let you not auto-resolve most the fights.\r\nThe story and the side mission are allright, although (especially the main quest) partially a little bit generic. NO ONE will be surprised by a certain betrayel I asume...\r\n\r\nHowever I find that concerning the roleplay-mechanics (especially the interaction around the mercs and between them and the locals) could have been fleshed out even more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautyfull hours, interesting storyline. One of those productions I will never forget.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like most tactical RPGs, it has more in common with a slot machine than its actual subject material.  I want] to take on the administrative, strategic, tactical and moral challenges of spearheading an insurgency as a soldier of fortune.  Dress it up in action movie tropes, alien invasions, silliness and buffoonery if that's what you think you have to do to \"capture the spirit\" of a better game from our youth, but don't make the mistake of thinking we were ever in it to roll dice and watch clowns fail basic tasks.\n\nI've only been playing for a few hours, and I already have point-blank-miss-fatigue, and I've come down with a case of bigworldofclaustrophicmapsiitus.  I'm already looking at the workshop as a source of treatment for my various ills.  The fact that it [i]has[/i] workshop support speaks volumes as to the conscientiousness of the developers.  This thumbs up is for the studio.  I don't like their game, but I like [i]them[/i].",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Having been playing this game since the first one, I can easily say this is a great installment. If you are on the fence on this one, try it, you wont regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game closes without fanfare with alt+F4.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "great singple player strategy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "List of things to enjoy\r\n- a cast of stereo typical characters\r\n- cheesy one liners from 80's and 90's\r\n- a trip down memory lane\r\n- ridiculous plots with fun twists that you can see from a mile away\r\n- surprisingly complicated mechanics\r\n\r\nOverall this game is just a banger to enjoy, especially if you grew up in the 90's. And if you're younger, grab the game and experience what I like to call the \"boomer brainrot\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent game: a true tribute to JA1 and JA2. It doesn’t have the same level of micromanagement as JA2, but it’s still a lot of fun. There’s a much stronger emphasis on NPC interactions than in previous installments. It would be nice to have more mercs available to hire, as that would add even more replayability to the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good sequel, finally a game that compares favorably with the second episode.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Maintains the feel of the original games, and has so many great characters, and deep skill tree leveling.  it's a lot of fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have a lot of complaints about this game.\nMy keyboard often spams inputs and will sometimes become unresponsive. \nMy mouse often becomes unresponsive, requiring me to turn it off and back on again.\nMultiplayer is a buggy mess. Lag makes inventory management difficult, often necessitating turn taking with your friend. \"Are you finished moving those grenades? I need to switch out a couple guns.\"\nSome of the combat animations are unpolished and clunky, especially when your squad jumps through windows.\nLivewire's dialogue is insufferable to the point I muted the voice audio. \n\n\nConsidering all that: I can't recommend this game enough. I'm having an absolute blast with it. 9/10, highly recommend it if you're a fan of tactical combat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome! I finished it in 159 hours.\nThe story is good with some dry humor. The weapon arsenal is great, but you can use mods to make it more varied. You also have plenty of choices when it comes to mercenaries.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best strategy games X-COM like available to this day.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Jagged Alliance 3 continues a classic from my childhood, and playing it fills me with both joy and nostalgia.\n\nIt perfectly recaptures the atmosphere of the originals—the quirky personalities, over-the-top one-liners, and the unmistakable action-movie charm that defined the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's better than Jagged Alliance 2. That's right, I said it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best tactical RPG that ever existed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a wonderful game of the genre. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice Jagged style as usually",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mods are awesome for this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Baller game for ballers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "excellent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than xcom",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For those nostalgic for JA2, it's a game that delivers (unlike the farces that were previously released under the name Jagged Alliance).\n\nIt's very interesting how there are mysteries and useful things all over the map; it reminded me a lot of F10 Farm or Tixa. And depending on what you're doing, there are people you can recruit. I miss you, Dimitri, although you always forgot, you forgot again. But not you, Elliot.\n\nFor those who didn't know JA2, it's a fairly fast-paced turn-based strategy game with a dose of humor and classic references (there's a civilian who's no longer a soldier because he got hit by an arrow, you know where).\n\nThe Workshop adds a lot of useful content and modifications (the developers even published a mod to view aiming accuracy statistics, although I recommend avoiding it).",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "JG 3 is a good turn-based RPG, but it has some serious flaws, making it, in my opinion, a 7–8/10 game.\nNote that it's a lot more of an RPG and a lot less realistic than you might initially expect.\nI didn't really play JG 2, so this review is not a comparison to its predecessor.\nAlso note: If you're looking for a turn-based strategy game and haven't played XCOM 2, I’d actually recommend playing that first instead.\n\nPro:\n\nA nice story and light-hearted dialogues with dry humor, plenty of chuckles, and not a trace of political correctness. The overall classic presentation of the story (including an epilogue, etc.) is a refreshing change in today’s gaming landscape.\n\nIn “Tactical View,” the gameplay pleasantly resembles Wasteland 3; the sectors you visit are small but packed with many neat little \"secrets\" and loot.\n\nThe turn-based combat is well-executed overall and it's genuinely fun to mow down enemies with various guns, gradually gaining a deeper understanding of the combat system and becoming more efficient. There's also a level-up system for your mercenaries, albeit a very minimalistic one.\n\nIn theory, there’s a lot to explore on the world map.\n\nCon:\n\nDue to an overwhelming \"flood of items\" pretty much from the start, there’s little incentive to tackle the many optional sectors and tasks. Even seemingly rare items will eventually pile up in your inventory, even with only a moderate interest in exploration. As a result, you’ll likely stick to just progressing the main mission — unless you really enjoy exploration for its own sake.\n\nPoor weapon balance. Shotguns, snipers, and all kinds of explosive weapons are very powerful, consume little ammo, and are therefore incredibly fun and easy to use. Unfortunately, all other weapon types are significantly weaker across the board. This further diminishes the desire to explore, since early on you’ll likely get your hands on one of the overpowered weapon types and be \"set\" for the entire game, allowing you to breeze through most fights with ease. There’s little reason to use the less efficient weapons at all.\n\nDumb enemy AI. It quickly becomes obvious that your enemies almost always follow the same predictable patterns (except in a few special missions). Once you've figured out the typical AI behavior, it’s usually easy to take out dozens of enemies one by one without much resistance.\n\nLack of information. While there are tutorials, many mechanics must be figured out on your own. There's no hit chance displayed in %, no detailed tooltips for your mercs' stat bonuses, etc.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "JA2 might have been my 1st military tactical game. Discovered it accidently and loved in unconditionally.\r\n25+ years later much have changed in the world of computer gaming, and not always for better, for this reason I was really sceptical what will JA3 be, but to my surprise this is as much \"old school\" Jagged Alliance as you can expect it to be in 2025.\r\nIt's tactical, military, not politically correct, sometimes unbalanced, but overall plenty of fun for an oldtimer like me.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[h2]A Must-play for Tactics Lovers[/h2]\nI played the game way too much in the first playthrough itself, often experimenting with different things, and there are more challenges still to complete. Although I didn’t play the original games, from what I’ve learned, this is one example of a sequel done right. There are about three dozen mercenaries of differing skills and levels you can choose from to build a team of one to 15 mercs and there are five more that can be recruited for free through mission progress. You are tasked with freeing a nation from enemy forces and recapture diamond mines to fund your mission. Apart from the main mission, which has many twists and turns, there are numerous side quests, often modeled around references from pop culture. The whole game is filled with interesting and humorous dialogues and banter to keep you entertained in and out of battle. The game also covers diverse environments and maps that bring tactical challenges (like you cannot lie down in water).\n\n[h3]Now that the premise of the game is out of the way, and I’ve mentioned that it is an overall entertaining game, as usual, let me focus on some issues one might face in the game (mostly nitpicking, but some can be good QoL improvements):[/h3]\n[list]\n\t[*]The game runs on a hidden timer which triggers certain events at certain points, so the first run may be a jarring experience for some going in blind as you are expected to be at a certain part of the map, but you may end up far away and underprepared. On top of that, the default settings auto-run time whenever you put someone to work (repair, train), while others are still idling/waiting (can be changed in settings).\n\t[*]While game is very generous about the save system, allowing you to save mid-battle, the weapon modification system encourages save-scumming as modifications cannot be detached and modification can fail even with high mechanical, resulting in lost parts and sometimes durability.\n\t[*]You need to repair items frequently, but repair requires a minimum of 6 hours and you can only repair a limited number of items in one go. You cannot add more than two people like in case of healing to speed up time… You cannot determine who an item is equipped to, main team or extras. These limitations do not make any sense.\n\t[*]Adding to that, you can only make ammunitions at towns that you control, meaning in early game when you lack resources, you may need to back track a lot just to craft ammo even when in neutral territories.\n\t[*]Similarly, the scouting system is also unreliable. You can scout for nearby sectors, but there is no way to specify which sector. It takes a long time if no visible sector is scouted, and you only get intel on a couple random sectors. Hacking devices often provide info for scouted sectors, if they provide intel instead of money; once again save-scumming is encouraged if you want to be efficient.\n\t[*]Your own mercenaries block path for each other during combat, especially if placed near doors, makes no sense when they can break windows to enter rooms and jump over obstacles.\n\t[*]Interactions (loot, cut wire, open lock, hack) often don’t work the first time and the game also does not auto select the best person for the job, so you have to manually select them. Viewing angle also messes with interactions.\n\t[*]Energy is an important system, but is a hidden mechanic which you can't track until it hits you as your mercenaries are struck with debuffs.\n\t[*]You cannot track experience gain either. Some more experienced mercenaries come at higher levels, but that is often a hindrance than a boon as there is no respec in the game, so you are stuck with the skills they already come with instead of starting afresh. It would be more useful if they came with free skill points to spend, instead. However, fully optimized builds are not required to enjoy the game.\n\t[*]Speaking of builds, picking off lone enemies or small detached groups with snipers is the easiest way of playing the game. And while you can find impressive melee build videos on YouTube, it is still risky, especially when you don’t have an optimized melee build. So, despite having different ways to play the game, stealth snipers work best in most situations.\n\t[*]However, stealth kills are not always guaranteed to be safe as the detection radius is not explicitly mentioned. Also, even though there is no ‘hide body’ mechanic, enemies would sometimes get alerted about long-dead buddies (pun intended).\n\t[*]Weather or other hazards (fog) affecting a sector is only shown during loading screen, but after that, there is no easy was to check that.\n\t[*]While some people have mentioned performance issues, I noticed music sometimes turning off suddenly, and while the game ran fine, if I tried to quit, it froze.\n[/list]",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "one of my favorite games. unlimited replay value, so many good mods, punishing but ultimately fair difficulty (i would advise you to read a walkthrough for your first playthrough), great story, funny as fuck characters except livewire she is so goddamn annoying, works perfectly under linux i could go on. i think the greatest compliment i can give a game is when i'm unable to put it down after i start playing, like i can grind this shit for 12 hours straight without getting bored and i have adhd lol. \n\nutter masterpiece and the first TBT game i fell in love with, excellent introduction to the genre despite its difficulty, again read a guide also install QoL mods. i'm using:\nshow chance to hit (https://steamcommunity.com/sharedfiles/filedetails/?id=2993428346)\naudaki's UI enhancements (https://steamcommunity.com/sharedfiles/filedetails/?id=3159404303)\npause for mines (https://steamcommunity.com/sharedfiles/filedetails/?id=3048450835)\nno stealth vignette (https://steamcommunity.com/sharedfiles/filedetails/?id=3048788234)\ninterface tweaks (https://steamcommunity.com/sharedfiles/filedetails/?id=3274998887)\nand less intrusive healthbars (https://steamcommunity.com/sharedfiles/filedetails/?id=3277519019)\n\nanother note, if you are on linux with an NVIDIA gpu you have to disable SSR otherwise the game hangs/crashes at launch. protondb page which outlines the tweak: https://www.protondb.com/app/1084160",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "for whoever read this rating and struggling whether to buy this game or not. If you like Xcom2 type of gameplay, you'll love this game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "JaggedAlliance3 is one of the coolest tactical games ever! It tells a deep story trough its level design and the AI characters and leaves the player plenty of decisions how to play and approach this game. It's not comparable to XCom2, since it has no mission grid field in the levels itself bit only in the map view and it reminds of real wars and not sci-fi wars, but in this respect it is also educational, not like a book but like a good game anyway. I'm a little bit sad though, that there are no add-ons for this game and it hasn't been oVerHauleD. But it is great anyway. In my opinion a must-play for every real time taactics fan. Regards, JakobGu",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I normally don't want to spend >100 hours on a game. I just don't have that much free time. Started as a nostalgia for old-school JAs -- many complain they don't make such games anymore -- and I'd been hooked. Took me 160h to finish, and no regrets. Admittedly, could have completed it quicker, but I enjoyed it slow: planning next steps on the strategic map, shuffling inventory, modding weapons, training and crafting.\n\nBy the end of the game \"typical\" skirmishes tend to get quite repetitive (and easy), so I had to resist the urge not to use auto-resolve. Final and/or \"boss\" battles were all great.\n\nFinished the game with 3 squads. Mercs are elaborate and fun, incl. voice-over, which is why I wanted to use as many as I could. I appreciate game developers investing real effort here, as well as into NPCs. The A.I.M. ecosystem is not something new, and I'm glad the devs did not use this as an excuse to get lazy.\n\nThe variety of quests is impressive, and some are especially witting. I completed all of them. However, I doubt you can do that on the 1ST playthrough without using a game guide. I could not afford the 2ND (cf. no free time as already mentioned), and if you're like me, use a guide / checklist.\n\nAt version 1.5.x -- latest patch as I'm writing this -- no bugs encountered.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I loved Jagged Alliance 1 and 2. This game brings me back memories. The same vibe of exploring and round based fighting that I loved. No other game managed to do the same. Commandos was too much tactics. Desperados was too little of everything else, much like Commandos. XCOM was great. But JA always had these extra things. Crafting, Funny dialogue, much more Stuff to explore.\r\n\r\nIf you liked the previous JA games, you very likely will love this one, too. I think for people unfamiliar with JA the game might feel odd at the beginning but you never know what you are going to like, so .... :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A supremely fun tactics and merc company sim disguised as a corny 90s action movie. It's not perfect, but it's a top-tier choice in the turn-based-tactics genre. For a AA game, this has tons of polish: great environments, characters  and animations, solid combat, lots of interesting quests and sidequests. I also love that you get to make your own merc. Playing this after a recent run through XCom: Enemy Unknown makes me really appreciate the lack of RNG wackiness in JA3 (i.e. missing 75% of shots that should hit 75% of the time).",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is a middle way betwen XCOM and Tactical RPG.\n\nBut either way is a great game with a healthy mod scene.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AA game that has more soul than most indies pretend to. It was made with huge passion nad love. One of tthe best tactical game ever created",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is this JA2, one of my all time favorites, NO!  But when I was able to add laxatives to the enemies moonshine to \"loosen up their defences\" I realized that this is truly a spiritual succesor to JA2.  Yes it is different,  computer technology has advanced over a quarter century since JA2 was made, but if you can appreciate JA3 for what it is, it is a great game imho.\r\nMiinus - the characters are not as memorable as JA2\r\nPlus - combat is better once you figure it out (yes, the first time thru the first few sectors was hard as I adapted to the better modeling)\r\nOverall, once I got over the decreased dept to the mercs (that's tough) I found it better.  My only wish was that they had left everyone's lines (and portraits) status quo from JA2 with the current JA3 gameplay",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Jagged Alliance 3 is a solid and enjoyable strategy game that really shines in the early stages. The beginning is full of micromanagement, planning, and careful decision-making, which makes the first hours very engaging. You constantly feel challenged, weighing every bullet, every mercenary contract, and every tactical move.\r\n\r\nHowever, as the campaign progresses, the experience slowly shifts. Once you establish control and your squad gets stronger, the game becomes increasingly repetitive. Battles start to feel similar, and your mercs become so overpowered that most encounters lose their tension. By the later stages, the challenge that made the early game exciting is largely gone, leaving a bit of a grindy feeling.\r\n\r\nThat said, it’s still a good game and worth playing if you enjoy tactical strategy with a focus on mercenary management. The combat is satisfying, the characters are entertaining, and the overall package captures much of what made the series special. It just lacks a layer of depth in the long run. Hopefully, higher difficulty settings can address this by keeping the endgame more balanced and varied.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a very fun turn based tactical game. I never played the originals, but love the genre. It gets a bit tedious and grindy, but definitely scratches the itch in a fun way if you like these types of games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fans of the series will settle in quickly, and anyone who enjoys turn-based tactics will feel right at home. Familiar mechanics like overwatch and holding defensive positions remain intact, but it is the additional layers built on top of these foundations that allow Jagged Alliance 3 to truly shine. It delivers the exact kind of one-more-turn experience many players have been waiting for. The game challenged me in all the right ways through planning, leadership, and patience. Even with its flaws, I wanted to follow the campaign from the first encounter to the final moments, and the journey felt worthwhile. In short, Jagged Alliance has made a real return.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Jagged Alliance 3 gets a lot of things right. Not every facet of it is a straight improvement over Jagged Alliance 2 - for instance merc variety and balancing could be better as well as without mods there are simply too few weapons to my taste. But on the whole it is a reasonably faithful, soulful and quite simply fun game. The good old strategy and tactical layers are there albeit this iteration feels somewhat more limiting at times with its slightly more linear structure and several scripted events that impose certain time limits.\n\nThe new setting is quite unique with there being surprisingly few games inspired by African (and maybe Carribean) culture and geography. The tone has shifted a bit more towards comedy - JA2 was mostly grounded and serious with a little bit of whack and comedic relief here and there and JA3 takes itself less seriously.\n\nOn the technical side JA3 is sufficiently competent - it runs well enough, looks pretty most of the time, has good mod support and mostly just works without there being much to mention. Soundtrack stands out though as it is exceptional with its actual orchestral symphonies and ethnic motifs.\n\nKeep in mind though that Jagged Alliance 3 is a sequel to Jagged Alliance 2, not its phenomenal 1.13 mod. You will be sorely disappointed if indeed you are hoping that JA3 can compete with 1.13 in terms of features and variety.\n\nWith these rather minor caveats in mind I wholeheartedly recommend this game to fans of both the series and the tactical/strategy genre of games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A solid tactical combat game.  If you are a fan of the genre, it doesn't disappoint.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game so far. Just having a little trouble in the start with money.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Has a bit of a complex gameplay, with different weapons, mods, mercs and special abilities - allowing the user to customize it's experience and play style, even outside battle. The storyline has different outcomes and triggers. It may feed a bit repetitive at times, but for the nostalgia and genre is great.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good combat mechanics and nice campaign. On the downside - AI is kinda bad and stealth + snipers makes the game easy mode",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Jagged Alliance 3 is a turn-based tactical strategy game in which you take command over a ragtag group of mercenaries. The game takes place in the fictional African country of Grand Chien in the year of 2001 (few years after the events of JA2). The president’s daughter hires you to find and rescue her father, who has been kidnapped by a paramilitary group called “the Legion” that has been advancing through the country, capturing towns and diamond mines. \n\nYou will need to assemble a team of mercenaries, hiring from the pool of 36 colorful characters with unique traits, backstories and relationships with each other. Some are cheap rookies, some are expensive veterans. Some would love to work together and will get a bonus to morale, some have bad blood between them and will get a penalty or straight up refuse to work together. You can have up to 6 mercenaries in one squad and as many squads as you can afford. And each mercenary has a surprising amount of voiced lines. They often have something to say during quest dialogs, random interactions with NPCs and in occasional banter between two (or more) soldiers. It feels on par with AAA party-based RPGs in that regard.\n\nIf you played previous games of the series, you should feel right at home in JA3, as it tries to be as faithful as possible to the older games. On the strategic map you hire mercenaries, move your squads around and issue tasks like training, scouting, equipment repair and ammo crafting. It’s divided into tiles - each a hand crafted tactical map that you can explore in real time until combat starts, then the game switches to a turn based mode. \n\nThe combat in JA3 is quite complex. You can target different body parts (for different effects) and the game traces line of sight for each, so while the cover does provide overall penalty to enemy’s chance to hit, it can also completely block some parts of your body, while some other parts might “stick out” (which also depends on whether your mercenary is standing, crouching or lying prone). The amount of Action Points your mercenary has depends on their stats and morale, while the cost of taking a shot depends on a weapon and a type of a shot (single, burst, full auto), so the Action Point economy is also fairly complicated. Furthermore, for every shot you take you can spend some additional APs to aim better. JA3 doesn’t show you the exact chance to hit (though there is a mod for that), so you’ll have to figure out for yourself how many extra APs you wish to spend in each situation. As someone who was spending 3+ points to aim every time, I don’t think I missed a single shot past the first quarter of the game. \n\nThe combat starts when the enemies spot you. Up until then you explore the map in real time. You can attempt a “stealth kill” to remove an enemy without triggering combat, and even if you fail, you can limit the amount of enemies dragged into combat if you use silencers. And this is where stealth mechanics are starting to step on the toes of combat. As you get better at stealth, you’re going to see less and less actual combat, unless you deliberately want to shoot yourself in a foot and play sub-optimally.\n\nThere is quite a bit of difficulty drop down as you progress through the game (at least if you take your time and are being thorough, exploring all the areas and doing all the side-quests). The first quarter of the game, where you have challenging combat and have to count bullets and other resources, almost feels like a different game compared to the rest of it.\n\nStill, despite some balance issues and combat getting undermined by stealth, Jagged Alliance 3 is a great game that stands out among other modern tactical games, and I enjoyed it quite a lot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "maybe im the problem but this bcs of no ragdoll death system i cant play this game what i have enjoyed in this kind of games is that destructable enviroment ragdoll system tactics and stuff idk no ragdoll no party for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worse than xcom. im in cover and get shot for 20 dmg. meanwhile the same guy takes 0 dmg cuz hes in cover but better cuz hes not me?\n\nEdit: ok its not that bad after a bit but im still ultra pissed about that one-in-a-million scenario. also very pissed about igor failing a stealth takedown then failing 2 more knife attacks immediately. this shit is exactly what savescumming is for. maybe igor is not good merc after all? igor cousin is much better. i write in report. no medal for igor!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game right before I caught COVID, so I played it extensively in a haze of edibles and cough medicine. I was sick for like a month. It was a lot of fun. Very silly. The game kept me thoroughly entertained.  The only sucky part was the game crashed every so often. I just made sure to save often, so it wasn't a deal breaker, and I'm sure some genius figured out a fix by now.  I was so bummed when I had to go back to work. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "JA3 is great! I used to play JA2 and I loved it, this one is very close to the original, with a some cool new developments. Fans of JA2 will feel instantly at home. I finished the game twice on different difficulties. I am big fan of turn based strategies and this one is a very good one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have played for a sufficient amount of time. JA3 is an improvement on the series. I loved all three versions of the game even JA2 that gets dinged somewhat. JA3 has great challenging game play. Would say JA3 is the king of the top down tactical shooters. Great excitement and involvement. One of the things that make the JA series great was the amount of different and amount of guns in the game. You can develop strategies around them. I can turn buildings and homes into structures of death with melee weapons, shotguns and sub machine guns. Love it. Excellent system of game play.\n\nWhere would I like to see the game or another game based on the same engine? I would like to see a space based RPG with character development where you create your own team. DLCs can be based on character or team level average.  One thing Wasteland 2 got really right.  There is just too many tactical shooter isometric games based on the present and past and the post apocalypse. With a space based RPG the number of weapons you could have would be infinite based upon a civilization technology level. The worlds would be infinite too.  Hostile environments like acidic atmospheres higher G environments where protective equipment is needed. Zero G combat. Power armor/semi-robotic armor. More graphic scenes of NPCs/hostiles being blown away with different weapons and the kind of damage they inflict. You would already have my money. Okay that's enough. Time to get back to playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it, wonderful game I even gave one copy to my friend and my brother, and they loved it too. While certainly not perfect as Jagged 2. The truth is Jagged 2 is rather dated, and while I would recomend it to almost anyone, I would also say it not for everyone who does not have a lot of patience. This on the other hand is more for todays audience, You can play together co-op and it has a lot of mods. The music is awesome, combat can be very engaging, and fun. My only real complaint is some of the balance, and that some features from the previous games had (Jagged 2) are missing, and some features can be a little wierd, but thats what mods are for. Still all in all I still love this game, had loads of fun playing with different friends. I hope they make another one and learn from this, while the misses were few, most of it was exellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jagged Alliance 3 had big shoes to fill an I think it did an excellent job. The game play was immersive with plenty of variety in mechanics to keep the game interesting from start to finish. The characters and mercs were excellent with good dialogue. \r\nIt did feel like the difficulty curve was a bit unbalanced. It was quite difficult early on for some time before becoming relatively easy. There could have been a better difficulty gradient. \r\nDefinitely glad I bought the game. The developer did a good job continuing the legacy of Jagged Alliance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10\nThe first part is somewhat of a challenge wrt making money, getting geared up, etc. Once this is over the game gets way too easy and once you control 50% of the map it gets boring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A worthy addition to the  series. My only criticism would be the game forcing the story to move on with time. The story is good with a couple of good twists. It does exactly what i was looking for by feeling like it should. I look forward to expansion packs and dlc. Its good to play through multiple times trying different things out trying to recruit new people in country or getting different outcomes to sidequests just to see what happens. To hit percentages would have been nice. Overall its a game that relies on you being into this sort of thing for atmosphere.  Its one of the best games that I have played since JA2 but  probably not fair to compare them. One improvement is the pacing is a bit quicker, which keeps you engaged. Removing the sleep mechanic was a good decision.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some stuff could be more polished but it's the only game I've found that scratches the XCOM itch for me. The strategic layer is actually deeper and more interesting even though XCOM is better in the tactical fights.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved the game. The characters and banter is so fun. Really enjoyed my 1st playthrough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well done, my friends and I were shocked by how great a game this was given how popular the game is (i.e. not very).  Great pacing, solid voice acting, tactically diverse combats and an ... acceptable level of writing.  Overall, great game, good buy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Every tile has something interesting on it. The game offers a variety of weapons from sniper rifles to mortars. Most fun I had in this game was when I had to defend a narrow pass against a huge army with my C-team made up of newbs with the worst equipment that I didn't ever considered using. Every one of those garbage mortar shells, gas grenades and molotov cocktails ended up being instrumental to the crushing defeat I delivered to the enemy. For the final battle, I had a whole squad just for launching mustard gas mortars at the enemy bunker while my A and B teams sniped anybody who tried to escape. It was completely overkill, and it was awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jagged Alliance 3 is a great successor to the series and an awesome turn-based tactical game. \n\nIt has a nice story with light-hearted dialogues and lots of humor, with tons of references to the old movies, music and culture in every aspect of the game. The writing in general is somewhat simple but surprisingly compelling and witty. While the game doesn't take itself too seriously, it manages to touch upon some serious topics like slavery or war crimes, but without being condescending or preaching to the player about any of that. Many quests (and the game itself too) have multiple endings, so that increases the replayability.\n\nMercenaries and the team building is a core aspect of the game and the series. The mercs' personalities are painted with just a few strokes and are usually built around some specific cliche, but they have enough uniqueness about them to feel different both in quest dialogues and gameplay mechanics. Different unique perks are way more useful in different situations - like Blood's hit & run throwing knives, or Vicki's repairable lockpick, or Livewire marking all enemies if you have scouted a sector... the list goes on. The only thing I really wished for is that they had more recorded lines for action replies or rehiring dialogues.\n\nThe gameplay itself is very good too. I loved exploring a giant map sector by sector, searching for neat little secrets and loot, trying different combat or stealth tactics, intercepting shipments, searching for treasures. The game has day/night cycle, somewhat destructible environments and a weather system that directly impacts the combat, plus the RNG in loot drops and even some quests adds even more to replayability value. Combat itself is awesome too and feels very old school. It's genuinely fun to experiment with guns and setups as you gain understanding of mechanics, efficiency and level up your mercs. The difficulty is flexible enough to even allow you to do things like solo melee ironman run while still remaining hard, challenging and fun.\n\nUnfortunately, no game is perfect and Jagged Alliance 3 comes with its own set of the little downsides I noticed:\n- In mid to end game you get flooded with items (even rare weapons) a bit too much.\n- A somewhat poor weapon balance. You will quickly figure out that shotguns, snipers and RPGs are mad OP in terms of ammo efficiency and damage per shot. Everything else is weaker, with maybe the exception of the Minimi. This somewhat sours the exploration value since most likely you'll just get your hands on a couple of Dragunovs at the beginning of the game. They will easily carry you through most of the game.\n- AI could have been better. Developers did a very respectable job as is, but player's pattern recognition still kicks in at some point and you start correctly predicting what the enemies will do in most fights.\n- Some mechanics in combat and quests are unclear and poorly explained so you're left with either googling or figuring it out on your own. I also wish vanilla UI had a hit chance percentage displayed or proper healthbar for the enemies. Active pause would also be a welcome addition.\n- General jankiness and some bugs.\n\nLuckily, the game supports mods (both Workshop and external), so most nitpicks above are very easily remedied. \n\nIn conclusion I can only say that I had lots and lots of fun with Jagged Alliance 3. Totally recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great despite a ton of mechanics that will piss you off. There is no auto-rehire for your mercs, you have to install mods for that. UI is not great, you have to install mods for that too. \n\nPerformance is unexpectedly poor especially when it rains. Honestly I don't know how the game manages to hog so much computational power. \"Modern gaming\", I suppose.\n\nPeople jokingly call this game Xcom Alliance 3 for a reason. High chance of hitting an enemy? How about missing two times in a row lol It is less noticeable on lower difficulties but on the highest one it's just pure RNG nightmare. Even with top notch mercs and great weapons you can still miss a lot. Not a fan of last difficulty at all.\n\nOne of the main pain in the ass gameplay mechanics is capturing and holding diamond mines. These are not infinite and the first 2-3 mines do not really give a lot of money when you have low loaylty/do not upgrade them. The first several months you are pretty strapped for cash, carefully balancing you funds. Without \"free\" IMP merc this alone makes the game insanely hard unless you know it really well. Good thing there are mods for that too!\n\nNow the good things, quests/side missions are fun. Most of them are short but hilarious with tons of references to other games, movies and pop culture. Mainstory/quest is also alright with \"unexpected\" turns of events which are pretty good for a game inspired by action movies of 80s.\n\nGunplay and tactical/build variety is pretty good. Some of your mercs' unique skills sometimes can mean the difference between victory and defeat or losing/saving some of your teammates. Barry is great. Hire Barry. Worship Barry.\n\nNewer players should be ready for extreme difficulty the first several fights (possibly more). Skills + upgraded guns + grenades + stealth kills make the game much easier but the problem here is how to get there. Your team should ALWAYS, and I mean ALWAYS, have Explosive specialist, Medic, Mechanic and good melee/ranged mercs, as support mercs do not have high combat skills at the beginning of the game. Do not bother training them until you control various chokepoints on the map and have already captured several diamond mines. Higher wisdom = your mercs train/learn faster. High leadership = good at training your mercs + some other bonues. Your \"free\" IMP merc should have both at 85.\n\nAll in all, the game takes some time getting used (10-15 hours?). Understanding of the mechanics helps a ton with not ripping your hair out due to \"unfair\" moments during the gameplay.\n\n8/10 from me, despite its many, flaws (which are, again, fixed by various mods).\n\nP.S.: Save a lot. There are a lot of unexpected events/missions and some of them can even softlock your team if it's weak enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Thank you, Haemimont! I'll never back in Arulco anymore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a great successor to first two games in the series, if you loved those, you will love this one.\r\nAnd generally great tactical combat game where many battle tactics can work.\r\nOk, i will admit that sneaking and killing half or all enemies before combat starts does tend to be most effective and ammo efficient, but that honestly kinda make sense :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked Jagged Alliance 1 or 2 and have been waiting for a sequel, THIS is the game you've been looking for!  Perhaps a little easier than the original game, this has the same feeling as the original ones with some slight tweaks to make it a bit more in line with a modern experience.\r\nI've been thoroughly enjoying my time in Grand Chien (big dog), and overall this game is hitting all of the right notes for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "computer ai is a little bit dumb. but some good new additions to the game. especially combat. but story can we worked on. also the icons and drawings of ammo and weapons should be a little bit discriminatory and easy for the eye. and no bartering selling weapons options is not good at the beginning when you need money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the original and JA2 immensely.  I discovered JA3 (poorly marketed) and honestly, I think it's the best yet.  Fantastic game, one of the only turn-based strategy games I play and I'm glad I gave JA3 a chance.  I just wish there were some DLC's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its been a long time since ive played something this fresh. The combat is a weird mix of TBS and old school jagged alliance. 9.5/10 for some reason the night vision goggles dont work. I tried the mod to fix it but they still dont. just needs a little more polish and it would be perfect. Gotta look into mods  still though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun and faithful update of a classic game. If you enjoyed the original games like I did you will enjoy this sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A surprisingly complete tactics experience\r\n\r\nPlaying co-op — and honestly, this game feels incredibly solid. It’s a full experience, not a half-baked tactics title. There’s a ton of mercs, each one genuinely unique, with distinct personalities and even some surprisingly juicy humor.\r\n\r\nAt one point I tried to move a teddy bear from Larry’s backpack, and he snapped back: “Don’t touch it — that’s my financial advisor.” Moments like that make the game shine.\r\n\r\nDialogues with NPCs are short, concentrated, and the characters themselves are strange in the best possible way — they stick in your memory.\r\n\r\nWe’ve had a few minor desync issues in co-op, but nothing game-breaking. Overall, it’s been a great time — fun, tactical, and full of personality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're into turn based strategy then I  think  this game is  a must.  I'm new to the JA series, but have already LOVED so much about this  game. I love  the \"out of  combat\" mechanics,  managing  finances, resources, up skilling, upgrading, training, healing etc. They give you plenty to think about and so  many ways to adjust your characters based on your  own  style  of play. If you enjoy games  like Xcom, The last Train Home etc then I think this is a MUST PLAY game. PS - the characters and storyline is very fun and many \"AHH NUTS\" moments from it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great 2p co-op turn-based tactical game! Like the humor in it as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game seems ok has workshop content also. combat is kinda meh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the mechanic and versatility of the game play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent turn-based tactics game with a fun campaign layer as the structure for extremely tight tactical battles. There are at least a dozen different potential ending outcomes depending on the choices you make (or miss) across the campaign.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it better than JA2? Maybe not. But i will say it is very clear that the people who made JA3 clearly put a lot of passion and love into the project. \r\nI added a few quality of life mods and i will start my 4th playthrough after already putting more than 400 hours in. \r\nIt has a lot of connections to the mercs from the second installment and a lot of easter eggs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In summary, while it is obviously a tactical combat game, there is both a strategic layer and some RPG elements.  For strategy, you decide in what order to explore the map, your squads, and you must manage your teams' resources.  On the RPG side, there are story choices and you also should create your own customized character at the start (that one cost zero and it is a missable option under the IMP tab. You can add a different portrait with mods). \n\nIn terms of fun and gameplay, I did very much enjoy most of it and it has plenty of tactical depth (it is not just move and attack).  I did hit a discouraging moment when I accidentally triggered an event that changes the map and also makes the game harder.  There is no warning for the player, which feels like a design flaw in my opinion.  In fact, I even wondered if I should continue playing (after over 60 hours!), but I loaded a save not long before to avoid that event and so I could continue doing quests and preparing better for the next phase of the story. \n\nBe advised that this game takes *much* longer to finish than you can imagine at first sight.  If you lack time, there are \"short cuts\" to avoid many fights and quests. \n\n\nPROS \n* Enough tactical depth : there are many options in combat, such as your stance, many choices of weapons, different types of shots, ammo, skills, etc.  The game challenges you with some tough fights where being tactical feels very rewarding. \n\n* The game design is flexible in the sense that the player has many ways of managing their team (you can choose to play as little as one single merc up to 18+ mercs), paths you take on the map, various tactics, etc.  For example, I found it more fun to hire level 1 mercenaries that have personalites I like (there are many, and some annoy me) and to keep them a long time, training them, as if I was playing a party in a cRPG.  But you could hire higher level mercenaries later and that is just one example of the variations in how to play. \n\n* AI is decent : wounded enemies will sometimes do evasive moves ; enemies who take fire can sometimes be cautious rather than just charge you, enemies can try to flank, etc.  It encourages the player to be cautious and tactical, and it pays off to be.  Nuance: some enemies just charge because they are stronger at close range.  Also, the AI is sometimes terrible when it does not see their enemy. \n\n* Stealth is a bit more realistic than in many games, meaning it is not easy.  The enemy can easily see you and you have a short time to act ... (you are not just invisible).  They added a pause button in the game (in the settings), so no worries. \n\n* The humor does not go too far and remains in good taste.  They managed to poke fun at various concepts without being distasteful nor sounding political. \n\n\nCONS \n- It is really too long.  The number of fights is really surprising.  There is one quest, for example, where I swear I had to go through 10+ battles.  Technically, it is possible to skip many areas on the map and go directly for certain bosses, making the game much shorter.  I am a completionist though and cleared everything: all quests and areas, but that took me over 175 hours!  Most players report finishing in around 60 to 80 hours. \n\n- The time management is sometimes annoying in my opinion (resting, healing, repairing, etc.), but is not too hard if you are cautious with time spent (money is an issue only at first, but managing the various tasks can get annoying). \n\n- Some (few) enemies take many bullets to drop, even on the normal difficulty, which reduces the tactical feeling.  I recommend turning on the Heavy Wounds option (off by default unless you start with hard difficulty) because that way units with Wounds at least have some penalty! \n\nWarning : need I say it is not an easy game.  Sometimes you will feel overpowered, but the game will throw a few punches your way.  I have played tons of games (I am old) and usually select a bit above normal difficulties.  Here, I played the first difficulty.  Though I did also turn on the Heavy Wounds option (it affects your own units, but I wanted my enemies to be more affected by hits).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I did not play JA and JA2 back in times, but I really liked JA3. The game makes a good story with very enjoyable turn-based fight, which sometimes makes you do several reloads before you figure out the right strategy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big fan of JA2, played several rival games later, but that was not it. This game is maybe not as great as JA2, but it's almost there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's kinda unintuitive, buggy at times and some of the voice lines will drive you to anger from hearing them repeated 10 times every combat encounter (Livewire please stfu I'm begging you), but it actually wasn't that bad. A decent tactical game, with a fun 80's style. I'd recommend if you're after something to scratch that tactical itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games out there. Seriously very good games with hours of play. Found this and got on sale, was very surprised how good it is, wish they made another one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was so much fun. The writing and jokes, perfect. More than comes through for those of us that came from JA2 back in the day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, and even better with mods!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soundtrack alone is 10/10. Voice lines add another 10 points. Whatever gameplay adds on top is a bonus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game for turned based tactics fans! With awesome characters and great humor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable game of tactics, murky motivations and African tropes. You have mercenaries to hire, an African president to save with blood diamonds your income. You start with limited funds and as the game develops you improve your income, which opens more experienced and deadly mercs for hire. Each merc is a character stereotype, with funny comments and interactions on their respective missions. I really enjoyed this aspect of the game, humour playing a large part in keeping the narrative going and gameplay interesting. I played a couple of times through to the end and can confirm different priorities and sequence will provide different outcomes and endgame – full marks. Any fan of the turn-based genre will enjoy this romp.\r\nWhat’s to like: Humour. Witty one-liners during battles. Varied maps and locations, the graphics for gameplay are very polished. A nice progression arc with merc training and better guns the way you develop. Includes a tactical layer where decisions on where next, in what order and what best use of resources. Limited parts are available for general repair or upgrades.  \r\nWhat’s not quite right: Mercenaries can only be hired for a set duration and must be re-hired. During the middle to end part of the game this constraint became quite tedious with no automatic rollover available.  There were a couple of skill spikes, completely disguised, upon making wrong decision or being too aggressive too early can lead to your squad being wiped out.\r\nWorth a Play: Absolutely.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Might be a fun game if you played JA1 & JA2 and knew what was going on. Otherwise it's just a poorly designed mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies which can see you when you are literally behind walls and turned to you by his back IS NOT OKAY MECHANIC. \nWhy should I use \"stealth\" (haha) when everyone can see me for half a map even i would burrow ten meters under dirt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good in general but not perfect. Things look blurry in the distance, maybe it's just a depth of field effect.\n\nUI is usable but still not good or intuitive enough. This was the problem with JA2 as well in the beginning, but once you learnt the logic behind the UI of JA2 it's weird to get use to the new JA3 UI. I kept looking for the familiar menu lists on right click.\nIn some ways it's better but in other ways it's worse. \nI did prefer JA2 UI and systems overall. The simple branching menu lists did allow for faster management of training and other tasks of my mercs.\nAnother problem with the game is that your weapons are not visible on the bottom of the screen. JA2 was not just about the mercs but about the weapons. The devs should have learnt from the 1.13 patch and put more focus on gear and weapons. We love weapons. The player always have to see the weapon on the UI like in JA2 or in Fallout 2. \n\nThe weapons also have to feel different and fulfill a specific role which they try to do but doesn't really work in JA3. I can tell that whomever did the weapons does not know shit about guns. \nThere is basically no point in using anything but the high damage rifles in this game.\nWeapon damage numbers are all over the place! \nDamage should be more dependent on the bullets used but in this game a 9mm Browning Hi-power does more damage than a .44 magnum Colt Pacemaker or a 5.56 Famas! How exactly is this possible?\nDamage equals velocity x mass! Of course bullet shape(armor piercing, hollow point) matters, just like body armor, and the amonut of gunpowder behind the projectile but for a start it would have been great to take at least the caliber into account when calculating damage and penetration, meaning a smaller bullet = less damage and bigger bullet= more damage. A bigger, faster bullet will transfer more energy to you body, therefore will do more damage! Common sense. But in this game there have been no common sense applied. You should have built and balance your game around the guns but what they did is they tried to build and balance the guns around everything else. It's extremely annoying and made me quit several times since certain playstyles that worked in JA2 do not work here. Assault rifles for example feel useless peashooters while in reality they should be dominating they battlefield. Especially in mid range combat. I don't think I will ever finish the game.\nI do not want to play it because it stupid and annoying, instead of plesant and satisfying.\nWhere are the good Ideas from JA2? Shooting people on the leg make them fall and loose a turn has a real strategic value! Same as shooting them on the arm and making their gun drop. But in this game it's just percentages.\nGames like this also need a killcam or some way to bring the action closer to the player as one of the most important and satisfying thing in a combat game is when you defeat the enemies!\nJA2 had at least one limited but satisfying animation. I would like something like in fallout2 where enemies had multiple cool death animations. Guys literally sliced in half by your laser guns and slowly fell apart like in some cool action movie! But in this game the enemy deaths are quite casual. They just fall over and that's it. Sometimes their head explodes if you apply enough damage which you can't really see because they are far away, the graphics are a bit blurry and the camera changes back in a second.\n\nNice maps, art, models, enviroment and\nsounds, including the music. They usually fit the game and the setting\nSlight improvement on the characters and character interactions.\n In JA2 we already had a system for this but was very limited. Your mercs had a line or two to say and that's it.\n They somewhat improved upon this by making your mercs talk a bit more, during NPC interactions for example or they do chat with each other a bit, but it's sill limited to few sentences at most. You going to hear the same lines repeated for the rest of your playtrough. \nThey tried to give mercs some more personality in which they both succeeded and failed at the same time.\nSome of the mercs have changed, some of them for the better some of them for the worse. Some of them are really annoying, so this is a mixed bag and not the expected amazing improvement I've been waiting for.\nMercs were always an important part of JA but they shouldn't be the main focus to the detriment of other parts of the game, which is seem to be the case here.\n\nOverall not a bad try but not nearly good enough to dethrone JA2 1.13 and I don't really understand the very positive reviews. I guess people are starved for a half decent game after the metric shit ton of AAA failures and AI generated slop vomited in their general direction now days. But I personally think it does not worth full price. I bought it 90% off and I still have regrets.\n\nTo any future developer: MAKE JA2 1.13! But in a modern coat with mod support! That's the game we are waiting for for decades. You will make bank! You think it's not going to do well because it's too difficult and complex but the most complex and difficult games are the most successful ones. \n People love depth. People love a challenge. People love the tacticool.\nDark Souls, ARMA, complex, difficult games that are highly successful. Dayz, Escape from Tarkov etc...\nWe want cool action heroes, tons of guns and attachments, LBE, gear management, merc management, upgrades, strategical depth, tactical depth.\n It's hard to make a good game. It's even harder to make a good Jagged Alliance game. There have been many tries over the years and none of them were a real successor to JA2. Sadly, this one is not an exception either.\nA decent game yeah, maybe. \nBut not a truly good JA game I have been waiting for for decades!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game loves to take control away from you and limit your dialogue options to what the leftie communist developers saw as appropriate.\n\nThe music was great.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terrible tacticool game.  ALL of the playable characters are silly and akward over characterization of lame 80s characters..  A dumb feature that some characters cant work with eachother.  Running around with farmer weapons but the badguys have fully automatic weapons that were obviously supplied by the US arms dealership company.   Can't create your own character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn’t bad, but it’s not good either. I’ve spent countless hours playing Jagged Alliance 2 since its release—it’s one of my all-time favorite games. And the whole time I was playing the third installment, I kept thinking that I was wasting my time and would rather be playing JA2.\n\nRight from the start, I didn’t like the combat system in the new game. It tries to mimic XCOM, but completely changes the formula. In XCOM, you could win a fight without the enemy ever getting a shot. Here, the gameplay revolves around overwatch and stacking negative status effects. At the start, your mercs are weak and their weapons are terrible, so there’s no point in shooting for the center of the mass—the damage is just pathetic. The only real option is to aim for the limbs or try to land a headshot. And the whole combat system just feels \"gamey\", every encounter is like a puzzle. I'm just not a fan of that kind of gameplay. Of course, that only applies if you don’t clear out the entire location with stealth snipers. In that case, the fight might not even happen at all.\n\nThe difficulty curve is also a mess. Early on, even the starting island is tough until you figure out how the game works and find some proper guns. But once you do, it becomes way too easy—because you realize that out of all the classes, the stealth sniper and LMG support are the only one that really matters. From that point on, the game turns into a repetitive grind. By hour 30, I was climbing the walls from boredom. I ended up downloading a cheat mod just to finish the game faster.\n\nI started on the easiest difficulty with the forgiving mode just to get a feel for the mechanics, and even then, I had to restart several times just to build a decent squad. In JA2, you could hire a couple of expensive mercs and clear the early sectors. In this game, you’re forced to recruit a team of specialists because the devs decided they were making a CRPG now. They added skill checks in dialogues that can affect quest outcomes. And the quests themselves? Boring. I started skipping them almost immediately. If I wanted to read walls of text and do side quests, I’d play Baldur’s Gate.\nThen there’s the devs’ obsession with turning the game into a parody of action movies. Like I said, the dialogue is bad and not funny, and on top of that, there are endless pop culture references. JA2 had humor too, but it was never the centerpiece. By hour 30, I just gave up on the side quests. There are way too many of them, they’re not interesting, and tracking them with that horrendous UI is a pain.\n\nI also hated having to run around every location just to find some hidden stash or a bush with healing herbs. It would’ve been great if every item in a sector—no exceptions—was accessible directly from the stash on the map. That way, I wouldn’t have to waste time searching locations. But you have to do it—because remember it's a CRPG and you need to talk to NPCs to get new quests, and sometimes you can find good weapons that you can't buy.\nI know that in Jagged Alliance 2, items inside containers didn’t show up in the sector stash either—and I already disliked that back then. But at least in JA2, all you had to do was loot the chests. Here, they’ve added intel gathering, collecting medicinal herbs, and scavenging scrap for crafting on top of that. \nAs for Bobby Ray’s shop, which was added in patch 1.3.0—it’s a complete joke. The selection is always painfully limited, and there’s no way to expand the inventory through settings. It feels like a half-baked feature that doesn’t even try to be useful.\n\nThe interface is clunky—I had tons of moments where I clicked the wrong thing or didn't see the cover type behind the projection of the merk. I guess that’s the price of adapting the game for gamepads. The game is also full of junk that clutters your inventory—lenses, chips, tubes, all supposedly needed for weapon modding. Then there are random artifacts you have to turn in to a specific NPC, piles of different jewels, diamonds, and a bag of coins, which I never figured out the purpose of. It’s just unnecessary clutter.\nWeapon mods should be standalone items that can be equipped and removed. And all the useless junk should automatically convert into money. There’s no reason to force players to micromanage that stuff, and running around collecting trash gets old really fast.\n\nSome decisions the devs made are really questionable. They kept some of the outdated mechanics from the original—like the lack of hit chance and looting (and added more of that)—but removed features that actually worked well, like the simple aiming mode and proper weapon modifications. In other words, they scrapped what was functional and kept what feels obsolete by modern standards.\n\nThe maps are really small, maybe that’s why the devs removed hit chance percentages—because it looks ridiculous when a merc can’t hit an enemy standing two meters away.\nI constantly felt like there weren’t enough cover options. In XCOM, I can plan a route that lets me consistently move from cover to cover. In this game, I often didn’t have enough action points to reach the next safe spot. The maps may look pretty, sure—but they’re not functional, and all that visual noise ends up straining my eyes.\n\nThe only thing I genuinely liked was the music. \n\n[i]I actually had more fun playing Brigade E5, which was originally developed as the true third installment of the series.[/i]",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Warning to new potential buyers!\n\nThis game is abandoned by the developers and the multiplayer servers do not function properly anymore.\n\nFor days and weeks randomly, you will not be able to play multiplayer coop at all since their login servers turn off/crash and nobody responds.\n\nDon't lose your money to yet another THQ Nordic abandonware.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is based on my second playthrough (it's still ongoing), using mods to improve the gameplay and some UI. The first gameplay just failed in very early stage when I couldn't figure out the game mechanics and lost too much (awful tutorials).\n\nPositive:\n1. Maps areas look great and well done.\n2. Few cool characters and merch’s + missions.\n3. Some very interesting situations that change your game tactics.\n4. Mods! Mods! Mods!\n5. Music is good.\n\nNegative:\n1. Some of the game mechanics are just awfully bad!! E.g. UI ammo and stuff management, only mercs (not even mech militia can do, why?) can fix or edit weapons, communications or selecting stuff from the ground does not always work etc. The list is long. \n2. AI is extremely bad, especially the hired militia AI. You cannot let AI take care of or support you in areas as they will always die and lose, whatever their skillset or strong gears are. You must manually ALWAYS resolve yourself, even when you have the elite militia - weak enemy AI just kills your elite dudes. \n3. Enemy AI is always stronger and has stronger buffs. They can act before you can ambush, sneak or shoot, just awful mechanics. \n4. Sneaking is basically useless. No tactics can be applied. \n5. Detection range or enemy vision field missing, why the god’s sake?!?\n6. WHY THE f. sake it needs to have deployment areas fixed???!!! It makes the tactics or gameplay so boringly repetitive, especially when you are defending same areas from spamming raids. \n7. Very few different AI characters with weapons. Boring and repetitive.\n8. Very boring story and most of the characters. Some awful merch voices and characters.\n9. Overwatch is totally useless, especially for militia. Shittiest shot by default, when you have max AP's?? Really?? :D\n10. For the f. sake, why changing armors do not alter troops visually? Cheap execution.\n11. Boring and difficult crafting mechanism. \n12. New game option that does not give any hint of what it does or effects!!!\n13. Locked views and movement when AI act, WHY??? It causes time to time to lose sight of what exactly is happening or did someone get hit, e.g.\n14. I still do not understand some of the mechanics...\n..... and so on and so on.\n\nWhat a letdown. I had so much hope for this game and to be one of the best out there. JA2 was special, this just isn't. It's not worth the full money, buy only when there are huge sales. Only mods will keep this game alive. Sad :(\n\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have an RTX5090 and the game crashes and locks up my machine every few hours of play.  The game will completely lock up my machine and I have to do a full shutdown and restart.  Many people online are reporting the same system crashes from this game and no other games I play do this on my system.  Don't buy this game unless you like system crashes!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is interesting ....when it runs, after 1 hour of game play I am facing constant CTD, I downloaded 2 mods and I thought this might be the reason, alas Reinstalling the game and deleting the mods did nothing, its simply is a sloppy made game, I had to restart couintless times and I am simply getting tired of it, a real shame to a great legacy. I understand THQ Nordic is just the publisher but I hear they are in discussion with Hasbro about making BG4. I really hope they don't, they will destroy a great franchise if they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be a fun game if you played JA1 & JA2 and knew what was going on. Otherwise it's just a poorly designed mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies which can see you when you are literally behind walls and turned to you by his back IS NOT OKAY MECHANIC. \nWhy should I use \"stealth\" (haha) when everyone can see me for half a map even i would burrow ten meters under dirt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good in general but not perfect. Things look blurry in the distance, maybe it's just a depth of field effect.\n\nUI is usable but still not good or intuitive enough. This was the problem with JA2 as well in the beginning, but once you learnt the logic behind the UI of JA2 it's weird to get use to the new JA3 UI. I kept looking for the familiar menu lists on right click.\nIn some ways it's better but in other ways it's worse. \nI did prefer JA2 UI and systems overall. The simple branching menu lists did allow for faster management of training and other tasks of my mercs.\nAnother problem with the game is that your weapons are not visible on the bottom of the screen. JA2 was not just about the mercs but about the weapons. The devs should have learnt from the 1.13 patch and put more focus on gear and weapons. We love weapons. The player always have to see the weapon on the UI like in JA2 or in Fallout 2. \n\nThe weapons also have to feel different and fulfill a specific role which they try to do but doesn't really work in JA3. I can tell that whomever did the weapons does not know shit about guns. \nThere is basically no point in using anything but the high damage rifles in this game.\nWeapon damage numbers are all over the place! \nDamage should be more dependent on the bullets used but in this game a 9mm Browning Hi-power does more damage than a .44 magnum Colt Pacemaker or a 5.56 Famas! How exactly is this possible?\nDamage equals velocity x mass! Of course bullet shape(armor piercing, hollow point) matters, just like body armor, and the amonut of gunpowder behind the projectile but for a start it would have been great to take at least the caliber into account when calculating damage and penetration, meaning a smaller bullet = less damage and bigger bullet= more damage. A bigger, faster bullet will transfer more energy to you body, therefore will do more damage! Common sense. But in this game there have been no common sense applied. You should have built and balance your game around the guns but what they did is they tried to build and balance the guns around everything else. It's extremely annoying and made me quit several times since certain playstyles that worked in JA2 do not work here. Assault rifles for example feel useless peashooters while in reality they should be dominating they battlefield. Especially in mid range combat. I don't think I will ever finish the game.\nI do not want to play it because it stupid and annoying, instead of plesant and satisfying.\nWhere are the good Ideas from JA2? Shooting people on the leg make them fall and loose a turn has a real strategic value! Same as shooting them on the arm and making their gun drop. But in this game it's just percentages.\nGames like this also need a killcam or some way to bring the action closer to the player as one of the most important and satisfying thing in a combat game is when you defeat the enemies!\nJA2 had at least one limited but satisfying animation. I would like something like in fallout2 where enemies had multiple cool death animations. Guys literally sliced in half by your laser guns and slowly fell apart like in some cool action movie! But in this game the enemy deaths are quite casual. They just fall over and that's it. Sometimes their head explodes if you apply enough damage which you can't really see because they are far away, the graphics are a bit blurry and the camera changes back in a second.\n\nNice maps, art, models, enviroment and\nsounds, including the music. They usually fit the game and the setting\nSlight improvement on the characters and character interactions.\n In JA2 we already had a system for this but was very limited. Your mercs had a line or two to say and that's it.\n They somewhat improved upon this by making your mercs talk a bit more, during NPC interactions for example or they do chat with each other a bit, but it's sill limited to few sentences at most. You going to hear the same lines repeated for the rest of your playtrough. \nThey tried to give mercs some more personality in which they both succeeded and failed at the same time.\nSome of the mercs have changed, some of them for the better some of them for the worse. Some of them are really annoying, so this is a mixed bag and not the expected amazing improvement I've been waiting for.\nMercs were always an important part of JA but they shouldn't be the main focus to the detriment of other parts of the game, which is seem to be the case here.\n\nOverall not a bad try but not nearly good enough to dethrone JA2 1.13 and I don't really understand the very positive reviews. I guess people are starved for a half decent game after the metric shit ton of AAA failures and AI generated slop vomited in their general direction now days. But I personally think it does not worth full price. I bought it 90% off and I still have regrets.\n\nTo any future developer: MAKE JA2 1.13! But in a modern coat with mod support! That's the game we are waiting for for decades. You will make bank! You think it's not going to do well because it's too difficult and complex but the most complex and difficult games are the most successful ones. \n People love depth. People love a challenge. People love the tacticool.\nDark Souls, ARMA, complex, difficult games that are highly successful. Dayz, Escape from Tarkov etc...\nWe want cool action heroes, tons of guns and attachments, LBE, gear management, merc management, upgrades, strategical depth, tactical depth.\n It's hard to make a good game. It's even harder to make a good Jagged Alliance game. There have been many tries over the years and none of them were a real successor to JA2. Sadly, this one is not an exception either.\nA decent game yeah, maybe. \nBut not a truly good JA game I have been waiting for for decades!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game loves to take control away from you and limit your dialogue options to what the leftie communist developers saw as appropriate.\n\nThe music was great.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "absolute trash, trained mercenaries that can't hit a target in MELEE combat, from BEHIND, with the ennemy OBLIVIOUS. Guns ? 3 meters and you will somehow fucking miss. \r\n\r\nWhat the fuck is this shit ? make sense how this game costed like 3€ on instant gaming, no fucking shit. Play Wasteland 3 or litterally any other game, this shit sucks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terrible tacticool game.  ALL of the playable characters are silly and akward over characterization of lame 80s characters..  A dumb feature that some characters cant work with eachother.  Running around with farmer weapons but the badguys have fully automatic weapons that were obviously supplied by the US arms dealership company.   Can't create your own character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An unbalanced mess that i tried to enjoy. All i came away with is a migraine and hours of wasted time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game isn’t bad, but it’s not good either. I’ve spent countless hours playing Jagged Alliance 2 since its release—it’s one of my all-time favorite games. And the whole time I was playing the third installment, I kept thinking that I was wasting my time and would rather be playing JA2.\n\nRight from the start, I didn’t like the combat system in the new game. It tries to mimic XCOM, but completely changes the formula. In XCOM, you could win a fight without the enemy ever getting a shot. Here, the gameplay revolves around overwatch and stacking negative status effects. At the start, your mercs are weak and their weapons are terrible, so there’s no point in shooting for the center of the mass—the damage is just pathetic. The only real option is to aim for the limbs or try to land a headshot. And the whole combat system just feels \"gamey\", every encounter is like a puzzle. I'm just not a fan of that kind of gameplay. Of course, that only applies if you don’t clear out the entire location with stealth snipers. In that case, the fight might not even happen at all.\n\nThe difficulty curve is also a mess. Early on, even the starting island is tough until you figure out how the game works and find some proper guns. But once you do, it becomes way too easy—because you realize that out of all the classes, the stealth sniper and LMG support are the only one that really matters. From that point on, the game turns into a repetitive grind. By hour 30, I was climbing the walls from boredom. I ended up downloading a cheat mod just to finish the game faster.\n\nI started on the easiest difficulty with the forgiving mode just to get a feel for the mechanics, and even then, I had to restart several times just to build a decent squad. In JA2, you could hire a couple of expensive mercs and clear the early sectors. In this game, you’re forced to recruit a team of specialists because the devs decided they were making a CRPG now. They added skill checks in dialogues that can affect quest outcomes. And the quests themselves? Boring. I started skipping them almost immediately. If I wanted to read walls of text and do side quests, I’d play Baldur’s Gate.\nThen there’s the devs’ obsession with turning the game into a parody of action movies. Like I said, the dialogue is bad and not funny, and on top of that, there are endless pop culture references. JA2 had humor too, but it was never the centerpiece. By hour 30, I just gave up on the side quests. There are way too many of them, they’re not interesting, and tracking them with that horrendous UI is a pain.\n\nI also hated having to run around every location just to find some hidden stash or a bush with healing herbs. It would’ve been great if every item in a sector—no exceptions—was accessible directly from the stash on the map. That way, I wouldn’t have to waste time searching locations. But you have to do it—because remember it's a CRPG and you need to talk to NPCs to get new quests, and sometimes you can find good weapons that you can't buy.\nI know that in Jagged Alliance 2, items inside containers didn’t show up in the sector stash either—and I already disliked that back then. But at least in JA2, all you had to do was loot the chests. Here, they’ve added intel gathering, collecting medicinal herbs, and scavenging scrap for crafting on top of that. \nAs for Bobby Ray’s shop, which was added in patch 1.3.0—it’s a complete joke. The selection is always painfully limited, and there’s no way to expand the inventory through settings. It feels like a half-baked feature that doesn’t even try to be useful.\n\nThe interface is clunky—I had tons of moments where I clicked the wrong thing or didn't see the cover type behind the projection of the merk. I guess that’s the price of adapting the game for gamepads. The game is also full of junk that clutters your inventory—lenses, chips, tubes, all supposedly needed for weapon modding. Then there are random artifacts you have to turn in to a specific NPC, piles of different jewels, diamonds, and a bag of coins, which I never figured out the purpose of. It’s just unnecessary clutter.\nWeapon mods should be standalone items that can be equipped and removed. And all the useless junk should automatically convert into money. There’s no reason to force players to micromanage that stuff, and running around collecting trash gets old really fast.\n\nSome decisions the devs made are really questionable. They kept some of the outdated mechanics from the original—like the lack of hit chance and looting (and added more of that)—but removed features that actually worked well, like the simple aiming mode and proper weapon modifications. In other words, they scrapped what was functional and kept what feels obsolete by modern standards.\n\nThe maps are really small, maybe that’s why the devs removed hit chance percentages—because it looks ridiculous when a merc can’t hit an enemy standing two meters away.\nI constantly felt like there weren’t enough cover options. In XCOM, I can plan a route that lets me consistently move from cover to cover. In this game, I often didn’t have enough action points to reach the next safe spot. The maps may look pretty, sure—but they’re not functional, and all that visual noise ends up straining my eyes.\n\nThe only thing I genuinely liked was the music. \n\n[i]I actually had more fun playing Brigade E5, which was originally developed as the true third installment of the series.[/i]",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Warning to new potential buyers!\n\nThis game is abandoned by the developers and the multiplayer servers do not function properly anymore.\n\nFor days and weeks randomly, you will not be able to play multiplayer coop at all since their login servers turn off/crash and nobody responds.\n\nDon't lose your money to yet another THQ Nordic abandonware.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is based on my second playthrough (it's still ongoing), using mods to improve the gameplay and some UI. The first gameplay just failed in very early stage when I couldn't figure out the game mechanics and lost too much (awful tutorials).\n\nPositive:\n1. Maps areas look great and well done.\n2. Few cool characters and merch’s + missions.\n3. Some very interesting situations that change your game tactics.\n4. Mods! Mods! Mods!\n5. Music is good.\n\nNegative:\n1. Some of the game mechanics are just awfully bad!! E.g. UI ammo and stuff management, only mercs (not even mech militia can do, why?) can fix or edit weapons, communications or selecting stuff from the ground does not always work etc. The list is long. \n2. AI is extremely bad, especially the hired militia AI. You cannot let AI take care of or support you in areas as they will always die and lose, whatever their skillset or strong gears are. You must manually ALWAYS resolve yourself, even when you have the elite militia - weak enemy AI just kills your elite dudes. \n3. Enemy AI is always stronger and has stronger buffs. They can act before you can ambush, sneak or shoot, just awful mechanics. \n4. Sneaking is basically useless. No tactics can be applied. \n5. Detection range or enemy vision field missing, why the god’s sake?!?\n6. WHY THE f. sake it needs to have deployment areas fixed???!!! It makes the tactics or gameplay so boringly repetitive, especially when you are defending same areas from spamming raids. \n7. Very few different AI characters with weapons. Boring and repetitive.\n8. Very boring story and most of the characters. Some awful merch voices and characters.\n9. Overwatch is totally useless, especially for militia. Shittiest shot by default, when you have max AP's?? Really?? :D\n10. For the f. sake, why changing armors do not alter troops visually? Cheap execution.\n11. Boring and difficult crafting mechanism. \n12. New game option that does not give any hint of what it does or effects!!!\n13. Locked views and movement when AI act, WHY??? It causes time to time to lose sight of what exactly is happening or did someone get hit, e.g.\n14. I still do not understand some of the mechanics...\n..... and so on and so on.\n\nWhat a letdown. I had so much hope for this game and to be one of the best out there. JA2 was special, this just isn't. It's not worth the full money, buy only when there are huge sales. Only mods will keep this game alive. Sad :(\n\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have an RTX5090 and the game crashes and locks up my machine every few hours of play.  The game will completely lock up my machine and I have to do a full shutdown and restart.  Many people online are reporting the same system crashes from this game and no other games I play do this on my system.  Don't buy this game unless you like system crashes!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is interesting ....when it runs, after 1 hour of game play I am facing constant CTD, I downloaded 2 mods and I thought this might be the reason, alas Reinstalling the game and deleting the mods did nothing, its simply is a sloppy made game, I had to restart couintless times and I am simply getting tired of it, a real shame to a great legacy. I understand THQ Nordic is just the publisher but I hear they are in discussion with Hasbro about making BG4. I really hope they don't, they will destroy a great franchise if they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be a fun game if you played JA1 & JA2 and knew what was going on. Otherwise it's just a poorly designed mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies which can see you when you are literally behind walls and turned to you by his back IS NOT OKAY MECHANIC. \nWhy should I use \"stealth\" (haha) when everyone can see me for half a map even i would burrow ten meters under dirt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good in general but not perfect. Things look blurry in the distance, maybe it's just a depth of field effect.\n\nUI is usable but still not good or intuitive enough. This was the problem with JA2 as well in the beginning, but once you learnt the logic behind the UI of JA2 it's weird to get use to the new JA3 UI. I kept looking for the familiar menu lists on right click.\nIn some ways it's better but in other ways it's worse. \nI did prefer JA2 UI and systems overall. The simple branching menu lists did allow for faster management of training and other tasks of my mercs.\nAnother problem with the game is that your weapons are not visible on the bottom of the screen. JA2 was not just about the mercs but about the weapons. The devs should have learnt from the 1.13 patch and put more focus on gear and weapons. We love weapons. The player always have to see the weapon on the UI like in JA2 or in Fallout 2. \n\nThe weapons also have to feel different and fulfill a specific role which they try to do but doesn't really work in JA3. I can tell that whomever did the weapons does not know shit about guns. \nThere is basically no point in using anything but the high damage rifles in this game.\nWeapon damage numbers are all over the place! \nDamage should be more dependent on the bullets used but in this game a 9mm Browning Hi-power does more damage than a .44 magnum Colt Pacemaker or a 5.56 Famas! How exactly is this possible?\nDamage equals velocity x mass! Of course bullet shape(armor piercing, hollow point) matters, just like body armor, and the amonut of gunpowder behind the projectile but for a start it would have been great to take at least the caliber into account when calculating damage and penetration, meaning a smaller bullet = less damage and bigger bullet= more damage. A bigger, faster bullet will transfer more energy to you body, therefore will do more damage! Common sense. But in this game there have been no common sense applied. You should have built and balance your game around the guns but what they did is they tried to build and balance the guns around everything else. It's extremely annoying and made me quit several times since certain playstyles that worked in JA2 do not work here. Assault rifles for example feel useless peashooters while in reality they should be dominating they battlefield. Especially in mid range combat. I don't think I will ever finish the game.\nI do not want to play it because it stupid and annoying, instead of plesant and satisfying.\nWhere are the good Ideas from JA2? Shooting people on the leg make them fall and loose a turn has a real strategic value! Same as shooting them on the arm and making their gun drop. But in this game it's just percentages.\nGames like this also need a killcam or some way to bring the action closer to the player as one of the most important and satisfying thing in a combat game is when you defeat the enemies!\nJA2 had at least one limited but satisfying animation. I would like something like in fallout2 where enemies had multiple cool death animations. Guys literally sliced in half by your laser guns and slowly fell apart like in some cool action movie! But in this game the enemy deaths are quite casual. They just fall over and that's it. Sometimes their head explodes if you apply enough damage which you can't really see because they are far away, the graphics are a bit blurry and the camera changes back in a second.\n\nNice maps, art, models, enviroment and\nsounds, including the music. They usually fit the game and the setting\nSlight improvement on the characters and character interactions.\n In JA2 we already had a system for this but was very limited. Your mercs had a line or two to say and that's it.\n They somewhat improved upon this by making your mercs talk a bit more, during NPC interactions for example or they do chat with each other a bit, but it's sill limited to few sentences at most. You going to hear the same lines repeated for the rest of your playtrough. \nThey tried to give mercs some more personality in which they both succeeded and failed at the same time.\nSome of the mercs have changed, some of them for the better some of them for the worse. Some of them are really annoying, so this is a mixed bag and not the expected amazing improvement I've been waiting for.\nMercs were always an important part of JA but they shouldn't be the main focus to the detriment of other parts of the game, which is seem to be the case here.\n\nOverall not a bad try but not nearly good enough to dethrone JA2 1.13 and I don't really understand the very positive reviews. I guess people are starved for a half decent game after the metric shit ton of AAA failures and AI generated slop vomited in their general direction now days. But I personally think it does not worth full price. I bought it 90% off and I still have regrets.\n\nTo any future developer: MAKE JA2 1.13! But in a modern coat with mod support! That's the game we are waiting for for decades. You will make bank! You think it's not going to do well because it's too difficult and complex but the most complex and difficult games are the most successful ones. \n People love depth. People love a challenge. People love the tacticool.\nDark Souls, ARMA, complex, difficult games that are highly successful. Dayz, Escape from Tarkov etc...\nWe want cool action heroes, tons of guns and attachments, LBE, gear management, merc management, upgrades, strategical depth, tactical depth.\n It's hard to make a good game. It's even harder to make a good Jagged Alliance game. There have been many tries over the years and none of them were a real successor to JA2. Sadly, this one is not an exception either.\nA decent game yeah, maybe. \nBut not a truly good JA game I have been waiting for for decades!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game loves to take control away from you and limit your dialogue options to what the leftie communist developers saw as appropriate.\n\nThe music was great.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "absolute trash, trained mercenaries that can't hit a target in MELEE combat, from BEHIND, with the ennemy OBLIVIOUS. Guns ? 3 meters and you will somehow fucking miss. \r\n\r\nWhat the fuck is this shit ? make sense how this game costed like 3€ on instant gaming, no fucking shit. Play Wasteland 3 or litterally any other game, this shit sucks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terrible tacticool game.  ALL of the playable characters are silly and akward over characterization of lame 80s characters..  A dumb feature that some characters cant work with eachother.  Running around with farmer weapons but the badguys have fully automatic weapons that were obviously supplied by the US arms dealership company.   Can't create your own character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An unbalanced mess that i tried to enjoy. All i came away with is a migraine and hours of wasted time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game isn’t bad, but it’s not good either. I’ve spent countless hours playing Jagged Alliance 2 since its release—it’s one of my all-time favorite games. And the whole time I was playing the third installment, I kept thinking that I was wasting my time and would rather be playing JA2.\n\nRight from the start, I didn’t like the combat system in the new game. It tries to mimic XCOM, but completely changes the formula. In XCOM, you could win a fight without the enemy ever getting a shot. Here, the gameplay revolves around overwatch and stacking negative status effects. At the start, your mercs are weak and their weapons are terrible, so there’s no point in shooting for the center of the mass—the damage is just pathetic. The only real option is to aim for the limbs or try to land a headshot. And the whole combat system just feels \"gamey\", every encounter is like a puzzle. I'm just not a fan of that kind of gameplay. Of course, that only applies if you don’t clear out the entire location with stealth snipers. In that case, the fight might not even happen at all.\n\nThe difficulty curve is also a mess. Early on, even the starting island is tough until you figure out how the game works and find some proper guns. But once you do, it becomes way too easy—because you realize that out of all the classes, the stealth sniper and LMG support are the only one that really matters. From that point on, the game turns into a repetitive grind. By hour 30, I was climbing the walls from boredom. I ended up downloading a cheat mod just to finish the game faster.\n\nI started on the easiest difficulty with the forgiving mode just to get a feel for the mechanics, and even then, I had to restart several times just to build a decent squad. In JA2, you could hire a couple of expensive mercs and clear the early sectors. In this game, you’re forced to recruit a team of specialists because the devs decided they were making a CRPG now. They added skill checks in dialogues that can affect quest outcomes. And the quests themselves? Boring. I started skipping them almost immediately. If I wanted to read walls of text and do side quests, I’d play Baldur’s Gate.\nThen there’s the devs’ obsession with turning the game into a parody of action movies. Like I said, the dialogue is bad and not funny, and on top of that, there are endless pop culture references. JA2 had humor too, but it was never the centerpiece. By hour 30, I just gave up on the side quests. There are way too many of them, they’re not interesting, and tracking them with that horrendous UI is a pain.\n\nI also hated having to run around every location just to find some hidden stash or a bush with healing herbs. It would’ve been great if every item in a sector—no exceptions—was accessible directly from the stash on the map. That way, I wouldn’t have to waste time searching locations. But you have to do it—because remember it's a CRPG and you need to talk to NPCs to get new quests, and sometimes you can find good weapons that you can't buy.\nI know that in Jagged Alliance 2, items inside containers didn’t show up in the sector stash either—and I already disliked that back then. But at least in JA2, all you had to do was loot the chests. Here, they’ve added intel gathering, collecting medicinal herbs, and scavenging scrap for crafting on top of that. \nAs for Bobby Ray’s shop, which was added in patch 1.3.0—it’s a complete joke. The selection is always painfully limited, and there’s no way to expand the inventory through settings. It feels like a half-baked feature that doesn’t even try to be useful.\n\nThe interface is clunky—I had tons of moments where I clicked the wrong thing or didn't see the cover type behind the projection of the merk. I guess that’s the price of adapting the game for gamepads. The game is also full of junk that clutters your inventory—lenses, chips, tubes, all supposedly needed for weapon modding. Then there are random artifacts you have to turn in to a specific NPC, piles of different jewels, diamonds, and a bag of coins, which I never figured out the purpose of. It’s just unnecessary clutter.\nWeapon mods should be standalone items that can be equipped and removed. And all the useless junk should automatically convert into money. There’s no reason to force players to micromanage that stuff, and running around collecting trash gets old really fast.\n\nSome decisions the devs made are really questionable. They kept some of the outdated mechanics from the original—like the lack of hit chance and looting (and added more of that)—but removed features that actually worked well, like the simple aiming mode and proper weapon modifications. In other words, they scrapped what was functional and kept what feels obsolete by modern standards.\n\nThe maps are really small, maybe that’s why the devs removed hit chance percentages—because it looks ridiculous when a merc can’t hit an enemy standing two meters away.\nI constantly felt like there weren’t enough cover options. In XCOM, I can plan a route that lets me consistently move from cover to cover. In this game, I often didn’t have enough action points to reach the next safe spot. The maps may look pretty, sure—but they’re not functional, and all that visual noise ends up straining my eyes.\n\nThe only thing I genuinely liked was the music. \n\n[i]I actually had more fun playing Brigade E5, which was originally developed as the true third installment of the series.[/i]",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Warning to new potential buyers!\n\nThis game is abandoned by the developers and the multiplayer servers do not function properly anymore.\n\nFor days and weeks randomly, you will not be able to play multiplayer coop at all since their login servers turn off/crash and nobody responds.\n\nDon't lose your money to yet another THQ Nordic abandonware.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is based on my second playthrough (it's still ongoing), using mods to improve the gameplay and some UI. The first gameplay just failed in very early stage when I couldn't figure out the game mechanics and lost too much (awful tutorials).\n\nPositive:\n1. Maps areas look great and well done.\n2. Few cool characters and merch’s + missions.\n3. Some very interesting situations that change your game tactics.\n4. Mods! Mods! Mods!\n5. Music is good.\n\nNegative:\n1. Some of the game mechanics are just awfully bad!! E.g. UI ammo and stuff management, only mercs (not even mech militia can do, why?) can fix or edit weapons, communications or selecting stuff from the ground does not always work etc. The list is long. \n2. AI is extremely bad, especially the hired militia AI. You cannot let AI take care of or support you in areas as they will always die and lose, whatever their skillset or strong gears are. You must manually ALWAYS resolve yourself, even when you have the elite militia - weak enemy AI just kills your elite dudes. \n3. Enemy AI is always stronger and has stronger buffs. They can act before you can ambush, sneak or shoot, just awful mechanics. \n4. Sneaking is basically useless. No tactics can be applied. \n5. Detection range or enemy vision field missing, why the god’s sake?!?\n6. WHY THE f. sake it needs to have deployment areas fixed???!!! It makes the tactics or gameplay so boringly repetitive, especially when you are defending same areas from spamming raids. \n7. Very few different AI characters with weapons. Boring and repetitive.\n8. Very boring story and most of the characters. Some awful merch voices and characters.\n9. Overwatch is totally useless, especially for militia. Shittiest shot by default, when you have max AP's?? Really?? :D\n10. For the f. sake, why changing armors do not alter troops visually? Cheap execution.\n11. Boring and difficult crafting mechanism. \n12. New game option that does not give any hint of what it does or effects!!!\n13. Locked views and movement when AI act, WHY??? It causes time to time to lose sight of what exactly is happening or did someone get hit, e.g.\n14. I still do not understand some of the mechanics...\n..... and so on and so on.\n\nWhat a letdown. I had so much hope for this game and to be one of the best out there. JA2 was special, this just isn't. It's not worth the full money, buy only when there are huge sales. Only mods will keep this game alive. Sad :(\n\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have an RTX5090 and the game crashes and locks up my machine every few hours of play.  The game will completely lock up my machine and I have to do a full shutdown and restart.  Many people online are reporting the same system crashes from this game and no other games I play do this on my system.  Don't buy this game unless you like system crashes!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is interesting ....when it runs, after 1 hour of game play I am facing constant CTD, I downloaded 2 mods and I thought this might be the reason, alas Reinstalling the game and deleting the mods did nothing, its simply is a sloppy made game, I had to restart couintless times and I am simply getting tired of it, a real shame to a great legacy. I understand THQ Nordic is just the publisher but I hear they are in discussion with Hasbro about making BG4. I really hope they don't, they will destroy a great franchise if they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be a fun game if you played JA1 & JA2 and knew what was going on. Otherwise it's just a poorly designed mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies which can see you when you are literally behind walls and turned to you by his back IS NOT OKAY MECHANIC. \nWhy should I use \"stealth\" (haha) when everyone can see me for half a map even i would burrow ten meters under dirt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good in general but not perfect. Things look blurry in the distance, maybe it's just a depth of field effect.\n\nUI is usable but still not good or intuitive enough. This was the problem with JA2 as well in the beginning, but once you learnt the logic behind the UI of JA2 it's weird to get use to the new JA3 UI. I kept looking for the familiar menu lists on right click.\nIn some ways it's better but in other ways it's worse. \nI did prefer JA2 UI and systems overall. The simple branching menu lists did allow for faster management of training and other tasks of my mercs.\nAnother problem with the game is that your weapons are not visible on the bottom of the screen. JA2 was not just about the mercs but about the weapons. The devs should have learnt from the 1.13 patch and put more focus on gear and weapons. We love weapons. The player always have to see the weapon on the UI like in JA2 or in Fallout 2. \n\nThe weapons also have to feel different and fulfill a specific role which they try to do but doesn't really work in JA3. I can tell that whomever did the weapons does not know shit about guns. \nThere is basically no point in using anything but the high damage rifles in this game.\nWeapon damage numbers are all over the place! \nDamage should be more dependent on the bullets used but in this game a 9mm Browning Hi-power does more damage than a .44 magnum Colt Pacemaker or a 5.56 Famas! How exactly is this possible?\nDamage equals velocity x mass! Of course bullet shape(armor piercing, hollow point) matters, just like body armor, and the amonut of gunpowder behind the projectile but for a start it would have been great to take at least the caliber into account when calculating damage and penetration, meaning a smaller bullet = less damage and bigger bullet= more damage. A bigger, faster bullet will transfer more energy to you body, therefore will do more damage! Common sense. But in this game there have been no common sense applied. You should have built and balance your game around the guns but what they did is they tried to build and balance the guns around everything else. It's extremely annoying and made me quit several times since certain playstyles that worked in JA2 do not work here. Assault rifles for example feel useless peashooters while in reality they should be dominating they battlefield. Especially in mid range combat. I don't think I will ever finish the game.\nI do not want to play it because it stupid and annoying, instead of plesant and satisfying.\nWhere are the good Ideas from JA2? Shooting people on the leg make them fall and loose a turn has a real strategic value! Same as shooting them on the arm and making their gun drop. But in this game it's just percentages.\nGames like this also need a killcam or some way to bring the action closer to the player as one of the most important and satisfying thing in a combat game is when you defeat the enemies!\nJA2 had at least one limited but satisfying animation. I would like something like in fallout2 where enemies had multiple cool death animations. Guys literally sliced in half by your laser guns and slowly fell apart like in some cool action movie! But in this game the enemy deaths are quite casual. They just fall over and that's it. Sometimes their head explodes if you apply enough damage which you can't really see because they are far away, the graphics are a bit blurry and the camera changes back in a second.\n\nNice maps, art, models, enviroment and\nsounds, including the music. They usually fit the game and the setting\nSlight improvement on the characters and character interactions.\n In JA2 we already had a system for this but was very limited. Your mercs had a line or two to say and that's it.\n They somewhat improved upon this by making your mercs talk a bit more, during NPC interactions for example or they do chat with each other a bit, but it's sill limited to few sentences at most. You going to hear the same lines repeated for the rest of your playtrough. \nThey tried to give mercs some more personality in which they both succeeded and failed at the same time.\nSome of the mercs have changed, some of them for the better some of them for the worse. Some of them are really annoying, so this is a mixed bag and not the expected amazing improvement I've been waiting for.\nMercs were always an important part of JA but they shouldn't be the main focus to the detriment of other parts of the game, which is seem to be the case here.\n\nOverall not a bad try but not nearly good enough to dethrone JA2 1.13 and I don't really understand the very positive reviews. I guess people are starved for a half decent game after the metric shit ton of AAA failures and AI generated slop vomited in their general direction now days. But I personally think it does not worth full price. I bought it 90% off and I still have regrets.\n\nTo any future developer: MAKE JA2 1.13! But in a modern coat with mod support! That's the game we are waiting for for decades. You will make bank! You think it's not going to do well because it's too difficult and complex but the most complex and difficult games are the most successful ones. \n People love depth. People love a challenge. People love the tacticool.\nDark Souls, ARMA, complex, difficult games that are highly successful. Dayz, Escape from Tarkov etc...\nWe want cool action heroes, tons of guns and attachments, LBE, gear management, merc management, upgrades, strategical depth, tactical depth.\n It's hard to make a good game. It's even harder to make a good Jagged Alliance game. There have been many tries over the years and none of them were a real successor to JA2. Sadly, this one is not an exception either.\nA decent game yeah, maybe. \nBut not a truly good JA game I have been waiting for for decades!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game loves to take control away from you and limit your dialogue options to what the leftie communist developers saw as appropriate.\n\nThe music was great.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "absolute trash, trained mercenaries that can't hit a target in MELEE combat, from BEHIND, with the ennemy OBLIVIOUS. Guns ? 3 meters and you will somehow fucking miss. \r\n\r\nWhat the fuck is this shit ? make sense how this game costed like 3€ on instant gaming, no fucking shit. Play Wasteland 3 or litterally any other game, this shit sucks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terrible tacticool game.  ALL of the playable characters are silly and akward over characterization of lame 80s characters..  A dumb feature that some characters cant work with eachother.  Running around with farmer weapons but the badguys have fully automatic weapons that were obviously supplied by the US arms dealership company.   Can't create your own character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An unbalanced mess that i tried to enjoy. All i came away with is a migraine and hours of wasted time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game isn’t bad, but it’s not good either. I’ve spent countless hours playing Jagged Alliance 2 since its release—it’s one of my all-time favorite games. And the whole time I was playing the third installment, I kept thinking that I was wasting my time and would rather be playing JA2.\n\nRight from the start, I didn’t like the combat system in the new game. It tries to mimic XCOM, but completely changes the formula. In XCOM, you could win a fight without the enemy ever getting a shot. Here, the gameplay revolves around overwatch and stacking negative status effects. At the start, your mercs are weak and their weapons are terrible, so there’s no point in shooting for the center of the mass—the damage is just pathetic. The only real option is to aim for the limbs or try to land a headshot. And the whole combat system just feels \"gamey\", every encounter is like a puzzle. I'm just not a fan of that kind of gameplay. Of course, that only applies if you don’t clear out the entire location with stealth snipers. In that case, the fight might not even happen at all.\n\nThe difficulty curve is also a mess. Early on, even the starting island is tough until you figure out how the game works and find some proper guns. But once you do, it becomes way too easy—because you realize that out of all the classes, the stealth sniper and LMG support are the only one that really matters. From that point on, the game turns into a repetitive grind. By hour 30, I was climbing the walls from boredom. I ended up downloading a cheat mod just to finish the game faster.\n\nI started on the easiest difficulty with the forgiving mode just to get a feel for the mechanics, and even then, I had to restart several times just to build a decent squad. In JA2, you could hire a couple of expensive mercs and clear the early sectors. In this game, you’re forced to recruit a team of specialists because the devs decided they were making a CRPG now. They added skill checks in dialogues that can affect quest outcomes. And the quests themselves? Boring. I started skipping them almost immediately. If I wanted to read walls of text and do side quests, I’d play Baldur’s Gate.\nThen there’s the devs’ obsession with turning the game into a parody of action movies. Like I said, the dialogue is bad and not funny, and on top of that, there are endless pop culture references. JA2 had humor too, but it was never the centerpiece. By hour 30, I just gave up on the side quests. There are way too many of them, they’re not interesting, and tracking them with that horrendous UI is a pain.\n\nI also hated having to run around every location just to find some hidden stash or a bush with healing herbs. It would’ve been great if every item in a sector—no exceptions—was accessible directly from the stash on the map. That way, I wouldn’t have to waste time searching locations. But you have to do it—because remember it's a CRPG and you need to talk to NPCs to get new quests, and sometimes you can find good weapons that you can't buy.\nI know that in Jagged Alliance 2, items inside containers didn’t show up in the sector stash either—and I already disliked that back then. But at least in JA2, all you had to do was loot the chests. Here, they’ve added intel gathering, collecting medicinal herbs, and scavenging scrap for crafting on top of that. \nAs for Bobby Ray’s shop, which was added in patch 1.3.0—it’s a complete joke. The selection is always painfully limited, and there’s no way to expand the inventory through settings. It feels like a half-baked feature that doesn’t even try to be useful.\n\nThe interface is clunky—I had tons of moments where I clicked the wrong thing or didn't see the cover type behind the projection of the merk. I guess that’s the price of adapting the game for gamepads. The game is also full of junk that clutters your inventory—lenses, chips, tubes, all supposedly needed for weapon modding. Then there are random artifacts you have to turn in to a specific NPC, piles of different jewels, diamonds, and a bag of coins, which I never figured out the purpose of. It’s just unnecessary clutter.\nWeapon mods should be standalone items that can be equipped and removed. And all the useless junk should automatically convert into money. There’s no reason to force players to micromanage that stuff, and running around collecting trash gets old really fast.\n\nSome decisions the devs made are really questionable. They kept some of the outdated mechanics from the original—like the lack of hit chance and looting (and added more of that)—but removed features that actually worked well, like the simple aiming mode and proper weapon modifications. In other words, they scrapped what was functional and kept what feels obsolete by modern standards.\n\nThe maps are really small, maybe that’s why the devs removed hit chance percentages—because it looks ridiculous when a merc can’t hit an enemy standing two meters away.\nI constantly felt like there weren’t enough cover options. In XCOM, I can plan a route that lets me consistently move from cover to cover. In this game, I often didn’t have enough action points to reach the next safe spot. The maps may look pretty, sure—but they’re not functional, and all that visual noise ends up straining my eyes.\n\nThe only thing I genuinely liked was the music. \n\n[i]I actually had more fun playing Brigade E5, which was originally developed as the true third installment of the series.[/i]",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Warning to new potential buyers!\n\nThis game is abandoned by the developers and the multiplayer servers do not function properly anymore.\n\nFor days and weeks randomly, you will not be able to play multiplayer coop at all since their login servers turn off/crash and nobody responds.\n\nDon't lose your money to yet another THQ Nordic abandonware.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is based on my second playthrough (it's still ongoing), using mods to improve the gameplay and some UI. The first gameplay just failed in very early stage when I couldn't figure out the game mechanics and lost too much (awful tutorials).\n\nPositive:\n1. Maps areas look great and well done.\n2. Few cool characters and merch’s + missions.\n3. Some very interesting situations that change your game tactics.\n4. Mods! Mods! Mods!\n5. Music is good.\n\nNegative:\n1. Some of the game mechanics are just awfully bad!! E.g. UI ammo and stuff management, only mercs (not even mech militia can do, why?) can fix or edit weapons, communications or selecting stuff from the ground does not always work etc. The list is long. \n2. AI is extremely bad, especially the hired militia AI. You cannot let AI take care of or support you in areas as they will always die and lose, whatever their skillset or strong gears are. You must manually ALWAYS resolve yourself, even when you have the elite militia - weak enemy AI just kills your elite dudes. \n3. Enemy AI is always stronger and has stronger buffs. They can act before you can ambush, sneak or shoot, just awful mechanics. \n4. Sneaking is basically useless. No tactics can be applied. \n5. Detection range or enemy vision field missing, why the god’s sake?!?\n6. WHY THE f. sake it needs to have deployment areas fixed???!!! It makes the tactics or gameplay so boringly repetitive, especially when you are defending same areas from spamming raids. \n7. Very few different AI characters with weapons. Boring and repetitive.\n8. Very boring story and most of the characters. Some awful merch voices and characters.\n9. Overwatch is totally useless, especially for militia. Shittiest shot by default, when you have max AP's?? Really?? :D\n10. For the f. sake, why changing armors do not alter troops visually? Cheap execution.\n11. Boring and difficult crafting mechanism. \n12. New game option that does not give any hint of what it does or effects!!!\n13. Locked views and movement when AI act, WHY??? It causes time to time to lose sight of what exactly is happening or did someone get hit, e.g.\n14. I still do not understand some of the mechanics...\n..... and so on and so on.\n\nWhat a letdown. I had so much hope for this game and to be one of the best out there. JA2 was special, this just isn't. It's not worth the full money, buy only when there are huge sales. Only mods will keep this game alive. Sad :(\n\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have an RTX5090 and the game crashes and locks up my machine every few hours of play.  The game will completely lock up my machine and I have to do a full shutdown and restart.  Many people online are reporting the same system crashes from this game and no other games I play do this on my system.  Don't buy this game unless you like system crashes!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is interesting ....when it runs, after 1 hour of game play I am facing constant CTD, I downloaded 2 mods and I thought this might be the reason, alas Reinstalling the game and deleting the mods did nothing, its simply is a sloppy made game, I had to restart couintless times and I am simply getting tired of it, a real shame to a great legacy. I understand THQ Nordic is just the publisher but I hear they are in discussion with Hasbro about making BG4. I really hope they don't, they will destroy a great franchise if they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be a fun game if you played JA1 & JA2 and knew what was going on. Otherwise it's just a poorly designed mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies which can see you when you are literally behind walls and turned to you by his back IS NOT OKAY MECHANIC. \nWhy should I use \"stealth\" (haha) when everyone can see me for half a map even i would burrow ten meters under dirt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good in general but not perfect. Things look blurry in the distance, maybe it's just a depth of field effect.\n\nUI is usable but still not good or intuitive enough. This was the problem with JA2 as well in the beginning, but once you learnt the logic behind the UI of JA2 it's weird to get use to the new JA3 UI. I kept looking for the familiar menu lists on right click.\nIn some ways it's better but in other ways it's worse. \nI did prefer JA2 UI and systems overall. The simple branching menu lists did allow for faster management of training and other tasks of my mercs.\nAnother problem with the game is that your weapons are not visible on the bottom of the screen. JA2 was not just about the mercs but about the weapons. The devs should have learnt from the 1.13 patch and put more focus on gear and weapons. We love weapons. The player always have to see the weapon on the UI like in JA2 or in Fallout 2. \n\nThe weapons also have to feel different and fulfill a specific role which they try to do but doesn't really work in JA3. I can tell that whomever did the weapons does not know shit about guns. \nThere is basically no point in using anything but the high damage rifles in this game.\nWeapon damage numbers are all over the place! \nDamage should be more dependent on the bullets used but in this game a 9mm Browning Hi-power does more damage than a .44 magnum Colt Pacemaker or a 5.56 Famas! How exactly is this possible?\nDamage equals velocity x mass! Of course bullet shape(armor piercing, hollow point) matters, just like body armor, and the amonut of gunpowder behind the projectile but for a start it would have been great to take at least the caliber into account when calculating damage and penetration, meaning a smaller bullet = less damage and bigger bullet= more damage. A bigger, faster bullet will transfer more energy to you body, therefore will do more damage! Common sense. But in this game there have been no common sense applied. You should have built and balance your game around the guns but what they did is they tried to build and balance the guns around everything else. It's extremely annoying and made me quit several times since certain playstyles that worked in JA2 do not work here. Assault rifles for example feel useless peashooters while in reality they should be dominating they battlefield. Especially in mid range combat. I don't think I will ever finish the game.\nI do not want to play it because it stupid and annoying, instead of plesant and satisfying.\nWhere are the good Ideas from JA2? Shooting people on the leg make them fall and loose a turn has a real strategic value! Same as shooting them on the arm and making their gun drop. But in this game it's just percentages.\nGames like this also need a killcam or some way to bring the action closer to the player as one of the most important and satisfying thing in a combat game is when you defeat the enemies!\nJA2 had at least one limited but satisfying animation. I would like something like in fallout2 where enemies had multiple cool death animations. Guys literally sliced in half by your laser guns and slowly fell apart like in some cool action movie! But in this game the enemy deaths are quite casual. They just fall over and that's it. Sometimes their head explodes if you apply enough damage which you can't really see because they are far away, the graphics are a bit blurry and the camera changes back in a second.\n\nNice maps, art, models, enviroment and\nsounds, including the music. They usually fit the game and the setting\nSlight improvement on the characters and character interactions.\n In JA2 we already had a system for this but was very limited. Your mercs had a line or two to say and that's it.\n They somewhat improved upon this by making your mercs talk a bit more, during NPC interactions for example or they do chat with each other a bit, but it's sill limited to few sentences at most. You going to hear the same lines repeated for the rest of your playtrough. \nThey tried to give mercs some more personality in which they both succeeded and failed at the same time.\nSome of the mercs have changed, some of them for the better some of them for the worse. Some of them are really annoying, so this is a mixed bag and not the expected amazing improvement I've been waiting for.\nMercs were always an important part of JA but they shouldn't be the main focus to the detriment of other parts of the game, which is seem to be the case here.\n\nOverall not a bad try but not nearly good enough to dethrone JA2 1.13 and I don't really understand the very positive reviews. I guess people are starved for a half decent game after the metric shit ton of AAA failures and AI generated slop vomited in their general direction now days. But I personally think it does not worth full price. I bought it 90% off and I still have regrets.\n\nTo any future developer: MAKE JA2 1.13! But in a modern coat with mod support! That's the game we are waiting for for decades. You will make bank! You think it's not going to do well because it's too difficult and complex but the most complex and difficult games are the most successful ones. \n People love depth. People love a challenge. People love the tacticool.\nDark Souls, ARMA, complex, difficult games that are highly successful. Dayz, Escape from Tarkov etc...\nWe want cool action heroes, tons of guns and attachments, LBE, gear management, merc management, upgrades, strategical depth, tactical depth.\n It's hard to make a good game. It's even harder to make a good Jagged Alliance game. There have been many tries over the years and none of them were a real successor to JA2. Sadly, this one is not an exception either.\nA decent game yeah, maybe. \nBut not a truly good JA game I have been waiting for for decades!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game loves to take control away from you and limit your dialogue options to what the leftie communist developers saw as appropriate.\n\nThe music was great.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "absolute trash, trained mercenaries that can't hit a target in MELEE combat, from BEHIND, with the ennemy OBLIVIOUS. Guns ? 3 meters and you will somehow fucking miss. \r\n\r\nWhat the fuck is this shit ? make sense how this game costed like 3€ on instant gaming, no fucking shit. Play Wasteland 3 or litterally any other game, this shit sucks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terrible tacticool game.  ALL of the playable characters are silly and akward over characterization of lame 80s characters..  A dumb feature that some characters cant work with eachother.  Running around with farmer weapons but the badguys have fully automatic weapons that were obviously supplied by the US arms dealership company.   Can't create your own character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An unbalanced mess that i tried to enjoy. All i came away with is a migraine and hours of wasted time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game isn’t bad, but it’s not good either. I’ve spent countless hours playing Jagged Alliance 2 since its release—it’s one of my all-time favorite games. And the whole time I was playing the third installment, I kept thinking that I was wasting my time and would rather be playing JA2.\n\nRight from the start, I didn’t like the combat system in the new game. It tries to mimic XCOM, but completely changes the formula. In XCOM, you could win a fight without the enemy ever getting a shot. Here, the gameplay revolves around overwatch and stacking negative status effects. At the start, your mercs are weak and their weapons are terrible, so there’s no point in shooting for the center of the mass—the damage is just pathetic. The only real option is to aim for the limbs or try to land a headshot. And the whole combat system just feels \"gamey\", every encounter is like a puzzle. I'm just not a fan of that kind of gameplay. Of course, that only applies if you don’t clear out the entire location with stealth snipers. In that case, the fight might not even happen at all.\n\nThe difficulty curve is also a mess. Early on, even the starting island is tough until you figure out how the game works and find some proper guns. But once you do, it becomes way too easy—because you realize that out of all the classes, the stealth sniper and LMG support are the only one that really matters. From that point on, the game turns into a repetitive grind. By hour 30, I was climbing the walls from boredom. I ended up downloading a cheat mod just to finish the game faster.\n\nI started on the easiest difficulty with the forgiving mode just to get a feel for the mechanics, and even then, I had to restart several times just to build a decent squad. In JA2, you could hire a couple of expensive mercs and clear the early sectors. In this game, you’re forced to recruit a team of specialists because the devs decided they were making a CRPG now. They added skill checks in dialogues that can affect quest outcomes. And the quests themselves? Boring. I started skipping them almost immediately. If I wanted to read walls of text and do side quests, I’d play Baldur’s Gate.\nThen there’s the devs’ obsession with turning the game into a parody of action movies. Like I said, the dialogue is bad and not funny, and on top of that, there are endless pop culture references. JA2 had humor too, but it was never the centerpiece. By hour 30, I just gave up on the side quests. There are way too many of them, they’re not interesting, and tracking them with that horrendous UI is a pain.\n\nI also hated having to run around every location just to find some hidden stash or a bush with healing herbs. It would’ve been great if every item in a sector—no exceptions—was accessible directly from the stash on the map. That way, I wouldn’t have to waste time searching locations. But you have to do it—because remember it's a CRPG and you need to talk to NPCs to get new quests, and sometimes you can find good weapons that you can't buy.\nI know that in Jagged Alliance 2, items inside containers didn’t show up in the sector stash either—and I already disliked that back then. But at least in JA2, all you had to do was loot the chests. Here, they’ve added intel gathering, collecting medicinal herbs, and scavenging scrap for crafting on top of that. \nAs for Bobby Ray’s shop, which was added in patch 1.3.0—it’s a complete joke. The selection is always painfully limited, and there’s no way to expand the inventory through settings. It feels like a half-baked feature that doesn’t even try to be useful.\n\nThe interface is clunky—I had tons of moments where I clicked the wrong thing or didn't see the cover type behind the projection of the merk. I guess that’s the price of adapting the game for gamepads. The game is also full of junk that clutters your inventory—lenses, chips, tubes, all supposedly needed for weapon modding. Then there are random artifacts you have to turn in to a specific NPC, piles of different jewels, diamonds, and a bag of coins, which I never figured out the purpose of. It’s just unnecessary clutter.\nWeapon mods should be standalone items that can be equipped and removed. And all the useless junk should automatically convert into money. There’s no reason to force players to micromanage that stuff, and running around collecting trash gets old really fast.\n\nSome decisions the devs made are really questionable. They kept some of the outdated mechanics from the original—like the lack of hit chance and looting (and added more of that)—but removed features that actually worked well, like the simple aiming mode and proper weapon modifications. In other words, they scrapped what was functional and kept what feels obsolete by modern standards.\n\nThe maps are really small, maybe that’s why the devs removed hit chance percentages—because it looks ridiculous when a merc can’t hit an enemy standing two meters away.\nI constantly felt like there weren’t enough cover options. In XCOM, I can plan a route that lets me consistently move from cover to cover. In this game, I often didn’t have enough action points to reach the next safe spot. The maps may look pretty, sure—but they’re not functional, and all that visual noise ends up straining my eyes.\n\nThe only thing I genuinely liked was the music. \n\n[i]I actually had more fun playing Brigade E5, which was originally developed as the true third installment of the series.[/i]",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Warning to new potential buyers!\n\nThis game is abandoned by the developers and the multiplayer servers do not function properly anymore.\n\nFor days and weeks randomly, you will not be able to play multiplayer coop at all since their login servers turn off/crash and nobody responds.\n\nDon't lose your money to yet another THQ Nordic abandonware.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is based on my second playthrough (it's still ongoing), using mods to improve the gameplay and some UI. The first gameplay just failed in very early stage when I couldn't figure out the game mechanics and lost too much (awful tutorials).\n\nPositive:\n1. Maps areas look great and well done.\n2. Few cool characters and merch’s + missions.\n3. Some very interesting situations that change your game tactics.\n4. Mods! Mods! Mods!\n5. Music is good.\n\nNegative:\n1. Some of the game mechanics are just awfully bad!! E.g. UI ammo and stuff management, only mercs (not even mech militia can do, why?) can fix or edit weapons, communications or selecting stuff from the ground does not always work etc. The list is long. \n2. AI is extremely bad, especially the hired militia AI. You cannot let AI take care of or support you in areas as they will always die and lose, whatever their skillset or strong gears are. You must manually ALWAYS resolve yourself, even when you have the elite militia - weak enemy AI just kills your elite dudes. \n3. Enemy AI is always stronger and has stronger buffs. They can act before you can ambush, sneak or shoot, just awful mechanics. \n4. Sneaking is basically useless. No tactics can be applied. \n5. Detection range or enemy vision field missing, why the god’s sake?!?\n6. WHY THE f. sake it needs to have deployment areas fixed???!!! It makes the tactics or gameplay so boringly repetitive, especially when you are defending same areas from spamming raids. \n7. Very few different AI characters with weapons. Boring and repetitive.\n8. Very boring story and most of the characters. Some awful merch voices and characters.\n9. Overwatch is totally useless, especially for militia. Shittiest shot by default, when you have max AP's?? Really?? :D\n10. For the f. sake, why changing armors do not alter troops visually? Cheap execution.\n11. Boring and difficult crafting mechanism. \n12. New game option that does not give any hint of what it does or effects!!!\n13. Locked views and movement when AI act, WHY??? It causes time to time to lose sight of what exactly is happening or did someone get hit, e.g.\n14. I still do not understand some of the mechanics...\n..... and so on and so on.\n\nWhat a letdown. I had so much hope for this game and to be one of the best out there. JA2 was special, this just isn't. It's not worth the full money, buy only when there are huge sales. Only mods will keep this game alive. Sad :(\n\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have an RTX5090 and the game crashes and locks up my machine every few hours of play.  The game will completely lock up my machine and I have to do a full shutdown and restart.  Many people online are reporting the same system crashes from this game and no other games I play do this on my system.  Don't buy this game unless you like system crashes!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is interesting ....when it runs, after 1 hour of game play I am facing constant CTD, I downloaded 2 mods and I thought this might be the reason, alas Reinstalling the game and deleting the mods did nothing, its simply is a sloppy made game, I had to restart couintless times and I am simply getting tired of it, a real shame to a great legacy. I understand THQ Nordic is just the publisher but I hear they are in discussion with Hasbro about making BG4. I really hope they don't, they will destroy a great franchise if they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be a fun game if you played JA1 & JA2 and knew what was going on. Otherwise it's just a poorly designed mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies which can see you when you are literally behind walls and turned to you by his back IS NOT OKAY MECHANIC. \nWhy should I use \"stealth\" (haha) when everyone can see me for half a map even i would burrow ten meters under dirt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good in general but not perfect. Things look blurry in the distance, maybe it's just a depth of field effect.\n\nUI is usable but still not good or intuitive enough. This was the problem with JA2 as well in the beginning, but once you learnt the logic behind the UI of JA2 it's weird to get use to the new JA3 UI. I kept looking for the familiar menu lists on right click.\nIn some ways it's better but in other ways it's worse. \nI did prefer JA2 UI and systems overall. The simple branching menu lists did allow for faster management of training and other tasks of my mercs.\nAnother problem with the game is that your weapons are not visible on the bottom of the screen. JA2 was not just about the mercs but about the weapons. The devs should have learnt from the 1.13 patch and put more focus on gear and weapons. We love weapons. The player always have to see the weapon on the UI like in JA2 or in Fallout 2. \n\nThe weapons also have to feel different and fulfill a specific role which they try to do but doesn't really work in JA3. I can tell that whomever did the weapons does not know shit about guns. \nThere is basically no point in using anything but the high damage rifles in this game.\nWeapon damage numbers are all over the place! \nDamage should be more dependent on the bullets used but in this game a 9mm Browning Hi-power does more damage than a .44 magnum Colt Pacemaker or a 5.56 Famas! How exactly is this possible?\nDamage equals velocity x mass! Of course bullet shape(armor piercing, hollow point) matters, just like body armor, and the amonut of gunpowder behind the projectile but for a start it would have been great to take at least the caliber into account when calculating damage and penetration, meaning a smaller bullet = less damage and bigger bullet= more damage. A bigger, faster bullet will transfer more energy to you body, therefore will do more damage! Common sense. But in this game there have been no common sense applied. You should have built and balance your game around the guns but what they did is they tried to build and balance the guns around everything else. It's extremely annoying and made me quit several times since certain playstyles that worked in JA2 do not work here. Assault rifles for example feel useless peashooters while in reality they should be dominating they battlefield. Especially in mid range combat. I don't think I will ever finish the game.\nI do not want to play it because it stupid and annoying, instead of plesant and satisfying.\nWhere are the good Ideas from JA2? Shooting people on the leg make them fall and loose a turn has a real strategic value! Same as shooting them on the arm and making their gun drop. But in this game it's just percentages.\nGames like this also need a killcam or some way to bring the action closer to the player as one of the most important and satisfying thing in a combat game is when you defeat the enemies!\nJA2 had at least one limited but satisfying animation. I would like something like in fallout2 where enemies had multiple cool death animations. Guys literally sliced in half by your laser guns and slowly fell apart like in some cool action movie! But in this game the enemy deaths are quite casual. They just fall over and that's it. Sometimes their head explodes if you apply enough damage which you can't really see because they are far away, the graphics are a bit blurry and the camera changes back in a second.\n\nNice maps, art, models, enviroment and\nsounds, including the music. They usually fit the game and the setting\nSlight improvement on the characters and character interactions.\n In JA2 we already had a system for this but was very limited. Your mercs had a line or two to say and that's it.\n They somewhat improved upon this by making your mercs talk a bit more, during NPC interactions for example or they do chat with each other a bit, but it's sill limited to few sentences at most. You going to hear the same lines repeated for the rest of your playtrough. \nThey tried to give mercs some more personality in which they both succeeded and failed at the same time.\nSome of the mercs have changed, some of them for the better some of them for the worse. Some of them are really annoying, so this is a mixed bag and not the expected amazing improvement I've been waiting for.\nMercs were always an important part of JA but they shouldn't be the main focus to the detriment of other parts of the game, which is seem to be the case here.\n\nOverall not a bad try but not nearly good enough to dethrone JA2 1.13 and I don't really understand the very positive reviews. I guess people are starved for a half decent game after the metric shit ton of AAA failures and AI generated slop vomited in their general direction now days. But I personally think it does not worth full price. I bought it 90% off and I still have regrets.\n\nTo any future developer: MAKE JA2 1.13! But in a modern coat with mod support! That's the game we are waiting for for decades. You will make bank! You think it's not going to do well because it's too difficult and complex but the most complex and difficult games are the most successful ones. \n People love depth. People love a challenge. People love the tacticool.\nDark Souls, ARMA, complex, difficult games that are highly successful. Dayz, Escape from Tarkov etc...\nWe want cool action heroes, tons of guns and attachments, LBE, gear management, merc management, upgrades, strategical depth, tactical depth.\n It's hard to make a good game. It's even harder to make a good Jagged Alliance game. There have been many tries over the years and none of them were a real successor to JA2. Sadly, this one is not an exception either.\nA decent game yeah, maybe. \nBut not a truly good JA game I have been waiting for for decades!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game loves to take control away from you and limit your dialogue options to what the leftie communist developers saw as appropriate.\n\nThe music was great.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "absolute trash, trained mercenaries that can't hit a target in MELEE combat, from BEHIND, with the ennemy OBLIVIOUS. Guns ? 3 meters and you will somehow fucking miss. \r\n\r\nWhat the fuck is this shit ? make sense how this game costed like 3€ on instant gaming, no fucking shit. Play Wasteland 3 or litterally any other game, this shit sucks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terrible tacticool game.  ALL of the playable characters are silly and akward over characterization of lame 80s characters..  A dumb feature that some characters cant work with eachother.  Running around with farmer weapons but the badguys have fully automatic weapons that were obviously supplied by the US arms dealership company.   Can't create your own character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An unbalanced mess that i tried to enjoy. All i came away with is a migraine and hours of wasted time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game isn’t bad, but it’s not good either. I’ve spent countless hours playing Jagged Alliance 2 since its release—it’s one of my all-time favorite games. And the whole time I was playing the third installment, I kept thinking that I was wasting my time and would rather be playing JA2.\n\nRight from the start, I didn’t like the combat system in the new game. It tries to mimic XCOM, but completely changes the formula. In XCOM, you could win a fight without the enemy ever getting a shot. Here, the gameplay revolves around overwatch and stacking negative status effects. At the start, your mercs are weak and their weapons are terrible, so there’s no point in shooting for the center of the mass—the damage is just pathetic. The only real option is to aim for the limbs or try to land a headshot. And the whole combat system just feels \"gamey\", every encounter is like a puzzle. I'm just not a fan of that kind of gameplay. Of course, that only applies if you don’t clear out the entire location with stealth snipers. In that case, the fight might not even happen at all.\n\nThe difficulty curve is also a mess. Early on, even the starting island is tough until you figure out how the game works and find some proper guns. But once you do, it becomes way too easy—because you realize that out of all the classes, the stealth sniper and LMG support are the only one that really matters. From that point on, the game turns into a repetitive grind. By hour 30, I was climbing the walls from boredom. I ended up downloading a cheat mod just to finish the game faster.\n\nI started on the easiest difficulty with the forgiving mode just to get a feel for the mechanics, and even then, I had to restart several times just to build a decent squad. In JA2, you could hire a couple of expensive mercs and clear the early sectors. In this game, you’re forced to recruit a team of specialists because the devs decided they were making a CRPG now. They added skill checks in dialogues that can affect quest outcomes. And the quests themselves? Boring. I started skipping them almost immediately. If I wanted to read walls of text and do side quests, I’d play Baldur’s Gate.\nThen there’s the devs’ obsession with turning the game into a parody of action movies. Like I said, the dialogue is bad and not funny, and on top of that, there are endless pop culture references. JA2 had humor too, but it was never the centerpiece. By hour 30, I just gave up on the side quests. There are way too many of them, they’re not interesting, and tracking them with that horrendous UI is a pain.\n\nI also hated having to run around every location just to find some hidden stash or a bush with healing herbs. It would’ve been great if every item in a sector—no exceptions—was accessible directly from the stash on the map. That way, I wouldn’t have to waste time searching locations. But you have to do it—because remember it's a CRPG and you need to talk to NPCs to get new quests, and sometimes you can find good weapons that you can't buy.\nI know that in Jagged Alliance 2, items inside containers didn’t show up in the sector stash either—and I already disliked that back then. But at least in JA2, all you had to do was loot the chests. Here, they’ve added intel gathering, collecting medicinal herbs, and scavenging scrap for crafting on top of that. \nAs for Bobby Ray’s shop, which was added in patch 1.3.0—it’s a complete joke. The selection is always painfully limited, and there’s no way to expand the inventory through settings. It feels like a half-baked feature that doesn’t even try to be useful.\n\nThe interface is clunky—I had tons of moments where I clicked the wrong thing or didn't see the cover type behind the projection of the merk. I guess that’s the price of adapting the game for gamepads. The game is also full of junk that clutters your inventory—lenses, chips, tubes, all supposedly needed for weapon modding. Then there are random artifacts you have to turn in to a specific NPC, piles of different jewels, diamonds, and a bag of coins, which I never figured out the purpose of. It’s just unnecessary clutter.\nWeapon mods should be standalone items that can be equipped and removed. And all the useless junk should automatically convert into money. There’s no reason to force players to micromanage that stuff, and running around collecting trash gets old really fast.\n\nSome decisions the devs made are really questionable. They kept some of the outdated mechanics from the original—like the lack of hit chance and looting (and added more of that)—but removed features that actually worked well, like the simple aiming mode and proper weapon modifications. In other words, they scrapped what was functional and kept what feels obsolete by modern standards.\n\nThe maps are really small, maybe that’s why the devs removed hit chance percentages—because it looks ridiculous when a merc can’t hit an enemy standing two meters away.\nI constantly felt like there weren’t enough cover options. In XCOM, I can plan a route that lets me consistently move from cover to cover. In this game, I often didn’t have enough action points to reach the next safe spot. The maps may look pretty, sure—but they’re not functional, and all that visual noise ends up straining my eyes.\n\nThe only thing I genuinely liked was the music. \n\n[i]I actually had more fun playing Brigade E5, which was originally developed as the true third installment of the series.[/i]",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Warning to new potential buyers!\n\nThis game is abandoned by the developers and the multiplayer servers do not function properly anymore.\n\nFor days and weeks randomly, you will not be able to play multiplayer coop at all since their login servers turn off/crash and nobody responds.\n\nDon't lose your money to yet another THQ Nordic abandonware.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is based on my second playthrough (it's still ongoing), using mods to improve the gameplay and some UI. The first gameplay just failed in very early stage when I couldn't figure out the game mechanics and lost too much (awful tutorials).\n\nPositive:\n1. Maps areas look great and well done.\n2. Few cool characters and merch’s + missions.\n3. Some very interesting situations that change your game tactics.\n4. Mods! Mods! Mods!\n5. Music is good.\n\nNegative:\n1. Some of the game mechanics are just awfully bad!! E.g. UI ammo and stuff management, only mercs (not even mech militia can do, why?) can fix or edit weapons, communications or selecting stuff from the ground does not always work etc. The list is long. \n2. AI is extremely bad, especially the hired militia AI. You cannot let AI take care of or support you in areas as they will always die and lose, whatever their skillset or strong gears are. You must manually ALWAYS resolve yourself, even when you have the elite militia - weak enemy AI just kills your elite dudes. \n3. Enemy AI is always stronger and has stronger buffs. They can act before you can ambush, sneak or shoot, just awful mechanics. \n4. Sneaking is basically useless. No tactics can be applied. \n5. Detection range or enemy vision field missing, why the god’s sake?!?\n6. WHY THE f. sake it needs to have deployment areas fixed???!!! It makes the tactics or gameplay so boringly repetitive, especially when you are defending same areas from spamming raids. \n7. Very few different AI characters with weapons. Boring and repetitive.\n8. Very boring story and most of the characters. Some awful merch voices and characters.\n9. Overwatch is totally useless, especially for militia. Shittiest shot by default, when you have max AP's?? Really?? :D\n10. For the f. sake, why changing armors do not alter troops visually? Cheap execution.\n11. Boring and difficult crafting mechanism. \n12. New game option that does not give any hint of what it does or effects!!!\n13. Locked views and movement when AI act, WHY??? It causes time to time to lose sight of what exactly is happening or did someone get hit, e.g.\n14. I still do not understand some of the mechanics...\n..... and so on and so on.\n\nWhat a letdown. I had so much hope for this game and to be one of the best out there. JA2 was special, this just isn't. It's not worth the full money, buy only when there are huge sales. Only mods will keep this game alive. Sad :(\n\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have an RTX5090 and the game crashes and locks up my machine every few hours of play.  The game will completely lock up my machine and I have to do a full shutdown and restart.  Many people online are reporting the same system crashes from this game and no other games I play do this on my system.  Don't buy this game unless you like system crashes!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is interesting ....when it runs, after 1 hour of game play I am facing constant CTD, I downloaded 2 mods and I thought this might be the reason, alas Reinstalling the game and deleting the mods did nothing, its simply is a sloppy made game, I had to restart couintless times and I am simply getting tired of it, a real shame to a great legacy. I understand THQ Nordic is just the publisher but I hear they are in discussion with Hasbro about making BG4. I really hope they don't, they will destroy a great franchise if they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be a fun game if you played JA1 & JA2 and knew what was going on. Otherwise it's just a poorly designed mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies which can see you when you are literally behind walls and turned to you by his back IS NOT OKAY MECHANIC. \nWhy should I use \"stealth\" (haha) when everyone can see me for half a map even i would burrow ten meters under dirt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good in general but not perfect. Things look blurry in the distance, maybe it's just a depth of field effect.\n\nUI is usable but still not good or intuitive enough. This was the problem with JA2 as well in the beginning, but once you learnt the logic behind the UI of JA2 it's weird to get use to the new JA3 UI. I kept looking for the familiar menu lists on right click.\nIn some ways it's better but in other ways it's worse. \nI did prefer JA2 UI and systems overall. The simple branching menu lists did allow for faster management of training and other tasks of my mercs.\nAnother problem with the game is that your weapons are not visible on the bottom of the screen. JA2 was not just about the mercs but about the weapons. The devs should have learnt from the 1.13 patch and put more focus on gear and weapons. We love weapons. The player always have to see the weapon on the UI like in JA2 or in Fallout 2. \n\nThe weapons also have to feel different and fulfill a specific role which they try to do but doesn't really work in JA3. I can tell that whomever did the weapons does not know shit about guns. \nThere is basically no point in using anything but the high damage rifles in this game.\nWeapon damage numbers are all over the place! \nDamage should be more dependent on the bullets used but in this game a 9mm Browning Hi-power does more damage than a .44 magnum Colt Pacemaker or a 5.56 Famas! How exactly is this possible?\nDamage equals velocity x mass! Of course bullet shape(armor piercing, hollow point) matters, just like body armor, and the amonut of gunpowder behind the projectile but for a start it would have been great to take at least the caliber into account when calculating damage and penetration, meaning a smaller bullet = less damage and bigger bullet= more damage. A bigger, faster bullet will transfer more energy to you body, therefore will do more damage! Common sense. But in this game there have been no common sense applied. You should have built and balance your game around the guns but what they did is they tried to build and balance the guns around everything else. It's extremely annoying and made me quit several times since certain playstyles that worked in JA2 do not work here. Assault rifles for example feel useless peashooters while in reality they should be dominating they battlefield. Especially in mid range combat. I don't think I will ever finish the game.\nI do not want to play it because it stupid and annoying, instead of plesant and satisfying.\nWhere are the good Ideas from JA2? Shooting people on the leg make them fall and loose a turn has a real strategic value! Same as shooting them on the arm and making their gun drop. But in this game it's just percentages.\nGames like this also need a killcam or some way to bring the action closer to the player as one of the most important and satisfying thing in a combat game is when you defeat the enemies!\nJA2 had at least one limited but satisfying animation. I would like something like in fallout2 where enemies had multiple cool death animations. Guys literally sliced in half by your laser guns and slowly fell apart like in some cool action movie! But in this game the enemy deaths are quite casual. They just fall over and that's it. Sometimes their head explodes if you apply enough damage which you can't really see because they are far away, the graphics are a bit blurry and the camera changes back in a second.\n\nNice maps, art, models, enviroment and\nsounds, including the music. They usually fit the game and the setting\nSlight improvement on the characters and character interactions.\n In JA2 we already had a system for this but was very limited. Your mercs had a line or two to say and that's it.\n They somewhat improved upon this by making your mercs talk a bit more, during NPC interactions for example or they do chat with each other a bit, but it's sill limited to few sentences at most. You going to hear the same lines repeated for the rest of your playtrough. \nThey tried to give mercs some more personality in which they both succeeded and failed at the same time.\nSome of the mercs have changed, some of them for the better some of them for the worse. Some of them are really annoying, so this is a mixed bag and not the expected amazing improvement I've been waiting for.\nMercs were always an important part of JA but they shouldn't be the main focus to the detriment of other parts of the game, which is seem to be the case here.\n\nOverall not a bad try but not nearly good enough to dethrone JA2 1.13 and I don't really understand the very positive reviews. I guess people are starved for a half decent game after the metric shit ton of AAA failures and AI generated slop vomited in their general direction now days. But I personally think it does not worth full price. I bought it 90% off and I still have regrets.\n\nTo any future developer: MAKE JA2 1.13! But in a modern coat with mod support! That's the game we are waiting for for decades. You will make bank! You think it's not going to do well because it's too difficult and complex but the most complex and difficult games are the most successful ones. \n People love depth. People love a challenge. People love the tacticool.\nDark Souls, ARMA, complex, difficult games that are highly successful. Dayz, Escape from Tarkov etc...\nWe want cool action heroes, tons of guns and attachments, LBE, gear management, merc management, upgrades, strategical depth, tactical depth.\n It's hard to make a good game. It's even harder to make a good Jagged Alliance game. There have been many tries over the years and none of them were a real successor to JA2. Sadly, this one is not an exception either.\nA decent game yeah, maybe. \nBut not a truly good JA game I have been waiting for for decades!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game loves to take control away from you and limit your dialogue options to what the leftie communist developers saw as appropriate.\n\nThe music was great.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "absolute trash, trained mercenaries that can't hit a target in MELEE combat, from BEHIND, with the ennemy OBLIVIOUS. Guns ? 3 meters and you will somehow fucking miss. \r\n\r\nWhat the fuck is this shit ? make sense how this game costed like 3€ on instant gaming, no fucking shit. Play Wasteland 3 or litterally any other game, this shit sucks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terrible tacticool game.  ALL of the playable characters are silly and akward over characterization of lame 80s characters..  A dumb feature that some characters cant work with eachother.  Running around with farmer weapons but the badguys have fully automatic weapons that were obviously supplied by the US arms dealership company.   Can't create your own character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An unbalanced mess that i tried to enjoy. All i came away with is a migraine and hours of wasted time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game isn’t bad, but it’s not good either. I’ve spent countless hours playing Jagged Alliance 2 since its release—it’s one of my all-time favorite games. And the whole time I was playing the third installment, I kept thinking that I was wasting my time and would rather be playing JA2.\n\nRight from the start, I didn’t like the combat system in the new game. It tries to mimic XCOM, but completely changes the formula. In XCOM, you could win a fight without the enemy ever getting a shot. Here, the gameplay revolves around overwatch and stacking negative status effects. At the start, your mercs are weak and their weapons are terrible, so there’s no point in shooting for the center of the mass—the damage is just pathetic. The only real option is to aim for the limbs or try to land a headshot. And the whole combat system just feels \"gamey\", every encounter is like a puzzle. I'm just not a fan of that kind of gameplay. Of course, that only applies if you don’t clear out the entire location with stealth snipers. In that case, the fight might not even happen at all.\n\nThe difficulty curve is also a mess. Early on, even the starting island is tough until you figure out how the game works and find some proper guns. But once you do, it becomes way too easy—because you realize that out of all the classes, the stealth sniper and LMG support are the only one that really matters. From that point on, the game turns into a repetitive grind. By hour 30, I was climbing the walls from boredom. I ended up downloading a cheat mod just to finish the game faster.\n\nI started on the easiest difficulty with the forgiving mode just to get a feel for the mechanics, and even then, I had to restart several times just to build a decent squad. In JA2, you could hire a couple of expensive mercs and clear the early sectors. In this game, you’re forced to recruit a team of specialists because the devs decided they were making a CRPG now. They added skill checks in dialogues that can affect quest outcomes. And the quests themselves? Boring. I started skipping them almost immediately. If I wanted to read walls of text and do side quests, I’d play Baldur’s Gate.\nThen there’s the devs’ obsession with turning the game into a parody of action movies. Like I said, the dialogue is bad and not funny, and on top of that, there are endless pop culture references. JA2 had humor too, but it was never the centerpiece. By hour 30, I just gave up on the side quests. There are way too many of them, they’re not interesting, and tracking them with that horrendous UI is a pain.\n\nI also hated having to run around every location just to find some hidden stash or a bush with healing herbs. It would’ve been great if every item in a sector—no exceptions—was accessible directly from the stash on the map. That way, I wouldn’t have to waste time searching locations. But you have to do it—because remember it's a CRPG and you need to talk to NPCs to get new quests, and sometimes you can find good weapons that you can't buy.\nI know that in Jagged Alliance 2, items inside containers didn’t show up in the sector stash either—and I already disliked that back then. But at least in JA2, all you had to do was loot the chests. Here, they’ve added intel gathering, collecting medicinal herbs, and scavenging scrap for crafting on top of that. \nAs for Bobby Ray’s shop, which was added in patch 1.3.0—it’s a complete joke. The selection is always painfully limited, and there’s no way to expand the inventory through settings. It feels like a half-baked feature that doesn’t even try to be useful.\n\nThe interface is clunky—I had tons of moments where I clicked the wrong thing or didn't see the cover type behind the projection of the merk. I guess that’s the price of adapting the game for gamepads. The game is also full of junk that clutters your inventory—lenses, chips, tubes, all supposedly needed for weapon modding. Then there are random artifacts you have to turn in to a specific NPC, piles of different jewels, diamonds, and a bag of coins, which I never figured out the purpose of. It’s just unnecessary clutter.\nWeapon mods should be standalone items that can be equipped and removed. And all the useless junk should automatically convert into money. There’s no reason to force players to micromanage that stuff, and running around collecting trash gets old really fast.\n\nSome decisions the devs made are really questionable. They kept some of the outdated mechanics from the original—like the lack of hit chance and looting (and added more of that)—but removed features that actually worked well, like the simple aiming mode and proper weapon modifications. In other words, they scrapped what was functional and kept what feels obsolete by modern standards.\n\nThe maps are really small, maybe that’s why the devs removed hit chance percentages—because it looks ridiculous when a merc can’t hit an enemy standing two meters away.\nI constantly felt like there weren’t enough cover options. In XCOM, I can plan a route that lets me consistently move from cover to cover. In this game, I often didn’t have enough action points to reach the next safe spot. The maps may look pretty, sure—but they’re not functional, and all that visual noise ends up straining my eyes.\n\nThe only thing I genuinely liked was the music. \n\n[i]I actually had more fun playing Brigade E5, which was originally developed as the true third installment of the series.[/i]",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Warning to new potential buyers!\n\nThis game is abandoned by the developers and the multiplayer servers do not function properly anymore.\n\nFor days and weeks randomly, you will not be able to play multiplayer coop at all since their login servers turn off/crash and nobody responds.\n\nDon't lose your money to yet another THQ Nordic abandonware.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This review is based on my second playthrough (it's still ongoing), using mods to improve the gameplay and some UI. The first gameplay just failed in very early stage when I couldn't figure out the game mechanics and lost too much (awful tutorials).\n\nPositive:\n1. Maps areas look great and well done.\n2. Few cool characters and merch’s + missions.\n3. Some very interesting situations that change your game tactics.\n4. Mods! Mods! Mods!\n5. Music is good.\n\nNegative:\n1. Some of the game mechanics are just awfully bad!! E.g. UI ammo and stuff management, only mercs (not even mech militia can do, why?) can fix or edit weapons, communications or selecting stuff from the ground does not always work etc. The list is long. \n2. AI is extremely bad, especially the hired militia AI. You cannot let AI take care of or support you in areas as they will always die and lose, whatever their skillset or strong gears are. You must manually ALWAYS resolve yourself, even when you have the elite militia - weak enemy AI just kills your elite dudes. \n3. Enemy AI is always stronger and has stronger buffs. They can act before you can ambush, sneak or shoot, just awful mechanics. \n4. Sneaking is basically useless. No tactics can be applied. \n5. Detection range or enemy vision field missing, why the god’s sake?!?\n6. WHY THE f. sake it needs to have deployment areas fixed???!!! It makes the tactics or gameplay so boringly repetitive, especially when you are defending same areas from spamming raids. \n7. Very few different AI characters with weapons. Boring and repetitive.\n8. Very boring story and most of the characters. Some awful merch voices and characters.\n9. Overwatch is totally useless, especially for militia. Shittiest shot by default, when you have max AP's?? Really?? :D\n10. For the f. sake, why changing armors do not alter troops visually? Cheap execution.\n11. Boring and difficult crafting mechanism. \n12. New game option that does not give any hint of what it does or effects!!!\n13. Locked views and movement when AI act, WHY??? It causes time to time to lose sight of what exactly is happening or did someone get hit, e.g.\n14. I still do not understand some of the mechanics...\n..... and so on and so on.\n\nWhat a letdown. I had so much hope for this game and to be one of the best out there. JA2 was special, this just isn't. It's not worth the full money, buy only when there are huge sales. Only mods will keep this game alive. Sad :(\n\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have an RTX5090 and the game crashes and locks up my machine every few hours of play.  The game will completely lock up my machine and I have to do a full shutdown and restart.  Many people online are reporting the same system crashes from this game and no other games I play do this on my system.  Don't buy this game unless you like system crashes!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is interesting ....when it runs, after 1 hour of game play I am facing constant CTD, I downloaded 2 mods and I thought this might be the reason, alas Reinstalling the game and deleting the mods did nothing, its simply is a sloppy made game, I had to restart couintless times and I am simply getting tired of it, a real shame to a great legacy. I understand THQ Nordic is just the publisher but I hear they are in discussion with Hasbro about making BG4. I really hope they don't, they will destroy a great franchise if they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be a fun game if you played JA1 & JA2 and knew what was going on. Otherwise it's just a poorly designed mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies which can see you when you are literally behind walls and turned to you by his back IS NOT OKAY MECHANIC. \nWhy should I use \"stealth\" (haha) when everyone can see me for half a map even i would burrow ten meters under dirt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are good in general but not perfect. Things look blurry in the distance, maybe it's just a depth of field effect.\n\nUI is usable but still not good or intuitive enough. This was the problem with JA2 as well in the beginning, but once you learnt the logic behind the UI of JA2 it's weird to get use to the new JA3 UI. I kept looking for the familiar menu lists on right click.\nIn some ways it's better but in other ways it's worse. \nI did prefer JA2 UI and systems overall. The simple branching menu lists did allow for faster management of training and other tasks of my mercs.\nAnother problem with the game is that your weapons are not visible on the bottom of the screen. JA2 was not just about the mercs but about the weapons. The devs should have learnt from the 1.13 patch and put more focus on gear and weapons. We love weapons. The player always have to see the weapon on the UI like in JA2 or in Fallout 2. \n\nThe weapons also have to feel different and fulfill a specific role which they try to do but doesn't really work in JA3. I can tell that whomever did the weapons does not know shit about guns. \nThere is basically no point in using anything but the high damage rifles in this game.\nWeapon damage numbers are all over the place! \nDamage should be more dependent on the bullets used but in this game a 9mm Browning Hi-power does more damage than a .44 magnum Colt Pacemaker or a 5.56 Famas! How exactly is this possible?\nDamage equals velocity x mass! Of course bullet shape(armor piercing, hollow point) matters, just like body armor, and the amonut of gunpowder behind the projectile but for a start it would have been great to take at least the caliber into account when calculating damage and penetration, meaning a smaller bullet = less damage and bigger bullet= more damage. A bigger, faster bullet will transfer more energy to you body, therefore will do more damage! Common sense. But in this game there have been no common sense applied. You should have built and balance your game around the guns but what they did is they tried to build and balance the guns around everything else. It's extremely annoying and made me quit several times since certain playstyles that worked in JA2 do not work here. Assault rifles for example feel useless peashooters while in reality they should be dominating they battlefield. Especially in mid range combat. I don't think I will ever finish the game.\nI do not want to play it because it stupid and annoying, instead of plesant and satisfying.\nWhere are the good Ideas from JA2? Shooting people on the leg make them fall and loose a turn has a real strategic value! Same as shooting them on the arm and making their gun drop. But in this game it's just percentages.\nGames like this also need a killcam or some way to bring the action closer to the player as one of the most important and satisfying thing in a combat game is when you defeat the enemies!\nJA2 had at least one limited but satisfying animation. I would like something like in fallout2 where enemies had multiple cool death animations. Guys literally sliced in half by your laser guns and slowly fell apart like in some cool action movie! But in this game the enemy deaths are quite casual. They just fall over and that's it. Sometimes their head explodes if you apply enough damage which you can't really see because they are far away, the graphics are a bit blurry and the camera changes back in a second.\n\nNice maps, art, models, enviroment and\nsounds, including the music. They usually fit the game and the setting\nSlight improvement on the characters and character interactions.\n In JA2 we already had a system for this but was very limited. Your mercs had a line or two to say and that's it.\n They somewhat improved upon this by making your mercs talk a bit more, during NPC interactions for example or they do chat with each other a bit, but it's sill limited to few sentences at most. You going to hear the same lines repeated for the rest of your playtrough. \nThey tried to give mercs some more personality in which they both succeeded and failed at the same time.\nSome of the mercs have changed, some of them for the better some of them for the worse. Some of them are really annoying, so this is a mixed bag and not the expected amazing improvement I've been waiting for.\nMercs were always an important part of JA but they shouldn't be the main focus to the detriment of other parts of the game, which is seem to be the case here.\n\nOverall not a bad try but not nearly good enough to dethrone JA2 1.13 and I don't really understand the very positive reviews. I guess people are starved for a half decent game after the metric shit ton of AAA failures and AI generated slop vomited in their general direction now days. But I personally think it does not worth full price. I bought it 90% off and I still have regrets.\n\nTo any future developer: MAKE JA2 1.13! But in a modern coat with mod support! That's the game we are waiting for for decades. You will make bank! You think it's not going to do well because it's too difficult and complex but the most complex and difficult games are the most successful ones. \n People love depth. People love a challenge. People love the tacticool.\nDark Souls, ARMA, complex, difficult games that are highly successful. Dayz, Escape from Tarkov etc...\nWe want cool action heroes, tons of guns and attachments, LBE, gear management, merc management, upgrades, strategical depth, tactical depth.\n It's hard to make a good game. It's even harder to make a good Jagged Alliance game. There have been many tries over the years and none of them were a real successor to JA2. Sadly, this one is not an exception either.\nA decent game yeah, maybe. \nBut not a truly good JA game I have been waiting for for decades!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game loves to take control away from you and limit your dialogue options to what the leftie communist developers saw as appropriate.\n\nThe music was great.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "absolute trash, trained mercenaries that can't hit a target in MELEE combat, from BEHIND, with the ennemy OBLIVIOUS. Guns ? 3 meters and you will somehow fucking miss. \r\n\r\nWhat the fuck is this shit ? make sense how this game costed like 3€ on instant gaming, no fucking shit. Play Wasteland 3 or litterally any other game, this shit sucks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terrible tacticool game.  ALL of the playable characters are silly and akward over characterization of lame 80s characters..  A dumb feature that some characters cant work with eachother.  Running around with farmer weapons but the badguys have fully automatic weapons that were obviously supplied by the US arms dealership company.   Can't create your own character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An unbalanced mess that i tried to enjoy. All i came away with is a migraine and hours of wasted time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game isn’t bad, but it’s not good either. I’ve spent countless hours playing Jagged Alliance 2 since its release—it’s one of my all-time favorite games. And the whole time I was playing the third installment, I kept thinking that I was wasting my time and would rather be playing JA2.\n\nRight from the start, I didn’t like the combat system in the new game. It tries to mimic XCOM, but completely changes the formula. In XCOM, you could win a fight without the enemy ever getting a shot. Here, the gameplay revolves around overwatch and stacking negative status effects. At the start, your mercs are weak and their weapons are terrible, so there’s no point in shooting for the center of the mass—the damage is just pathetic. The only real option is to aim for the limbs or try to land a headshot. And the whole combat system just feels \"gamey\", every encounter is like a puzzle. I'm just not a fan of that kind of gameplay. Of course, that only applies if you don’t clear out the entire location with stealth snipers. In that case, the fight might not even happen at all.\n\nThe difficulty curve is also a mess. Early on, even the starting island is tough until you figure out how the game works and find some proper guns. But once you do, it becomes way too easy—because you realize that out of all the classes, the stealth sniper and LMG support are the only one that really matters. From that point on, the game turns into a repetitive grind. By hour 30, I was climbing the walls from boredom. I ended up downloading a cheat mod just to finish the game faster.\n\nI started on the easiest difficulty with the forgiving mode just to get a feel for the mechanics, and even then, I had to restart several times just to build a decent squad. In JA2, you could hire a couple of expensive mercs and clear the early sectors. In this game, you’re forced to recruit a team of specialists because the devs decided they were making a CRPG now. They added skill checks in dialogues that can affect quest outcomes. And the quests themselves? Boring. I started skipping them almost immediately. If I wanted to read walls of text and do side quests, I’d play Baldur’s Gate.\nThen there’s the devs’ obsession with turning the game into a parody of action movies. Like I said, the dialogue is bad and not funny, and on top of that, there are endless pop culture references. JA2 had humor too, but it was never the centerpiece. By hour 30, I just gave up on the side quests. There are way too many of them, they’re not interesting, and tracking them with that horrendous UI is a pain.\n\nI also hated having to run around every location just to find some hidden stash or a bush with healing herbs. It would’ve been great if every item in a sector—no exceptions—was accessible directly from the stash on the map. That way, I wouldn’t have to waste time searching locations. But you have to do it—because remember it's a CRPG and you need to talk to NPCs to get new quests, and sometimes you can find good weapons that you can't buy.\nI know that in Jagged Alliance 2, items inside containers didn’t show up in the sector stash either—and I already disliked that back then. But at least in JA2, all you had to do was loot the chests. Here, they’ve added intel gathering, collecting medicinal herbs, and scavenging scrap for crafting on top of that. \nAs for Bobby Ray’s shop, which was added in patch 1.3.0—it’s a complete joke. The selection is always painfully limited, and there’s no way to expand the inventory through settings. It feels like a half-baked feature that doesn’t even try to be useful.\n\nThe interface is clunky—I had tons of moments where I clicked the wrong thing or didn't see the cover type behind the projection of the merk. I guess that’s the price of adapting the game for gamepads. The game is also full of junk that clutters your inventory—lenses, chips, tubes, all supposedly needed for weapon modding. Then there are random artifacts you have to turn in to a specific NPC, piles of different jewels, diamonds, and a bag of coins, which I never figured out the purpose of. It’s just unnecessary clutter.\nWeapon mods should be standalone items that can be equipped and removed. And all the useless junk should automatically convert into money. There’s no reason to force players to micromanage that stuff, and running around collecting trash gets old really fast.\n\nSome decisions the devs made are really questionable. They kept some of the outdated mechanics from the original—like the lack of hit chance and looting (and added more of that)—but removed features that actually worked well, like the simple aiming mode and proper weapon modifications. In other words, they scrapped what was functional and kept what feels obsolete by modern standards.\n\nThe maps are really small, maybe that’s why the devs removed hit chance percentages—because it looks ridiculous when a merc can’t hit an enemy standing two meters away.\nI constantly felt like there weren’t enough cover options. In XCOM, I can plan a route that lets me consistently move from cover to cover. In this game, I often didn’t have enough action points to reach the next safe spot. The maps may look pretty, sure—but they’re not functional, and all that visual noise ends up straining my eyes.\n\nThe only thing I genuinely liked was the music. \n\n[i]I actually had more fun playing Brigade E5, which was originally developed as the true third installment of the series.[/i]",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Warning to new potential buyers!\n\nThis game is abandoned by the developers and the multiplayer servers do not function properly anymore.\n\nFor days and weeks randomly, you will not be able to play multiplayer coop at all since their login servers turn off/crash and nobody responds.\n\nDon't lose your money to yet another THQ Nordic abandonware.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played JA1 and JA2 so I really wanted to like JA3. The plot was good. The corny voice acting was great. The quests had potential but were bugged and not finished.  The turn based combat was horrible. Terrible AI. Very few weapon choices. Unique weapons were boring. Poor in game economy. You end up with tons of parts, money, diamonds, and gold with nothing worth buying.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}