{
  "positive": [
    {
      "review": "The GAME ENDED FOR ME after the final shape expansion am finally free, it has been an amazing and depressing adventure.",
      "voted_up": true,
      "votes_helpful": 124
    },
    {
      "review": "Reason for thumbs up (conditional):\n\nThis is a free to TRY game, not a free to PLAY game. You are locked out of roughly 85% of the content if you dont spend money. However, I was able to grab the legacy collection bundle for 90% off (~$8 and change) about a year ago and at that price it is definitely worth it. The graphics are good, sound and music are good and the moment to moment gameplay is fun. I got a couple hundred hours of enjoyment out of it before I stopped playing. You can make this game as sweaty or as casual as you want to make it. In conclusion, if you can get the legacy bundle on the super cheap (epic store has this bundle listed for $11 right now) it is worth it. However....\n\nReasons for thumbs down:\n\nDO NOT PAY FULL PRICE FOR ANY DESTINY 2 CONTENT. Bungie is arguably one of the worst developers on the planet and these days there's a long list of terrible gaming companies and it takes effort to be at the top of that list. They are most known for:\n1) Deleting paid content from customers. They call it \"sunsetting\", most call it theft and false advertising. \n2) Plagiarism multiple times. Most recently for marathon art and a huge settlement on \"sunsetted\" content.\n3) Ridiculous corporate greed with predatory MTs, predatory in game currency structures and pay to win bs.\n4) In game advertisements and pay walled content.\n\nNegatives for the actual game include the most disorganized \"story\", if you can even call it that anymore, I have ever seen as the first chapters of said story were deleted from existence with the whole sunsetting robbery. They literally have a timeline section in the game, that is buried in menus, to explain the actual sequence of events. 99% of players will not see this and play the different campaigns out of order so none of it makes sense. I thought I was doing it in the right order and I very much did not. The new player experience has to be one of the worst in gaming. Tutorial pop ups at every turn that explain how to shoot your gun, that never go away and will still pop up hundreds of hours into the game but no detail what so ever about incredibly important in game systems like weapon and gear moding. It contains what has to be the worst \"journal/quest list\" in gaming. There will be times where you are completely confused about what the game wants you to experience. Sometimes you will even know what you want to experience and have absolutely no clue how to access it. At times it feels like a menu simulator and the in game group finder is a disaster to the point were the community has all resolved to using 3rd party apps for it.\n\nSo, the thumbs up is conditional. If you can get most of the content for under $15 total, get it and enjoy it. Its fun. If you cant get a deal, try out the free nibble of a game until you get irritated with all the pay walls and ads and be done with it. Rob them like they robbed their customers. Hit it and quit it for free.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "I first learned about this game from my older brothers and cousins. When it was released, it was iconic — I was 16 back then, and it was my dream to play it. Now I’ve finally achieved that dream, but alone. My brothers and cousins have grown up and completely left gaming behind. Damn time… but this will always be the best game in my memories. ❤️😔",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "The only game that hooked me up for so long.\r\n\r\nI won't say the game is best at the moment.. There are up and downs.. Every game has them.. One or the other season/expansion may be bad..\r\n\r\nJust hope for the best with upcoming Expansions",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "This game is definitely a lot more fun if you've got friends to play it with. The game may only be going downhill from here on out, but I still enjoyed the time I had with it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A brilliant game my only problem with this is the dlc licences don’t transfer between platforms like they would on free games like Fortnite",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "story is good and we finally got a good chunk of new weapons, its a good mix between destiny and star wars",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Destiny 2 is gorgeous, fun, frustrating, addictive, and confusing — all at the same time. It’s a game you leave, then return to, then leave again, and somehow you still miss it when you’re away.\n\n8/10 — outstanding gunplay with a love–hate grind.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Returning player. A little overwhelming starting back from scratch, but they've introduced a lot of great catch-up mechanics. Hope Renegades does well!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Renegades is overall very good but to the person who made the exotic mission, i genuinely hope that you step on a lego brick every hour, every day for the rest of your life",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bungie is actively trying to kill the game, but we will prevail.\nDelete the Portal pls.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "There is probably too much to really write in what would actually be an interesting and informative review for D2, but the short of it is that the game is currently going through one of its worst states of being yet i still can't find anything on the market place that can be enjoyed anywhere near as much as the fun i've had in this game. \n\nIf you're completely new it has a difficult learning curve that isn't helped too much by the developers. It is recommened that you join a friend who has experience to guide you early. It's also currently trying to keep alive both new and old systems of the game to appeal to both veteran and new players alike but neither playerbase are feeling satisfied.\n\nMicrotransactions (in the form of cosmetics) are honestly very fair in this game. You can absolutely earn yourself a lot of Brightdust from casually playing the game consistently, but playing as a free player is not the recommended experience, You will be locked out of certain activities, loot, and full world experiences due to paywalls however the DLC regularly goes on sale for around 50% off and at that price is worth it, especially if you dabble in end game activities like raids and dungeons (some dungeons are on a seperate paywall that requires silver and are only purchased in game). I would say the pay-to-win experience is limited but it is there in the form of the paid season pass tree. Previously it minimally impactful the game before Edge of Fate. I personally don't consider owning additional expansion pay-to-win (barring New Land Beyond and its ties to Year of Prophecy)\n\nI still recommend this game to everyone because the Raids and Dungeons blind is some of the best gaming experiences out (3 raids and 1 dungeon are free). The problems are glaring and are hard to ignore but the people i've met in and out of the server and the experiences shared can't be match anywhere.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Destiny 2 may not seem like it but it is about a toxic relationship between you and the game, where the more you play the more you'll dislike it but when you stop playing it you want to play the game again its like crack almost.\n\n i hate it and want 1200+ hours of my life back bungie.\n\n12/10 game would recomend!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the game is fun when you don't have sweaty reddit nerds whispering in your ear",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Destiny 2 is one of those rare looter shooters that can completely pull you out of the real world and drop you into an unforgettable sci-fi universe. Whether you’re diving into intense firefights, exploring beautifully crafted worlds, or experimenting with different subclasses and weapons, it’s incredibly easy to get lost in the flow of the game.\r\n\r\nThe build variety is where Destiny 2 really shines. There’s always a new synergy to try, a new exotic to chase, and a new playstyle to master. Whether you enjoy fast-paced run-and-gun gameplay or more methodical ability-driven setups, there’s something here for every type of player.\r\n\r\nVisually, the game is stunning, especially on an OLED monitor or TV. The vibrant colors, deep blacks, and dynamic environments really bring Bungie’s art style to life. From neon-lit cities to vast cosmic landscapes, every location feels immersive and polished.\r\n\r\nDestiny 2 is a fun, engaging escape with endless replayability. If you’re looking for a game you can sink into for hours at a time, build your perfect Guardian, and enjoy some of the best visuals in gaming, this one is absolutely worth jumping into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took the dev team a bit longer than I'd like but they're finally pushing the game in a direction better than EoF, it could use a few changes here and there tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game.. but if you buy the latest expansion it should give you all the old content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive been around destiny since the beginning, I think this game is a must for anyone who loves sci-fi/ fantasy. I love the overall atmosphere and the story and lore, not to mention the over the top weaponry. This game has gotten me through a lot of hard times in my life it. This is a game where you can lose yourself for hours. I highly recommend this game in all sincerity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily the greatest and most fun game I've ever played at its peak. From buying destiny 1 at release at 11 years old to the beginning of this game at 15. Playing day and night on xbox with school friends to playing season of arrivals in covid the golden years grinding blacksmith, shadow and reckoner. Farming SOTP and crown for days on end. Putting 1.5k hours throughout COVID. From being a bottom of the barrel pc player to a 2kd trials warlord and raid farmer. Playing all the way up to the final shape arguably one of the greatest DLCs they made however as the year went on the fact that they put this game on the backburner became very prevalent. Praying this game can have a resurgence. North Clan co owner. Also, be very careful what apps you have open otherwise you may receive the hammer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, great cutscenes/visuals and an engaging story, but dont play this game unless you dont mind sinking your life into it :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun, played this for quite a while on console before moving over to EPIC and then on Steam. Haven't played the last 2 or 3 DLC's. Have a lot to catch up on but Renegades has brought me back. Only heard about it this last week and being a big Star Wars fan I had to give it a go. So far it is great fun! It almost feels like this world and lore in Destiny 2 was always there. Yes there are some obvious hints and music call backs to star wars but Bungie have made Renegades its own thing. Which I think is great. Plus that the Praxic blade (Lightsaber) Isn't so easily attainable is great too. Glad to come back and dive on when there is time between other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This review has been made during the Year of Prophecy's second expansion, Renegade. Would I recommend Destiny 2? Yes, BUT... not for disgruntled veterans of the game and only for new players that are patient with self-control. This review is specifically aimed to explain to new players my thoughts of this live-service looter-shooter MMO. If you plan on dipping your toes into Destiny 2's free-to-play economy as a test drive then expect the game to demand you to play at your best and learn the mechanics, and I will explain which game expansions are worth buying close to the end of my review. That aside, I will explain the gameplay expectations, the pros and the cons of this game series.\n\nI would describe Destiny 2 as a sci-fi first-person (sometimes third-person) looter shooter where you cast magical abilities on cooldowns. To brief you on the the gameplay, you will be doing specific activities to obtain specific gear like weapons and armor pieces. Most of the time you will be doing short repeatable missions or battling other players competitively in order to grow power equipment and watch your level go up. There are three main classes (the Titan warrior class, the Hunter rogue class, the Warlock mage class), and you start with three swappable light-infused subclasses. You will be using weapons with their own elements like the neutral Kinetic element, the three light elements (Arc, Solar, Void) and the two dark elements (Stasis, Strand). You have three weapon slots which are your Kinetic slot (Kinetic, Stasis and Strand only), the Special slot (Arc, Solar and Void only) and the Power slot (any element using heavy ammo only). Along with your weapons your character will have rechargeable abilities that are the grenade ability, the melee ability and the class ability (Titan barricade, Hunter dodge, Warlock rift) depending on the subclass element. There are character modifiers such as subclass fragments, exotic weapons and armors that can change your playstyle on how you battle enemies or other players. You will be traveling around the solar system battling a multitude of alien races on various planets with their own special attacks and tactics.\n\nI will start with the pros. The biggest factor of Destiny 2 is honestly the gameplay loop, graphics, sound design, and the world building they have set up. The opening tutorial does a good job getting the players settled into the world with a brief introduction and getting them into the action immediately. The game feel of your weapons and your character powers feel incredibly good in terms of reaction, special effects and even the audio sounds. The game is damn beautiful even on a middle-tier computer since it was designed for the PS4/XBO era of game consoles with amazing cinematics and fantastical environments. While I can't remember any specific music in this game to hum to, the complex score is an astounding orchestral ensemble that always sets the appropriate mood for any story beats and atmosphere. This game is great for those that want to get invested into the world of Destiny with the myriad of survivors, foes and profiteers. You'll definitely find some characters you will like but that depends on the campaigns you pay for. This is one of the few games where you can navigate most game menus WHILE loading into a social space or mission so you can optimize your wait time with changing your equipment or organizing your listed tasks at any time. While the stories can be good or tolerable, the game is at its best with the three-man dungeons and the six-man raids (majority of them are locked behind purchasable specific Dungeon Keys or deluxe editions) that will test you and your companion's competence, coordination and communication.\n\nNow this is the part where I criticize this game's recent development and its core design. Destiny 2 has a very predatory monetized system when it comes to paid content, and it plays heavily into your fear-of-missing-out. The free-to-play content is very barren outside portal ops and player-versus-player modes. This game does a terrible job teaching players the overwhelming ability mechanics requiring knowledgeable folks that can explain them otherwise you will be fighting inefficiently or getting lost on what to do next. Timed tasks take a while to complete so if you are not a very active player this game does not respect your time and you will miss out on certain rewards. All of your characters in your three character slots do not share the story progression meaning anytime you want to use any expansion subclasses on a different class character you must replay (or pay for) that character's progression and additional ability unlock requirements. If you want specific cosmetics equipment without buying premium currency on horrendously priced cosmetics be prepared to either grind for a different cosmetic currency and wait on the weekly-rotated cosmetic section. As of this writing the player-versus-player game modes are sometimes filled with cheaters despite the BattleEye anti-cheat software being in place.\n\nThis section is just a middling heads-up. This game is hard, sometimes unfair, and that can provide a great challenge for those that invest in learning the mechanics and level designs. Destiny 2 has a free-to-play battle pass that provide resources and a paid battle pass which awards better resources as well as cosmetic items so you will have something to work towards to most of the time but at the end of the day it's padding for FOMO players. The game developers make controversial game design decisions periodically such as sunsetting expansion content and player gear though hopefully they stick to their word that they are done messing up player's inventory and their sunken time. Expect to ditching your outdated overpowered gear on occasion.\n\nIf you enjoyed the free-to-play experience of Destiny 2 and had to pick only one expansion, I recommend The Final Shape expansion which contains the fantastic finale of Destiny 2's main storyline (you should use the timeline tab to review all the summarized expansion details if you don't want to research online for the whole story) AND it gives all of your characters a subclass that allows you to mix multiple yet limited elemental abilities. If you want to invest into more subclass options then pick up the pleasant Beyond Light expansion then the divisive Lightfall expansion in that order for the other two darkness subclasses for your characters. I cannot recommend the gutted Forsaken expansion nor the 30-Year Anniversary pack but to only the diehard players as it only awards outdated legendary weapons and a few relevant exotic weapons. I do not have an opinion on the Year of Prophecy expansion but I know it contains two moderate-stakes campaigns that has the player base in an uproar. By the way do not bother picking up the standard editions of any expansion passes or else you will not get that expansion's dungeon key (additional dungeons and raid events) which can be bought separately at the premium shop, and it will be overpriced in comparison.\n\nMy closing thoughts is that Destiny 2 while having a lot of content can have very annoying gameplay mechanics that really need to be fine-tuned. Even if there are a lot of flaws, it is at its core a fun game that's always evolving with the community for as long as the servers are still online. The game expects a lot of your and your friends' knowledge, reflexes and cooperation to get the full enjoyment out of this series if you can push through some bad game design decisions and negative reputation but it is worth the rich world, presentation and stories it has built for the past 8 years (as of this writing). Regardless how anyone feels about Destiny 2, it is undeniable that it's a one-of-a-kind gameplay philosophy that no other games have successfully replicated and dethroned this sci-fi looter shooter...yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will ruin your life, I love it. Nothing matches the gunplay and you just have to accept that. 10/10 will play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "switched platforms from xbox been playing since taken king, still a fun game but fallen far from its prime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like the game content, but their monetization strategy sucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game makes you feel like an alcoholic; you know it's bad, but you can't quit the addiction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE GAME OF ALL TIME. If you don't play this game, keep it that way. Don't touch this game for your own good. If your already stuck in the loop. Goodluck gng. There's no escape for us.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it and hate it, couldn't get away from it even after getting of of consol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although this game has it's ups and downs, the nostalgia and newness of the game always gets me coming back! I see the potential this game has to keep growing and to get better and hopeful they'll deliver and reach a point of stability that's good for the community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THE GAME. Its very interactive and I enjoy playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m a big lover of the Metroid prime series and most FPS gaming, and this hits the nail on both heads but leaves a lot to be desired.\n\nSolid 8/10 I recommend\n\nIf they just had a rougelike or “risk of rain 2”-like mode, people would play more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, i have been playing wayyyy too much, like 4000 hours on my ps4, ps5, and steam accounts in total, sad that its kinda pay to win nowadays and that edge of fate brought bad qol updates, but still good in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game I can never put down even after 10 years it's still the best despite its rough times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, been playing since D1.  Has its ups and downs but overall good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played since 2017, came back this year, really ain't as bad as people make it out, but portal is ass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Words cannot explain this game. The Pale Heart Campaign was so good. Destiny 2 is the best game i have played in my lifetime. Highly recommend playing this game. Just make sure to save up for The Pale Heart expansion pack.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Destiny 2 ist mein Lieblingsspiel, ich habe bereits über 1000 Stunden darin verbracht (Crossplay). \r\nDas Spiel hat zwar seine Höhen und Tiefen, aber es gibt immer etwas Entspanntes zu tun. \r\nGenau das macht es für mich dauerhaft motivierend und angenehm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The core gunplay is the best in the business. Shooting anything in this game feels phenomenal. But Bungie has turned it into a part-time job. The cycle is exhausting: grind for new gear to increase your power level, only to have it sunset or made irrelevant. The \"content vault\" where they remove paid expansions is still a massive point of contention. The story is now locked behind a paywall every three months, and the monetization is aggressive. It's a beautiful, incredibly fun game trapped in a predatory live-service model. I can't in good conscience tell someone to start now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent multi-player game.  Many cool abilities to use as well as weapons and armor to collect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing Destiny for a long time (probably too long) and I know it is in a bad place, that said, it can still be a lot of fun with friends, even if it isn't what it once was.\r\n\r\nI'm especially looking forward to Renegades!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun but also pretty boring on the long missions, like those ones where you gotta like kill all of the people then go to the next combat zone like 4 times. pretty annoying imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is great. there is a ton of content if you are new to it. i just wish that bungie offered more in game incentives like earning shaders and weapon and armor ornaments that actually look cool without buying silver. because it takes so much effort to constantly grind all the time. They also need to offer newer content. there is alot of worlds in the game but they are from older stuff so there isnt really a need to go there which really sucks. I feel like there is so much potential but the company is lacking. Since i play without people and we are all of different levels it would be nice to have some sort of trading system. there are so many \"God Rolls\" that i get that I just delete because i dont like to play with certain weapons yet my clan mates have tried and tried and cant get those. It would give people motivation to keep playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i just love the game it brings back memories and you get to chose who you  want to be in game you got to love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Destiny 2 is probably the best FPS MMORPG I've ever played. It has the best gunplay and movement out of any game I've played. The loot chase makes it so addicting and the art style is just gorgeous. While Bungie has made numerous mistakes, and a lot of the expansions in the past couple years have felt lackluster (Aside from the Final Shape); the game at its core is still fun to play. Community sentiments have been really sour these past few years. But, even when it's bad, the gameplay and friends you make along the way will have been worth your time. Hopefully Renegades exceeds expectations. It may be Bungie's last shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's been going strong for nearly 12 years now—pretty impressive, right? What other games are still holding up this well? It's a great game, though like any game, there's definitely a bit of a learning curve. But don't worry—just hop onto YouTube, check out some tips from top streamers, and you'll be slaying in no time! Hope to see you all out there, Guardians!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and great gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games. its amazing the community is dope and that makes the content and gaming even more better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game but sad that the DLC's are needed to unlock the other 2 powers stasis and vine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best shooter games ive played. if you enjoy min/maxing your character then you would love it. great gunplay. also, theres a triple jump, so you have to play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty fun game in my opinion. I played Destiny: The Taken King on PS3 which was the first Destiny game I played. I enjoy the Halo style mechanics crossed with a Borderlands free roam style of gameplay (Halo fan here.) If I had more time I would definitely grind an account on this game but it's definitely an addiction-prone game for sure. Pretty much Bungie's version of Borderlands. \n\nAlso, it's a free game. Why not?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time. one of the best games imo opinion ever made. love both PVE and PVP, especially the endgame, the Weapon-, armor-. abilty-design and the buildcrafting potential. this game changed my life for ever. gonna play till the server shut down. (on steam it shows maybe 5.5k hours but i swapped from psn so i have over 10k hours in this game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much. I highly recommend you getting this game. If you've already played this game get back into it by Renegade's!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been a player since day one Destiny 1 and while this game certainly has its ups and downs, I love the story. Kind of wish they stopped after The Final Shape, but eh, whatever. The gameplay is grindy or sure, but its nice to sit back and play something that doesn't feel like I have to spend countless days of my life to get anywhere or get anything. Sometimes, the grind is nice. I think its a great game with lots of potential, as long as bungie gets right with the Sony Gods\r\n\r\n--Peace :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Peak, cant wait for Renegades to bankrupt Bungie and for the game to get shutdown by the Elder Gods which is Sony. Peak game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has over 1k hours in this game I'll tell the truth, the game is good\n\nIgnore those long ass review, if you think the game might be worth a try the answer is yes, mostly because there's so many free things right now that there's almost no need to buy anything unless you're really invested. My advice is, if you're interested in this game download it, play the tutorial, do the free campaing on the moon and some portal activities and decide if it's worth your time and money... also you can get free skins and cosmetics by saving up a resource called bright dust",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "According to some people's reviews, the developers have given up on the game. After playing a few hours in this game, I can't say anything yet, but I will say that I like the game. I will play more and then update my review",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish bunji just undos all the edge of fate changes in power stuff and adds a duel wield function\r\nother that that i love the shit out of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Destiny as a whole has been my favorite game series of all time.  Yes it has had it's ups and downs but it truly is one of a kind and although there are other games out there that try to mirror the success of destiny, none have been able to replicate what Bungie has created.  I can only hope that this game can pick up momentum again and be around for many more years to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like how there are so many different things to do in the game. I don't \"grind' this game. However, even the people who do always have quests or something to do. The expansion packs are great for the money as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Say what you will but Destiny 2 does what hardly any other games can do. PvP weapon gameplay controller/mouse feels amazing. No other games for me has this feel. The exotics, the weapons, trials of osiris, Xur, is all so special. They care more for the PvE obviously and the raids are epic. The game is over 6 years old and now people are saying it sucks. They have done a lot of good things and bad things. But at the end of the day for me....this game is home. Star Wars crossover coming next is freaking sweet. People hating just to hate. Pick this up for free and enjoy the content. If you fall in love with the game support it and buy the expansions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing since D1, has changed into a DLC simulator! This game not only takes your money but it takes you will to live... I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game to play with friends or just to wtach gameplay would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as much as i hate this game mainly bungie i love it and if more people played and bungie actually hired more people to focus on this game instead of marathon it would be great again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "36 hours of amazingness i love this game one of my favs  also such good grafics  (srry if i spelled graphics wrong) i think its an amazing game also im pretty sure its free so heres a summary free like fortnite 3rd person shooter (i think) deserves best game of the year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After thousands of hours and thousands more on console, I can tell you this is the best first person shooter ever made. The gameplay is so snappy and polished unliked any other game made. The loot and builds and guns are just so good. Then the raids, man the raids. Getting together with a team of 6 people to beat a very challenging mechanics and combat raid that takes 6-10 hours to beat to finally get the best guns in the game, the best experience out of any game I have ever played. Truly, special. \n\nThat being said, Destiny 2 is dead. That is why I gave it up. I literally built a $4K gaming PC just to play Destiny 2. It kills to me to say it but it is dead. Management decided to dwindle away their money and waste it on random projects and CEO car salaries instead of investing into developing Destiny 3. Then the bugs, man oh man the bugs. The biggest one by far was \"WE DO NOT WEIGHT ANY WEAPON DROPS. IT IS PURE RNG, WE PROMISE\". 6 years later, a scientist discovers with a math formula that the weapon drops are actually weighted and have been for YEARS. That is right, for YEARS people were grinding for thousands of hours and often times the drop they were trying to get was bugged at a 0.00000001% of dropping. Bungie FINALLY admits the math is correct from this scientist and their was a bug messing up the drops for the last 6 years. Oops. \n\nI know first hand, I took a week off of work trying to get an adept palendrome with Rampage Outlaw and spent over 204 grandmaster completions with a buddy and NEITHER of us got a single drop. We literally played 10 hours a day for 6 days straight and not one drop. I knew something was wrong with RNG but people just told me \"stop crying, it is RNG\". Turns out, it actually was a HUGE bug in the RNG that wasted all my time. Haha\n\nHowever, Sony just paid 3 BILLION dollars for Bungie, they aren't just going to let Destiny die for good. They want to make their money back. They will put D2 on life support and force bungie to develop D3 which will take 3-6 years. Then one day they will come back with D3 to recapture all fans and new ones and that will be the day I jump back in. But until then, it is done. I realized it one day when I was trying to do the newest raid, I waited for hours and couldn't find a team of 6 people to run it. Then it dawned on me that the game was actually dying. The numbers don't lie, people like me have thrown in the towel. \n\nRIP the GOAT D2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a FPS this game has amazing gameplay. Content is always going to be the sticking point with Destiny 2 so if you don't like repetitive grinding, then don't play this game. In fact don't play any active service game. Destiny 2 provides a challenging and fun environment for active and new players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was 10/10 playing it throughout the years of the games evolution.INSANELY FUN WITH FRIENDS! I'm sure if you pick up the game for the first time you'll still enjoy it<<<<<<<<<<",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is pretty fun and engaging due to its rich lore. however, developers keep missing the mark with decisions that affect the future of the game,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game one of the best ive ever played easy to play but really cool and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game hasn't been having the greatest content in terms of the most recent stuff that's come out but the game is still extremely fun to play. finding a new OP build every once and a while out of millions of possible builds is a feeling that never gets old. Overall, this game is still increadably fun and I highly recommend getting it if you haven't played it already, I just hope bungie locks in for the content going forward. \r\n(P.S: if you need help getting all the DLCs, I'd recommend using websites like cdkey's and instant gaming. they have increadably low prices and have not failed me yet)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun shooter game little difficult when you first get started",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even after being away from destiny 2 for like.. a decade? it is still an undeniably fun game. Is it perfect? No. Is there any other class/ability shooter that has ever felt this good to play? Also no.\r\n\r\nHow borderlands continues to exist is truly baffling to me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played this game since I was about 14, ever since the first Destiny came out. It was an amazing game overall, and I spent so many hours on D1 and D2. I made some good memories and friends while playing. I eventually stopped because of the paid-to-play system, it just ruined the experience for me. I really wish I could’ve afforded the expansions and seasons back then, because once I stopped playing, it just sucked.\n\nNow I want to play again, but I’m still faced with how much I’d have to spend just to get back into the game. They pushed out expansions, dungeons, and seasons so quickly that it was hard to keep up, especially when I couldn’t play Trials. That’s when I really quit. I didn’t have the expansion at the time, and being locked out of Trials because of that was upsetting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like it the fighting is good pvp is not good at all but overall except some bad decisions made from bungee from time to time it is an awsome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing Destiny since the PS3 days, and despite all the changes over the years, I still find myself coming back. Not because I’m invested in the story (honestly, with all the DLCs and lore dumps, I’ve completely lost track of what’s going on) but because the gameplay still delivers where it counts: smooth, satisfying shooting and fun multiplayer modes. These days, I mostly log in for Gambit and Crucible. They’ve always been my go-to modes for quick, competitive fun. That said, it feels like Bungie has trimmed down the options recently, and I miss the variety we used to have. It’s a bit of a bummer, especially when you’re a returning player looking for familiar playlists.\r\n\r\nThe game still has that addictive loop and tight gunplay that made it great in the first place. It’s not perfect—far from it—but if you’re just looking to hop in, shoot some aliens (or Guardians), and not worry too much about the narrative spaghetti, Destiny still scratches that itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to play with friends easy controls a little yappy in the beginning but still fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I been a destiny player since the og loved it as a teen love it pushing 30 tap in play the game you wont regret it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been a favourite ever since i played Destiny 1 on PS3. I will agree that Destiny 2 recently has been really bad especially with content being lacking and boring and ESPECIALLY \"grindy\" but nothing is perfect and \"live\" games will have ups and downs in their liftetime.\n\nIf you have the money and want to get into a game like Destiny 2 then i highly recommend it. The reason i say \"If you have the money\" is because you kinda need all DLC's and Dungeon keys to be able to keep up with meta and get the sutff u want but other than that i highly recommend destiny.\n\nDestiny will always have a place in my heart and i will always continue to play destiny no matter what happens (even if im forced to play more crucible with shit netcode lmao) and who knows i might even go back to destiny 1 just to play wrath of the machine one last time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As an fps? Its a fantastic game. Sadly this game is one of so many that started beautifully and has had corpoleeches try to drain any resource they can out of it. It's a fun game but it pushes a lot of micro-transactions at you and other things like keys to access new dungeons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so i usually played on other platform--epic but i wanted to say whats happened to this game? i mean i 1st played it about 4-5 years ago and it was amazing...but now?? dont know! still ok game to jump into now n then for free but moore then that is just a HUGE ?\n\nPlay it for free...dont buy stuff due to just not worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game ,but please make more missions , i m stuck doing same 10 missions every time i play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great game with a lot of content to play if you got a lil cash in your wallet.the game has its ups and downs and tbh a pretty whiny community but i always come back to it i have 1400 hours on playstation and still have much too do so if you need a game to dump yourself into here it is or go get warfame if you want a cheaper alternative that is also amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story line is incredible and if you like shooting games and have patiece i recommend this game to you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a fun enjoyable game to play with your friends lots or ways to buy new opportunities and still fun for free packages overall get the game i trades fun for storage and i know the community will help you on your journey through the stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Combat is fun and engaging, supporting just about any play style. The rapport between the community and dev team is one of kind, both trying to make the game better. The story is great, adding a nice depth to what makes the game special. Easily in my top three and well worth the investment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good I suppose. Don't play it if you value your free time, as this game might just consume you and your wallet.\r\nFree to try but if you plan on playing long tern you will eventually spend money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Heres the deal: the game has a lot of ups and downs. Honestly its hard to tell a prospective new player to try getting into it cause theres a lot of road blocks and plenty of things that many people (myself included) will complain about.\r\n\r\nTo start off here are the warnings for Destiny 2:\r\n\r\nEvery other update bungie is going to make a change no one likes, in time said change may become bearable or even enjoyable but typically they start out being inconvenient or annoying and we just have to hope they will make an additional change for the better.\r\n\r\nThe first 3 DLCs plus the original red war campaign were sunset and are no longer playable. Which is a big negative cause the Forsaken DLC is to this day considered one of, if not the SINGLE best DLC this game ever had\r\n\r\nFurthermore if you want to get into the end game content and high level play you can expect to need to dedicate an absurd amount of time to this game, as you would with any MMO.\r\n\r\nBut for the few that can stick around long enough and get into this game, it also has a lot to offer:\r\n\r\nPersonally I think this game has the single best PVE gunplay I have ever felt in a game, ESPECIALLY for a looter shooter. The recoil feels reasonable, the control and damage values arent too over or underpowered in almost all the content, the enemy designs feel well thought out and intentional and most of all combat in this game is never boring, and if you think it is: its probably time to try a new build out pal :) (Side note: I dont like the pvp combat in this game but Im also just bad at it ;-; )\r\n\r\nAdditionally the movement feels clean, the abilities and build crafting are done wonderfully, the exotics all feel truly unique and almost every one of them can have a unique build solely focused around them. \r\nThe Dungeons and Raids feel (generally) well planned and I enjoy a lot of the mechanics and puzzles they use in them and the coordination it requires. Admittedly this used to be more of a detriment but with the new systems bungie has implemented finding a group to play with has never been more streamlined. \r\n\r\nMy honest advice to anyone who wants to give this game a try: try out what is available for free to see if you like the way the game feels, if you do: try picking up a couple of the older DLCs for cheap (Id suggest starting with Witch Queen, its a fan favorite) and see if you like the way the campaigns feel. If you do, I think you may just be a future Destiny 2 Player and if not, worst case is you tried a free game you didnt like. \r\nGive it a shot, It cant hurt :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dope game i just started and cant really understand the hate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After scrolling through reviews and seeing so many negatives that said the same thing, I feel the need to point something out. So many negative reviews are from people that don't recommend this game because they have spent thousands of hours playing this game and it just isn't making them happy anymore for whatever reason.\n\nDo people that put hundreds or thousands of hours into a game do so because they don't like it? If those same people had never seen or played Destiny before, do you think they would feel the same as a new player? Well, I AM a new player since I gave D2 a try for the first time about 4 months ago, and I have been addicted since. The story may be the most obtuse I've ever experienced, but all those complaints about how things were removed and changes were made and blah blah blah I have no basis for comparison, so I have no reason to feel cheated or betrayed. I may not be able to follow the story as well as those that have been playing since D1, the bottom line of ANY game is this: Is it fun to play? Yes. HELL YES. I don't think I have missed a single day since I \"got it\" after a rocky start.\n\nNow, these reviews are to help people decide whether or not they should give this game a try. Do I recommend this game to someone that has never played it before? Oh absolutely. I'm not writing this review along side other people that have already put in years playing this game to whine about what it used to be, I'm writing this to the gamer that is curious about Destiny 2 but never tried it before.\n\nThere's something you need to know going in. This game is NOT kind to brand new players. The game, the community, even the youtube videos you WILL be watching for help at some point, they ALL talk to you in language you will not be familiar with and it will take time to understand. There are going to be people out there that are going to get too frustrated and they will quit, which I understand, but for those that are willing to put in the time to get past the noob hurdles, it is SO worth it, I promise you. This game has been going for almost a DECADE for a good reason. I kid you not, Destiny 2 has the best gunplay of ANY game EVER made, full stop period. And when I got frustrated at the beginning of this game, I looked EVERYWHERE for a game that had gunplay as good as D2 but it didn't exist. Borderlands was close, but still nowhere near the feel, the sounds, the overall satisfying EVERYTHING about the gunplay in this game, so I came back to it and started over, which led to my daily addiction of playing this game now that I \"got it\" (which is the best way I can describe it).\n\nStill unsure about whether or not you should try this game? Here's the best part: IT'S FREE to an extent. There a multiple expansions, campaigns, etc which you can usually find bundled together for a VERY big discount all over the place, which for me was WELL worth it to get almost a decade's worth of content for less than $20. And that's not the end, there is STILL brand new content being released now! The most recent expansion was released not too long ago and there's a Star Wars inspired expansion hitting next month! These new ones come at new game prices, but if you're new to this game, you will be busy for QUITE a while going through so much content there will probably be discounts by the time you're ready for it.\n\nSo yes, I recommend this game. You can listen to the people that have played the game for years if you want to but ask yourself why they would put so much time and energy into a game they DON'T recommend. Few games will allow you to play for free to make up your own mind, so I'd suggest taking advantage of that. See you there, guardian!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you loved Destiny 1, you'll have a love hate relationship with this.\n\nYou'll love it because its still Destiny right? But you'll hate it because something always feels off and the same... like you've played it before.\n\nAlas, this game was my childhood and memories last forever, nothing beats getting on the game with a fire-team and completing a raid. Be well Guardians.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i want to say after the last updates the fun in destiny 2 is back cuz now the game giving tire 5 weapons and armour for free which normal ppl like me can get easy without farming all day long is so nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have this game on xbox and on pc, played it mostly on xbox, all I'll say it's cheaper to maintain a bmw than to buy all the dlc for this game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far the game is very enjoyable, im only 20 hours in so it might be hard to tell as of right now but the game is very good. it was confusing at first but then you realise theres not as much to the game as you originally thought and everything gets simplified.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a nice game its very fun to play and i love the animations and everthing about it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, good to spend some evenings with your friends, not worth the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "micro-transaction after a certain point became main thinking and took out payed for content and pricing was just awful gave up after the first light reset. will never trust a game by bungie ever again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, well, well, tired of brain-rot games that have it all mapped out for you? Destiny 2 is the game for you. Utter chaos, some of the best FPS mechanics I've had the joy of sucking at!\n\nHell for new players (like me). An experienced player as helping hand is HIGHLY recommended. Search for in game chat and official/reputable Discord servers for HALP / LFG! Seriously, this is a social game and requires teamwork and is a lot of fun if you go the right mindset (laugh, cry, scream at the screen...but, disable voice chat as it's enabled by default). \n\nWhat it takes to get into it imo:\n- Potato PC\n- Curiosity\n- Lotsa time and patience\n- Alt tabbing to google stuff\n- A functioning brain-cell\n- Coordination\n- Reflexes\n\nI'm still confused af ngl.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played D2 since Shadowkeep launched in 2019. There has been ups and downs, excitement and exhilaration. Lately, there seems to be more disappointments for some, which I don't understand their point of view. I took a break for a year during the Heresy time frame and came back during Ash and Iron (Edge of Fate) and I am enjoying it. There is no other FPS game like Destiny 2. It is good even when it is not great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "they just make it worse and worse the more they touch it.\n\nbuggy crashing low fps mess. now youre always lvl 1. gg.\n\nmeh.....just give us destiny 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played this game fopr countless hours a couple years ago, every single night with my dad im 17, own a buisness, go to an automotive school and highschool at the same time and i HAD to find time to start playing this game again and it was worth it....",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "So if you want to support a studio for years and believe in their game, spend hundreeds of dollars on it even in its worst times, only for them to cut thousands of players from it, including you, without any explanation, reason or a refund, than this game is 100% for you. \n\nBungie is a shameless moneygrabbing studio. Tapir yourselves.",
      "voted_up": false,
      "votes_helpful": 407
    },
    {
      "review": "I think I would rather chemically castrate myself than recommend this game to someone in good faith.",
      "voted_up": false,
      "votes_helpful": 265
    },
    {
      "review": "This game was magnificent once, you know. Bungie should have walked away in 2020, while people were still applauding. But they insisted on milking it dry for profits and Pete Parsons very basic taste in classic cars.\nI discovered Destiny in those years when Borderlands 2 had grown stale as yesterday's bread. And one boring day in school,  before me opened a pure greatness of game universe, that is a cathedral of a game design. A space western without tacky laser cowboys. Futuristic industrial design – sublime, functional, memorable – fused with magic that felt real and harked back to magic lore and mythology of our real world.\nThe first cracks on facade and mold in the basement appeared in Season 8. Patchnotes. \"Shake up the meta,\" they proclaimed, as if a hurricane in a china shop constitutes strategy. Massive damage nerfs to weapons and unique traits of armor.\nSunsetting... that was the moment when the roof caved in and walls began to bulge. They took our weapons – not just items, you see, but time made tangible. Hours of our lives, god rolls we treasured like family heirlooms... all discarded with a corporate smile about \"player experience.\"\nAnd then – slow rot. Content became faceless. Witch Queen briefly lit the old light in the windows, Final Shape reminded us what this building could have been... but the foundation was eaten through. No weapon felt meaningful. No activity – irreplaceable. Class building? A lick of a fresh paint on a bumpy hardwood floor and a new layer of a plaster on a bulged walls, that was carried out for too long, and amounted in too little result.\nIn 2018-2020 they gave us a cathedral. Magnificent. Singular. Then they buried that potential under layers of corporate incompetence and the paranoid fear of giving players too much.\nThank you for the memories, Bungie. Shame I am witness to decay of one of your greatest creations.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "BUNGIE HAVE DESTROYED THIS GAME. After over 500hrs of gameplay, returning to this game is nothing but an unguided shamble with no clear story. They've removed content that I previously purchsed and unless i purchase the newer content theres almost nothing to do in the game. If you purchase content it should always be accessable.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Stopped giving a crap about Destiny after Bungey removed content I paid for.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It pains me to give this a negative review, it really does, but I wouldn't recommend this game to anyone in it's current state. Destiny 2 has been a rollercoaster in terms of development, with lots of ups and downs, but it feels like we've finally leveled out at the bottom of the ride and it's a good time to get off.\r\n\r\nI started this game on console, so my steam hours aren't accurate. I've put roughly 4000 hours into this game, had an incredible time doing so. Met lots of wonderful people, enjoyed the gameplay and storyline almost all the way through. Phenomenal game. But in it's current state, it's like a skeleton of what it used to be. Not a BAD game, but far from what it used to be. That, and the new player experience is awful right now. You will not get to experience the story in full, in fact, you won't even get HALF of it. It's an insult to what this game used to be, and it pains me to see it happen. \r\n\r\nBut all good things must come to an end eventually. It was still several years of my life well spent, but I can't support it any more.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Nobody does it better than Bungie (It being taking a great franchise with incredible potential and driving it into the dirt with corporate greed and incompetence)\n\nThe core gameplay is still good, and I'm sure new players can find enjoyment in it (after emptying their wallets) but for me and many other og players the joy is gone.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "80% of the old content (that we all paid for) is gone. Getting into Destiny now would require too much money and time, YOUR money and time. I uninstalled after Final Shape, and I didn't even finish Final Shape before the game started bombarding me with random BS for the new season. This game leans way too much into FOMO and milking every drop of money from you, and it cares little for keeping you engaged in a progressive and meaningful way.\n\nMost veteran Destiny players will say the same thing: Please do not get into Destiny. That ship has long sailed, and you will end up confused about everything. Sure, the new Star Wars gear may look cool, but first, you have to pay for it even if Destiny itself is free, and secondly, I guarantee it's not worth the grind.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "1. look at my hours\n\n2. DO NOT give your time to this game. you deserve better.\n\n3. I could write you a book on the problems, instead i need you to know, I'm not some careless hate monster I LOVED D1 & D2 and I spent most of those 5k hours helping and teaching people. This game will lower your standard of living and fun. The upper management devs  have/will make every anti player choice they can, come up with more and lie often in projections/updates. there have been issues and glitches ignored for literally 5+ years. please I beg of you, play literally anything else and have a nice day c:",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "A real disappointment after many hours, the game has completely changed and just isn't fun anymore. It's very clear that new content isn't even being playtested and the entire gameplay loop now boils down to: Do x mission on repeat to get incremental improvements to your gear level with no real purpose behind it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Iv got 1700 Hours on Destiny 2. Over the many years it has had it ups and downs but with the last few DLCs has just put into a place that might not be able to be saved. there is more and more people leaving this game every single day! With every \"expansion\" there is less in the game then there was before. If you are just starting to play Destiny 2 today you will not know a single thing going on because the campaign is all over the place and missing a good 70% of the original game. \nAnd if you do decide to actually put money into it then just know that you will be getting less of the game then first promised. \nGO ANYWHERE ELSE BUT HERE!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Wanted to get into this game with some friends who had played it religiously for years. I was late to the game. Bought all the expansions to have access to all the content and get caught up on the story line - only to find the vast majority of content has been removed and the story line is incredibly fractured and non-existent. In less than a month it was already run dailies, play some crucible (PvP) and hunt for exotics that the game focuses so much on only to use the same 2 because you only equip one weapon and one armor piece at a time. I deeply regret the amount I spent on this game to find the content was removed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's been a good 7 years but everything comes to an end and you bungie are the ones who ended it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Like an abusive relationship the good moments are gone. Bungie love-bombs you with a flashy intro and a promise of deep, meaningful gameplay. It whispers, \"Trust me, I’ll be different.” And like an absolute clown, you believe it. Suddenly it’s draining your stamina, your wallet, your patience, and possibly your lifespan. Every time you try to leave, it sends a notification like, “Hey… you up? Stockholm Syndrome speedruns are apparently a genre now. It's time to leave this mess for something better.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Between this previous 2 seasons feeling empty and the fact they STILL won't enable battle eye for Linux the game really isn't worth touching. Which is a shame since enabling it would possibly (extreme emphasis on possibly) breathe some life into the game. But since they won't I can't play anymore. Moved to bazzite after 10 was put on EOL and I refuse to go back to windows.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After playing since launch in 2017 and playing fully through 24 of the 27 current seasons, I uninstalled and don't plan on returning unless a Destiny 3 happens.\nDon't get me wrong, because this is one of my all time favourite games, but game's main story peaked and concluded a year and a half ago. Everything since has kind of just felt like anime filler episodes. I was already falling out of love with this game and playing it less and less before the Edge of Fate expansion dropped and could barely bring myself to finish it's main story.\nThen they introduced armour 3.0 in E.o.F making all your previous gear obsolete, but decided the only real way / best way to get the new gear was playing like 3+ year old repetitive content. \nThis game is not catered to casual play, so unless this is the only game you plan to play or you are unemployed and have all the free time in the world, there isn't any way to keep up and i wouldn't recommend.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i have probably around 5k~ or so hours across all platforms and d1/2, and i no longer really have any interest. unfortunately destiny was one of the most unique games i've played and i have a lot of great memories, i miss raiding and sparrow flying. rip to probably the best fps game of all time and fuck bungie",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Look at my hours and heed my words; this game is a shell of what it was. I could go on and on like the others about mechanic changes, the entire currency clusterfuck, how nothing and bland most new expansions are and how dead it feels, and I'm not a braindead fuck who's gonna cry about dEi or whatever because the story suffers for reasons far beyond character identity, I can't recommend this for 1 simple reason above all: you will NEVER be able to experience its best content again. Ever. With most dead/dying MMO's, you can still at least access the content that made the game so successful to begin with, but not here! Red War? Gone. Forsaken? Gone. Some of the most beloved locations in the game? Gone. Hell I even miss Mercury of all places that's how nothing the new locations feel. No more adventures, exotics drop like candy now and nothing feels special anymore, the tower realistically has more denizens from multiple species than it ever has yet somehow feels so empty and devoid of change. One of my favourite studios that made so many of my favourite games of all time becomes yet another victim of Activison-Blizzard, I will forever love the time I spent with this game, but after a year of not playing and finally uninstalling it, I don't think I can ever go back.\n\nAll that being said, I'm sure the experience is very different for a brand new player, you probably will have fun with it at first but I promise you learning about what used to be will probably spoil that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Could be a good game but the devs get told to hold content for ransom, prices that just genuinely do not make sense even for competitive market reasons. Then time gate the shit out of the content you paid for (basically saying you don't own this *Nintendo style) and expect you to be content with a few hours worth of playable game at a time. Unfortunate circumstance when games become free but the company running it has people in it just for the money, poor devs and designers man.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "So the amount of times I've quit this game between seasons, oi. \n\nI still go back to it. I wish I stayed gone - but we'll see how star wars is I suppose! \n\nBe wary trusting them however, I had a problem when I purchased the 'campaign skip' for my warlock (lightfall). What happened was I bought it first for my hunter (I really didn't want to unlock all the things for him, and just have the new class w the campaign skipped) and then for my warlock. Hunter worked perfectly, it gives you blue items to infuse to hit soft cap, and then grants you the new class as well as skipping the seasonal campaign.\n\nThe same was not true for my warlock, all he recieved was all the blues to hit soft cap, and then nothing more. I waited a while (day/2) before reaching out to destiny via the forums, the only thing that they told me was 'silver is non refundable'. I was angry at this point, they didn't seem to understand they mistakenly scammed me out of 2,500 silver (which probably equates to 25$, well divide that by 3 and then maybe the 2/3's were scammed out of me, as all I got were the blues)\n\nThat sucked, considering I've been a long time player. I quit for a year, and FOMO brought me back. Microtransactions as well as the expansion passes are pretty wild, expensive and something to do for a while, but if star wars doesn't pull a rabbit out of it's hat, I'll be finished. The company is unnecessarily greedy, and I don't see it getting better after this sort of stunt, I feel they'll probably just cut their losses and steal more from players, rather than grow and try to make it better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I just started playing this game again this week. I can see why people are leaving.\r\n\r\nI got the legacy bundle since there's the sale going on for the Black Friday stuff. The thing is, the legacy bundle doesn't include access to dungeons for 2 of the expansions included in the bundle. \r\n\r\nThe reason for my negative review? Let's break it down.\r\n\r\n1. Access to the 2 expansion dungeon keys is 4,000 Silver (the premium microtransaction currency in this game) and you can't buy the keys on Steam. That 4k Silver is another $30+ USD. That is insane.\r\n\r\n2. Some things in this game are locked behind access to new gear, which is from the newer content. So, if you want to join PVP you can't use ANY of your old gear and might as well make them cosmetics.\r\n\r\n3. On top of old gear sometimes locking you out of content, the changes to the Light system means ALL of your old gear is now light level 10 (as in new player low level).\r\n\r\nI've only got 10 hours back into this game so I'm sure there are going to be a ton more offenses to rant about, but as of right now those 3 are huge issues to me because it is a blatant cashgrab. \r\n\r\nThey're forcing you to pay for up to date gear to fully access game features while simultaneously splitting expansions up into multiple purchases, effectively locking you out of things that SHOULD BE INCLUDED when you buy the expansion pass.\r\n\r\nI'm still absolutely dumbfounded at the fact someone greenlit this business model at Bungie. People are extremely valid for leaving this game. I can't imagine what a lot of veteran players have seen in the time I haven't been playing. I'm sure I can check online for video essays on the downfall of Bungie/Destiny but I don't need another headache right now.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was great while it lasted- but if you're a new player: this game is a shadow of its former self. What used to be the highlight of my day turned into over bloated, poorly optimized, festering money pit. I don't regret my time: the Final Shape was a great way to end my career as a guardian. But after an embarrassing amount of hours and money- its just not worth it anymore. \n\nOne of my favorite parts looking back would prob- ERROR CODE: WEASEL. VISIT help.bungie.net",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The pvp in this game is loaded with cheaters and hackers its ridiculous. The fact that Bungie does absolutely nothing about it is crazy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is basically dead at this point. They stopped making actual seasonal content that people already paid for and most of the dev effort seems to be focused entirely on eververse now to squeeze every last dime out of players. \n\nThere's nothing to actually do anymore unless you like grinding the same handful of activities in the portal on repeat. All other content has been rendered irrelevant.\n\nDo not waste your time on this trash like I have.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is dying because of greed and stupidity.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game is dying, developers dont know what the community wants or how to make content that isnt so lack luster. Seems to be more focused on everything that is NOT game developing or what is actually popular. no one cared for star wars bundles, or star wars themed dlc. we literally went through years of bashing star wars for its crap shows and movies, then a terrible game. what makes you think we want it now?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Games pretty shit, removed all the good stuff, classic american capitalists doing their thing. Dont install.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After quitting almost 5 months ago after playing this franchise for 10+ years, I have finally been disillusioned. I remember at the time of the DCV I made excuses for Bungie that while it sucked losing content, I felt that maybe the game would improve in the long run. Spoiler Alert: it never did and in fact it got worse and worse...and then worse. Sure The Witch Queen and The Final Shape were excellent, but you always knew the subsequent content droughts and following DLC were going to be inexcusably bad. Which of course they were. \n\nOne of the justifications Bungie gave for the existence of the DCV was that it would make the game easier to update and would allow them to respond to feedback faster and make small tweaks to the game in a timely manner.....that literally just straight up never happened. The only thing they EVER respond to quickly and implement fixes for at LIGHTNING SPEED are exploits that let players circumvent systems related to Eververse or the AWFUL power level apparatus. \n\nSpeaking of Eververse, it has become a plague that has seen amazing armor sets that are themed around the current season/raid get relegated to 20 dollar purchases instead of being obtainable through excellent gameplay in challenging content. They will literally design beautiful armor whose design language directly matches the current endgame activity, and then slap it in Eververse. The armor you get in the raid however is the fugliest thing youve ever laid your eyes on. Cool Trials themed weapon ornament? Eververse instead of flawless chest. Cool shaders that are VoG themed? Eververse instead of Atheon challenge drops. Dope new Iron Banner themed armor? Remove the IB decal and chuck it in Eververse.\n\nThe most prevalent thing thats baked into this games DNA is FOMO. With the Star Wars themed expansion on the horizon, I thought about maybe giving it a shot despite my disgust and hatred of having to grind for new armor YET AGAIN after they changed how armor works and added tiers(?) to weapons. But whats that? The season pass from EoF and Ash and Iron will be sunset and I wont be able to get the rewards. OH and the seasonal activities will be removed never to return. If a ~5 month lapsed veteran player feels FOMO in this way after such a short time, what hope does a new player have? Other live service games allow players to complete past passes indefinitely and this games dying player base necessitates a similar system.\n\nThey are quite simply the laziest and most incompetent group of developers ive ever had the displeasure of being at the mercy of. They are incapable of learning from their mistakes until theyve made that same mistake MULTIPLE TIMES. I dont wanna hear about how its the higher-ups that are to blame for this games many failings because when you hear the real developers speak in ViDocs and twitch streams, you can just tell they have no idea what they are talking about. They consistently make design choices that are so hilariously bad and then when those choices inevitably blow up in their faces, theyll respond with \"oh darn, I guess we got that wrong. Dont worry, we'll try (and fail) to fix that in 6 to 12 months! BTW dont forget to tune into our awkward livestream where our soulless and socially inept devs that dont actually play the game will preach to you about how they know whats best for the game!\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "NO its not worth it. The current state of progression and grind is the weakest and worst its ever been, and about 30-50% of the content from the DLCs has been completely deleted and are inaccessible, so they're a complete SCAM.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I used to love and no-life this game for a brief period in my life, for about 2 years.\n\nI write this review not for the many failings I have noticed during that period but because the company's executive class of future has-been c-suiters that are technically illiterate and small-minded misunderstand Linux and have arbitrarily decided to block any and all Linux players. Understand that this game runs on Linux. The community and companies that have invested and dedicated themselves to the massive project running the roots of our world that is the Linux Kernel and family of operating systems have already figured out how to run just about anything on it. The only question is if a switch is flipped on the other end to make sure this becomes practically impossible or too hazardous to be considered possible. THEY MADE IT NOT WORK ON LINUX AND COULD CHANGE IT AT ANY TIME IF THEY JUST SNAPPED OUT OF THEIR DELIRIOUS FANTASIES OF ZERO-SUM QUARTERLY PROFIT MARGINS AND MISGUIDED MISCONCEPTIONS BORN OUT OF IGNORANCE AND ILLITERACY!\n\nI could talk at lengths about the horrible precedents this game has set with its cash shop, the de facto yearly subscription, the planned obsolescence of free and paid content alike, the FOMO, the way this game is almost a job, the way this game pretends it is an rpg but has zero choices ever and you are narratively just railroaded and your character a spectator, unlike in other game franchises like Mass Effect, Vtm: Bloodlines 1, Deus Ex and SWTOR.\nBut frankly, the arbitrary and petty decision to engineer new and crafty ways to block access to your already enshittified product is astonishingly sad and yet another bad precedent the corporate heads behind this game are hellbent on making. Bungie, put an end to the corporate rot and refocus on actual creativity and innovation that I know you are capable of if unchained from your greed. Fix this!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've lost 1,484 hours of my life to this game. \nIf that number ever goes higher, know that it was against my will.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "a husk of what it once was, laughably bad new player experience and just still around to milk your wallet dry.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I find it crazy that to this day - they require you to buy every expansion separately to play the content. For example - if you buy the latest WOW/FFXIV expansion - you have access to everything.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As someone who has been playing this game since Destiny 1, has over 1k hours in Destiny 2 (this does not include my battle.net time) I cannot in good faith recommend this game anymore. \n\nIt use to be beautiful soundtracks, great stories, fun mechanics and just an overall fun game that I knew I could go back to time and time again. I loved the mystery that the game used to have. But as recent years show, this game is no longer supported and controlled by people who love the game. Bungie is turning into another corporation that wants to make a quick buck since that is all that the shareholders really care about, the short term profit. I also fully feel like those who is over the story and content for this game no longer have the ability to be original. I wished they had just ended the game at The Final Shape instead of taking the carcass of something I loved and defiling it with what they are doing now. \n\nGranted, I was one of those that no matter how bad the game was these past few years, I would buy every upgrade and expansion in the hopes it would get better (My OCD also was a huge factor in wanting to finish the story of the light and dark saga). But now that the true story of Destiny 2 is complete and this new cash grab content follows, I am done with this game fully. I have not bought a single Expansion or DLC after the Final Shape. I will not support this company no longer. I know I am not but a small voice in this community but I want to urge others to think upon what I say and do the same. Nothing will change until so. Bungie Corpos will just keep thinking of ways to grab money from you as long as you are willing to let it keep happening. Destiny 2 is, and I don't care what anyone says, on its death bed and its desperately crying to be put to sleep. \n\nLike I said, I'm just one person out of thousands but I do hope what I have said in this review help you all think about and make the difficult decision (and it is a difficult decision. To this day I miss playing this game so much) to stand up for what is right. In not only this game but to other corporations that is taking advantage of their consumers.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Never in my life have I ever set eyes on a game this bad, I have 3.5 thousand hours on console and pc combinded. Now after this trash company gave my friends 3400 silver in the bundle and I myself only got the normal amount of 1700 because I already had silver in my inventory I just want this game to miserably fail and Bungie die with it. Because I already gave those bastards money I got less than others. If you read this and are considering to pick up the game don't. It's utter garbage. It's a scam. It's the worst game you will ever play in your life. Just don't.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game is ass, developers are plagiaristic hacks, and the lightsabers look and play like the aftermarket off-brand star wars ripoff they are",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pay to play, pay to progress, pay to do move 5 feet in front of you. I collectively have over 8 thousand hours on this game from different platforms and I would never recommend this game to anybody again. The company has been and always will be against the people who play their games, and it will never change. Thanks for nearly 11 great years, but this game doesn't deserve anything more than a shut down.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I just ripped the bong and in that moment between when you have inhaled too much and you start feeling the burn.... but right before you exhale the massive tree cloud, I thought to myself.... man, I had so much fun playing D1 and what fucking assholes the dip shits at Bungie are for promising a 10 year game and then releasing that steaming pile of pucky they called Destiny 2 instead of keeping there promise like a decent human would. So I decided to do another bong hit and do a steam review... I hope everyone of you stubs all 10 of your toes every fucking day of your life's.  You money grubbing expansion loving Whores!!!!!  I bet each one of your mothers smiles to your face but are thinking how ashamed of you they are.... I bet all of you are the type the try and cheat at tic tac toe... \n\nFOR SHAME ON EVERY ONE OF YOU.... DO NOT GIVE THESE FUCKS YOUR MONEY",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Doesn't work on Linux at all. Also \"vaulting\" (aka permanently removing) content that people paid for is a really scummy business tactic. I've been considered giving this game a go multiple times but the knowledge that I'll never be able to experience the full story killed my interest. Now, not being able to even play it on my PC because I don't want to use Microsoft's broken, spyware-ridden OS [i]guarantees[/i] I will never play it.\n\nOh well. Doesn't really feel like a huge loss.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have spent too much time in my life playing this game. Every time I say I won't come back, but guess what I do. I'm stuck in a infinite loop of hope, despair, recognition, and acceptance. Do not play this game or else you will be subjected to the same pain I feel every time I open it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a complete time and money sink, with monetized FOMO (not unlike many modern games, unfortunately). After a time, old content (planets, missions, etc.) is removed from the game never to be played again. I think that this is very unfortunate, as I consider video games to be a form of art. Destroying art to create a FOMO market is deplorable. This was once a stellar game, but marketing greed has sucked so much out of it and so much is now lost.\n\nI will say that the developers have clearly worked very hard and that they do seem to be both inspired by and proud of their work, as they should be. The core gameplay and mechanics are fun, and the framework of the game is actually quite wonderful.\n\nDo I think this game has technical excellence? Without a doubt. Do I think the developers care about their work? Absolutely! Do I recommend this game, knowing that the content will inevitably be removed because of marketing and that the content the player paid for will become inaccessible? I do not.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You can see how many hours I've wasted on this game... I've done just about everything the game has to offer for the slightly-above-average-skill-level gamer, and I can confidently say, gameplay aside; this game sucks. Story is mid, Sunsetting was a damn black hole for joy. Season 17 was the most fun I'd ever had. PvP was rarely ever fun. The only thing I had a lot of fun with were Raids and Dungeons. Those were almost always a great experience. everything else, especially the grind for random rolled weapons was hell. Crafting made the game fun by letting me take control of the roll. It's a shame people grinded that shit so hard weren't any weapons left to grind for them in a month or two.\r\n\r\nTL:DR\r\nStory 4/10\r\nGameplay 9/10\r\nSeason/episode structure 3/10\r\nPvP 1/10\r\n\r\nDont play this game if you have a life. Destiny 2 wants you to make it your job to grind.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This company abandoned the game for a shitty extract shooter. they had something special but they let poor leadership ruin everything about this franchise. Hell a mobile Chinese spin off looks more engaging and fun then the og series. Fuck  Pete Parsons give me my money and my time back you waste of human. Tips for the Devs: Marathon will fail and you will have nothing to come back to. EAT MY ASS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was a great game several years ago, but poor developer decisions completely ruined it. The whole sunsetting → unsunsetting → re-sunsetting of weapons was a joke and felt like a slap in the face to players who had invested years of effort. On top of that, the monetization is awful—especially the transmog system, which is easily one of the worst ever implemented in any game...\n\nIf you’re thinking about jumping in, don’t waste your time. If you’re still playing, do yourself a favour and reclaim your life. Maybe go touch some grass.\n\nS**t game. I want my life back.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I think I stopped playing before the Megamind boss DLC dropped, and honestly most of my long-term friends had already quit around Witch Queen anyway. I kept pushing on after they left because I didn’t really have anything else going on in my life at the time, and I was in a pretty dark place. I used to be a PvP player back when Redrix’s Claymore and Not Forgotten were worth grinding for, but after switching to PC I couldn’t really keep up, I was pretty bad compared to everyone else. So I shifted into PvE instead: solo flawless dungeons, flawless raids, low-mans, chasing triumphs and seals. That became my thing, plus going flawless once a week when I could. I’ve been trying to remember why I don’t recommend this game anymore, and I think it’s mostly personal. I poured a lot of time into Destiny and it feels like it didn’t amount to anything. I’m not mad at the game; I’m more disappointed in myself. I should’ve prioritized other parts of my life LIKE college, relationships, my mental health. Back when I was grinding nonstop, it felt like Destiny was all I had. Still, there were some great moments: waiting in line at GameStop for a copy, seeing so many players at the Farm, the classic destinations packed with people doing public events for the first time, exploring secrets through patrols and lost sectors. Before Destiny I never really interacted with people in games, so experiencing raids and using LFG for the first time was amazing. I remember Osiris getting boring after everyone got the Sagira shell, and then Forsaken dropped. Forsaken was probably the best time I ever had in Destiny so many friends, so much to explore, and an incredible weapon pool. Plus, nightfall-specific rewards actually felt exciting.\n\nAnyway, I’m kinda just rambling at this point. Uhhh its not worth playing rn for me cuz the moonshine wore off type.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have thousands of hours played on console. I don't recommend getting this. \n\n- Terribly balanced PvP. Some broken aspects of PvP went unnerfed for more than a year. (i.e Stasis, Felwinters etc.)\n- Infested with cheaters (and zimmers for console), made easier by going free to play. \n- Awful anticheat.\n- Sunsetting. Paid for content removed from the game.\n- Be ready to watch hours of lore videos if you didn't play the content before it was removed\n- Going free to play made the game worse in every aspect. Be ready to pay for a bunch of DLC\n- Destiny used to be so good. Everyone kept wondering who would be the \"Destiny Killer\". Well it turned out to be Bungie themselves.\n- Bungie is no longer the studio that made Halo, but the studio that killed Destiny.\n- Maybe an unpopular opinion, but crafting took a lot of fun out the game. That rush of happiness when you got a really good roll of a weapon is basically gone. Sure it helped remove some of the grind, but a lot of memories came from playing raids and grinding with friends.\n- There is so much more wrong with the game. I don't regret playing because of all the good memories. Calling this game a shell of its former self is an understatement.\n\nBungie brought us Halo and Destiny. Most of the people who were there in the studio during their prime are long gone. I will forever be grateful for the memories made on Halo as a kid and Destiny later on. However it seems like getting that feeling back as an adult won't happen. Marathon isn't out yet as of time of this review, but my hopes are not high.  Looks like another typical extraction shooter that will die within weeks of release. I hope I am wrong. I hope to see another amazing Bungie game in my life.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Removing paid content is such an amazing move, excellent gambit.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game sucks,boring and toxic and cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game was good, but they never understood how to make a live service games successful.\nInstead they managed to annoy everyone, the people that bought the game at the start got no compensation in any way after they made the game free to play.\nall people that bought a DLC could only play it for a limmeted time, and all people that came after that could not keep up with the story.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "downgrade from destiny 1 and the devs are delusional about linux saying it would make the game more open to cheaters and hacking when nobody makes hacks for linux because the vast majority of players are on windows.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game used to be great. I will always have fond memories of the Forsaken DLC and feeling like I need to avenge Cayde. However that's all that is left in this game is fond memories. The monetization has completely and utterly killed the game for me and my group.\n\nNeeding to buy the DLC, season pass AND the dungeon key and still get drip fed content is absurd and tiring and that has been their monetization model now for years. The same grind repeated and your reward for finishing everything in a DLC/Season? You get to do it over again, btw don't forget you need to buy the new season and DLC!\n\nLet us not also forget that they take DLC away from you. The forsaken DLC I have fond memories of? You can't play it anymore. What if you wanted to experience the very start of destiny 2 with the red war? Can't experience that either.\n\nI could go on and on about this game. I used to love it. I still do in some ways but long gone are the glory days of destiny.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After years of paying for dlc, battle passes and cosmetics, I woke up one day and asked myself, \"what am I doing here?\"\n\nI think that was around when Lightfall came out. I used to not understand why people ditched Destiny 2 until that point. It's just not fun anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Used to be a good game but now it's completely ruined, what a waste!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I truly wish I could recommend this game, but unfortunately Bungie has failed this game and it's community. Removing ~80% of its story is only a part of the issue, it would appear that the years of poor leadership from Bungie has taken its toll. This game will demand you play it like a second job. Your gear will periodically be made to be worse than useless, whether it's because the build you liked relied on a seasonal mod to function or because Bungie decided to rebalance how stats even work. \nThis game will find every possibility to nickel and dime you that it can. Events went from being fun gimmicks for the community to having their own season passes and seem designed only around increasing profits for Bungie and their shareholders. There's nothing wrong with a game company wanting to make a profit, but what happened here with Destiny 2 is that the core of this game and it's community were neglected, and whittled away bit by bit until there was nothing left. This game and how it treats it's players shares an unfortunate amount of overlap with being with an abusive partner.\nIt also still doesn't have a good new player experience if you don't have a friend to guide you or unless you're willing to watch a couple hours of YouTube videos to even have the slightest idea as to what's going on. \nI've had great times in this game, but time moves forward and doesn't stop for anyone nor anything. I don't regret my time here, I only regret I didn't realize how terribly this game treats it's players so late. \nMaybe someday Bungie will figure it out and this game that I once loved will finally reach it's potential, but that day is not today, and likely will not ever come to fruition at this point.\nI cannot recommend you stay away from this game enough, of the 3 games in this franchise this is somehow the worst one. A gacha styled mobile game is somehow a better experience than this, and it's previous entry that is a decade old and lacks any of the quality of life improvements has more of a soul and has a better experience for all players than Destiny 2 does.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sadly, Destiny 2 from what it once was and it is incredibly hard to recommend even trying it. I’ve been playing this franchise (on Xbox for those wondering about my playtime) since the first day of Destiny and I haven’t felt any draw to it since the massive fumbles of post-Final Shape with the clear lack of direction and very poorly executed ideas that Bungie had to backpedal HARD on due to how badly it affected the remaining players’ remaining enthusiasm to play the game.\n\nWe’ll see if they turn things around with Renegades but as of currently, I will not recommend this game to anyone looking for a game to get into.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Disrespects my time. Seeks to keep me addicted. I want to like it, it was a place to enjoy. But they burn it all for the bag.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"Activision is making us do this greedy stuff\"\n>Becomes independent and continues to just do the same thing if not arguably worse.\n\nI've been a huge fan since D1, watching all the play test hype months before release in 2014 and playing the beta.\n\nBought every DLC from D1 untill D2 Beyond light running 3 characters every week and quit cus it's just the same thing of grinding for BIS gear running the end game activities over and over for the low chance drops (that I swear were better for ppl who barely played to entice them back in lmao) only to be back at the start with Timmy who just bought the DLC every couple of months. Not at all shocked to see they've released like 300+ quids worth of DLC since I've quit. \nThem getting rid of all the content I've spent hundreds on wouldn't exactly drive me to keep \"buying\" (renting) content either.\nTis a shame as I loved this game but greed ruined it.\nThis well is drying up, if you are thinking about hopping in, don't! And to anyone still playing my thoughts and prayers are going out to you.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After investing years into this game and its predecessor on console, I can safely say I've never had something sold as 'entertainment' cause so much damn misery. bungie could refund their entire playerbase and it still wouldnt change the overall mindset of the community. Merriam-Webster are considering changing the definition of bungie in the dictionary to \"Money leeching parasites that care more about their own financial gain and classic car collections than the millions of people who gave them those funds and more importantly, their time\". If pete parsons hadn't stepped down, Mangione might have escaped federal custody for one last job. Giving bungie any more money is the intellectual equivalent of chewing lit firecrackers. I'm at the point where I'm not even giving them capital letters in sentences anymore. They're lesser nouns now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is incredible -- it's got fantastic lore, the best gameplay for any shooter ever, and is goddamn gorgeous.  But I could never recommend this for anyone that isn't already playing it.  \n\nThe story is incredible, but only if you were there for it.  The new/returning player experience is ABYSMAL -- my wife played it with me for a few hundred hours back in Y2, and now literally every single aspect of the game has changed, and it's just confusing.  \n\nFurthermore, it's no longer a game for casuals to just pick up and play, like it used to be.  My wife can no longer just pick a flavor of voidwalker and just start playing.  Now she has to pick and choose every single part of her subclass and make sure it works together. [b]This is an amazing system for people like me that love build-crafting[/b], but it is a terrible system for those who want to learn the game.\n\nTL;DR:  [b]Until Bungie fixes the new/returning player experience, I will never be able to recommend this game that is otherwise incredible.[/b]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Destiny 2 has become one of the most disappointing gaming experiences I’ve ever had, and it’s painful to say that as someone who supported the game from the start. One of the biggest issues is that Bungie has removed paid content that players rightfully purchased, effectively taking away parts of the game that were advertised and sold as permanent. Losing access to expansions and story campaigns I paid for feels dishonest and incredibly frustrating.\r\n\r\nOn top of that, the game has gone through multiple “sunsetting” phases where my entire gear collection was rendered useless—three separate times. Hundreds of hours spent chasing weapons, perfect rolls, and armor sets became meaningless overnight because Bungie decided to reset the power structure again. It’s one thing to introduce new gear; it’s another to completely invalidate the effort players put in.\r\n\r\nBut the core problem is that Destiny 2 increasingly feels like a game where money matters far more than the players. Every year brings more microtransactions, more paid expansions, more deluxe editions, and yet less respect for the time and financial investment of the community. Instead of building long-term trust, the game keeps pushing monetization while removing content and undermining player progression.\r\n\r\nIn the end, Destiny 2 could have been something truly special, but today it’s hard to view it as anything other than a cash-driven product that disregards the people who supported it the most.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Destiny used to be a game with exciting lore, an interesting story, great PvE gameplay, and cinematic story highlights. Over the years, Bungie has continued to run the game into the ground. The grind became unbearable, and playing the game was nothing more than a waste of time. Achievements were immediately devalued and not appreciated in the next season, and the game was nothing but a grind in the end. DLCs offered mini updates with almost no content. Almost all resources went into PvP and raids to keep the whales and super competitive players happy. The result? The normal players (who are the vast majority) left in droves! But the ultimate declaration of bankruptcy is now this “update” that turns Destiny into a Star Wars parody and kills the last bit of creativity and uniqueness that this game had. Apparently, Bungie is so creatively bankrupt that they can't even tell a story in their own IP anymore and instead parody stories in another (failing) franchise! What a shame!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How the mighty have fallen...\n\nThis game has some of the highest highs, and the absolute worst, awful, agonizing lows you'll ever see in a video game. Destiny 2 has \"had potential\" for almost a decade now, but the company behind the game seems determined to prove to you that they only see you as a cow to be milked. They will nickel-and-dime you at every possible avenue, and even then there's no guarantee you'll even be able to access the content you paid for. They refuse to implement quality-of-life, balance, or even just \"for fun\" changes the game desperately needs until the game is on life-support, then will expect you to come running back with the promise of \"we listened\". The cycle repeats over and over.\n\nThis game is genuinely like being in an abusive relationship.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game straight up suffers from repetition. Most activities recycle the same encounters, which makes the experience feel routine instead of exciting. There’s also no commitment to story as new expansions retire earlier missions and locations, which makes the world constantly feel like you’ve missed out on something. \n\nPowerful gear either takes too long to earn or is always locked behind strict weekly limits that designed to slow progression. When you do earn these unlocks, balance changes make certain weapons or subclasses feel weaker just after you have invested time to master them.\n\nThe live service nature of Destiny 2 brings additional criticism. Communication from the developers is not always clear or timely. Delays, seasonal story pacing, and technical issues during major updates strain la player’s patience. The cost of expansions, seasons, cosmetic items, and additional features becomes overwhelming when combined.\n\nI don’t recommend this game unless you’re into slop treadmills.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Given the recent choices made by Bungie, the only explanation that makes sense is that they want Destiny 2 to die. It was good and now it isn't. \n\nDon't waste your time, its already done.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My hours can speak for themselves (not really I sat in my ship lol). I GENUINELY enjoyed this game so much as I've been through Destiny's lows and highs, met so many friends through LFG's. Though the studio has reach an incredible low as to how they treat it's player base and employees is simply saddening. Before new story DLC drops and they have little events for you to play throughout the season, there were mini seasonal story missions that would build up the story or at LEAST add a little more spice with context to the campaign (before or after) and there was a decent amount of content to rinse and repeat but its honestly all gone to shit. There's no point and no reason for you to get on IMO.\n\nIf you want your wallet to be ran to the ground with the studio giving almost nothing to offer besides countless micro transactions, piss poor story and just an absolute disregard to its player base whether it was for those who were in it for the PvP or the PvE aspect of it. \n\nThis really was my go to game whether I hated it or loved it, happy or sad, it I'd always come back to it. Now? Ill stare at my character wishing I got my hours I devoted into this game. The friends I've gained from this game are just something else which I had a clan with but now we just all collectively agree that Destiny has reached its all time low and people are starting to really realize and putting it away until they really begin to care for us. \n\nTL;DR: They don't care for players. Waste of time and money. Overflowing with Microtransactions. Put it down till they REALLY want us to come back and care.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "II can't believe how ridiculous this game has become! As a returning player from season 8, I was excited to jump back in, but what I found was a complete disaster. It's like a whole new game, except now it's all about who has the latest DLC. Bungie expects you to shell out money just to stand a chance, and those who have the DLC can basically one-shot you with freeze grenades and shoulder charges. It's not even a first person shooter anymore, it's just a pay-to-win mess. The lack of skill-based matchmaking is why I quit this garbage game in the first place back in 2019, and I have no intention of ever returning. Bungie keeps pushing the new DLC down your throat, but sorry, it's not for me. And don't even get me started on the useless Destiny mobile app for finding teams - what a joke!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To sem spilo takoj ko sem dobo pc v 2020 in me je samo glava zacela bolet ker je najbolj confusing shit na svetu. FUCKASS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Literally EVERYTHING is paywalled now *except* multiplayer. The game is absolutely BEAUTIFUL on my 40\" ultrawide monitor, but it's also absolutely BORING because I can't play it! I've put literally almost 16 full days of playtime into this game, and I'm very sad to say that I'm now uninstalling it because I cannot access my previous purchases and I cannot play any current content. Goodbye, Destiny 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has taken many years off my life the devs seem to not care about anything other than profits one day i could see them adding a dlc to be able to add the game to your hotbar fk bungie and fk sony.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has become abusive to all players, new player experience is garbage and on the other side is the whiplash between \"we're listening\" and actively reversing everything making the game halfway decent. \n\nStay away unless it's on sale, and even then unless they pull off a miracle, expect the new hamster wheel to reset randomly with no notice to the community or reintroducing the grind for light, just remove it already.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Destiny 2 is on the decline. The developers seem more focus on the elite group within the community as oppose to the casuals. If this is the new direction then fine. So if you are someone who can \"no-life\" this game then you'll fit right in. If you just curious and want to try it i would say unless you are a returning player with some base knowledge of the game I would skip this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Destiny 2 is a game that means a lot to me. I made great friends through it and have had some of my fondest memories through this game. It truly was a gem and the memories I made in this game, I will carry with me forever. So I really want to give it a positive review, not due to its current state but as a thank you to Bungie for the great times and memories I had with it.\n\nUnfortunately I can not do that, as I started a full time job today and can't launch the game anymore due to not having enough time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Returning player , i just wanted to do the story missions but they are very confusing to start an keep going \r\nnew player experience is indeed vary bad and thats sad the gameplay i pretty fun tbh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]As much as I hate to say it, I can't recommend anyone play Destiny 2 anymore.[/h1]\r\nI've been playing this game for over 9 years straight. I've seen it through Curse of Osiris. I've seen it through Lightfall. But I can't see it through Edge of Fate. When I first heard about the portal, I originally thought that it was going to be a good and simple change to make the game a bit easier to get into. I thought that it was going to be something along the lines of a quick-play menu for all the featured activities for the week. And as time passed and we got more info on the new scoring system and the new loot system, I was even more excited. I thought that \"Finally, we're going to get a newer, better loot system that actually rewards players for their time\". Because that's what it seemed like at the time. And when Edge of Fate came out, I was happy, the story was great, I loved Keplar, and I loved the challenge of soloing the Mythic Campaign. But then I started to grind power. At first, it was fun. I was playing for hours a day, trying to level up as quickly as possible, playing nothing but Cladera. But after a week, I got tired of it. I looked for other things to do, but there was nothing. The raid wasn't out yet, and there was no seasonal content at all. So I waited, the raid came out, and it was buggy as hell. Almost every encounter was broken in some way, and with no puzzle encounters, the whole raid was nothing but a damage check.  And for the first time, after I beat it, I never wanted to play it again. But with nothing else to do but grind power, I waited. But nothing came. They tried to say they were fixing the game, but they never did. They released a \"Major Content Update\" with nothing but one story mission and a fucking garbage \"new\" activity. I want to believe that Renegades will change everything and that I will bring back the Destiny that I know and love, but I know it won't. It may bring new content, but it won't fix the underlying issue the Edge of Fate created. And to be honest, I don't think they ever will. Their Hail Mary right now is a game no one wants to play that has gotten nothing but negative attention. They left behind I community that loved them, and a game that had so much potential. All for a shitty extraction shooter no one asked for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe one day we can get away from malicious time grinds aimed at battle pass progression and FOMO and move towards an actual exciting, engaging, game play loop that... hear me out, simply keeps people playing. Also stop removing content. Externals cost nothing, anyone with storage issues probably need to get off the game and get a job. Zero reason to remove content.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this since destiny 1 and played 2 on both console and pc and i cant understand why over and over again without fail they butcher this game more and more i just reinstalled after taking a little break to see another power reset and all my shit just back down to the weakest stuff and its just so annoying every time and i just dont think i can do it anymore dude i love this game so much but i just cant.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A corpse of a game, strangled by its own devs, kept shambling on only because the players are still clinging to the hope of a miracle",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not gonna get better. Stop giving them chances to keep bringing out the same crap with a slightly different color of paint on it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I miss how this game used to be, it was so much fun now its just horrid. It sucks but its just how the cookie crumbles.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There was a Time were i played this Game like it was the last day on Earth, but know i wont even install it.\nI never played multiplayer, i focused on single player Experience and i was happy. But now there is nothing to enjoy, repeating basic boring game mechanings, weapons look too similiar, armor is looking boring, cool looking armor is looked behind paywalls, the shops is beeing pushed in your face ever possible moment and so on.\nI feel betrayed. I've got the feeling they put the bare miminum in the game to justify take our money. I dont feel like a player, i feel like a investor, hoping to get someday a kind of reward.\n\nLet Destiny 2 die and start a new game, its the only way to respectfuly end this Era.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "With how much time I sunk into this game and fell in love with the lore, the characters, and my own part within it...with how badly they kept ramping up the FOMO (Fear of missing out) as well as the behavior of the company exec as well, it's a hard pass and would not recommend.\n\nThey've paywalled core activities, and THAT is an unforgivable sin.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "in its current state game is absolute slop bungie cant fix things at all its been a few months now since edge of fate expansion dropped and game is just a chore to play it isnt fun i genuinely hope sony guts bungie because im unsure how this game can ever be fixed or returned to its former glory under current bungie development/leadership",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it consumes my life better than my regular blackjack addiction",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I started with Destiny 1, played through the years across the console's and landed on PC. I had always enjoyed Destiny but after LightFall the series started to go down hill. Final shape killed it for me in terms of the story/ Gameplay with the Witness. The game became very stagnant after its release all new seasons and dlc just felt bland. 5 years ago I would have recommended this game but sadly not anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "No Steam Deck support and no Bazzite (Linux) support - and banning accounts if they get it to work on either is a big nono for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they stopped caring for their community and only care for money d1 was the better option after light fall shouldve been the final dlc and went to d3 cause this is bs for what i seen over my whole life from playing destiny from d1 beta to d2 beta they let this game go everything is vaulted any new gamer to this game will have no idea wtf is going on before where we are now its to giving with the loot exotics dont even feel like exotics anymore they feel like rare gear they bring everything back from d1 which is stupid cause u can just add the whole game into one since u added the raids and some of the gear honestly hellow kitty island adventure is an better game than this copy and paste crap and dont even get me started on switching platforms youll have to pay for everything again which is bs complete bs do better bungie hope sony kills this company",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Love Letter to a Studio No More,\n\nBungie should be a cautionary tale for studios about 'What not to do with a Studio and Franchise'. I don't care about any of the inner workings and going-ons in the office. They took a beloved Franchise and chucked it in the drain, and then decided to toss Star Wars in like it was fortnite.\n\nAvoid this game at all costs, an honestly, avoid Bungie and future titles... At least until we see some genuine improvement on their part, which let's be honest, may never come.\n\n*Yes, I'm titled and angry. This Studio & Franchise introduced me to so many people and friends that I have today, and Bungie shat on it every chance they got, don't pretend they didn't. Yes, I acknowledge we had some bomb xpacs, but we had 1000% more shit ones, and seasons/mechanics to match.\n-> https://wastedondestiny.com/4611686018428509932\n\nI don't leave to many reviews, and I generally don't bash or bomb. I tried the Renegades story after a hiatus from the failure of EoF, and surprise, surprise, it's just as trash as EoF's story and plot. \n\nSorry Bungo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT BUY/DOWNLOAD IF YOU AREN'T WILLING TO BUY DLC.\r\nThis game is great but you should know that if you aren't willing to buy the legacy pack at full price or waiting until it goes on sale this game won't be fun. But if you are still willing to play buy at least the legacy pack or the three subclass dlcs. (Lightfall, Beyond light, and final shape)\r\nThis game has had a lot of problems but its still good despite that. If you have friends and money for dlc this is a 10/10 experience. If not? its like a 4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ive played this game since i was 12 im 21, im so glad this game is dying bungie really killed produced forsaken then said oh shit we gave them what they wanted... live events... puzzles... pvp... guns... exotics that arent fucking quest and i dont have to do fucking lost sectors to get.\nthey actually added things to there expansions and now its how can i get the money from players greed and slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "False promises, unbalanced pvp, low player count, biased devs, shady content control, content you previously paid for gets deleted, paywall to the seven hells, story got messed up after The Final Shape (Should of been the ending. Yet they wanna milk the cow to its bare bones.) which makes no sense now and The unholy amount of Hackers of all type that don't really get taken care of. Their anti-cheat and team is a JOKE. This game used to be gold, but now like many of us vets see only a Fool's Gold covered in piss.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bungie became Disney as far as business models go. Great potential since year 1 but have avoided evolving the game into something more special. Could've pushed the boundaries for open world live service mmo's but instead created a cheap sub genre thats never gain bring support from players. This game was very special to me and my friends but game direction went in favor of the loudest minority. Disney did the same thing so just like I canceled my Disney plus subscription Destiny 2 will probably be the last Bungie game I play. Cheers to those 1st two years of optimism",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game changed too much and devs got greedy too. Sad I cant relive all those moments of fun I had in the past cuz they deleted old companies",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game is just a slog and none of that slog is particularly good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Straight up deleted huge chunks of the game that people paid for. This is a jigsaw puzzle with missing pieces that will never come back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They do not put their players first and it is always one step forward two steps back. New expansion? Great! Portal and power system? Dog.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's an entertaining game, but I wouldn't recommend it… there's just too much you have to pay for each DLC, and honestly the content isn't worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pay to play, also the game is not even close to what it once was. I'm disappointed in the company and even more disappointed what they did to my favorite franchise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "WARNING! This game will feed you Plums until you get diarrhea. (Yes everything is up to date but who knows WTF is really going on with battlEye...) \"Switch to the Steam version. It'll fix your problem\" they said. Nope!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game turned from an ok looter shooter to a full blown cash grab, the company is ass for leaning more to greed rather than actually providing exciting gameplay, also $30 skins, hard pass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i started playing destiny one back in 2015 on my xbox 360, and i fell in love with the game immediately. the guns, the ability's, doing raids with my friends and destroying people in cruci. not to mention the taken king expansion was s tier, destiny 1 even to this day will always be one of my favorite games of all time, so imagine my excitement when they announced destiny 2, and it was super fun when i came out, new raids, subclasses, guns. the first couple of expansions were pretty good, then microsoft/bungie being the lazy, greedy piece of shit they are, decided to destroy everything they've built all to make some more money, all you had to do was just keep on cooking more of what y'all did for forsaken, but i guess thats too hard for a multi billion dollar company to handle, hope you fucks are happy with destroying what used to be my and a lot of other peoples favorite game/franchise.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}