{
  "positive": [
    {
      "review": "Started a playthrough with friends one day, wanting to see it through the end.\nNow, one year later we're not done because we can never get together to keep the campaign going.\n\n10/10, it truly is a perfect video game representation of a pen and paper role-playing campaign.",
      "voted_up": true,
      "votes_helpful": 56
    },
    {
      "review": "I don't normally like this style of game. I don't even like DnD. But this game is really fun because it's so immersive and not just about picking dialogue options. It's full of details, and I struggle to finish one campaign without starting over with a new class or character. \r\n\r\nIt runs great on the steam deck and is super easy to play on the go. I've been playing it a lot because of that. This game made me enjoy gaming as a hobby again :)",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "after 4 playthroughs this game still has new things to offer and with built in mods there is even more replayability. I recommend that when you know where every good item is you use the mod REL Ancient mega pack so the loot becomes random again as well as extra encounters so you get new bosses and encounters",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "outstanding, deep, dense, captivating, brilliant, so fun with friends, would like to think i'll play this masterpiece here and there for the rest of my days",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "My wife and I played through the game twice in split-screen. It was a lot of fun and exciting",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "One of the best RPGs in years. Great story, characters, voice acting, soundtrack and gameplay, the full package for a guarantee good experience. You don't need to know anything about Faerûn or DnD at all,  if you like RPGs go straight in, no worries.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Baldur’s Gate 3 is the only game where I can heroically save a village, accidentally set myself on fire, romance a vampire, and politely ask a squirrel not to murder me—all before lunch. Truly, a role-playing masterpiece.\r\n\r\nThe amount of freedom in this game is absurd. I tried to solve one quest with diplomacy, failed miserably, and ended up throwing a pair of boots at someone. The game not only allowed it… it encouraged it. Peak design.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Time played is wrong. I HAVE HUNDREDS OF HOURS IN THIS GAME> Best DnD game to date. My only wish is more subclasses. Even without mods you can create insane class combos. I need BG4!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ball burst gyatt 3 definitely deserved all the awards it got for game of the year etc this is an extremely story rich game which finely implements dnd mechanics into a workable video game that is close enough to the original to feel like it but adapted enough to make it into a workable video game.\n\nThe sound track bops and is easily inserted into any dnd session the characters are fun and interesting (except for will fuck will) and there is enough content to keep you busy for a good 100-200 hours on just the 1 playthrough.\n\nOverall nothing but love for the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game that pulls you in completely. It shines in so many ways, and playing it with friends is an absolute joy. I can easily see myself returning to this gem from time to time for years to come.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "thinking about 5 other playthroughs to do while still in my 2nd one lmao, by saying that I mean it's hella good\r\namazing game with so many topics to cover that I just won't even start typing that - long story short that game is basically the closest to perfection we got in all the years of gaming\r\nhuge thank you to Larian for making stuff like that possible, and I wish, we get as many \"anomalies\" like that in game dev as we can\r\n\r\ndon't think a lot, just buy it asap and see for yourself...not much into crpgs? now you will be, trust",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This is by far my favorite game ever. \n\nI'm writing this for the Steam Event thingy but I might come around and write a long ass review later :3",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A fair unbiased DM and friends that actually show up to play some D&D! would highly recommend!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the best games I've played. I recommend it to all RPG lovers - you won't be disappointed.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I just finished my first playthrough, and this is one of the most fleshed out games I have ever seen. It's genuinely ridiculous the extent to which this game allows freedom of play. It makes every other choose-your-own adventure game pale in comparison, it's honestly ridiculous. I am hopping right into another campaign because I genuinely feel, in 80 hours, I scratched the surface.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A tactical party based rpg with a really good lovecraftian setting, bg3 has to be the most beloved games that have come out in the recent decade. Endless replayability with not just plain classes but hybrid builds too, might not be overpowered for your honor mode runs but enough for all role playing reasons. This is certainly the best out there which stands true to its identity and does what it should do right which is player freedom and choices. The combat  based on d&d rules does feel real and balanced but some builds especially the stealth archer could be too op due to how stealth rolls work in game. The characters here are just so well done and stand out to be the some of the best in recent years. Even though the main storyline is pretty short and predictable it is the characters and their storylines that pull you in. There could be some wild sexual themes portrayed here and there but other than that larian have truly sent a love letter to the role-playing genre.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Спасибо Лариан, что не сделали игру с душой. Но для других разрабов была установлена такая высокая планка качества хороших РПГ игр, что они могут оскорбится.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I didn’t want to write a review until I finished everything, and now, after hitting platinum and finally beating Honor Mode with a friend (on our 4th try, not gonna lie), it feels like the right time :))) I would say — this game is a proper DnD experience, super atmospheric, with insane replay value where even tiny choices can flip the outcome. Easily the best story-heavy co-op I’ve played, everything just works great in multiplayer. Some moments will stick with me for a while (except those damn tieflings and their achievement — never again 😅)\n\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "shadowheart having an absolute dumpy was not on my 2025 bingo card but well here we are\r\n\r\n11/10 game is fun as hell, combat is great (im not even a turn based fan and i think its good), dialogue is top notch and the cutscenes are awesome. literally the only criticism i have is not being able to pause during cutscenes, and some minor silent protagonist-isms. that's it. that's literally it. now stop reading this review and play the damn game!!!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "[h1]10/10 - The Greatest Game Ever Created[/h1]\n\nI've spent 500 hours playing Baldur's Gate 3 through multiple playthroughs, and I can say this isn't just a game; it's a masterpiece that changes how we think about RPG. Larian Studios didn't just make a game; they built a living, breathing world straight from Dungeons & Dragons, where every choice affects a web of friendship, betrayal, and epic heroism.  \n\nThe story? Unmatched. You're infected with a mind flayer tadpole, racing against ceremorphosis while uncovering conspiracies involving gods, devils, and ancient evils. But the companions truly shine—they're real characters with personal arcs that change based on your choices. The writing is stellar: branching dialogues, moral dilemmas, and funny exchanges that made me laugh and cry at the same time.  \n\nAnd then there are the evil playthroughs. They take the game to a new level of villainy. Embracing darkness opens paths of true depravity—subtle manipulations that grow into world-shattering tyranny. Dark Urge origins heighten the temptation, with inner voices prompting unspeakable acts that feel deeply personal. Patche 7 introduced even more unique evil endings tailored to your choices and companions. These paths lead to terrifying scenarios of domination, destruction, or ascension that are both horrifying and fun to replay. No \"good\" run prepares you for the satisfaction of embracing the villain arc—the consequences are heavy, and you become the ultimate force of chaos. It's D&D evil done right, without compromise.  \n\nCombat is a tactical dream. The turn-based system is perfect, with environmental interactions—like shoving enemies off cliffs or turning bosses into sheep. Even if you're not a strategy game fan, the depth pulls you in immediately. Freedom is total: sneak into camps, side with underdogs or tyrants—your playstyle shapes the world.  \n\nThe game runs smoothly after patches, boasting stunning visuals, an orchestral score, and seamless co-op. Replayability is endless with Honour Mode, mods, and those origin stories.  \n\nBaldur's Gate 3 isn't the best RPG—it's the best GAME ever created. If you haven't played it, drop everything now. This is gaming at its absolute peak.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Good game. If you're debating it, I don't know why you are? Just buy it. It's like a staple at this point.\n\nCheers.",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "One of the best RPG experiences I've had on the PC in a decade, and the best DnD experience we've gotten since Icewind Dale 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Closest to TTRPG-freedom in a computer game yet.\nMake Tentacles Great Again\nGud game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is a pretty cool game. We had lots of fun as well as some frustration.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite possibly the best CRPG of all time, and if nothing else the best adaptation of Dungeons and Dragons into a video game. I earnestly think this title is something even the non-gaming public should give a try\n\nIt's packed with hundreds of hours of voice lines, class/race combinations, and interactions in both the dialogue and combat which give the game so much depth. The final product is a joy to replay and share with others over and over. Clearly this is a game the developers clearly wanted to make, the GOTY award it earned is well deserved.\n\nMy only gripes with it are really just about what WOTC did to Larian, if not for that corporate meddling; we'd likely have even more polish and content for this already fantastic game.\n\nBravo to Larian for their hard work, BG3 and their other games should definitely be on your radar if you want a good long game to sink your teeth into.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In my opinion one of the best games ever made putting aside my personal love for just the character building and combat the story is great and all of the characters are lovable I can't wait to see what Larian makes next",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Baldur’s Gate 3 is the rare game that doesn’t just hand you choices — it hands you freedom. Every decision branches into another, and another, and somehow all of them feel intentional. Whether you’re lying your way through a tense negotiation, sneaking behind enemy lines, or throwing someone off a cliff just because the option exists, the game rewards creativity at every turn. Nothing feels canned; every path feels like one you carved out yourself.\r\n\r\nThe level of problem-solving is where it really flexes. There’s never just one solution — there are five, and at least two are probably insane. You can brute-force your way through a locked door, pick it, blow it up, teleport past it, or charm the person with the key into loving you. It’s a playground of systems that constantly interact in surprising, brilliant ways.\r\n\r\nVisually and narratively, the game is stunning. The graphics are gorgeous — everything from spell effects to facial animations look like a next-gen cinematic. And the dialogue? Easily some of the best in modern RPGs. Characters feel alive, reactive, and often too real for comfort. BG3 isn’t just a game; it’s an experience that meets you halfway and lets you shape the rest. If you love great storytelling, meaningful choices, and world-class presentation, this one is an absolute masterpiece.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "10/10 dating sim. Tragic vampire dude, sad alt/goth gf, nerd with goddess issues, prince charming, or muscle mommy, a literal bear? CTHULHU? Who will I romance next?\n\nWho am I kidding? It's always Astarion.\n\n...\n\nSincerely, this is my favorite game to release in recent years. If you want a game like DOS2 that will also make you feel a roller coaster of emotions, this is it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Damn looked at the clock on my first play through 3pm in the afternoon looked at the clock again 5am the next day. You can sink so many hours into this game and still make very little main story progress because there is so much to do, and even if you do everything there are is a load of mods that just gives you more. If you haven't play it than just do, you won't regret it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got reminded of this game after dispatch. I realized I appreciate these types of games so damn much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Always wanted to play dungeons and dragons, since i got no friends interested in it as well this is the next best choice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the game in general but there are too many things on the screen and I can't focus like that so 9/10. I'm a fool so don't take my review too seriously. Skill issue on my part. Oh and I have trouble walking through doors, in this game and in real life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Deep and rich game, story and world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really love this game, the design, the story, the gameplay. It's fun and drags you in pretty fast. The multiplayer aspect is also a nice bonus.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my favorite game!! i love the story and how much replay value it has! astarion is my favorite so far :-)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I writing this on principle since everyone has already said the important parts.   I lost like two weeks of my life to this game.  I feel like there is a bit of a slow down at the end of act 1 but once you get past that it puts its hooks all the way in.  I tried DU and evil but the story stops being centralized when you do that so do not recommend.  Very enjoyable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has done irreparable damage to my college schedule, and I think Gale might be the greatest fictional character I have ever feasted my eyes upon. That and Withers' big naturals.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Baldur’s Gate 3 redefines what a modern RPG can be. It delivers a dense, beautifully crafted world that rewards immersion - the more time I spent in it, the deeper I understood the lore, characters, mechanics, character building and itemization.\n\nReplayability is on another scale. After hundreds of hours, I still encounter scenes, dialogue chains, and character moments I never knew existed. A single playthrough barely touches the surface of what the game offers.\n\nAs a long-time fan, I can understand the criticism about its departure from the feel of Baldur’s Gate 1 and 2, and its mechanical overlap with the Divinity series, but the end result is a game of exceptional quality. If it bothers you, treat it as a spiritual successor and enjoy this masterpiece of a game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cool game. Very rich story. Strongly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After sinking around 140 hours into Baldur’s Gate 3, I can safely say it is one of the most absorbing and consistently surprising games I’ve played in years. It’s the closest a game has come to capturing the feeling of a properly run D&D campaign, where every decision branches into five more, and even the most random choices come back later to slap you in the face (or occasionally give you a pat on the back).\n\nThe World and Story\n\nThe story is huge, messy in places, and completely engrossing. You start out with a mind flayer tadpole in your skull, and somehow that spirals into political chaos, godly drama, demonic deals, romance, betrayal, and about twenty “are we sure this is a good idea?” moments. What’s genuinely impressive is how reactive the world is. NPCs remember things you’ve done hours — or sometimes acts — ago. Many games claim choice and consequence; Baldur’s Gate 3 actually delivers it.\n\nCharacters\n\nThe companions are easily the strongest part of the game. They’re flawed, interesting, and constantly surprising. Even the ones I was sure I’d ignore (looking at you, Astarion) ended up being some of the most compelling storylines in the entire game. They feel like actual people rather than quest-dispensing furniture. And the voice acting is ridiculously good — so good that I’ve found myself listening to conversations that I’d normally skip in other RPGs.\n\nGameplay and Combat\n\nCombat is very deliberate and tactical, which I enjoyed more than I thought I would. Early on you get battered, but once you learn how to abuse high ground, shove mechanics, and every barrel you can find, you start feeling like a genius. Fights can take ages, but they’re satisfying when they click. I had moments where I genuinely felt like I’d masterminded some spectacular plan… then other moments where I clicked the wrong square and launched my entire party off a cliff. It balances both ends of that spectrum well.\n\nExploration and Freedom\n\nBaldur’s Gate 3 lets you get away with frankly ridiculous things. I’ve solved quests by sneaking, talking, exploding oil, throwing people off ledges, reading their minds, and occasionally doing absolutely nothing and letting chaos unfold. It rewards curiosity, and you constantly feel like you’re discovering something the developers didn’t expect you to try — even though they definitely did.\n\nPerformance & Polish\n\nTo be fair, the game isn’t perfect. There are bugs, pathing issues, and the odd moment where the game decides everyone is “busy” and won’t talk to you. Act 3, in particular, can wobble depending on your hardware. But none of it was game-breaking for me — more amusing than anything.\n\nLength and Replayability\n\n140 hours in, I’ve finished one full run and still feel like I’ve only scratched the surface. There are whole questlines I’ve discovered after finishing. Entire characters I barely touched. It’s the sort of game where you immediately start thinking about what you’ll do differently next time.\n\nOverall\n\nBaldur’s Gate 3 deserves the praise it gets. It’s ambitious, messy, brilliant, emotional, chaotic, and genuinely memorable. Very few games feel like they respect your intelligence and curiosity — this one does. If you enjoy RPGs, narrative-driven games, or just want something that lets you go off and do your own bizarre thing and still call it a valid playthrough… it’s absolutely worth it.\n\nAfter 140 hours, I still find myself thinking about choices I made, wondering what would have happened if I’d gone another way. Not many games stick with you like that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wholeheartedly recommend this game to play either solo or in coop in friends. With friends it reminds me of my classic paper rpg games, when we're doing total mayham completely ignoring main plot from GM xD 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an unforgettable game, and it's definitely worth the hype.\r\nJust buy it and try it out! Seriously! \r\n\r\nEven if you have no knowledge of DnD or experience with turn-based games, it's worth playing. Especially multiple times! It felt like I was constantly learning something new with each playthrough.\r\n\r\nThe story is phenomenal... It's super engaging and immersive. I love the combat, too. I'm a big fan of turn-based RPGs, and BG3 far exceeded my expectations. It made it hard to want to play any other game for a while, lol. I just couldn't stop playing. The characters are so very well-written, and the voice acting is just...wow. So. GOOD. And the music... incredible.\r\n\r\nSeriously, try it out. Even if you don't like RPGs or turn-based games, or don't know much about DnD, it's so much fun! It's even more fun with friends! And hey, there are mods now! Every playthrough feels fresh and exciting.\r\n\r\nHere's hoping more RPGs like this one come out, because, for the moment, Baldur's Gate 3 is one of the best to come out in a while.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great story, Beautiful details, Great decision system and most of all Amazing Developers.\r\nCan't recommend this enough. 11/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the pinnacle of gaming and what other studios should strive for when it comes to quality.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve never played this type of game before. A mix of D&D and XCOM-style combat ,so at first I honestly thought I would never get into it. But after around three hours, something clicked, and I actually started having a lot of fun.\n\nI’m still at the beginning, but the story and characters already feel really interesting. Even as a newcomer, the world pulls you in, and the choices make everything feel personal. The combat took me a moment to understand, but once it made sense, it became really satisfying.\n\nSo far, Baldur’s Gate 3 surprised me in the best way. If you’re unsure because you’re new to this genre, give it a few hours, it might hook you like it did me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is without any doubt, one of the best games i've ever had the pleasure to play.\r\n\r\nFinished the game 4 times, and in each one, things went very different from one another. The game gives you almost full contol of the choices you have to make. Want to murder innocents and make a collection of their dead bodies at your camp? go for it. Want to approach a group of people and make a music perfomance to try to earn some gold? go ahead, and if they dont like the song, you can also cast a spell to become invisibilty and pickpocket them, no problem.\r\n\r\nThe characters are amazing. Even the random npc have some sort of charisma. The voice acting are beautiful  and well done, you can feel sorrow, joy and angry in each conversation. The musics on this games are just beatiful and epic. The story is well writen and i cant even describe how it made me feel at the end of my first playthough, tears came down from my eyes and made my heart ache, in a good way.\r\n\r\nIf you love D&D, rpgs in general, lovely muscle mommies (looking at you, my sweet Karlach) or a good story telling game, this game is for you.\r\n\r\n[spoiler]The only bad thing is that mommy Jaheira is not romancable... sad[/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Un CPRG au contenu gargantuesque et solidement écrit, difficile à prendre en défaut et qui balaye sans mal sa concurrence contemporaine. Je regrette simplement que malgré ses efforts méritoires Larian ne soit pas parvenu à faire ressurgir certaines des qualités des Divinity: Original Sin, notamment la dimension tactique des combats (mais le système D20 reste archaïque et le domaine privilégié du minimaxage) et une certaine légèreté dans l'aventure (sans parler de l'audace narrative des dialogues entre notre duo de héros dans le premier opus).\r\nAutres petits regrets tout personnels : j'ai connu les Forgotten Realms plus orientés high fantasy et moins 'dark'. Et je ne sais pas trop quoi penser du casting de compagnons, trop baroques à mon goût et avec un background assez fourni pour plusieurs vies et qui pourtant ne sont jamais que niveau 1 ;-)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "didn't expect to like this game when I first got it but decided to try it out because it was recommended so often, turned out to be one of the greatest games I've ever played and had me wanting to find more games like it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very great game and fun experiense with friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a labor of love and it shows. If you've ever thought that you might enjoy it, just buy it, (its worth full price easily) and it you don't enjoy it within 2hrs, return it. Warning: you will not be returning it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I totally recommend buying this game, it is a very beautifully made game with a lot of hidden things to discover as well as a well written main storyline. It is especially fun to play with friends, make your own character, your class and fight your way all the way to Baldur's Gate,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The new gold standard for RPGs. If you are a big studio and your story or gameplay isn't as captivating, you fucked up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 4 playthroughs and over 400 hours, I can confidently say Baldur’s Gate 3 is one of the most compelling games I’ve ever played.\nI originally picked it up on a whim at full release, not knowing exactly what to expect. While I had thoroughly enjoyed Divinity: Original Sin 2, BG3 surpassed it in nearly every way and delivered exactly what I was hoping for in a CRPG—and more.\n\nMy first playthrough completely consumed me. I assumed I’d move on after finishing it once, like I do with most games. But to my surprise, I kept coming back. The sheer variety of choices—from dialogue options and character builds to party compositions and quest resolutions—makes each playthrough feel fresh. Even now, my friend and I, who like to parallel play, still discover things we've never seen before.\n\nBeyond the staggering amount of content, the game is visually stunning and rich with emotionally complex characters. The writing pulls you in, and some story moments left me genuinely torn—struggling to decide what was “right” because of how invested I’d become.\n\nAnd with the addition of mods, the replay value only continues to grow.\n\nIf you have even the slightest curiosity about the CRPG genre, do yourself a favor and give Baldur’s Gate 3 a try. It’s not just a game—it’s an experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game well-deserved its game of the year award in 2024, I also appreciate their physical copy being an old school game box and the fact that the game doesn't have a cash grab monetization policy. It probably has a lot to do with Larian Studios being a private company, since most public companies have to adhere to their shareholders who only care about profit, which makes sense, though it's still bad for the end-consumer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "forgot to review this back when it released it was so good. still a banger in 2025. gj larian. worth more than every penny",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best forms of D&D I've played outside the physical table top, I love this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Before I started playing I had no clue how to start, especially as someone whose been interested in the idea of DnD -- (But had no friends to play or try out with lolz) -- Baldur's Gate III gave me a chance to try that wish out. And It does it phenomenally!! I'm now big into DnD way more than I were before & I love creating characters through Baldur's Gate. It's perfect as a starter view of DnD if you've ever been interested in just trying it out. Karlach as a character is also just UGHHH I love her soo much. Even though most if not all players barely make it past the 2nd Act of the game-- It just shows how much there is to this game. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Perfectly encapsultates the tabletop D&D experience. The world is your oyster when it comes to putting together a party of adventurers and tackling the challenges that await. \r\nThe turn-based combat feels great and the encounters are varied both in turns of enemies involved, tactics employed by the AI and the terain, which is more often than not the real star of the show with how impactful it can be, depending on your approach.\r\n\r\nOnly have two gripes, and both of them are fairly minor: \r\n\r\nThe camera does not seem to be as fond of verticality as the level designers clearly were and sometimes makes navigating tight places a little finnicky, with a handful of times where the camera was harder to deal with than the monsters my party was fighting against.\r\n\r\nThe other thing is the inventory management, outfitting your entire team and then selling of the leftovers while trying to figure out usecases for niche items can be a time-consuming and convoluted affair.\r\n\r\nOverall however, an absolute must-play for fans of CRPGs.\r\n\r\nJust remember that this game is a time hog, at the time of writing I am at 250 hours of playtime and I am still in Act 1 of my second playthrough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got this game as a birthday gift a year ago (thank you friend!). I haven't got to play the campaign by myself yet but the 15 hours I spent playing with friends was really great :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After spending just a few hours in this game I can totally recommend playing it. It's the best game you'll ever play. Once you're in it, you can't get out. Sorry, it is what it is but it's worth it. I think.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, could be your very first D&D + turn-based game. If anything this is one of those that can help you get past your dislikes towards them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its just such a great game. keep wanting to play another playtrough!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What to say, even after 2 years from release, this game still gets updates, even if minor ones and it's still amazing. Like I don't have anything bad to say about this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of fun and always upgrading... great community input and a great addition to the Baldur's Gate series but I thought number 2 was a more challenging and much more involving game. Having said that, it's still a great game, and must play for any RPG fan as well as, any gaming fan.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Baldur's Gate 3 delivers many things for RPG fans. It is a deep choice-driven RPG packed with amazing characters and branching storylines. The strategy combat system and vast exploration system rewards creativity. This game is truly a masterpiece to remember.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A story rich game with replayability and great characters. This games feels like one of those rare once in a lifetime games to me like playing Skyrim or the Mass Effect series for the first time. Games you can replay, do new things and re-adventure in whenever you get an itch for fun gameplay and additive stories.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BG3 offers a lot of opportunities, has great story and characters. Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After almost 800 hours... I have yet to finish the game once. I am addicted to restarting my campaigns.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've spent 740 hours on this game so far. It's distracted me from uni assignments, work and sleep. I still find new things every time I play this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even if this game is old and been out for a while. I still come back to this game and play more of this game. I can't have enough of it. Especially when I get new people into it, or friends together and see what the outcomes are with this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Even after not playing after a while this game always bring enjoyment with multiple playthroughs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's so nice to play games made by people who really want to make a good game and not just profit...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I still find myself coming back to this game and finding new ways of dealing with encounters. Can't wait to see what the community has in store with mods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A worthy successor to original Baldur's Gate games. 👍🏻\nVery deep story, good mechanics, many quests, everything dubbed, premium quality game. I didnt expect that when i heard they are making BG3, to be honest. Larian delivered big time, and without any dlc and other stupid \"additional content\"! You get full game, as it should be, and its really full of content.\nEven some old characters making appearance. 🤗\nAnd it has pretty good multiplayer up to 4 people, though its little buggy sometimes, but nothing to be worried about (restarting the game fixed everything for me).\n\nI was worried about the fighting system being turn-based, im still not a big fan of it, i prefer realtime with pause like in previous games, but its just my preference. Its still good and works well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lead a gang of autistic degenerates to save the world from tentacle hentai. Great game despite the lack of boob slider.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There's nothing to be said for this game that hasn't been said before- and it's worthy of every accolade.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game, good dice rolling very nice dice and rng make you win. Otherwase save scum until dice say nice. Also you can collect underwear of your companions to wear on your own, which my friend really enjoys.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Only The Witcher 3 made me stay at the game for so long.. but this. This is the same as with Witcher.. Wanting to stay up all night just to know what's gonna happen and many more adventures that I didn't discovered in my 1st playthrough. Just like in the Witcher.\nI can only say. If you wanna spend some times alone or with friends and think about what to do or prepare yourself for a fight and make it even more specific. This is the kind of game you want. I even started to get into DnD and all I can say is I found a gem!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] This is the GOD of RPGs [/h1]\nThe game is fantastic even if you’ve never played D&D. Everything is perfect. Every choice you make truly matters, and I really love that they added the companions’ approve/disapprove attitude system. The plot, the structure, the graphics, the companions’ backstories, the main quests, the side quests, the mechanics - everything is just flawless and so balanced. Additional thanks for the co-op mode.\n\nI’ve completed it 3 times, played 300+ hours, and still each time I find something new in this game. I will definitely play it again and again.\n\nHighly recommend it to everyone who loves RPGs!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games of all time! Perfect gameplay, interesting storyline, and enjoyable pastime. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In the world of tactics RPG this is obviously a goliath and it doesn't need any more fellatio than it already receives so i'll just say the game is excellent, one of the best, etc etc etc and here's the finer stuff that is good and bad.\r\n\r\nIn regards to character customization it could definitely use some work at the base level. We've gone far beyond the level where choosing between 8 faces should ever be the standard in a game of this scale. Proportion sliders, decal scaling (moving and resizing tattoos), hue sliders  - I can't imagine these things are much of a problem. If they are, my bad but it seems like 1,000s of games without a gorillion dollars behind them can manage.\r\n\r\nThe camera is a MASSIVE bummer and will fight you for every single hour you play. This isn't a Baldur's Gate 3 issue, it's a Larian issue and it's gotta stop. It's almost better to play in the top-down mode except for all of the details you'll miss from being too far away. More freedom with the camera would definitely be appreciated, with more zoom in/out being the most obvious want.\r\n\r\nLast big point is this game is WAY too long. Everybody talks about it but Act 1 and 3 have far too much to do, and with the way equipment is made to accomodate very particular class builds most people aren't going to risk missing out on the nuclear bomb hiding behind the damsel in distress. I of course appreciate what's been accomplished with these acts but it's hard to deny that sometimes it feels like I'm fighting to make any Main Story progress because I'm far too tied up with several other quests that have presented themselves.\r\n\r\nOn a final, slightly irrelevant note, playing through this game has reminded me how much I would LOVE to have a game with this level of combat depth in a fantasy style, but designed more around singular \"mission-based\" content like you're more likely to see in XCOM. The finer points of this game are the hour-long dungeons or the large scale fights, and a game where this was the core focus like you get with things like Monster Hunter, Peace Walker, Dungeon Defenders, etc, is something I'll never stop wanting.\r\n\r\nOverall the dust settled on this game a long time ago and it's definitely one to play, but here's hoping the next Larian project could take some notes because we're still not perfect yet.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What more is there to say about Baldur's Gate 3. As a Dungeons and Dragons nerd, jumping into this game for the first time with my friend made me feel right at home. Everything about this game is perfect. Combat, voice acting, visuals, it all explodes together to make an absolute masterpiece in story telling while also being an fantastic video game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is full of choices and suprises. I'm still in act 1 tho, but this game is amazing. Even if I lose/can't make it to the next act, I would love to play it again!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When I first bought the game at release, my PC was so slow I had to play on the lowest settings. Two years later, I can finally experience it the way it was meant to be enjoyed",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've never enjoyed critically failing repeatedly so much. 10/10. Or if you listen to my dice, 1/20.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't like some of the actions it forces on your character, but the turn-based gameplay is a lot of fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10\n\nGreatest game of all time. The mere fact that the developers continued to provide support for this game 2-3 years after release just proves their commitment to their player base. Characters are a 10, voice acting is a 10, story is a 10. I can't sing its praises enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was recommend this game by a friend, I was hesitant of not having any prior knowledge of this game. Fast forwarding to now with over 500hrs recorded. \n\nBaldur's Gate 3 is a game with endless replayability, complex character stories, a beautifully crafted world with every nook and cranny enticing you to explore your curiosity. Giving you complete freedom to create your Hero or Villain, and set embark the vast world that is the Faerun. \n\nEvery area that you reach is rifled with life, great relationships funky creatures and whimsical personalities. Baldur's Gate 3 has something for everyone and represents what a DnD, Turn-based, RPG should be.\n\nLarian Studios truly hit a vampire on the head with this one",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bar none, the single best game ever created. No other game even comes close.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Controversial take - This is a very good game.\n\nThis is the culmination of the work Larian has been doing on the Divinity series but with the Dungeons and Dragons universe and mechanics. It definitely plays more like Divinity Original Sin 2 than the original Baldur's Gate games but that works in its favour. It works on multiple levels, as a power fantasy in the Forgotten Realms, at a deeper tactical level, as a role-playing game in the true sense of the world and as an interesting narrative game. Ultimately, there is a lot of flexibility in how you play it even if I have only played through it once.\n\nIt's hard to focus on the negatives because the game throws so much at you and all of it works so well that it overwhelms any issues. BUT, there are some things that are a bit clunky, especially the movement and general gameplay. It is especially noticeable during act 2 with the (minor spoiler) curse mechanic or during battles with a lot of NPCs it can all get a bit too chaotic. There are also a few bugs, I ran into a lot of them with the romance mechanic with the game insisting I was romancing one character ([spoiler]Halsin[/spoiler]) when I had barely spoken to them. And this locked me out of any other romances. But for the most part, most issues are mitigated with frequent quicksaves.\n\nListing out the positives would be an impossible task. The story, the characters, the combat, the roleplaying mechanics and pretty much everything worked for me. Even the constant dice throwing worked, and how the buffs stack to it. At this point if you're mildly curious about this game and haven't gotten around to it (like I hadn't) just do it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is extremely well made, voice acting is top notch and the world feels very rewarding to explore every corner and the story was always pulling me in. It's the closest thing you'll get to an authentic D&D experience through a video game with the amount of freedom and mechanics for interacting with the environment and characters especially in combat. One thing i love most is the class building, so many different ways to build your character with so many cool abilities that can be used in all sorts of ways.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game will shape the narrative about what constitutes quality gaming for decades to come.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Baldur's Gate 3 is such a good game. It's just D&D in video game form, and D&D is amazing. BG3 has such an absurd mountain of unique content that manages to still keep the game interesting after several playthroughs. There are many choices and consequences to match them, there will always be content you haven't seen before until hundreds of hours of playtime. I suck at reviews but BG3 is very very good and I very highly recommend it :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☑ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☑ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game for those who are fans of TTRPGs. Larian put an amazing amout of attention into this and it far outstrips any AAA game that has come out in the past years.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is super fun to play with friends and has great community support. Can't wait to see what they do next",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Over 500 hours played, one full playthrough completed, and more than 20 others started. Baldur’s Gate 3 is truly an outstanding game. It features an engaging story, diverse and memorable characters, stunning graphics with surprisingly reasonable hardware requirements, and, above all, a world where you are the hero. The combat system is simple yet engaging, and in my opinion much better thought out than in the first and second installments. Its use of environmental elements makes every fight equally exciting and dynamic.\n\nExploration in Baldur’s Gate 3 is just as rewarding as the combat. The map is fairly large, filled with a great number of points of interest, secrets, and hidden encounters. The large number of classes and the many ways to approach the story, combined with the multiplayer mode, allow for multiple playthroughs, each time discovering something new.\n\nThe game also shines in its character interactions and narrative depth. Dialogue choices and moral decisions have real consequences, shaping relationships and the world around you. The companions are well-written and memorable, each with their own goals and stories. Combined with a rich soundtrack and immersive sound design, Baldur’s Gate 3 creates a truly magnificent experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a game, everybody and their grandma loves it, I think it's alright, you could do worse with your money but it wasn't groundbreaking or anything the masses makes it out to be in my opinion. Still, amongst the modern day AAA releases this one runs well, largely works (multiplayer issues made it impossible to play with some friends) and as sad as it is to say, that in of itself is already a good thing in 2025. I have no hate in particular towards BG3 or Larian, and although I don't feel it's overhyped, perhaps the fatigue of hearing \"OOomMMmMmgGG  BBBrbRrOOOOoThHHHeRRR BBALLLLdUUUURRSs gAAEttTEE SsiiIXIXI SEVveevNNNN xdDXXddD\" just like Expedition 33 is getting old.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "There is nothing better than this masterpiece if you are looking for a medieval interactive deep story game with replayability highly recommended. No, not highly recommended it's a MUST PLAY",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has more replayability than Batmann has tools on his belt. \r\n\r\n10/10 !\r\n\r\nAmazing game from storytelling, to character design and choices that actually matter and impact the outcome of the game <3 \r\nIt was a wonderful experience and i am happy that I got to experience it <3",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "4/10\r\nI really liked the game at the beginning, but the further I progressed through the quests and locations, the worse my overall feeling became.\r\nWhat I liked: I enjoyed the gameplay; I was really looking forward to the tactical combat, and it’s done well. There are issues with how certain skills work and how items and weapons interact, but it’s not critical and doesn’t ruin the experience. The spells with their variety of effects are well implemented, but the main thing is that the developers gave the option to complete a world full of magic without using magic at all. That’s real flexibility. That’s very good.\r\n\r\nAnd now what annoys me: the complete lack of the feeling that I’m in the Forgotten Realms. The most important thing that distinguished the first two games in the series was that special feeling — the atmosphere of a familiar and beloved fantasy world of the Forgotten Realms. What do we have here? No atmosphere. Just some references and fantasy-world attributes like castles and dragons that don’t fit together at all. The ridiculous bosses from the second chapter — what even are they? Why are they here? You came up with them and shoved them into the game because… what? They feel more suited to some random Asian game where weapons are twice the size of a person.\r\n\r\nThe biggest disappointment is the characters. All the characters are awful, absolutely all of them. It feels like they took a modern person, dressed them up, put makeup on them, and dropped them into a fantasy world. And because of that, all the characters feel out of place, like mannequins or functions. “Let’s let the player be a vampire! How original! But we’ll also let them walk around in broad daylight — because magic.” Rubbish! But even worse is that they have zero motivation. And not just zero — their motivations are completely uninteresting. There’s nothing to empathize with; all they provoke is irritation.\r\n\r\nThe only character who felt coherent and adequate was Sarevok, but he was taken from the first game and somehow managed not to be mangled by the writers.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game is so close to being a masterpiece but there are some terrible design decisions I can't get over. So much item / inventory spam. I really just don't like most of the characters- they do feel like they're right out of a horny theater kid DND instead of having weight, imo.\n\nLot of folks will understandably love it though.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Didn't care about most of the characters and the further i played the more it felt like a drag trying reach the end that i realised i didn't care about.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "What can I say? I want to like it. I really do. There are parts of it I do actually enjoy. But overall, this is very much not the game for me.\n\nAct 1 had me hooked.\nAct 2 had me slightly annoyed.\nAct 3 was bad enough I had to mod it to finish it.\n\nThe camera is a fucking nightmare, the combat feels like a slog through molasses, the RNG definetly favors the enemies. The fact I had to do almost two hours of prep work and research to make it through one large combat encounter, on Explorer mode, broke me.\n\nI played D&D 5e for awhile before I started BG3, and while I do enjoy the world building and the roleplaying aspects for the most part, the combat is honestly the worst part of this game. Theres literally no justifiable reason my entire beefed up squad with meta gear and stats should struggle with a group of lizard people, on the games easiest difficulty.\n\nThe only workaround Ive found that takes the combat from nearly an hour per conflict (obviously dependant on size of enemy group) is to cheese the shit out of items and set up a trap guantlet before starting the combat. Which, if I was playing on hard or above, I could respect. But I wasnt.\n\nOverall, BG3 had great potential for being one of the better games Ive played, but quality of life and combat/balancing issues abound doesnt make me want to play this game ever again. Finishing it felt like a chore and frankly thats just not fun.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have tried so fucking hard to get into this game since everyone and their mother has said its the bees knees but I honestly find it so boring. There's so many times I've honestly just quit because I found the mechanics frustrating.\n\nThe dialogue and characters are very well-written but the gameplay itself is just very annoying to me. I don't doubt the writing but honestly the actual combat and movement are the frustrating bits which is a shame because I really want to like this game.\n\nI've played more since writing the initial review and I still feel mainly the same. The characters are awesome but I've also run into more technical glitches with the game beginning to crash more and sometimes being unable to load previous saves. Some of the gameplay is a bit frustrating as well since you will be put into skill checks it's literally impossible to win so it just makes me not want to play the game and do something else honestly.\n\nI've paid for the game and like the characters so I'll still play more as I want to get my money's worth.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fun game, but years later still has game breaking bugs. If playing on Hard mode with one save, these bugs will delete any time you put into that run. Play Rogue trader if you want a better TTRPG",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I will share with you my very unpopular, but at least honest, opinion. Unfortunately, it's a very drawn-out and boring game. There are some bright spots, but you have to live to see them. If they cut the deliberate time-wasting in half and made the battles twice as fast, it could have been something wonderful. Otherwise, I still think the first and second parts of the series of BG are better, especially in terms of atmosphere.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "literally unplayable due to the crashing from teleportation upon meeting Raphael. Fix this bullsh*t. So many people have reported this and its still happening to people on all platforms. Why is it not fixed? Mediocre.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has genuinely excellent qualities: the exploration is engaging, the characters are well-written and memorable, and the world-building is impressive. The narrative depth is there, and when you find creative solutions to problems, it feels genuinely satisfying.\r\n\r\nHowever, the core gameplay loop is fundamentally at odds with what I enjoy in games. This is essentially a digital tabletop RPG where success depends on invisible dice rolls rather than player skills. Hidden checks are everywhere: in dialogues, exploration, combat. The only effective way to deal with them is saving and reloading until luck favours you. That's not gameplay, that's administrative work.\r\n\r\nComing from modern RPG games where failure meant I could improve my skills and try again, having my character fail to spot a trap and die because RNG said so is *incredibly* frustrating. I've never experienced this level of frustration in other games. And BTW, the game doesn't gain replayability by having this randomness.\r\n\r\nIf you love tabletop D&D, you'll probably love this game. But if you know little to nothing of how D&D works and expect just another fantasy RPGs, this game is not for you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game worked before and I guess it's broken now? Why are they fiddle fucking with this still? Can they go away and make new good games if that's what Larian is really all about?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is excellent! Played for 120 hours on one save, got super invested in the story and was excited to see the ending. Then they patched the game, and their hotfix means that I can no longer save or reload saves after entering the lower city of act 3. Game crashes no matter what, I can't finish the story and I am incredibly dissapointed. If you want to waste 200 hours of your life Destiny 2 is always a good choice.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was very fun for a while, but a few patches ago I suddenly had issues with it crashing randomly. At first it was just annoying, but with the last couple recent patches it went from just crashing to desktop to crashing and locking my PC up, with the only option being to fully shut down and restart. I've tried all the recommended fixes, and nothing works. I know I am far from the only person experiencing this issue and at this point until they fix what they broke, there's no reason to keep the game installed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A mediocre game with numerous known bugs even after five years of development. In 2023, it was still playable. In 2025, playing this game is pure torture. For some reason, the price remained the same. Will complete the main plot at trash it instantly.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As a lover of turn-based strategy and tabletop D&D I really don't see the appeal of this game. What is hyped and praised as a thrilling action-packed campaign in reality is a boring, horrible-paced slog with zero replayability and variation. After act one the quality drops off a cliff and just feels bloated.\r\n\r\nIt's all window-dressing, every choice eventually leads to the same outcome. No, really. Try and avoid Shadowheart at the start of the game, see how often they thrust her into your path before the game just gives up and drops her magical macguffin into your bag with zero explanation. Want to be evil? You'll still fight the same enemies and go to the same places just with less help. \r\n\r\nThe dice rolls outside of combat only feel like they exist to decide if you'll be inconvenienced or not, and these become worse on subsequent playthroughs when you know what you'll lose should you fail. \r\n\r\nThis game is a perfect example of why I don't listen to public opinion on what a good game is, as they'd rather insist that you SHOULD like it when in fact a lot of the time you might only like it because it's popular.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "If you never played Dungeons and Dragons then dont buy this game, you will not understand anything because the game is super unfriendly to beginners and doesnt explain anything at all. After 2 hours I had still no idea what im doing. Fortunately steam support is so good that they refunded me even tho I went over 2 hours a bit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well, as I have played every game of this Sword Coast / Faerûn campaign world I greatly disapprove D&D 5e ruleset. I wish game mechanic could allow 1st/2nd edition Ad&d brutal rules as in original series.\r\n\r\nThe overall bling bling and glitter Monty Haul everywhere - where is that ugly gray world of disappointments? Where is Thac0 and\r\n\r\nGame is pretty nice though, but at 60€ it should include a warning that game suffers same disease as Fallout series; the grim humour is missing and hypersuperduperfantasy with exaggerated superthis and superthat. Fortunately I haven't seen a Build your own stronghold yet. \r\n\r\nWhen we get a GhosRecon like campaign world?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't finish Act 3, they don't show the prices for dialog options on the dialog choice 85% of the time, you have no idea when you're spending money in dialog, so I lost 10,000 gold pieces and several hours of playtime. Because of a design decision. 180 hours and I won't beat the game because this stopped being fun. And they're apparently done with this game, so theyll never fix this.  There is also a massive bug that stops companion affinity from gaining in Act 3 dialog. It's maddening. You can't get the endings you want after 150 hours of working your party that way because of Larian's unfinished bugs. Hate to leave a negative review, but people should know that Act 3 of the game remains an buggy, unfinished mess. COME BACK AND FINSIH YOUR GAME LARIAN, YOU CAN AFFORD IT.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Graphically, it is a beautiful game but it feels a chore to complete.\n\nThe inventory management is very simplistic and acquisition of new kits is not inspiring.  The quest management is also too simplistic.\n\nI don't like the NPC romance or the camera angles.\n\nIt's good you can mod it and it might be good playing with a friend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An otherwise decent game filled with game breaking bugs (which have persisted since launch) and constant Vulkan crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A tedious inventory management busywork simulator with occasional bits of gameplay and story attached.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this for about an hour and fell asleep half way through and cant give it back because the text was campy and dragged out that again literally made me fall asleep. The gameplay feels really clunky and boring. In my head all I can think about is wow Fire Emblem 3DS and Switch was just this but so much better. After I tried to plea with steam to give it back and explain why I exceeded the 2 hours I tried to give it one more shot. The button layouts and just clunky gameplay made me skip turns. Not to mention healing is basically worthless since you get a certain amount of mana so there goes my cleric build spending more than 30 mins creating a character with the most throat punching character creation ive been dealt with. the perks and others skills that you can add on from the beginning was just not explained that much more so told and if tried in battle it does whatever and youve wasted that mana. Fire Emblem was more engaging than this and someone who likes that kind of combat sad to see its lazily done with basic character movements and now fluidity and camera movements. The worst part why I cant get through this game is you cant skip the enemy attacking you or make it faster. you have to watch through the whole thing making fights last so much longer and if youre dying or like me getting used to combat and your characters will get hurt. I wanted to like this game because I love DND, but I went into this game completely blind and I shouldve done my research first without letting my love for DND blindside me. The dialogue is boring, the gameplay is boring, getting through the map is so slow, a 3ds game from more than 10 years ago made this type of gameplay and game just so much more better. The dialogue in that game was more engaging than here and theres no voices! And I have a theory as to why that is. its because the characters are bland and 1 dimensional. you have angry warrior lady, sarcastic warrior lady, horny vampire. Theres no depth unless you sit through most of the dialogue which is more than half of the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not necessarily a bad game ( overrated tho ) but a terrible baldurs gate game. Returning characters like sarevok are done dirty and cutting rtwp for turn based sucks to say the least considering it's slow af and just  not that fun compared to other turn based crpgs like rogue trader tbh.\n\nIf you like the OG games try kingmaker or pillars of eternity instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you're looking for a game like Divinity Original Sin (either 1 or 2), THIS IS NOT IT!!!\r\nThe story is 10/10, the voice lines are 10/10, if you're looking for the quality of life stuff it seems similar. Though the combat gameplay is utter bullshit. THIS GAME IS A MISS SIMULATOR!!! I can't stress enough how many times I had to reload a save in a combat or wanting to have a result that fits my roleplay style... I get that people say that you should \"let the dice tell the story\", but that's just not me. I want to burn shit if I set them aflame, I want to stun a person when I cast a stun spell, I want to hit a target when I give the order, not depend on the fucking dice! \r\n\r\nAltogether it's very much like D&D, dice are the whole gameplay - RNG - RNG is everything, dialogues, combat, trivia... everything is Dice based! That ruins the experience for me! If you like that sort of thing where the dice determine everything that happens in your run, or if you don't mind a \"Load Screen\" or \"Miss\" simulator, give it a try, otherwise, don't... It's a waste of money. DoS and DoS2 are FAR better than this, aside from the story and voiceacting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm only 2.5 hours in but this is not matching the hype. I liked Original Sin. This seems, strangely worse than that game. The dice rolling was fun at first, but that thrill wares off quickly. I really don't know what the story is beyond just trying to get a bug out of my head and the heads of others. The combat with the spell slots, I assume is a DnD thing, is a bad mechanic. The graphics look like Dragon Age Inquisition but zoomed out and the camera is only one step up form a poor 2000s platformer. Why  is this game so popular?\n\nEdit: So I gave it another 5 hours but the story and the characters are just not hooking me. For a game that I feel relies on its story, pretty heavily, I can't say its a good fit, at least not for me. The combat, Original Sin had its share of problems, with the DnD stuff and all the environmental shit you don't know until it happens, its a save scumming marathon.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Solid...\n\nLost 132 Hours of Progress on 3 campaigns including one muitipler one. \n\ngoogles it and found im not the only one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is probably a great solo game, but my hope was to play this co-op, and it’s so tedious, I lost any desire to play after a few hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game ever played. On easiest mode and impossible to understand how to play. Tutorial less than worthless. So many better options.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't hit that right for me. It's not a bad game by any means, I just don't like it. Not a fan of the story, and very few of the characters hit that well for me. I love the game system itself, with the character creation and combat especially very very fun, but until there's a mod which gives me a whole new story to play with or a DLC that gives me a new story and characters I just can't see myself coming back to it. If you've seen parts of the story and like it then by all means get the game, but forcing you into the singular story is just not what I want in a DND game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was looking forward to this game but ive reached a point where its near impossible to play. \nim 18 hours in, there are no tips and pointers, if you dont have friends who play this and can advise/help you then dont buy it. \nI understand the curve is steep to learn but i mean... at least give some tips. waste of £50 :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game seems like a very high quality product. There is a lot of agency and freedom given to the player regarding quests, choices and battles. \n\nUnfortunately, I hate few aspecst that make it awful to play. Inventory management is tedious. Movement speed and overall gameplay are too slow. Battles are a slog. Redoing those drawn out fights is really annoying. Enemy AI is often quite stupid. The whole game feels both overwhelming and boring at the same time. Weird.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not my thing but still enjoyed it i guess. should have clicked the family friendly version on my playthrough because when the first romance scene came up i almost threw up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "options are garbage during dialogue of any importance. Military NPCs don't seem to follow basic protocols regarding chain of command. Map is attrocious to navigate, it's like no one has hands to do the most basic navigation of minor cliffs and hills. Player Characters seem oblivious to the goings on around them, like the basic act of following who is doing the locking, so that you know where to even begin to bother for keys. Intelligence and Wisdom may as well be permanently set to 1. You basically have to cheat to get the game to work remotely decently, or just choose to murder everyone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is great I just wish there was a 3-4 single PC local multiplayer.\r\n1997's Golden Eye for the Nintendo 64 had 4 split screen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely buggy. characters being unable to be removed form the party, soft locks at the beginning of the game requiring reloads because you died on a trap causing the room yoru in to infinitley explode. And honestly poor character custumization. especially for Dragonborn. Skyrim has better custumization of lizard people. You cant place scars or tattoos and your options are terribly limited. Not worth the heavy price. definitley wait to buy when the price is lower.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's(probably) not a bad game, but it has a number of problems(which will probably never be addressed)\n\nThe perforance is.. sad, the game struggles even on an RTX 3060 around medium settings at 1080p.\n\nThe file size is so overly bloated, it's rediclous.\n\nSometimes the world will take forever to properly load in(as in you can sometimes walk right out of the game world, or into an otherwise unnavagatable spot(like inside a boulder)).\n\nHas terrible camera controls for vertical spaces.\n\nAlmost all the team mates are entirely unlikeable(I realise this is probably just a me thing).\n\nCompared to other D&D games the character building is, just sad, it's been gutted so badly.\n\nLevel cap of 12, tells me it's unfinished.\n\nA lot of spells and abilities even in those 12 levels worth are just missing.\n\nOne adult scene in particular(that you do have to go well out of your way for, and get plenty of warning, along with multiple chances to back out) isn't even legal in the US(thankfully I don't live there, but still worth mentioning)\n\nHas a good number of missable quests,(as an example:  oh, you needed a rest, well too bad, this quest in a zone you haven't even gotten to yet failed, the child is dead, with nothing you can do about it other then start the whole game over) \n\nMod implimentation is... bad... they should have just done the normal thing instead of, well, what they went with, Nexus may not be the most friendly of places, but it works properly far more often.\n\nAs I started with, it's probably not a bad game, but it's not a worthy sequal to Baulder's Gate II, the shift to turn based was a great idea, but the rest of it feels half baked in comparison.  I may get around to actually playing through what they bothered to make here someday, but for now, the file space is more valuable elsewhere used for programs that run at a decent rate.  Wish I could review it positively, but after playing Neverwinter Nights, along with the first two Baulder's Gate games, this just doesn't stand up, it actually fails quite spectacularly, obviously spent far too much of the budget on making it pretty, rather then making a good game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everytime I try and play another top down rpg, it just reminds me how much better pillar of eternity is than the game. I'm playing. \n\nCombat in this game is like a 2 out of 10. Can't really even get far into the game because I just die over and over. I end up save scumming the whole time.\n\nThe theme is really lame and gross. \n\nThe characters are lame and have overly dramatic and childish (theater kid like) backgrounds. \n\nJust overall missing good fantasy vibes. Feel more like a ridiculous story line made up by dnd nerds than an epic fantasy. \n\nIdk maybe Ill come back to it but more than likely Ill just play PoE 1 again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There’s a lot to like about Baldur’s Gate 3 - graphically it’s amazing, lots of variety in environments and enemies, loads of character classes and abilities, there’s a lot of content, high replay value and you can play it with friends… that being said, I can’t excuse it for what I think is a jumbled and wonky story, bad dialogue (and far too much of it) and boring combat. It’s not that I think the game is terrible, but it really isn’t to my tastes and I honestly found it a drag. My list of gripes are:\n[list]\n[*]I don’t think D&D mechanics make for a good video game. I don’t think rolling dice or the mix of actions and bonus actions makes for particularly interesting gameplay. Some classes have very little to do for the entire game, others have almost too many spells to pick from.\n[*]Too many combat scenarios have a ton of enemies (and if you’re unlucky, a ton of allies as well) and they just take forever to take their turns.\n[*]Inventory management is a royal pain in the backside - there are far too many items.\n[*]It feels like you rarely get good gear unless you know how to combine quite specific abilities by having a good understanding of D&D mechanics.\n[*]I didn’t like the entire setting of Act 2, it felt very disconnected and I didn’t care for it. I think they missed a trick by not making [spoiler]the Underdark (which was a visual treat)[/spoiler] the entirety of Act 2, which is much more interesting and connected to the world.\n[*]I couldn’t stand just how much [bad] dialogue there was. Everyone and their dog takes the garden path when saying anything, including random NPCs you come across - everyone's just dying to monologue at you. There is such a thing as too much dialogue.\n[*]The narrator speaks far too often, for too long and frequently tells you how you are feeling which I found annoying. I would’ve just cut them out entirely.\n[*]I didn’t care for any of the companions, they’re almost all special snowflakes of one flavour or another and I didn’t buy into them, their backstories or their personal quests.\n[*]The villains weren’t very compelling or threatening - a lot of talk and not much action.\n[*]There were too many characters and plots going on all at once and it became a jumbled mess that was easy to lose track of. There wasn’t any real tension. I also didn’t like that the whole part around [spoiler]getting the tadpole out of your head[/spoiler] actually had zero time pressures despite it coming across like it did.\n[*]Some cutscenes were so janky or random that we audibly laughed out loud at them, including [spoiler]the githyanki monks attacking the camp.[/spoiler]\n[*]They brought [spoiler]Sarevok[/spoiler] back only to completely assassinate his character.\n[*]The puzzles were fiddly and tedious.\n[*]Quite a few areas feature a lot of verticality and the camera really struggled around them, it made it hard to track where you were and took away from the scenery.\n[/list]\nI don’t think this game is without its merits - it’s clearly well-made and with a lot of passion behind it. It doesn’t surprise me other people like the game, it just wasn’t for me as I’ve played a lot of games now and BG3 really didn’t wow me like I was hoping it would. Their last game DOS2 has far better character customisation and combat (minus the environmental effects overload), and a game like Planescape: Torment has an immensely more interesting setting and story. Swap in DOS2 combat and writing on the level of Planescape: Torment and this game would be an absolute banger, but as it is it fails on some major fronts in my eyes and I felt bored and disengaged for most of it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Baldur's Gate 3 is a game where one of the most climactic, built up, powerful boss fights in the game is against a demon that has so much \"theatre kid\" energy he has his own Disney villain vocal theme song and it really had no impact on me because that's already what interacting with every single character I encountered in the entire game felt like.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As of hotfix 35, the game has become unplayable on my way above spec PC, with crippling lag and frequent crashes. Having eliminated all the other usual suspects, I can only assume that in optimizing the game for other platforms, Larian have broken the PC version.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just... boring. Story is so mind-numbingly boring... there's something in your brain. You gotta get it out or you'll turn into a monster. After 70 HOURS I don't know anything more. Is there more??? It shouldn't take 70 hours... The combat is so clunky. And I play THREE DND games on most weeks. Like, legit 3 dnd games, most weekends. And I hated this combat. So slow. So boring. The companions? They're... okay? I guess? I don't really care about them or their personal stories at all. \n\nI really, really wanted to like this game. I just... can't recommend it. It's just so damn dull.\n\nEDIT: Also, LARIN.... this game is supposed to be woke and yet I can't use WASD to move my character?? I have carpal tunnel. Do you hate disabled people Larin??? I feel like you do.\n\nEDIT 2: Played additional 22 hours. Game is still incredibly frustrating. I want to finish it just so I can tell everyone to shut the hell up when they say its the best game ever and I \"need\" to play it. But god, is this game so frustrating. Doesn't tell you ANYTHING. In a real DND campaign, okay, but in a video game, you have to set expectations, you have to let your players know what they can and cannot do. They don't tell you anything. If I didn't have 2 friends literally telling me what to do and where to go (plus google and reddit), I wouldn't get anywhere in this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The combat and the general systems interplay is genuinely fantastic, however, this is an RPG and it's just terribly written. Act 3 functionally isn't worth playing and it's clear that there's a large amount of cut content. I didn't particularly care for the companions, the villains are kind of pants on head stupid if you take a moment to think about it and overall the conclusion is just not there.\n\nYou've heard of the game. Buy it on sale because only half the story is worth playing. Enjoyable just poorly concluded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I waited a long time to play this game, until after all the hype died down so I could make a more deliberate evaluation.\r\nGraphics are great. The terrain is beautiful. The monsters and other enemies have fantastic detail. \r\nRP is good. There's sexual innuendo - or outright lechery - in many of the conversations. I suppose it could be entertaining for someone who wants that from the game, but for me the sexual tension frequently gets in the way of what I really want to discuss with the NPC.\r\nGame play is poor. Sending your party rogue ahead to scout out encounters mostly gets the party rogue injured, and the scout has to make it back to the other party members in order to get them to roll initiative for an encounter. Further, the GUI is extremely counter-intuitive. Casting spells and scrolls should be a matter of 2 or 3 clicks at most. Using combat options should be 1 click and, MAYBE, a confirmation box. Rather, activating Dash or other abilities requires that you click the ability then, for some reason, make a random click somewhere else on the screen to confirm. I tried to cast a spell off a scroll: 15 minutes of my life burned up. Found out later that the scroll only casts correctly from the hotbar, not from inventory. Middle mouse to look around? Frustrating, because half the time the pressure on middle mouse causes left or right mouse clicks which starts your character moving or something else. Look around should be a key hold, somewhere on the keyboard. \r\nI can't recommend this game to anyone who wants a classic, mechanically intuitive dungeon crawl. In that sense, something like Solasta is a better choice.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lol wish i could try and beat the game without it constantly giving me a BSOD before i can even hit continue. fantastic. millions of dollars larian gets and every massive patch renders my PC even more useless",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ultimately when playing this game, I just wanted it to be more like DOS 2. While the story line, cinematics, and character choices can be interesting everything else was too DnD. Very little choices when it comes to character customization, most of the choices is around gear, which is all in set locations. Which leads to a \"right way\" to play to optimize your character around gear, and story line choices.\r\n\r\nIn the end the game is \"fine\" but I would rather buy DOS2 again, then pay for this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "camera is absolute garbage. companion AI which only function is to follow the leader keeps not following the leader but instead running past the leader straight into traps. \nplaying this feels like a chore",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unfortunately the devs do not support gnomosexual relationships as there are no gnomes for me to commit gnomophilia on. this is pretty regressive, especially considering the devs support humo-elven relations. this is a big no-no as everyone knows that gnomes are genetically superior to elves and have much bigger weiners.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat is absolutely terrible. I really want to like this game, but I cannot get over just how tedious the battles are.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just saved the druid grove from complete destruction, without exploiting the situation at all, and yet the grove turns against me for reasons not explained to me.\nThis is more than 2 years after this release, and this major issue is still in the game.\n\nI think I've done enough of quicksave->gamebug->quickload to leave a negative review. People say 3rd Act is unpolished and rushed, yet I haven't had a single playthrough where some serious and obvious flaw of the game didn't force me to reload in even Act 1.\n\nThese flaws range from massive narrative oversights to the \"shove\" action working completely arbitrarily.\nIt's true that you have more options than in most other games, except that these options won't work half the time, and you never know which half you're currently in.\n\nI truly wish this game were as great as the fans claim it to be.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely adore this game and will likely spend the next year replaying it, however, I feel a dark urge telling me to post this review to vent out my frustration.\r\n>undead\r\n>not humanoid\r\n>not enough resources\r\n>not enough movement\r\n>critical miss (99% chance of success)\r\n>the f***ing faith leap trial\r\nThere is no other game in the universe that can compare to this level of abysmal bullsh*t",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to like this game. I’m completely new to the genre and I tried this game like 3 times before I decided to completely give up. If you are new to the genre don’t even bother. The game doesn’t explain absolutely anything. And you may think that just looking through the menu and trying to find out yourself how to freaking finish your very first battle will suffice but that’s just wishful thinking. I tried that very first battle over and over again with no success. I’m not the type of person that starts looking for guides on the internet just to finish a first battle in a game . It seems absurd to me that a game that is so popular doesn’t even bother to explain to the new player absolutely anything. I can’t possibly know how the story is because I can’t even go further . So if you are like me don’t even bother because you will simply lose your mind!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This Is a Fantastic Game dont get me wrong, but evry damnd time I get about 20 hours in on honer mode the game just deletes my only fucking save file. Ive lost 50+ hours of gameplay  trying to get he honor mode achevment just for the game to delete itself.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have tried again, and again, and again to play this game.  I always make a mistake in trying to play these types of games and I always come to the same conclusion.  They are just not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really tried hard to like this game, but every time I played, I just hatet more. I love TB RPG, my game library most of it TB RPG, but nothing that give me bored to death each time I play. This game was succeed to make me fall asleep i front of my PC when in battle mode when there's a lot of enemy encountered. \n\nI guess this game was not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game would be a lot more enjoyable if the camera would follow you.  I spend half the game trying to get the camera where I need it to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1. Boring\r\n2. DnD mechanics\r\n3. Characters are stupid and unlikable\r\n\r\nDivinity2 >>> BG3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Me gusta que no sea suficiente con solo subir de nivel y buildearte algo. No me gusta que subir de nivel y buildearte algo sea algo tan inútil. Tuve que bajar el nivel de dificultad al mínimo posible, de alguna u otra forma me las apañé para llegar a Baldur's Gate, tuve que hacer maniobras locas que, visto las cinemáticas, me resulta claro que no estaban planeadas por los desarrolladores. Si quería seguir el \"camino del juego\", no pasaba ni del Under. Así vencí a Cazador, pero ahí llegó mi límite. \r\nEl Claustro, o como se llame, cuatro Fieles o más, spammeando ceguera. Sin importar en dónde posicionara la estrategia, todo terminaba en un arrinconamiento. Si no fuera por lo de la ceguera, podría hacer algo, mi baza ganadora es Gale, pero la nube de ceguera imposibilita el lanzamiento de conjuros, y la toma como obstáculo. No hay nada que hacer. Mato a un Fiel, con lo que cuesta, y aparece otro. Logro matar a dos, pero ya es tarde, para entonces Gale está out, casi todo el grupo está out, yo estoy out.\r\nQuiero entretenerme, no ésta basura, no quiero pasar mis pocos ratos libres volviéndome a estresar, la idea de jugar debería ser contraria a eso. Una decepción de juego. Si así es la dificultad mas baja, las demás son una pared.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You can fail honor mode just by stupid conversation before the brain. jl",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, since we're all gonna die, there's one more secret I feel I have to share with you\n\nI did not care for \"Baldur's Gate 3\"\n\nWhat?\n\nDid not care for \"Baldur's Gate 3\".\n\nUhg.\n\nHow can you even say that, Dad?\n\nDidn't like- Didn't like it.\n\nPeter, it's so good. It's like the perfect RPG.\n\nI- This is what everyone always says. Whenever they say, it's like, \"Oh my...\" Everyone always says-\n\nJennifer English, Neil Newbon, I mean,\n\nListen-\n\nYou never see- JK SIMMONS?!\n\nI know, l uh eh, FINE fine actor, did not like the game.\n\nWhy not?\n\nDid not- couldn't get into it.\n\nExplain yourself. What didn't you like about it?\n\nIt insists upon itself, Lois.\n\nWhat?\n\nIt insists upon itself.\n\nWhat does that even mean?\n\n'CAUSE IT HAS A VALID POINT TO MAKE, IT'S INSISTING!\n\nIt takes forever gettin' in. They spend nearly fourty hours, and then- You know, I can't even get through it, I can't even finish the game. I've never even seen the ending.\n\nYOU'VE NEVER SEEN THE ENDING?!\n\nWell, how can you say you don't like it if you haven't even given it a chance?\n\nI agree with Stewie, it's not really fair.\n\nIt's outrageous.\n\nI have tried on three separate occasions to get through it. And I- I get to the scene where all the guys are sitting around at the camp-\n\nYeah, It's a great scene-\n\nAnd Lae'zel-\n\nI love that scene.\n\nIt's NOT a great-\n\nIt's been noted in every annal.\n\nI have no idea what they're talking about. It's like there speaking a different lan- That's where I lose interest and I walk away.\n\nThey're speaking Githyanki!\n\nThe language they're speaking is a language of subtly, something you don't understand.\n\nI love \"Disco Elysium\". That is my answer to that statement.\n\nExactly.\n\nWell there you go.\n\nWhatever.\n\nI like that game, too.\n\n-------------------------\n\nactual review, positives quickly, BG3 has a good amount of player choice but it's nothing completely revolutionary, it's around the same tier as FNV (which is impressive but it's nothing new) and there are a couple of strong moments towards the end of act 2 and act 3\n\nnegatives now, this game has a terrible early game (theres a reason people like starting at level 3-5 in tabletop) that feels directionless and causes the pacing to have significant issues that persist through the entire game. i tried my absolute hardest to stay invested in this games narrative but its just genuinely not very good.\n\nthe characters are also not great, there are some okay characters like gale and shadowheart, but the rest are either actually unfinished (wyll and karlach) or just stupid (lae'zel and astarion). idk, when i buy a narrative driven character based rpg, i want my narrative to be driving and characters to be based.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game for obese quirk chungus lesbians with no friends",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Apart from the glaring issues with broken OP builds, the story line progresses at a glacial pace. Only recommended for players who truly enjoy the 5th edition rules and the rather dull fights that come with it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Every ugly man has his own unique charm.[/h1]\nWomen as the Trap of Visual Diversity.\nFemale character storylines lack depth and substance, while male characters are richly developed.\nMale characters are dressed appropriately and prioritize practicality, while female characters are often overly exposed, deliberately emphasizing body features, and their clothing is incomplete.\nThe game text contains multiple instances of offensive and derogatory language targeting women, violating the principle of gender respect. Such crude and inappropriate translations constitute an insult to female players.\nIt really ticks me off that you have to end up as a couple with your teammate just because you two hit it off in the game. It’s like the game puts romantic love on a pedestal and acts like it’s the be - all and end - all. And let’s be real, living together isn’t just for lovers—friends and family can live under the same roof too. What’s more, physical intimacy isn’t the only way to show love at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a dream come true for the people who love Strategy based RPG combat like Divinity.  It can be even considered a masterpiece, but as a person who hates those kind of d&d games, rolling dices, slowest and dumbest resource management combat style ever, it's a literal snooze fest. My friends insisted me to try it, even though they know i hated the genre, but if you dont like the style it would mean nothing to you. Stay away from it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's almost amazing how this game has changed so much from first release, not because a lot of the changes were needed, but instead because the company allowed itself to be pressured into those changes by rabid fans that disliked key aspects of various characters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never make it very far, every single roll I make I'm dead within a few minutes and have to start the game from scratch. WoW much better of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they made a game to promote fruit loops while trying to play D&D. Thankfully EA the parent company was bought by the Saudi Investment fund. If they don't take the fruit loops out I wont buy anything further from biocrap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "***Gameplay:***\nProbably the worst movement and camera system I've seen in a long time. The combat is a slog to complete even on easy mode where each encounter feels like an eternity. And make no mistake this isn't coming from someone who dislikes turn-based combat, but even the south park games did it better for crying out loud. \n\n***Story (or what I managed to see of it before uninstalling):***\nI find most of the characters dislikable for one reason or another but at the core of it I just did not care for them. And this games main story being another example of the \"le race against time because the protagonist is dying\" trope, that got old back in 2020 with Cyberpunk 2077, does not help its case.\n\n***Overall:***\n\nProbably a 4/10, some aspects on their own could be quite good but when put together make up a house chore of a game. Do not buy if you expect a story with likeable characters like TWD or Witcher 3 or fun RTS combat",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While I can grasp the reasoning behind physical indulgence, hand holding, however, is quite beyond the pale, i cannot in good conscience support this wholly improper display of affection.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried getting a refund, not as fun as i thought honestly",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Clunky, horrible and confusing controls.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda a mid game tbh, this game was gifted to me granted. However, just didn't like it. I feel like it's a bit over hyped and overly praised for being just another turn based RPG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if it isnt more woke GARBAGE brought to us by the feminist nazis and the lame stream media, I can confidently say this slop doesnt have one original included in, i lacks the finer rpg aspects that other games such as fallout 4 have, now fallout 4 is a real game worth playing a game where unlike this your choices have meaning, it also lacks the well written side characters that games like fallout 4 and avowed have, now those are two good heckin games, also lets be real this isnt balduars gate this is \"baldar gay\" i dont think I found one straight cis white male throughout my entire playthrough, even my own character ran off in the woods to get railed by a vampire ABSOLUTLY SICKENING!!!!  larian should make easier games like candy crush because frankly RPGS are above their paygrade",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring and no depth. if you want a good DnD game get pathfinder: wrath of the righteous. only thing BG3 does well is graphics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not terrible, but it's not the Divinity Original Sin 3 I was hoping for...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Newgen slop\n\nedit: it's also a bug ridden piece of shit, every session I encounter a game breaking bugs that hinder any kind of progress",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly overrated, story was ass, combat is super slow and boring(Xcom combat mogs it), Co-op is infuriating to play(especially if someone else has played the game before), all the main characters suck except for Will which I have no strong feelings towards, he just isn't super annoying like the rest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well what do you know, evangelical Christians were right since the 70s - D&D is really an outlet for satanists and furries. \r\n\r\nAlso the gameplay is so slow it will drive you suicidal. Take it from someone who finished Divinity Original Sin and never wants to repeat the experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I made a ranger, and the mind flayer killed me when i rolled a 1. Why did I waste my time and money on this game? Fucking terrible. I play games to have fun.  Dying, whilst there being nothing I can do about it, isn't fun. It's infuriating. I play games to feel powerful. That was the most powerless I've ever felt. Terrible game. Do not buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Add useless feature like LGBT+ voices no thank you. I used to love this game but instant delete my playthrough amd probably never play this game ever.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "not fun insanely difficult and if you don’t have friends to play with, makes it even worse. If you don’t know anything about DND, don’t touch it because I made the mistake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most boring BG I have ever played. The combat is incredibly unrewarding, more than half the spells from D&D dont exist which makes no sense, the story is incredibly limiting with choices being of almost no consequence and I dont understand why people love the companions. They are all trash. I can see why redditors love this game, but actual people will not like this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The recent focus on adding pronoun options feels unnecessary and out of place. It gives the impression that these changes were made to follow external pressures or trends rather than to improve the game itself. I would have preferred the developers to focus on expanding the story, fixing bugs, or adding meaningful gameplay content instead of implementing features that are useless and only represent attention-starved TikTokers making things up just to feel relevant. \nI’m worried about the direction the studio is taking, as it seems to be promoting terrorists ideas that feel extreme and harmful.\nI hope steam could refund the game who is not playable anymore.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Really fruity. Stupid game play and story",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Visually great and a good story so far, but the combat just doesn't work for me. Really slow with lots of status effects, side effects, spells you can only cast twice before sleeping, lots of randomness, you could do 4 damage or 24 or just miss entirely on a spell that you have to sleep to cast again. Bad rolls can easily wipe/save you. Just got done getting chain \"frightened\" through most of a fight, meh. Came from Exp33 which was amazing so maybe I'm just expecting too much.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most overrated game of all time. The game play is mediocre and you really need to put time in to understand everything and start having fun. It's better to take that time and money elsewhere.\r\nSure, there are a lot of dialogues and game styles, but so what.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most overrated game I've ever played in my life. The graphics are good, and the story is fine. That's it. \r\nHow this game got so much false praise, I will NEVER understand. Is our market so barren of good D&D games, that literally anything that boots from a standstill, is totally ok?\r\n\r\nThe hardest part of this game, is figuring out how to play. There's no functional tutorial, and if you aren't familiar with every D&D mechanic by memory, you will not be having a good time. Pretty much nothing translated well enough to the game mode of this version of D&D, for me to recommend it to anyone, looking for an enjoyable, single player experience. \r\n\r\nI literally couldn't tell the difference between intentional, poor game design choices, and the bugs themselves. Not kidding, even a little bit.  It's very deceiving in just enough ways, for it to take way too many hours to realize how bad the system implementation is, and caused me to not be able to get a refund.  The first area plays as you would expect, from just looking at it. It looks good, and outside the horrid camera angles, it feels and plays good, too.  And then as soon you leave this area, which as far as I can tell, was intentionally padded, (just long enough with extra cutscenes/whatnot), to make it so you won't be within the time played limits, of the refund period.\r\n\r\nThe only people who might enjoy this are D&D veterans, who are going to play in a group with each other from beginning to end, without any seriousness whatsoever, and are totally ok with all the bugs and idiosyncrasies, because they won't affect how you play the game. \r\n\r\nThe AI is painstakingly bad. Once you do figure out how to move your character around, you'll see the impossible to understand mechanics don't even matter, as every battle can be won in the exact same fashion. Just kite enemies off to one side, and blast them down one at a time, as they become within range, of your basic auto attacks.\r\n\r\nThe only positive spin I can put on this, is that it might be like a Bethesda game for some, and the bugs would be part of the charm.  I haven't been this disappointed with a full price game in about 5 years now, and it has caused me to halt paying full price for anything again, for a very long time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is basically just Divinity with a slightly different story. I was very disappointed when I realized I payed a lot of money to replay a game I have already played. If you have played Divinity, I do not recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overrated af. I just wanna play it; Can I please get some information on how this game works? NO!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had high expectations based on the universally positive reviews both online and from friends and family. I wanted to like it and share this experience with friends who are deeply into it, and I just can't. \n\nGame play is straight out of the 1990s and hasn't advanced once bit since BG1. They even added a very intrusive dice roll animation just to make sure any immersion in the game is impossible. This isn't a computer game, it's a tabletop game simulator. Dice rolls and turn based combat are limitations of table top games, not features. Simulating them is bad game design. \n\nThe writing is just awful, no taste at all. Dialogs are menu choices with only stupid cliche options. Because the protagonist's lines are not voice acted, dialogs never feel like conversations, but more like overhearing someone talking on the phone. Party members are one-dimensional and incredibly annoying. It's like a D&D campaign written by a 12 year old. Turn based combat is incredibly tedious. This was fine 25 years ago, but it's just not acceptable in the 21st century. It's completely impossible to care about the plot, if there is one, because all the characters are so fundamentally unrealistic and un-likeable that it's just impossible to care about them. I want them to suffer and die. I wonder if this game was written to appeal to nostalgic memories of playing table top games in high school. I don't have such nostalgia so it falls completely flat. \n\nThe graphics look plastic and cartoonish and the artwork is just standard fantasy cliches. The music is incredibly twee, repetitive and annoying. It just looks cheap, cartoonish and lacking any kind of taste, almost like it's AI generated. \n\nUnfortunately this is the worst game I've ever played by a very large margin. I really wanted to like this. I was expecting something like Oblivion or Skyrim - other fantasy based RPGs, that offered vastly better game play, art work, writing and even graphics almost 2 decades ago. \n\nThe disconnect between my expectations and reality was so vast that I had to double check if I hadn't downloaded a parody game by mistake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game....ugh ok, I loved D&D trust me i really did, i loved 5e so long as there wasn't too much 3rd party shit or LGBT crap. Don't get me wrong, I welcome everyone to my table but my table is not for everyone, feel me? That all said...this game is kinda ass. you play a Tav (because why the fuck would you play a premade?) and all that makes you want to do is Dark Urgey stuff. If you play a D'rge you either go full murder hobo which goodbye plot (always happens with MHs) or you try to play a good D'rge in which case you might as well have been Tav.\n\n\n\"Oh but Scripted, what about the MODS?!?!?!\" I hear your tight ball whine cries, and I say F. U. C. K. THE MODS, they had one good species mod for Aasimars and they took away the in combat flight. Worst game since Star Field Congrats Bethesda you WON!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE ITS GMAES the the combat turn base game slow me down and kill me instantly and because of this game I found out I have a deep hatred for dungeons and dragons  I DONT RECOMMEND THIS GAME ON SOMEONE  IT FEELS LIKE PLAYING A BOARD GAME THAT YOU DONT WANT TO PLAY",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still waiting on a mod to remove RNG from skill and dialogue checks and make them deterministic.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "laggy and real time combat mod does not make it fun..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "such a overhyped overcomplicated piece of garbage, i cant even sneak next to anyone and shank them in the mf neck without having to do 584943974978294749375873873875387459248759842589743 actions before hand. 0/10 does turn based combat so shit",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "What a time suck. Body type? Whatever, ya need a tutorial just to sell more than 1 item at a time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was trying to find bird game 3 and this dogshit showed up",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Received this as a gift. I've only played it a couple of times. Based on my overall experience, its just not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game crashes a lot on an updated Apple M4. Great game and all, but not worth 60 bucks if you have to force quit and reopen the game all the time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nothing will slow you down or make you more infuriated than playing an online game and failing the the buggy faith-leap trials. unless you cheese it like everyone will suggest you do (noone online actually gives you anything even close to help other than \"JuSt FoLlOw ThE PatH\") it is near impossible. ready to suddenly stop your game and spend hours on bad design?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 33 hours of play, I still do not care about Mind Flayers or Githyanki, and find it hard to like any of the characters.  There's some Druid guy that I kind of like, but druids have always been lame - pitching a fit when you step on a leaf, and shape-shifting into a bole-weevil or whatever.  Nor do I care about Drow or Tieflings.  It's like they picked all the least cool things about D&D and focused on those.\n\nUPDATE:  I am still slogging through this thing at 13 more hours.  I finally got to Jaheira and that was nice for a bit.  I will keep trying, but I'm at almost 50 hours now.  The only thing keeping me going is how bad the Homer Simpson season of Fortnite is.  YOU ARE ALMOST AS LAME AS SIMPSONS FORTNITE.  Seriously ... this could have better emotional catches.  Did 10 year olds write these social interactions?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Definition of mid\nGenuinely can't see what people like that much about it",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}