{
  "positive": [
    {
      "review": "I've never played any game like this one, it is so unique in every way. I was so engrossed I binged it in the space of like 2 days. Please play it if you haven’t and go in without looking up anything about it.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Crazy game, 10/10. All the way trough game it feels fresh and unique, its more than you think it is only by looking at it on store page.. i got it cheap on sale, but its 100% worth full price.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "This was my first deck builder and it did not disappoint. To keep this spoiler free, I will say there is a lot of unexpected events story wise and the gameplay is extraordinary. Please play this game, it is worth your time.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Extremely good!\n\nThe loop of building your decks and death cards every run is very addicting. Each playthough feels interesting and even failing helps you expand your options over time. \n\nGreat aesthetic, too.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "My only complaint with Inscryption is that eventually, it ends \nA love letter to TCGs and [spoiler] oldschool creepypastas [/spoiler] this game's story is as good as its gameplay, and its gameplay is godlike. It has hit the perfect spot of difficulty and punishing gameplay that truly makes it feel like you are [spoiler] playing a game of cards against a spiteful dealer that doesn't care about balance and will unapologetically cheat if needed [/spoiler]. There are no words to explain just how fun the battle system is and I wish we got even more of it. The attention to detail and the small interactions in this game are superb.\nGame so good it got me interested in playing all of Daniel Mullin's games and MY GOD is this guy good at making games.\n10/10, in my top 3 games of all time",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The art style in this is insanely fun and full of personality. The atmosphere pulls you right in and keeps things exciting from start to finish. The finale left a bit to be desired, but everything leading up to it is top-notch fun with a really cool vibe throughout.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game is like an old-school \"haunted video game\" creepypasta come to life. The card game itself is phenomenal (if frustrating with RNG sometimes) and the style is stellar. The story can end sour depending on what you're expecting, but overall it's a gem of a game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "An experience like no other. It starts of as a weird creepy card game but become so much more (can't spoil)! Stick to it and you will be blessed by one of the most fun and unique gaming experiences in all of gaming. Actual definition of peak gaming.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Was fun and engaging all the way through. The game keeps things fresh even when you think you're starting to grasp the mechanics.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is peak rougelike, sure act 2 was sad but act 1 and 3 are amazing, so much so that I reset my data twice just to play act 1 again and again, and it has a lot of stuff to do after you beat the game, hence my over 400 hours in it (I'm unemployed)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There's nothing positive I can say about this game that doesn't exist in the thousands of thousand other reviews, but this is your signal to play Daniel Mullins other games. Yes, they look weird. Yes, even the one you think looks really ugly. It is also amazing and they all subtly tie in to each other.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game likes to punish small mistakes so be really concious of your decisions from time to time.  [spoiler] make your enemies play a level 12 challenge difficulty kaycee's run and enjoy their suffering lol [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It truly was an experience - a great Gothic themed horror game. Definitely would recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's not just a card game, it's something else. \nA beautiful masterpiece! \n\nJump in with (minimal) or no spoilers at all.\n\n\nAnd yeah, one particular stranger I met in the woods somehow ended up becoming a friend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Literally the best game i've ever played and possibly ever created. hands down, full stop. i bought a switch way back when to play botw and then totk, but once i picked up inscyption i couldn't put it down. Beat it on switch. Downloaded steam solely to replay this game in my second language (for personal language development and a unique opportunity for a replay with new (to me) user functionality). SO awesome, so fqn awesome....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm writing this maybe 10 minutes after finishing the game. I'm at a loss for words. All I can say is, go with the flow. I really can't say anything else without ruining the experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "probably my favorite card game. my only complaint is that there isnt more.\r\nalso the second half is fun shush y'all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AN ABSOLUTELY AMAZING GAME. i did not expect the game to drastically change literally midway through it genuinely blew my mind",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Inscryption was a game that completely caught me off guard, somehow I went through years of it without being spoiled. When I first opened the game, I thought it would have been the same mechanics and probably have the same usual game play, not catching my attention at first; that was until a friend bought me this game. Surprisingly, I stand corrected. The game had more than what meets the eye. The game was enjoyable and as it progressed I enjoyed learning the different mechanics and having to adapt to the changes as the story progressed. I was always excited to come back and play some more. The story is well written with good mystery and linear lore that doesn't feel off from the game or the story they were going for. The designs were pleasing and I enjoyed the style they went for. I enjoyed the secrets in the game and how they connect to the lore of the game.\n\nAll in all, I would say more but it would be spoilers for the rest of the game so instead, I will say is just to play it. Have fun, enjoy learning.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A pleasant first introduction to a deck building game. Although the later parts of the game aren't my favorite, overall it's still fantastic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Feels like it's a game within a game with puzzles to solve, deck-building, tabletop RPG elements and much more. With the Kaycee's mod it's a game with high replayability (y)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Legit,  the BEST game I have ever played, it's a 10/10 from start to finish!\nIf you haven't played this game yet, what are you doing...buy this game and play it, it's so worth it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This if my favorite game of all time, close to Subnautica and Zelda : TP. I have replayed the story mode many times, and played many hours of kaycee's mod. This is a masterpiece of a game, in every aspect. The disturbing and mysterious lore and arg, the fun deck builder gameplay... It is truly the best game I have ever played and I cannot finish the ending without shedding at least one tear. There are no ratings or other words I could write to truly convey the feel this game has and the experience I have had with it. Just please, play this game. Take your time, try to figure out secrets without guides, just get the real experience. You won't regret it, I promise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Inscryption is a game to really experience yourself fully. It is not like any other game you ever played....or will play for that matter....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, all acts feel unique and fun. tho I don't like act3 as much as the others. Kaceeys mod is fun aswell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This might be one of, if not my absolute favorite games I've ever played.  Even if you don't care about the ARG behind the game (which I recommend you at least read the document on it) the gameplay and in-game story is enough to keep you hooked.  The rogue-lite Kaycee's Mod is also a compelling reason to come back to the game, as it features the best part of the game, Act I, but with modifiers and unlockables that change the way the game is played so it doesn't stay too familiar, while keeping the lore people interested with Kaycee's logs.\n\nIf you've never played a card battler, Inscryption is easy to learn, with a high mastery ceiling.  The mechanics will keep you on your toes and you'll wanna keep playing.  If you're a veteran, it's a simple enough game to not need to learn too much more while also being able to play a completely new style of Card Battler.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolut must have in any library. The dark story and strangeness are only surpassed by the incredibly addictive card game mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Devolver Digital.. Ever since these guys started their first project an HD remake of Serious Sam franchise and then from there they started focusing on indie studios like Hotline Miami which pave way to their success they are today. This game Inscryption is no different from any past game titles that Devolver Digital has touched and becomes GOLD. Like seriously, look at the list of games Devolver Digital has worked on. ANY GAME THEY TOUCH IS GOLD!! THEY NEVER DISAPPOINT YOU! They should be given a Guinness book of record for that alone!\n\nWhat about this game? Why someone like me loves it? TBH I am the type of person who is EXTREMELY PICKY when it comes to Deck Card building games!! Meaning games like Magic the Gathering, I can't get into it yet but surprisingly I can get into a game like Metal Gear Acid... WTF?! Yea I know! Inscryption for me legit game me that feeling I missed when I played Metal Gear Acid! \n\nHere's why, the story is rich! \nThe visuals are stunning. \nIt's deck building mechanic is drugs!\nThe entire atmosphere of the game is dark tone (horror).\n\nThere's something that first that did disappointed me about this game when I first started playing and that is the game DOES NOT EXPLAIN all the game rules all at once! And some rules of the game are hidden never spoken and encourages you to figure it out. I had a hard time grasping this because I KEPT ON DYING! But then when you learn something new from your past mistakes you be like \"OH MY GOD!! THIS IS ALL INTENTIONAL!!\" It's genius! But at the same time it is painful. \n\nThe game legit does an excellent job in forcing you to learn from your past mistakes so that you can make better choices the next time. Personally I love this! Cause nothing is perfect. Not everything needed to be spoon fed you. If you figured it out from the first get go you'll be fine you won't be harmed. But if you didn't you die and learn from it. AND I LOVE THAT!! CAUSE YOU GET TO USE YOUR BRAINS!! AND IT FEELS GOOD!!!!\n\nThat said, if you're like me and you're a bit iffy when it comes to deck card building games like Magic the Gathering or Yugioh and you be like \"I'm not into those games.\" --- Then give this game a try mainly because while it is a deck card building game, it is very unique and it becomes an addiction fast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I tried this game a few times and I thought it was one of the worst games ever, I didnt understand anything, until someone on YT said he hated the game cause he didnt get it, but after learning he loved it. \n\nSo I did the same, tried the game and cursed myself after. Its a great game, it went from being one of the worst experience into one of the best experience I had with these type of similar indie roguelike games.\n\ntop notch. You can even name your cards. I love being wrong",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game overall, great attention to detail from the devs.\r\nDevs also care alot about the players and have even added a large free content addition to the game in the form of Kaycee's mod.\r\nHighly recommend to turn-based strategy fans such as myself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story and art style are amazeballs fr. also like the playstyle, I find it's always keeping me on my toes with it's strategic game play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has incredible atmosphere, engaging gameplay, and really interesting lore happening all over the place. I would highly recommend giving it a try. There were a few puzzles here and there that I really struggled with, but that just added to the fun. And the music and sound design for this game are amazing. Definitely one of my favorite shorter games I have played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "He de admitir que hace tiempo le di un try y lo deje nada mas empezar, le he vuelto a dar la oportunidad y menos mal, porque es de lejos el mejor juego de cartas que he jugado. Es un juego que es mucho más de lo que aparenta, no deja de sorprenderte incluso después de terminarlo de los secretos y trasfondo que tiene detrás. \r\n\r\nNo te desanimes si mueres al principio y no entiendes bien lo que pasa, si te gustan los juegos de cartas es un IMPRESCINDIBLE. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Inscryption is hands down the best game I've ever played. The best story, best gameplay, and best surprises out there. My jaw was on the floor for half of the game. And with the free DLC that comes with the game, not only will it incorporate more lore, but it will also bring an infinite amount of gameplay. I will always love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice, fun, creepy game with added background and hidden lore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game for people who like synergy. The game is very well polished and it's art direction elevates this game to a must play.  The only thing that is bad is that the main story is not really replayable but the mod at the end of the game is well made.\r\n\r\nOverall: 8.8 / 10 \r\nwell made, highly recommed to card lovers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game it's a must play I cannot recommend it enough possibly my favorite game I've played ever!! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like playing this game. The whole story is cool, but in my opinion, the first part of the game has the most  replayable value - the part inside the cabin. The art looks nice, and the mechanics of the card game is really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "main story gameplay: 9/10 ... a very solid and addictive card game, i'll always have act 1 be my favourite style, it feels perfected and not so overwhelming compared to the other acts.\r\n\r\nplot itself: 9/10 ... so awesome, highly recommend going into this game blind and avoid spoilers, it's much better that way.\r\n\r\nkaycee's mod: 6/10 ... i wish it was truly infinite and didnt have the same act 1 end goal. I think it would be nice to choose between the other act's gameplay instead of just 1. I'm not super into the challenge points and i wish they were optional/didnt have a challenge quota that kept expanding, bc some of them aren't fun to do and it gets to a point when u complete a mod run so many times that you can run into a wall of an unplayable/unenjoyable playthrough bc of having so many challenges forced to be active. I would prefer not to reset my game save in order to enjoy kaycee's mod again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very cool fun story card game that's the best way to explain it but i'm going to be vague so I don't Spoil nothing there's way more to it then just that tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its aight. beat the whole campaign with noting but squirrels. games kinda easy, hope they fix the 'unicorn' BUG, the laser doesn't deal damage to terrain cards and is completely countered by 'fragmentation grenade', amongst other BUGs such as the lithium batteries BUG, that causes some of the robot cards to suddenly explode when the waterborne sigil is applied. good game. 4.20mph/6,769cm >:D))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game fun story and probably one of my favorite card games to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved the actual gameplay; the lore was cool as hell and loved the card art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most incredible and subversive games I have ever played where every moment made my jaw drop. I put this game off for YEARS because I had no idea how amazing it was. I *wish* I would've played it sooner.\r\n\r\nEasily in my top 5 favorite games of all-time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has such a awesome story and feel to it, its really damn unique even among the genre it \"claims\" to be.\n\nIts also really funny how you can tell that some people that have played the game thought that a certain part of the game is all there is to it, atleast if one is to look at their reviews. \n\nLong live stoat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "peak game, frustrating at times if youre stupid like me but a very enjoyable card game with a touch of ARG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend checking out the deep and rich lore in this otherwise unassuming game. The more you play the crazier it seems to get. I haven't finished this game completely but that won't stop me from recommending it to others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game at first had a feeling of being a simple chill game. After some play it becomes wild and worth your time,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I HATE deck builders so I recommend this game for everyone that is on the same page (it's very addictive)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best card game I've ever played and strangest ARG I've had the pleasure of stumbling through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 \r\nI was itching to play this game when i first watched a playthrough of act 1, and I really liked acts 2&3 as well! (though I can understand why some may dislike it). When I figured out Kaycee's mod was free I was so happy\r\n\r\nwill be playing for another 30+ hours\r\n\r\nalways pick mantis god.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[spoiler] First act [/spoiler] is definitely the best, but this hole game is a huge amount of fun the whole way through. Strongly recommend if you like a fun card game with good replayability that you can easily break and have a lot of fun with. \r\n\r\nAnd Kaycee's Mod (a free DLC that comes with the base game) means you can turn it into a full blown roguelite if you want. Although I'd strongly recommend playing the game through in its entirety!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the few games that unexpectedly blew my mind.\r\nIf you're looking for a sign wether to buy this gem or not..\r\nThis is the sign.. \r\nAnyway, avoid this masterpiece because the next thing you know is that you'll be estranged from your friends and family with a long ass beard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting storyline with inventive and compelling game play. Couldn't recommend it enough to anyone who loves TBS card games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, Great characters, fun gameplay, a bit challenging. Would absolutely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SOOOOO GOOD, it’s a little time-consuming but DAMN it’s worth it.\nThe ending was so awesome and it’s a lot of fun! :D\nI’d recommend it. I had no performance problems no lag, nothing. Overall 10/10!\n\nP.S. Say hi to my friend Leshy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super engaging deck building game, my only complaint being the navigation in the escape room sections but theyre not abundant and not unfamiliar, may other games have used that style of navigation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brutal\nThis game is not what it looks like at first, it way deeper. Inscryption is an excellent card game with awesome characters and a story thats simple but really good. If you like building OP tactics and smart strategies, this game is for you, dudes. Recommended 100%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm completely obsessed with this game and never seem to grow tired of it. 100/10 reccomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rare game where giving a higher score than what I had fun with. It's really well made, creepy, and the game itself is solid. But I dislike the rogue-like-lite genre, and repeating the entire game again and again, just isn't fun for me. Not sure why I keep doing this to myself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun :) Not just a cardbuilding RPG, but a game within a game! Love the aesthetic and fortunately the game itself is not hard to pick up. It cost more than I'd usually spend on this type of game but after playing for an hour, I think it will be worth it as I'll have a lot of fun with this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting game with great visuals and great storytelling. Every win feels deserved and every misplay hurts a lot, but in the end it is all worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was playing this for free and bought the game just to support the author. The game is one of the best pieces I've ever seen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting the 3 blood totem with a squirrel head cured my depression... highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably my favorite game ever. The story, graphics, sound, everything is peak. And there's basically 3 different games built into 1, except the story continues through in it all. Even after you beat the game, Kaycee's Mod lets you keep playing. You will play this game NOW! 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an absolute masterpiece. Highly highly recommend anyone to play it. Don't look things up before hand or during.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great vibe, nice surprises and good enough gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved every minute of this. Genre breaking and exactly how an indie game should be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was really really cool. Great art style and atmosphere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great game, that introduced me to the wonders of card games. wished that the cards were real",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐️⭐️⭐️⭐️\n\n[h3]Really enjoyed the game[/h3]\n\nLoved the challenging aspect of the game learning new cards and following the storyline. I enjoyed the creepy atomosphere as well.\n\nWas really fun. [spoiler] I loved the concept of giving an important file and then 'losing' the file if you lost the round it adds that additional suspense. [spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just got this game and I am already hooked up with the gameplay and the unique fights you get and the interactions with the dude at the other end of the table . Amazing game Truly recommend .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Expertly written story executed through an addictive and remarkably simple gameplay loop. Stellar art and visuals. A must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an absolute masterpiece. Every aspects of this game is perfect: The deck-building (+ a little bit roguelite) gameplay, the mechanics/gimmicks of different boss, how all 4 Scrybes have distinct personalities and gameplay styles, and the IRL clips, the ARG, how the game interact with the player,... All of them brings me emotions that I've never experienced before. I really wish to be able to play Grimora \nand Magnificus games freely too. Looking forward to Daniel Mullins future games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy moly.\n\nI wish I could write a story as hard as ts. This ARG is low-key the best I've ever seen imo. Yeah play it with no spoilers please!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a fun game!! i LOVE the art and gameplay so much — it is just so atmospheric and engrossing and soo well done. there are lots of game mechanics that are so unique and interesting. it is unassuming and i'm delightfully surprised by something new each run. there is not much else to say besides that it is fun and great and i am going to recommend it to everyone i know!\n\nedit: ok now that i finished the game.... ugh nothing could have prepared me for what (and how much more) to have expected. the most amazing !! my favorite !! i love it so much !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First part of the game has a deeply satisfying loop, even if it becomes easy to game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A long time ago I heard this game be described as one that 'shows what indie games can really be'. Now, many years later, I can very confidently say that it doesn't just show what indie games can be, but rather what video games as an art form can be. This game is truly special, it's one among a scant few that truly expand the boundaries of this medium in ways so very few do, while also just maintaining a genuinely fun and intriguing gameplay loop. \n\nTry to not look up any trailers, videos or images of this game. Anything that could truly make up your mind on buying this game most likely will also just spoil you, forever taking away part of what this game could give you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unironically the top 3 best games ive ever played, would delete my memory of ever playing this just so I can experience it like its new again. I finished the whole thing in one 14 hour long sitting, detrimental to my health but its so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best, if not the best, card games I’ve ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game i have ever played. Period.\r\n\r\nThe story, the visuals, the OST, the gameplay, the ending. It so good it made me tear up to be over with. Highly recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest roguelikes I've ever had the pleasure of playing. Excellent gameplay, phenomenal atmosphere, and compelling story. Do not spoil anything about this game for yourself; just jump in. You'll thank me later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Started a bit later on this one.. but I must say.. the campaigns surpassed my expectations, even when these were already high, after all the reviews I saw.  \nEdit: Sadly though, the End game Mod that allows you to play more at the end (Kaycee`s Mod) if very uninspired. You are limited now at augmenting cards, which kills all the fun. \n\nPro`s: \n - Innovative mechanics.\n - Very well implemented rogue like elements.\n - Story telling and subtle jokes. Cards like \"Pack Rat\" card (aka. the Rat Pack band from the 50`), \"Frank & Stein\", etc. are cute to see :).\n - Evolving rules.\n - Constantly changes and keeps fresh\n - Endless mode.\n\nCons: \n - Learning curve pretty steep. Could have done a better job explaining some things or improve UI info (on the adventure map, for example); I found myself going on the web for some additional info. Good news is that there are a lot of places where you can find info and there is a complete Wiki page out there. \n - RNG in ACT II a bit frustrating sometimes, but I guess it`s hard to avoid. \n - I hope for some updating graphics and animations for Inscryption 2 :D. \n - (Edit) Crashes/Freezes constantly :(.. v. strange...\n - Act II is meh..\n - Kaycee`s Mod - the limitation I mentioned above. \n\n\nOverall a very good card game, especially nowadays, when the game gets discounted pretty often, at 7.99EUR.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Inscryption - 10/10\r\nCompletion Time - 18 Hours \r\n\r\nInscryption takes you on an eerie journey in unexpected ways. Once you've finished the story, you wish you could go back and experience it for the first time all over again. You think it's just another roguelike card game, but it evolves into so much more. This will probably be one of the shortest reviews I have written and it's mostly to keep the game spoiler free, but also to encourage you to play it yourself. It's worth it and I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely an insane game in the best way possible. Just when you think you understand what's going on, the game throws everything on its head, then proceeds to do this 5 more times. Also, the DLC has really fun gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of fun, especially if you like card-like rpg games. I just felt like the lore was prioritized over gameplay. Once you beat the first act, you cant go back, and the first part was easily the most fun part",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I have played in a long time. Just play it and don't look anything up about it. No playthroughs, no guides, nothing. Inscryption is incredibly well made in basically every single aspect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am writing this review after getting all achievements and doing a little bit of ARG solving (as best as I can).\r\nThis is the best game to play. It is incredibly addictive. This game has been a core part of my life since it came out, and I actually have the physical version of the cards and a few placemats that represent the game, that's just how much I love this game. Daniel Mullins is an incredible and creative person and I hope all the best for him, especially after creating this absolute masterpiece.\r\nThe amount of hours logged onto steam is not an accurate number of hours I have actually spent on this game (as I also have it on Xbox). If I had to approximate the hours I have played this, I would have to say a minimum of 300 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, good story, good puzzles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just playing the game is one of the best experiences you will ever have: the story, the game mechanics, the soundtracks, the art style, the easter eggs and the replayability are 10/10. \r\n\r\nNow if you really enjoy playing this game the 100% wont be a problem, because you basically just gotta play the game a bunch. It can be quite difficult however, wich was also fun because you really had to think about what you were doing and had to try every strategy the game has to offer.\r\n\r\nNo this game will not take you 80 hours to 100%. More like 50 hours if you do a little bit of research.\r\nNow dont go spoil everything for yourself, this will make the experience of solving all the puzzles and the game itself a lot less fun. But learning certain strategys from others makes it quite fun and opens up alot of options.\r\n\r\nGo in it blind for the first hours of gameplay and be surprised by what the hell is going on, if you go for all achievements looking up some stuff wont hurt but rather save you alot of hours. Wich i should have done way sooner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy fucking shit! Game just keeps evolving and evolving to the point where i don't even try to figure out what kinda batshit concept it will throw at my face. Its steam page is like 15% of the whole thing. If you are planning to play it, dont delay any further.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The hands on the cuckoo clock are all wrong. The hour hand should be the shortest one, not the longest one; and the minute hand should be the longest, literally unplayable... \n\n\n\n\n\nOtherwise the game is pretty good, I rate it 11 squirrels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an experience. \nGreat story with no-obvious plot, good game mechanics, a healthy mix of challenging and easy puzzles plus strategy. Mentally stimulating, with varied graphics that go from 3D to pixel art to live action to low poly to drawn style; it's a treat for the eyes.\nUnexpected turn of events.\nScape room meets card game, what's not to like? \nUnlike anything i've played before \nWorth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great card game, great visuals, great sound \nand most important - great story, after beating Act I, I thought I finished the game and I didn't realize this was just about 30/40 % of the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "did not expect to enjoy a card game this much. The aura is so unique, totally recommended! a",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of ,y favorite games of all time. I had to 100% and if they came out with a second game I would buy it in a instant. Love the creepy vibes and puzzles to solve while playing a card game that makes you think and making op builds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A delightful deckbuilder with some very fun mechanics and a story that takes some turns (pun intended). Challenging, with some occasional unfairness-by-design, but I found it fairly easy to get a grip on the rules and mechanics. Act 1 is my personal favorite (peepaw's cozy dimly lit murder cabin in which I am forced to be good at cards to avoid the murder part of that equation is always a welcome sight), but Act 2 and 3 are nothing to spit at, either. Overall, 10/10 game. Not a trading card game kind of gal, but Inscryption is one I'd pick up irl if given the chance. Assuming doing so also lacks all the terrible consequences, of course.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. It's really original and well made. I love the concept.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Usually I'd write a couple paragraphs about the game, but sometimes the less said the better. It's a really good game, and it's worth playing regardless. But go into it without looking anything up if at all possible. It's better when you just engage with the game and gather that information yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed it a lot, one of my favourite games for sure, The first part is the best in my opinion, part 2&3 were lacking for my taste, I just wanted them to be over so I could go back to playing the first part again. That was just my experience though, the robot one was the only gameplay that was a little boring. Playing it after completing the story is the best experience to play it in though. Would recommend very highly. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I guess I don't know what I got out of playing this.\n\nThe gameplay itself is based around a simple four lane trading card game that gets a little thin after a while. Aside from a few mechanics it's pretty straightforward. They seem really proud of this gameplay because you are playing it constantly.\n\nThere are puzzles but they range from so easy I don't know why this should be a bar to progress to wow I actually had to look around for the solution to this one. \n\nThe story is basically just a creepypasta/SCP. It's digestible enough but a lot of the elements (the number and types of scrybes for instance) seem arbitrary. I don't really know why this story needed to be told. It doesn't seem to come from a place of burning inspiration. The ending is incredibly abrupt and stupid. Expect a lot of fourth wall breaks and acknowledgement of ludological dissonance. Kudos for risking it by making live action segments tho more games should do that.\n\nI guess I don't get what I was supposed to take from this. There are some really sick boss fights with some great designs. The vibe for the front half of the game is pretty great it just kind of degenerates.\n\nOverall I'd give it a 6 out of 10. Better than average, but not worth the ten hours or so it takes to beat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not really a recommend from me. The game plays fine, and the gameplay loop is okay, but the way the story is told and the way the acts turn out is a bit disappointing. Act I is great, loved every second. Act II came around and I kinda felt like I was tricked, the gameplay is quite different from Act I and I wasn't a fan. I trudged through it, kinda paying attention to the story but also kind of not, because I was just wanting this part to be done with. Act III came around, and the gameplay was similar to Act I, except it used a different style map where you didn't have your path laid out in front of you, you have to go back and forth between different areas like in Act II.\n\nOverall, the core gameplay was enjoyable enough, but I felt like the game had an identity crisis and tried being too many different things at once. If  the gameplay stayed like it was in Act I, it would be a huge recommend for me, but  since I've just finished the first boss on Act III seven hours in (half of which I was just going through the motions) and I don't feel like completing the game, or seeing the conclusion of the story, I can't say I recommend this game. Especially not when all of the screenshots and videos on the store page are from Act I - to me, it really feels like a bait-n-switch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I hate to give a negative review to this game, it was very fun while I played, Its a sort of pseudo-roguelike card battler with a dark sense of humour, many secrets and interesting graphics, with a unique story. As you play, the game evolves and although it's not too deep at the beginning it gets to a good place in complexity. Unlike a regilar roguelike the further you progress the more different the game becomes, and this a good thing. Sadly I lost interest and didn't finish the game, this is the only reason for my negative review. If you enjoy roguelikes and different games you should give this game a try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I liked this game - Act 1 starts off so wildly strong.\n\nPast Act 1 it gets infinitely less interesting and polished. I tried to stick around with it, but the game got significantly less interesting as time went on, especially the meta-narrative elements. The game tons of ciphers and clues not resolved on in the game, and ends extremely inconclusively. This is fine for people who like \"digital geo-caching\", of sorts, but I generally believe games should be a finished package.\n\nI think the biggest way to summarize my final feelings on the game would be when, after googling all the cipher solving others did, I came across this: [spoiler]The game's discs mailed to people had files which implied the \"Karnoffel code\" is so evil Hitler literally carried the cards around on his person. How fucking lazy is this? Is this your way of trying to tell us it's evil?[/spoiler] Give me a break.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get it on sale, not worth it on full price.\n\nOnly act I. is fun.\n\nRest is either nice a little or feels unnecessary most of the time.\n\nEndgame (new game+ of act I.) is literally rng based and unfun compared to act I. (but that becomes boring because it's too easy) the difficulty spike is too real without even a few modifiers added. You sweat blood with the rng and you can only play it through with very specific build which involves 0 thinking and creativity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cannot start a new game i literally want to k*ll my self and everyone involved in this design decision. i am truly disappointed, my day is ruined, and i cannot live like this anymore. nothing in my 46 years of crawling around this earth has prepared me to withstand this level of agony. my only, and subatomic sized, hope is that this earth becomes nothing but ashes just and only because of this incredibly stupid and pedantic \"\"feature\"\" has been the cause. consider this my only relevant part of my will, which will be of use very very soon...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have rarely felt this dumb. I didn't have fun at all. Never understood the slider puzzles. Even after looking up every puzzle. I just got to the point where I brute forced them. Got to Act 3 and I am so bored. At first I got a bounty for winning too much, but then I lost every match for the next 3 hours? This is why I won't be finding out what happened to the card guy. It feels like it was made kinda crappy as an aesthetic but it is just kinda crappy. How is this full of Overwhelmingly Positive reviews?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aggressively not for me. If a game’s response to a good run is quite literally “fuck you, you didn’t go through enough story to arbitrarily beat your run” I don’t feel like I’m playing a game anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, the tutorial takes about 3 hours.  All of the screenshots are from the tutorial.  Once you beat it, it forces you to play an *ENTIRELY* different game that *REALLY* sucks.  I mean it's really awful.  Graphics are total garbage, gameplay is awful, etc.  AND you can't play the FUN game without unlocking a hidden feature.\n\nTo play the fun game shown in screenshots after beating the game, go to start menu, hold shift, press K M.  This unlocks \"Kaycee's mod\", which SHOULD NOT be hidden.\n\nEdit: After playing Kaycee's mod for about a dozen runs, and repeatedly coming across impossible to win fights, where the enemy lays 3 creatures first turn, then 3 more turn two, with no way of fixing broken  (impossible to win) fights, I'm changing my review to negative.\n\nWhy negative:\nTutorial is only 3 hours long, but it's a blast.  So there's that.  The problem is that's not enough to justify the price tag, even on sale.  There's no way to play \"non-tutorial\" mode on a reasonable difficulty.  I don't even mind losing to \"hard\" fights that \"IF\" I had the right cards/items I could win.  It's the \"Utterly impossible no matter what cards/items\" fights that are a turn off.\nAfter the tutorial is an *entirely* different game with the worst 2D graphics I've ever seen.  It's *NOT* the same game.  It's a total bait and switch.  And Kaycee's mod doesn't make up for the ultra short \"fun\" part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i know this is supposed to be subversive and a commentary on game design and stuff, but the game just isn't fun. it's significantly worse to play than other similar \"roguelike deckbuilders\" so whatever it's trying to do is lost on me. i got to act 3 where it's both much harder and much longer than the previous 2 acts, and i've run out of energy. the ARG parts are cool but they're few and far between.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like roguelike games with nothing but RNG between you and a decent experience, play this. Or any other trash ass roguelike. You fucking peasant.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "act 2 sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficulty slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I DO think this game is worth the price and was overall fun. I am leaving this negative so people who are actually looking to buy the game have a warning about something I wish I had known before I bought it.\r\n\r\nThe game you see in the trailer is only about a third of the actual game. Partway through your playthrough the game fundamentally changes. I won't say anything else, because I don't want to spoil anything. But just be aware that the game you are paying for might be a lot different than you expect. If you are willing to give it a chance, this is one of the weirdest, yet coolest, games I have played in awhile. But during my first run through I was pretty frustrated with how the game pulled the rug out from under me, and I think prospective buyers deserve to know that going in.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Wish there was a middle rating.\n\nThis is a good game with a lot of heart and passion into it. The problem: it decides it doesn't want to be a traditional card game, but rather try and tell a reddit-tier story and betray its solid art and atmosphere in the first part. The latter parts felt not as nearly as polished and thought through mechanically and felt uninspired to me aesthetically. You either like it or ya don't.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Unfortunately, I'm gonna have to go with a \"do not necesarily recommend\" on this one. Very much the Family Guy joke about The Godfather \"insisting upon itself\" -- this game does exactly that. Folks seem so convinced of its genius, but I found the \"twists\" and \"turns\" to be insufferable, the meta-textual nature of it boring and more than a little tryhard, and despite truly enjoying much of the core gameplay loops of Act I and Act II, Act III and the \"ending\" require researching an ARG to fully get there. Even then, the juice is not worth the squeeze! There's a lot of promise here, I thought my time with this game was going a different way for most of it, but... man, I just cannot get past how wack it ended up being. Even if it started SO STRONG. Also, I have no idea what people in other reviews are talking about with 'endlessly replayable\" because mf no it is absolutely not lmao",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really loved this game, and then I really hated this game.\n\n 9/10 for the main game.\n\n1/10 for the end game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Propably the most overrated game I've ever played. Act 1 was awesome, but the next two were nowhere near as good.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I guess I don't know what I got out of playing this.\n\nThe gameplay itself is based around a simple four lane trading card game that gets a little thin after a while. Aside from a few mechanics it's pretty straightforward. They seem really proud of this gameplay because you are playing it constantly.\n\nThere are puzzles but they range from so easy I don't know why this should be a bar to progress to wow I actually had to look around for the solution to this one. \n\nThe story is basically just a creepypasta/SCP. It's digestible enough but a lot of the elements (the number and types of scrybes for instance) seem arbitrary. I don't really know why this story needed to be told. It doesn't seem to come from a place of burning inspiration. The ending is incredibly abrupt and stupid. Expect a lot of fourth wall breaks and acknowledgement of ludological dissonance. Kudos for risking it by making live action segments tho more games should do that.\n\nI guess I don't get what I was supposed to take from this. There are some really sick boss fights with some great designs. The vibe for the front half of the game is pretty great it just kind of degenerates.\n\nOverall I'd give it a 6 out of 10. Better than average, but not worth the ten hours or so it takes to beat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not really a recommend from me. The game plays fine, and the gameplay loop is okay, but the way the story is told and the way the acts turn out is a bit disappointing. Act I is great, loved every second. Act II came around and I kinda felt like I was tricked, the gameplay is quite different from Act I and I wasn't a fan. I trudged through it, kinda paying attention to the story but also kind of not, because I was just wanting this part to be done with. Act III came around, and the gameplay was similar to Act I, except it used a different style map where you didn't have your path laid out in front of you, you have to go back and forth between different areas like in Act II.\n\nOverall, the core gameplay was enjoyable enough, but I felt like the game had an identity crisis and tried being too many different things at once. If  the gameplay stayed like it was in Act I, it would be a huge recommend for me, but  since I've just finished the first boss on Act III seven hours in (half of which I was just going through the motions) and I don't feel like completing the game, or seeing the conclusion of the story, I can't say I recommend this game. Especially not when all of the screenshots and videos on the store page are from Act I - to me, it really feels like a bait-n-switch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I hate to give a negative review to this game, it was very fun while I played, Its a sort of pseudo-roguelike card battler with a dark sense of humour, many secrets and interesting graphics, with a unique story. As you play, the game evolves and although it's not too deep at the beginning it gets to a good place in complexity. Unlike a regilar roguelike the further you progress the more different the game becomes, and this a good thing. Sadly I lost interest and didn't finish the game, this is the only reason for my negative review. If you enjoy roguelikes and different games you should give this game a try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I liked this game - Act 1 starts off so wildly strong.\n\nPast Act 1 it gets infinitely less interesting and polished. I tried to stick around with it, but the game got significantly less interesting as time went on, especially the meta-narrative elements. The game tons of ciphers and clues not resolved on in the game, and ends extremely inconclusively. This is fine for people who like \"digital geo-caching\", of sorts, but I generally believe games should be a finished package.\n\nI think the biggest way to summarize my final feelings on the game would be when, after googling all the cipher solving others did, I came across this: [spoiler]The game's discs mailed to people had files which implied the \"Karnoffel code\" is so evil Hitler literally carried the cards around on his person. How fucking lazy is this? Is this your way of trying to tell us it's evil?[/spoiler] Give me a break.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get it on sale, not worth it on full price.\n\nOnly act I. is fun.\n\nRest is either nice a little or feels unnecessary most of the time.\n\nEndgame (new game+ of act I.) is literally rng based and unfun compared to act I. (but that becomes boring because it's too easy) the difficulty spike is too real without even a few modifiers added. You sweat blood with the rng and you can only play it through with very specific build which involves 0 thinking and creativity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cannot start a new game i literally want to k*ll my self and everyone involved in this design decision. i am truly disappointed, my day is ruined, and i cannot live like this anymore. nothing in my 46 years of crawling around this earth has prepared me to withstand this level of agony. my only, and subatomic sized, hope is that this earth becomes nothing but ashes just and only because of this incredibly stupid and pedantic \"\"feature\"\" has been the cause. consider this my only relevant part of my will, which will be of use very very soon...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have rarely felt this dumb. I didn't have fun at all. Never understood the slider puzzles. Even after looking up every puzzle. I just got to the point where I brute forced them. Got to Act 3 and I am so bored. At first I got a bounty for winning too much, but then I lost every match for the next 3 hours? This is why I won't be finding out what happened to the card guy. It feels like it was made kinda crappy as an aesthetic but it is just kinda crappy. How is this full of Overwhelmingly Positive reviews?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aggressively not for me. If a game’s response to a good run is quite literally “fuck you, you didn’t go through enough story to arbitrarily beat your run” I don’t feel like I’m playing a game anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, the tutorial takes about 3 hours.  All of the screenshots are from the tutorial.  Once you beat it, it forces you to play an *ENTIRELY* different game that *REALLY* sucks.  I mean it's really awful.  Graphics are total garbage, gameplay is awful, etc.  AND you can't play the FUN game without unlocking a hidden feature.\n\nTo play the fun game shown in screenshots after beating the game, go to start menu, hold shift, press K M.  This unlocks \"Kaycee's mod\", which SHOULD NOT be hidden.\n\nEdit: After playing Kaycee's mod for about a dozen runs, and repeatedly coming across impossible to win fights, where the enemy lays 3 creatures first turn, then 3 more turn two, with no way of fixing broken  (impossible to win) fights, I'm changing my review to negative.\n\nWhy negative:\nTutorial is only 3 hours long, but it's a blast.  So there's that.  The problem is that's not enough to justify the price tag, even on sale.  There's no way to play \"non-tutorial\" mode on a reasonable difficulty.  I don't even mind losing to \"hard\" fights that \"IF\" I had the right cards/items I could win.  It's the \"Utterly impossible no matter what cards/items\" fights that are a turn off.\nAfter the tutorial is an *entirely* different game with the worst 2D graphics I've ever seen.  It's *NOT* the same game.  It's a total bait and switch.  And Kaycee's mod doesn't make up for the ultra short \"fun\" part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i know this is supposed to be subversive and a commentary on game design and stuff, but the game just isn't fun. it's significantly worse to play than other similar \"roguelike deckbuilders\" so whatever it's trying to do is lost on me. i got to act 3 where it's both much harder and much longer than the previous 2 acts, and i've run out of energy. the ARG parts are cool but they're few and far between.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like roguelike games with nothing but RNG between you and a decent experience, play this. Or any other trash ass roguelike. You fucking peasant.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "act 2 sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficulty slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I DO think this game is worth the price and was overall fun. I am leaving this negative so people who are actually looking to buy the game have a warning about something I wish I had known before I bought it.\r\n\r\nThe game you see in the trailer is only about a third of the actual game. Partway through your playthrough the game fundamentally changes. I won't say anything else, because I don't want to spoil anything. But just be aware that the game you are paying for might be a lot different than you expect. If you are willing to give it a chance, this is one of the weirdest, yet coolest, games I have played in awhile. But during my first run through I was pretty frustrated with how the game pulled the rug out from under me, and I think prospective buyers deserve to know that going in.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Wish there was a middle rating.\n\nThis is a good game with a lot of heart and passion into it. The problem: it decides it doesn't want to be a traditional card game, but rather try and tell a reddit-tier story and betray its solid art and atmosphere in the first part. The latter parts felt not as nearly as polished and thought through mechanically and felt uninspired to me aesthetically. You either like it or ya don't.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Unfortunately, I'm gonna have to go with a \"do not necesarily recommend\" on this one. Very much the Family Guy joke about The Godfather \"insisting upon itself\" -- this game does exactly that. Folks seem so convinced of its genius, but I found the \"twists\" and \"turns\" to be insufferable, the meta-textual nature of it boring and more than a little tryhard, and despite truly enjoying much of the core gameplay loops of Act I and Act II, Act III and the \"ending\" require researching an ARG to fully get there. Even then, the juice is not worth the squeeze! There's a lot of promise here, I thought my time with this game was going a different way for most of it, but... man, I just cannot get past how wack it ended up being. Even if it started SO STRONG. Also, I have no idea what people in other reviews are talking about with 'endlessly replayable\" because mf no it is absolutely not lmao",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really loved this game, and then I really hated this game.\n\n 9/10 for the main game.\n\n1/10 for the end game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Propably the most overrated game I've ever played. Act 1 was awesome, but the next two were nowhere near as good.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I guess I don't know what I got out of playing this.\n\nThe gameplay itself is based around a simple four lane trading card game that gets a little thin after a while. Aside from a few mechanics it's pretty straightforward. They seem really proud of this gameplay because you are playing it constantly.\n\nThere are puzzles but they range from so easy I don't know why this should be a bar to progress to wow I actually had to look around for the solution to this one. \n\nThe story is basically just a creepypasta/SCP. It's digestible enough but a lot of the elements (the number and types of scrybes for instance) seem arbitrary. I don't really know why this story needed to be told. It doesn't seem to come from a place of burning inspiration. The ending is incredibly abrupt and stupid. Expect a lot of fourth wall breaks and acknowledgement of ludological dissonance. Kudos for risking it by making live action segments tho more games should do that.\n\nI guess I don't get what I was supposed to take from this. There are some really sick boss fights with some great designs. The vibe for the front half of the game is pretty great it just kind of degenerates.\n\nOverall I'd give it a 6 out of 10. Better than average, but not worth the ten hours or so it takes to beat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not really a recommend from me. The game plays fine, and the gameplay loop is okay, but the way the story is told and the way the acts turn out is a bit disappointing. Act I is great, loved every second. Act II came around and I kinda felt like I was tricked, the gameplay is quite different from Act I and I wasn't a fan. I trudged through it, kinda paying attention to the story but also kind of not, because I was just wanting this part to be done with. Act III came around, and the gameplay was similar to Act I, except it used a different style map where you didn't have your path laid out in front of you, you have to go back and forth between different areas like in Act II.\n\nOverall, the core gameplay was enjoyable enough, but I felt like the game had an identity crisis and tried being too many different things at once. If  the gameplay stayed like it was in Act I, it would be a huge recommend for me, but  since I've just finished the first boss on Act III seven hours in (half of which I was just going through the motions) and I don't feel like completing the game, or seeing the conclusion of the story, I can't say I recommend this game. Especially not when all of the screenshots and videos on the store page are from Act I - to me, it really feels like a bait-n-switch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I hate to give a negative review to this game, it was very fun while I played, Its a sort of pseudo-roguelike card battler with a dark sense of humour, many secrets and interesting graphics, with a unique story. As you play, the game evolves and although it's not too deep at the beginning it gets to a good place in complexity. Unlike a regilar roguelike the further you progress the more different the game becomes, and this a good thing. Sadly I lost interest and didn't finish the game, this is the only reason for my negative review. If you enjoy roguelikes and different games you should give this game a try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I liked this game - Act 1 starts off so wildly strong.\n\nPast Act 1 it gets infinitely less interesting and polished. I tried to stick around with it, but the game got significantly less interesting as time went on, especially the meta-narrative elements. The game tons of ciphers and clues not resolved on in the game, and ends extremely inconclusively. This is fine for people who like \"digital geo-caching\", of sorts, but I generally believe games should be a finished package.\n\nI think the biggest way to summarize my final feelings on the game would be when, after googling all the cipher solving others did, I came across this: [spoiler]The game's discs mailed to people had files which implied the \"Karnoffel code\" is so evil Hitler literally carried the cards around on his person. How fucking lazy is this? Is this your way of trying to tell us it's evil?[/spoiler] Give me a break.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get it on sale, not worth it on full price.\n\nOnly act I. is fun.\n\nRest is either nice a little or feels unnecessary most of the time.\n\nEndgame (new game+ of act I.) is literally rng based and unfun compared to act I. (but that becomes boring because it's too easy) the difficulty spike is too real without even a few modifiers added. You sweat blood with the rng and you can only play it through with very specific build which involves 0 thinking and creativity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cannot start a new game i literally want to k*ll my self and everyone involved in this design decision. i am truly disappointed, my day is ruined, and i cannot live like this anymore. nothing in my 46 years of crawling around this earth has prepared me to withstand this level of agony. my only, and subatomic sized, hope is that this earth becomes nothing but ashes just and only because of this incredibly stupid and pedantic \"\"feature\"\" has been the cause. consider this my only relevant part of my will, which will be of use very very soon...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have rarely felt this dumb. I didn't have fun at all. Never understood the slider puzzles. Even after looking up every puzzle. I just got to the point where I brute forced them. Got to Act 3 and I am so bored. At first I got a bounty for winning too much, but then I lost every match for the next 3 hours? This is why I won't be finding out what happened to the card guy. It feels like it was made kinda crappy as an aesthetic but it is just kinda crappy. How is this full of Overwhelmingly Positive reviews?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aggressively not for me. If a game’s response to a good run is quite literally “fuck you, you didn’t go through enough story to arbitrarily beat your run” I don’t feel like I’m playing a game anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, the tutorial takes about 3 hours.  All of the screenshots are from the tutorial.  Once you beat it, it forces you to play an *ENTIRELY* different game that *REALLY* sucks.  I mean it's really awful.  Graphics are total garbage, gameplay is awful, etc.  AND you can't play the FUN game without unlocking a hidden feature.\n\nTo play the fun game shown in screenshots after beating the game, go to start menu, hold shift, press K M.  This unlocks \"Kaycee's mod\", which SHOULD NOT be hidden.\n\nEdit: After playing Kaycee's mod for about a dozen runs, and repeatedly coming across impossible to win fights, where the enemy lays 3 creatures first turn, then 3 more turn two, with no way of fixing broken  (impossible to win) fights, I'm changing my review to negative.\n\nWhy negative:\nTutorial is only 3 hours long, but it's a blast.  So there's that.  The problem is that's not enough to justify the price tag, even on sale.  There's no way to play \"non-tutorial\" mode on a reasonable difficulty.  I don't even mind losing to \"hard\" fights that \"IF\" I had the right cards/items I could win.  It's the \"Utterly impossible no matter what cards/items\" fights that are a turn off.\nAfter the tutorial is an *entirely* different game with the worst 2D graphics I've ever seen.  It's *NOT* the same game.  It's a total bait and switch.  And Kaycee's mod doesn't make up for the ultra short \"fun\" part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i know this is supposed to be subversive and a commentary on game design and stuff, but the game just isn't fun. it's significantly worse to play than other similar \"roguelike deckbuilders\" so whatever it's trying to do is lost on me. i got to act 3 where it's both much harder and much longer than the previous 2 acts, and i've run out of energy. the ARG parts are cool but they're few and far between.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like roguelike games with nothing but RNG between you and a decent experience, play this. Or any other trash ass roguelike. You fucking peasant.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "act 2 sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficulty slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I DO think this game is worth the price and was overall fun. I am leaving this negative so people who are actually looking to buy the game have a warning about something I wish I had known before I bought it.\r\n\r\nThe game you see in the trailer is only about a third of the actual game. Partway through your playthrough the game fundamentally changes. I won't say anything else, because I don't want to spoil anything. But just be aware that the game you are paying for might be a lot different than you expect. If you are willing to give it a chance, this is one of the weirdest, yet coolest, games I have played in awhile. But during my first run through I was pretty frustrated with how the game pulled the rug out from under me, and I think prospective buyers deserve to know that going in.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Wish there was a middle rating.\n\nThis is a good game with a lot of heart and passion into it. The problem: it decides it doesn't want to be a traditional card game, but rather try and tell a reddit-tier story and betray its solid art and atmosphere in the first part. The latter parts felt not as nearly as polished and thought through mechanically and felt uninspired to me aesthetically. You either like it or ya don't.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Unfortunately, I'm gonna have to go with a \"do not necesarily recommend\" on this one. Very much the Family Guy joke about The Godfather \"insisting upon itself\" -- this game does exactly that. Folks seem so convinced of its genius, but I found the \"twists\" and \"turns\" to be insufferable, the meta-textual nature of it boring and more than a little tryhard, and despite truly enjoying much of the core gameplay loops of Act I and Act II, Act III and the \"ending\" require researching an ARG to fully get there. Even then, the juice is not worth the squeeze! There's a lot of promise here, I thought my time with this game was going a different way for most of it, but... man, I just cannot get past how wack it ended up being. Even if it started SO STRONG. Also, I have no idea what people in other reviews are talking about with 'endlessly replayable\" because mf no it is absolutely not lmao",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really loved this game, and then I really hated this game.\n\n 9/10 for the main game.\n\n1/10 for the end game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Propably the most overrated game I've ever played. Act 1 was awesome, but the next two were nowhere near as good.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I guess I don't know what I got out of playing this.\n\nThe gameplay itself is based around a simple four lane trading card game that gets a little thin after a while. Aside from a few mechanics it's pretty straightforward. They seem really proud of this gameplay because you are playing it constantly.\n\nThere are puzzles but they range from so easy I don't know why this should be a bar to progress to wow I actually had to look around for the solution to this one. \n\nThe story is basically just a creepypasta/SCP. It's digestible enough but a lot of the elements (the number and types of scrybes for instance) seem arbitrary. I don't really know why this story needed to be told. It doesn't seem to come from a place of burning inspiration. The ending is incredibly abrupt and stupid. Expect a lot of fourth wall breaks and acknowledgement of ludological dissonance. Kudos for risking it by making live action segments tho more games should do that.\n\nI guess I don't get what I was supposed to take from this. There are some really sick boss fights with some great designs. The vibe for the front half of the game is pretty great it just kind of degenerates.\n\nOverall I'd give it a 6 out of 10. Better than average, but not worth the ten hours or so it takes to beat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not really a recommend from me. The game plays fine, and the gameplay loop is okay, but the way the story is told and the way the acts turn out is a bit disappointing. Act I is great, loved every second. Act II came around and I kinda felt like I was tricked, the gameplay is quite different from Act I and I wasn't a fan. I trudged through it, kinda paying attention to the story but also kind of not, because I was just wanting this part to be done with. Act III came around, and the gameplay was similar to Act I, except it used a different style map where you didn't have your path laid out in front of you, you have to go back and forth between different areas like in Act II.\n\nOverall, the core gameplay was enjoyable enough, but I felt like the game had an identity crisis and tried being too many different things at once. If  the gameplay stayed like it was in Act I, it would be a huge recommend for me, but  since I've just finished the first boss on Act III seven hours in (half of which I was just going through the motions) and I don't feel like completing the game, or seeing the conclusion of the story, I can't say I recommend this game. Especially not when all of the screenshots and videos on the store page are from Act I - to me, it really feels like a bait-n-switch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I hate to give a negative review to this game, it was very fun while I played, Its a sort of pseudo-roguelike card battler with a dark sense of humour, many secrets and interesting graphics, with a unique story. As you play, the game evolves and although it's not too deep at the beginning it gets to a good place in complexity. Unlike a regilar roguelike the further you progress the more different the game becomes, and this a good thing. Sadly I lost interest and didn't finish the game, this is the only reason for my negative review. If you enjoy roguelikes and different games you should give this game a try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I liked this game - Act 1 starts off so wildly strong.\n\nPast Act 1 it gets infinitely less interesting and polished. I tried to stick around with it, but the game got significantly less interesting as time went on, especially the meta-narrative elements. The game tons of ciphers and clues not resolved on in the game, and ends extremely inconclusively. This is fine for people who like \"digital geo-caching\", of sorts, but I generally believe games should be a finished package.\n\nI think the biggest way to summarize my final feelings on the game would be when, after googling all the cipher solving others did, I came across this: [spoiler]The game's discs mailed to people had files which implied the \"Karnoffel code\" is so evil Hitler literally carried the cards around on his person. How fucking lazy is this? Is this your way of trying to tell us it's evil?[/spoiler] Give me a break.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Get it on sale, not worth it on full price.\n\nOnly act I. is fun.\n\nRest is either nice a little or feels unnecessary most of the time.\n\nEndgame (new game+ of act I.) is literally rng based and unfun compared to act I. (but that becomes boring because it's too easy) the difficulty spike is too real without even a few modifiers added. You sweat blood with the rng and you can only play it through with very specific build which involves 0 thinking and creativity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cannot start a new game i literally want to k*ll my self and everyone involved in this design decision. i am truly disappointed, my day is ruined, and i cannot live like this anymore. nothing in my 46 years of crawling around this earth has prepared me to withstand this level of agony. my only, and subatomic sized, hope is that this earth becomes nothing but ashes just and only because of this incredibly stupid and pedantic \"\"feature\"\" has been the cause. consider this my only relevant part of my will, which will be of use very very soon...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have rarely felt this dumb. I didn't have fun at all. Never understood the slider puzzles. Even after looking up every puzzle. I just got to the point where I brute forced them. Got to Act 3 and I am so bored. At first I got a bounty for winning too much, but then I lost every match for the next 3 hours? This is why I won't be finding out what happened to the card guy. It feels like it was made kinda crappy as an aesthetic but it is just kinda crappy. How is this full of Overwhelmingly Positive reviews?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aggressively not for me. If a game’s response to a good run is quite literally “fuck you, you didn’t go through enough story to arbitrarily beat your run” I don’t feel like I’m playing a game anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, the tutorial takes about 3 hours.  All of the screenshots are from the tutorial.  Once you beat it, it forces you to play an *ENTIRELY* different game that *REALLY* sucks.  I mean it's really awful.  Graphics are total garbage, gameplay is awful, etc.  AND you can't play the FUN game without unlocking a hidden feature.\n\nTo play the fun game shown in screenshots after beating the game, go to start menu, hold shift, press K M.  This unlocks \"Kaycee's mod\", which SHOULD NOT be hidden.\n\nEdit: After playing Kaycee's mod for about a dozen runs, and repeatedly coming across impossible to win fights, where the enemy lays 3 creatures first turn, then 3 more turn two, with no way of fixing broken  (impossible to win) fights, I'm changing my review to negative.\n\nWhy negative:\nTutorial is only 3 hours long, but it's a blast.  So there's that.  The problem is that's not enough to justify the price tag, even on sale.  There's no way to play \"non-tutorial\" mode on a reasonable difficulty.  I don't even mind losing to \"hard\" fights that \"IF\" I had the right cards/items I could win.  It's the \"Utterly impossible no matter what cards/items\" fights that are a turn off.\nAfter the tutorial is an *entirely* different game with the worst 2D graphics I've ever seen.  It's *NOT* the same game.  It's a total bait and switch.  And Kaycee's mod doesn't make up for the ultra short \"fun\" part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i know this is supposed to be subversive and a commentary on game design and stuff, but the game just isn't fun. it's significantly worse to play than other similar \"roguelike deckbuilders\" so whatever it's trying to do is lost on me. i got to act 3 where it's both much harder and much longer than the previous 2 acts, and i've run out of energy. the ARG parts are cool but they're few and far between.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like roguelike games with nothing but RNG between you and a decent experience, play this. Or any other trash ass roguelike. You fucking peasant.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}