{
  "positive": [
    {
      "review": "I could keep playing this for 50 more hours but I need to move on!\nJust a fantastic deckbuilder all-around. Every clan has a special mechanic and mixing and matching different clans kept me hooked. and the music is just excellent",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I think it's official -- I like this more than Slay the Spire. There's a little more depth in terms of clear synergy strategies, and that becomes fun to think about. I also like the clarity of knowing what kinds of boss challenges are ahead to inform a deck build.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "FUN FUN FUN. I get so sucked into this game. The googly eyes are a must. Play this game, if you enjoy trains and/or deck builders.\r\n\r\nalso my chat said this is the title of my tape and that's just not very nice.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Monster train 1 can't be called perfect game, even great one, it is indeed fiiles with many cards with different mechanics, good visuals and pleaseant music, but at the same time it lashes at you with catastrophicslly low roster of enemies, outrageously long meta progression and nevertheless limited number of combinations, which leads to limited unusual gameplay situations. \nIt is good game, it's true, but nothing more.\n\nGood game - 7/10.\n\nP.S. BUT Monster train 2 is wonderful, much more cards and mechanics, more enemies and bosses, and even more music (and sometimes it rocks!). So there is really no reason to buy first game, when sequel is already on board, including the fact, that they both cost the same 25 dollars/euro.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great fun for a while. wouldn't say it's as replayable as something like Slay the Spire though.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I picked this up on sale for $1.99, and I'm glad I did. While roguelikes/lites aren't usually my preferred type of long-term game, I enjoyed this one.\n\nI really dug the gameplay loop during the six hours I played. The core mechanic involves testing out different combinations with the deck-building cards, removing weaker ones, and growing stronger to be able to face the final boss. Doing a run usually takes about 15–30 minutes, making it quick and fun. A unique aspect of Monster Train is that you must defend your pyre at the top of a train on three different floors while the enemies ascend.\n\nThere is no real story. And the graphical style is decent. It has a very Flash/mobile aesthetic, which isn't something I usually prefer.\n\nBut for two bucks, I got some solid enjoyment out of the main story and beating it. I can definitely see myself going back to use the different clan combinations (you choose a primary and an allied clan for each run) and other mechanics to have some fun here and there.\n\nA 7 out of 10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best auto battler I've ever played.\nPros:\n1.  Doubles as a CCG which is nice.  LOTS of content to unlock by actually playing the game as opposed to mtx.\n2.  Easy to pick up/put down/pause\n3.  Even if you lose you still progress.\n4.  Losing doesn't feel like you wasted your time and isn't frustrating in that sense (likeMTG Arena)\n5.  Pretty cool design despite it being cartoony.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun, addicting, and incredibly well-designed. There's a ton to unlock and a great DLC to give you even more to do.\r\nThe art work is excellent, the bosses are hard, and the randomization feels fair. Easily recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The success of this game is deserved. It's fun and creative, it offers a lot of variety, and it's not so stupidly challenging that you're put off from trying another run. The dlc actually adds something worthwhile, too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not big into card deck building games, but this has a great look at is fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, didn't expect such a good ex. Love it! First card battle game for me in steam and I'm very happy with it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shiny Shoe delivers again. If you enjoyed Monster Train or any other roguelike deckbuilders, you are going to enjoy this one too. The soundtrack in particular is quite an improvement! \n\nApart from that, most of the initial problems (e.g. old clans not having room and equipment cards) have been adressed and the game is actively improved by free updates. Looking forward to any DLCs!\n\nHowever, if you are looking for real difficult challanges comparable to StS A20 Heartruns or similar, you will be dissapointed. The game lacks a bit for the real brainians that like to spend hours on a run. With some experience, most runs will feel solved after the first couple of rings. There are some \"cursed seeds\" that challenge you more, but you have to join some discord groups to find them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Similar to Slay the Spire, the gameplay is well constructed and fun, with different reasons you might replay it time and again if you enjoy the card battles.\n\nThat said, once I beat both this and Slay the Spire multiple times with different starter decks/mechanics, there really isn't much left in the way of new things to do. The lack of any really interesting story also makes it feel a tad hollow. Get on a deep sale for a decent distraction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game.\r\nHad an issue during one fight where I lost all but 1 ember during several turns, and I couldn't find the reason.\r\nFun game and this was the only issue I found so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive, tons of replay value, strategies to approach each run, cards and much more to unlock after runs, etc. Super great, super fun, highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know Monster Train 2 is out and is basically a straight upgrade to this from what I've heard, but eh. This is still good, and it's probably still worth playing before going into 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of ways to get really overpowered in this game, love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Good: Monster Train HURLS your demonic ass onto a PYRE-POWERED TRAIN TO HELL, roguelike deckbuilder where you STACK FLOORS OF MONSTERS to MULCH heaven's winged wankers! Clans? INSANE VARIETY—Hellhorned berserkers, Umbra vamp-sucks, Wurm poison orgies, EACH a combo-exploding fever dream of synergies! Runs CRACK ADDICTION, brisk 45-min blasts with positioning mindfucks, artifacts twisting decks into OP apocalypse machines. Covenants ramp to masochistic nirvana (25 levels!), dailies, Hell Rush multiplayer—Slay the Spire? This pyre-roasts it! Replayability eternal, unlocks jank heaven. BRAIN-MELT BLISS!\r\n\r\nThe Bad: Learning curve SPIKIER than Lucifer's buttplug—clan math, floor tactics? Trial-by-fire or rage-quit! RNG cackles like a imp orgy, swingy runs YEET your god-deck on one bad draw. Early misplay? Key unit pops, run derails faster than a drunk conductor. Locked into early picks, less STS-style deck surgery—git gud or cry brimstone! Boss order repetitive, grinding covenants feels like eternal damnation lite.\r\n\r\nThe Ugly: Pyre SNIPE vulnerability = ULTIMATE RAGE-BAIT, one seraphim laser and your epic run EXPLODES in clown tears! UI BUSY AS HELL'S DMV—tiny icons, overlapping helltext, art bland as boiled demon balls. Rare crashes lurk like tutorial poltergeists, story thinner than angel wings. Clan balance wobbles—some combos trash-tier turds—but patches mostly exorcised the bullshit!\r\n\r\nThe Verdict: 9.5/10, Pyre-Defending Roguelike Deckbuilder",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played a lot of Slay The Spire and feel that this game was a refreshing twist to the genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, I didn't expect to love it this much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only second to slay the spire, very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought this game was about training monsters, it's not",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone says this is better than slay the spire. They were right!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "scratches the deckbuilder roguelike itch really well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have but one thing to say....\n\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!....\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.... OH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!\nOH-WA! \nOH-WA! \nOH-WA!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The second best roguelike deckbuilder right behind 'Slay the Spire', and the best part is that it does not copy it at all. It has a unique gameplay loop with some real fun interactions between mechanics. Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "I bought this game around 2 years ago, I was on a Darkest Dungeon kick and this kinda looked to be similar. Apparently it wasn't, and I didn't quite understand the game at the time, I let it sit who knows how long before I uninstalled. Then. 2 months ago I decided to install it again and give it a second chance. After trying one run and recently watching someone play the Battlegrounds mode in Hearthstone, this game suddenly clicked for me. How wrong was I to have not been playing all this time. My how I've missed out\r\n\r\nIn the last 2 months I've accumulated probably 150 hours between this, the mobile version, and Monster Train 2. I can 100% recommend this game, even with the existence of it's sequel. I don't usually give too many looks to games that are deck builders, but the roguelite DNA in this is just perfection. So much so that if you are trying to decide between this and #2, this is the better roguelite, and #2 is the better game overall. You can't go wrong with either game, but just because it has a sequal that expands upon it in every good possible way, doesn't mean you should miss out on this. I could easily see myself putting another couple hundred hours each in this and the mobile version before fully jumping over to #2 more frequently",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Being a roguelite deckbuilder, it is very similar to Slay the Spire in gameplay. But unlike StS where several less than perfect choices can easily ruin your run, Monster Train focuses on forging yourself into an unstoppable powerhouse.\n\nThe interesting concept of mixing two clans creates multitudes of unique synergies. Game-breaking combinations exist in droves and it is up to you to experiment and discover them.\n\nThis game is not as tightly balanced than StS, with many runs highly dependent on luck. There is always randomness to games like this, but it sometimes feels nigh impossible to optimize your choices to find a way to win. Nonetheless, for a casual player like me, successfully amassing exodia in my deck and steamrolling all foes is still exhilarating as ever.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Not my cup of tea, but I can see why others enjoy it.  Many deckbuilding options, but it didn't feel like it mattered too much.  5/10",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I could keep playing this for 50 more hours but I need to move on!\nJust a fantastic deckbuilder all-around. Every clan has a special mechanic and mixing and matching different clans kept me hooked. and the music is just excellent",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I think it's official -- I like this more than Slay the Spire. There's a little more depth in terms of clear synergy strategies, and that becomes fun to think about. I also like the clarity of knowing what kinds of boss challenges are ahead to inform a deck build.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Drastically more fun than i expected, bought if just for the discount to try it our and very very pleasently supprised.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "FUN FUN FUN. I get so sucked into this game. The googly eyes are a must. Play this game, if you enjoy trains and/or deck builders.\r\n\r\nalso my chat said this is the title of my tape and that's just not very nice.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The gameplay is unique, first time playing a roguelike deckbuilder that plays around different floors (Thronebreaker doesn't count) so, thumbs up for creativity. Also, it is not as hard as Slay the Spire so try this is you are new to the genre.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Monster train 1 can't be called perfect game, even great one, it is indeed fiiles with many cards with different mechanics, good visuals and pleaseant music, but at the same time it lashes at you with catastrophicslly low roster of enemies, outrageously long meta progression and nevertheless limited number of combinations, which leads to limited unusual gameplay situations. \nIt is good game, it's true, but nothing more.\n\nGood game - 7/10.\n\nP.S. BUT Monster train 2 is wonderful, much more cards and mechanics, more enemies and bosses, and even more music (and sometimes it rocks!). So there is really no reason to buy first game, when sequel is already on board, including the fact, that they both cost the same 25 dollars/euro.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great fun for a while. wouldn't say it's as replayable as something like Slay the Spire though.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "im usually not into card based games like this, however its really good. eachj run is quick and varies so much that it doenst get boring",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is a lot more fun that i expected it to be. It looks like a free mobile game imo, but the gameplay is interesting enough for a unique deckbuilder.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I picked this up on sale for $1.99, and I'm glad I did. While roguelikes/lites aren't usually my preferred type of long-term game, I enjoyed this one.\n\nI really dug the gameplay loop during the six hours I played. The core mechanic involves testing out different combinations with the deck-building cards, removing weaker ones, and growing stronger to be able to face the final boss. Doing a run usually takes about 15–30 minutes, making it quick and fun. A unique aspect of Monster Train is that you must defend your pyre at the top of a train on three different floors while the enemies ascend.\n\nThere is no real story. And the graphical style is decent. It has a very Flash/mobile aesthetic, which isn't something I usually prefer.\n\nBut for two bucks, I got some solid enjoyment out of the main story and beating it. I can definitely see myself going back to use the different clan combinations (you choose a primary and an allied clan for each run) and other mechanics to have some fun here and there.\n\nA 7 out of 10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game stand out among all the Roguelike Cardgames, \nit's a unique blend of Tower defense + Autobattler + Cardgame and i've never seen other games like this. \nUsually the best strategy can get a bit stale which is buffing a few units to the moon, making other build like spell build hard to build around, but that's the identity of the game, making broken synergies work with eachother is essential to the game and is also the best part about this game.\nOverall one of the best Card Battler on Steam.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Monster Train is the best roguelike I have played. The fast paced combat, constant learning and growing, tons of viable strategies, and consistent gameplay loop made its way into my heart.\r\nIt took me 84 hours to complete every achievement, only using a guide for two of them (How to Deckbuilder and Covenant 25 Infernal).\r\n\r\nThe real genius comes in the form of the clan system, where you get to pick two different clans and have both cards, allowing you to find interesting and unique synergies between the cards. Infernal's self damaging spell being turned into viable kill options on enemies with Stygian Guard's spell power or turns them into sac outlets for Melting Remnant on death effects. It all works together.\r\n\r\nThe DLC is fantastic, adding in a new final boss that is very interesting to play around and is unique. A new clan with tons of unique mechanics and synergies. And a more robust difficulty system where you can choose to get more powerful rewards for increased difficulty throughout the run.\r\n\r\nGameplay: 10/10, the best deckbuilding I have seen with upgrading your cards with unique tokens. The Tower defense type battle system. The close calls where every point of damage matters. The times you get overpowered, but you actually have to work for the victory still.\r\nStory: 7/10. Most of the story is background lore, and I appreciate it a lot more while playing through the sequel.\r\nGraphics: 9/10. I love the art style is the game. Every blends well together and it sets the tone for the game.\r\nSound: 7/10. The music is very good, the sound effects get a bit much, but I do like the OST.\r\nDifficulty: 6/10. Not very difficult, but it builds perfectly and each covenant rank increases in difficulty at the same rate you are getting better. The later covenant ranks add to the depth of the game mechanics rather than taking them away.\r\n\r\nOverall: 9/10\r\n\r\nMonster train 2 might be my favourite roguelike after I finish playing it, but right now I am still undecided.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This has similarities to slay the spire but the art style is super refined it has a cool story and the animations look great. On the normal difficulty I am playing right now it is much more forgiving than slay the spire. The random events in slay the spire tend to fuck you over and are run ending more frequently than in this game. Here I have only encountered one random encounter that I think sucks but you can just say no to it and you won't suffer negative effects.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An Incredibly well-made card/roguelike game. The first night I bought it I had an assignment for tomorrow but I kept saying one more run and played until 2.30 AM. The RNG factor is there but it's never overpowering so you can succeed with a well crafted card deck. The uniqueness of the factions really add something beautiful to the whole game. Would have loved it even more if the original run was a bit longer and maybe there were more factions. Nevertheless I have played it for hours the moment I bought it 10/10 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best auto battler I've ever played.\nPros:\n1.  Doubles as a CCG which is nice.  LOTS of content to unlock by actually playing the game as opposed to mtx.\n2.  Easy to pick up/put down/pause\n3.  Even if you lose you still progress.\n4.  Losing doesn't feel like you wasted your time and isn't frustrating in that sense (likeMTG Arena)\n5.  Pretty cool design despite it being cartoony.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really, really fun rougelite with a unique premise, fun art style, and addictive game play formula. I got it on sale for TWO DOLLARS, which is absolutely wild to me for how great of a game this is. I went in expecting something to pad my next hour while youtube plays in the corner, and got a genuinely awesome deck style monster battling game with surprisingly deep mechanics. I've been running the base champion and funneling armour cards to him after he gets an upgrade that increases his damage every hit he gets. He tanks a trillion hits and can two shot the bosses by the end of the battle. HIGHLY recommend on sale.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My fav deck builder roguelite and i've played quite a few of the big names. Slay the Spire was fun for a bit but I was kinda done after 1 run on each character. Balatro didn't feel different enough on each run to ever really catch my attention and I can't even think of the names of the others because they just didn't stick out to me. But monster train feels super special. I really really like this game and the style. It's super unique and the characters are very cute. I'm definately going to get MT 2 and highly reccomend MT1.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "\"I'm so hungry\"\n*The 3,000 morsels I've spawned over the course of the game looking at my unit in fear*",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun, addicting, and incredibly well-designed. There's a ton to unlock and a great DLC to give you even more to do.\r\nThe art work is excellent, the bosses are hard, and the randomization feels fair. Easily recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The success of this game is deserved. It's fun and creative, it offers a lot of variety, and it's not so stupidly challenging that you're put off from trying another run. The dlc actually adds something worthwhile, too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not big into card deck building games, but this has a great look at is fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, didn't expect such a good ex. Love it! First card battle game for me in steam and I'm very happy with it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shiny Shoe delivers again. If you enjoyed Monster Train or any other roguelike deckbuilders, you are going to enjoy this one too. The soundtrack in particular is quite an improvement! \n\nApart from that, most of the initial problems (e.g. old clans not having room and equipment cards) have been adressed and the game is actively improved by free updates. Looking forward to any DLCs!\n\nHowever, if you are looking for real difficult challanges comparable to StS A20 Heartruns or similar, you will be dissapointed. The game lacks a bit for the real brainians that like to spend hours on a run. With some experience, most runs will feel solved after the first couple of rings. There are some \"cursed seeds\" that challenge you more, but you have to join some discord groups to find them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Similar to Slay the Spire, the gameplay is well constructed and fun, with different reasons you might replay it time and again if you enjoy the card battles.\n\nThat said, once I beat both this and Slay the Spire multiple times with different starter decks/mechanics, there really isn't much left in the way of new things to do. The lack of any really interesting story also makes it feel a tad hollow. Get on a deep sale for a decent distraction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game.\r\nHad an issue during one fight where I lost all but 1 ember during several turns, and I couldn't find the reason.\r\nFun game and this was the only issue I found so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive, tons of replay value, strategies to approach each run, cards and much more to unlock after runs, etc. Super great, super fun, highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun for the first 10 hours, but quite repetitive afterwards... same boss over and over",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well I did not know that I enjoyed Deck building games.  Perhaps you have not played one?\n\nIt (the enjoyment above) started with many friends saying that I should check out Slay The Spire (SS from now on) and that game hooked me in.  Then I decided to check out some twitch streamers of SS and gravitated towards one of them.  This streamer then was playing Monster Train (MT) and I asked him what his opinion of it was.  He said \"He enjoys it more than SS and thinks it is the better game\".   I pretty much wholeheartedly agree with him on this sentiment.\n\nGobs of replayability due to the two faction team choices and then the three champion choices within the main faction.\n\n100 hours later and it is one of the few games (less than ten) that I have bought on Mobile.\n\nLots of love have gone in to this game and I would recommend it to anyone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun and addicting - like slay-the-spire meets darkest-dungeon or something. For me it's great for playing while working out: fight, lift, repeat...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is a lot of fun; there's an insane amount of viable decks/upgrades and new ways to play the game are being introduced even hours after playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but for me struggles with Roguelike syndrome after a while, where either the difficulty gets ridiculous or things can start to feel the same. The daily Challenge is really fun, but otherwise am probably done with the game. Solid pick for the price, and if you really love roguelike deckbuilders then this one's a keeper.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was getting destroyed trying to build a balanced deck like I would in some other card games, but then it clicked: the goal is to break the game. Figure out how to overpower your deck and crush. Once you combine a unit with Slay with Multistike its like, ok bxtch, lets go. Then you figure how to win battles with just spells because your multistrike glass cannon and tank got destroyed by some effect you didnt prepare for. There is so much strat going on and also THERE IS A WORKSHOP AND A SEQUEL. wot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "did you like slay the spire? you'll like this, its slay the spire but with dimensions and summons! there's some great synergies and general attacks, but the bosses are significantly tougher than the regular encounters. be prepared and never let up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, especially for that small price. Keeps you interested through lots of achievements and unlockable decks and cards. Also great that every run starts with random cards, so every run is different and you gotta adapt to your cards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun deckbuilder with high replaybility due to a high diversity of mechanics which results in a plethora of builds. If you own a steam deck, apart from a relatively small text, this is a great game to play on the deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best deckbuilders, not much has topped it since release either.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good. It's easier than Slay the Spire, but the challenge does ramp up the more you play. I didn't think I would like the multi level design at first, but it's pretty fun when you play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game and have spent many thousands of hours one both 1 and 2. \n\nIf you are trying to decide between the first game or the second because money is tight, just go ahead and get the 2nd. I promise you wont miss too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Monster Train is a very, very good game. It's inferior in most aspects to Slay the Spire, although not in all. Design wise it's heavily leaning toward combinations - less cards per ensemble, but out of the box ability to combine two ensemble that is not just a quasi-gimmick like the prismatic shard in Slay the Spire but actually designed for that. Similarly the playing board has extra dimensions - floors, numbers of entities on both sides - while the card play itself is more limited (although still very much existent and deep). Art is nothing remarquable although it's reasonably pleasant. Music is catchy. While I prefer StS on all of those aspects, it's a matter of taste. What is not though is the fact that the UI is way less polished/well thought than Slay the Spire, by far my biggest issue with the game. It's nothing disastrous but coming from StS, oof. Issues include inability to see the whole board at once (for no reasons other than aresthetic at the -severe- expense of clarity and responsiveness - a major crime shared by Inkulinati, who thinks those constant zoom in zoom out are any good? Jesus.), discard UI that has the wrong trajectory for card pick making discarding the wrong one the default results if you don't circle around things, an enthousiasm for playing card you released 34 thousands mile away from away from a floor after deciding you didn't want to play it on that floor (which it absolutely will nonetheless). In general they were many other things that could have been done but weren't so that the information was less bloated. Lots of numbers without bars, lack of hierarchy in the tool tips... make it very easy to miss informations and give up on learning by the game rule, instead just trying stuff. Which is... doable but StS precisely shown that you could be *actually playing* the game from the first minute, having all the information you need to make decisions. \n\nIt does share a cons with StS which is no undo/restart the fight but it's vastly more problematic because of the above, the facts that a lot of the time you have to play shit to simply get the rule the tool tip wasn't 100% clear about etc. Nothing bad in itself but it's a bit dumb to have to quit to the main menu en re enter the game to restart it. \nWhile this all may sound negative let me reiterate this is down the line a brilliant game though. It's *extremely* catchy, packed with interesting mechanics and a solid execution of those. The cost in money is nothing here, it's more about how willing you are to put your finger in the cogs and get eaten by the game. Although from what I understand the endgame isn't eternal like StS, but it sure is hundreds of hours of great fun. Unquestionably worth buying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game with a few interesting game mechanics and lots of perks to keep you playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slay the spire but faster and with more classes, pretty good, 8/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 deckbuilder roguelite. There is a lore setting for cards and a googly eyes setting. Really unique combat. Very addictive and fun. Runs great!\n\nEDIT: Buy Monster Train 2 on sale. It is not something to buy for the lore, dialogue, or spare free time. The new clans are cool, mostly, but I have yet to unlock any of the old clans in MT1 yet. Its very grindy unlocking. I only like Pyerborne and the mushroom clan out of the five.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First played this game on Xbox quite some time ago, had to buy it again since moving into PC as it is such a good game.\n\nThe art work, fantastic.\nThe style and flow of gameplay, soothingly captivating. \nThe RNG, elements of difficulty, power spikes and just out of nowhere being obliterated randomly, absolutely exceptional. \n\nThis game (Alongside Monster Train II, which I'll surely be getting after I juice this game to its potential) is an absolute must try if you are a fan of card-team building, rougelike, strategy games.\n\nVery easy to pick up. \nVery hard to put down once you learn how to play.\n\n10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! I bought it during the Autumn Sale and got completely hooked right away. The unique factions make every run feel fresh and different, each offering its own playstyle and strategic depth. The balance between risk and reward keeps you thinking ahead, and every decision feels meaningful. It’s highly addictive and offers incredible replay value, since no two runs ever feel the same. Monster Strain reminds me of Slay the Spire in many ways, but it goes beyond that with more innovation, personality, and creative mechanics. The art style and music fit perfectly, making the experience both intense and satisfying. Easily one of the best deckbuilders I’ve ever played, and an absolute must-have for anyone who loves strategic roguelike games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Somehow, the game feels balanced while every win I manage ends up with a wildly different strategy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love games that you can pick up and play for a small window and put down. Great game for that and each run is something different.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well made and highly polished roguelike card game that offers 20+ hours of gameplay. Each run gets more difficult after completion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite a frustrating bug with the save system, the game is a lot of fun.\n\nWhat I liked:\n- Game mechanics are somehow unique and feel just right.\n- There is a good variety of cards and enemies.\n- Good synergies.\n- It's interesting to start over and try something new.\n\nIf you like deck building turn-based games, I recommend this game to you.\nI enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent artstyle, deckbuilding gameplay, and good progression. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the artstyle and music and gameplay loop. I got bored of the game after 30 hours but in that time I thoroughly enjoyed it. Slay the spire IS better however this is a fun alternative. the floor mechanic is awesome and i love the theme of progressing along a train.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice card game, so addicting. lots of varieties of card combos and champions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i'm seeing the comparison being thrown around that this is similar to Slay the Spire, but honestly this game is way better in every single aspect imaginable. the lane system, the multitude of factions, the mix of 2d and 3d visuals are all things I really enjoy about this card game. unlike Slay the Spire, I don't have the feeling that I NEED to have a deck full of synergy cards to make something work. great fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its got monsters, its got a train, its a fresh take on deck builder rougelikes, what more an you want?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting card strategy game with fun and varied mechanics. The music is meh, but still a great game overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent roguelite deckbuilder. Easily in the top 10. The second one is even better. Just don't skip out on this in spite of that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best rougue like deckbuilders out. no gripes from me. every run is unique and equally thrilling. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A card based auto battler that doesn't pull any punches. Plenty of variety and changing difficulty makes this one highly re-playable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know Monster Train 2 is out and is basically a straight upgrade to this from what I've heard, but eh. This is still good, and it's probably still worth playing before going into 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun roquelike & deckbuilder, runs are fast and very awesome :D \r\nOnly downside - there is a boss or 2 that are waaaaaaay unfair, but that could be just me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "basically slay the spire with some twists. Good to chill with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "REALLY GOOD GAME. LOT OF FUN TO PLAY. PROVIDES GREAT VALUE AS YOU CAN PLAY FOR A VERY LONG TIME. BOUGHT IT ON SALE FOR UNDER $3, ONE OF THE BEST PURCHASES.\n\nHIGHLY RECOMMEND.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lots of ways to get really overpowered in this game, love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Good: Monster Train HURLS your demonic ass onto a PYRE-POWERED TRAIN TO HELL, roguelike deckbuilder where you STACK FLOORS OF MONSTERS to MULCH heaven's winged wankers! Clans? INSANE VARIETY—Hellhorned berserkers, Umbra vamp-sucks, Wurm poison orgies, EACH a combo-exploding fever dream of synergies! Runs CRACK ADDICTION, brisk 45-min blasts with positioning mindfucks, artifacts twisting decks into OP apocalypse machines. Covenants ramp to masochistic nirvana (25 levels!), dailies, Hell Rush multiplayer—Slay the Spire? This pyre-roasts it! Replayability eternal, unlocks jank heaven. BRAIN-MELT BLISS!\r\n\r\nThe Bad: Learning curve SPIKIER than Lucifer's buttplug—clan math, floor tactics? Trial-by-fire or rage-quit! RNG cackles like a imp orgy, swingy runs YEET your god-deck on one bad draw. Early misplay? Key unit pops, run derails faster than a drunk conductor. Locked into early picks, less STS-style deck surgery—git gud or cry brimstone! Boss order repetitive, grinding covenants feels like eternal damnation lite.\r\n\r\nThe Ugly: Pyre SNIPE vulnerability = ULTIMATE RAGE-BAIT, one seraphim laser and your epic run EXPLODES in clown tears! UI BUSY AS HELL'S DMV—tiny icons, overlapping helltext, art bland as boiled demon balls. Rare crashes lurk like tutorial poltergeists, story thinner than angel wings. Clan balance wobbles—some combos trash-tier turds—but patches mostly exorcised the bullshit!\r\n\r\nThe Verdict: 9.5/10, Pyre-Defending Roguelike Deckbuilder",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worse than the masterpiece that slay the spire is, but it's still enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played a lot of Slay The Spire and feel that this game was a refreshing twist to the genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good balance of randomization and control.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, I didn't expect to love it this much",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's OK. Pretty braindead, to be honest. I mostly played it while I was too hungover to think.\n\nMusic was fine, one or two songs were memorable, the rest are what is best described as \"serviceable.\" I also thought the aesthetics of the game were really dumb, which didn't help my impression of it.\n\nThe gameplay can give you this sense that you're doing something at first, but after a while you realize that your creatures and spells rarely synergize in any interesting way. Too much focus was put on the board, maybe. What's left is a game that feels half-deckbuilder, half-tower defense, and isn't very good at either.\n\nIt's certainly an overrated game, and I'm not sure why. Whenever I see someone name drop it as \"one of the greatest deckbuilders ever\" it kind of makes me question the validity of everything they say after.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The idea is interesting and learning the game is fun, but the deckbuilding options feel VERY limited. You just pick a strategy at the start (normally based around your champion choice) and then you exclusively pick cards to support that strategy. The choices are pretty limited and you can skip when you don't like the card selection. It doesn't require enough variance or improvisation to make it much more interesting. The secondary clan option is a cool idea on paper but most combinations just don't work together meaningfully enough to be preferable to sticking strictly to your main clan. If you're looking for a deckbuilder with this mix and match concept done well, just get the Packmaster mod for Slay the Spire - lots more fun to be had there.\n\nIf you want to try the game, I recommend getting it only on HEAVY discount like I did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Solid for about 20 hrs. But the scaling is pretty terrible compared to other roguelike deck builders.\n\nCompared to other better roguelike deckbuilders this is by far inferior to some of the top names in this category like Slay the Spire or Across the Obelisk. Simply put the enemies will get stronger as you play more and unlock higher challenges. But the game fails to give you LITERALLY any actual upgrades. Now most roguelikes don't give you direct upgrades, but the best of them give you ways to reduce variance with your starting hands and loadouts. Without those in place you really wind up rerolling starting setups until you get a set that has the specific things you want for a good run.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its all right. I don't think I would recommend to people tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rank 9 is unbalanced af. needs to be steam deck optimized.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clearly I am in the wrong given the overwhelmingly positive reviews, but I don't understand what makes it so good. The builds are not terribly fun and driving synergy between the different clans/cards is not intuitive and boils into frustration given some ill-balanced mechanics and overwhelming bad implementation of RNG. \n\nEven for the $2.50 sales price, I feel like I overpaid and am just rewarded with frustration.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's OK. Pretty braindead, to be honest. I mostly played it while I was too hungover to think.\n\nMusic was fine, one or two songs were memorable, the rest are what is best described as \"serviceable.\" I also thought the aesthetics of the game were really dumb, which didn't help my impression of it.\n\nThe gameplay can give you this sense that you're doing something at first, but after a while you realize that your creatures and spells rarely synergize in any interesting way. Too much focus was put on the board, maybe. What's left is a game that feels half-deckbuilder, half-tower defense, and isn't very good at either.\n\nIt's certainly an overrated game, and I'm not sure why. Whenever I see someone name drop it as \"one of the greatest deckbuilders ever\" it kind of makes me question the validity of everything they say after.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The idea is interesting and learning the game is fun, but the deckbuilding options feel VERY limited. You just pick a strategy at the start (normally based around your champion choice) and then you exclusively pick cards to support that strategy. The choices are pretty limited and you can skip when you don't like the card selection. It doesn't require enough variance or improvisation to make it much more interesting. The secondary clan option is a cool idea on paper but most combinations just don't work together meaningfully enough to be preferable to sticking strictly to your main clan. If you're looking for a deckbuilder with this mix and match concept done well, just get the Packmaster mod for Slay the Spire - lots more fun to be had there.\n\nIf you want to try the game, I recommend getting it only on HEAVY discount like I did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is less strategy, more grind..\nits okay game if cheap, not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Solid for about 20 hrs. But the scaling is pretty terrible compared to other roguelike deck builders.\n\nCompared to other better roguelike deckbuilders this is by far inferior to some of the top names in this category like Slay the Spire or Across the Obelisk. Simply put the enemies will get stronger as you play more and unlock higher challenges. But the game fails to give you LITERALLY any actual upgrades. Now most roguelikes don't give you direct upgrades, but the best of them give you ways to reduce variance with your starting hands and loadouts. Without those in place you really wind up rerolling starting setups until you get a set that has the specific things you want for a good run.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Monster Train is close to being good. \n\nThe gameplay loop is simple, you have a starter deck with spells and monster cards that you can incrementally improve between rounds of combat. There are also items you can collect that affect either the board state or your cards. The game plays like a mix of slay the spire and Hearthstone Battlegrounds.\n\nThe sad thing is that whilst the game likely has as much content as either of the aforementioned due to the way the macro game has been set up it always feels like your run is just getting started before it ends. The deck building aspect of the game is just too short to enjoy fully. For the rest, it plays like a typical rogue-like with a progression system (you unlock cards/card sets/difficulty levels), just without the enemy variety.  And that is not me being hyperbolic, you will see all the enemies within one run. \n\nWouldn't recommend, especially not at full price. Good time waster, music isn't bad, looks like a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Picked up Monster Train on sale thinking I scored a gem. Visually slick, fast-paced, and packed with roguelike deckbuilding chaos—but it burns out quick. Repetitive runs, bloated mechanics, and balance issues make it more grind than thrill. If you're curious, grab it cheap… just don’t expect lasting magic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I guess I'm confused? The game-play is great. Seems like there are alot of cards and factions to try out - On one level. I literally almost cleared the campaign first try, and did so on my second. \n\nI've ran out of things to do, and I haven't even unlocked half the factions. What? We are meant to grind the same 8 stages until we unlock everything? Why?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A worse version of slay the spire. This game will appeal to those who enjoy instant gratification, the ability to achieve victory at ease is baked into the game but the pay off is always weaker. \n\nNot my cup of tea, there are many better deck builders out there and this one doesn't do anything new or better than Slay the Spire. \n\nDon't understand the hype for this one, oh wait I do - it's the ease of hitting the deck you want and the mild difficulty. So that might entice you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"all of your spells get *consume*\" oh wow. great balancing. right. the boss gets to take away all of your spells. no spell deck is viable. u can only rely on creature cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Less than the sum of its parts. And frankly speaking, the parts are not great to begin with. \r\n\r\nYou should consider directing your Slay the Spire withdrawals elsewhere, else yet a new regret might join your impulse purchases on your Steam library.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game because it was on sale, and I thought it looked cool. Come to find out, every time I boot up the game I just get stuck in a loading screen that's not a loading screen, and can't play the game. Buyers beware, this game is apparently buggy af.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is no way to make any of your cards stronger to start with and just the 1st fight the enemies are strong enough to wipe out your whole team. It's just one big RNG fest to get a good run and waste of time!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "These have to be bot/paid reviews. This is such a shallow game that masquerades as having depth. Anyone comparing this to Slay the Spire is like comparing Halo to Skyrim, oh but aren't they both first person fantasy games where you kill enemies? This game is NOTHING like Slay the Spire except you have cards and you start with 3 mana/energy each turn. That's it.\n\nDamage is the ONLY thing that matters in this game. Sure, the different mechanics can have great use against all the normal enemies, but when it comes to bosses pure damage is the only way to win. And you know what works just as good as all that strategy you used against regular enemies? PURE DAMAGE!\n\nLook, I wanted to like this game as I feel MTG has lost its mind in recent set designs and you have to be rich just to have a *decent* deck. I saw reviews about how awesome this game is and thought hey I could sink my teeth into some nice deck building content right now. But there is no strategy that is going to prepare you for a boss fight that has 1300 HP when most enemies have around 5 to 50 HP and oh you can't play any spells once the boss round starts, so no strategy there, you just have to hope your monsters can somehow deal 20 to 30 times the amount of damage they did when you were taking care of the normal enemies. Oh, and all enemies move first so your monsters will be nice and weakened before the boss starts fighting. I had hope for this game when I had bosses around 300 HP, seemed fair with multiple strategies to make use of, but when you need 4 times the time/damage to kill the boss and your cards aren't 4 times stronger AND you can't even play any healing or damage spells once they start fighting the boss it really just makes all your other cards worthless! Oh, thank you SO much for these 1 mana 2 damage cards! And don't forget about these amazing healing cards to heal ANY single monster for a whole 3 HP all for only 1 mana! They will help SO FUCKING MUCH AGAINST 1300 HP bosses!  Oh and you start with 5 copies each of these worthless cards! Two entire hands that just won't do anything meaningful. Sure, you can upgrade your cards but what is 25HP on my monster going to do against a boss that hits for 18 damage? Oh sure 1 maybe two extra rounds to deal my 30 - 50 damage against a 1300 HP boss, awesome now they have 1200 HP and now they are on the second floor which is already full of monsters I've put there in previous turns so any extra monster cards are deadweight in your hand, but don't worry you get 1 turn to play these junk spell cards that you didn't have time to get rid of or enough money to upgrade and make \"useful\" (but seriously what is 12 damage gonna do vs 2 damage when, again, there is 1300 HP to get rid of)\n\nI'm going to try this game again sometime after I forget how bad it was. I know I only played one run, but honestly I don't care what else this game has to offer. Apparantly the devs have changed cards multiple time because they know how worthless they were and yet they still keep these worthless starter cards that aren't even useful after the first 2 battles! Slay the Spire was different. I wanted to get farther in the game. I wanted to unlock more stuff. I wanted to try different strategies because they all had depth in that game. Challenging but still fair. Hell, even the starter cards had use in the late game, they were never truly worthless. My suggestion is just don't waste your time with this shallow mobile game garbage.\n\nOh, and I thought this would be good for steam deck but the battery life is TERRIBLE. I get 7+ hours playing Slay the Spire 90fps and after 2 hours of this garbage game I'm down by 60% battery life! But hey, what do you need optimizations for when mobile devices rival desktop machines from just a few years ago? Just power thru all that terrible code like you have to power thru this terrible game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolute satanic marxist filth. They say it has a twist but it's actually twisted. The game story reverses the roles of Heaven and Hell. The demons are presented as being oppressed by the angels, and the player plays as a demon fighting the angels. You don't need this filth in your life.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its all right. I don't think I would recommend to people tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rank 9 is unbalanced af. needs to be steam deck optimized.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's OK. Pretty braindead, to be honest. I mostly played it while I was too hungover to think.\n\nMusic was fine, one or two songs were memorable, the rest are what is best described as \"serviceable.\" I also thought the aesthetics of the game were really dumb, which didn't help my impression of it.\n\nThe gameplay can give you this sense that you're doing something at first, but after a while you realize that your creatures and spells rarely synergize in any interesting way. Too much focus was put on the board, maybe. What's left is a game that feels half-deckbuilder, half-tower defense, and isn't very good at either.\n\nIt's certainly an overrated game, and I'm not sure why. Whenever I see someone name drop it as \"one of the greatest deckbuilders ever\" it kind of makes me question the validity of everything they say after.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Clearly I am in the wrong given the overwhelmingly positive reviews, but I don't understand what makes it so good. The builds are not terribly fun and driving synergy between the different clans/cards is not intuitive and boils into frustration given some ill-balanced mechanics and overwhelming bad implementation of RNG. \n\nEven for the $2.50 sales price, I feel like I overpaid and am just rewarded with frustration.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Solid for about 20 hrs. But the scaling is pretty terrible compared to other roguelike deck builders.\n\nCompared to other better roguelike deckbuilders this is by far inferior to some of the top names in this category like Slay the Spire or Across the Obelisk. Simply put the enemies will get stronger as you play more and unlock higher challenges. But the game fails to give you LITERALLY any actual upgrades. Now most roguelikes don't give you direct upgrades, but the best of them give you ways to reduce variance with your starting hands and loadouts. Without those in place you really wind up rerolling starting setups until you get a set that has the specific things you want for a good run.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The idea is interesting and learning the game is fun, but the deckbuilding options feel VERY limited. You just pick a strategy at the start (normally based around your champion choice) and then you exclusively pick cards to support that strategy. The choices are pretty limited and you can skip when you don't like the card selection. It doesn't require enough variance or improvisation to make it much more interesting. The secondary clan option is a cool idea on paper but most combinations just don't work together meaningfully enough to be preferable to sticking strictly to your main clan. If you're looking for a deckbuilder with this mix and match concept done well, just get the Packmaster mod for Slay the Spire - lots more fun to be had there.\n\nIf you want to try the game, I recommend getting it only on HEAVY discount like I did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is less strategy, more grind..\nits okay game if cheap, not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Monster Train is close to being good. \n\nThe gameplay loop is simple, you have a starter deck with spells and monster cards that you can incrementally improve between rounds of combat. There are also items you can collect that affect either the board state or your cards. The game plays like a mix of slay the spire and Hearthstone Battlegrounds.\n\nThe sad thing is that whilst the game likely has as much content as either of the aforementioned due to the way the macro game has been set up it always feels like your run is just getting started before it ends. The deck building aspect of the game is just too short to enjoy fully. For the rest, it plays like a typical rogue-like with a progression system (you unlock cards/card sets/difficulty levels), just without the enemy variety.  And that is not me being hyperbolic, you will see all the enemies within one run. \n\nWouldn't recommend, especially not at full price. Good time waster, music isn't bad, looks like a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Picked up Monster Train on sale thinking I scored a gem. Visually slick, fast-paced, and packed with roguelike deckbuilding chaos—but it burns out quick. Repetitive runs, bloated mechanics, and balance issues make it more grind than thrill. If you're curious, grab it cheap… just don’t expect lasting magic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I guess I'm confused? The game-play is great. Seems like there are alot of cards and factions to try out - On one level. I literally almost cleared the campaign first try, and did so on my second. \n\nI've ran out of things to do, and I haven't even unlocked half the factions. What? We are meant to grind the same 8 stages until we unlock everything? Why?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A worse version of slay the spire. This game will appeal to those who enjoy instant gratification, the ability to achieve victory at ease is baked into the game but the pay off is always weaker. \n\nNot my cup of tea, there are many better deck builders out there and this one doesn't do anything new or better than Slay the Spire. \n\nDon't understand the hype for this one, oh wait I do - it's the ease of hitting the deck you want and the mild difficulty. So that might entice you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"all of your spells get *consume*\" oh wow. great balancing. right. the boss gets to take away all of your spells. no spell deck is viable. u can only rely on creature cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Less than the sum of its parts. And frankly speaking, the parts are not great to begin with. \r\n\r\nYou should consider directing your Slay the Spire withdrawals elsewhere, else yet a new regret might join your impulse purchases on your Steam library.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game because it was on sale, and I thought it looked cool. Come to find out, every time I boot up the game I just get stuck in a loading screen that's not a loading screen, and can't play the game. Buyers beware, this game is apparently buggy af.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is no way to make any of your cards stronger to start with and just the 1st fight the enemies are strong enough to wipe out your whole team. It's just one big RNG fest to get a good run and waste of time!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "These have to be bot/paid reviews. This is such a shallow game that masquerades as having depth. Anyone comparing this to Slay the Spire is like comparing Halo to Skyrim, oh but aren't they both first person fantasy games where you kill enemies? This game is NOTHING like Slay the Spire except you have cards and you start with 3 mana/energy each turn. That's it.\n\nDamage is the ONLY thing that matters in this game. Sure, the different mechanics can have great use against all the normal enemies, but when it comes to bosses pure damage is the only way to win. And you know what works just as good as all that strategy you used against regular enemies? PURE DAMAGE!\n\nLook, I wanted to like this game as I feel MTG has lost its mind in recent set designs and you have to be rich just to have a *decent* deck. I saw reviews about how awesome this game is and thought hey I could sink my teeth into some nice deck building content right now. But there is no strategy that is going to prepare you for a boss fight that has 1300 HP when most enemies have around 5 to 50 HP and oh you can't play any spells once the boss round starts, so no strategy there, you just have to hope your monsters can somehow deal 20 to 30 times the amount of damage they did when you were taking care of the normal enemies. Oh, and all enemies move first so your monsters will be nice and weakened before the boss starts fighting. I had hope for this game when I had bosses around 300 HP, seemed fair with multiple strategies to make use of, but when you need 4 times the time/damage to kill the boss and your cards aren't 4 times stronger AND you can't even play any healing or damage spells once they start fighting the boss it really just makes all your other cards worthless! Oh, thank you SO much for these 1 mana 2 damage cards! And don't forget about these amazing healing cards to heal ANY single monster for a whole 3 HP all for only 1 mana! They will help SO FUCKING MUCH AGAINST 1300 HP bosses!  Oh and you start with 5 copies each of these worthless cards! Two entire hands that just won't do anything meaningful. Sure, you can upgrade your cards but what is 25HP on my monster going to do against a boss that hits for 18 damage? Oh sure 1 maybe two extra rounds to deal my 30 - 50 damage against a 1300 HP boss, awesome now they have 1200 HP and now they are on the second floor which is already full of monsters I've put there in previous turns so any extra monster cards are deadweight in your hand, but don't worry you get 1 turn to play these junk spell cards that you didn't have time to get rid of or enough money to upgrade and make \"useful\" (but seriously what is 12 damage gonna do vs 2 damage when, again, there is 1300 HP to get rid of)\n\nI'm going to try this game again sometime after I forget how bad it was. I know I only played one run, but honestly I don't care what else this game has to offer. Apparantly the devs have changed cards multiple time because they know how worthless they were and yet they still keep these worthless starter cards that aren't even useful after the first 2 battles! Slay the Spire was different. I wanted to get farther in the game. I wanted to unlock more stuff. I wanted to try different strategies because they all had depth in that game. Challenging but still fair. Hell, even the starter cards had use in the late game, they were never truly worthless. My suggestion is just don't waste your time with this shallow mobile game garbage.\n\nOh, and I thought this would be good for steam deck but the battery life is TERRIBLE. I get 7+ hours playing Slay the Spire 90fps and after 2 hours of this garbage game I'm down by 60% battery life! But hey, what do you need optimizations for when mobile devices rival desktop machines from just a few years ago? Just power thru all that terrible code like you have to power thru this terrible game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolute satanic marxist filth. They say it has a twist but it's actually twisted. The game story reverses the roles of Heaven and Hell. The demons are presented as being oppressed by the angels, and the player plays as a demon fighting the angels. You don't need this filth in your life.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its all right. I don't think I would recommend to people tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rank 9 is unbalanced af. needs to be steam deck optimized.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's OK. Pretty braindead, to be honest. I mostly played it while I was too hungover to think.\n\nMusic was fine, one or two songs were memorable, the rest are what is best described as \"serviceable.\" I also thought the aesthetics of the game were really dumb, which didn't help my impression of it.\n\nThe gameplay can give you this sense that you're doing something at first, but after a while you realize that your creatures and spells rarely synergize in any interesting way. Too much focus was put on the board, maybe. What's left is a game that feels half-deckbuilder, half-tower defense, and isn't very good at either.\n\nIt's certainly an overrated game, and I'm not sure why. Whenever I see someone name drop it as \"one of the greatest deckbuilders ever\" it kind of makes me question the validity of everything they say after.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Clearly I am in the wrong given the overwhelmingly positive reviews, but I don't understand what makes it so good. The builds are not terribly fun and driving synergy between the different clans/cards is not intuitive and boils into frustration given some ill-balanced mechanics and overwhelming bad implementation of RNG. \n\nEven for the $2.50 sales price, I feel like I overpaid and am just rewarded with frustration.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Solid for about 20 hrs. But the scaling is pretty terrible compared to other roguelike deck builders.\n\nCompared to other better roguelike deckbuilders this is by far inferior to some of the top names in this category like Slay the Spire or Across the Obelisk. Simply put the enemies will get stronger as you play more and unlock higher challenges. But the game fails to give you LITERALLY any actual upgrades. Now most roguelikes don't give you direct upgrades, but the best of them give you ways to reduce variance with your starting hands and loadouts. Without those in place you really wind up rerolling starting setups until you get a set that has the specific things you want for a good run.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The idea is interesting and learning the game is fun, but the deckbuilding options feel VERY limited. You just pick a strategy at the start (normally based around your champion choice) and then you exclusively pick cards to support that strategy. The choices are pretty limited and you can skip when you don't like the card selection. It doesn't require enough variance or improvisation to make it much more interesting. The secondary clan option is a cool idea on paper but most combinations just don't work together meaningfully enough to be preferable to sticking strictly to your main clan. If you're looking for a deckbuilder with this mix and match concept done well, just get the Packmaster mod for Slay the Spire - lots more fun to be had there.\n\nIf you want to try the game, I recommend getting it only on HEAVY discount like I did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is less strategy, more grind..\nits okay game if cheap, not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Monster Train is close to being good. \n\nThe gameplay loop is simple, you have a starter deck with spells and monster cards that you can incrementally improve between rounds of combat. There are also items you can collect that affect either the board state or your cards. The game plays like a mix of slay the spire and Hearthstone Battlegrounds.\n\nThe sad thing is that whilst the game likely has as much content as either of the aforementioned due to the way the macro game has been set up it always feels like your run is just getting started before it ends. The deck building aspect of the game is just too short to enjoy fully. For the rest, it plays like a typical rogue-like with a progression system (you unlock cards/card sets/difficulty levels), just without the enemy variety.  And that is not me being hyperbolic, you will see all the enemies within one run. \n\nWouldn't recommend, especially not at full price. Good time waster, music isn't bad, looks like a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Picked up Monster Train on sale thinking I scored a gem. Visually slick, fast-paced, and packed with roguelike deckbuilding chaos—but it burns out quick. Repetitive runs, bloated mechanics, and balance issues make it more grind than thrill. If you're curious, grab it cheap… just don’t expect lasting magic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I guess I'm confused? The game-play is great. Seems like there are alot of cards and factions to try out - On one level. I literally almost cleared the campaign first try, and did so on my second. \n\nI've ran out of things to do, and I haven't even unlocked half the factions. What? We are meant to grind the same 8 stages until we unlock everything? Why?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A worse version of slay the spire. This game will appeal to those who enjoy instant gratification, the ability to achieve victory at ease is baked into the game but the pay off is always weaker. \n\nNot my cup of tea, there are many better deck builders out there and this one doesn't do anything new or better than Slay the Spire. \n\nDon't understand the hype for this one, oh wait I do - it's the ease of hitting the deck you want and the mild difficulty. So that might entice you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"all of your spells get *consume*\" oh wow. great balancing. right. the boss gets to take away all of your spells. no spell deck is viable. u can only rely on creature cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Less than the sum of its parts. And frankly speaking, the parts are not great to begin with. \r\n\r\nYou should consider directing your Slay the Spire withdrawals elsewhere, else yet a new regret might join your impulse purchases on your Steam library.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game because it was on sale, and I thought it looked cool. Come to find out, every time I boot up the game I just get stuck in a loading screen that's not a loading screen, and can't play the game. Buyers beware, this game is apparently buggy af.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is no way to make any of your cards stronger to start with and just the 1st fight the enemies are strong enough to wipe out your whole team. It's just one big RNG fest to get a good run and waste of time!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "These have to be bot/paid reviews. This is such a shallow game that masquerades as having depth. Anyone comparing this to Slay the Spire is like comparing Halo to Skyrim, oh but aren't they both first person fantasy games where you kill enemies? This game is NOTHING like Slay the Spire except you have cards and you start with 3 mana/energy each turn. That's it.\n\nDamage is the ONLY thing that matters in this game. Sure, the different mechanics can have great use against all the normal enemies, but when it comes to bosses pure damage is the only way to win. And you know what works just as good as all that strategy you used against regular enemies? PURE DAMAGE!\n\nLook, I wanted to like this game as I feel MTG has lost its mind in recent set designs and you have to be rich just to have a *decent* deck. I saw reviews about how awesome this game is and thought hey I could sink my teeth into some nice deck building content right now. But there is no strategy that is going to prepare you for a boss fight that has 1300 HP when most enemies have around 5 to 50 HP and oh you can't play any spells once the boss round starts, so no strategy there, you just have to hope your monsters can somehow deal 20 to 30 times the amount of damage they did when you were taking care of the normal enemies. Oh, and all enemies move first so your monsters will be nice and weakened before the boss starts fighting. I had hope for this game when I had bosses around 300 HP, seemed fair with multiple strategies to make use of, but when you need 4 times the time/damage to kill the boss and your cards aren't 4 times stronger AND you can't even play any healing or damage spells once they start fighting the boss it really just makes all your other cards worthless! Oh, thank you SO much for these 1 mana 2 damage cards! And don't forget about these amazing healing cards to heal ANY single monster for a whole 3 HP all for only 1 mana! They will help SO FUCKING MUCH AGAINST 1300 HP bosses!  Oh and you start with 5 copies each of these worthless cards! Two entire hands that just won't do anything meaningful. Sure, you can upgrade your cards but what is 25HP on my monster going to do against a boss that hits for 18 damage? Oh sure 1 maybe two extra rounds to deal my 30 - 50 damage against a 1300 HP boss, awesome now they have 1200 HP and now they are on the second floor which is already full of monsters I've put there in previous turns so any extra monster cards are deadweight in your hand, but don't worry you get 1 turn to play these junk spell cards that you didn't have time to get rid of or enough money to upgrade and make \"useful\" (but seriously what is 12 damage gonna do vs 2 damage when, again, there is 1300 HP to get rid of)\n\nI'm going to try this game again sometime after I forget how bad it was. I know I only played one run, but honestly I don't care what else this game has to offer. Apparantly the devs have changed cards multiple time because they know how worthless they were and yet they still keep these worthless starter cards that aren't even useful after the first 2 battles! Slay the Spire was different. I wanted to get farther in the game. I wanted to unlock more stuff. I wanted to try different strategies because they all had depth in that game. Challenging but still fair. Hell, even the starter cards had use in the late game, they were never truly worthless. My suggestion is just don't waste your time with this shallow mobile game garbage.\n\nOh, and I thought this would be good for steam deck but the battery life is TERRIBLE. I get 7+ hours playing Slay the Spire 90fps and after 2 hours of this garbage game I'm down by 60% battery life! But hey, what do you need optimizations for when mobile devices rival desktop machines from just a few years ago? Just power thru all that terrible code like you have to power thru this terrible game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolute satanic marxist filth. They say it has a twist but it's actually twisted. The game story reverses the roles of Heaven and Hell. The demons are presented as being oppressed by the angels, and the player plays as a demon fighting the angels. You don't need this filth in your life.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its all right. I don't think I would recommend to people tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rank 9 is unbalanced af. needs to be steam deck optimized.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's OK. Pretty braindead, to be honest. I mostly played it while I was too hungover to think.\n\nMusic was fine, one or two songs were memorable, the rest are what is best described as \"serviceable.\" I also thought the aesthetics of the game were really dumb, which didn't help my impression of it.\n\nThe gameplay can give you this sense that you're doing something at first, but after a while you realize that your creatures and spells rarely synergize in any interesting way. Too much focus was put on the board, maybe. What's left is a game that feels half-deckbuilder, half-tower defense, and isn't very good at either.\n\nIt's certainly an overrated game, and I'm not sure why. Whenever I see someone name drop it as \"one of the greatest deckbuilders ever\" it kind of makes me question the validity of everything they say after.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Clearly I am in the wrong given the overwhelmingly positive reviews, but I don't understand what makes it so good. The builds are not terribly fun and driving synergy between the different clans/cards is not intuitive and boils into frustration given some ill-balanced mechanics and overwhelming bad implementation of RNG. \n\nEven for the $2.50 sales price, I feel like I overpaid and am just rewarded with frustration.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Solid for about 20 hrs. But the scaling is pretty terrible compared to other roguelike deck builders.\n\nCompared to other better roguelike deckbuilders this is by far inferior to some of the top names in this category like Slay the Spire or Across the Obelisk. Simply put the enemies will get stronger as you play more and unlock higher challenges. But the game fails to give you LITERALLY any actual upgrades. Now most roguelikes don't give you direct upgrades, but the best of them give you ways to reduce variance with your starting hands and loadouts. Without those in place you really wind up rerolling starting setups until you get a set that has the specific things you want for a good run.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The idea is interesting and learning the game is fun, but the deckbuilding options feel VERY limited. You just pick a strategy at the start (normally based around your champion choice) and then you exclusively pick cards to support that strategy. The choices are pretty limited and you can skip when you don't like the card selection. It doesn't require enough variance or improvisation to make it much more interesting. The secondary clan option is a cool idea on paper but most combinations just don't work together meaningfully enough to be preferable to sticking strictly to your main clan. If you're looking for a deckbuilder with this mix and match concept done well, just get the Packmaster mod for Slay the Spire - lots more fun to be had there.\n\nIf you want to try the game, I recommend getting it only on HEAVY discount like I did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is less strategy, more grind..\nits okay game if cheap, not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Monster Train is close to being good. \n\nThe gameplay loop is simple, you have a starter deck with spells and monster cards that you can incrementally improve between rounds of combat. There are also items you can collect that affect either the board state or your cards. The game plays like a mix of slay the spire and Hearthstone Battlegrounds.\n\nThe sad thing is that whilst the game likely has as much content as either of the aforementioned due to the way the macro game has been set up it always feels like your run is just getting started before it ends. The deck building aspect of the game is just too short to enjoy fully. For the rest, it plays like a typical rogue-like with a progression system (you unlock cards/card sets/difficulty levels), just without the enemy variety.  And that is not me being hyperbolic, you will see all the enemies within one run. \n\nWouldn't recommend, especially not at full price. Good time waster, music isn't bad, looks like a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Picked up Monster Train on sale thinking I scored a gem. Visually slick, fast-paced, and packed with roguelike deckbuilding chaos—but it burns out quick. Repetitive runs, bloated mechanics, and balance issues make it more grind than thrill. If you're curious, grab it cheap… just don’t expect lasting magic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I guess I'm confused? The game-play is great. Seems like there are alot of cards and factions to try out - On one level. I literally almost cleared the campaign first try, and did so on my second. \n\nI've ran out of things to do, and I haven't even unlocked half the factions. What? We are meant to grind the same 8 stages until we unlock everything? Why?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A worse version of slay the spire. This game will appeal to those who enjoy instant gratification, the ability to achieve victory at ease is baked into the game but the pay off is always weaker. \n\nNot my cup of tea, there are many better deck builders out there and this one doesn't do anything new or better than Slay the Spire. \n\nDon't understand the hype for this one, oh wait I do - it's the ease of hitting the deck you want and the mild difficulty. So that might entice you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"all of your spells get *consume*\" oh wow. great balancing. right. the boss gets to take away all of your spells. no spell deck is viable. u can only rely on creature cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Less than the sum of its parts. And frankly speaking, the parts are not great to begin with. \r\n\r\nYou should consider directing your Slay the Spire withdrawals elsewhere, else yet a new regret might join your impulse purchases on your Steam library.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game because it was on sale, and I thought it looked cool. Come to find out, every time I boot up the game I just get stuck in a loading screen that's not a loading screen, and can't play the game. Buyers beware, this game is apparently buggy af.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is no way to make any of your cards stronger to start with and just the 1st fight the enemies are strong enough to wipe out your whole team. It's just one big RNG fest to get a good run and waste of time!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "These have to be bot/paid reviews. This is such a shallow game that masquerades as having depth. Anyone comparing this to Slay the Spire is like comparing Halo to Skyrim, oh but aren't they both first person fantasy games where you kill enemies? This game is NOTHING like Slay the Spire except you have cards and you start with 3 mana/energy each turn. That's it.\n\nDamage is the ONLY thing that matters in this game. Sure, the different mechanics can have great use against all the normal enemies, but when it comes to bosses pure damage is the only way to win. And you know what works just as good as all that strategy you used against regular enemies? PURE DAMAGE!\n\nLook, I wanted to like this game as I feel MTG has lost its mind in recent set designs and you have to be rich just to have a *decent* deck. I saw reviews about how awesome this game is and thought hey I could sink my teeth into some nice deck building content right now. But there is no strategy that is going to prepare you for a boss fight that has 1300 HP when most enemies have around 5 to 50 HP and oh you can't play any spells once the boss round starts, so no strategy there, you just have to hope your monsters can somehow deal 20 to 30 times the amount of damage they did when you were taking care of the normal enemies. Oh, and all enemies move first so your monsters will be nice and weakened before the boss starts fighting. I had hope for this game when I had bosses around 300 HP, seemed fair with multiple strategies to make use of, but when you need 4 times the time/damage to kill the boss and your cards aren't 4 times stronger AND you can't even play any healing or damage spells once they start fighting the boss it really just makes all your other cards worthless! Oh, thank you SO much for these 1 mana 2 damage cards! And don't forget about these amazing healing cards to heal ANY single monster for a whole 3 HP all for only 1 mana! They will help SO FUCKING MUCH AGAINST 1300 HP bosses!  Oh and you start with 5 copies each of these worthless cards! Two entire hands that just won't do anything meaningful. Sure, you can upgrade your cards but what is 25HP on my monster going to do against a boss that hits for 18 damage? Oh sure 1 maybe two extra rounds to deal my 30 - 50 damage against a 1300 HP boss, awesome now they have 1200 HP and now they are on the second floor which is already full of monsters I've put there in previous turns so any extra monster cards are deadweight in your hand, but don't worry you get 1 turn to play these junk spell cards that you didn't have time to get rid of or enough money to upgrade and make \"useful\" (but seriously what is 12 damage gonna do vs 2 damage when, again, there is 1300 HP to get rid of)\n\nI'm going to try this game again sometime after I forget how bad it was. I know I only played one run, but honestly I don't care what else this game has to offer. Apparantly the devs have changed cards multiple time because they know how worthless they were and yet they still keep these worthless starter cards that aren't even useful after the first 2 battles! Slay the Spire was different. I wanted to get farther in the game. I wanted to unlock more stuff. I wanted to try different strategies because they all had depth in that game. Challenging but still fair. Hell, even the starter cards had use in the late game, they were never truly worthless. My suggestion is just don't waste your time with this shallow mobile game garbage.\n\nOh, and I thought this would be good for steam deck but the battery life is TERRIBLE. I get 7+ hours playing Slay the Spire 90fps and after 2 hours of this garbage game I'm down by 60% battery life! But hey, what do you need optimizations for when mobile devices rival desktop machines from just a few years ago? Just power thru all that terrible code like you have to power thru this terrible game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolute satanic marxist filth. They say it has a twist but it's actually twisted. The game story reverses the roles of Heaven and Hell. The demons are presented as being oppressed by the angels, and the player plays as a demon fighting the angels. You don't need this filth in your life.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its all right. I don't think I would recommend to people tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rank 9 is unbalanced af. needs to be steam deck optimized.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's OK. Pretty braindead, to be honest. I mostly played it while I was too hungover to think.\n\nMusic was fine, one or two songs were memorable, the rest are what is best described as \"serviceable.\" I also thought the aesthetics of the game were really dumb, which didn't help my impression of it.\n\nThe gameplay can give you this sense that you're doing something at first, but after a while you realize that your creatures and spells rarely synergize in any interesting way. Too much focus was put on the board, maybe. What's left is a game that feels half-deckbuilder, half-tower defense, and isn't very good at either.\n\nIt's certainly an overrated game, and I'm not sure why. Whenever I see someone name drop it as \"one of the greatest deckbuilders ever\" it kind of makes me question the validity of everything they say after.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Clearly I am in the wrong given the overwhelmingly positive reviews, but I don't understand what makes it so good. The builds are not terribly fun and driving synergy between the different clans/cards is not intuitive and boils into frustration given some ill-balanced mechanics and overwhelming bad implementation of RNG. \n\nEven for the $2.50 sales price, I feel like I overpaid and am just rewarded with frustration.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Solid for about 20 hrs. But the scaling is pretty terrible compared to other roguelike deck builders.\n\nCompared to other better roguelike deckbuilders this is by far inferior to some of the top names in this category like Slay the Spire or Across the Obelisk. Simply put the enemies will get stronger as you play more and unlock higher challenges. But the game fails to give you LITERALLY any actual upgrades. Now most roguelikes don't give you direct upgrades, but the best of them give you ways to reduce variance with your starting hands and loadouts. Without those in place you really wind up rerolling starting setups until you get a set that has the specific things you want for a good run.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The idea is interesting and learning the game is fun, but the deckbuilding options feel VERY limited. You just pick a strategy at the start (normally based around your champion choice) and then you exclusively pick cards to support that strategy. The choices are pretty limited and you can skip when you don't like the card selection. It doesn't require enough variance or improvisation to make it much more interesting. The secondary clan option is a cool idea on paper but most combinations just don't work together meaningfully enough to be preferable to sticking strictly to your main clan. If you're looking for a deckbuilder with this mix and match concept done well, just get the Packmaster mod for Slay the Spire - lots more fun to be had there.\n\nIf you want to try the game, I recommend getting it only on HEAVY discount like I did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is less strategy, more grind..\nits okay game if cheap, not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Monster Train is close to being good. \n\nThe gameplay loop is simple, you have a starter deck with spells and monster cards that you can incrementally improve between rounds of combat. There are also items you can collect that affect either the board state or your cards. The game plays like a mix of slay the spire and Hearthstone Battlegrounds.\n\nThe sad thing is that whilst the game likely has as much content as either of the aforementioned due to the way the macro game has been set up it always feels like your run is just getting started before it ends. The deck building aspect of the game is just too short to enjoy fully. For the rest, it plays like a typical rogue-like with a progression system (you unlock cards/card sets/difficulty levels), just without the enemy variety.  And that is not me being hyperbolic, you will see all the enemies within one run. \n\nWouldn't recommend, especially not at full price. Good time waster, music isn't bad, looks like a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Picked up Monster Train on sale thinking I scored a gem. Visually slick, fast-paced, and packed with roguelike deckbuilding chaos—but it burns out quick. Repetitive runs, bloated mechanics, and balance issues make it more grind than thrill. If you're curious, grab it cheap… just don’t expect lasting magic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I guess I'm confused? The game-play is great. Seems like there are alot of cards and factions to try out - On one level. I literally almost cleared the campaign first try, and did so on my second. \n\nI've ran out of things to do, and I haven't even unlocked half the factions. What? We are meant to grind the same 8 stages until we unlock everything? Why?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A worse version of slay the spire. This game will appeal to those who enjoy instant gratification, the ability to achieve victory at ease is baked into the game but the pay off is always weaker. \n\nNot my cup of tea, there are many better deck builders out there and this one doesn't do anything new or better than Slay the Spire. \n\nDon't understand the hype for this one, oh wait I do - it's the ease of hitting the deck you want and the mild difficulty. So that might entice you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"all of your spells get *consume*\" oh wow. great balancing. right. the boss gets to take away all of your spells. no spell deck is viable. u can only rely on creature cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Less than the sum of its parts. And frankly speaking, the parts are not great to begin with. \r\n\r\nYou should consider directing your Slay the Spire withdrawals elsewhere, else yet a new regret might join your impulse purchases on your Steam library.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game because it was on sale, and I thought it looked cool. Come to find out, every time I boot up the game I just get stuck in a loading screen that's not a loading screen, and can't play the game. Buyers beware, this game is apparently buggy af.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is no way to make any of your cards stronger to start with and just the 1st fight the enemies are strong enough to wipe out your whole team. It's just one big RNG fest to get a good run and waste of time!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "These have to be bot/paid reviews. This is such a shallow game that masquerades as having depth. Anyone comparing this to Slay the Spire is like comparing Halo to Skyrim, oh but aren't they both first person fantasy games where you kill enemies? This game is NOTHING like Slay the Spire except you have cards and you start with 3 mana/energy each turn. That's it.\n\nDamage is the ONLY thing that matters in this game. Sure, the different mechanics can have great use against all the normal enemies, but when it comes to bosses pure damage is the only way to win. And you know what works just as good as all that strategy you used against regular enemies? PURE DAMAGE!\n\nLook, I wanted to like this game as I feel MTG has lost its mind in recent set designs and you have to be rich just to have a *decent* deck. I saw reviews about how awesome this game is and thought hey I could sink my teeth into some nice deck building content right now. But there is no strategy that is going to prepare you for a boss fight that has 1300 HP when most enemies have around 5 to 50 HP and oh you can't play any spells once the boss round starts, so no strategy there, you just have to hope your monsters can somehow deal 20 to 30 times the amount of damage they did when you were taking care of the normal enemies. Oh, and all enemies move first so your monsters will be nice and weakened before the boss starts fighting. I had hope for this game when I had bosses around 300 HP, seemed fair with multiple strategies to make use of, but when you need 4 times the time/damage to kill the boss and your cards aren't 4 times stronger AND you can't even play any healing or damage spells once they start fighting the boss it really just makes all your other cards worthless! Oh, thank you SO much for these 1 mana 2 damage cards! And don't forget about these amazing healing cards to heal ANY single monster for a whole 3 HP all for only 1 mana! They will help SO FUCKING MUCH AGAINST 1300 HP bosses!  Oh and you start with 5 copies each of these worthless cards! Two entire hands that just won't do anything meaningful. Sure, you can upgrade your cards but what is 25HP on my monster going to do against a boss that hits for 18 damage? Oh sure 1 maybe two extra rounds to deal my 30 - 50 damage against a 1300 HP boss, awesome now they have 1200 HP and now they are on the second floor which is already full of monsters I've put there in previous turns so any extra monster cards are deadweight in your hand, but don't worry you get 1 turn to play these junk spell cards that you didn't have time to get rid of or enough money to upgrade and make \"useful\" (but seriously what is 12 damage gonna do vs 2 damage when, again, there is 1300 HP to get rid of)\n\nI'm going to try this game again sometime after I forget how bad it was. I know I only played one run, but honestly I don't care what else this game has to offer. Apparantly the devs have changed cards multiple time because they know how worthless they were and yet they still keep these worthless starter cards that aren't even useful after the first 2 battles! Slay the Spire was different. I wanted to get farther in the game. I wanted to unlock more stuff. I wanted to try different strategies because they all had depth in that game. Challenging but still fair. Hell, even the starter cards had use in the late game, they were never truly worthless. My suggestion is just don't waste your time with this shallow mobile game garbage.\n\nOh, and I thought this would be good for steam deck but the battery life is TERRIBLE. I get 7+ hours playing Slay the Spire 90fps and after 2 hours of this garbage game I'm down by 60% battery life! But hey, what do you need optimizations for when mobile devices rival desktop machines from just a few years ago? Just power thru all that terrible code like you have to power thru this terrible game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolute satanic marxist filth. They say it has a twist but it's actually twisted. The game story reverses the roles of Heaven and Hell. The demons are presented as being oppressed by the angels, and the player plays as a demon fighting the angels. You don't need this filth in your life.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its all right. I don't think I would recommend to people tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rank 9 is unbalanced af. needs to be steam deck optimized.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's OK. Pretty braindead, to be honest. I mostly played it while I was too hungover to think.\n\nMusic was fine, one or two songs were memorable, the rest are what is best described as \"serviceable.\" I also thought the aesthetics of the game were really dumb, which didn't help my impression of it.\n\nThe gameplay can give you this sense that you're doing something at first, but after a while you realize that your creatures and spells rarely synergize in any interesting way. Too much focus was put on the board, maybe. What's left is a game that feels half-deckbuilder, half-tower defense, and isn't very good at either.\n\nIt's certainly an overrated game, and I'm not sure why. Whenever I see someone name drop it as \"one of the greatest deckbuilders ever\" it kind of makes me question the validity of everything they say after.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Clearly I am in the wrong given the overwhelmingly positive reviews, but I don't understand what makes it so good. The builds are not terribly fun and driving synergy between the different clans/cards is not intuitive and boils into frustration given some ill-balanced mechanics and overwhelming bad implementation of RNG. \n\nEven for the $2.50 sales price, I feel like I overpaid and am just rewarded with frustration.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Solid for about 20 hrs. But the scaling is pretty terrible compared to other roguelike deck builders.\n\nCompared to other better roguelike deckbuilders this is by far inferior to some of the top names in this category like Slay the Spire or Across the Obelisk. Simply put the enemies will get stronger as you play more and unlock higher challenges. But the game fails to give you LITERALLY any actual upgrades. Now most roguelikes don't give you direct upgrades, but the best of them give you ways to reduce variance with your starting hands and loadouts. Without those in place you really wind up rerolling starting setups until you get a set that has the specific things you want for a good run.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The idea is interesting and learning the game is fun, but the deckbuilding options feel VERY limited. You just pick a strategy at the start (normally based around your champion choice) and then you exclusively pick cards to support that strategy. The choices are pretty limited and you can skip when you don't like the card selection. It doesn't require enough variance or improvisation to make it much more interesting. The secondary clan option is a cool idea on paper but most combinations just don't work together meaningfully enough to be preferable to sticking strictly to your main clan. If you're looking for a deckbuilder with this mix and match concept done well, just get the Packmaster mod for Slay the Spire - lots more fun to be had there.\n\nIf you want to try the game, I recommend getting it only on HEAVY discount like I did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is less strategy, more grind..\nits okay game if cheap, not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Monster Train is close to being good. \n\nThe gameplay loop is simple, you have a starter deck with spells and monster cards that you can incrementally improve between rounds of combat. There are also items you can collect that affect either the board state or your cards. The game plays like a mix of slay the spire and Hearthstone Battlegrounds.\n\nThe sad thing is that whilst the game likely has as much content as either of the aforementioned due to the way the macro game has been set up it always feels like your run is just getting started before it ends. The deck building aspect of the game is just too short to enjoy fully. For the rest, it plays like a typical rogue-like with a progression system (you unlock cards/card sets/difficulty levels), just without the enemy variety.  And that is not me being hyperbolic, you will see all the enemies within one run. \n\nWouldn't recommend, especially not at full price. Good time waster, music isn't bad, looks like a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Picked up Monster Train on sale thinking I scored a gem. Visually slick, fast-paced, and packed with roguelike deckbuilding chaos—but it burns out quick. Repetitive runs, bloated mechanics, and balance issues make it more grind than thrill. If you're curious, grab it cheap… just don’t expect lasting magic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I guess I'm confused? The game-play is great. Seems like there are alot of cards and factions to try out - On one level. I literally almost cleared the campaign first try, and did so on my second. \n\nI've ran out of things to do, and I haven't even unlocked half the factions. What? We are meant to grind the same 8 stages until we unlock everything? Why?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A worse version of slay the spire. This game will appeal to those who enjoy instant gratification, the ability to achieve victory at ease is baked into the game but the pay off is always weaker. \n\nNot my cup of tea, there are many better deck builders out there and this one doesn't do anything new or better than Slay the Spire. \n\nDon't understand the hype for this one, oh wait I do - it's the ease of hitting the deck you want and the mild difficulty. So that might entice you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"all of your spells get *consume*\" oh wow. great balancing. right. the boss gets to take away all of your spells. no spell deck is viable. u can only rely on creature cards.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}