{
  "positive": [
    {
      "review": "[h2] [b] Embrace the cringey dialogue dumps and you'll have a great time with Persona 4, as it has its charm and is, all in all, a fun and relaxing game to experience with a controller. [/b] [/h2]\r\n\r\n[b] I assume most of the players would like to get the golden true ending with their first playthrough, which is not too complicated to achieve but can be easy to miss out on. You don't have to do everything perfectly, but do make sure you befriend the character named [spoiler] Marie and complete all her social links since she becomes an important character later on. [/spoiler] Also, have multiple save files in case you do something you shouldn't have once you reach December/Wintertime. From there, when you're close to the end of the game, and you'll know when you are, look up which choices you should pick in the final dialogues and you should be GOLDEN.\r\n\r\nI hid the name with a spoiler tag, supposing you don’t want to know even that, but it’s not actually a spoiler.\r\nMerely trying to be helpful. [/b]\r\n\r\n[h3] Story, Characters & Writing: [/h3]\r\n\r\nIt's a Japanese school life story with extra mystery added to keep your mind intrigued, and it does a pretty good job at that. Yes, it's not all that serious, but it has some mature moments here and there from time to time.\r\nI have no complaints whatsoever; it's enjoyable for me.\r\nEvery character is likable, romance is not forced upon you, but you have many choices for that as well, and it's genuinely sweet.\r\n\r\nThe game has lots of comedic value.\r\nEven the side characters have their little stories, and some of them you can romance too. I wouldn’t romance them myself because I prefer the main cast to have more plot and time spent with them.\r\n\r\nYou have the opportunity to replay the game in different ways since there are distinct paths the narrative can take depending on your decisions.\r\nBe open-minded to the fact that not everything needs to be written in a specific way. Variety of experiences can be worthwhile, and because it’s dissimilar to other forms of writing, it can be remarkable in its own way.\r\n\r\n[h3] Gameplay: [/h3]\r\n\r\nIt's a JRPG with daily tasks that you perform to build relationship points or develop personal skills such as knowledge, expression, and diligence, which in turn benefit those relationships by unlocking certain dialogue options. You go to school, study, work, and complete side quests within the world you inhabit day to day.\r\n\r\nThe social links you develop are a crucial upgrade, as your performance in combat heavily depends on these relationships. They determine how well you do and how effectively you can get better Personas through fusions.\r\n\r\nObviously, there are optimal ways to play the game with specific builds, but there is also a lot of variety, including many elements or physical damage, passives, single-target skills, and AoE damage options. With different party members to choose from, experiment freely and enjoy yourself.\r\n\r\nThe side quests in the world are, in all honesty, not my favorite because most of them are fetch quests, but they do add something to occupy your in-game days and help you feel more connected to the city.\r\n\r\nThe game can be a little grindy if you fight everything to maximize money, EXP, and resources. That is the only aspect that might reasonably feel tedious.\r\n\r\nAdditionally, the soundtrack is cheerful and pleasant, completing the environment.\r\n\r\nIf this style is your thing and you can accept it for what it is, I believe it can be a memorable and entertaining teenage adventure.\r\nIf just seeing a character’s picture, hearing a song from the game, or listening to a voice actor can awaken a flood of memories, the game succeeds brilliantly as an art form\r\nI believe Persona 4 Golden does that.\r\n\r\n9/10.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "After getting all achievements (thanks to a guide) I can finally say that P4G is my favourite Persona game and, probably, the best one despite P5R having the best gameplay mechanics and QOL quirks.\r\n\r\nPersona 4 has the best characters, the best script, a very good OST, good dub both in japanese and english (P4G is very good, unlike P4). Not only the characters were written as credible teenagers but they're also very believable and likable. Every social link story, every sidequest, every piece of humor... is incredibly fun and relatable. By far, the most interesting, fun and well written cast of Persona protagonists. By far.\r\n\r\nThe negative sides are, of course P4G being an outdated port, having outdated dungeon mechanics and feeling like an \"old game\" whereas many other JRPG have more dynamic and fun gameplay loops and mechanics... The sidequests and NPCs fetch quests are very obscure, the dungeon grind and leveling is not \"friendly\" and too many things are \"hidden\" or definitively not on plain sight for the player to do or enjoy... something that never happens on most modern Atlus games, for instance.\r\n\r\nThe 100% is very hard, you definitively need a guide. There are so many things that aren't explained, hidden between odd dialogue choices, the activities (for instance, reading all the books)... the whole \"Golden Ending\" being hidden behind the most antinatural and vague dialogue choice option is still baffling. Satisfying once you advance NG+ but... damn, so hard to complete everything.\r\n\r\nTotally recommended game, very fun and full of charm and appeal.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "My 1st Persona game and my 1st JRPG turn base(that I beat). What a great experience that genuinely made me feel like i had a group of friends and family. Finishing this game is like a saying goodbye to all of them who care about us. Damn i wish i Narukami Yuu instead life give me ******, just like this game say \"its never late to pursue the truth\".\n\nFor the gameplay is like your everyday turn-base with rock-paper-scissors system like with a lot variety persona you can change for your advantage but man the soundtrack is absolute banger they really know how to cook.\n\nThank you Atlus for making this game and i hope Revival don't mess up",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This is a jrpg creature collector about a serial killer in a small Japanese town. You play as a member of a group of high school friends who have figured out that the killer broadcasts their victims on tv the night before they are murdered. The game play loop is basically spending your day at school or out with friends doing different activities building relationships. It's really a worker placement type mechanic. There are a bunch of things to do in a day with various effects, but you can only choose a couple each day. That's when most of the story is told, in a visual novel style with occasional animated cutscenes. The relationships build power and abilities for you and your party before going into the dungeons, which is the second part of the loop, going into the tv world areas to try and save the next victim before they die. There you collect your creatures called personas that you use to fight the monsters called shadows. \r\n\r\nI enjoyed the main story and all the little stories that you learn building the relationships, there is a lot of humour and silly antics between the kids. The combat is fun, pretty simple. You can go down a rabbit hole trying to collect and combine your personas into more powerful ones. The dungeons can be a bit grindy. Some take several hours to complete, and sometimes you have to do them more than once to get strong enough for the next encounters. I liked the game and would play others in the series. I'd recommend playing with Japanese voice acting.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "my second persona. story so peak i don't want it to end. every character is memorable and them dealing with their other selves adds more to their peakness\n\ncombat is much easier in this game compared to persona 3. even if you put the difficulty in higher you can defeat margaret with little stress. listening to 250 risette lines is much harder than the whole combat of this game\n\ngood game, good music. rating = 4/5 (teddie best character)",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "First of all - welcome to the town of Inaba, my second home away from home! To someone living in a small-to-midsized town it feels very familiar, and even the title of the first track you'll hear (after the opening that is) - Corner of Memories - sums up perfectly just how special this rural Japanese town will become to anyone who gets past the rather dragged out introductory sequence and spends the next 70+ hours with it.\n\nIf Persona 3 was a neatly crafted monument to living life to it's full extent, then Persona 4, notably lacking existential dread for the most part, somehow amps that up to the power of ten and beyond. Though the gameplay may be a bit lacking in some departments, compared to Persona 5 and everything that came after it, the game makes up for it sevenfold in every other area and having fleshed out the Social Link mechanic introduced in 3, certainly does it's best to make you want to spend as much time as possible with those few that will no doubt become your virtual best friends by the time the game is over. You've got everything - from your overworked detective uncle, a tomboy who knows jack shit about martial arts but still uses them anyway, a punk that may or may not be a huge softie on the inside, an old lady in mourning, the sibling of a murder victim, a detective whose competences probably rival that of Dick Gumshoe from Ace Attorney, to - and hear me out here - absolute perfection in the shape of a human being, capable in many ways, keeping up a demeanor so serious that once she opens up, she can't help but make it obvious she is socially awkward as all hell, albeit in a really cute way, and the dynamic between her and the player character is arguably the most rewarding one in the whole second trilogy of Persona games.\n\nAnd don't even get me started on the soundtrack - every single tune in this game is a guaranteed earworm that will get stuck in your head all year long, from Signs of Love and Your Affection, through The Specialist, Heaven and Snowflakes, all the way to Long Way, Never More (a.k.a. - the one song that will ensure you left your heart in Inaba when you hear it) and even some returning Persona 3 tunes! It's something you have to hear for yourself to fully comprehend just how perfect it is.\n\nI am excited to see what the upcoming Revival remake does to modernize the game, but regardless of what it does, Inaba will always feel like that home away from home worth going back to. It is quite easily a once in a generation masterpiece that everyone should at least give a try.\n\n100/100.\nWould suffer the horrors of Chie and Yukiko's Mystery Food X just to get a chance to date Naoto again.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Absolute masterpiece, I love how this game won't let you get the true ending if you don't choose a specific answer to a specific NPC at a specific time of the day, other than that it peaks at murder mystery and unexpected plot twists, highly recommended for someone who enjoyed the fourth part of jjba",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Sorprendentemente es un juego en el cual el farmeo me divierte, los jefes aunque algunos jefes son una basura (Mitsuo) la gran mayoría suelen ser divertidos, los escenarios tienen buenas temáticas y los enemigos genéricos tienen diseños bastante buenos",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "No the game is great. I just don't know how important the Adachi and Dojima make-out scene in the beginning was to the plot for it to be 5 minutes long.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Yoshitsune literally CHEESES the game, I'm pretty sure thats the real god here",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Persona 4 Golden is an outstanding JRPG that blends small‑town mystery, heartfelt character arcs, and stylish turn‑based combat into a cohesive, addictive loop that’s as compelling today as it was at release.\r\nThe PC/modern port elevates the experience with unlocked frame rates, higher resolutions, and fully remappable controls, making this the definitive way to play without altering the game’s soul.\r\nWriting and social links shine with warmth and humor, supported by a killer soundtrack and dungeons that reward planning and exploiting weaknesses, keeping battles brisk and satisfying.\r\nEven with a few dated beats and some filler in Golden’s added events, the overall journey remains top‑tier—an easy recommendation for newcomers and veterans alike.\r\n\r\nVerdict: Strongly recommended. A genre staple that looks and plays better than ever on PC/modern platforms.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "insanely good. I cant understand how fun an entrance to the persona series this is. aside from early 2010's cringe dialogue here and there, it's perfect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Persona 4 Golden was my first ever Persona game (that I beat), and I can confidently say it blew me away. I didn’t know what to expect going in, but it quickly became one of my top five PS2-era games of all time (I know its a PS Vita remaster). The mix of everyday school life, heartfelt friendships, and a gripping murder mystery kept me completely hooked from start to finish.\r\n\r\nThe cast is phenomenal — every member of the Investigation Team feels real and memorable. Yu Narukami easily became one of my favorite protagonists ever, standing proudly alongside legends like Solid Snake and Kazuma Kiryu. He might be the “silent” type, but his presence and charisma make him unforgettable.\r\n\r\nAnd I have to mention Naoto Shirogane — my favorite character to romance in any game, [i]period[/i]. Her story, personality, and character growth hit all the right notes. Every moment with her felt genuine and meaningful, and she quickly became the heart of my playthrough.\r\n\r\nThe music deserves its own praise — “Reach Out to the Truth,” “Heaven,” and so many others have been stuck in my head ever since. Combine that with the emotional storytelling, fun combat, and charming small-town atmosphere, and you’ve got something truly special.\r\n\r\n10/10 – Every day’s great at your Junes! ~~~",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall fun game but the bs it pulls locking the true ending behind 6 exact conversation options to pick by the end is infuriating, luckily google exists, as well as loading up a save.\nOverall enjoyable experience and had more fun than with the persona 3 remake.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game changed my life genuinely one of the most beautiful things ive ever had the pleasure of experiencing, i cant even put into words how incredibly amazing this game reflects oneselfs fear of truth and how being accompanied lifts those fears and allows you to accept yourself this is sobeautiful",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My favorite persona game, and very satisfying in all its aspects. Yes some social links are better than others, and the dungeon designs aren't super interesting, but for what it is I think it works amazingly well. I actually like the level design even if some people hate it; first of all it's way better than Tartarus in P3, just multiply all the gripes people have with this design by 100; second of all It's exactly the right length of what I would want it to be: not too grindy and not too short. The music is very good, it invaded all of my playlists in high school. The graphics are charming, and the voice acting is amazing. Chie is my favorite character followed by Yosuke. I also like the small-town vibe way more than the vibes of the other personas. 10/10 experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For all the people wondering if they should wait until persona 4 revival comes out, You shouldn’t wait two years to experience peak, it’s also dirt cheap rn for 10$. Characters are probably my favorite out of all the personas, it’s really hard to choose tbh. The dungeons are actually terrible not because it’s old or anything but because you could get one shotted by a random ass mob out of nowhere and lose ALL your progress, you can’t run but the shadows can and it’s almost impossible to not deal with shadows when you come across one. Music is amazing as expected better than p3r but I would still say p5r is better than both when it comes to music. Story is really good and the humor is also good to, I would find myself laughing with the crew most of the time especially when yosuke or kanji was making the jokes. The dynamic between yu and yosuke is easily my fav out of the persona games, the chemistry is unbeatable imo and yosuke’s just such a good bro in general. Teddie was so unbearable and every time he spoke I just wanted to rip my hair out (maybe because I played it in Japanese idk, I played every persona in Japanese) and his Pervy jokes can get REALLY annoying. Romance options are also really good to, you can honestly choose any girl and have a nice time. The emotional moments are also really good as well. \nYou may not like it more than the other personas but you sure as hell will enjoy it. Buy it it’s worth it. \n\nMy personal score 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, love the emotions, although the game can be grindy at times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game overall.\nGood music, good story, good characters.\n\nThe quicksave system is absolute garbage.\nLost hours of progression because it deletes itself after each load.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good for a game released 13 years ago but the writing still felt cheap and final boss is easily miss able unless you knew about it already. Marie feels extremely forced in to the game and doesn't seem important unless you already know what happens next. Dungeon crawling is awful and the reaper feels non existent unless you follow a guide to summon him. Overall shit ton of issues but still recommend and have high hopes for P4R in fixing all of the issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can never go wrong with Persona 4 Golden. It's truly a faithful remaster of the older game with a lot of quality of life improvements. The story is very rich and the characters are very engaging and the secret twist is very well done. It's a Persona game so I don't even need to mention how there is so much individuality in every aspect of the game and how much freedom you have to play the game your way. It's definitely a time sink game and I think it's well worth the investment especially if you're a Persona fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game that got me into the Persona franchise. It's one of the best JRPGs ever made. The combat is balanced, and even though the visual style is outdated by today's standards, it's atmosphere and characters add up to an amazing game. 10/10, would play it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyable JRPG with time management elements.\r\nWhile it is clearly a port of a PS2 game, the aesthetics still hold up decently, and the music is really good.\r\nThe core JRPG gameplay is good - there is an emphasis on buffs and debuffs, along with learning weaknesses for regular enemies, along with using status on them when you can. Physical tends to do better when it comes to Bosses though, since they tend to not have weaknesses to exploit, and Physical comes with a chance to critical.\r\nThe management is also enjoyable, with lots of Social Links and other side activities to hold your attention. The writing on them is generally good, though some are definitley more or less interesting from each other.\r\nOverall just a really fun time. I know a remake is coming out, but I think the updated original still holds up today pretty well, even compared to 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great characters great story great replayability great everything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great turn-based game, can get a bit long. Story is solid too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only 3 hours in and I am HOOKED! I can't wait to get the other Persona games. I was thinking this game would be all teeny bopper childlike but it's not =D Story has been fantastic so far =D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "currently on my second playthrough and i absolutly love this game\r\nplus its pretty cheap\r\nRise best girl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game overall, is fantastic. The story, the characters, the dialog, the setting, everything. My main (personal) issue is that the game expects you to grind for bosses, even playing in the normal difficulty. Several times I had troubles with a boss to then look up a guide on how to beat it to then find out that I was 5-8 levels lower to the recommended level. I did fought enemies if I stumble upon them, but the game never provides you a reason to grind besides gettin levels.\n\nI'm coming from playing Persona 5 Royal and I'm currently at the end game of Pesona 3 Portable, but  the grinding felt more natural due to the nature of the games. In Persona 4, grinding feels like you are playing a Pokemon game, with the exception being that you will have to pay stupid amounts of money to recover HP and SP.\n\nI would recommend playing this game on Easy if you don't want to grind. There is no shame. I would give this game light a high 7 low 8/10, just  because I liked everything about this game besides the tedious grind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top Tier Japanese game.  Great story, gameplay, depth, BGM, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Vegetables!\r\nI love all the goobers in this game , except for Teddie . I swear if Persona 6 has another thirsting animal mascot I am gonna kill them and then myself.\r\nGameplay kinda drags on , but its very relaxing similiary  to mementos in p5.\r\nScrew reviewing the game heres my top 7 goobers: 1.Nanako 2.Adachi 3.Chad Narukami 4.Naoto 5.Great Vegetables man 6.Chie 7.Josuke Higashikata from Jojos Bizzare Adventure Diamond is Unbreakable\r\nOST is raw af like always\r\nsolid 8.5/10  PS: They should have called the remake Replay fight me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The games dungeons are very janky but the story and characters are unmatched common persona W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The artwork is stunning and it's a fascinating change from p5. I really like how well written it is. solid game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best persona game imo best cast i enjoyed this game so much but you cannot pay me to do ng+ but overall enjoyed this more than royal and 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't believe that this game hv changed my life 😭.I really started to miss my school days with my amazing friends that I had (I mean in college u do make but nothing can beat the bonds of your school peeps)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Favorite game of all time.\r\nThe music is wonderful. The social link really feel like you're part of the members. Really recommend it. \r\nBeat this game multiple times and still play it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, it's even better to play if you're a teenager. It's part of the reason I met my girlfriend, so a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's literally nothing I can say about this game that hasn't been said already.\n\nIts genuinely peak. I bought this game as my first introduction into the Persona series this year not expecting much but damn, this is seriously one of the best games I've ever played of all time. \n\nThe characters, the music, the gameplay, the setting, the story; everything about this game is amazing. Easily recommend for any JRPG fan; I expected this series to be overrated..and I see now that this is not the case. Buy this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game improved my life and also make me quit gooning. It was the first game that make me feel like 17 again.\nIf you feel like your life is shit,think again. This game is peak IMO.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games I've ever played. A review simply cannot do it justice. Play this game or face the shame of missing out on one of the best interactive experiences in existence. Pro tip, Romance Chie. For a long time I thought JSRF had the best video game soundtrack ever and I still like it very much but man Persona 3 and 4 is like ALL STUPENDOUS bangers. Absolutely disgusting that the music team went soooooo hard on these OSTs. Some of the more polished and timeless music I've ever heard. Very sad to not get a continuation of the story although revival should be out soon but a fresh new adventure involving the same gang might be fun although maybe it wouldn't. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 An amazing persona experience. The friends you make, the lessons you learn and the memories that you form with this game are timeless and like none other. I'm about to play persona 5 and it won't be comparable to persona 4 golden no matter what. The graphics this game has suit the vibe for Inaba PERFECTLY. I'm looking forward to revival, but I am sad to say goodbye to this masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was very recommended if you want to play a Persona games, it is one of my favorite Persona game and I beat it like a 3 times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played the game twice, regular and true ending one of the best persona game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best persona games, it teach me a lot to accept my self for who i am",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story\nGreat character\nGreat music\nGreat graphics\nGreat gameplay and most importantly\n\n\n\nGreat vegetables\nPeak game 10/10\nABSOLUTE CINEMA 🙌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally peak fiction. Friend group dynamic in a small town feels authentic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love chie. chie is best character in this game after my goat kanji but chie is the best romance option she is tomboy i love tomboys she like kung fu movies so i do too and last she like eat steaks like i do too. cant wait to see better model of chie in persoa 4 remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic! Can't wait for the remake to come out later in the year. However, still get this on a deal if you loved either P3R or Persona 5 Royal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona 4 Golden is a genuinely captivating experience. The story is well-paced. Its cast feels relatable and grounded, making the quiet moments as memorable as the big ones. While the journey can feel a bit long, the emotional payoff and charm make it absolutely worth it. A thoughtful, engaging adventure overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tell me why you did it\nEvery dream falling apart\nTell me why you did it\nAfter the promise\nStill aching still aching\nOh baby I need your love\nLooking so different\nGlaring street light\n\n10/10. One of the best JRPG ever made and it has my favorite cast of characters ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.\n\nThe Good\n-Satisfying turn based combat with a one more mechanic that encourages you to find the weaknesses instead of just spamming the strongest moves\n-The music is 10/10\n-Decent enough story, I don't think the emotional highs are as good as 3 but still serviceable.\n-The social links and characterization is generally pretty good. Though I wish they did a bit more show not tell with the shadow versions of characters.\n-customizable difficulty that you can change when you want\n\nThe Bad\n-The pacing can be a drag with various slow parts. Like I get they want you to be attached to the characters but I don't need to see them hanging out for THAT long \n-Out dated graphics, I don't mind this but some might\n-Not knowing there's a awesome hidden final final boss if you pick \"NO\"  and goto junes when it asks you to goto your house on 3/20. (You're welcome btw, rip if you saved a NG+ file over that day)\n-FOMO EVERYWHERE, if you want 100% social links you need a guide. I don't recommend playing like this on your first playthrough though, don't worry about it.\n-Teddie\n-Rise's Japanese VA sounding like a baby.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for first time JRPG gamers and the story is quite epic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the best Persona game out there. I cried like a baby at the end. Inaba, it's residents and their stories will accompany me the rest of my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was skeptical at first playing this game because I played Persona 3 Reload first. I thought the graphics and the age of the game was going to make me not like the game. I even seen guides online saying to play this 1st since P3R has a better look and features. But after finishing this game and getting the true ending I must say story wise it outshines P3R in every way for me. I love the murder mystery aspect of the game, the music is awesome, and the dungeons are not repetitive and tedious as Tartarus. I genuinely can not wait for P4R!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Though by this point it is outclassed visually by both its successor P5 as well as the remake of its predecessor, P3 Reload, Persona 4 Golden is every bit as engaging as the other entries in the franchise. Its gameplay loop is familiar and satisfying, the combat is easy to grasp without being too rudimentary, and the setting is charming despite its relative lack of size or variety. The characters, as always with persona, shine (not Teddie but he's an outlier), and the group dynamics of the Investigation Team are every bit as interesting and fun as S.E.E.S or the Phantom Thieves. If you've played Persona 3 or 5 and you liked them, I'm sure you'll enjoy this one too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you began your acquaintance with the franchise from “Persona 3 Reload” as I did, you would likely abandon the game in the early beginning due to its poor appearance. But if you manage to overcome the first negative impression - you will find another jewel here. I promise you will not regret this!\n\nThe game has a very interesting story. We are going to solve a murder case in mystic settings. And we are not mere witnesses to a detective story. The case will not solve itself automatically - we have to do your own deductions to reach the actual final. The wrong decision may lead to accusing innocents and allowing the real culprit to escape.\n\nThere are many twists and quite an unexpected finale. However, the “aftermath” in the very end spoils the impression, where the “detective story” slowly transforms into an “existential crisis”.\n\nAlas not everything about the telling and quests is good.\n\nThe dialogues are quite twisted: it is hard to tell which exact choice means what or lead to what outcome. I have to replay several quests just because I misinterpreted the particular dialogue option. It’s not like every conversion has been implemented wrong, but it happens way too often.\n\nThe side quests are often twisted and require quite unobvious conditions to progress. In many cases it is hard to tell where we need to go and what we need to do. For example: there is a quest about a person who is afraid of cats. Talking to him has no effect. There are 2 cats in the vicinity, but interacting with them has no effect. The actual solution is yet another cat, which appears in the different part of town at the different time. What a?..\n\nYet another annoying activity is searching for clues on rescue missions, where it is unclear with whom we can talk, some key characters appear only on certain days of week, while “clock is ticking”.\n\nThere are also some inconsistencies in the overall lore and telling. For example: at the beginning we have our weapons confiscated by police on the spot, but just the next day we purchase tons of them in the local shop without any notice.\n\nThe battle is turn based. We have to combine physical attacks with elemental magic. Some foes are weak to fire, but resistant to ice and so on. The key to the victory is in finding particular enemy weakness. \n\nOverall the combat is quite challenging and interesting. However, some things are unbalanced. Dark and Light have only “instant kill” spells. We encounter enemies, which can be knocked down with a physical attack and resistant to all elemental damage, but at the same time landing an elemental attack reduces more of their hit points, than physical one. Due to such things some battles appear really weird.\n\nThe power we use in combat - “Persona” - takes its origin in wielder’s mind and social links. Thus it is crucial to build a relationship with different characters and socialize. Also the main quest outcome is affected by our progress on this front.\n\nThe graphics are quite poor. It depicts the characters with a tiny body and oversized head. The main problem is not the lack of details or poor polygons, but the fact it creates a twisted unnatural image. This really spoils some scenes, like “beauty contest”, and quests, like when we meet a girl, which is later described as “voluptuous”, making a surprise since visually she looks like any other. The battle animations appear like some sort of parody played by dolls. And purchasing custom outfits for the characters sounds like a joke.\n\nThe “visual novel” dialogue presentation with detailed character portraits and some fully animated cartoon-cutscenes are quite a contrast to the main graphics, making it feel even worse.\n\nIn comparison to “Persona 3 Reload” the visuals are a big disappointment, but this is not a fair comparison, since this one is a backported original game, while “3 Reload” is a remaster.\n\nStill this is not a kind of game which is played for the graphics.\n\nA lot of efforts have been put into music. Pop style songs with hooking voicing make the game feel bright and lively. There are also quite memorable moments of the concert we participate in.\nOnly a few dialogues are voiced. But even those which are represented as text usually contain some pronounced exclamations (like “yes”, “no”, “sad” and so on), which illustrates the overall character emotion. So they still appear quite lively.\n\nTotal Rating 6-7/10.\nThe poor visuals is the main thing, which spoils the impression. This may be not exactly a fair point for the old backported game like this, but I can not cast it aside either. Still the game has quite a lot of flaws even besides the graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is my introduction to the persona series, and i just now finished my first play-through of it. This game IS a 10/10 and everything about it makes it a 10, the characters (chie my beloved), the story, the gameplay, and everything else. during the end of the game i began crying because of how much i love this game and i didnt want it to end. This may go down as my favorite game of all time tbh (and no that is not recency bias). I enjoyed every second of it and i can't wait to see the other games atlus has to offer!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, great story and the perfect overall game to immerse yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What stuck out to me the most in this game, is the MUSIC! The game has amazing soundtracks, I added the OSTs to my playlist right away! Wow. The story is emotionally moving, and the characters are memorable! If you love story games, this game is worth trying out.\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5/5 Stars\n\nProbably my favourite game of all time. Fantastic characters, story, music, and gameplay. Hope Revival will be just as good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "P4 is a game with quite a few flaws in my opinion. It was difficult coming to P5's predecessor after experiencing a much more in-depth combat system. The difficulty curve was extremely steep at the beginning but quickly levels out, making most encounters mind-numbingly easy and dungeon crawling a slog. That being said, P4's graphics are extremely charming and nostalgic, the music is amazing (as with every Persona game), the characters are lovable (and annoying at times—I'm looking at you Teddie), the final battle was hype-inducing, and it is difficult to say goodbye at the end when you're finally finished. I'll miss you, Inaba (but I'm probably never coming back)!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Game of all time.\n\nhaven't finished it here yet and I still think the PsVita Version of this game is amazing.\n\nGreat Vegetables",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply put, this is arguably the best game in the series. That isn't to say it's my pick for the best (that would be Persona 5) but this has every right to be there with it. And it could very well be at the top of the list for everyone else. I'm just partial to P5. This game has a fantastic cast, an interesting story, and a great soundtrack. It plays perfectly on Steam Deck, which is the best place to play a game like this. You can pop in for 30 minutes to an hour sitting on your couch, or laying in bed, put it to sleep and (battery willing) jump back in when you have more time.\r\n\r\nHaving played countless JRPGs over multiple decades... The best compliment I can give to any game in the genre is this- Despite my 80+ hours, it never felt like a slog. There wasn't a point where I felt it was hanging around past it's welcome. I didn't think about what game I was going to play next, I wasn't lamenting the grind or wanting things to hurry up. I just enjoyed P4G from start to finish. It might be prudent to wait for the remake that was announced, but if you can grab this on a solid sale, I still feel like it's worthwhile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who largely avoided JRPG's over the years, I had no background whatsoever on the Persona series when it was released on PC (and XBox consoles) a few years ago.  My teenage daughter at the time was very interested in the series and quickly started playing Persona 5 when it released, and encourage me to give it a try.  Not wanting to overlap, opted for her to play P5, and I would try out Persona 4 at the same time.\n\nI am very glad I listened to her.\n\nThe Persona franchise has become a favorite of mine, and by now I have completed playthru's of P4. P5, and P3 Reload many times each.  However, P4G is my hands down favorite.  It has earned its place on my shortlist of all time favorite games, and has become one of those \"comfort\" titles; like the book or TV show that you have experienced many times before but keep going back to when you need something to cheer you up.  \n\nIs it dated in terms of graphics?  Yes.  Very much so, but who cares?  In RPG's, story is king.\n\nAre some of the characters a touch annoying at times?  Yes, but so are some of my relatives at holiday dinners; I still love them nonetheless.\n\nIn the end it's a good game that if you let it, will engross you for many hours at a respectable asking price.  It's a good example of when games were made to be enjoyed rather than cash grabs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "peak game, peak characters, peak soundtrack also naoto best girl",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Twin Peaks + Scooby Doo + Pokemon\nCombine that with a cosy town that you somehow feel nostalgia for despite not existing, probably the best in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fought god and almost kissed a twink 10/10 im looking forward for the remake sex mechanic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ANOTHER 10/10 VERY GOOD, NAOTO IS THE BEST, CHIE IS THE BEST, YOSUKE IS THE BEST, KANJI IS THE BEST, ADACHI IS ...true?, NANAKO IS THE GOAT! DOJIMA IS THE BEST, YUKIKO IS THE BEST, RISE IS THE BEST, AND TEDDIE LOWKEY HAS TO GO BRO, THIS GUY HAS BEEN LIVING FOR WAY TOO LONG. I DONT LIKE IT.\r\n\r\nIn all seriousness though the story of P4 is great, and a good majority of the characters (atleast from my first playthrough) are really interesting, and great. Especially Adachi and Naoto, my two personal favorites. That's about all I gotta say, go play, and now it's time for P3... YAHOOOO!!! 😎",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Como diría el Teddie, Kanji tiene buena retaguardia y eso es todo lo que se necesita saber para jugar deidad 4\n\nClap Dojima ❤️🩹",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely solid turn-based JRPG experience. This was my second persona game I've played following base Persona 5 and it holds up incredibly well despite the test of time. The character interactions, overarching story, and the personal stories/motivations of the different Arcana NPC's are the best parts in my eyes. There is a need to manage what you want to do each day since there is a limited amount of days, so you most likely won't get everything done in a single play-through. I think this would work as a good starting point in the series since it is both cheaper and less advanced technologically than the the rest. Beside Shin Megumi Tensei 3, I think.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TOP 3 GAMES OF ALL TIME, must play even if the graphics are buns.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would need more hours into this game, but fort the hours i spent i can clearly recommend trying this gtame out if youre a fan of JRPGs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Forging bonds with your friends and people of Inaba, as well witnessing your character's growth while jamming to some of the most fabulous music that came out of this franchise trying to get to the bottom of an all-elusive and mysterious murder case.. \n\nIt really is a fantastic game, expanding on all the succulent elements defining Persona full throttle, and while it might appear slightly rough around the edges at first glance (slow start being the most common complaint i have with the series as a whole :>), story and characters alone make P4 belong to the greatest games i've played out of this franchise, even with the upcoming remake in mind; which could lighten up some of the loosened ends of Golden content, hoping those could get adressed when their time is due. \n\nFor now, i cannot help but highly reccomend experiencing the game for yourself firsthand, and most important of all, take your precious time all you want with your game backlog everyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "kuma's story written better than any persona 5 antagonist\n\nalso great vegetables",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty love this game so much. Gonna waiting for Revival release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Will actually end up leaving you empty... Absolute Cinema.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "person 4 be the best persona . story and plot and THE SOUNDTRACK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually first started playing from xbox gamepass, but the game was so good I paid a friend to buy it 🙏🙏🙏🙏🙏",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't put into words how good this game is. I cried at the ending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game changed me if I could only play one game till the end of my life it'd be this one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best persona game.\r\nGreat characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely such a good game, while it may be a bit old and  kinda outdated in some ways such as graphics, gameplay mechanics and some writing choices its still such a good game that I really enjoyed. It is the 3rd mainline Persona game I've played after P5R and P3R and yet the story and characters hold just as much compared to the first two. \n\nI've grown to love and care for the characters so much and I was looking forward to figuring out what the story was. Each character's struggles and flaws feel real and realistic which is exaggerated by good voice acting.\n\nThe small town rural setting is also genuinely so cool and makes the game feel more cozy and laidback, not to mention I've grown to like the artstyle of the town despite the outdated graphics.  seeing the same familiar faces all the time is kinda cool too. \nThe music is an absolute banger too, maybe due to recency bias but in some ways its better than P3 and P5.  \n\nI would highly recommend playing this if you have any interest in Persona, you can play this as your first game or your 3rd like me. I am also genuinely looking forward to the remake and I am curious to see how they improve upon an already really good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "That's why he's the mvp, the goat, the goaaaaaat (Apart from Persona 3)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Childhood classic but wait for the remake atp",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My first persona game and this is absolutely amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The happiest game about serial murder you'll ever play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good i like it alot. my first persona game! :D big naoto fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"как вот человек, играющий в ебаную персону, может говорить мне, что я с ума сошёл?\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game changed my life this truly was our persona 4 golden",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Puts a smile on your face, except for Teddy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A hundred-hour simulator of the ideal life you will never have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Holy shit this is one of the best games i have ever played. please play it i dont care how many hours it will take you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "honestly this game makes me FOMO for a friend group",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yosuke Hamamura and Yu Narukami type game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Now that I beat the game what do I even play now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the Persona series you'll enjoy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona 4 = Old = Gaming = Fun = 9,5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Diamond is unbreakable the game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is insanely good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i reach out the truth of my life after playing this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great atmosphere",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Love this game and all other Persona series. Great gameplay and storytelling.\r\n\r\nBiggest problem i have is that it requires REGULAR active internet connection due to Denuvo. It pisses me off that I can't play an offline single player game on my steamdeck on the plane with no internet, even though I already connect it to the internet to get autheticated before getting on the plane.\r\n\r\nIf you have an active internet connection all the time, and love a great singleplayer turn-based RPG, then this is the game for you.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game. However the fact that a port of a PS2 game doesn't run well on low end PCs is downright embarassing, fuck Denuvo.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game does not respect your time. Locking the game endings after 50 hours of gameplay behind a random set of questions and answers that requires a guide to get right on the first try is just not right.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They took Chie to empty field and shot her brain out, then ask some random girl to skin walk as her.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you kind of liked p3r you wont like this one. its slow, cringe and boring and the combat is tedious rather than engaging",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There isn't a Secret Secret Nanako Boss ending 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "keeps crashing randomly making you lose progress",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can't kill the perverted bear 0/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst game I have ever played. Boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Love this game and all other Persona series. Great gameplay and storytelling.\r\n\r\nBiggest problem i have is that it requires REGULAR active internet connection due to Denuvo. It pisses me off that I can't play an offline single player game on my steamdeck on the plane with no internet, even though I already connect it to the internet to get autheticated before getting on the plane.\r\n\r\nIf you have an active internet connection all the time, and love a great singleplayer turn-based RPG, then this is the game for you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game just feels way too repetitive. Most days you’re doing the same stuff over and over just to push Social Links, and it gets old pretty quick. A lot of people say this is the best story in the series, but honestly I don’t see it. To be fair, this was my first Persona game, so I hadn’t tried the others yet when I played it.\n\nI do understand why people recommend it as a starting point though. It’s definitely the most dated in terms of graphics and gameplay compared to Persona 3 Reload and Persona 5 Royal, so it makes sense to play it first before moving on to the newer ones.\n\nOverall, the repetitiveness and the outdated feel really dragged the experience down for me. Still, it’s not a bad game, just not one I enjoyed as much as others seem to. I’m planning to play Persona 3 Reload and Persona 5 Royal after finishing this one to see how they compare.\n\nI give this one [b]6/10[/b].\n\n[b]Updated Review:[/b]\nI tried to finish the game after my first review, but I encountered a glitch that prevents me from opening the Void Quest endgame door, even though I already have the [spoiler]Orb of Darkness[/spoiler] key from [spoiler]the 7th floor[/spoiler]. I never thought I’d have to reload an earlier save and waste my time like this. What a trash game. [b]4/10[/b].\n\n [b]It would be better to wait a year or two for the release of Persona 4 Revival and buy that instead of this one.[/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game. However the fact that a port of a PS2 game doesn't run well on low end PCs is downright embarassing, fuck Denuvo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I just don't think this is for me. The story I've heard is better than Persona 5 and 3. I've also heard the characters are great, there's not a lot of dud characters like there were in Persona 3. However, the reason I can't recommend the game is that the visuals and controls are dated. Sorry if you didn't want to hear it. However, my main issue with both P4 and P3R is that their gameplay is just not great. Some people will have fun going around in poorly, randomly generated, bland rooms for 30-40 hours with repetitive, mind-numbing gameplay where your character doesn't feel great to control. However, for me personally, it's not for me.\n\nGo play Persona 5 R if you're looking for the ultimate Persona experience.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They took Chie to empty field and shot her brain out, then ask some random girl to skin walk as her.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you kind of liked p3r you wont like this one. its slow, cringe and boring and the combat is tedious rather than engaging",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does not respect your time. Locking the game endings after 50 hours of gameplay behind a random set of questions and answers that requires a guide to get right on the first try is just not right.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There isn't a Secret Secret Nanako Boss ending 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't kill the perverted bear 0/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst game I have ever played. Boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Love this game and all other Persona series. Great gameplay and storytelling.\r\n\r\nBiggest problem i have is that it requires REGULAR active internet connection due to Denuvo. It pisses me off that I can't play an offline single player game on my steamdeck on the plane with no internet, even though I already connect it to the internet to get autheticated before getting on the plane.\r\n\r\nIf you have an active internet connection all the time, and love a great singleplayer turn-based RPG, then this is the game for you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game just feels way too repetitive. Most days you’re doing the same stuff over and over just to push Social Links, and it gets old pretty quick. A lot of people say this is the best story in the series, but honestly I don’t see it. To be fair, this was my first Persona game, so I hadn’t tried the others yet when I played it.\n\nI do understand why people recommend it as a starting point though. It’s definitely the most dated in terms of graphics and gameplay compared to Persona 3 Reload and Persona 5 Royal, so it makes sense to play it first before moving on to the newer ones.\n\nOverall, the repetitiveness and the outdated feel really dragged the experience down for me. Still, it’s not a bad game, just not one I enjoyed as much as others seem to. I’m planning to play Persona 3 Reload and Persona 5 Royal after finishing this one to see how they compare.\n\nI give this one [b]6/10[/b].\n\n[b]Updated Review:[/b]\nI tried to finish the game after my first review, but I encountered a glitch that prevents me from opening the Void Quest endgame door, even though I already have the [spoiler]Orb of Darkness[/spoiler] key from [spoiler]the 7th floor[/spoiler]. I never thought I’d have to reload an earlier save and waste my time like this. What a trash game. [b]4/10[/b].\n\n [b]It would be better to wait a year or two for the release of Persona 4 Revival and buy that instead of this one.[/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game. However the fact that a port of a PS2 game doesn't run well on low end PCs is downright embarassing, fuck Denuvo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I just don't think this is for me. The story I've heard is better than Persona 5 and 3. I've also heard the characters are great, there's not a lot of dud characters like there were in Persona 3. However, the reason I can't recommend the game is that the visuals and controls are dated. Sorry if you didn't want to hear it. However, my main issue with both P4 and P3R is that their gameplay is just not great. Some people will have fun going around in poorly, randomly generated, bland rooms for 30-40 hours with repetitive, mind-numbing gameplay where your character doesn't feel great to control. However, for me personally, it's not for me.\n\nGo play Persona 5 R if you're looking for the ultimate Persona experience.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They took Chie to empty field and shot her brain out, then ask some random girl to skin walk as her.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you kind of liked p3r you wont like this one. its slow, cringe and boring and the combat is tedious rather than engaging",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does not respect your time. Locking the game endings after 50 hours of gameplay behind a random set of questions and answers that requires a guide to get right on the first try is just not right.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There isn't a Secret Secret Nanako Boss ending 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't kill the perverted bear 0/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst game I have ever played. Boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Love this game and all other Persona series. Great gameplay and storytelling.\r\n\r\nBiggest problem i have is that it requires REGULAR active internet connection due to Denuvo. It pisses me off that I can't play an offline single player game on my steamdeck on the plane with no internet, even though I already connect it to the internet to get autheticated before getting on the plane.\r\n\r\nIf you have an active internet connection all the time, and love a great singleplayer turn-based RPG, then this is the game for you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game just feels way too repetitive. Most days you’re doing the same stuff over and over just to push Social Links, and it gets old pretty quick. A lot of people say this is the best story in the series, but honestly I don’t see it. To be fair, this was my first Persona game, so I hadn’t tried the others yet when I played it.\n\nI do understand why people recommend it as a starting point though. It’s definitely the most dated in terms of graphics and gameplay compared to Persona 3 Reload and Persona 5 Royal, so it makes sense to play it first before moving on to the newer ones.\n\nOverall, the repetitiveness and the outdated feel really dragged the experience down for me. Still, it’s not a bad game, just not one I enjoyed as much as others seem to. I’m planning to play Persona 3 Reload and Persona 5 Royal after finishing this one to see how they compare.\n\nI give this one [b]6/10[/b].\n\n[b]Updated Review:[/b]\nI tried to finish the game after my first review, but I encountered a glitch that prevents me from opening the Void Quest endgame door, even though I already have the [spoiler]Orb of Darkness[/spoiler] key from [spoiler]the 7th floor[/spoiler]. I never thought I’d have to reload an earlier save and waste my time like this. What a trash game. [b]4/10[/b].\n\n [b]It would be better to wait a year or two for the release of Persona 4 Revival and buy that instead of this one.[/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game. However the fact that a port of a PS2 game doesn't run well on low end PCs is downright embarassing, fuck Denuvo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I just don't think this is for me. The story I've heard is better than Persona 5 and 3. I've also heard the characters are great, there's not a lot of dud characters like there were in Persona 3. However, the reason I can't recommend the game is that the visuals and controls are dated. Sorry if you didn't want to hear it. However, my main issue with both P4 and P3R is that their gameplay is just not great. Some people will have fun going around in poorly, randomly generated, bland rooms for 30-40 hours with repetitive, mind-numbing gameplay where your character doesn't feel great to control. However, for me personally, it's not for me.\n\nGo play Persona 5 R if you're looking for the ultimate Persona experience.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They took Chie to empty field and shot her brain out, then ask some random girl to skin walk as her.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you kind of liked p3r you wont like this one. its slow, cringe and boring and the combat is tedious rather than engaging",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does not respect your time. Locking the game endings after 50 hours of gameplay behind a random set of questions and answers that requires a guide to get right on the first try is just not right.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There isn't a Secret Secret Nanako Boss ending 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't kill the perverted bear 0/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst game I have ever played. Boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Love this game and all other Persona series. Great gameplay and storytelling.\r\n\r\nBiggest problem i have is that it requires REGULAR active internet connection due to Denuvo. It pisses me off that I can't play an offline single player game on my steamdeck on the plane with no internet, even though I already connect it to the internet to get autheticated before getting on the plane.\r\n\r\nIf you have an active internet connection all the time, and love a great singleplayer turn-based RPG, then this is the game for you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game just feels way too repetitive. Most days you’re doing the same stuff over and over just to push Social Links, and it gets old pretty quick. A lot of people say this is the best story in the series, but honestly I don’t see it. To be fair, this was my first Persona game, so I hadn’t tried the others yet when I played it.\n\nI do understand why people recommend it as a starting point though. It’s definitely the most dated in terms of graphics and gameplay compared to Persona 3 Reload and Persona 5 Royal, so it makes sense to play it first before moving on to the newer ones.\n\nOverall, the repetitiveness and the outdated feel really dragged the experience down for me. Still, it’s not a bad game, just not one I enjoyed as much as others seem to. I’m planning to play Persona 3 Reload and Persona 5 Royal after finishing this one to see how they compare.\n\nI give this one [b]6/10[/b].\n\n[b]Updated Review:[/b]\nI tried to finish the game after my first review, but I encountered a glitch that prevents me from opening the Void Quest endgame door, even though I already have the [spoiler]Orb of Darkness[/spoiler] key from [spoiler]the 7th floor[/spoiler]. I never thought I’d have to reload an earlier save and waste my time like this. What a trash game. [b]4/10[/b].\n\n [b]It would be better to wait a year or two for the release of Persona 4 Revival and buy that instead of this one.[/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game. However the fact that a port of a PS2 game doesn't run well on low end PCs is downright embarassing, fuck Denuvo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I just don't think this is for me. The story I've heard is better than Persona 5 and 3. I've also heard the characters are great, there's not a lot of dud characters like there were in Persona 3. However, the reason I can't recommend the game is that the visuals and controls are dated. Sorry if you didn't want to hear it. However, my main issue with both P4 and P3R is that their gameplay is just not great. Some people will have fun going around in poorly, randomly generated, bland rooms for 30-40 hours with repetitive, mind-numbing gameplay where your character doesn't feel great to control. However, for me personally, it's not for me.\n\nGo play Persona 5 R if you're looking for the ultimate Persona experience.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They took Chie to empty field and shot her brain out, then ask some random girl to skin walk as her.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you kind of liked p3r you wont like this one. its slow, cringe and boring and the combat is tedious rather than engaging",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does not respect your time. Locking the game endings after 50 hours of gameplay behind a random set of questions and answers that requires a guide to get right on the first try is just not right.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There isn't a Secret Secret Nanako Boss ending 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't kill the perverted bear 0/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst game I have ever played. Boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Love this game and all other Persona series. Great gameplay and storytelling.\r\n\r\nBiggest problem i have is that it requires REGULAR active internet connection due to Denuvo. It pisses me off that I can't play an offline single player game on my steamdeck on the plane with no internet, even though I already connect it to the internet to get autheticated before getting on the plane.\r\n\r\nIf you have an active internet connection all the time, and love a great singleplayer turn-based RPG, then this is the game for you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game just feels way too repetitive. Most days you’re doing the same stuff over and over just to push Social Links, and it gets old pretty quick. A lot of people say this is the best story in the series, but honestly I don’t see it. To be fair, this was my first Persona game, so I hadn’t tried the others yet when I played it.\n\nI do understand why people recommend it as a starting point though. It’s definitely the most dated in terms of graphics and gameplay compared to Persona 3 Reload and Persona 5 Royal, so it makes sense to play it first before moving on to the newer ones.\n\nOverall, the repetitiveness and the outdated feel really dragged the experience down for me. Still, it’s not a bad game, just not one I enjoyed as much as others seem to. I’m planning to play Persona 3 Reload and Persona 5 Royal after finishing this one to see how they compare.\n\nI give this one [b]6/10[/b].\n\n[b]Updated Review:[/b]\nI tried to finish the game after my first review, but I encountered a glitch that prevents me from opening the Void Quest endgame door, even though I already have the [spoiler]Orb of Darkness[/spoiler] key from [spoiler]the 7th floor[/spoiler]. I never thought I’d have to reload an earlier save and waste my time like this. What a trash game. [b]4/10[/b].\n\n [b]It would be better to wait a year or two for the release of Persona 4 Revival and buy that instead of this one.[/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game. However the fact that a port of a PS2 game doesn't run well on low end PCs is downright embarassing, fuck Denuvo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I just don't think this is for me. The story I've heard is better than Persona 5 and 3. I've also heard the characters are great, there's not a lot of dud characters like there were in Persona 3. However, the reason I can't recommend the game is that the visuals and controls are dated. Sorry if you didn't want to hear it. However, my main issue with both P4 and P3R is that their gameplay is just not great. Some people will have fun going around in poorly, randomly generated, bland rooms for 30-40 hours with repetitive, mind-numbing gameplay where your character doesn't feel great to control. However, for me personally, it's not for me.\n\nGo play Persona 5 R if you're looking for the ultimate Persona experience.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They took Chie to empty field and shot her brain out, then ask some random girl to skin walk as her.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you kind of liked p3r you wont like this one. its slow, cringe and boring and the combat is tedious rather than engaging",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does not respect your time. Locking the game endings after 50 hours of gameplay behind a random set of questions and answers that requires a guide to get right on the first try is just not right.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There isn't a Secret Secret Nanako Boss ending 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't kill the perverted bear 0/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst game I have ever played. Boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Love this game and all other Persona series. Great gameplay and storytelling.\r\n\r\nBiggest problem i have is that it requires REGULAR active internet connection due to Denuvo. It pisses me off that I can't play an offline single player game on my steamdeck on the plane with no internet, even though I already connect it to the internet to get autheticated before getting on the plane.\r\n\r\nIf you have an active internet connection all the time, and love a great singleplayer turn-based RPG, then this is the game for you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game just feels way too repetitive. Most days you’re doing the same stuff over and over just to push Social Links, and it gets old pretty quick. A lot of people say this is the best story in the series, but honestly I don’t see it. To be fair, this was my first Persona game, so I hadn’t tried the others yet when I played it.\n\nI do understand why people recommend it as a starting point though. It’s definitely the most dated in terms of graphics and gameplay compared to Persona 3 Reload and Persona 5 Royal, so it makes sense to play it first before moving on to the newer ones.\n\nOverall, the repetitiveness and the outdated feel really dragged the experience down for me. Still, it’s not a bad game, just not one I enjoyed as much as others seem to. I’m planning to play Persona 3 Reload and Persona 5 Royal after finishing this one to see how they compare.\n\nI give this one [b]6/10[/b].\n\n[b]Updated Review:[/b]\nI tried to finish the game after my first review, but I encountered a glitch that prevents me from opening the Void Quest endgame door, even though I already have the [spoiler]Orb of Darkness[/spoiler] key from [spoiler]the 7th floor[/spoiler]. I never thought I’d have to reload an earlier save and waste my time like this. What a trash game. [b]4/10[/b].\n\n [b]It would be better to wait a year or two for the release of Persona 4 Revival and buy that instead of this one.[/b]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game. However the fact that a port of a PS2 game doesn't run well on low end PCs is downright embarassing, fuck Denuvo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I just don't think this is for me. The story I've heard is better than Persona 5 and 3. I've also heard the characters are great, there's not a lot of dud characters like there were in Persona 3. However, the reason I can't recommend the game is that the visuals and controls are dated. Sorry if you didn't want to hear it. However, my main issue with both P4 and P3R is that their gameplay is just not great. Some people will have fun going around in poorly, randomly generated, bland rooms for 30-40 hours with repetitive, mind-numbing gameplay where your character doesn't feel great to control. However, for me personally, it's not for me.\n\nGo play Persona 5 R if you're looking for the ultimate Persona experience.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They took Chie to empty field and shot her brain out, then ask some random girl to skin walk as her.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you kind of liked p3r you wont like this one. its slow, cringe and boring and the combat is tedious rather than engaging",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does not respect your time. Locking the game endings after 50 hours of gameplay behind a random set of questions and answers that requires a guide to get right on the first try is just not right.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There isn't a Secret Secret Nanako Boss ending 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't kill the perverted bear 0/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The worst game I have ever played. Boring.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}