{
  "positive": [
    {
      "review": "This game has some of the worst physics and racing ai. Hitting anything is always a guessing game since you never know if you're gonna flip from hitting a curb or a table, or stop because they decided that pole or that stick of a tree is harder than diamond and heavier than a mountain. The ai is clearly just a mirror of a dev doing the race themselves- there's no variation in any of the other drivers. It doesn't feel like im racing against other people- people make mistakes and dont know the perfect drivelines. These ai follow a set path and do NOT deviate except when there is traffic or a collision. the decision making and design choice for this game feels extremely arbitrary and counter intuitive. The ai generated artwork and voices are extremely offputting and outright lazy as well. I could go on and on about everything that ticks me off about this game but let me cut to the chase. Right now the market for street racing games is a barren desert. Nobody is making them and when they do they always find a unique way to screw them up. As much as I dislike this game it just doesn't have anything to compete with. This game would be completely unheard of if rockstar put out a new midnight club or if ea put out a remastered underground or mw(2005). There is a foundation here and the devs can definitely do better, its clear that they're, at the very least, passionate for cars. If I could give this game a neutral rating I would. Only because I want to see a sequel that's improved in every way will I rate this positively.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "a really fun game to play to pass the time, i have gotten 65hrs on it the first week so i hope to get more hours from it",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Overall a fun time. There are a few bugs in the game and when you are tuning your car, the games menu's can be a little bit confusing but there is a ton of content to sink your teeth into.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love the game so far but would really like an option to disable the head bobbing. kinda gives me motion sickness.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game and a lot of missions and such to do and plenty of money to be made to buy some cool ass cars ... the driving is unrealistic but that doesnt mean its a bad game is overall other than that this game is pretty solid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The amount of car tweaking functionality are fun. But sadly, it's rare to find a racing lobby, at least in South East Asia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is basically what Need for Speed should be today.\n\nHuge map, tons of cars (none of them licensed, but honestly, you won’t even notice), and probably the best customization available right now. Seats, steering wheels, ride height, camber, almost everything, but I think it needs more wheels.\n\nGraphics are fine. Nothing special. Optimization is weak. It runs, but not that well.\n\nThe game forces you into an online room every time, even if you don’t want it. A real solo mode would probably improve performance.\n\nSoundtrack? Meh. But they added an option to use your own music, so… “problem solved.”\n\nIf you like cars and customization, grab it on sale. It has flaws, but it also has heart, as the previous title shows, the dev team clearly likes cars and cares about what they’re doing, and they actually listen to their players sometimes.\n\nThe devs still update their older game (CarX Drift Racing), so I believe they’ll keep working on this one too, even after their next release.\n\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CarX Street is rough around the edges but genuinely fun. The driving physics feel great, customization is deep, and cruising around the city never gets old. It definitely needs some optimization and bug fixes, but if you’re into street racing and tuning cars, it’s worth picking up. Solid game with a lot of potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun I just wish they made the traffic lights work and have tunnel echoing sounds :) (please add)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. Here for drifting, came from Assetto Corsa and its like Assetto, but open world without the mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its pretty fun extra like 2 or 3 bucks for dlc is OMEGA worth it (you get a free lambo) and other cars you will like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CarX Street for MacOS Tahoe on Mac Mini M-Series\n\nCarX Street is one of those smaller games that is as good or better than you may have hoped before playing it. From the gameplay to the visuals and customization, CarX Street is a fantastic journey into the open-world car racing genre.\n\nVISUALS\nThe visuals are superb for a game of this size. Long sight-lines and a large map make this game a blast to explore. Cars, modifications and the map make for a lot of lovely wasted time. Playing for hours at a time just exploring the landscape. When it comes to the cars, being able to create your own vision and see it drive down the road is spectacular. The camera feature makes this feel so worth your time. So many beautiful places to get lost in and take a few photos. Nice touch!\n\nAUDIO\nThe audio is a bit of a mixed bag, but definitely on the higher end. The engine sounds are good, but the engine backfires pop to life and make it worth having a good audio system. Bass rumbles! The atmospheric audio is good also. Tire contact with different road and land materials always let you know whether you need to take it easy or hold down the accelerator.\n\nGAMEPLAY\nThe gameplay feels great and learning each of the vehicles nuances makes for a learning experience for sure. It can be so satisfying when you get the grip knowledge needed for races and drifting. The sense of accomplishment as you modify and tune each vehicle is worth the price of admission in my opinion. Something the dev team really seems to understand.\n\nCONTENT AND VALUE\nNow, full disclosure, I purchased the game and all the DLC. But for the amount, I have zero regrets. Being a Mac gamer, I am sure there are many games in the racing arena that I am not able to play that Windows players can. But having this one in the arsenal is fantastic in my opinion. It's just that good on the Mac side. With limited choices, this one is a no-brainer for Mac gamers. If you like NFS and games like it, this is the one for you.\n\nCLOSING\nI appreciate that Carx Tech allowed this game to be available for MacOS as it fills a gap on the platform. Keep up the good work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Singleplayer: It's ok\nMultiplayer: It's great! But sometimes have connection issues, i have to use WARP to solve the issue\nStory: Meh..\nVoice Acting: Meh..\nEconomy: It's good now\nAI: AI kinda cracked, use brute forces and be fast!\nRacing Feels & Handling: Yes, it's good, easy to learn, hard to master\nDrifting Handling: YESSSSSSSSSSSSSS DRIFT TRAIN LETS GOOOO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helping me relive a bit of my childhood, this game feels so familiar. Like an old friend you haven't seen in fifteen years and they come bearing gifts and massages and pizza. That's a friend you show up for! So show up for CarX yuh boi!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really... my absolute favorate racing game. I dont think theres any other game i spent >120 hrs in. But please devs... fix that damn fps drop issue... ~65 fps with my legion go, if fps drops for a few minutes its 10 fps.5*+ but only 4 due to that annoing issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, with your own music and multiplayer it gets a lot better.\nAlso i would like to see more c6 clubs and addition of cs clubs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game; I play it from time to time, and I really love the idea that you refill the fuel and change the tires over time and refill the nos. I want the developers to fix the game's fps issues. Sometimes the game crashes on me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in my experiance i played on minimum settings with smoke on mid i play on a labtop with a mid cpu and intigrated graphics in the city with traffic 15 fps out and about little traffic 25-30 fps well optimised love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is alright if you are willing to tune your WHOLE car because stock cars do suffer A LOT from understeer. it took me like 75 hours to get the hang of the tuning and creating base setups. However I believe this game would go for people who also dont have much car knowledge or a tuner, you can have a basic understanding of the tunes for little to no understeer and you play the game just fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the most beautiful looking racing games out there. And if you're a fan of detailed customization and tuning, then this game is just for you. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "add bikes, i would love to modify a s1k or a hayabusa in this game would be fun, overall really nice game, love everything about its just so fckn good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good i recomend buying the sunset pack it helps a lot and you have the entire map",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game. Fun to drift around the streets, the clubs and races are good. I really enjoy the fact you can pink slip with the A.I and win their car. Speaking of the A.I they can be wonky at times. For example they flip randomly while turning, so that’s an issue. I play on both pc and steam deck. It runs decent on the steam deck with few graphic tweaks. I do recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game i find to be very relaxing , fun and sort of challenging when racing . this game will send you on a emotional rollercoaster from the racing sometimes you will feel like Paul walker and then other times you will feel like a side character with one purpose to crash and die because of a small rock in the track or AI's pitting you. My biggest issue with this game is the grinding for car parts and the prices for everything however its not like parts are unobtainable. overall i rate this game 7/10 in terms of  being fun and easy to play. anyone complaining about the price is broke / unemployed and probably doesn't even own a irl car to put gas in, saying that you need to wait for this game to go on sale is saying you are in a financial crisis . for $20 game is very decent and fun to play ( if you can tell i only made this review to target the broke people complaining about the price also if you cant run this game above 30fps your PC is dog water  the game is very optimized )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, really brings back NFSU2 vibes for me. also, being able to add your own music now is fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall amazing game and the map is massive with plenty of different atmospheres and enjoyable areas to speed and drift through with all of the different cars and many different upgrades and builds for each car. The clubs and the AI can be really enjoyable of an experience and fun to challenge your skills, on the other hand they can be unbearable to play through and race against sometimes. A lot of the clubs are good and have good races but the ones with the objectives or broken bots are abysmal.\n\nTimed objectives that aren't even remotely plausible and that take 8-10 tries to even complete make no sense to do. Those clubs are kind of useless but, what's worse than useless is bots that are basically impossibly difficult. In the areas of the map where you race bots through the \"mountain pass's\" and the hairpin turns, I find it almost impossible to drift through those parts of the map with bots because they have the most unrealistic AWD steering, accelerating and braking. The bots aren't bound by the reality of the game and the same applicable rules that the player is bound by. I've tampered and tinkered with any kind of setting change/ car tuning or build to make a car be able to do that and all have attempts to mimic the bots have failed. The bots are just broken and need to be reworked to actually drift through those turns, no bullshit awd or broken steering abilities, just rwd and counter steering/ throttle skills. Besides those 2 big issues everything else is amazing.\n\n\nPS: I know that clubs can be replayed and you can use any build or car for those clubs BUT, that means I can only play that club if I want to do that car class. As I previously mentioned there are a lot of clubs that either have broken bots or they are only objective based \"races\" if you can even call it that. So more times than not I'm only playing the same 1-2 clubs that are even worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game great mechanics great updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If MIdnight Club, Need for Speed, and an arcade simulator had a baby. It'll be close to this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "feels like classic NFS with no cops and more sim handling. fun map, fun cars, fun fun fun! and super cheap!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing time spent and experience. Good map size. Ok graphics. driving is very interesting. Since you need to tweak things in tunning to succeed. Cool races, down to earth cars. Reminds me of good old underground days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a nice game to play with your friends i am playing this game with my best friend and we are dying from laughing it's so funny i play with the R33 and he is playing with the GTR and Supra",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yall this game is amazing, i really recommend it its the most realistic game, even with its physics and drifts, amazing, highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I [i] hate [/i] trying to figure out which car is which — seriously, it gets annoying real quick.\r\nBut aside from that, the overall gameplay experience is solid and genuinely fun.\r\n\r\nThe only major gripe I have is with the vinyl editor. Sometimes a shape will randomly show up somewhere else on the car, and I’m forced to reposition it… or rotate the camera until it decides to disappear. It’s a small thing, but it gets frustrating when you’re trying to be precise.\r\n\r\nWith the updates coming in — fixing bugs and adding new content — the game keeps getting better. Definitely feels worth buying in my opinion. 8.9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graphics and physics. Wide selection of cars and tuning. Ive been playing both Street and Drift games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first started playing, I was exited to get into something new. But the more I played, I noticed people zipping around going mach speed in \"modded\" cars. It honestly ruins the game for me because this game offers a lot of fine tuning a vast options for cosmetic customization for every vehicle.\r\n\r\nPeople boast and call your car \"slow\" or say you've got a \"Trash tune\" whole time they're using cheats to boost acceleration to literal light speed. Its sad honestly because there ARE people that actually take the time to tune their builds, only to get instantly gaped by a person in a Honda Civic going 600 mph+. \r\n\r\nCrazy potential tho if it weren't for the cheaters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would but there is a lot of glitches with the game. other than that and when you can actually play the game its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but gets repetitive after a time, though with your own music and multiplayer it gets a lot better.\r\nAlso i would like to see more c6 clubs and addition of cs clubs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a good all around game, good story line and many great to customize your rides. tires and gas sold separately",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really fun game since the racing genre has been soo bland nowadays, would recommend giving it a try! <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good bit poo poo on mac though even after the update I think they fixed the screen tearing though it looks like nevermind just went back in and still screen tearing not sure if it is just an issue on my side though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best street racing games out there. Very good customisations and car selection. Improving constantly with updates. Devs do seem to be putting in effort to make it even better and do seem to listen to the players feedback and communicate. Some minor issues with car decals and some other bugs sometimes but I would recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got 193.2 hours in to the game. The game reminds me of Midnight Club LA and Test Drive Unlimited 2. Many body kits and engines to pick from. Plenty of mountain roads to drift on. If you don't like drifting then there is a huge race track to race on. ( need to buy the DLC to unlock the racetrack) there is a massive highway to do pulls on. The map is like Japan with a American twist. Decent amount of cars to pick from. Definitely worth getting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A surprising hidden gem! Perfect blend between Forza Horizon, NFS and The Crew.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its nice, keeps some good mechanics from older NFS titles but still feels original. I really like the mix of a more realistic racing model togheter with the street racing theme. i say \"more\" realistic compared to NFS and similiar titles, it is still very much arcade, but the cars feel weighty, grip matter, and the amount of tuning to fit your driving style is very much in the realm of simulation. A good middle ground if you want more street racing, but also appreciate the slower pace of track simulators.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent street racer with old school vibes, great customization though the UI is a little strange. The map is very big and imaginative, honestly outdoes the Forza Horizon games in some regards. They cooked with this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and Chill racing game with decent arcade handling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Within 2 days of gameplay, specifically 44 hours only, I learned that from level 1 to level 8, you won't be able to the Miata in the beginning of the game that you get for free to drift. After doing sprint, drift, and circuit missions, I learned quickly that these are a complete waste of time because getting in 1st place is nearly impossible; which is how you get the most CR (credits).\r\n\r\nSo, I shifted to delivering cars for cash. It starts off with rewarding you 5,000 CR. Once you deliver enough cars, you unlock the 15,000 CR deliveries and the cars are higher performance than the 5,000 CR ones. Then the 3rd rank of this business gives you $ which is the premium in-game currency that is used to buy higher-tier car upgrade parts, engine and transmission swaps, and occasionally bodykits that use this currency.\r\n\r\nYou can farm the $ currency once every 30 minutes. You can run two 15,000 CR missions per day. Then it turns into one 15,000 CR mission per 3 minutes. The 5,000 CR missions are infinite with no cooldown timer restriction. So you can spam these back to back. To pass the 3 minute timer quicker, it's best to drive to each location where the delivery starts on the map and by the time you get there you'll be able to run it right away.\r\n\r\nSo, the key tip for this game is to ignore the missions on the map, the campaign etc. And just focus on maxing out the rank of the car and box delivery businesses so that you can spam 5,000 and 15,000 CR and 20 $ currency missions back to back. \r\n\r\nBetween level 1 and 8, you'll start to unlock the parts needed to make a car drift. This is when I sold the Miata, after it was finally able to go sideways consistently with the tuning I gave it, for a BMW. Used the BMW until like level 16-ish. Built an s18 alongside the BMW. Sold the BMW. Sold the s18. And now I have a honda civic type-r AWD and an Evo X swapped to RWD. With plans of building another RWD dedicated car without hard swapping the transmission.\r\n\r\nThis game is easy. The people that complain it takes too long have no idea what they're doing. After 2 real-world days of playing at my own pace, I've cracked the system. If you play on Multiplayer and spend an hour just drifting and building up the score multiplier which you can do from drifting and driving around the map at high speeds, you get like 5 account levels within that time frame, which rewards you CR and $, you unlock car parts and multiple cars in between too. On top of looking for the red covered cars around the map you'll earn quick cash fast that can be used for tuning a car from the ground up.\r\n\r\nI'm just gonna keep laughing at the idiots that think it's too slow to get anywhere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice graphics, totally recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a whole lot of fun, worth the cost of entry ... some deep tuning and the drifting is smooth once you get the car dialed \r\n\r\nall the cars are non licensed but look like what they are anyhow - lots of good visual mods/paint types",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got it for free and now have to pay for it but overall a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "quite annoying when starting because you have to grind alot, once you have played for a while and have money, its easy - very nice drifting physics and graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Fun to play with friends or alone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun but i suck at drifting so less fun than it could be",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super rellistic sim drift racing building awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay and feeling is very close to NFS Undergroun 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but need litlle bug fixes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10 improvements can definitely be made. Overall good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is lots of fun. Im into sims and all that but this game is a nice casual break with great customization for cars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is a map bug, but other than that all nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game i have over 250 hours in this game all ready i really think you should buy this game and play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a game you play when your doing nothing or have nothing to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels like a glorified mobile game but still fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to drive around in worth the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its not perfect but if gave it a try you gonna like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game i played ever <3 thx to devs making this game for pc players <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the goated tier car game i've played so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its amazing you just need friends to have more fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect nice gameplay",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Better than need for speed.....all it's missing is the heat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok that good. But find gold so hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good over all once u figure it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun\nnice graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best thing since under ground",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really really good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like everything just needs more added for the feel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really recommend this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than forza",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "simply better than underground 2",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good for racing or driving as if your irl on sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great and foon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game buy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very chill game :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great defenently get it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if your a car lover this suits for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in 41 years from 2025 it will be 2067",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Honestly do not get this game unless its on sale (goes on sale for like 8.99 every summer / winter sale) the ai in this game so bad i pass the ai and it turns clips my car and i go flying but when i clip the car it dose not even move witch is not that bad since its kinda the same gt7 but what makes it bad is the traffic and i know its a street racing game so ofc there gonna be traffic but omg i cant go one second without a car spawning infront of me like one second its not there the other its fading into existence then when i crash into a traffic car i fully stop and cant even respawn but when the ai racer crashes into a ai car it ether pushes right through it and keeps most of its speed or it fully stops but respawns instantly anyways get the game during a sale unless you think the 20 dollars is worth it and you can handle the ai sorry for no periods i dont fucking care have a good day",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "CarX Street feels like a mobile port with PC settings slapped on top, yet somehow it demands more hardware than Forza Horizon or The Crew Motorfest. The visual quality just doesn’t match the system requirements. Even on solid mid-range GPUs, the game struggles with frame pacing, stutters, and noticeable drops in busy city areas.\r\n\r\nThere’s potential here, but the optimization is nowhere near where it needs to be for a proper PC release.\r\nPlease focus on performance - the current state is unpleasant to play, even though the core driving physics are solid.\r\n\r\nRight now you get mobile visuals with an  AAA system requirements",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Put all graphic settings to the lowest setting possible\nincreased the FPS limit to the highest setting possible\nFPS never goes above 30.\nEven when it's ugly as hell I still can't play this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Not worth it so many level walls make game no fun and you have to grind like a 9-5 job. overall such a terrible game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Negative review for now, but could easily be a 10/10 if they fix this one issue.\n\nI love this game. This game has so much going for it. The car customization is top-tier. Tons of parts, freedom to build whatever style you want. The map is also great, fun spots for both drifting and racing.\nThe graphics? Amazing.\n\nBut here's the huge problem: the steering wheel support (G923/G29 in my case).\nAt first, it feels fantastic, responsive, smooth, genuinely enjoyable. Then the moment I alt-tab, make a clip, or even just open the map.. The wheel goes from normal to feeling like wet noodles. No resistance, super weak, and then randomly stiff in weird spots. It becomes impossible to control.. The only way to fix it is to try opening the map couple times,changing the car, alt-tabing and if nothing helps, restarting the game.\n\nIt’s actually frustrating because the game proves it can feel amazing, but the wheel bug isnt fun. When it works, it's easily one of the best racing games Ive played. When it breaks, it’s not playable.\n\nI really hope the devs fix this, because the potential is absolutely there.\nUntil then, it's hard to fully enjoy with a wheel.\n\nIm not sure if this is a problem with the wheel support or suspension of the cars bugging? But if this gets fixed, instant 10/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its fun if kinda barebones but that is all fine, cars drive well and its a decently easy to get used to arcade-ish driving\n\nthe game looks kinda mehh but its to be expected it is after all basically a mobile game, but its decent tho not saying it looks horrible just kinda basic.\n\nthe sounds are not very good to be honest, there are ps3 games that had better engine sounds than this game but it gets a pass still since u will most likely be quick to recognize what revs ur running on the sound and such but its not really something ur gonna be cranking up the volume on to listen to the sound of,  the music im not gonna comment on since i usually turn it off\n\nthe livery editor was finally added and i tend to spend way too much time with that in games like this its a bit broken at times but perfectly usable, and u can also download skins others have made if u dont want to spend hours on making one urself,\n\nnow to the bad parts,,\nthe AI in this game might be the most BS ive ever seen i mean i get it the easiest way of making racing games harder is make the AI drivers a bit faster and all but this is kinda stupid, not only will they sometimes just reach supernatural speeds from a dig shooting up from 0-250kph in less than 2 seconds, but it seems to also be linked with u, so if u speed up using nitrous for example they will be right there at the same speed with u most of the time so it basically dosent speed u up it speeds up the world in a way,\nthen they will also punt u into anything that might be sticking out like curbs, cars, guardrails, traffic or anything like that, quickly u are going to want to ram them back and sometimes it works but other times its gonna be like sideswiping a nuclear bunker, and even if u do get payback sending them into a barrier its a dice roll if they will then decide to go warp speed and catch back up to u within a city block or if u will just not see them again,,\noh and btw if u think of corner cutting past a gate or something NOPE instant reset behind the gate, meanwhile AI can skip a good quarter of the track and not give a damn if they feel like it\n\nthe drifting is fun in the game but the drift races at least in my experience are broken, sometimes its fine other times the game decides to not count ur scores or even just slow count or something similar, not saying im some professional in drifting in games but it seems to me that i do 3 similar runs with vastly different results in score,\n\nonline well... u are either going to find a lobby of chill people drifting around or showing off their cars, or u are going to meet people with cheated cars that are finishing 1 min races in 10 seconds in my experience that seems to be the 2 kind of players that are most common at least\n\nwould i recommend this game depends vastly on what u are looking for, if u just want mindless driving about and making a car for urself just for a bit of short term fun yeah i would say its good i mean its only 20 bucks so its not really bad,\n\nif u are looking for somekind of nfs undergound successor or something along those lines a racing game to sink in multiple hours of intense and exciting arcade style racing,,, look elsewhere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is still bad and needs more improvements than focusing on combating cheaters; it's not a war or weapons fighting game. My rating for it now is 3.5 out of 10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought the game, Played a while, decent game, stops working, trying to fix and search around for 2+ hours since the game wont open, found a yt video, the fix is to unplug keyboard...\r\n\r\nDevs get your fucking shit togheter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i would not recommend this game the only real racers in there are running modded cars and then you lose your hard worked for car anyways the game had potientol but ended up losing the game to mods frfr this whats wrong with 90 percent of games now a days mods ruin them and yall let it for more money smh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have a high end custom built PC that can play all games with ease, this game is trash. 1st time playing and it ran slow with tons of graphical glitches (sinking cars, extreme graphical abnormalities and freezing). Next time I played it ran great, did races, upgraded car and made good progress. 3rd time and it was back to glitching again. Don't have time for poorly optimized games. DO NOT RECOMMEND",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was really fun when it was working, now i try almost every day and its just a black screen, haven't played the game in weeks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "disappointment. pop-in issues, physics I just can't get used to, unenjoyable UX. you can feel the mobile game DNA all over this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "awfull feel on car, ur in like railtrain without any chances to turn off. fix handling! racing game without proper handling is a joke.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wait for them to update the ai drivers. Game is fun driving alone or with friends but not against the ai.\n\nI beat the first 2-3 clubs, most races i was able to beat in the first shot\nbut then i got to C3 (class 3) - To a race that in 3 weeks of trying, I cannot beat it.\nNow, i'm an experienced driver in real life and on video games, i drive a 6 speed manual everyday im 36 been playing racing sims most of my life, starting with gran turismo 2.\n\nToday I came here to post that I have given up trying to beat this game, I consider it unbeatable in its current state without becoming actually angry with it just to beat it, which is unhealthy. Games should be relaxing and fun.\n\nI've never played a racing game where the most difficult thing about it was how dirty the ai drives.\n\nTheir cars are made of vibranium, because if you so much as touch their bumper you will do a 720 side spin into the wall at a faster speed than you were initially travelling.\n\nThey are the most perfect untouchable racers, taking corners at speeds faster than my car even goes.\nso you need to drift into each corner as they take it perfectly. just pray you don't graze their bumper and get sent back to the starting line. again vibranium. \n\nThe traffic, oh boy the traffic. - The ai will send cars spinning at you within 30 seconds of almost every. single. race.  Turn traffic off in the menu? Doesn't work. like at all, doesnt even change the amount of traffic. \nthe button literally does nothing.\n\nThere are transparantish gaurd rails during races through the city, but traffic is flowing like everyones going to work still so you're ripping through an intersection doing 140 - and Mary taking her kids to soccer practice in a red mini van will T bone you into getting lapped by the ai because they drive formula 1 cars shaped like honda civics i guess.\n\nI want to keep going but i dont even think anyone is gonna read this but if you do, i'm very serious the ai is trying to harm your mental health and you've been warned.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is a big piece of garbage, the worst money invested, when I start it, it doesn't throw any error and I can't learn in it, personally, I will never buy anything from those developers again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nice world but a awfull handling. Drifting without brakes is easier and more controllable than doing it with braking. Controlling the brakes is what drifiting its all about. It completely brakes the immersion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The only reason i have disliked this game is because i am having a technical issue that nobody has posted about and this issue is raised textures so if anyone knows how to fix this that would help or devs if you could patch this bug that would be great thanks in advance",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game crashed on a npc pink slip race and lost my car",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SAVE YOUR MONEY!\n\nI was looking forward to playing this game to just have fun driving sessions. Unfortunately upon entering the driver's seat I was immediately disappointed, the steering input was almost non existent. Just a slight input and the steering angle was already at max and I would have to use the e brake just to make a 45 degree turn. Afterwards I went to the tuning shop to adjust the wobbly body roll, and had to max out the stiffness just to keep it from rolling so much. It is visually unappealing to see a car rock back and forth with minimal input.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "stupid ai,this not race game but killing street racing , worse raing game mechanic,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "what a waste man, couldve put the money into actually hiring VAs. :/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it does not work for any controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All these damn time... They still haven't fix the damn garage room, where everything is pitch black, but you windows and headlights are all glowing neon green color. -_-",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "physics somehow got worse lmao.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "الخروج بعد لعب فتره بسيطه من اللعب لماذا .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "error game cant play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sucks cant play it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "PLEASE CLOSE ACE_BASE ? GET THE HECK OFF WITH YOUR ANTI-CHEAT NONSENSE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wheel buttons do not work on G293",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix optimisation and then I'll make a review",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Day 1 player. DO NOT WASTE YOUR MONEY. There are players who are personal friends with the devs. If you beat their time they will steal your tune and ban you.",
      "voted_up": false,
      "votes_helpful": 161
    },
    {
      "review": "Pretty underwhelming and disappointing experience over all\nBreakdown:\n\n---{ Graphics }---\n-Looks good at first glance, nice vibrant colors\n-Brightness is blown out to 11 and no way to turn down. Really infuriating considering you can't see things like racing lines or upcoming turns\n-Considering this is an open world game, once you stop to look around, everything is fairly dull with no life to it\n\n---{ Gameplay }---\nThe Bad\n-serviceable at best.\n-Can't decide between realism and arcade driving, having a very frustrating mix between the two\n-AI (both other racers, and peds) are truly brain dead. Either they are the most difficult thing to deal with, or you absolutely blow them out of the water. It seems like they're set to follow a path and avoid Peds, but have zero consideration for the player racing. I get the game has some \"dirty\" driving and hitting/pushing cars is part of it. But I can't even count the amount of times at this point that the AI has just slammed into me full speed as if it didn't even know I was next to it\n-AI difficulty seems to drop off entirely (90%) of the time after the first 30 seconds of a race. Once you take the lead, and gain a few seconds, its like the AI get's frustrated and gives up.\n-The map is fun for about 30 minutes of driving around. Then at that point, I can guararentee you'll be fast traveling everywhere, even to locations that are right next to you. There really isn't anything interesting on the map to incentivise the player to drive from location to location. There are some collectables, but I honestly just find it annoying to search for them. You'll see a parking lot and a message that says \"collectable near by.\" It would make too much sense for that collectable to be hidden amongst cars in the parking lot, or on top of a parking garage, but no, instead it's randomly on the corner of some dirt road.\n-Race lines are LAUGHABLE. They are terribly optimized both in placement and braking indications. I'm more often then not, not following the line because it's literally slower. Or the countless amount of times that the braking indication tells me to start braking way too late or way too early.\n-Nitrous feels literally useless 90% of the time. Incredibly often, I'm blasting through my nitrous only to look at the car next to me maintaining the same speed as me. What's the point of nitrous if when I use it, my opponent AUTOMATICALLY gets nitrous too? Literally the only use for it is coming out of corners to get back up to speed, but only if you know that your opponent is not in the middle of exiting a corner.\n-Drift events feel like way less than an after thought. It feels like the came up with the idea of drift events in 30 seconds in the board room. just plop you in a parking lot and tell you to spin until you get points. No interesting obstacles or paths to follow.\n\nThe Good\n-A lot of cars\n-Good upgrade paths\n-Upgrading cars is decently fun\n-I like the inclusion of needing tires and gas stations\n-A lot of races to play through\n-Daily races\n\n---{ Audio }---\n-Audio is okay no real complaints regarding vehicle sounds outside of variety. Most cars kind of just sound the same. Changing exhausts doesn't change the sound of the car (that might be asking much, however).\n-Most of the sound track slaps, ngl\n\n---{ Audience }---\n-Young adults\n-Teens\n-JDM fans\n\nIf you are a fan of JDM car culture, I will say, most of your enjoyment out of this game will probably come from unlocking new cars and customizing them. It is a well done feature in the game. There are cool body kits, a good livery section, and a lot of small things that can be personlized\n\n---{ PC Requirements }---\n-I have a high end computer and maxing this game out entirely on 1440p causes no issues. I have my game locked to 165hz and don't seem to dip below. Game is definitely well optimized from what I can tell\n\n---{ Game Size }---\nAverage, maybe even a little less so, which is a good thing\n\n---{ Difficulty }---\nDifficulty obviously scales, but I would say the game is not difficult. Most of the difficulty comes from frustration from the things I've complained about above (Poor AI, weird mix of arcade and realism, blown out brightness, useless NOS, etc). These things make the game difficult, but in a completely unrewarding game. I'm often met with challenge that just leaves me mad at the way the game is built, instead of me telling myself that I need to improve,\n\n---{ Grind }---\nGrind is pretty solid. No real complaints here. Standard racing game grind. Race to get money, use money to buy or upgrade cars to win more money from races. Usually, once you enter a club, you'll want to upgrade your car to the max of that class. By the time you win all the races, you'll have enough money to buy a new car and upgrade it for the next club, which is definitely a satisfying loop. It makes the goals for racing good, clear, and worth doing (instead of just freeroaming the map). Depending on how or why you bought this game, it could be a good or bad thing. However, as mentioned, I think the free roam is pretty underwhelming and dull, which makes the race grind the only real fun thing to do (which is fine, considering at it's core it is a racing game).\n\n\n---{ Story }---\n-If you're playing a racing game for the story, find another genre to play.\n-With that being said, the club leaders and characters are laughibly cheesy and I have no desire to hear what they have to say. Thankfully you can end phone calls.\n\n---{ Game Time }---\n-I'm sure you can get plenty of game time out of this game considering the amount of cars and unlocks, but being 16 hours in, I feel like I'm already over the game and it's grind. Considering how, in my opinion, boring the actual open world aspect is, there isn't much of a reason for me to play this outside of something like FM7 or even FH5. They're very similar in the grind, but at least with FH5 there is substance in the world. With FM7, there is no free roam, however it's strickly focused on cars, tracks, and upgrades, which lends itself extremely well to the grind. To me, the map and free roam would be the only reason to play this over those other two options, but again, the free roam is soulless.\n\n---{ Price }---\nPrice is fair, however I would only recommend picking up at half off. You get a lot of content for $20, but the game is simply not interesting enough to hold my attention to experience all the content.\n\n---{ Bugs }---\nI haven't ran into too many bugs outside of AI racers completely glitching out remaining stationary for the rest of the race. Considering my frustrations with the gameplay, I gladly embraced this bug and would take the free win.\n\n---{ Replayability }---\nAs mentioned in game time. There is a decent amount here, but IMO, even if you unlocked all the content, it would likely be an uninstall after that. There are daily races and events, but they're really not that much different that what you would normally find on the map.\n\n---{ Microtransactions }---\nI think this game only has paid DLC, which I do appreciate\n\n\n\n\nI could only rate this game a 5/10. Pretty map that gets boring quick. Good grind, but frustrating gameplay. There are much better alternatives to this title for (probably) similar price. If you can pick it up on sale for half of, a good bargain, otherwise, as a racing game fan, I cannot recommend this game",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "This is possibly one of the worst and good games Ive played. Let me explain.\nStarting with the good, map is beautiful.. to die for. Way better than any other game I've played so far. Physics is fun on controller not so much on a wheel. Love there are proper touge roads. Great customization options. Economy is not too bad, they fixed it over time.\n\nLets get to the bad. ITS BRAIN DAMAGING, ILL EXPLAIN. THE AI. ON A CONTROLLER ITS SO HARD TO DEFEAT THE AI RACERS. WHAT ABOUT WHEEL PLAYERS???? DEVS DO YOU REALLY CARE ABOUT OUR MENTAL SANITY? THIS GAME PROMOTES \"ROAD RAGE\". EVEN ON A CONTROLLER I HAVE TO EITHER SMACK THE AI INTO TREES OR \"ROCK HARD BUSHES\" (which are supposed to be pass through). You devs really NEED to sit and play the races for yourselves against the SHIITY BRAINDEAD POS SOB DUMB RAMMING RUBBER-BANDING LIKE THERE'S NO TOMORROW AI in your races. Even with EXTREME builds its really ROUGH on \"EASY MODE\". CAN YOU TELL ME WHAT \"EASY\" MEANS? YOU DEFINITELY DONT KNOW ABOUT IT. ON MOBILE MAYBE THIS GAME IS ADVANTAGEOUS IN TERMS OF SPEED BUT ON PC ITS TRASH. \nI LOVE COMPLETING GAMES THAT I BUY. BUT FOR THIS SWEATY AS HELL AI, I QUIT. OTHER GAMES HAVE A SIMILAR ISSUE, BUT THIS GAME ITS AN EXTREME ISSUE.\n\nYOU ARE FORCED TO USE ONLY SPECIFIC CARS AT TIERS TO WIN RACES, OTHERS SITTING AT THE SAME CLASS ITSELF CANT DEFEAT THE RACES. SO DUMB. NERF YOUR AI DOWN. HOLD YOUR AI BALLS, THEY TAKE CORNERS OF 70 kmph AT FUCKING 150 kmph. RUBBER BANDING AT ITS FINEST. DURING A RACE THERE SHOULD ATLEAST BE 10 SECONDS OF PEACE, BUT NO ITS JUST ABSOLUTE TENSION AND ANXIETY ATTACK THE WHOLE TIME. TBH I JUST FEEL SO STRESSED FROM MY MIND, IM NOT PLAYING THE RACES ANYMORE I CAN'T HANDLE MYSELF BEING SO DAMN STRESSED ABOUT GETTING RAMMED, SMASHED INTO BARRIERS OR BEING TAILGATED OR GAPPED BY MILES, THE WHOLE RACE.\n\nWORST AI EVER, I THOUGHT The Crew Motorfest WAS THE WORST BUT THIS GAME BEAT THE RECORD, ITS CURRENTLY THE WORST OF AI RACERS. NERF. THEM. DOWN. my mind is absolutely damaged because of the stress of races at any tier class, IM DONE.\n\nSteam Achievements is also broken, I randomly got like 15 popups of achievements when I didnt do shit.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "CarX Street feels like a mobile port with PC settings slapped on top, yet somehow it demands more hardware than Forza Horizon or The Crew Motorfest. The visual quality just doesn’t match the system requirements. Even on solid mid-range GPUs, the game struggles with frame pacing, stutters, and noticeable drops in busy city areas.\r\n\r\nThere’s potential here, but the optimization is nowhere near where it needs to be for a proper PC release.\r\nPlease focus on performance - the current state is unpleasant to play, even though the core driving physics are solid.\r\n\r\nRight now you get mobile visuals with an  AAA system requirements",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Tried it during the free weekend, an okay AA game with blatantly lazy use of A.I. for \"voice acting\" and various pieces of artwork in NPC portraits and customization stickers. In my eyes, the use of A.I. in this case does not enhance the experience whatsoever and would I would preferably have literally nothing instead of it.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "if you can look past all the generative AI in this game you will be rewarded with an extremely mediocre racing game experience",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Honestly do not get this game unless its on sale (goes on sale for like 8.99 every summer / winter sale) the ai in this game so bad i pass the ai and it turns clips my car and i go flying but when i clip the car it dose not even move witch is not that bad since its kinda the same gt7 but what makes it bad is the traffic and i know its a street racing game so ofc there gonna be traffic but omg i cant go one second without a car spawning infront of me like one second its not there the other its fading into existence then when i crash into a traffic car i fully stop and cant even respawn but when the ai racer crashes into a ai car it ether pushes right through it and keeps most of its speed or it fully stops but respawns instantly anyways get the game during a sale unless you think the 20 dollars is worth it and you can handle the ai sorry for no periods i dont fucking care have a good day",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "[h3]The controls are bad, optimization is 0. With mediocre graphics, the game dont give normal fps. The settings dont work. I turn off the subtitles - they dont disappear anywhere. \nJust play any old NFS.",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "This plays like some ragebaiting middleground between arcade and sim racer, cars understeer and fly out of the road from hitting curbs and the game microstutters constantly",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "This is one of those cases where a 'neutral' review option would be great.\r\n\r\nCarX Street isn't terrible. It's not great, either. It sits somewhere in-between, and how much you'll enjoy it depends on many things.\r\n\r\nFor one thing, there's a wide variety of cars in the game. And tuning options, so, so many tuning options.\r\n\r\nBut there's also a lack of certain options (controls, for example) as well as very janky physics when using a controller. I had purchased this game some time ago and ended up refunding it due to bad performance and major gamedesign and balancing issues at the time. Now I go to play it for a couple more hours thanks to the free weekend promo. And once again I was just about to give up on the game when, on a whim, I decided to give it a try using my Logitech G25 and SHH Thorn Shifter.\r\n\r\nMuch to my surprise, not only did the game recognize all of my devices (I have a Symprojects GT Wheelplate with four extra buttons mounted to my G25), but the FFB out of the box was pretty damn good. Not AMS2 levels of good, but much better than you'd expect from this sort of game. Sadly, there's no support for headtracking like TrackIR, though - that would be great to have.\r\n\r\nThe downside here is that there's not much in the ways of configuring the FFB, either. So aside from its strength, what you see is what you get.\r\n\r\nWhile the performance has considerably improved since the early days, it's still not optimal and a little inconsistent. Even worse, the game just doesn't look all that good. The visuals and entire aesthetics of the city give strong PS3-era vibes, IMHO. There's also no DLSS, FSR or XESS - the \"best\" anti-aliasing you get is TAA! And don't get me started on the texture filtering... Whenever you view a surface at an angle - like the road surface, for example - it just gets all blurry. Yikes.\r\n\r\nMoreover, the game has some weird design choices. Paying for fuel and tires, I'm okay with that. Each set of tires (5 complete sets per purchase) last quite a while, as does gas. But having to pay to get a car into each of the clubs in order to partake in their races - using that particular car - and then having to pay that fee again if you happen to switch clubs with that car is just... Stupid. It doesn't make sense.\r\n\r\nAdditionally, the races can be hit and miss. Sometimes the experience is utterly fantastic - you fight hard to evade traffic, then you run wide in a corner, have cut through a parking lot and just pray you'll fit through that gap between parked cars to get back onto the road... Oh so satisfying when it works.\r\n\r\nAnd then you get T-boned by a truck coming at you from a blind spot at a 100+ miles while you are trying to go around a corner. Or pushed off the track by the relentless AI. Again. And again. (To be fair, AI drivers also get into accidents, so the traffic can be a curse or a blessing to the player, depending on how well you manage to evade it.)\r\n\r\nAnd drifting... Oh boy, it's bad. First off, the game starts you off with a couple of cars that are just completely unsuited for drifting due to a lack of power. And you don't have much in terms of upgrade options early on. And apparently the game only rates the maximum angle of your drift, with no consideration for speed or anything else. Using a controller, I found proper drifting impossible no matter which of the three modes (full assists, partial assists, no assists) I used. But contrary to driving and racing it's still not much better with a wheel, sadly.\r\n\r\nThe game also feels very grindy early on. The starter cars have horrible handling and bad performance, and it takes a while until you unlock and can afford your first C2 (the second class) car, which is somewhat better already.\r\n\r\nLast but not least, the game also still lacks in the audio department. Engine sounds aren't all that great, IMHO. And what little dialogue there is in the game is AI generated.\r\n\r\ntl;dr some parts of the game (tuning, racing) can be fun - especially when using a steering wheel and H-Shifter - performance and visuals are mid at best, audio is somewhat sub-par, and there are still various strange choices in terms of game design. I'm keeping an eye on this, as the developers are known to keep working on their games for a long time to squash bugs, add content and features and generally improve their product on the long run (see Drift Racing Online for example).\r\n\r\nRight now, though? I still can't fully recommend this game (yet).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Put all graphic settings to the lowest setting possible\nincreased the FPS limit to the highest setting possible\nFPS never goes above 30.\nEven when it's ugly as hell I still can't play this.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I play with a controller, I tried with no assistance at first, but later set to low. Normal difficulty. Played during Free Trial.\n\n95% of this game is trying to figure out how to stop understeer. Handling and taking corners in this game feel like balancing a double pendulum. You can have grip for a second then suddenly you are understeering your way halfway across the pacific ocean. You try to relax for one race and the first corner will have you understeer onto the set of Maury being told you are the father of a child you didn't know you had. It's actually insane how hard it is to both tune and control [b]EVERY[/b] car in this game. Weight of the cars don't seem to do anything either other than inflate you car score so you can have a car that's slow and [i]still understeers[/i].\n\nIt's also apparent what one of the issues is: you can turn your wheels to full lock at [i]any[/i] speed. Most games will limit steering input based on speed. Not surprising if you get understeer when you go full lock at 300km/h. Unfortunately, there is no thumbstick linearity or sensitivity setting to help alleviate this, so you literally have to play within [i]millimeters[/i] of your thumbstick. Move your thumbstick 1mm too far and you will understeer right into the International Space Station.\n\nThis game, as of this review, has solid progression on normal difficulty, and the parts system they carried over from DriftX is as good as it was there. Even the AI, while aggresive, aren't that bad. The map is pretty neat, and has good vibes overall. The handling system works great for Drifting, because the devs clearly have experience with making  \"drift physics\" feel good.\n\nHowever, on the sole fact that you have to spend so much time just trying to learn and make a car turn without understeering, I simply cannot recommend this game. Truly, if you have the patience to tune and fiddle with every car you earn, this might be a fun game for you. If you wanted a casual, relaxing, arcade racer, this simply isn't it. It's so bad, I'm debating whether to buy this for a measly $10.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Horribly unrealistic handling and physics to the point where it's unplayable for me.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "CarX Street is just.... not very good. It's definitely not a complete writeoff, so before i get into the negatives let's go over the positives:\nThe car handling is actually pretty fun (once you learn how to properly tune), the customization is really in-depth and rather amazing, the car selection is really varied and the map has some very nice roads, especially in the countryside with the quick elevation changes (something that has been sorely forgotten by the modern AAA racing games for some reason).\n\nSounds like a perfect base for a NFS-like right? Well.... unfortunately no.\nTo start off with, the new player experience is horrible, and i'm not surprised seeing the negative reviews about handling with an hour or two of playtime. The tutorial tells you basically nothing other than the very basic basics and leaves you with a starter car that's built to handle like a tank. If i didn't have a friend guiding me along, i would have probably dropped it within the first two hours as well, but luckily i was told that changing tires to racing+, and buying some downforce parts turns the handling from a tank, to how you'd expect the car to actually handle. And this is not just a problem with the starters, basically every stock car in this game handles horribly and nowhere are you told that these parts are essential for basically making the car driveable. This combined with the very clunky menu and UI design just makes for the worst intro to a racing game i've had in a while.\nBut alright, once you get past the handling, you realize that the game is actually horribly empty. There is no real story to guide you along, it's just \"Here's 15 races, finished off with a \"boss fight\" against the club leader which you have no attachment to, that ends with a phone call saying \"Good job\" and now onto the next set of races\". Not to mention the horrible AI slop art and voice lines used for the bosses (which is not disclosed anywhere on the store page mind you). This just makes the game feel awfully boring to play, since it's just race after race after race, with no real variety nor motivation to keep going, and it starts to hit like a truck once you've gone past the 3rd copy pasted club and realize the game has nothing more to offer.\nI also have to give an honorable mention to the soundtrack, which is impressively even worse than Unbound, by a rather wide margin. Every song is genuinely horrible, and my experience was improved massively by turning it off and just putting on Spotify. I could stomach Unbound since it had a few decent songs, but this one was a new low, congrats i guess?\n\nOverall, there is a good base for a racing game here, but that base is buried under a pile of mistakes that are just too glaring to ignore. Can't even say it's worth it on sale, but worth trying on a free weekend.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "[h2] TL;DR Could be decent but is ruined by terrible handling model. [/h2]\n\nNot going to even get into other aspects of the game. How driving feels is as fundamental in a racing game as shooting and movement in FPS's. Anything above traffic speeds causes massive, massive understeer. This is true for cars no matter if they're FF, FR or even MR, and on grippy tires, and with crazy stiff antirollbar tunes etc. \n\nIt is pretty much impossible to initiate drift with anything but the handbrake, and during a drift cars countersteer automatically to such a degree that you have to keep turning INTO the drift with throttle pinned, and sometimes even that isn't enough to prevent from straightening out - this happens despite Countersteer Assist being turned off. \n\nThere is a separate Steering Assist, and turning that off stops auto-countersteer, at the cost of removing ALL of it. This causes the steering to be hardwired to thumbstick position, making the car behave like the suspension had no caster at all. Now the car feels very twitchy where small inputs will lead to extremely hard to control fishtailing, while the understeer issue remains. \n\nIf you have the most basic idea how real cars behave and expect similar behaviour ingame, this is not for you.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fuel use and tire wear in an open world arcade racer is INSANE work. are we dumb?\r\n\r\non top of that, not very engaging. game is too easy even on hard, audio quality is awful, they didn't bother to do voice acting, and the \"CarX Technologies Physics(tm)\" is Not Great(tm)\r\n\r\njust makes me want to go play NFS and i'm a known NFS hater",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game wont even launch on my PC tried so many different things and watched videos on \"fixes\" that never worked. Would not recommend until they get it sorted out. Found no support from devs and other reviews and forums show lots of other people with the same problem and no real fix",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I didnt spend more than 2 hours on this game, i also played a demo of it but the game was fully out. what A SHITY experience, this game is all AI, the voice lines, the map, the cars, and i might say the physics and graphics are ai by how they feel and look. this game is very physics based for a racing game but its problem is that it wants to be like need for speed, so it doesn't work AT ALL. The graphics look alright but not anything great for a 2025 game. The buttons feel really delayed. overall terrible experience 4/10.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I would not spend money on this game.\n\nFirst big reason is the early game. C1 and C2 are incredibly difficult; where your victory in those classes will essentially come down to transmission gearing. In my case, because I was too low of a level to swap transmissions, I had to buy 2 different vehicles with different gearing in order to find success. I eventually found it, and that made the racing feel very competitive. At those low classes; every car understeers like crazy. There is very little you can do about it. Every car also feels very unstable at high speed; however as I am not really seeing that in other reviews, that could just be a skill issue on my part. \n\nVehicle classes are determined by power to weight ratio; which I think is very good. This leaves a lot of room for suspension and handling upgrades without upping your vehicle class which I really like. \n\nThe next big reason that I would not spend money on this game is it's heavy reliance on AI generated assets. All of the character portraits are AI gen, most of the artwork found within the open world is AI gen, I could be wrong but the voice acting also appears to all be AI gen. The first 30 min-hour of the game is very dialogue heavy, and the voice work was so grating that I skipped all of it. I can tell you nothing about the story and world building because the voices are so aggravating to listen to. \n\nI read a lot of the reviews about the game performing poorly; however that was not the case with me. During the intro cinematic, my game was stuttering awfully; however once that cinematic was over my game has had absolutely 0 performance issues. The initial load time is very long, however once you get past that and into the world, the game has pretty quick loading times. So; your mileage definitely seems to vary in this department. \n\nThe city is pretty fun to explore; however it does lack a cohesive identity. Some parts feel like they are ripped straight out of Japan, and other areas feel like the US midwest. It is very, very strange. \n\nExploration of the city is nicely rewarded; with the simple act of freely roaming the map granting you small amounts of in-game currency. The collectibles are pretty easy to find, and they are very well rewarded. \n\nIt is rather grindy for currency; however I have found that participating in the vehicle deliveries is a very nice and not mind-numbing way to grind for currency. You get a low amount of currency simply for completing the delivery, however you can still collect the free-roam collectibles. This allows you to experience a wide variety of vehicles at no cost; and also netting you anywhere from 5k-30k per delivery depending on how many collectibles you run into along the way. Obviously this doesn't work long term as there are a finite number of collectibles, however it has been very nice for the early game as I try  a variety of vehicles to get through the difficulty of C1 and C2. \n\nVisually, the game looks good. What I like most in racing games is the ability to customize; which is why I will probably continue to play this game during the free weekend. CarX as a company are very good with the ability to customize vehicles. \n\nUltimately; my lack of recommendation comes from the reliance on AI generated content; and the early game vehicle performance. Those both combined have made for a very exhausting 4 hours.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played the game during a free weekend, I had the game wishlisted for a while now and gave me a chance to try the game instead of buying it to find out how it is. I played for a total of 4 hours and beat the first club, my experience was around  lukewarm to bad.\n\nThe driving mechanics are overall okay, tho driving around doesn't feel fun. The racing is okay-ish, tho the only interesting route/circuit was during a \"boss battle\" (a race against the first race club boss). There is a racing line that goes over the pavement when on a race, it changes colors from blue to red depending on whether I should break or not (just like in forza horizon) but I noticed that it doesn't change color when it should, instead it goes red when I begin to break regardless of there is a curve or not. Also, said racing line becomes imperceptible when there is sunlight shinning on the pavement.\n\nThe game is open world, and the world map is very important. Now, this is the worst aspect of the game for me. The city doesn't have identity, it doesn't know whether it's Chicago, LA, Dubai, Tokyo, San Francisco or Seoul. It all feels like a giant Unreal Engine asset flip, and I'm sure it is. There are these giant AI generated \"street art\" pieces in every other building that doesn't look like street art but more like a giant colorful sticker someone put there. Overall it all feels extremely fake and unpolished, it's like an amateur \"dev\" made an open world fan mod for CarX Drift.\n\nThe graphics are fine, acceptable, but it could be polished a lot more and needs optimization. The cars models are good, but the rendering make them look plastic. The customization seems fine. Didn't try much of fine tuning since I didn't get to unlock the \"very tunable\" parts.\n\nThe rest of the presentation is bad, you open the game and you're greeted with a very badly voice acted voice-over of your friend who's hit it big on the street racing and he's welcoming you to the city. The rest of the voice lines in the game aren't as bad but I'm sure they're AI as well, which keeps piling up on the \"fake\" vibes of the game. The character portraits are AI as well.\n\nFor having so many people listed on the credits it feels unfinished. Not worth 20 USD.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The first few minutes of a game are important for hooking me in. So when you start it with AI voice non sense and generic, annoying writing then we got an issue. The audio quality of the engine noise is poor at best and no amount of cool back fire will hide that. On the other hand the models are pretty damn good. Not worth my time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i played it for 15 mins, thought it was mid, uninstalled and an hour later i got like 7 achievements for zero reason whatsoever, i dont use SAM or anything like that, cool ig?\n\nstill kinda mid tho, also ai usage is very yucky.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Constant stuttering, avg of 40 fps when the stutters stop, AI at higher difficulty and levels tends to either rubberband like most wanted cops or teleport if they fall behind too much, buggy UI, slow progression, I had to grind the game for a whole day to unlock the car i wanted. Only good part was the fact that it doesnt use the dogwater UE5 like other games nowadays and the free weekend. With its current state the game should be free, especially because it has several DLCs that could easily be main game content",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Decided to try it because it was free this weekend and the only good thing about this game I could find was the fact you can skip the dialogue so I didn't have to listen to the AI voices. On top of that the physics, somehow feel faker than the voices. I genuinely cannot express how disappointing this game is to play when I have NFS or Forza Horizon to play instead. I don't normally do reviews but this is the worst steam game I have ever put 10 minutes into and it genuinely pisses me off how abhorrent this game is. Any other game that uses AI I have played at least has the decency to have decent gameplay and yall couldn't even do that. Hope your studio learns to be better. Also the starter cars look hideous just give me a stock miata, man (which btw, if you want non stock cars with tons of stickers as the starters and want them to look cool, hiring an artist will help with that because slapping AI stickers all over a car doesn't make it look cool :3c).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I refused to buy this game when it released because of the AI generated content all over this game and since the game was free for the weekend I decided to give it a shot and honestly its worse than I expected.\nBtw before someone tells me its a minor aspect of the game and doesn't affect gameplay, it shows a very bad precedent of the dev team's ethics as a company. It tells me they don't really respect actors and artists and its a slippery slope, especially if people defends it.\n\nThe game was originally a mobile game and you can tell with how the game is structured, you get an intro with AI dialogue and AI \"babes\" and then you basically just grind levels and money forever. The steering feels kinda awkward and there's a ton of vague settings to \"improve\" it, but its just not really fun to drive in this game. The map is okay, its a bit weird and disjointed, but its not bad. I cannot for the life of me figure out if the music is AI or if its just some bland soundcloud sample based electronic music.\nNone of the cars are licensed which I'm honestly fine with, I think car licensors are scummy and are responsible for most racing games getting unlisted.\n\nOverall this game is just a poor man's NFS Heat, there's so much better out there. Especially if you dig through 6th-7th gen racing games. This is just slop.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I can't say this is a bad game - I like the handling, camera and the UI, which is more than I can say about some popular racers.\n\nThe only reason I hate on it is the AI generated character portraits, and lifeless ones at that. I despise this timeline.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "type of game i would buy and refund. I expected more from the CarX team considering they made a fine drifting game, but this game is so underwhelming it's crazy honestly considering the price tag off sale. The car has either extreme understeer, to the point where it makes the game extremely not fun, or it feels like I have a mcdonalds tray under my wheels while understeering like crazy. The handling and the fact i felt lost 10 minutes after the tutorial make me not want to continue playing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible. Way too drifty. All I did was adjust some minor settings before starting the intro for the second time. First five minute play through consisted of me getting to the first race after picking the horrendously drifty Mazda (my fault I guess for not paying strict attention to what the woman was saying about the car being drifty). I thought the car would have the typical drift of a loose car and not that of a yo-yo. Tried to restart with the new adjusted settings which made the Porsche twist like a banana. This is a drifting game perhaps with the copied aesthetics of NFS U2 and nowhere near the quality unfortunately. Sad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The trailers give off a lot of NFSU2/NFSMW vibes. If you install the game hoping for a modern version of those you'll be disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you want to play a game that only gives you a black screen and nothing else, CarX Street is a true masterpiece! The black screen graphics are top-notch, FPS is stable (always 0), and the sound doesn’t exist – pure silence, just like the devs ignoring their community. 👏\n\nJokes aside – this is a broken mess that doesn’t even launch. The devs should admit they sold a defective product.\nDon’t waste your money on this crap, unless you enjoy staring at nothing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "most overpriced piece of sh*t ever . sh*t graphics . Sh*t drifting and feel to the game dont get unless you want to have a reason to play forza",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Like a lot of street-based racing games, you race to earn money to upgrade your car and purchase/upgrade other cars. But only in CarX Street do you have to pay money every time you want to switch to a different car.\n\nYes, you have to pay money to switch to other cars you bought. Every time. Wanna do a drift race, but you're not in your drift car? You pay money to switch cars. After the drift race, you wanna do more street races, but you're not in your street race car? Pay money.\n\nThat has to be the dumbest thing I've ever seen in a racing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cons of CARX STREET\n1. No preset traction and drift settings.\n2. Engine parts disappear when replaced.\n3. You can't remove a part and move it to your inventory.\n4. Payment doesn't increase with each delivery.\n5. Unique color bug: all slots have only one color.\n6. There's no free teleport when you unlock the entire map, teleport points, or place about 20 billboards. Collecting them all will give you a free teleport. The same applies to gasoline (20 canisters throughout the map), nitromethane canisters, and tires (20 locations on the map).\n7. Each car doesn't have its own default gearbox. All cars are the same.\n8. No radars, speed sections, drift zones, etc. There should be some kind of bonus or reward for earning each star multiple times. 1 star is 3,000 coins, 2 stars are 6,000, 3 stars are 9,000, and maybe 1 gold.\n9. Rewards for replaying a race are too low. It would be nice if the rewards were permanent.\nFixing these issues won't ruin the game. It's already big, with a lot of content, and people will spend a lot of time playing it anyway. These issues make the game feel unpolished and discourage players, which is why sales are declining. Fix these issues, and sales will increase.\n10. Blueprint parts are only for one car, it would be possible to install them on all cars, and for their price to be in green currency, and for them to be 4000 more expensive than the most expensive regular ones",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Go to the steam store, pick any open world car game available that isn't CarX Street.... BOOM, you've now found a better game to buy instead of this!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Feels soulless compared to other open world racing games considering the NPCs are all AI voiced and generated. Cars handle terribly. Save your time and money and play another racing game haha",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To be honest im scrapping my entire previous review. i dont understand this game at all, its amazing for the price UNTIL c4. granted you can always stick to c3 and under nomatter what, but like..why would you want to if you dont have to given the cars are slower and the money per race is less. basically after c3 aka c4 - 6. the cars handle very weird, every car needs tuned different or it just doesnt even turn at all and acts like youre an old muscle car on drag tires. Nomatter how much money i dump into a car ( up to 1 million dollars ) into parts and tuning it time and time again, im hitting 192 mph in a lamborghini, and 200 mph in my corvette  and im still getting passed while using nitrous mind you, by a honda civic or s15 silvia. the AI cars weigh significantly more then yours, and even on EASY the only real way to win past c4, because yes, even on easy they still are the exact same speed and nonsense as on hard, it doesnt make any difference gameplay wise, is to play dirty and hope you have an opportunity to clip them in the rear fender, to spin them out and then block them when they try to pass or else its GG. as they can tap your car and you fly into the wall, but you can hit them and they stand still and continuie going in a straight line, UNLESS you hit the rear fender or hit thm while they are stopping for a turn youre screwed, and, to make things even worse t3 on normal difficulty gives you more money then t4 on easy, without all the extra bull$@<@ involved. Before t4 you can actually easily gap the AI with a good tune and cars if you take your turns right and are a even ill say decent racer. On t4 - 6 its just nothing you do matters, i mean, i really cant even comprehend that logic.  In what world does a tuned car pushing 192 get gapped by any car in the same class range,  when 200 in c4 is already considered extremely high top speed. Out of all the cars i tuned and maxed out 185~ is where i sat on LONG straights, if that, so how do i get gapped at 200?!?!?!? I mean check my hours in racing games, this is the ONLY one i played with this massive issue. It makes unbeatable drivatars on forza h5 seem like youre using training wheels. Absolutely absurd",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Saw the game during a free weekend and decided to give it a try. I was honestly hyped, the game looked fun, and seemed well polished. The first thing I was met with when loading the game was an AI voice then an AI generated character. Genuinely disappointing.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Not worth it so many level walls make game no fun and you have to grind like a 9-5 job. overall such a terrible game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Negative review for now, but could easily be a 10/10 if they fix this one issue.\n\nI love this game. This game has so much going for it. The car customization is top-tier. Tons of parts, freedom to build whatever style you want. The map is also great, fun spots for both drifting and racing.\nThe graphics? Amazing.\n\nBut here's the huge problem: the steering wheel support (G923/G29 in my case).\nAt first, it feels fantastic, responsive, smooth, genuinely enjoyable. Then the moment I alt-tab, make a clip, or even just open the map.. The wheel goes from normal to feeling like wet noodles. No resistance, super weak, and then randomly stiff in weird spots. It becomes impossible to control.. The only way to fix it is to try opening the map couple times,changing the car, alt-tabing and if nothing helps, restarting the game.\n\nIt’s actually frustrating because the game proves it can feel amazing, but the wheel bug isnt fun. When it works, it's easily one of the best racing games Ive played. When it breaks, it’s not playable.\n\nI really hope the devs fix this, because the potential is absolutely there.\nUntil then, it's hard to fully enjoy with a wheel.\n\nIm not sure if this is a problem with the wheel support or suspension of the cars bugging? But if this gets fixed, instant 10/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its fun if kinda barebones but that is all fine, cars drive well and its a decently easy to get used to arcade-ish driving\n\nthe game looks kinda mehh but its to be expected it is after all basically a mobile game, but its decent tho not saying it looks horrible just kinda basic.\n\nthe sounds are not very good to be honest, there are ps3 games that had better engine sounds than this game but it gets a pass still since u will most likely be quick to recognize what revs ur running on the sound and such but its not really something ur gonna be cranking up the volume on to listen to the sound of,  the music im not gonna comment on since i usually turn it off\n\nthe livery editor was finally added and i tend to spend way too much time with that in games like this its a bit broken at times but perfectly usable, and u can also download skins others have made if u dont want to spend hours on making one urself,\n\nnow to the bad parts,,\nthe AI in this game might be the most BS ive ever seen i mean i get it the easiest way of making racing games harder is make the AI drivers a bit faster and all but this is kinda stupid, not only will they sometimes just reach supernatural speeds from a dig shooting up from 0-250kph in less than 2 seconds, but it seems to also be linked with u, so if u speed up using nitrous for example they will be right there at the same speed with u most of the time so it basically dosent speed u up it speeds up the world in a way,\nthen they will also punt u into anything that might be sticking out like curbs, cars, guardrails, traffic or anything like that, quickly u are going to want to ram them back and sometimes it works but other times its gonna be like sideswiping a nuclear bunker, and even if u do get payback sending them into a barrier its a dice roll if they will then decide to go warp speed and catch back up to u within a city block or if u will just not see them again,,\noh and btw if u think of corner cutting past a gate or something NOPE instant reset behind the gate, meanwhile AI can skip a good quarter of the track and not give a damn if they feel like it\n\nthe drifting is fun in the game but the drift races at least in my experience are broken, sometimes its fine other times the game decides to not count ur scores or even just slow count or something similar, not saying im some professional in drifting in games but it seems to me that i do 3 similar runs with vastly different results in score,\n\nonline well... u are either going to find a lobby of chill people drifting around or showing off their cars, or u are going to meet people with cheated cars that are finishing 1 min races in 10 seconds in my experience that seems to be the 2 kind of players that are most common at least\n\nwould i recommend this game depends vastly on what u are looking for, if u just want mindless driving about and making a car for urself just for a bit of short term fun yeah i would say its good i mean its only 20 bucks so its not really bad,\n\nif u are looking for somekind of nfs undergound successor or something along those lines a racing game to sink in multiple hours of intense and exciting arcade style racing,,, look elsewhere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "only played on the free weekend will not buy it, except for the club races which are only a few all other races have no opponents, only a rating that places you from 1st to last at the end, this gets boring very quickly, the tuning of the cars are not straight forward at some parts, is this going to make my car acceleration, top speed better? dont know, buy equip and find out, is this gonna make my car drift more? find out later, talking about drifting its extremely annoying that the game pushes you to do drifts or you will be stuck doing sprints for just a few bucks, and you have to have more than one car one for sprints one for drifting, spend more of those precious bucks, at the end of the day its a boring grind with clunky mechanics and ok but not great graphics, if you turn on the dlss it gets all blurry by the way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "holy crap, i dont know if its easy anti cheat or what i kept getting stuck at the start loading screen",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was hyped to play this after loving Carx Drift but this is borderline unplayable. Its cool if you like arcade style handling. graphics are pretty good though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ai is to overpowered difficulty set on easy and i still need to play sweaty. i recommended not to buy this game play need for speed instead. if they fixed the ai than i changed my mind. the car customisation is very good you can change allot on the cars but for that you need money and if you are always second or last you don't have enough money for the hole fuel tank. they need to fix the ai as soon as possible. for now skip this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like a arcade style free roam, driving is arcade like, drifting is even more arcade like and also keeping in mind this game was made in idea of drifting well it wants to make the idea of drifting. Would I buy this game HELL NO i wouldn't even play it if it was free full time. Its just a boring money grabber.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is full of AI art and AI voice acting, identical UI and design compared to Forza and has no licensed cars. Just play Forza brah, not this AI slop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Driving feels terrible\nAi Art \nAi VA \nEven the steering animation is really messed up and weird. The game just has nothing going for it :/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm trying to play this game with my G29 wheel but the game only reads it as a HID it doesn't recognize it as a wheel so when every i try and operate the menu it doesn't recognize any of the button and when I'm trying to drive the game thinks the pedals are down without touching anything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "idk about this game because whenever i launch the game to get the anti cheat thing it forcibly resets the pc and when i try launch the game it says anti cheat not installed so i dont think this game for me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AI maintained script, voice and whole story. The game itself has all the customisations you could ask to improve not just looks but driving specifically - and yet it fails to deliver proper physics for car handling, there's huge under-steer on any vehicle you play, tried also with wheel, controller and keyboard...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ok sooo, i was really hyped for the free weekend, as i was planning onto buying the game full price anyhow..\nNow.. that the game crashed 2 times before the tutorial (leaving the highway in the white porsche) mission, then after a few more tries i managed to get my car and drive it to the first sprint mission and feel the weird handling, i felt that this game does not deserve to waste time onto it..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game feels like its a mobile racing game, like this \"CarX Technology physics\" that the game has is just a title to sell more of whats a dirt cheap product that's shotgunned into the masses.... mobile game feel to it, no real physics, and no innovation that brings anything new to the gaming scene",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst AI ive seen, its like the other racers dont see me, it wouldnt be as bad if they didnt fucking snatch me out of the road like a leaf",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game sucks im glad it was a free weekend game. I was going to buy this a.i junk. Just play carx the original or forza. might be fun if you have a racing rig,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "played for free to see if it's worth buying but ehhhh...\nthere are so many cool cars and all but the handling sucks. drifting is horrible. \nunbound is 500x better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- Poor optimization\n- Insane amount of grind for pretty much anything\n- Kernel level anti-cheat for non-competitive racing game, think on this one for a bit..\n- Fails to disclose the use of AI generated content on the store page such as NPC voices, avatars and other textures\n- \"Survival\" mechanics such as fuel and tire use to add more padding to the grind in an open-world arcade racing game\n- I think even the artists they used for the music used AI for that as every single song is generic trap, electro or phonk without any dynamic range, buildup or tempo changes throughout the song.\n\nAvoid this one",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AI voice acting off rip. Way too noticeable to enjoy more than a few minutes. The physics also feel terrible. If you own their other more popular title, CarX Drift Racing, just install a big map mod and its exactly the same as this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AI Gen content, physics not that great, the game as a whole doesn't really do anything it's just too basic.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does everything okay, neither good nor bad. It tries to be NFS and Forza at the same time, but doesn't really excel at recreating the good aspects or either.\r\n\r\nCar Physics: It's decent, the physics isn't at a racing sim level, but isn't entirely arcade like. It's sort of a bridge between arcade and simulator physics.\r\n\r\nGraphics: This game would've had decent graphics if it wasn't for the glitched reflections and the aggressive occlusion culling resulting in buildings and props popping in when driving.\r\n\r\nGameplay: The gameplay is fine until you check the dealer ship for different cars, some C2 class cars require you to be lvl 16+, given the abysmal amount of XP you get after every club race it would take 50+ races to get the required XP to unlock certain cars. The only other method gain XP is to loop the highway 40 times for 10-15 levels, which is a repetitve and boring method of farming XP and ruins the flow of gameplay, but is faster than doing club races.\r\n\r\nArt/Voiceover: AI art and voiceover :[, you'd expect that they hire actual voice actors or commision artists for a few NPC icons, but no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could have been a fun arcade like game but they went heavier on the realism route. There's other games doing the same thing with better graphics and mechanics.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hot garbage that looks, plays and runs like hot garbage.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is still bad and needs more improvements than focusing on combating cheaters; it's not a war or weapons fighting game. My rating for it now is 3.5 out of 10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought the game, Played a while, decent game, stops working, trying to fix and search around for 2+ hours since the game wont open, found a yt video, the fix is to unplug keyboard...\r\n\r\nDevs get your fucking shit togheter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i would not recommend this game the only real racers in there are running modded cars and then you lose your hard worked for car anyways the game had potientol but ended up losing the game to mods frfr this whats wrong with 90 percent of games now a days mods ruin them and yall let it for more money smh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have a high end custom built PC that can play all games with ease, this game is trash. 1st time playing and it ran slow with tons of graphical glitches (sinking cars, extreme graphical abnormalities and freezing). Next time I played it ran great, did races, upgraded car and made good progress. 3rd time and it was back to glitching again. Don't have time for poorly optimized games. DO NOT RECOMMEND",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was really fun when it was working, now i try almost every day and its just a black screen, haven't played the game in weeks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "disappointment. pop-in issues, physics I just can't get used to, unenjoyable UX. you can feel the mobile game DNA all over this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "awfull feel on car, ur in like railtrain without any chances to turn off. fix handling! racing game without proper handling is a joke.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wait for them to update the ai drivers. Game is fun driving alone or with friends but not against the ai.\n\nI beat the first 2-3 clubs, most races i was able to beat in the first shot\nbut then i got to C3 (class 3) - To a race that in 3 weeks of trying, I cannot beat it.\nNow, i'm an experienced driver in real life and on video games, i drive a 6 speed manual everyday im 36 been playing racing sims most of my life, starting with gran turismo 2.\n\nToday I came here to post that I have given up trying to beat this game, I consider it unbeatable in its current state without becoming actually angry with it just to beat it, which is unhealthy. Games should be relaxing and fun.\n\nI've never played a racing game where the most difficult thing about it was how dirty the ai drives.\n\nTheir cars are made of vibranium, because if you so much as touch their bumper you will do a 720 side spin into the wall at a faster speed than you were initially travelling.\n\nThey are the most perfect untouchable racers, taking corners at speeds faster than my car even goes.\nso you need to drift into each corner as they take it perfectly. just pray you don't graze their bumper and get sent back to the starting line. again vibranium. \n\nThe traffic, oh boy the traffic. - The ai will send cars spinning at you within 30 seconds of almost every. single. race.  Turn traffic off in the menu? Doesn't work. like at all, doesnt even change the amount of traffic. \nthe button literally does nothing.\n\nThere are transparantish gaurd rails during races through the city, but traffic is flowing like everyones going to work still so you're ripping through an intersection doing 140 - and Mary taking her kids to soccer practice in a red mini van will T bone you into getting lapped by the ai because they drive formula 1 cars shaped like honda civics i guess.\n\nI want to keep going but i dont even think anyone is gonna read this but if you do, i'm very serious the ai is trying to harm your mental health and you've been warned.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}