{
  "positive": [
    {
      "review": "People playground is a very fun game, other than it being a sandbox you can also create stories and make videos on it. It's a very interesting and fun game. I would highly recommend it for others.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "It's a pretty fun physics simulator with a lot of bloodshed and murder… Also war crimes.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Absolutely amazing! Way more realistic than melon playground, and no ads!! Super cool maps, and great fps on my pc!! (which is an older model) So many features that I haven't explored yet! Amazing buy!!",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "You can look at three things endlessly: how fire burns, how water flows, and how everything flies and falls apart in People Playground. The best anti-stress!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "It's pretty fun and the workshop has a lot of amazing mods but sometimes this game can get a bit boring at times but still fun game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very good sandbox, doesnt really update though but the modding community makes up for it, hard to find things to do though after a handful of hours",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I would love to become one with this game, in every sense, in every possible meaning. This game goes deep within me - my feelings, my emotions, my desires. The characters are like 5 inches in this game, short.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "its a very fun game with loads of mods and contraptions to choose from",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "2 words \"fuckin awesome\" and the mods oh dont even with me rn such a good game and such good mods",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is very good allowing for you to do up most anything! the optimisation is very good (I play on a asus vivobook go) and it runs pretty well, the menus are like valve games with bad menu and quit button placement included! I will say external mods (not from the work shop) can be tricky, and if you play on low end hardware than the loadng can be quit long, there are nothing but nit picks though1",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's very fun to torture and kill people and inject them with weird liquids. Anyway if we talk about the game it is very good and i recommend it. Worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game especially with mods try liquid machinary i like it so might you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun i like game its pretty fun to play around in and its a good physics sandbox and its w so its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fun, sandbox. my favorites",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SO GOOD. look it has gore but... the mods make it better! If you can't get mods it's still fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun if on mobile i found this same game for free on playstore it is called melon sandbox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool I love using the robot freezing them and hitting them with the most bizzare things until it's just the exoskeleton.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game can be boring and fun at the same time, it honestly depends on how creative you are, overall a really nice idea for a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best sandbox games im ever played, just dont interact with community if you are hate constant drama, 14 y.o. and mentaly 14 y.o. adults, racist, larpers, gooners and any other degenerate people\n\n\n\n\n\n8/10 for slow development and lil bit of unoptimization",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun if you're bored or just want to play something and really just a creative game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] A Playground.[/h1]\n[hr][/hr]\nWhat i do or did in this game and the fact i have all the achievements [b]says nothing about me[/b], at all. [u]Good game.[/u] \n\n[spoiler] This game plus mods goes wild and it's fun to idly play every so often.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blood\r\ngore\r\ni can morph these living beings beyond my comprehension\r\nand i fucking love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game that you can play,\nIt has lots of mods to use to make the game more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a GREAT game i would recommend it to anybody the physics and overall game play is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "literally endless fun and theres hella stuff to do. 10/10 amazing purchase. (i literally have 78 hours on this game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i accidently keep burning people nice game if u have creativity and love making stuff but some people will get bored in like an hour if u like sandbox try it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked how he gameplay is you controlling other people spawning stuff to kill others and the mods you can download is just muah a chefs kiss\r\nrating: 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its just a good sandbox game, plus the people spend alot of time of really good mobs, so i would def recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i think that this game is terrible. it won't let me press play and when it does it holds me at gunpoint and makes me shoot three kids. putting that aside, it personally comes to my house and makes me go to the nearest hospital to get some maccas. but the qualitys pretty good i guess. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive played this game for a total of 52.583 days. i would say this game is pretty fun, and my experience should tell you my opinion is valid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was amazing for my grandsons would recommend. btw sub to just a random guy that's my oldest grandson i guess but he's adopted his parents told me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like being able to fling and crush these lil guys. its honestly a must have game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its honestly a great sandbox games and also it has a lot of good mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game, that's all I have to say, honestly. It satisfied my sandbox needs, and that's all I want out of a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it makes me happy and it is fun playing with mods and you can dounlode fun stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game can crash my R5 5600x and 3060 ti when i manage to create moving item that travel using light year speed. best game to crash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty entertaining game although there's not a real purpose. There's a lot of mods on the workshop so you can get many hours of fun, its a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun to play when your boredd or when you have anger issues. You can do almost anything because of the mods. But the game dosent get usually updated but thankfully once again there is mods to play with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With no mods I'd say the game is ok but what makes it grate is the massive amount of mods to get and the way the people move explode and act is grate in a lot of ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is highley reccomended it is fun and destuctive also dont donload to many mods....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, your able to make machines, buildings and mech suits, i highly reccomend if you like killing people (IN GAMES) or destruction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Perfect if you're looking for a fun sandbox game to destroy and create. The mods that are included in this game add on to the greatness! Even if you don't like destroying buildings or killing humans, you can created different mechanisms like a plane or a helicopter. Overall 10/10 game in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to get out any rage and feel happy, I don't know if im a phycopath but it feels like it sometimes\r\n\r\n100% recomend, be ok with violence if want to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really fun. I love the mods and specifically shout out to Jujutsu Playgrounds. Also it's fun to torture people! :steamhappy: I have over 300 hours put into this game at the time of reviewing this game and I probably have lots more to come. The gameplay never really gets boring, especially with the vast variety of mods. And all this fun and replayability for £7, and I'm pretty sure I bought it on sale too. There's infinite possibilities and I would no hesitation buy it again. I recommend highly, W game and W devs. Although it's a 9.9/10 because there hasn't been an update in like almost a year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect game for animating, killing, and doing anything you want really, best game i ever purchased",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game i enjoy it also i enjoyed the mods and getting achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "brutal, fun, and gorey? oh yes please, i do indeed love the lore- oh right, there is no lore, doesnt matter, this is a amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its better than melon playground but cost money and better graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to sink some hours into. just mess around with little guys!\nthere's probably a wallace wells mod out there, so woohoo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and has very good gore and torturing devices",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game can get repetive but there are thousands of mods available. great game worth the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play it for 10 hours and ur officialy on an fbi watchlist",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, buy for your kids and spouses, very immature and very fun. perfect for children.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fabulous game with great physics and a sick sense of humor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really not that voilent, depends what u do i guess, amazing game super fun, GET MODS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a good game i have 102 hours on it and the mods are SO fun download mods with workshop :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For some reason, I installed mods and I can't stop playing...the doctor says it will pass soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i was injecting new blood in him so he didnt die while i ripped off its limbs, then my buddy recomended this game five stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was magnificent when i used to play, i usually only played with mods on (which is really fun to play with),  but even when i didn't have any mods on, the vanilla game was just insane. genuinely a top 10 steam game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is gore but not realistic gore and its fun to do experiments in and stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grey man go pow: and bleeds everywhere. Whole thing. This game fucking sucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basic sandbox game, just you can brutally murder and torture people! Pretty fun I can say but it can get boring after a little bit. One of those games where you buy, play for 1-2 hours, forgot about it, find it again after a couple months then repeat.\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☑ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☑ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is super fun and if you are a sicow path this game is for you (i cant spell :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a very good physics and sandbox 2D pixelated simulator. The freedom, modding capability, and array of varying tools and abilities make it notably different than most other such physics sandboxes I've seen, or at least 2D sandboxes. However, I would highly recommend that this game be only played by a 14+ year-old audience at youngest, as the games \"Human\" tool can get fairly graphic/violent rather quickly, depending on their situation you set them in. As some of the pictures/GIFs/videos on this product suggest, there are many creative methods for killing the 'Humans' you place in the sandbox. This game is certainly PG-13 in my opinion, and parents should be wary of the game's more morbid side.\n\nIn other news, the game is, again, very good as a physics sandbox and simulator. Controls are good, and fairly easy to master after some effort. Would recommend, but with caution.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun for people who just dont know what to do and wanna \"torture\" others with many ways",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most experimental and fun games i have ever played. it can range all the way from bloody to an engineering type game. If you like testing out things and using your imagination, i would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good sandbox game i like it and the workshop suport",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "отличная игра, можно делать много разных вещей. бывает расслабляет, бывает нет, еще геймплей разнообразит наличие разных модификаций (спасибо сообществу этой игры). вообщем, советую к покупке",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if youre bored this game is very entertaining theres lots to do especially if you get mods 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "QUite a fun game normally, though one downside is you cant control where your gun/melee is aiming at if it isnt held by a human, sad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hello everyone my name is douro.v. my daddy made this account like 5 years ago but before that he was playing left for dead before i was born. i played this game a couple times and i like it very much. i like to grab the guys and swing them around fast so their limbs fall off. i like this game and spent like 2 hours on it but my daddy spent 100 which is a lot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great for people who like 2d sandbox games and is fun for killing and experimenting people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so ASS without mods if you do not want to get mods do not play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is insanely good, i love playing this in my free time to do random things and use the workshop to use so many mods that makes the game infinitely more fun. i think that you should definitely download this over any other game if you have 10 dollars. it has zero limits and anything you can imagine you can create. this is why i love video games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game, you can build your own story or just have fun with mods like Jjk or dragon ball. Definitely worth the price :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game,Its fun to have the most random ass things set up and even better with mods!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like sandbox liike games this sort of game is PERFECT for you, in my opinon i dint really like sandbox games, but this game is an execption. With mods its even better such as more cars, more drugs, bone fractures and MORE! GET THIS GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for messing around and torturing people or just testing your creativity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good but needs tons of mods to be fun sometimes and requires high performance to run alotta mods or have some stuff spawned",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked this game bc the game has gore and the controls are really easy and when you can add mods to it too is even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is peak if you like comitting massacare or just wanna build a wonder weapon to help with even more massacare plus the workshop is really full of great mods to improve your abilities to even more killing! Personally I love building stuff and torturing people, it's a must-have game since you can do anything and it's cheap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting builder gamethat can build what ever you want. But remember it's 2d game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud game but really bad optimization",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a amazing sandbox game worth the money the free mods are amazing to get on steam highly praised",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the physics in this game highly recommend it for those who like physics and gore!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you want to comit horrible crimes againts humanity buy this game do you want to Burn people on a makeshift frying pan buy this game bored look in the workshop download mods game fun again buy this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game might be one of things that keeps humanity from the brink of destruction, because it can fulfill alooot of ppl's urge to do inhumane experiments (such as me)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like to commit mass murder and make invincible characters fight, very customizable game buy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely love this game. Worth the 10 bucks for sure. The sheer amount of ACTUALLY GOOD mods this game has is insane. If you got 10 bucks, buy this game, I mean it. Buy it. DO IT, BUY THE GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so calming after a day of hard work at school to open the game and commit mass genocide with nuclear bombs and aliens !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game gets laggy with mods, but overall a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is awsome i thought the devs forgot about his game but nope i saw a update happen weeks ago but it was just some patchs and so im asking for you to add more weapons like guns and cool/weird weapons and PLEASE ADD ARMOR LIKE MILATARY BODY ARMOR anyway i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the amount of sex mixed with gore is a real turn on and leaves the player wondering when the next intimate act will occur but not to worry the sex in the game randomly happens and will not force you to wait 1+ hours before having an intimate moment with the ragdolls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun the mods are cool and i love killing npc also if you have this game your are a pycopath",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is the  best game i ever played all the mods are free its not really laggy and its super fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "thank you for the people who made this its good with no mods but with mods its a whole diffrent story you can have almost every thing u could ever want from anime mods such as dragon ball one piece jujustu kisan to your favreit games its almost unlimmed have fun your money is worth the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this might be one of the best ways of spending 10 bucks, maybe even as good as buying 5 packs of gum. theres just like, a ton of stuff to do, you can dismantle a guy and then bring him back to life to watch his family die. and thats just for the base game. for some reason the silly little fella (fellas?) who made this game decided they needed to add a workshop too. so now you can make them dig in their butt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rlly fun in general, doesnt necessarily need mods to have fun with-- they jst add a cherry ontop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so many ways to test on the lil guys you basically create your entertainment peak game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very simple but fun game, tons of hidden secrets, lots of good mods that work.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "bro what the hell is this game i put somone in the air an dit ruined my whole build fuck your game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game in theory is fun, but the controls are so God awful it's impossible to play. Nothing makes sense. The controls aren't anything like any other game I've ever played. It might be okay if you took 2 hours to fix all of them. Also the menus are confusing and garbage. Wouldn't recommend just bc it's impossible to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 1000 hours I can say that this game is trash. Doesn't have sex yet.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it sounded really fun on theory but really dull in execution, Hate to say that but I'm really disappointed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "took too long to load. didnt even get to play 5 minutes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played for 2 seconds and got bored",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not for people with inner demons coming out at the smallest things",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrable and glichy do not recomerd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing but destroys my soul",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im people in playground. bad game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 67 type shit w speed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun for the first hour but then gets boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hello im, the and me the lik yea?,\r\n\r\n\r\n\r\n\r\n\r\ng",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "eh, its okay ig.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring game lowk",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BAD GMAE 0/10 NEVER PLAY!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boaring ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a great game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "abandoned game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SHIT GOT BORING AFTER 2 HOURS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "absolute garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gets boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is gore and good b ut i like it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kiling is bsad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uhh idk",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bad not sigma",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much lag",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "jaadkjhhkhakgh;agd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ㅤ",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is a fun sandbox, sure. But after maybe a day or two of messing around or building complex designs you start to notice the limitations, bugs, and how lacking the base content is...\nAnd while yes, mods do exist, (and they can somewhat decently increase your playtime.) they still can't fully solve this issue.\nI wont mention things like the community being toxic or issues experienced by other players since I myself don't interact with said community.\nMy main gripe with it has always been, and still is, the lack of updates. It is mainly because of that, that I can't recommend this game unless things change and the developer starts updating it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game in theory is fun, but the controls are so God awful it's impossible to play. Nothing makes sense. The controls aren't anything like any other game I've ever played. It might be okay if you took 2 hours to fix all of them. Also the menus are confusing and garbage. Wouldn't recommend just bc it's impossible to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I compressed hundreds of hours into few minutes of this sandbox game. It is a game for maniacs, low-life inbreds. Imagine your \"hobby\" is torturing npcs? Pathetic. Edik played it for a bit then stopped, because this game is BO-RI-NG unless you are nuts. Hello, and today i will talk about permitivity of quantu spacin..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrable and glichy do not recomerd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 1000 hours I can say that this game is trash. Doesn't have sex yet.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "took too long to load. didnt even get to play 5 minutes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it sounded really fun on theory but really dull in execution, Hate to say that but I'm really disappointed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played for 2 seconds and got bored",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for people with inner demons coming out at the smallest things",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing but destroys my soul",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im people in playground. bad game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 67 type shit w speed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun for the first hour but then gets boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hello im, the and me the lik yea?,\r\n\r\n\r\n\r\n\r\n\r\ng",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "eh, its okay ig.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}