{
  "positive": [
    {
      "review": "This game is therapeutic. It has healed something in me. It's so peaceful. \n\nHighly recommend it!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "You'll either love it or hate it. It's super grindy but also super addictive, especially if you like survival RPGs. It's got a Skyrim-ish feel to it, but the storytelling/ quests are just meh. It's very challenging to make progress, but when you do, it feels rewarding. Get ready to do a lot of your own research because there is definitely a learning curve in the beginning. The game mechanics aren't always reasonable, but if you just go along with it, you'll have fun.\r\n\r\nFor example, villagers can't \"feed\" themselves unless you build a food storage hut or manually refill their home chests. So you could have a whole bunch of food in the fields and they would still literally starve until you've unlocked / built certain buildings. The villagers are really \"dumb\" and need to be babied. They work really slow and everything in the game happens very slowly. So if you're a fan of instant gratification, this isn't it. Traveling/crafting/unlocking tech tree everything takes a lot of time, points, and patience.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I played the game many times and memorized every mechanism but the problem is that after a while the game does not satisfy you. You have built your village and it is finished. The decoration content is very little, There are no updates to the game as decorations, there should be villagers supported by artificial intelligence. The game has really attracted a lot of attention and these updates should continue.YOU ONLY HAVE 4 LIGHT OPTIONS IN THIS HUGE GAME",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I’ve been playing Medieval Dynasty with my wife, and so far it’s been really, really good! The gameplay and management aspects are both enjoyable and well-balanced. It’s relaxing but still challenging enough to keep us engaged for hours. Building our own village, managing resources, and watching it grow together has been such a fun experience. Definitely a great game for couples who enjoy simulation and survival genres.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Extraordinarily addictive.  It is somehow very relaxing and very busy;  you're always thinking about what's the next thing you need to build/craft/quest, but at the same time chopping trees and hoeing land is pretty chill.   Forming a town and watching it grow and being able to tweak everything about the town is truly rewarding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my all time favorite survival build games. Had tons of fun couple years ago and missed it so much I came back to it only to see that there's tons of new stuff to explore <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Medieval Dynasty is truly a labor of love... Truly.. This is the kind of game that scoops you up, tosses you into a medieval forest, and politely says, “Good luck, peasant..” It’s smooth, it’s beautiful, and it’s so ridiculously deep that I was originally overwhelmed by all the options, but slowly I morphed from confused villager to proud mayor of a thriving dirt-and-thatched-roof empire. I only wish my friends would play it with me, now that co-op exists, but apparently none of them want to spend their nights milking imaginary cows and dying of seasonal allergies in the 13th century. gosh who knew right? The building system is solid but could use more creative freedom..  think less “premade peasant hut” and more “I want to build a house shaped like my hopes and dreams,” With more decor options that make my place pretty. I am a girl after all. think  like in Ark or Conan building. even if it was just for your house and not the premade huts for crafting. They could allow one premade home per user. Hunting is fun but could be a tad more rewarding, because after spearing a boar in the face from ten feet away, I’d like something more than a polite pat on the back. Especially because, dangit bobby that was hard. Still, between the gorgeous environments, the chill vibe, the satisfying village progression, the “raise a dynasty” legacy system, and the feeling of watching your tiny hamlet turn into a full medieval commune of people who hopefully don’t hate you, this game stands strong. It’s charming, it’s cozy, it’s occasionally clunky, have had minimal issues myself,  but it’s absolutely worth diving into..  especially if you enjoy survival, building, and yelling at NPCs who keep complaining about firewood even though you just chopped down half the forest!.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the progress in this game is a little slow BUT the horses officially make everything worth it - haven't laughed like that in ages",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "so i've had the game for years and watch it develop, played more in offline than online.\r\n\r\nfirst it's a really good game in my opinion and plays well, i mostly play single player.\r\nit's an easy game to play with a lot to do, there are two maps both are very well made and really nicely designed.\r\n\r\nthere is a well mapped skill tree that is very unique to the game and easy to use \r\nthe customization settings for the game do have a lot off ways to adjust things in game and can be changed at any time. \r\ni.e. speed of exp gain, hostile/none hostile animal heath and attack\r\n\r\nthe graphics are really good and plenty off adjustment for lower tier pcs but also have very good graphics  if your pc can handle them\r\n\r\nit is mostly like a sandbox with npcs and npc villages and you get to build your own village/settlement or even a city latter in game mostly populated by npcs. who you recruit.\r\nthere is also a management system for managing your villagers \r\n\r\neven though there are story line missions that have an end the game itself does not have an end at all so how you end it or when you call it a day or year even is up to you\r\n\r\neven though there is combat  in this game it's more a settlement builder type game than a focused combat type game \r\ndo bare these facts in mind if they are important to you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is definitely fun, interesting, and has a lot of depth to it. However, the micromanagement that is required for all the colony aspects of the game is rather off-putting.\n\nOverall, I enjoy the game and I think its fun. But, definitely don't go into the game thinking the colony management is going to be anything mind-blowing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Bought this game quite a while ago, a few years I think now, but I didn't like it back then very much. However, years of development seems to have made the game more polished and fun. Recently my wife and I started playing, I bought a copy for her plus the nature DLC and I gave the game another shot, and I get the Morrowind/Oblivion feeling which I like plus it's multiplayer. You get to manage a town in Morrowind basically you can say with all NPCs and their chores.\n\nWorth mentioning is the game might not appeal to everyone, it is slow-paced and often grindy although it helps greatly to set up villagers for tasks such as as lumberjacks, it passively brings in timber, sticks etc every day. Villager work is only simulated, they require no real source for the resources except farming (seeds) the game will play random work animations to bring life to the village. It could however benefit the game performance-wise. The way the developer made this is still OK, I accept the simplicity.\n\nMap feels too small to be honest, there are things I do not like but overall I find it worth quite some hours of gameplay. It was worth buying for me.\n\nRating: 7.5/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really enjoy this game. It can be a little tedious, but personally I like that about it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decided to step away from OSRS for a few months due to how sucked into it I get and thought this looked like a decent way to get my dopamine fix for an hour or two every other day or so. \n\nFast forward a little over a week with 44+ hours logged.\n\n\"- alright so apparently citizens moods heavily effect their production and the easiest way for me to boost that right now appears to be to insulate their houses so I'll just do that real quick.. I need a few hundred clay, and a few hundred straw.\n\n-  Shit it's winter and I've been neglecting my manual woodcutting and the citizens are unhappy because they don't have fireword, I'll put insulation on the back burner and chop some logs.\n\n- I've spent so much time chopping logs and making insulation that I've neglected to hunt, my citizens need food.. *researches farming*\n\n- Okay so I need to get animal feed but it costs more to purchase than the the products the animals produce, and I need maneur for fertalizer.. buy I can buy the ingredients to make some now, then use some of them to farm the stuff that produces those ingredients\n\n- I'll head to the farm shop but first I need to hunt to get some leather to craft into items to sell for gold\n\n- I need arrows.. let me fetch some rocks and sticks and get a little fletching done..\n\n- I should grab some food too in case I get attacked out there, shit my hungry citizens ate all the meat already.\n\n- Pre-hunt-hunt\n\n.... Reallly poor choice of games to get into whilst trying to escape gaming rabbit holes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While not perfect (there are glitches, physics issues, and lighting issues at times), this game incorporates my favorite elements into one title pretty well. I can't recommend this title enough to anyone that likes survival crafting games like Minecraft alongside city building titles like Caesar 3 or Banished. The combat is pretty good. The building could be a little better and offer a snap-to grid feature (but I actually like it this way). The survival and crafting seems to be pretty well balanced. And the continued support from the studio is something you don't often see these days.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fantastic medieval simulator that features all the possible facets. Farming, hunting, banditry, marriage, crafting, smithing, village building, and even the dreaded  enemy of all. Taxes!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah i think its about time i review this game. \n\nOne of the most fun/relaxing games and it just a charm to play. I adore the first-person perspective city builder mechanics this has, its just so well done! The game has grown and evolved over the years and really outdid the expectations i had when buying it in Early Access years ago! They finished everything on the roadmaps they put out, and went even beyond those! I feel very satisfied where the game is at the moment, and i look forward to the next project they are now starting work on!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is the perfect blend of sandbox city building and RPG. \n\nPros (what the game gets right)\n+ The art style is reminiscent of Skyrim and the sound track is relaxing.\n+ The controls both on K&M or controller are easy to understand.\n+ The management screens of both villagers and workspaces has improved over the updates. Adding seasonal production management was a well needed improvement.\n\nCons (what the game lacks)\n- The NPCs both in your village and throughout the map are limited on responses and interactions become mundane.\n- Definitely a grind if playing solo for tech and experience, could be something you toggle off for tech so you start with things unlocked.\n- Additional buildings are missing that would be helpful. (town hall for taxes and management or church for happiness)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, great if you wanna Roleplay a medieval rags to riches story.. \n\nOnly real gripe I have with it is that it would be nice if the longer \"story\" interactions were narrated.. some stories are like 5 lines of Subtitles up at the very same second",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Medieval Dynasty is a great game. I highly recommend it!\r\n\r\nI'll be completely honest, I'm just writing this as a placeholder review now to get the Steam badge, but I'll come back when I have more time and elaborate on why I love this game so much. =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play it with friends, the wolves look really good, check them out up close, you'll be fine!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy this game in beta.\nNow I am looking forward to try coop mode.\nGame is been keep updates and improved all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty chill, good survival, management, building, farming etc. I do recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game scratches a certain itch for me. I love the medieval setting, love the city building aspect, the world is beautiful, and the quests are fun. It makes me feel like I'm a little less creative than I like to believe that I am but I'm constantly striving to do a little bit more with my decorations and be a little bit better. I wish the character customization was a bit better on The Oxbow but ultimately that doesn't matter that much. This game is fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So it would seem I never actually reviewd this game.    Despite owning it for at least 5 years (and early access).\n\nNormally i tend to review games i do *NOT* recommend.     So this might very well be the first time I write a review for a game I recommend.\n\nAnd boy, do I recommend this.\nI'm pretty sure most people know what this game is about, what it looks like etc.  So I'll keep this one short for a change.\n\nThere's a bunch of similar games as well,  many of them coming out *after* this game.   And honestly,  NONE of those other games even come *close* to Medieval Dynasty.\nThe devs,  Render Cube,  have done and are STILL doing an amazing work on this game.\nIt's SO hard to believe that this is published by Toplitz,  a publisher I wouldn't normally even give 2 cents to.  As most games in their 'catalogue' are either unfinished, or \"finished\" but buggy and to never be fixed.\nBut this isn't about the publisher, not really about the devs either for that matter.   But these devs REALLY do deserve to be mentioned.\n\nWhat , in MY opinion makes this game stand out and WIN against ALL similar games are ..well many things.\nFor example, but not limited to.\nIt's \"Finished\" but they still add cool stuff to the game, and improve existing mechanics.\nIt nails the immersion,  you just feel..at peace (unless you're in combat) when you walk around in this world.  \nBuilding your own village slowly,  seeing how it went from nothing but a forest, or plains (or w/e),  to a village housing several houses, workshops, and many villagers.\nYes you can build your village almost anywhere. There are obviously some areas you can't build, like too close to another existing village(npc).  \nYour villagers feels like actual people. They greet you. They go about their business.  In the mornings or evenings before/after their workday, they might chill out in front of the campfire (if you built on),  and you can interact with them, chat with them.\nYou also give them work,  for example, one of the villagers might be more fitting for the role of the village's blacksmith. Or cook. Or farmer, etc etc.   They'll go to their workplace,  do whatever it is on the 'todo list'.\nYou as the player can do basically everything yourself.  You can create fields,  plow, fertilize,  sow,  harvest, etc. Or make tools and weapons at the blacksmith. Or sew new cloths.  And so on.   But why, when you have villagers to assign to these jobs.  So you can focus on whatever it is you wanna do.  \nYou can roam around the countryside,  maybe find bandit camps,  fight them, loot them.\nGo out hunting maybe.  \n\nOh and dont forget, you gotta get yourself a wife too.   Who will live with you in your house.    After some time, and if you so desire, you can make, and have a baby.    This is true for EVERY villagers btw.   Pair up a male and female in one of the houses you built in your village, and eventually she'll get pregnant.   \nAs of this writing, there's an upcoming update in about a week,  where they'll change a bit of the mechanic when it comes to pregnant women.   First of all, they'll add so that the pregnancy is actually visible after a season or two.  So you might end up with several female villagers with a preggo belly walking around.\nPrior to this upcoming update, they would work til they give birth, then the female will NOT work at all until the kid is of age. Then she'll go back to work, AND the kids can be assigned work to (when they're old enough!)\nThey can have more than one child as well.\n\nThe child that you and your wife make however, is a bit more special.  As he will become your HEIR.   IF and WHEN you die for whatever reason - you can die of age, as everyone ages and dies in this game - you will start playing as your son.  Rinse and repeat, basically.\n\nFew games of this genre has even the \"legacy/dynasty\" mechanic, where you get married, have a kid, who becomes the heir, and eventually the playable character.    There's a couple of those games, but they are not remotely as well done.\nA few games have popped up since MD was released,  but none of them really nails it either.\nYou have another game from Toplitz,  Wild West Dynasty,  (do NOT buy that sh-t),  a game that they even reworked completely during early access,  which made it a LOT better.   But as of today, there's been months without much or ANY words from those devs.  The game is still lacking content, still has horrible bugs. \nWhich again leads to me pointing out, that THESE devs, despite it being Toplitz that publishes it,  these devs really did good work with Medieval Dynasty.\n\nI have NEVER felt more immersed and happy in a game, than I do with MD.    Be it the atmosphere, the birds chirping, or the relaxing fitting music softly playing.\nWatching your village grow,  watching your villagers do their daily routine,  watch them start families, watch their and your kids grow up.    Experience the loss of people dying of old age.  \nYou kinda care about the characters/villagers.   They all have name, and different skills.    Or rather different skills they're good at.\n\nYou can take a trip, or ride, to any of the existing (npc) towns,  buy and sell stuff. Or pick up quests.\nThere's actually a main story in the game as well.  Plus 'sidequests'.\nThere's SO much in this game, and they keep adding MORE and more.\n\nHow can you just not LOVE this game.   I was amazed when I checked the overall reviews here, I was certain this would be one of those 'overwhelmingly positive' games.\n\nThis is THE game in this genre.\nMany have tried and failed.  Some really new ones that just came out might try to beat MD,  but they are SO early in early access so we wont know for years probably.  Plus most of them do NOT have the whole \"get married, start family, have kids, and heir\" dynasty-vibe/mechanic.\n\nThere's also survival mechanics. Gotta eat and drink etc.\nGame year is divded into the four seasons, each season consists of a few days, which you can change when you start a new game.  Think default is like 2 or 3 days.  I.e  2-3 days later it will be next season(spring/summer/fall/winter).  Which also plays in to the immersion, it truly FEELS like autumn or winter.  And you have to plan a rotation for your crops, as they can only be planted certain seasons etc.\n\n\nAny negatives to be mentioned?  Honestly I can't think of any right now.    I rarely get to say this in my reviews (as I tend to only review games I think people should avoid)  but I f-cking love this game.  \nIt really IS the best in it's genre, hands down.  No other game even comes close to the scale and scope of this one.\nAnd despite it being published by Toplitz,  it's really effing amazing.\n\nCan't really think of what more I would want in the game.  I wouldnt say no to better graphics. But it looks really great as it is.  I just want the characters to look just a tad better.   But this is literally me nit-picking now.\n\nGood work to the devs.\n\nWant a colony builder/survival/dynasty game,  this is IT.\n\nDamn it felt good to write a positive review for a change.  Thank you Render Cube and MD for giving me so much joy in a game.    It's SO easy to just lose yourself in the game.  Friggin love the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great all around experience both solo and multiplayer. If you enjoy base building, survival, crafting, and resource management then check it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, if you like chill vibes and building you can unleash your crativity and build really nice looking village. Storytelling isnt the strongest aspect here but there is a lot to do even besides that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i found this game relaxing to play and was fond of making my village on a island\r\nthe quests are very back and forth to location to location\r\nthe atmosphere is very imersive with open forests and deep mining caves\r\nthe music is fantastic and battle with bandits and wildlife has battle music\r\nthe options are very customisable as i find keeping an a eye on hunger and thirst annoying\r\n\r\ni recommend giving this a game a go\r\ni hope if they decide to make a sequel you can create castles XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While it's supposed to be a survival game, you can spend long hours simply decorating your village. Peak relaxation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game especially with friend's. This play through it was 3 of us and it lasted about 50 hours before we completed almost everything we think was worth achieving. All that was left was a continuation of the grind to get better NPC's and build a slightly bigger city. Would be nice if they could add more expansive growth items that could help groups have a longer game. The grind is not bad at all and it gets better with the villagers. Will definitely be coming back to play again at some point down the road.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve put about 350 hours into Medieval Dynasty, so I'd say I definitely like it. This is pretty much the exact type of game I’ve always wanted. A mix of city building, light survival, and managing a whole little medieval life with a family and lineage system. You don’t just build a town, you actually live in it and watch people go about their daily routines, working, walking around, sleeping, all of it. It makes the world feel way more alive than most games in this genre.\n\nIn my opinion, this is easily the best game in the Dynasty series so far. It’s a bit of a slow burn and can get grindy early on with gathering, but that’s kind of part of the charm. Once your village starts running smoothly, it’s incredibly satisfying.\n\nReally hoping they eventually do a Dynasty game set in a flint-and-steel, colonial/Napoleonic black powder era. That would be perfect.\n\nIf you like chill survival-light, settlement building, and just watching your world grow over time, this is an easy recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is truly one of my favorites! You can play how you want, make it as easy, or as difficult as you want to challenge yourself. My only issue, which truly isn't, is that I wish the NPCs were more dynamic, that there was more to them. But I wholeheartedly recommend this game 1000%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i bought this game back in 2021 and have only now really returned to it. but its been great, and i feel its in a much better state than what it was, and is quite enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm absolutely in love with Medieval Dynasty even after 300 hrs of gameplay.  It's gorgeous, calming, and still provides tension when needed.  And on top of everything, being able to play with others and build, hunt, and even farm together is excellent! May your dynasty be strong!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You like medieval city builders but always wanted to also life in the village you build? Here you got, this game is waiting for you.\r\nMany, many updates later there is a lot to do and ways to decorate your home and village.\r\nGo and make your medival homestead or city dreams come true.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "180 hours into this game.... I can't help but love it. They are continuing to update it and make QOL updates that just make the game better. Its a nice calm game for the most part, yet does have some combat to keep it interesting. I love all the things that you can do, but also that you can \"automate\" it with all of the villagers. I'm so excited that we can name our own cities now!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun for what it is it's a very beleivable first person settlement builder. I mostly wanted to leave this comment cause i find it super hilarious when i see reviews from people not reccomending the game and talking about how dissapointing it is....but then they've played the game for over 60 hours.....what!? dude you got more then your money's worth what are you complaining about. I hate this game let me play it for 60 hours cause it's so dissapoiting!? lol what?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my favorite civilization-building games at all times. Can't wait for the Viking version to come out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play with my friends. Hope they add more soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the city building/ survival craft aspects. \r\n\r\nA little grindy at first but that feeling of your settlement thriving under your leadership is top notch.\r\n\r\nWould recommend to anyone looking for a slow paced single player game, although it does offer multiplayer up to 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. The co-op portion really made a difference for this game. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun~ Played with some friends. Do wish the map was bigger, feels a tad empty at times. Quests feel repetitive after a bit as well. Expanding the online map would go a long way. Hope they continue adding features =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a hit or miss, you really get to enjoy the game outside of the two hour mark which can put some people off, but if you have friends to distribute the labor and supply demands then it's a lot more manageable and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best survival game I have ever played, in my humble opinion. One thing that makes this game much more enjoyable for the average player is turning of stamina consumption and villager consumption. One more quality of life setting is the amount of experience earned. It makes the game a little more enjoyable because you are not forced to build a ton of things before earning xp and while you are building things the material costs are a little annoying. Also, upgrading as you go is unenjoyable in my opinion. Usually I do enjoy it, but not in MD. Keep in mind that everything I have mentioned is an in-game setting making MD a highly customizable game for everyone's liking. There are settings to make this game incredibly difficult as well. Have fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a survival game and a city builder all rolled into one! I really really like this blend of genres and I hope more studios take a crack at it in the future. The game itself is very slow paced, but if you are into that (I very much am) that can be a selling point rather than a minus as a lot of the negative reviews seem to feel about it. If you enjoyed slapping trees in Valheim and don't mind a slower paced (and far less combat focused) game, this might be for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game for the long term survial and challenge over all of starting a dynasty.\nBut children in the medival times did start working way earlier then the age of 14.\nHaving children be lazy until 14 years of age sets a bad example and i feel the developers should have the children start there apprenitce form the age of 7 years of age at the very least.\nUnless the developers want to set a terrible example by saying that children should waste there\nyoung years on not even helping out with simple chores at home or to help the village.\nIts not child labor for the parents to set a good example for there children.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game, pretty grindy for sure. I wouldn't recommend it if you're looking for storyline related gameplay. I normally skip through the NPC dialogs. But the graphics, sound effects, and really every other thing I enjoy about this game :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game with deep systems and a UI that takes some getting used to. Honestly my main gripe is that the automated villager building and repairing is locked away at the very end of the tech tree when it should be near the very beginning.\n\nAs for the combat, it's very rough. Get good at using a bow and you can win any fight with proper strategizing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is incredible, beautiful, fun and immersive, I've been playing for days and simply can't stop. Kinda reminds me of Skyrim if Skyrim was only about building your nice little houses. Wishing all the best for the developers and can't wait for the game's new updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Tries to be a simulator but isn't, not really. A bit grindy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have been playing this a lot lately with my boyfriend its so aesthetically pleasing and really makes you feel like you're in the medieval times. i love hunting and building, we've been trying to grow our little town and its a really fun process! I have nothing to complain about with this game, give it a try its super fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Step One get high\r\nstep two listen to King Crimson \r\nStep Three get more invested in your medieval life than your real one \r\nStep Four Tick away the moments that make up a dull day \r\nstep five repeat \r\n19/19",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game, it’s great, I’d definitely recommend it but, it does have its fair share of flaws, glitches, bugs and flat out poor game design in some areas but that could just be me. I also played this game so far entirely in co-op, so all my issues and opinions are completely based off that.\n\n[u][b] Pros [/b][/u]\n\n1. The game is genuinely fun, it looks great and plays pretty well. I love building a village and a community, having an heir and building things up. Watching people age and the seasons pass as the village grows.\n\n2. I love the style to everything, the buildings look great along with all the small decor items you can use.\n\n3. It's simple but i love the \"dirtiness\" meter, having to wash up here and there, hearing people comments when im dirty and stink, its funny and adds a good bit of immersion. On top of that i like the immersion, what people are saying and talking about, the comments about you, especially the ones where someone is flirting with you, theyre great.\n\n4. I love the amount of references in the game, there's so many. Running around and i hear a guy commenting about a dream he had that referenced the sims. \n\n5. Romancing someone is really fun. The conversations, the gifts, and the things you can say. Plus i love that they'll clean you up, heal you, or give you something to eat or drink once youre married, small touch but makes things a lot more enjoyable.\n\n[u][b] Cons [/b][/u]\n\n1. Co-op. I'm not sure if it was just me and my gf, but we ran into so many issues. I had several issues on my end but for her the game was constantly breaking. We had to restart our game several times in order to fix things not working properly. \nFor example, she would randomly start having items disappear. If she picked it up, unequipped it, whatever it may be, when that glitch happened everything would just start disappearing for her. \nShe also has an issue of when shes trying to build something, the parts of the building will just be floating like 30 feet away, so shes hitting nothing on my screen but for her she's building whatever it is. |\nDoors for her would absolutely break, if she goes to move a building the door would suddenly freak out. The door wouldnt be in the right spot and would start making extremely loud perpetual screeching sounds.\nShe would also be unable to interact with crafting and workbenches, it would happen for me to where we couldnt use the well at all anymore and would have to move it.\nIt'd also just happen randomly where she just couldnt interact with things, such as cut down trees, or picking items up.\nMost of these issues only happened to her, so it was really odd and i can only assume it was due to co op.\n\n2. Picking things up is extremely annoying sometimes for seemingly no reason. I would have to spam E over and over then itd eventually pick the item up. So many times id press E, walk away and realize i never picked it up, this happens a lot.\nI'm not sure why but it feels like the hit box for picking things up is off as well, so often i have to look way above or below an item to grab it, in both first and 3rd person.\n\n3. Combat. At this point if im fighting people, i only use a bow. Using a melee weapon is way to slow and sluggish so i almost get guaranteed hit every time i swing. Shields are great though, i love using them to tire the enemy out and get away then eventually pull my bow out.\nThe hit registration feels way off too, several time id hit a deer, moose, or bear in the head or body and just nothing happens like my arrow went into the void. I've tested this many times now, id try shooting something like a deer from as close as i can from its side so its impossible to miss and nothing.\nThis happens with melee combat too, seemingly if im aiming at the target while theyre running at me i'll miss, but if i swing early it hits most of the time. I use melee for wolves and boar, as they charge i swing early and they run into it.\n\n4. Building. There's an obstacle in the way all the time somehow. You cant destroy rocks, can't terraform, and cant seem to place things exactly how you want. I dont care for my house being on stilts but if theres even a slight incline, my house is put on one. The roads are cosmetic apparently which honestly killed so much of my motivation for wanting to build, customize and decorate a big city. The building is just so finicky, theres rocks every where that you cant get rid of or destroy so they're in the way. It makes no sense and its so annoying when i have completely free space with nothing in the way and i still get the obstacle in the way message. \n\n4.5. The NPC pathing and Roads. Roads only being cosmetic takes a lot away from the game imo. Makes it where you're almost forced to use the base game roads and bridges and build around that. Unfortunately where we built our village theres a cliff that splits the 2 areas and now people walk all the way around the entire mountain to get to the other side when they could easily take the road we placed but they dont. Forcing us to have to move everything and set it up so the farmers can get to the farms. On top of the that the bridges are also extremely finicky and im not sure if those are just for cosmetic or not but it is such an infuriating task to build a walk way up a hill side. Id absolutely love more creative freedom with building. Like terraforming, removing the rocks, allowing to customize the looks of building like having extra rooms, 2 stories or a porch. \n\n5. Gameplay and the Herald. At the time of writing this, we're at year 6. We have a little over 50 villagers, but my god was the requirements brutal in the beginning. My gf would manage the town while id spend hours chopping down forests due to the constant need for wood for both building and villager needs, it was ridiculous. Taxes skyrocketed but thats to be expected since we built A LOT of stuff. \n2nd is the Herald and quests, in the beginning i had no idea what this quest was but i took it and couldnt complete it in time. Since then we've seen the Herald twice, having it be a random chance he shows up is dumb to me. Id love to name my city and make the crest but making me needlessly wait for him to show up, i just dont get it.\nOn top of all this, it is a very grindy game, but for me, i have to pretty much constantly be doing something to make money for taxes. But, every schematic costs so much so im blowing through money trying to buy things to decorate with. Its starting to slow down now but a little over 60 hours in and im just now hitting a spot in the game where i dont need to constantly be getting money or resources.\n\n6. Armor. idk if its just me but i genuinely feel little to no use for the armor, i havent used it at all. Gives miniscule resist to the heat and cold, so i cant really wear it without dealing with my character crying about being hot or cold nonstop and draining my stats. I use it purely to sell and make money.\n\n[u][b] Personal thoughts and Opinions [/b][/u]\n\n1. Within the first probably 5 hours of playing i've pretty much explored everything. Looted all the abandoned buildings, stole anything and everything from the towns and villagers. It felt like the world was fairly small. With the seasons comes new bandit camp spawns and such but thats really about it, once i been every where i didnt really have any need to go exploring again sadly. It made things feel very barren and took a lot of the fun away.\n\n2. This game imo desperately needs mod support. The amount of people im sure that would love to mod this game, add what they want like custom buildings, decor, customization, game tweaks, items, whatever it may be, it would add so much to the game and would get me playing a lot longer.\n\n3. I love the immersion, but sometimes i just want to get things done, i wish theyd allow you to change and modify a lot more settings. I feel very limited when it comes to that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty chill game, I like playing on Oxbow with a friend to relax. I just wish we could build more and expand bigger!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Before you play, this game is a really slow progressing game with a bit of micro management. Besides that, the feels, the gameplay and everything is good to me, sorta like you immerse into the medieval era and build up from there. Probably will be good playing with friends or family members, as you improve your village to be better and better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "medieval open world crafting\\building at it's finest.  I came over from the VR version of the game (Medieval Dynasty:New Settlement) which is fun in its own right, but MUCH more limited and I love the way the game plays on PC though there is quite a learning curve compared to the VR port.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game allows people to get creative with little to no limits. I got lost in the game and what felt like maybe 2 hrs was 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has so much to do, would recommend to players who want a survival game that is not too difficult with out much gore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great survival-management game. Love all the cheesy references in NPC voice lines.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Medieval Dynasty takes you into a wonderful village-builder, RPG, survival game that lets you customize your game for casual play or more serious, realistic play.  Also allowing you to adjust much of these option during play after the launch of your new game.   MD provides a RPG side and a multiplayer side of the game which offers different maps with different landscapes to build in along with different characters to encounter and ask to join your settlement. My final thoughts are this is a fantastic game that I look forward to playing over and over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game with a lot of attention to detail, great coop!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The concept is basic, but works wonders, just be careful as it is very addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like survival games and city building and this is one of my favorites. It keeps me entertained.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game only found 1 bug so far in 50 hours of playtime which is getting stuck often but there is a helpful unstuck button in the pause menu. Overall would recomend 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun builder, sandboxy, frequent updates with stuff I actually care about. Can't be gay tho sadly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is actually really good, it's quite peaceful and not too hard to learn. I can finally live out my fantasy of becoming a medieval farmer and paying taxes to my king while I serf on his land.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you've experienced the building mechanics on The Forest/Sons of the Forest, you'll understand this game. Its pretty similar except things aren't trying to kill you. Its basically a medieval building sim. Lots of fun with friends!\n\nOnly thing I'd change is that I wish it had a longer tutorial. You kind of fumble your way into figuring it out, but its pretty easy to understand so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxing and fun with lots to do! This is a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have owned this game for some time now and over the years, I have repeatedly come back to this game again and again. Part of this is constant updates from the Devs and the hard-work they put in always just making the game that much better and the other part is that is just a great game!\r\n\r\nWhile it isn't the most exciting of games, it is relaxing and a lot of fun and would recommend to almost anyone!\r\n\r\nAlso gotta love the random things the Villagers say out of the blue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how its user friendly. Not a huge learning curve but enough to still be a challenge without removing the fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good calm long term game, where one can walk away from for a bit and pick right back  up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was bored an looking for a new game and boy am I glad I came across this. What an amazing game. The system to set up your town is a slow grind and becomes exponentially rewarding as you level and do quests, but the pay off is really worth it once you get a good flow going throughout the seasons. Highly recommend for anyone who enjoys survival crafting RPGs - A must play, especially if you enjoy the difficulty phasing of PalWorld, the gathering of Conan Exiles, the wood-gathering of the Forest, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good combination of builder & manager with a little bit of combat if you want it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game. Enjoyed playing with friends and the game is worth the money + Super underrated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game just a bit more advanced if you make it. I'd recommend researching a few beginner tips before diving in, so the beginning grind stage doesn't burn you out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eh, it's an okay game, Theres are quests that are so,so. Nothing to talk about. Managing your village sucks, nothing works proper and is very poorly implemented. I don't hate the game but its not worth the asking price. $15 on a sale is a fair price for the content here. Check out Bellwright if you want one that a little better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really good BUT;\n-Not worth the price, 30€ is way too expensive for what the game has to offer.\n-Serious lack of content\nOn it's own the game is innovant but, it is really lacking some kind of gameplay, all we do is \"manage\" a town, charm girls, kill animals, do quests, build buildings, gather materials and that's it.\n\nThis game should be worth 15€, not more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, minimal complaints. Its a cross between Kingdom come deliverance 1-2 and Manor lords. I thoroughly enjoyed this solo and have yet to play multiplayer but I cant imagine that would be less fun. Can't even describe the amount of pull this game had on my mind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game, played it a lot with my fiance and we're having a lot of fun with it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down, the best of the \"<insert theme here> Dynasty\" games out there. Polished, pretty and worth the time. Gameplay settings let you really customize your individual experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yesterday, in my village. I whistle to summon my horse. She appeared on compass. I turned in that direction, there was a house. Suddenly the door opened, my horse came out, gently walked down the stairs and came to me. Good girl!!! :-)\nLove the game. Very relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite only having two maps, this is a game with a lot of depth to it.  How do you spend your day?  Fulfilling tasks?  Building your settlement?  Exploring the land?  There's never enough time to do everything, so you have to decide what feel right at the moment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have been having a lot of fun with this. Mostly farming, but some of the combat is exciting too. Would recommend if you want to chill and build. Looking forward to all the upcoming goodies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started out as a pioneer, built a village from scratch, fought bandits and hunted bears. Now I clean manure from the pigsty and make cheese...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spent 500hrs decorating, need more decorations. 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for a while now, Medieval Dynasty is definitely worth checking out. Playing solo is good and all, but I will say that it's definitely much better playing with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nach einem weiteren Versuch muss ich mein Review etwas überarbeiten. Ich finde immer noch, dass der Spread zwischen Einkauf und Verkauf unrealistisch hoch ist. Ausserdem muss man - zumindest am Anfang - viel Zeit damit verbringen von a nach b zu gelangen. Die Dialoge klicke ich meistens einfach durch und habe auch nicht den Eindruck da etwas zu verpassen. Wenn man aber auf Aufbau/Survival Spiele steht, macht das Spiel auch eine Menge richtig. Für die große Liebe fehlt schon noch recht viel, aber man kann schon Spass haben.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "okay yes the grind is real but they make it enjoyable with the beautiful landscape and music, achievements come often enough to make you want to continue",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very detailed and you have to be strategic. Very fun in co-op as well! Remarried my real-life husband and had another baby with him and everything, lol!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A historically inclined Stardew for those who want to set up a village with their lover or best friends! Would recommend, and it plays fairly well on my Steam deck, but I do have it plugged into a monitor via the dock.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the custom difficulty settings, you get to choose what kind of experience you have, which dictates the amount of fun you have. I only wish animal husbandry was more in depth and less random, trying to get a completely black coated foal has been a near impossible task so far. Still 10/10 though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very immersive game with good game mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a very grindy game, if you have a lot of freetime its a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy sandbox adventure in medieval times, from refuge to Bailiff of your own town, path from common peasant to nobleman with your own family crest.\r\nGame isn't perfect but fun if you like slow development and farming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "has sword combat if you get past the 60 hours of tree chopping and walking sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I work my bum off at office and then I come home and work my bum off in the Valley. 10/10 experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very enjoyable village building sim, and definitely the best of the Dynasty franchise (with Sengoku coming in a close 2nd) -- highly recommend! :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've enjoyed 99% of my 237 hours in this game and I likely will play more in the future. If that's not a positive recommendation, I don't know what is. :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Bueno en juego , lento si lo juegas solo , recomiendo con amigos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s basically Minecraft, but with taxes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've bought this game on every platform. It isn't perfect but it is definitely fun.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I played this game 2 or 3 years ago on a friends comp, and decided to give it another try as it was on sale and what a disappointment. \r\n\r\nFor all these years, devs decided to create DLCs instead of fixing what has been requested by the community. \r\n\r\nPros :\r\n- Nice graphics\r\n- since one update, finally the ability to set tasks according to the season.\r\n\r\nCons :\r\n- Storyline(s) sucks massively. After a couple of quests (dialogs are in text format, no voice acting, no cinematics), you'll just randomely click on the answer line until the discussion is over.\r\n- Quests mostly consist of going at the opposite side of the map for some minor task, back and forth, or gathering random items.\r\n- NPCs have been a big nono for years. They'll do the same task, repeat the same lines, over and over and interacting with them rapidly becomes something you avoid.\r\n- Random events are almost inexistant, roads are empty if you don't count the rare bandit camps happenning once every X seasons, or the transporter asking for a wooden wheel for his cart.\r\n- Animals and Ressources spawns don't make any sense : straws won't grow back, animals spawn randomly over the map (sometimes a couple of foxes near rabbits) and magically replenish from one season to the next.\r\n- Romance is boring, as no effort have been put into the NPCS as mentionned above.\r\n- Inability to level the terrain, forcing you to build your village in flat-ish areas.\r\n- Replayability is non existent.\r\n- Not being able to grow apples, cheeries, pears from seeds as it can only be bought at the trader or found in loot crates.\r\n- A game set in high medieval era Poland that has no mention of Christianity whatsoever, please... Instead, devs decided to create only pagan props with no story behind it.\r\n- Dead villagers just vanish from the game. No cemetaries, no \"Village history\" element that would give a little background to the npcs, nothing. \r\n- No mention of doctors or surgeons, just an herbalist creating potions and invisible villagers.\r\n- No ability to form troops, guards or any raiding squad against bandit camps. Also, the village being safe from raiders and bandits, rendering the palissade only for esthetic purposes.\r\nI'll eventually update this review later.\r\n\r\nI was optimistic and wanted to get a couple of DLCs, but since no effort have been put into the base game, i'll pass on it, and suggest people interested get this game ONLY when it's on sale around 10 bucks as it isn't worth more, in my opinion.",
      "voted_up": false,
      "votes_helpful": 110
    },
    {
      "review": "The latest updates are just DLCs, and frankly, they’re extremely uninspired. You can’t call something a “Labour of Love” when there’s barely any end-game content. You reach a point where you have everything you need, and even the storyline isn’t in good shape — it’s very poorly developed.\n\nYou could have added animals, new co-op maps, new buildings, new technologies, faith systems, churches, new quests, more interactions with the environment, additional road types — anything. Echoes of Nature is decent, but it should have been part of the base game from the start.\n\nI get it, this isn’t a combat-focused game, and you don’t want to add raids or mechanics that require fighting. Fine. But in that case, at least add more decorations and meaningful end-game content. I’m very disappointed with the recent updates; they just feel like a lack of ideas.\n\nIf you can’t figure out what the community wants, then develop the modding side properly (and stop using the excuse that it “doesn’t work”). Any Unreal Engine game can support mods. Let players create new maps and updates — people who aren’t even being paid.\n\nThe game is very promising. I’ve played it many times, but once you get to the late game, it becomes boring and you have to start over. Out of a hundred possible improvements, you implemented maybe two of the least meaningful ones. I can’t recommend the game for the long run anymore — you play it once, and that’s it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Devs are adding a \"streamer\" to the game. That should tell you everything you need to know about this game and why you should avoid it like the plague.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Seems a bit unfair to throw this into the \"not recommended\" category, but right now there are just too many glaring issues to ignore.\r\n\r\nThere are two maps in the game at the moment. One is an open-ended mode where all recipes are unlocked and you just focus on surviving like most open-world survival games. The other contains the main story.\r\n\r\nRight off the bat, the writing in this game is bad, and I mean BAD. There’s a ton of dialogue that drags on way too long without being engaging, full of corny, half-baked jokes that just don’t land. It constantly breaks immersion and makes you stop and think, \"Who the hell wrote this corny stuff?\"\r\n\r\nGameplay-wise, it’s... fine. Not bad, not good, just painfully meh. I can have some semblance of fun while playing, but it still leaves a lot to be desired. Hunting is easily the most enjoyable thing to do, or going out looking for a bandit fight.\r\n\r\nWhat’s odd is that there are far more mechanics here than something like Green Hell, yet somehow it’s nowhere near as engaging or exciting. Despite having RPG-like elements, it’s not RPG enough, and it’s not survival enough. It sits awkwardly in this middle ground that doesn’t quite work.\r\n\r\nTo top it all off, the menus are also pretty rough around the edges. I’d personally wait and see how further development goes before buying in.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, maybe not a bad game if you purchase it on discount. I was led to believe the devs had learned their lesson about under-delivering on early-access. They at least made a show of that, and they won a lot of positive reviews through that little show, and so they stopped making good on it.\n\nApparently players are supposed to just accept the slop we've got, and be thankfully if they slop anything else on.\n\nThey added a very limited character creation system post-release to compensate for calling it an RPG without much RPG to the game. The male and female models barely even differ in creation -- same faces, and even the same hairstyles with a braided one added for the female options. I've tested for replayability, and ultimately it's a struggle not to have every character look the same, because of course they do. This wouldn't be so bad if it was a work-in-progress, but instead they're paywalling any improvements.... And it all looks fairly cheesy anyway.\n\nI wouldn't recommend paying more than 50% for this, because that's as much effort as the devs put in. And they expect you to just accept it. It's not worth more than 50%. I'll change this review if the dev has another sudden change-of-heart and show-of-interest in respecting their players as anything more than cash-cows to milk at the milking station.\n\n(Edit: While I appreciate the dev response, there is an admin representing you and telling us players to suck it up and be satisfied with what slop we get. Sengoku Dynasty provides the same content you are paywalling, but for free. Lastly, though you are paywalling cosmetics in the game, we are talking about a game that is essentially only a builder and life-sim, with pretty avoidable and unsatisfying combat -- it is little more than a chill, cosmetics-based game. Worse, it has an extremely sub-par character creation system with any expected improvements easily expected to be paid content...and those of us who watched this development closely know the character-creation system was just slopped together and bandaged on to a game wounded by bad reviews for failing at the sandbox and RPG features that are promised. I do appreciate devs taking time out to respond, but I don't hardly buy the excuses.... Working on a new game is great, but I hope you recognize my feelings about the state this game is being left in will absolutely ensure I have no interest in purchasing your new game -- had I l read your admin's commentary before the two hours had elapsed for me to get a refund, I promise you I would have refunded this game. I resent the fact I am stuck with this game I haven't even played since shortly after leaving this review.)\n\n(Edit: Your admin here got Green Hell removed from my wishlist just by association with this game. Respectful communications with your players can make or break a game development company, eh?)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is just so stale, it still feels early access and the things they are choosing to spend their time developing is just out of touch. content updates are pitiful... \"garden decorations - really?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is fun until you realize it's a simulation inside a simulation. Your NPC villagers are for show only. They are not actually doing anything. Very Truman Show esque.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MD is fun for a while don't get me wrong, but it seriously needs modding support.... Like come on if you are going to be slow as hell on updates hand it over to the players! Mods would be a game changer! Personal suggestion just play Bellwright. At least its modded...\n\nUPDATE: After the road map update that was just posted I'm officially out! That's it? Seriously? Without mods this game is officially dead! Don't waste your money. There are better games to spend your money on. Apparently, they have a new game in the works, but as slow as these devs are i'm guessing 5 years plus until release date...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "sadly another game that rather gets DLCs for cashgrab instead of fixing bugs or adding mager game content",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was.. alright in the beginning, cool concept fun to start your own little settlement but then managing the workers and everything is so.. convoluted? like the menu is really annoying to filter through and not to mention the bugs. I played single player initially to try out the game and get caught up to speed of how it works cause some friends had already been playing for a few days before me but then I couldn't assign a worker to a home or workplace for some reason?? and then when i did start playing with a friend there were just a bunch of tiny things and bugs that made to game more like a chore instead of a fun thing to do. \n\nAlso the whole thing of you can't manually assign more than 1 man and 1 woman per house honestly just annoying cause you don't get the full 3-4 working people per home, that spot is reserved for the child and (obviously) the kid has to grow up before they can do anything. \n\nGreat concept, bad execution\n\nEdit: also me and my friend kinda figured out that the publisher is just hiring random small developers to churn out a bunch of games with dynasty slapped on them that are basically just different cultured renditions of the same game and then dropping them and hiring another group for the next game, i assume so they don't have to pay them more or something, but yeah really shitty publisher I think",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a solid game at its core, but there’s a lot of work that needs to be done before I can recommend it, and i genuinely hope that day comes.\n\n1. The game feels very basic in regards to NPCs. Super generic and robotic. You don’t even want to interact with anyone. And having animals spawn in specific places is really boring, it should be at least relatively mixed. \n\n2. Villagers are too needy. They’re like children who can’t do anything for themselves. My little village is right on the lake and surrounded by animals and trees, mushrooms and all kinds of stuff. Why do I have to personally supply them at all? I’ve got enough to do without babysitting them until I manage to scrape out a halfway self sufficient village. \n\n3. Why can’t we repair the abandoned structures that are strewn across the map? Why render them as static?\n\n4. Someone already said this but there is no “human” threat. No raids or anything. Once you get decently far the whole game is just a chore, for no reason. You can go bigger and better but for what? More trivial problems? Pass. I’d love to be able to raise an army and take over other towns, and fend off rivals.\n\n5. Animals at buffed to much. A clean shot behind the shoulder should klll a deer or any animal that size almost where it stands. And at least 80% of the arrows should be recoverable. \n\n6. You should be able to interact with more things around you in town, even if there’s a penalty sometimes. \n\nIn summary, it need to take more from Banner/Manorlords, Skyrim and Fable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time with this game, get bellwright instead, bellwright is way better than this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Thanks for the extensive tutorial....NOT!  This game is so confusing!  My initial villagers are starving, thirsty, won't work, have no tools, are useless, and I have to make all the tools, food, and water, because there's nothing in the game explaining how to use these non-intuitive feature sets.  That game hits the bullseye, but the bullseye they're hitting is on an entirely other shooting range, leaving you bewildered and confused as to how anything works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dont buy it, you need to google all steps to set up your village. Moreover quest are bugged, it's like alpha that was a years ago.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "is there anything besides working to pay taxes? i thought you were suppose to start a dynasty, not a village..\r\nonly played for a in game year but it felt kinda bland the whole time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First thing. why is my characters voice over a yank when they didnt even exist in the medieval period second of all why is it i have to run around like a twat to try and pay taxed when my own village should only pay tax to the king. third and last thing is why can i not go around killing npcs. if i wanted a game that is a building,hunting and taxing sim i wouldve just bent over to the goverment",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "aiming with controller is bad.  This is because the game does not feature view acceleration on controller.\nThere is no balance between fine adjustments when shooting a ranged weapon, and rotating your view to face your opponents.\nIf you prefer to play games on controller, play it on keyboard and mouse instead or don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is incomplete but has lots of potential\r\nWill change later",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrible \"game\", waste of $$$. Feels like an UE5 asset dump, nothing more. If you want Medieval and something worth your time and cash, play Kingdom Come Deliverance 1 & 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "was ein drecks spiel wie kann man das gut finden größte müll ever, und ich mag sowas normal...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Talentless asset flip that bait-and-switched to an unfinished 'release' then tried to pull a DLC train. Avoid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have to make the fucking bucket for the wench I just hired as my village servant to collect water from the well? Bruh. Micromanager simulator. Just busy work, super boring and not rewarding. Better off getting Minecraft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring, no content. Don't buy this game. I probably played about 10-15 hours of this game. (the rest is afk time)\r\nSetup a crop rotation cycle. So crops will grow automated etc. \r\n\r\nBuild all the buildings once, now they will start to cycle back but one level higher. \r\nBasically finished the game in 10 hours. Bored.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's ok, just not what I was looking for. It's a slow village building/managing simulation game. It is definitely not an action rpg game. And that's what I was looking for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For a game so ambitious and potentially interesting, Medieval Dinasty lacking voice acting is the most incomprehensible thing. \n\nThe narrative is heavily dependent on extremely boring text dialogues. Why Render Cube decided to not invest on one of the most immersible and creative aspects of best games is, for me, one of the most strange decisions.\n\nBe able to hear characters expressing vocally their lines adds depth, emotion, and realism to the game, making the experience more immersive and helping players understand dynamically the story and characters.\n\nIt is a sad realization that Medieval Dynasty lack such richness. And this make it a flat, tedious game of endlessly reading texts.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has many issues/bugs, they \"update\" by adding pointless stuff nobody is asking for.\nThe game is also very lacking in many areas such as NPC's and dialog.\nThey're happy to sell DLC but it's not going to fix the game and when people bring this up on the forums they say \"something > nothing\" as if the customer should be happy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I kept waiting for it to get fun and it never did",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just a black screen. beware.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Simp dev is running his own game with unnecessary content and an announced collab with an proven scammer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "All around trash. Not worth a single cent",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Already boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have sunk hours into this, it's not bad for an early access game, but it's meant to be a full game, so I have to say it isn't worth the money in its current state, DLC definitely not worth the money for the amounts of content it adds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I kept coming back to Medieval Dynasty thinking I must have been missing something—some hidden depth or reward that would make all the repetitive gameplay worthwhile. But after many hours, I realized that’s not the case. The game feels like a grind with no real point or meaningful progression. The core loop of gathering materials, crafting, and managing villagers is tedious and lacking any sense of achievement.\n\nDespite the promise of building a thriving medieval village, the gameplay quickly becomes slow and repetitive. Villagers require constant micromanagement, basic mechanics are locked behind arbitrary requirements, and there’s almost no variation or immersion in the world. The NPCs feel lifeless, the quests are dull, and there is no real endgame or purpose once you complete the main objectives.\n\nIn short, Medieval Dynasty is a frustrating experience where you continuously hope for meaningful progress or reward that never comes. It’s a cycle of disappointment and boredom—definitely not worth the time or effort.",
      "voted_up": false,
      "votes_helpful": 133
    },
    {
      "review": "I played this game 2 or 3 years ago on a friends comp, and decided to give it another try as it was on sale and what a disappointment. \r\n\r\nFor all these years, devs decided to create DLCs instead of fixing what has been requested by the community. \r\n\r\nPros :\r\n- Nice graphics\r\n- since one update, finally the ability to set tasks according to the season.\r\n\r\nCons :\r\n- Storyline(s) sucks massively. After a couple of quests (dialogs are in text format, no voice acting, no cinematics), you'll just randomely click on the answer line until the discussion is over.\r\n- Quests mostly consist of going at the opposite side of the map for some minor task, back and forth, or gathering random items.\r\n- NPCs have been a big nono for years. They'll do the same task, repeat the same lines, over and over and interacting with them rapidly becomes something you avoid.\r\n- Random events are almost inexistant, roads are empty if you don't count the rare bandit camps happenning once every X seasons, or the transporter asking for a wooden wheel for his cart.\r\n- Animals and Ressources spawns don't make any sense : straws won't grow back, animals spawn randomly over the map (sometimes a couple of foxes near rabbits) and magically replenish from one season to the next.\r\n- Romance is boring, as no effort have been put into the NPCS as mentionned above.\r\n- Inability to level the terrain, forcing you to build your village in flat-ish areas.\r\n- Replayability is non existent.\r\n- Not being able to grow apples, cheeries, pears from seeds as it can only be bought at the trader or found in loot crates.\r\n- A game set in high medieval era Poland that has no mention of Christianity whatsoever, please... Instead, devs decided to create only pagan props with no story behind it.\r\n- Dead villagers just vanish from the game. No cemetaries, no \"Village history\" element that would give a little background to the npcs, nothing. \r\n- No mention of doctors or surgeons, just an herbalist creating potions and invisible villagers.\r\n- No ability to form troops, guards or any raiding squad against bandit camps. Also, the village being safe from raiders and bandits, rendering the palissade only for esthetic purposes.\r\nI'll eventually update this review later.\r\n\r\nI was optimistic and wanted to get a couple of DLCs, but since no effort have been put into the base game, i'll pass on it, and suggest people interested get this game ONLY when it's on sale around 10 bucks as it isn't worth more, in my opinion.",
      "voted_up": false,
      "votes_helpful": 110
    },
    {
      "review": "This game makes the fatal mistake of confusing realism for good gameplay. Yes, a human being cannot move around at a sprint when carrying heavy things like logs. Would the ability to do that make the game better? Yes, unequivocally. Why does a single basic building sometimes take me in-game days to build because I have to hammer every nail in? I dunno, but it's not fun.\n\nStarting to realize that the reason why playtimes in this game are so high is not because the game is that good, it's because it takes hours to achieve anything. If you have a lot of free time and you don't mind doing basically the same annoying, mind-numbing task over and over, then this game is for you.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The latest updates are just DLCs, and frankly, they’re extremely uninspired. You can’t call something a “Labour of Love” when there’s barely any end-game content. You reach a point where you have everything you need, and even the storyline isn’t in good shape — it’s very poorly developed.\n\nYou could have added animals, new co-op maps, new buildings, new technologies, faith systems, churches, new quests, more interactions with the environment, additional road types — anything. Echoes of Nature is decent, but it should have been part of the base game from the start.\n\nI get it, this isn’t a combat-focused game, and you don’t want to add raids or mechanics that require fighting. Fine. But in that case, at least add more decorations and meaningful end-game content. I’m very disappointed with the recent updates; they just feel like a lack of ideas.\n\nIf you can’t figure out what the community wants, then develop the modding side properly (and stop using the excuse that it “doesn’t work”). Any Unreal Engine game can support mods. Let players create new maps and updates — people who aren’t even being paid.\n\nThe game is very promising. I’ve played it many times, but once you get to the late game, it becomes boring and you have to start over. Out of a hundred possible improvements, you implemented maybe two of the least meaningful ones. I can’t recommend the game for the long run anymore — you play it once, and that’s it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Tbh I don't want to rag on the game because its decently made. I just find it horrendously boring. Like its bad. I love the setting & atmosphere, the graphics are pretty decent, not amazing, but they are good. But honestly thats about all. the game play, movement, combat, everything just feels sluggish. The story or quests lines are un interesting(which a fair amount of these games tend to be that way) so i just talk to people I have to talk to and just click responses to get it over with. I just don't have fun with this game and I tried to. My wife and I both. I'd rather play Sengoku. Everything I mentioned here(except for quest interactions) is just better in that game. I respect the Devs for putting so much care into the game as you can tell they were passionate about it, but I just dont enjoy it, and as far as these types of games go, I'd much rather devote my time to to plenty of other village building/survival/colony sims over this one",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Devs are adding a \"streamer\" to the game. That should tell you everything you need to know about this game and why you should avoid it like the plague.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "+ Decoration options\r\n+ basic structure is simple\r\n\r\n- repetitive and dated for the release time\r\n- it being simple also means there's a lack of content and some basic options for construction\r\n- you know exactly the location where you'll build each time if you want to have 1 settlement as opposed to sprawl around the maps\r\n- forum is a mixed bag with some good active accounts & some trolls with forum history where moderation doesn't appear to intervene\r\n\r\nThe review will be adjusted should anything change.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is just not a good game. The interface is about as clunky as I've ever seen. The knowledge interrupts aren't really that helpful (How do I actually supply my villagers? - not at all in the Knowledge tab). There's no easy way to earn money. Quests are just listening to people ramble on for quite a long time or running between two people.\r\n\r\nHunting/combat is a joke. I spent about an hour just trying to hit an animal with a spear. I couldn't get close enough to be effective, even while sneaking. I hit exactly one animal in that time, and it lost about a third of its health.\r\n\r\nPro: The building system is interesting, but it does take too long to build anything.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Honestly, maybe not a bad game if you purchase it on discount. I was led to believe the devs had learned their lesson about under-delivering on early-access. They at least made a show of that, and they won a lot of positive reviews through that little show, and so they stopped making good on it.\n\nApparently players are supposed to just accept the slop we've got, and be thankfully if they slop anything else on.\n\nThey added a very limited character creation system post-release to compensate for calling it an RPG without much RPG to the game. The male and female models barely even differ in creation -- same faces, and even the same hairstyles with a braided one added for the female options. I've tested for replayability, and ultimately it's a struggle not to have every character look the same, because of course they do. This wouldn't be so bad if it was a work-in-progress, but instead they're paywalling any improvements.... And it all looks fairly cheesy anyway.\n\nI wouldn't recommend paying more than 50% for this, because that's as much effort as the devs put in. And they expect you to just accept it. It's not worth more than 50%. I'll change this review if the dev has another sudden change-of-heart and show-of-interest in respecting their players as anything more than cash-cows to milk at the milking station.\n\n(Edit: While I appreciate the dev response, there is an admin representing you and telling us players to suck it up and be satisfied with what slop we get. Sengoku Dynasty provides the same content you are paywalling, but for free. Lastly, though you are paywalling cosmetics in the game, we are talking about a game that is essentially only a builder and life-sim, with pretty avoidable and unsatisfying combat -- it is little more than a chill, cosmetics-based game. Worse, it has an extremely sub-par character creation system with any expected improvements easily expected to be paid content...and those of us who watched this development closely know the character-creation system was just slopped together and bandaged on to a game wounded by bad reviews for failing at the sandbox and RPG features that are promised. I do appreciate devs taking time out to respond, but I don't hardly buy the excuses.... Working on a new game is great, but I hope you recognize my feelings about the state this game is being left in will absolutely ensure I have no interest in purchasing your new game -- had I l read your admin's commentary before the two hours had elapsed for me to get a refund, I promise you I would have refunded this game. I resent the fact I am stuck with this game I haven't even played since shortly after leaving this review.)\n\n(Edit: Your admin here got Green Hell removed from my wishlist just by association with this game. Respectful communications with your players can make or break a game development company, eh?)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Seems a bit unfair to throw this into the \"not recommended\" category, but right now there are just too many glaring issues to ignore.\r\n\r\nThere are two maps in the game at the moment. One is an open-ended mode where all recipes are unlocked and you just focus on surviving like most open-world survival games. The other contains the main story.\r\n\r\nRight off the bat, the writing in this game is bad, and I mean BAD. There’s a ton of dialogue that drags on way too long without being engaging, full of corny, half-baked jokes that just don’t land. It constantly breaks immersion and makes you stop and think, \"Who the hell wrote this corny stuff?\"\r\n\r\nGameplay-wise, it’s... fine. Not bad, not good, just painfully meh. I can have some semblance of fun while playing, but it still leaves a lot to be desired. Hunting is easily the most enjoyable thing to do, or going out looking for a bandit fight.\r\n\r\nWhat’s odd is that there are far more mechanics here than something like Green Hell, yet somehow it’s nowhere near as engaging or exciting. Despite having RPG-like elements, it’s not RPG enough, and it’s not survival enough. It sits awkwardly in this middle ground that doesn’t quite work.\r\n\r\nTo top it all off, the menus are also pretty rough around the edges. I’d personally wait and see how further development goes before buying in.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is just so stale, it still feels early access and the things they are choosing to spend their time developing is just out of touch. content updates are pitiful... \"garden decorations - really?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love medieval games and I love survival games but this one just isn't right. Everything seems so tedious, I suppose that is the correct word. You need a plate for this food, a bowl for that food, a spoon for this food, an entire log to make a hammer, nothing is really explained and short of having to constantly google or youtube is super frustrating to figure out. I'll give an example.\n\nRecruit a villager, villager has needs. You have to put food and water in his homes chest, you have to give him a tool at his work chest or maybe his home chest, even though that tool, food and water is in the villages resources chest. Certain things are shared, certain things aren't. The big well in the middle of my village where I get water doesn't work for them? If some Youtuber didn't tell me a bucket full of creek water kept the new villagers thirst at bay once placed in his chest I would have given up right there. \n\nYou don't really learn anything so you have to buy its schematic. Most games when you discover a bow then you learn how to make it, this game you can have a bow, one you found, but you cannot craft it, you still need to pay for its schematic, the pricing of a lot of goods is a little wonky so you really can't predict if what you are lugging around is worth anything or fractions of a coin so the game ends up being a grind. I'm sure if you spent 100 in-game days building up a perfect ecosystem in your village where everyone is making everything for everyone else it could be neat? But just getting started there seems to be no point, you are building to build more to recruit more to build more and I haven't even gotten to a point where my people can make money if that is even a thing I don't know. \n\nI spent a couple of days mining which with your small carry weight takes multiple trips which I smelted into bars of tin, copper and bronze but I don't know how to make anything because I didn't buy the schematics  so all that ore just sits, weighs too much to carry into town to sell...tedious. I'll stick to Valheim, Green Hell or Sons of the Forest/",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Medieval Dynasty is ... iffy at best. The game often feels rudderless and directionless. You're task with building a medieval community but to what end? The character interactions are wooden, the combat is woeful and the actual act of building and resource gathering is tedious and uninteresting. I feel like if you're really interested in a medieval life simulation you'd be better off getting Kingdom Come Deliverance 1 or 2.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This is the wishdotcom version of Kingdom Come Deliverance, that no-one asked for. Just kidding, it isn't - but it sure markets itself that way. I didn't enjoy the game because it feels generic and static.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is fun until you realize it's a simulation inside a simulation. Your NPC villagers are for show only. They are not actually doing anything. Very Truman Show esque.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had my first play for a few weeks back in the early development days which i built a small village, that's when the Bandits T-posed when you hit them and i thought it was going to have bandit attacks etc, but i stopped cos of new games and didn't get to see, Anyway, i gave it another shot recently on a new save after seeing all the recent updates, but i came to realise that all this is, it is a PVE farming & family sim builder and management system game, I kinda felt let down and lost interest. There are no bandit attacks nor do they roam, They do attack you at there camps, things like that but All you do is build raise a family upgrade gather and store do bland quests rinse and repeat. They got another game that's a copy paste of this game but Asian dynasty era, which is being updated and they have a new game coming out in 2026 of a Viking era, Again another copy paste of the previous 2 games lol. I'm assuming they have or will have the exact same game mechanics. If this game had more exciting features it would be amazing, sadly i read that they have no interest in adding those. you might get 24 hrs game play before you start getting bored imo. i'll probably come back here and there cos you never know, they might change the game direction on the other 2, time will tell but i feel as if its all just copy and pasted generic farming simulators they are releasing. Quick example, Reign of kings and Heat & Homestead are exact copy's of each other, ones Med evil and the other is western, Both very unfinished and abandoned games by another Development team that in no longer operating (code-hatch, Cough Cough) But good game if you just want to chill, and watch your NPC villagers farm and stock up your storehouse so they can survive rinse and repeat.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Came back to the game in the hopes that they finally made it better, it feels like they made it worse.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "MD is fun for a while don't get me wrong, but it seriously needs modding support.... Like come on if you are going to be slow as hell on updates hand it over to the players! Mods would be a game changer! Personal suggestion just play Bellwright. At least its modded...\n\nUPDATE: After the road map update that was just posted I'm officially out! That's it? Seriously? Without mods this game is officially dead! Don't waste your money. There are better games to spend your money on. Apparently, they have a new game in the works, but as slow as these devs are i'm guessing 5 years plus until release date...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is just pointless grind, not even grind with a reward, just grind\r\n\r\nYou build your house, you want someone to come live in your village? They want their own house, no sharing\r\nThey want water, from the stream beside the village? \r\nARE YOU MAD! You need to build a well, oh but... DRINK FROM A WELL????\r\nNope, need a bucket, so build a workshop.... oh but... bucket needs planks, same workshop? \r\nHELL NO, different type of workshop\r\nOk, you got planks, make bucket.... but the bucket needs to be stored.... IN ANOTHER BUILDING, ok build item storage...\r\nWhere to store the full buckets of water... item storage? HAHAHHA NOPE\r\nBuild another building, food storage, for full buckets of water.\r\nSo finally my one villager has water! I only had to build 6 buildings myself to get it....\r\n\r\nThis is the thing, you think its a game where you get a village to help you - but you basically have to build the whole village yourself before anything works, even when you get villagers one can cut down like 5 logs a day, even basic buildings are 30 logs. This is a tree chopping simulator.\r\n\r\nThe quests are boring fetch slogs from one side of the map to another with the stamina bar of an elderly athsmatic paraplegic - each year the same quests \"re-appear\" with the same people...\r\n\r\nThe game is basically the lest amount of effort it would take to make a game in order to create a video of gameplay to get people to buy it\r\n\r\nThe one positive point I can think of is the endless, mindless drudgery, chores, backbreaking work and long hours make it possibly the most historically accurate simulation if what it was really like to be a medieval serf",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "sadly another game that rather gets DLCs for cashgrab instead of fixing bugs or adding mager game content",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is fun until you get to get to the point you are done building and you wanna make you village run by it self, good luck with that! it's impossible to make it run properly! it's not logical way to complicated and frustrating and it made me stop playing the game so thumbs down, you have been warned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "to sum up this game in a few words, its to little for to much.\r\nthis game acts like this is going to be some massive adventure with combat and a bit of city building mixed into it, but it isnt. city building is the only thing this game really has to offer, and unless you dump hours and hours into it you wont get much. one of the reasons it is like this is because your settlers/people work slower than shit. for meat via the hunting lodge it takes them hours and hours to get 4 to 6 things of meat. (and to dry them) funny thing is that the player can go up and punch rabbits to death 3 times and match that in under an hour in game.\r\ncombat on the other hand is non-existent. it took me that 15 hours to find 3 bandits. they were push overs. there is nothing else to say about it than it flat out sucks and needs added to or reworked.\r\ni wish steam had a neutral rather than a good or bad rating because i dont hate this game but it has far to little for me to say good but far to much to say bad. 4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was.. alright in the beginning, cool concept fun to start your own little settlement but then managing the workers and everything is so.. convoluted? like the menu is really annoying to filter through and not to mention the bugs. I played single player initially to try out the game and get caught up to speed of how it works cause some friends had already been playing for a few days before me but then I couldn't assign a worker to a home or workplace for some reason?? and then when i did start playing with a friend there were just a bunch of tiny things and bugs that made to game more like a chore instead of a fun thing to do. \n\nAlso the whole thing of you can't manually assign more than 1 man and 1 woman per house honestly just annoying cause you don't get the full 3-4 working people per home, that spot is reserved for the child and (obviously) the kid has to grow up before they can do anything. \n\nGreat concept, bad execution\n\nEdit: also me and my friend kinda figured out that the publisher is just hiring random small developers to churn out a bunch of games with dynasty slapped on them that are basically just different cultured renditions of the same game and then dropping them and hiring another group for the next game, i assume so they don't have to pay them more or something, but yeah really shitty publisher I think",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s a solid game at its core, but there’s a lot of work that needs to be done before I can recommend it, and i genuinely hope that day comes.\n\n1. The game feels very basic in regards to NPCs. Super generic and robotic. You don’t even want to interact with anyone. And having animals spawn in specific places is really boring, it should be at least relatively mixed. \n\n2. Villagers are too needy. They’re like children who can’t do anything for themselves. My little village is right on the lake and surrounded by animals and trees, mushrooms and all kinds of stuff. Why do I have to personally supply them at all? I’ve got enough to do without babysitting them until I manage to scrape out a halfway self sufficient village. \n\n3. Why can’t we repair the abandoned structures that are strewn across the map? Why render them as static?\n\n4. Someone already said this but there is no “human” threat. No raids or anything. Once you get decently far the whole game is just a chore, for no reason. You can go bigger and better but for what? More trivial problems? Pass. I’d love to be able to raise an army and take over other towns, and fend off rivals.\n\n5. Animals at buffed to much. A clean shot behind the shoulder should klll a deer or any animal that size almost where it stands. And at least 80% of the arrows should be recoverable. \n\n6. You should be able to interact with more things around you in town, even if there’s a penalty sometimes. \n\nIn summary, it need to take more from Banner/Manorlords, Skyrim and Fable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time with this game, get bellwright instead, bellwright is way better than this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont buy it, you need to google all steps to set up your village. Moreover quest are bugged, it's like alpha that was a years ago.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "is there anything besides working to pay taxes? i thought you were suppose to start a dynasty, not a village..\r\nonly played for a in game year but it felt kinda bland the whole time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "aiming with controller is bad.  This is because the game does not feature view acceleration on controller.\nThere is no balance between fine adjustments when shooting a ranged weapon, and rotating your view to face your opponents.\nIf you prefer to play games on controller, play it on keyboard and mouse instead or don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nothing ever happens\n\nResponse to the dev:\n\nHi dev, your game is promising and I would like to like it however the gameplay is very boring and nothing of usage ever happens. There is no purpose to building anything, the game takes tens of hours before a basic city can function and automation sucks.\n\nSo overall your game is just not very well thought out and you need to find a way to make the story relevant and have things happen.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is incomplete but has lots of potential\r\nWill change later",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrible \"game\", waste of $$$. Feels like an UE5 asset dump, nothing more. If you want Medieval and something worth your time and cash, play Kingdom Come Deliverance 1 & 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "was ein drecks spiel wie kann man das gut finden größte müll ever, und ich mag sowas normal...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Talentless asset flip that bait-and-switched to an unfinished 'release' then tried to pull a DLC train. Avoid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have to make the fucking bucket for the wench I just hired as my village servant to collect water from the well? Bruh. Micromanager simulator. Just busy work, super boring and not rewarding. Better off getting Minecraft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring, no content. Don't buy this game. I probably played about 10-15 hours of this game. (the rest is afk time)\r\nSetup a crop rotation cycle. So crops will grow automated etc. \r\n\r\nBuild all the buildings once, now they will start to cycle back but one level higher. \r\nBasically finished the game in 10 hours. Bored.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's ok, just not what I was looking for. It's a slow village building/managing simulation game. It is definitely not an action rpg game. And that's what I was looking for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For a game so ambitious and potentially interesting, Medieval Dinasty lacking voice acting is the most incomprehensible thing. \n\nThe narrative is heavily dependent on extremely boring text dialogues. Why Render Cube decided to not invest on one of the most immersible and creative aspects of best games is, for me, one of the most strange decisions.\n\nBe able to hear characters expressing vocally their lines adds depth, emotion, and realism to the game, making the experience more immersive and helping players understand dynamically the story and characters.\n\nIt is a sad realization that Medieval Dynasty lack such richness. And this make it a flat, tedious game of endlessly reading texts.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has many issues/bugs, they \"update\" by adding pointless stuff nobody is asking for.\nThe game is also very lacking in many areas such as NPC's and dialog.\nThey're happy to sell DLC but it's not going to fix the game and when people bring this up on the forums they say \"something > nothing\" as if the customer should be happy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I kept waiting for it to get fun and it never did",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just a black screen. beware.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Simp dev is running his own game with unnecessary content and an announced collab with an proven scammer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "All around trash. Not worth a single cent",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Already boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have sunk hours into this, it's not bad for an early access game, but it's meant to be a full game, so I have to say it isn't worth the money in its current state, DLC definitely not worth the money for the amounts of content it adds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I kept coming back to Medieval Dynasty thinking I must have been missing something—some hidden depth or reward that would make all the repetitive gameplay worthwhile. But after many hours, I realized that’s not the case. The game feels like a grind with no real point or meaningful progression. The core loop of gathering materials, crafting, and managing villagers is tedious and lacking any sense of achievement.\n\nDespite the promise of building a thriving medieval village, the gameplay quickly becomes slow and repetitive. Villagers require constant micromanagement, basic mechanics are locked behind arbitrary requirements, and there’s almost no variation or immersion in the world. The NPCs feel lifeless, the quests are dull, and there is no real endgame or purpose once you complete the main objectives.\n\nIn short, Medieval Dynasty is a frustrating experience where you continuously hope for meaningful progress or reward that never comes. It’s a cycle of disappointment and boredom—definitely not worth the time or effort.",
      "voted_up": false,
      "votes_helpful": 133
    },
    {
      "review": "I played this game 2 or 3 years ago on a friends comp, and decided to give it another try as it was on sale and what a disappointment. \r\n\r\nFor all these years, devs decided to create DLCs instead of fixing what has been requested by the community. \r\n\r\nPros :\r\n- Nice graphics\r\n- since one update, finally the ability to set tasks according to the season.\r\n\r\nCons :\r\n- Storyline(s) sucks massively. After a couple of quests (dialogs are in text format, no voice acting, no cinematics), you'll just randomely click on the answer line until the discussion is over.\r\n- Quests mostly consist of going at the opposite side of the map for some minor task, back and forth, or gathering random items.\r\n- NPCs have been a big nono for years. They'll do the same task, repeat the same lines, over and over and interacting with them rapidly becomes something you avoid.\r\n- Random events are almost inexistant, roads are empty if you don't count the rare bandit camps happenning once every X seasons, or the transporter asking for a wooden wheel for his cart.\r\n- Animals and Ressources spawns don't make any sense : straws won't grow back, animals spawn randomly over the map (sometimes a couple of foxes near rabbits) and magically replenish from one season to the next.\r\n- Romance is boring, as no effort have been put into the NPCS as mentionned above.\r\n- Inability to level the terrain, forcing you to build your village in flat-ish areas.\r\n- Replayability is non existent.\r\n- Not being able to grow apples, cheeries, pears from seeds as it can only be bought at the trader or found in loot crates.\r\n- A game set in high medieval era Poland that has no mention of Christianity whatsoever, please... Instead, devs decided to create only pagan props with no story behind it.\r\n- Dead villagers just vanish from the game. No cemetaries, no \"Village history\" element that would give a little background to the npcs, nothing. \r\n- No mention of doctors or surgeons, just an herbalist creating potions and invisible villagers.\r\n- No ability to form troops, guards or any raiding squad against bandit camps. Also, the village being safe from raiders and bandits, rendering the palissade only for esthetic purposes.\r\nI'll eventually update this review later.\r\n\r\nI was optimistic and wanted to get a couple of DLCs, but since no effort have been put into the base game, i'll pass on it, and suggest people interested get this game ONLY when it's on sale around 10 bucks as it isn't worth more, in my opinion.",
      "voted_up": false,
      "votes_helpful": 110
    },
    {
      "review": "This game makes the fatal mistake of confusing realism for good gameplay. Yes, a human being cannot move around at a sprint when carrying heavy things like logs. Would the ability to do that make the game better? Yes, unequivocally. Why does a single basic building sometimes take me in-game days to build because I have to hammer every nail in? I dunno, but it's not fun.\n\nStarting to realize that the reason why playtimes in this game are so high is not because the game is that good, it's because it takes hours to achieve anything. If you have a lot of free time and you don't mind doing basically the same annoying, mind-numbing task over and over, then this game is for you.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The latest updates are just DLCs, and frankly, they’re extremely uninspired. You can’t call something a “Labour of Love” when there’s barely any end-game content. You reach a point where you have everything you need, and even the storyline isn’t in good shape — it’s very poorly developed.\n\nYou could have added animals, new co-op maps, new buildings, new technologies, faith systems, churches, new quests, more interactions with the environment, additional road types — anything. Echoes of Nature is decent, but it should have been part of the base game from the start.\n\nI get it, this isn’t a combat-focused game, and you don’t want to add raids or mechanics that require fighting. Fine. But in that case, at least add more decorations and meaningful end-game content. I’m very disappointed with the recent updates; they just feel like a lack of ideas.\n\nIf you can’t figure out what the community wants, then develop the modding side properly (and stop using the excuse that it “doesn’t work”). Any Unreal Engine game can support mods. Let players create new maps and updates — people who aren’t even being paid.\n\nThe game is very promising. I’ve played it many times, but once you get to the late game, it becomes boring and you have to start over. Out of a hundred possible improvements, you implemented maybe two of the least meaningful ones. I can’t recommend the game for the long run anymore — you play it once, and that’s it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Tbh I don't want to rag on the game because its decently made. I just find it horrendously boring. Like its bad. I love the setting & atmosphere, the graphics are pretty decent, not amazing, but they are good. But honestly thats about all. the game play, movement, combat, everything just feels sluggish. The story or quests lines are un interesting(which a fair amount of these games tend to be that way) so i just talk to people I have to talk to and just click responses to get it over with. I just don't have fun with this game and I tried to. My wife and I both. I'd rather play Sengoku. Everything I mentioned here(except for quest interactions) is just better in that game. I respect the Devs for putting so much care into the game as you can tell they were passionate about it, but I just dont enjoy it, and as far as these types of games go, I'd much rather devote my time to to plenty of other village building/survival/colony sims over this one",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Devs are adding a \"streamer\" to the game. That should tell you everything you need to know about this game and why you should avoid it like the plague.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "+ Decoration options\r\n+ basic structure is simple\r\n\r\n- repetitive and dated for the release time\r\n- it being simple also means there's a lack of content and some basic options for construction\r\n- you know exactly the location where you'll build each time if you want to have 1 settlement as opposed to sprawl around the maps\r\n- forum is a mixed bag with some good active accounts & some trolls with forum history where moderation doesn't appear to intervene\r\n\r\nThe review will be adjusted should anything change.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is just not a good game. The interface is about as clunky as I've ever seen. The knowledge interrupts aren't really that helpful (How do I actually supply my villagers? - not at all in the Knowledge tab). There's no easy way to earn money. Quests are just listening to people ramble on for quite a long time or running between two people.\r\n\r\nHunting/combat is a joke. I spent about an hour just trying to hit an animal with a spear. I couldn't get close enough to be effective, even while sneaking. I hit exactly one animal in that time, and it lost about a third of its health.\r\n\r\nPro: The building system is interesting, but it does take too long to build anything.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Honestly, maybe not a bad game if you purchase it on discount. I was led to believe the devs had learned their lesson about under-delivering on early-access. They at least made a show of that, and they won a lot of positive reviews through that little show, and so they stopped making good on it.\n\nApparently players are supposed to just accept the slop we've got, and be thankfully if they slop anything else on.\n\nThey added a very limited character creation system post-release to compensate for calling it an RPG without much RPG to the game. The male and female models barely even differ in creation -- same faces, and even the same hairstyles with a braided one added for the female options. I've tested for replayability, and ultimately it's a struggle not to have every character look the same, because of course they do. This wouldn't be so bad if it was a work-in-progress, but instead they're paywalling any improvements.... And it all looks fairly cheesy anyway.\n\nI wouldn't recommend paying more than 50% for this, because that's as much effort as the devs put in. And they expect you to just accept it. It's not worth more than 50%. I'll change this review if the dev has another sudden change-of-heart and show-of-interest in respecting their players as anything more than cash-cows to milk at the milking station.\n\n(Edit: While I appreciate the dev response, there is an admin representing you and telling us players to suck it up and be satisfied with what slop we get. Sengoku Dynasty provides the same content you are paywalling, but for free. Lastly, though you are paywalling cosmetics in the game, we are talking about a game that is essentially only a builder and life-sim, with pretty avoidable and unsatisfying combat -- it is little more than a chill, cosmetics-based game. Worse, it has an extremely sub-par character creation system with any expected improvements easily expected to be paid content...and those of us who watched this development closely know the character-creation system was just slopped together and bandaged on to a game wounded by bad reviews for failing at the sandbox and RPG features that are promised. I do appreciate devs taking time out to respond, but I don't hardly buy the excuses.... Working on a new game is great, but I hope you recognize my feelings about the state this game is being left in will absolutely ensure I have no interest in purchasing your new game -- had I l read your admin's commentary before the two hours had elapsed for me to get a refund, I promise you I would have refunded this game. I resent the fact I am stuck with this game I haven't even played since shortly after leaving this review.)\n\n(Edit: Your admin here got Green Hell removed from my wishlist just by association with this game. Respectful communications with your players can make or break a game development company, eh?)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Seems a bit unfair to throw this into the \"not recommended\" category, but right now there are just too many glaring issues to ignore.\r\n\r\nThere are two maps in the game at the moment. One is an open-ended mode where all recipes are unlocked and you just focus on surviving like most open-world survival games. The other contains the main story.\r\n\r\nRight off the bat, the writing in this game is bad, and I mean BAD. There’s a ton of dialogue that drags on way too long without being engaging, full of corny, half-baked jokes that just don’t land. It constantly breaks immersion and makes you stop and think, \"Who the hell wrote this corny stuff?\"\r\n\r\nGameplay-wise, it’s... fine. Not bad, not good, just painfully meh. I can have some semblance of fun while playing, but it still leaves a lot to be desired. Hunting is easily the most enjoyable thing to do, or going out looking for a bandit fight.\r\n\r\nWhat’s odd is that there are far more mechanics here than something like Green Hell, yet somehow it’s nowhere near as engaging or exciting. Despite having RPG-like elements, it’s not RPG enough, and it’s not survival enough. It sits awkwardly in this middle ground that doesn’t quite work.\r\n\r\nTo top it all off, the menus are also pretty rough around the edges. I’d personally wait and see how further development goes before buying in.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is just so stale, it still feels early access and the things they are choosing to spend their time developing is just out of touch. content updates are pitiful... \"garden decorations - really?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love medieval games and I love survival games but this one just isn't right. Everything seems so tedious, I suppose that is the correct word. You need a plate for this food, a bowl for that food, a spoon for this food, an entire log to make a hammer, nothing is really explained and short of having to constantly google or youtube is super frustrating to figure out. I'll give an example.\n\nRecruit a villager, villager has needs. You have to put food and water in his homes chest, you have to give him a tool at his work chest or maybe his home chest, even though that tool, food and water is in the villages resources chest. Certain things are shared, certain things aren't. The big well in the middle of my village where I get water doesn't work for them? If some Youtuber didn't tell me a bucket full of creek water kept the new villagers thirst at bay once placed in his chest I would have given up right there. \n\nYou don't really learn anything so you have to buy its schematic. Most games when you discover a bow then you learn how to make it, this game you can have a bow, one you found, but you cannot craft it, you still need to pay for its schematic, the pricing of a lot of goods is a little wonky so you really can't predict if what you are lugging around is worth anything or fractions of a coin so the game ends up being a grind. I'm sure if you spent 100 in-game days building up a perfect ecosystem in your village where everyone is making everything for everyone else it could be neat? But just getting started there seems to be no point, you are building to build more to recruit more to build more and I haven't even gotten to a point where my people can make money if that is even a thing I don't know. \n\nI spent a couple of days mining which with your small carry weight takes multiple trips which I smelted into bars of tin, copper and bronze but I don't know how to make anything because I didn't buy the schematics  so all that ore just sits, weighs too much to carry into town to sell...tedious. I'll stick to Valheim, Green Hell or Sons of the Forest/",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Medieval Dynasty is ... iffy at best. The game often feels rudderless and directionless. You're task with building a medieval community but to what end? The character interactions are wooden, the combat is woeful and the actual act of building and resource gathering is tedious and uninteresting. I feel like if you're really interested in a medieval life simulation you'd be better off getting Kingdom Come Deliverance 1 or 2.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This is the wishdotcom version of Kingdom Come Deliverance, that no-one asked for. Just kidding, it isn't - but it sure markets itself that way. I didn't enjoy the game because it feels generic and static.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is fun until you realize it's a simulation inside a simulation. Your NPC villagers are for show only. They are not actually doing anything. Very Truman Show esque.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had my first play for a few weeks back in the early development days which i built a small village, that's when the Bandits T-posed when you hit them and i thought it was going to have bandit attacks etc, but i stopped cos of new games and didn't get to see, Anyway, i gave it another shot recently on a new save after seeing all the recent updates, but i came to realise that all this is, it is a PVE farming & family sim builder and management system game, I kinda felt let down and lost interest. There are no bandit attacks nor do they roam, They do attack you at there camps, things like that but All you do is build raise a family upgrade gather and store do bland quests rinse and repeat. They got another game that's a copy paste of this game but Asian dynasty era, which is being updated and they have a new game coming out in 2026 of a Viking era, Again another copy paste of the previous 2 games lol. I'm assuming they have or will have the exact same game mechanics. If this game had more exciting features it would be amazing, sadly i read that they have no interest in adding those. you might get 24 hrs game play before you start getting bored imo. i'll probably come back here and there cos you never know, they might change the game direction on the other 2, time will tell but i feel as if its all just copy and pasted generic farming simulators they are releasing. Quick example, Reign of kings and Heat & Homestead are exact copy's of each other, ones Med evil and the other is western, Both very unfinished and abandoned games by another Development team that in no longer operating (code-hatch, Cough Cough) But good game if you just want to chill, and watch your NPC villagers farm and stock up your storehouse so they can survive rinse and repeat.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Came back to the game in the hopes that they finally made it better, it feels like they made it worse.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "MD is fun for a while don't get me wrong, but it seriously needs modding support.... Like come on if you are going to be slow as hell on updates hand it over to the players! Mods would be a game changer! Personal suggestion just play Bellwright. At least its modded...\n\nUPDATE: After the road map update that was just posted I'm officially out! That's it? Seriously? Without mods this game is officially dead! Don't waste your money. There are better games to spend your money on. Apparently, they have a new game in the works, but as slow as these devs are i'm guessing 5 years plus until release date...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is just pointless grind, not even grind with a reward, just grind\r\n\r\nYou build your house, you want someone to come live in your village? They want their own house, no sharing\r\nThey want water, from the stream beside the village? \r\nARE YOU MAD! You need to build a well, oh but... DRINK FROM A WELL????\r\nNope, need a bucket, so build a workshop.... oh but... bucket needs planks, same workshop? \r\nHELL NO, different type of workshop\r\nOk, you got planks, make bucket.... but the bucket needs to be stored.... IN ANOTHER BUILDING, ok build item storage...\r\nWhere to store the full buckets of water... item storage? HAHAHHA NOPE\r\nBuild another building, food storage, for full buckets of water.\r\nSo finally my one villager has water! I only had to build 6 buildings myself to get it....\r\n\r\nThis is the thing, you think its a game where you get a village to help you - but you basically have to build the whole village yourself before anything works, even when you get villagers one can cut down like 5 logs a day, even basic buildings are 30 logs. This is a tree chopping simulator.\r\n\r\nThe quests are boring fetch slogs from one side of the map to another with the stamina bar of an elderly athsmatic paraplegic - each year the same quests \"re-appear\" with the same people...\r\n\r\nThe game is basically the lest amount of effort it would take to make a game in order to create a video of gameplay to get people to buy it\r\n\r\nThe one positive point I can think of is the endless, mindless drudgery, chores, backbreaking work and long hours make it possibly the most historically accurate simulation if what it was really like to be a medieval serf",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "sadly another game that rather gets DLCs for cashgrab instead of fixing bugs or adding mager game content",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}