{
  "positive": [
    {
      "review": "I’ve been with Traveler’s Rest since it was basically a dirt floor and a dream — and wow, what a glow-up it’s had. What started as a humble tavern sim is now a full-on fantasy life simulator where I cook, brew ales and wines, raise animals, adopt pets, run a hotel, and somehow still don’t burn down my kitchen (most days). It’s like a farming sim… but with drunk customers and way more responsibility. Every update feels like a little present from the devs, and watching the game grow has honestly been half the fun. If you like cozy chaos, medieval vibes, and the joy of serving virtual food to pixel people, this game is pure comfort magic.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "So far, I do enjoy the gameplay. Those who have played Stardew Valley for any length of time should be familiar with almost all mechanics. I do wish the devs will pivot and try to focus more on making this more centered around the tavern, rather than resource gathering. I would suggest rather that automating the tavern, maybe adding automated resource gatherers as employees so you can focus on brewing different beers or cooking different foods to satisfy the customers. Possibly add brewer contests throughout the year where you can win awards/decor for the tavern. I would also suggest allowing the player to design their tavern's banner or sign to make it more personal.\n\nI am hopeful for the full release!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This game has potential although it is still early access. I just wish the devs would focus on having more tavern management improvements and focus on the storyline soon since I'm just doing grinds to earn gold which can get repetitive.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I recommend Travellers Rest for anybody who likes cozy management games that you can turn on after a stressful day to wind down.\n\nAnd this year TR got some good updates. Yes, it's been in EA for a long time but the devs do consistently deliver big updates that integrate new game systems or, as of recently, a main story. They even have a pretty thorough road map on the discord, so this EA is no scam.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "i like how in depth everything is. It takes many processes and machines just to make jam on toast or a cheeseburger and i find this challenging in a very fun way! Like it keeps me needing to progress further to make more recipes. id like more decoration options but overall im really enjoying the game so far",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I absolutely love this game. It has changed my life for the better. It is extremely therapeutic and relaxing in a way nothing else has ever been for me, and if I do end up following through on my dreams of becoming a streamer, I will probably make my career on this game.\r\n\r\nI cannot overstate how much I love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a great game, I've been enjoying it's early access for some time now and every update is exciting and full of interesting new things. I even play this game with my friend, and I never play co-op or with people. Excellent, full of charm, cute characters, a great twist on the cozy farm owning genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As you've probably read from others, this game is similar to Stardew Valley, with less of a focus on farming and more of a focus on crafting food and beverages.  While the primary focus is crafting, farming is a part of this game, but everything is available for purchase from vendors if farming isn't your thing.  \r\n\r\nIn its current EA stage the content is substantially lacking despite what other reviews may say.  That said there is something about this game and its repetitiveness (I do pretty much the same things every day) that sucks you in and appeals to those perfectionists who are not happy until they've harvested enough of everything, crafted enough of everything and made enough gold to buy whatever they need...which by the way you'll feel is never enough even though it's more than enough.  I find myself just crafting more chests to store all the crap I make and harvest and by God I love it :).  \r\n\r\nIf you're a fan of Stardew Valley and similar adventure/sim games you will likely enjoy this as well.  I'll also add I've used cheats in Stardew Valley to build the perfect farm, and I created a separate save and tried to do the same in Traveller's Rest, but I just ruined the fun and I immediately deleted the save and put my efforts into my natural save.  Part of the allure of Traveller's Rest is the challenge/reward of doing it on your own and building yourself up as you go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game really captured me in it's addicting gameplay loop. I played the heck out of it. Highly recommend.\n\nThe only con I have is on the development side, it is really dragging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Have been playing it for years. Watching it grow from updates after updates always made me want restart the game to learn more. Especially when there's more new recipes, you can now make your favourite dish. There's even pets who can now follow you ^^  Can't wait for the new update! Keep up the good work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was recommended to me by a friend of a friend, and it has become a forever favorite. I wish there was more an artsy girlie could do with her tavern overall (like a functioning library, lounge, etc.) other quality of life things in the game that could give more. some smaller than others. \nits exactly what I want (so far) in a stardew-like game, that isn't stardew. \nfarming was my least favorite activitiy, but for running an inn? that's acceptable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A super cute & enjoyable pixel sim. I’ve logged 50+ hours at the time of writing this review with many more to come! \n\nSee you out there Innkeepers! 🍺",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been enjoying this game a lot recently. It's fun to come up with new food and drink combos, and to decorate the tavern how you want. I also really enjoyed the first bit of the story they recently released. I'm excited to see what else comes out throughout Early Access!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great and cozy game to play together!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't usually play early access games. I put them in my wishlist and wait for the game to be complete before deciding if I'll purchase it. I gave Travellers Rest a try and can say that I was pleasantly surprised. The devs are actively updating the game and I find myself looking forward the next update:)\r\n\r\nI am quite enjoying the game; and while cautious and optimistic, I am giving other early access games another look and chance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, very fun. Just started up a new inn with the 2 newest updates to play, very enjoyable and looking forward to discovering all the new content. All the cozy vibes you could want in a mgmt sim game, and so much variety to RP how you want to do your inn. Only fish and rum? Sure, pirates life for me. Scottish style tavern with beer forever? Grab your kilt. Fine dining with cocktails and fancy foods? Why not.\r\n\r\nDEVS! Please add in a function to deposit all of my kindling into the stove/furnace etc. at once. I hate doing a chopping day and then having to single click 100 kindling into the fuel of my device. A shift click to do 10 at a time or Alt+shift to do all at once would be amazing QoL upgrade. Unless this is already a thing and I just don't know it.\r\n\r\nOtherwise, keep the updates coming I love this game and am glad I found it on early access to enjoy the growth of the game over time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For an early access game, it’s actually quite cozy, though it needs better management features. Even though it’s a tavern game, there are certain mechanics that pull you away from the tavern aspect, which can be confusing at times so please focus more on the tavern stuff. Still, it’s a wonderful game overall.\n\nIt can feel a bit overwhelming at the start since you have to keep track of many things like cooking, brewing beer, preparing dough, crafting drinks, and gathering wood, stone, and so on.\n\nThere are a few things that could be improved, such as NPC interactions, adding more recipes, expanding the maps and locations, and maybe adding stools at the counter so you can directly serve customers.\n\nOther than that, it’s a very good game. I can’t wait for more updates and keep up the great work, devs! I hope it gets more recognition soon and brings in tons of players once it’s complete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a lovely game and has some nice progression.\nDefinitely looking forward to the future content updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my top go to games. So much love has been put into and you can tell.\nIt has a bit of everything with crafting farming and making your tavern the best there is. So much to do and doesn't feel overwhelming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game, addictive for many hours, charmind and simple graphics, and a soundtrack that fits the gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been enjoying the game! Its really fun if you're the type of player who likes to grind for materials I would definitely recommend this game! I also enjoy the tavern sim aspect and the story is also very interesting so I'm looking forward to the updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is honestly so addicting. \nI've been playing it on/off as there comes new updates and with every update I'm right back into it. I'm really looking forward to the next update and I can't wait to see what the game will look like once it's finished. \nBig thumbs up from here 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still in early access but i love the grind of the game. the pixel art is charming and the entire vibe feels like being in a fantasy slice-of-life anime, just with lots of alcohol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game. I say that first because this review is mainly going to be things I think could be improved as opposed to things that I like. It's a fun game that has plenty of room to grow. I probably put 8 hours into the game past the last story objective before I realized that I had completed the current story content because the game is just that fun. Going down the list of things I think need to be improved:\n\n1) The game is VERY similar to Stardew Valley. I streamed this to a friend and he literally thought I was playing modded Stardew. That's not inherently bad, Stardew valley is a phenomenal game, but if I wanted to play Stardew Valley I'd play Stardew Valley. A lot of the game is spent farming in a near identical way to Stardew, and I frequently found mechanics the game presented familiar. The game has an interesting foundation (there's a lot more to the game than just owning a tavern story-wise) and I feel like they should work off of that. \nLet me hire stage performers to play at my tavern. Let me host guild meetings or adventurer parties. Let me make magical brews to help people. The game presents itself in a medieval fantasy setting, yet it feels like I'm running a rural bar in Montana. Give me more TAVERN related things to do, not more SIMULATOR things to do.\n\n2) There are some QOL features that are really needed. Like, you can't make changes to your kitchen or work areas while the tavern is open. Let me manage work spaces while the tavern is open. Automation of certain systems is also a huge necessity. Obviously they can't let you automize EVERYTHING but it gets to a points where if you aren't doing some things multiple times a day, like cooking food or farming, you'll immediately start to have problems. \n\n3) They need to expand the brewing mechanics of the game. Most of the brewing you can do is essentially just adding to drinks together to get a better, more expensive drink. I think adding some sort of alchemy or magic element to brewing in the later game would be really fun. Again, this is a FANTASY setting. I wanna do cool magic stuff. \n\nOverall, very fun game, but don't buy if you're expecting a fully completed, 200+ hour experience like other simulator games. This one needs more time in the oven, and that's okay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't believe I've never written a review for this game after all this time. I've always loved coming back and expanding on my empire of barrels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spent 16 hours on this game. And I can say this game is the best way to use your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been enjoying Travellers Rest for over a year now and I really have enjoyed it. The game continues to evolve, with development being very transparent and quick to address concerns, ideas, and updates. It's a very comforting game with a lot of potential that is just starting to bloom. They also did their research on how to brew and create various drinks and meals, I'll admit I'm kind of new to beer and this game actually taught me a lot of foundational stuff by accident! There's also a lot of funny dialogue and little gems within it -- I plan to keep my chickens that the game named Cluck Norris and Meggatron no matter what!! \nIf you want a fun, relaxing game that makes you feel good and you enjoy decorating, I would give this game a serious try! I have a feeling it will only continue to get better and better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game off and on for a few years, and the updates are only getting bigger and better. This is a fun tavern sim, and it's pretty polished for early access. It's also a ton of fun with friends. Easy recommend for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, can be a little buggy at times, but the dev team is super involved and most things get fixed pretty quickly when you report them. Great experience all around!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing this game with my friend originally.  But I liked it so much that I would play it by myself as a comfort game.  I can’t wait for the next update to come out!! I’m excited with the progress that they made so far already!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've put a few hundred hours into the game before the updates, just running the tavern. Love what I've played, and can't wait to see what the full release entails.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While the game has a slow development time the overall mechanics and story elements are rich and exciting. It's a fresh take on the already abundent category of farming/life sim games. The tavern managment feels rewarding to engage with and the world has so much potential. I am excited to see where this game goes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely satisfying game! Great with friends.\r\nHighly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Scratches a lot of itches I can't find in other games. It's been awesome to see it grow and change, so thoroughly that it feels like a grown up version of its old self already, and I can see it continuing to improve. Especially because the updates have all been free so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fun. I love the level progression and the new storyline is good so far. I look forward to every update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best tavern and sim game I have played. This crew proved you can make a great game without going overboard with graphics, gimmicks and other unoptomized options. This game will run on a large number of devices and has a rich story line coupled with great mechanics. The pacing of the game feels flawless even if it can be difficult at times. With 2 players you can get the full experience out of running the traven, while you can do it by yourself it will require more skill and tenacity but thats just what I want from starting a business from the ground up as a fantasy peasant. At no point did I feel like there was a cheat code or a way to cheese the game, everything felt fair and challenging in a very rewarding way once overcome. For example when I first unlocked employees I noticed I was losing more money than what I was making!!! Seeming very frustrating at first but also a very real challenge. I had to handpick the right crew for the right price and once I realized my average sales price should be around 60-75% of their hourly wage as well as when to modify their tasks and salary I started to run a much more efficient team and opened up alot more options for how to manage my time and tavern. \nThe story and feeling of the game is so much fun and makes you feel like you are playing in an anime cooking isekai meets final fanatasy type world. The game starts out very strong with alot of rich characters you being to meet and interact with, slowly becoming part of the community and goals. Unfortunately as of now, and it seems like for a couple years now, the story is still unfinished and stops shortly after the tutorial. That is the only con to this game that I can find and was pretty dissapointed when I found out. Still even so the game is extremely good and definitely worth the price if not more. I really hope we can all pull together enough support to see a cool story develop. meeting the whole fellowship during the festival was the coolest anime moment ever and I would pay for a dlc just to see it come to life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has a repetitive loop but honestly a really nice game to relax with if you want to turn your brain off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a recommend!!! I like how they add to unlock each dishes with money and the blueprint as well. I played this when it was still on beta and it was pretty easy, which made me drop the game. Bur coming back now with more content is a masterpiece!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pleasant tavern management with everything that comes with it.  You can grow your business as fast or slow as you want and really just settle in to the feel of the running the tavern and then inn with time.  Challenging to master but simple enough to just enjoy I have enjoyed the game through many updates that have given fairly consistent QOL and additional content.  I look forward as things go forward as the team seems to really care for the continual improvement and enjoyment of players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play on you down time. \r\nI would recommended for new players or old one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite part of this game is the relaxing play and how the game keeps growing.  I love the updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a promising game, I'm expectating to any updates they release. I can't wait for the full version to come out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Cozy, Addictive Tavern Sim That Already Feels Special (Early Access Review)\n\nI don’t usually leave reviews for games in early access, but Traveller’s Rest absolutely deserves one.\n\nFrom the moment I opened my little rundown tavern, I was hooked. The game nails that cozy, satisfying loop of gathering ingredients, brewing your own drinks, cooking recipes, decorating your inn, and watching weary travelers fill the place with life. Even in beta, it has that rare “just one more day” pull where you look up and suddenly two hours have passed.\n\nWhat really stands out:\n\nAtmosphere & Vibes – This game is pure comfort. Charming art, wholesome music, gentle pacing—perfect for winding down.\nCrafting & Customization – Brewing, cooking, gardening, decorating… all surprisingly deep for an early access game. Every upgrade feels meaningful.\nManagement Done Right – Simple enough to be relaxing, but with enough strategy to stay interesting. Hiring staff so you can do more outside of the tavern is so satisfying. \n\n\nEarly access status:\nYes, it’s still in development, and you’ll bump into a few rough edges—occasional UI quirks, balancing tweaks needed, and a couple systems that feel like they’re still being fleshed out. But the foundation is so solid that those hiccups don’t get in the way of the fun. The devs are active, communicative, and clearly passionate about the game’s long-term vision.\n\nIf you like Stardew Valley, Graveyard Keeper, or any kind of cozy management sim, this is absolutely worth jumping into—even in early access.\n\nI can’t wait to see how much further this grows. Traveller’s Rest is already one of my comfort games. Cheers! 🍻",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Every update has added something new and interesting, and I am obsessed with the gameplay loop. There is just something really satisfying about the process of finding/growing/buying ingredients, seeing what you can make them into, comparing to what's trending... brewing beer or making alcohol, in all different varieties or into cocktails... serving guests, bussing tables, etc, etc. It's also a really, really pretty game in its own way. I love how the city looks, it feels so lively and bustling. I look forward to all future updates as this game continues to develop into a unique and fun to play game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun! It seems pretty well thought out and I thought the lore was unique and interesting. I look forward to seeing what the future holds for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an amazing cozy game that has cute gags and just enough story and progression being added over time that makes you want to keep coming back. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow! A lot of stuff has been added since I last played in 2023. Enjoying foraging in the forest, buying stuff in town, etc. I do miss being able to flavor what I cook.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is so far the only cozy game sim that my husband asked to play with me repetitively. I am a stardew valley perfectionist so I love games like this obviously, but he did not. The thing that we love during gaming is we both have different task.. I would handle the cooking, recipes and farming while he does the building, gathering resources and animals. We have been playing on and off since this game doesn't even have any npcs. And this month we are starting it again! Not sure if other people seems so upset that this is not \"tavern sim\" only, but to us, we love that there is storylines so we can explore on our 'offdays' instead of just grinding the gold. Wouldn't recommend if you wanted a simple game of tavern management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game honestly. A lot to read a t first and this is annoying but this game is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly this game could put my 3.1k+ hours on Stardew up for it's run. I ADORE this game already and I am so stoked to see whats to come for the game. My boyfriend got us this game for my birthday and within 11 days I'm already at 83 hours played. I enjoy how busy it can be, the customization, the atmosphere, music, just everything. Beautiful art style that makes me wanna start getting into doing pixel art.\r\nSo stoked, highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play with my wife. Very fun. Recommended. Couple glitches here and there but you can get around them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So first things first. Travellers Rest is in EA... which means some things are still baking.\r\n\r\nThe primary thing being the story. There IS a story here, but there's not much here yet. I've been playing many hours since the last time that I actually had a quest.\r\n\r\nSo for the time being, if you are wanting a story give the game a minute unless you wanna support it early. But if you are down for a relaxing game where you manage a tavern, pick it up. In that respect I have very few complaints about the game. There are some tweaks here and there that I'd really REALLY like to see, but overall the game is really good as a management sim alone.\r\n\r\nYou can farm for your ingredients, raise and butcher livestock, have a basement full of alcohol, and eventually it's more than a bar and you actually have rooms people can rent.\r\n\r\nFor now the main goal of the game is just to improve your tavern. Unlocking all the various things you can to make managing things cheaper take quite a bit of time. So for a good long while you won't be short on things to do. Eventually you will get the ability to build onto your tavern and make it bigger as well.\r\n\r\nIt does fall short on the decorating... there's some really fun decor in the game but for the most part it feels like most decor runs along a certain theme and mixing and matching gets a little difficult. None the less the decorating is still a fun aspect of the game.\r\n\r\nWarning, because I know there are those that find annoyance in this, this IS a game where save happens when you sleep. There is no auto save or manual save. You save when you sleep. You character also has to sleep. If you are up past 3am you will pass out and lose several hours the next day.\r\n\r\nThat being said.... there is no stamina bar which is one of my favorite things because I can just run around all day and do whatever the fuck I want.\r\n\r\nEventually you will unlock employees and they are very easy to manage. My only real complaint here is that you will get an employee that manages you rooms, they can also refill candles and start the fire in your tavern. Problem is that the employee spends 4 silver everytime they refill a candle and there's no way for them to pull from candles you have made. I'd love to see this changed because this employee is incredibly under utilized by me because I don't want to pay for candles when I have hundreds of them.\r\n\r\nAnimals are easy to care for. They CAN get sick, but so far I've been able to avoid that happening. Most things feel balanced... other than pigs. It feels like it costs too much to make slop and they are by far the least worth it of the animals you can get. They don't produce anything, they just exist to be slaughtered. At least all the other animals I can butcher and they give a by product. So if I have to buy their feed it's fine.\r\n\r\nThere's pets! Which is wonderful and there's diversity! You don't have to own all animals but they have enough variety that there's something for everyone. Tarantula, fish, snake, lizard, frog, hamster, cat, dogs, birds. There's so many and it's wonderful. I plan on having all of them.\r\n\r\nMy only complaint when it comes to fishing is the traps. The traps are single use. They will catch two things and then be destroyed. At this point they just aren't worth building because they can also catch trash. It's far easier to just buy stuff like lobster and shrimp from the vendor.\r\n\r\nAgain though, overall the game is a great management sim that gives a decent amount of creativity when it comes to decorating. I think I had... maybe 10 hours before I started this new save after a long time of not playing? So I'd say that around 50 hours is where I've started feeling like I've hit the end of the content. At this point I'm just trying to expand my bar and actually decorate it and that's the real extent of my gameplay besides leveling up so I can unlock more cooking recipes (that's another bummer, you can only unlock 2 recipes per level of your tavern, I wish we got more). Other than those things I've really truly run out of things to do. Oh and I've got a handful of fish I haven't caught.\r\n\r\nFar as I'm concerned though that's a lot of content for an EA game. There's a whole lot to do here, a lot of chill fun to be had. I definitely recommend the game in it's current state, again, unless you are looking for story.\r\n\r\nThe game is charming. Delightful design, music, and sound design. So it's a pleasure to look at and listen to as well.\r\n\r\n[url=https://store.steampowered.com/curator/43095726-Just-A-Chick-Reviews/] Check out my Curator Page[/url]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My boyfriend bought me this game so we could play together. Big mistake, because now I'm playing 24/7 as a reward when I'm done with college classes and homework. It's like Stardew Valley and Minecraft on crack. So addictive, so fun, and I'm grinding like there's no tomorrow. 10/10, no notes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the story so far and am excited for the update coming up. Although not perfect (thought nothing truly is perfect) I love the path this game is heading so far. I wish the updates would come sooner (only due to my desire for more content) I understand it takes time to provide quality. I would definitely recommend this game for people who enjoyed Field of Mistria, Stardew Valley, and Grimshire (among other games in this genre)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best cozy game out there. I love every minute of it. Please, get it, play it, love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game, very cozy! love the tavern concept gives more to a farming game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy comfort game. Very much like Stardew Valley but you run a tavern.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a relaxing game where I can either be a chef, a mixologist, a housekeeper, a carpenter, a farmer, a gardener, an interior designer, an architect or just be everything at the same time. Enjoyable solo but fun with friends as you can delegate tasks. Can't wait for the next update. \r\n\r\nDevs, for the love of god, please add an option to max add coal or firewood in the machines maybe by hold clicking LMB or Shift button.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Travellers Rest is a game that never seems to get boring. Whether by yourself or with a friend, it offers endless hours of fun. The seasonal updates are charming, adding in a new sense of fun allowing different decorations and food and drink items. I cannot wait for the newest update that expands the story line!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know I do not have much time in the game yet - I just started playing it - but I am really loving the graphics, the feel, and the game-play. So far so good!  I will update my review when I have put in more hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game a lot. It has cute graphics and the cozy vibes are really nice. Having your animals was a fun aspect to the game that I was excited to see in the update! (I do wish we could have more than one pup that could help at the farm. but that's just me. i always want more pets lol) Being able to put chests in the crafting zone and having the tables pull from them is a god send and makes it so much easier.  This game is great, and its amazing to de-stress after work when I don't want to think too hard. \n\nHowever, there's a couple things that I find myself getting a little frustrated with.\n\n1. Cost of things \nI understand having a curve of expenses, but with how expensive things are to buy, its becomes annoying trying to build out your tavern with a floor square costing a gold on top of the building materials. Between needing food items, buying new recipies and aquiring pet items and decorations, it becomes a brutal grind to earn money before the grind of materials (which I don't mind that but the grind on top of it is a little too much.), especially with long wait times on aging drinks. It just is too dificult to update your tavern on top of buying everything you need (maybe a little too real, lol)\n\n2. Doesn't feel as tavern focused?\nThe game play feels a bit too removed from the tavern itself. I could not hire people but then I can't gather supplies or take care of the farm. In future updates, I would love to see more connection to your tavern itself. Like maybe getting pop ups from clients to deal with small issues and more interactions with your staff.  I'd love to see some more integration of the tavern itself. \n\nAll in all, I'm really excited for this game and am so excited to see the growth it has gone through!! I'm excited to see we're getting more storyline and I hope we can actually build more relations with the NPC's and quest lines. The talk option is great but falls a little bit flat when it doesn't affect anything in the world? Maybe if you do errands for the npcs you can get discounts or see them visiting the pub? I'm just a little sad the quest lines are so short. Doesn't flesh out the world as much as I want, especially when the character designs are so interesting! \n\nWith all that said, I do know it is in early access! All the love to the dev and team!! You're doing great and I can't wait to see what comes next <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Making, exploring, talking, stories, challenges, and bartending!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like games like Stardew Valley and Diner Dash, then you will LOVE this game!!! I grew up playing the Diner/Wedding Dash game series, as well as GameHouse's Emily's Delicious series and got into Stardew Valley in my teens. Since then, for the longest time I was hoping for a medieval themed farming & cooking game to come around and Traveller's Rest is EXACTLY what I have been needing in my life!!! I'M OBSESSED WITH THIS GAME!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the design, story (so far), the idea of starting a tavern and cook food, make drinks for customers. I hope this game will finish so we can see the full story of this game. Thank you for making this game for everybody! Good luck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly just a fun and addicting game! The devs do a good job at consistently updating so it's always fun to come back to after some time and see what's new. Can't wait til it's fully released though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game! I've been playing it for quite some time now and love the vibe of the game! I'm excited to see what comes in the future, but everything from the farming, to the brewing, to the recipe and skill systems is very polished for being in an Early Access status! I'm excited to see what the future holds for this game especially with the social system in the long term and the new map areas for the short term! Its a great game for those who like games like My Time and Stardew but aren't necessarily looking for the romance aspect quite yet (don't know if the devs plan to add that, but I'm hoping)! Definitely recommend to anyone who likes tavern type games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, not bad so far. Plenty of rpg elements. Recomend using controller. At first managing a open bar gave my hand a cramp running around. Later you get assistants. They make it far easier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE this game so far. I am an AVID Stardew player and recently decided to grab this game while it was on sale. I'm genuinely having so much fun with it, even in early access. There are a few qualms that I have right now, mostly the fact that there's no way to sell extra items at the moment and I keep running out of inventory space. My husband is a hobby brewer IRL so this is a fun way for us to connect over our hobbies in a roundabout way lol. I can't wait to see this game fully fleshed out. <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun and peaceful game, can easily zone for hours. I  can tell it's still developing and growing but there's still plenty to enjoy while waiting for the rest of it to come out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun and adictive and way better if its played with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing! Played this with friends for hours, and we were just goofing around for awhile. Really a fun game, plus its pretty cool!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am 25 years old and I haven't had a game hook me up like this in a very long time, I feel 15 again. As I am writing this review I have 28 hours however on my friends account we started playing this game locally about 6 days ago and I bought it  on my account about 2 days ago, In this short period of time we have played in total of 70 ish hours (unemployed yes), The variety of drinks all the tasks you can do and the satisfaction of your tavern getting better and better by the day I don't know how to explain it but if you are interested in games like these (stardew valley) I would say definetly buy this one you won't regret it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really love the game and very relaxing cant wait for the full game to come out. Keep being amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Traveller’s Rest is one of the most relaxing and addictive life-sim management games I have played. It combines farming, crafting, brewing, cooking, and creative customization in a way that feels both familiar and refreshingly different.\n\n[b]Strengths[/b]\n\nA Wonderfully Cozy Atmosphere\n\nThe art style is warm, inviting, and full of charm. Combined with the gentle soundtrack and the lively glow of your tavern in the evening, the game creates an atmosphere that feels as comforting as sitting in a real inn on a rainy night.\n\nRewarding Progression and Crafting Systems\n\nProgression is smooth and deeply satisfying. Brewing unique drinks, cooking meals, farming ingredients, expanding your inn, unlocking new tools, and decorating your tavern all blend together into a loop that feels rich and rewarding.\n\nSatisfying Tavern Management\n\nRunning your tavern feels personal. You serve guests, keep the place tidy, upgrade furniture, customize rooms, and steadily turn your small inn into a bustling gathering place. Watching your effort transform the building into something truly yours is one of the game’s greatest joys.\n\nRelaxing Yet Engaging Gameplay Loop\n\nThere is always something to do, yet nothing feels stressful. You can choose your own pace, focus on the activities you enjoy, and slowly build the kind of inn that matches your creativity and playstyle.\n\nActive Development and Constant Improvements\n\nThe developers clearly care about this game. Updates are frequent, thoughtful, and packed with improvements that make the world feel bigger and more vibrant.\n\n[b]Weaknesses[/b]\n\nSome Repetitive Daily Tasks\n\nCleaning, serving, and restocking can become repetitive in the late game, especially during longer sessions. While staff helps ease the workload, some actions could benefit from more variety or automation.\n\nEarly Game Starts Slowly\n\nThe opening hours can feel a bit slow for players who prefer fast progression. Once more systems unlock, however, the game becomes much more engaging.\n\nManagement Depth Could Go Further\n\nWhile the tavern gameplay is fun, players who love deep strategy may wish for more advanced management features or more diverse guest behaviors.\n\nComparison to Stardew Valley\n\nIf you enjoy Stardew Valley, there is a very good chance you will love Traveller’s Rest as well  but for different reasons.\n\nBoth games offer cozy pixel art, farming, crafting, and a slow, satisfying sense of growth. However, where Stardew Valley focuses on farm life, community, relationships, and exploration, Traveller’s Rest centers on running a tavern. Instead of managing crops for profit or exploring mines, you focus on brewing drinks, preparing meals, satisfying customers, expanding rooms, and designing an inn that feels alive.\n\nTraveller’s Rest captures the same peaceful, “lose track of time” feeling that made Stardew Valley famous, but delivers it through the lens of hospitality and creativity rather than agriculture and village life. It feels familiar enough to be comforting, yet unique enough to stand proudly on its own.\n\n[b]Final Verdict[/b]\n\nDespite a few small shortcomings, Traveller’s Rest is a delightful and highly engaging tavern life sim with an atmosphere that is almost impossible to resist. It is cozy, creative, and full of charm, offering hours of relaxing yet meaningful gameplay that fans of life-sim and building games will appreciate.\n\nA wonderful game for players who love cozy management experiences with heart and personality. Fully recommended.\n\n[b]Steam Award Nomination[/b]\n\nWith how much care and passion the developers continue to put into this game, I happily nominate Traveller’s Rest for the Steam Award \"Labor of Love\".",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've been playing this game for a while now and I've loved and am loving what it's becoming! They have a great story and the development team is awesome!!! Can't wait for the next update! Keep up the great work!!! ✨",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been following the game's development for a while now. I'm really satisfied with what we have now; it's the perfect style of game for fans of simulation and singleplayer games.\nYou need patience; things happen slowly while you're taking care of your tavern.\nTraveller's Rest is definitely one of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the exploration, the vibes, and the progression!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly love this game. I'm just waiting for the 1.0 to play some more. Even more so since I have some friends who will play it with me too :>",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is in early access yet it has a solid foundation. Main theme: Run a tavern, make/ cook foods and sell them to the clients. Also, there's a farming, husbandry, fishing and a main quest. Here's my rating:\n\nArt: Really cosy vibe with the music. Every art is really well done. 100000/10. \n\nMain quest: No done yet! So far it's really good with the story and animation. They've introduced us some awesome characters that we know nothing about them. Looks Promising. 100/10\n\nVariety: 10/10 There's lots of seeds to plant and grow. Also, the amount of recipe is huge. It can be overwhelming to find so many recipes and don't know where to start. The main problem I had was to figure out how to get some items. But, it's not that complicated. 8/10\n\nHelpers: We can hire people to help us out in the tavern and they are coded really well. No bugs and a really well done path finding algorithm. Proud of them. 100/10. \n\n\nFighting: Still in development. Seems like we will use magic.\n\nSocial: Looks promising with the art style. Currently we talk to people to buy items or build, and Hell yeah, they're really interesting. Some characters are really cute, others have some funny dialogues. We can't bond with people yet. 100/10. \n\nMap: There's lot to explore and in December 2025, we're getting 7 new maps. So :) :) :). \n\nIn game map: We have a map that shows where the stores are located. But, I  wish we get a map that shows our position plus all the areas. It will be easy to navigate.\n\nSide quests: We don't have too many side quests. But, it's understandable for an early access game. Maybe in the near future.\n\nI played more than 40 h but steam is showing 2 h and I haven't found any bug. A game this good for 15 bucks is a steal. Hope my review helps!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i can hit them with a broom because they've disrespected my very well running establishment (im on the brink of debt, please let me do a fight club to beat people with brooms the pets need food)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enjoyable couch co-op. \r\nProgression is not too fast, keeps us busy and curious to know whats next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are a lot  of things to do. You got to handle and manage various things to keep your life stable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally so much fun I tend to forget about time while playing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Somehow, I've managed to rack up more hours in this than I think I have in Skyrim. The ability to select your menu, brew your own ales, choose how they're customized, and slowly upgrading your tavern... it's all so satisfying. This is my comfort game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorites! It plays great on steam deck and the developers continue making huge, enriching updates. I'm dying to get a friend on here with me now that multiplayer has been available for some time <333",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I LOVE this game. It is so cozy and the resource management is a ton of fun. Honestly the best part for me is the co-op mode. My friends and I love to take turns being staff at each others' taverns, handling either the bar or delivering drinks or cooking in the back. When the VIP is scheduled to arrive each week, it's all hands on deck and we're hustling to keep the tavern open until 2am. \n\nSuper stressful because we've placed way more tables than we can actually handle and we're too prideful to hire NPC staff. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is like Stardew Valley but without combat and instead of a farm you have a tavern",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still one of my favorite games. cant wait for more content!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "makes you want to quit your job and become a barkeep. doesn't seem too bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am still learning the (inns) and outs of this game but so far i love it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good so far, can't wait for it to be fully released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoying this game so far. It's a nice cozy game to just chill with :).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "soup, good. fish, good. chicken, good. dog, good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the updates. Can't wait for what's coming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this game, easy fun and very chill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want a Stardew Valley vibe but you manage a ye old bar/inn you'll have a great time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there are alot of mechanics and ways to play to make money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10, fun game would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy as heck and super relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best tavern themed game ever!!!!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game feels like it has an identity crisis cause I am spending more time doing other than being a tavern keeper. They need a better management system to keep track of progression. Also, crafting, cooking, harvesting, and farming takes too much of ones time. For being recommended as a cozy game, I could not relax at all.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Why can’t we save manually?\nThe game disconnects so often. I carefully calculate my crop inventory, plan over a hundred plots, manage seed stock, buy more seeds, plow the fields, water them three by three, brew wine, cook food… and then boom, sudden disconnection. \nALL that effort GONE.\nI really don’t want to start over again.\nThat’s why I can’t recommend this game anymore, and honestly, I don’t even have the motivation to open it now.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have played alone and with a friend and it just sort of feels like a work simulator. Maybe after a few more hours of serving the same things to customers and rushing to make them happy I can afford to get some chickens so that I can serve slightly different things to customers while rushing to make them happy?? I can't see it being fun until I get some staff but idk when that will happen and I am tired of this already.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "still in early access (literally only v.0.7) after close to 5.5 years is ridiculous",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Subject to change: 6.5/10.\n\nIt's an early access game, I get it. BUT, while Stardew Valley was made by one person, this game has 11 developers. I digress...\n\nThis game is very grindy. Cooking doesn't need a timer; it should be instant. If there were a compelling mini-game, I would enjoy it more. However, the food recipes are complex for no reason. Why do I need an olive for a bread and tomato recipe? DEVS, HELLO? Do you get sick kicks out of punishing the player base for not min-maxing?\n\nMoney is a painful struggle. Everything costs an arm and a leg; it feels like I'm in a Great Depression. Seeds, meats, and YEAST! WHY CAN'T I MAKE YEAST? Yeast is prohibitively expensive, and I can't make beer without it.\n\nIf you are looking for a cozy game, this is not it. You are constantly battling Time, Poverty, Tavern Management, and Complex Food & Drink recipes.\n\nDon't get me wrong, I am enjoying this game—I love grindy games—but it's not cozy.\n\nDo I recommend this game for Early Access? Yes and No.\n\nYes: But play it with a friend; doing everything solo sucks.\n\nNo: There are no mines, you can't even move rocks on your property yet, you only have copper tools, I run like a land turtle, and it's supposed to be my Tavern, yet I can't set my own prices. While you can hire help, again, in this game, we're living like it's the Great Depression. I expected more from a team with 11 developers—that should say a lot. ConcernedApe spoiled me, I guess.\n\nSide Note: The wiki for this game is trash, with barely any helpful information",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun game.\nBut the recent mandatory mini games have rendered the game moot.\nI hope the developers add a \"skip\" function.\nOtherwise this game is awesome.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I originally bought this game for the fact you play as a tavern keeper in a medieval world, making dishes, taking care of your tavern and making drnks, it sounded very exciting! I bought this game at full price I believe, and i recommend not doing so.\nI love this game, it has such a great potential, the tavern keeping part is fun, the crafting system is nice, you can get help by recruiting workers to help you when you expand enough and you can whack rowdy customers to get them out of your tavern!\n ----\nUnfortunately the people who are making this game are slowly drifting away from that idea of being a tavernkeeper and putting into a fantasy medieval world pirates and ninjas. (Why?) Making it a rpg more than a calm tavernkeeping game.\nIt is sadly hollow, though enjoyable in the beggining. \nYour hand is held for the whole tutorial, though. But i did not mind that.\nI sadly cannot recommend it in this state and in the way it is going.\n----\nI will gladly change this review if the devs begin to focus on the tavern elements and listen to their community more.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Five years in early access. Very little to do in the game. Had potential. I honestly doubt meaningful effort is being put into finishing it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is fine. It can be incredbly addicting. But the game is FAR from close to full release. I feel scammed paying for something thats uncomplete. Very robotic, very glitchy. No soul.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game starts with an exposition dump with information that you do not really care about and you also cannot skip it despite the game telling you to hold ESC to skip and then forces you into a very long boring tutorial with forced actions. It tries to be Stardew Valley but tavern keep version but it fails at immersing you into its world or characters. Literally the tutorial NPC will straight up break the 4th wall and tell you to press P on your keyboard to open a menu. I saw a friend play this game and thought it looked fun, but you have to slog through an insanely long step-by-step tutorial before you can even play the game, and I say this after spending 30 minutes in it, and I didn't even finish the tutorial. \n\nWhat made Stardew great is that it had a very short introduction, a very simple premise, and the game doesn't lock you into a tutorial and forcing you to take specific actions (in this game I tried to mine a rock in my way of tilling land, and it said \"I don't know how to do that\", because the game doesn't want you to do that YET). Stardew is simple, it drops you in its world and you have to figure it out yourself and the tutorial is done through quests and people sending you mail and talking to NPCs around town.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to love this game, but lately its become less of a tavern management sim, and more of a \"lets make this every other type of RPG and abandon updating any tavern management gameplay\" type of game lol.\n\nI didnt mind when the town got added, though that did make it take way too much time to get supplies for the tavern from the merchants bc of how huge that map is. \n\nWhat i dont like is so many other tasks (that dont involve the MAIN draw of the game) being added in while tavern keeping and creating the food + drink is being shafted (can no longer make custom dishes/add custom ingredient modifiers).\n\nI really used to like it, but i can see scope creep is slowly making it a chore to play and not the same game anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not recommend if you want to play and learn with your friends. \n\nI’m playing on both Steamdeck and PC:\n\n-if you want to host the game (without doing the tutorial) the game doesn’t let you finish character creation (on Steamdeck), the buttons just don’t work\n-if you host a new game in PC and then want to reload that later on it won’t let you unless you “finish the tutorial” which is not a thing in multiplayer\n-so the only other option is to go through the tutorial in single-player mode before opening the world to your friends, making you lose 1 whole ingame week of progress (friends can only join on day 6, missing out on the beginning days), or 1h in realtime (if you just rush through it)\n\nSo the only options are: wait a whole hour for one of your group to finish the tutorial and open a new world that makes you miss 6 days of the ingame week\n\nOr\n\nStart a multiplayer game on pc (since steamdeck doesn’t work) and have it potentially break mid playthrough if you can’t get to day 6 fast enough\n\n\nDo not recommend this game, there are definitely better games about tavern upkeeps for multiplayer on steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could be great, but a multitude of issues will ruin your experience. There are quite a few multiplayer bugs that will just get you 100% stuck in the game. The UX issues are everywhere. It's almost like no one on the dev team has played another video game before.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked it when it first came out, and while the game has cool mechanics, I think it's trying to be too many things at once and I can't get behind it again with the direction it's taken. Particularly not a fan of the narrative being about you trying to become the Tavern Keeper King. Haven't been able to suspend my disbelief in that aspect of the plot long enough to enjoy the rest of what the game might offer ever since.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is fun but crashes WAYYYYYYYYYYY TOO OFTEN for a little 3 gig pixel graphics game it should not do this crap. Not to mention i hate the mechanic of only saves when u sleep, I kno this and stardew valley games like tht crap but it is beyond infuriating when i spend an entire day meticulously decorating my tavern just for the game to crash right as i open for business. Then poof all tht work down th gutter thx game!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was enjoying Travellers Rest, before the update. I like chill games. It used to be chill. Now they have added a fast twich game. I hate it. I can't win it, so now the game had stopped for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not recommended currently due to the frustrating controller support.\n\n- The casual gamer you are playing couch co-op with is guaranteed to close your bar early and send everyone home and kill your reputation.\n- Moving items in and out of chests requires you to D-PAD to the item, press A to select, D-PAD to the target destination, press A to drop, D-PAD back down to the next, press A to select, D-PAD to the target destination, press A to drop REPEAT ONCE FOR EACH OF THE 30 UNIQUE ITEMS YOU WANT TO MOVE",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not recommend if you want to play and learn with your friends. \n\nI’m playing on both Steamdeck and PC:\n\n-if you want to host the game (without doing the tutorial) the game doesn’t let you finish character creation (on Steamdeck), the buttons just don’t work\n-if you host a new game in PC and then want to reload that later on it won’t let you unless you “finish the tutorial” which is not a thing in multiplayer\n-so the only other option is to go through the tutorial in single-player mode before opening the world to your friends, making you lose 1 whole ingame week of progress (friends can only join on day 6, missing out on the beginning days), or 1h in realtime (if you just rush through it)\n\nSo the only options are: wait a whole hour for one of your group to finish the tutorial and open a new world that makes you miss 6 days of the ingame week\n\nOr\n\nStart a multiplayer game on pc (since steamdeck doesn’t work) and have it potentially break mid playthrough if you can’t get to day 6 fast enough\n\n\nDo not recommend this game, there are definitely better games about tavern upkeeps for multiplayer on steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overall, I really like this game, but as other players have mentioned, the updates are incredibly slow. Five years later, the gameplay remains very monotonous. First, as long as you serve food in the restaurant, customers will come to eat, even if it's just water and porridge, which completely eliminates the challenge in the later stages. Second, the game still lacks a complete storyline, with only one main quest released. In comparison, Dave the Diver, for example, was released in less than three years, yet offers more complete content, more gameplay, and a greater challenge.\n\nI hope the development team can put more effort into this game. The gameplay and story are both very popular, and it holds great potential. I hope you will not let down the players who have waited so long, and with a faster pace and more substantial updates, you can make this game truly worth investing in for the long term.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "Travellers Rest looks charming but plays like a hollow Stardew Valley clone. The early game is mildly fun as the tavern side of things is a unique take, but it quickly becomes repetitive and shallow. \n\nThe economy is broken... complex, time-consuming crafts sell for barely more than basic ones, and the late game is extremely grindy with little incentive to continue.\n\nDespite years in Early Access, progress is slow, quests and NPC interactions are minimal, and key features are still missing.\n\nCute art aside, there’s just not enough depth or content to justify the price. Do yourself a favour and stick with Stardew Valley (or the many other clones that do it better, and cheaper, than this one).",
      "voted_up": false,
      "votes_helpful": 110
    },
    {
      "review": "I do love this game, because I like the part of running a tavern. However it quickly becomes obvious the game doesn't want you to run a tavern. The game wants you to mine resources and grind while automated employees run the tavern for you. So the first few hours are fun but as you start to unlock new things the game gets worse and worse, and it seems the devs are only more thoroughly following along this path, turning it into a sort of stardew valley clone rather than a tavern simulator. The devs are very confused about the nature of their own game and it's very disappointing that they've lost the plot entirely.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Give this game a hard pass. It was fun when it first came out, being able to add different ingredients to recipes and the like was fun.\r\n\r\nThen the game got sold, in part because the OG devs ran out of funds. New studio, while adding more content did away with some of the fun parts, like the recipe modifiers.\r\n\r\nThen they spent months coming up with 'new story' stuff, which is just a stupidly annoying 'banquet' you have to win. Several players, myself included, complained about it. Supposedly they added a difficulty slider, but you can't find it. It's not in the settings and it doesn't pop up with the event (I even started a completely new playthrough to try to find it).  And any request for help is met with a rude, unhelpful and generally toxic player base that shames people for having trouble with it (some folks need accessibilty things and screw toxic chodes who try to make that an issue. Unless they die before they get old, they too will need accessibility things as they age). Even the devs in the patch notes decided to NOT say where it is.\r\n\r\nSo uncommunicative devs, shoddy patch notes. months of development for one stupid event. Hard pass on all of that. That's not progressing the story at all.\r\n\r\nAnd did I mention the absolutely ridiculous way you have to set up crafters outside that takes up half your very small lot? Yeah, that's a thing, and you cant make a nice farm, because you can't move nodes for materials.\r\n\r\nSupposedly that is supposed to change 'in a future update' but given the shoddy nature of this last one, don't hold your breath. There are far better games made by far better studios. Give this one a pass.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "If you're looking for a game where you can run a tavern, this is about 20% of what you will be doing here. The rest is just needlessly excessive farming, running around, fishing, buying resources to craft literally anything. But you will have plenty of time to do all that after you've bought all the employees and the tavern runs by itself without you doing anything anymore besides cook. Which imo ends the game.\r\nWhen I bought it, it was better.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game has been in early access for to long and has had minimal updates. They released a so called big update today took like 1 hr to complete it. It makes me think that this game will never be completed or there will be very little story to it for new players, even when it is fully released.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The game feels like it has an identity crisis cause I am spending more time doing other than being a tavern keeper. They need a better management system to keep track of progression. Also, crafting, cooking, harvesting, and farming takes too much of ones time. For being recommended as a cozy game, I could not relax at all.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "I didn't play stardew valley not because I don't like it. I just don't want the farming and crafting loop. I bought this game because of its unique gameplay mechanics in running a tavern, but it quickly became a farming and crafting loop once you get surplus of food and drinks to offer. \r\n\r\nMining nodes on your lot is cannot be destroyed leaving you to work around them on designing your lot. Plus crafting zones has their own fixed lots which takes up a lot of space. Love the idea of assigning chests to specific zones, but dedicated lots for iron crafting, stone works and lumber works is annoying when you want to design.\r\n\r\nThe core of the game which is running a tavern is fun early game, but when you have surplus of drinks and food and staff to do it for you, the game becomes your regular farming game. \r\n\r\nStory or monthly events should be in the game. What you only look forward to every week or month is a VIP customer which doesn't do any thing other than allowing you to gain more reputation point for the day he visits. \r\n\r\nWould I recommend it? No if you buy it full price. Buy it if you want cozy game sessions, you can easily get in hours just by doing the farming, crafting loop or if like designing your tavern.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "5 years and still no where near finished story line is still there isnt one they really need to get a move on the last update for the tutorial is a right bug fest i can see this staying unfinished shame really as it could be a timeless great",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Good base, but progress of development is very slow.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Why can’t we save manually?\nThe game disconnects so often. I carefully calculate my crop inventory, plan over a hundred plots, manage seed stock, buy more seeds, plow the fields, water them three by three, brew wine, cook food… and then boom, sudden disconnection. \nALL that effort GONE.\nI really don’t want to start over again.\nThat’s why I can’t recommend this game anymore, and honestly, I don’t even have the motivation to open it now.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have played alone and with a friend and it just sort of feels like a work simulator. Maybe after a few more hours of serving the same things to customers and rushing to make them happy I can afford to get some chickens so that I can serve slightly different things to customers while rushing to make them happy?? I can't see it being fun until I get some staff but idk when that will happen and I am tired of this already.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "still in early access (literally only v.0.7) after close to 5.5 years is ridiculous",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "My boyfriend and I bought this game yesterday to play together and we've had trouble on it for HOURS. It seems like such a cute and enjoyable game so I'm really sad that there's so many bugs with multiplayer. Constantly says \"Took too long to connect to server\" and then kicks us off. We looked it up and found it was possible we just needed to fully complete the tutorial before we can play online, so we did and that and it didn't help. Still cant invite him, still cant join him, still cant host or even create a new world for multiplayer after exiting and restarting the game multiple times and restarting my whole computer. We are at a loss here and cannot figure out how to make this game work. No problems with single player though. It feels like we wasted our time and money on this game since we bought it for the sole purpose of playing together and not separate :( Although, it seems to be a very cute and interesting game, so I would still recommend this game to other players- but ONLY if you're playing alone. If somebody knows how to fix this or what we should do, please let me know, we are stumped.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Posting this after 90 hours into the game. I really gave this game the biggest benefit of the doubt I ever gave. That's because I wanted this game to be something so badly but simply isn't. The game in its current state is too overpriced, should be €10, €5 if on sale. It's overpriced because you can do a lot but it never leads to anything. You can grind your butt off (I did, 90 hours of it) but I have nothing to show for it. I started over 7 times to figure out how to make a decent income, something the game doesn't help the player with. You can make more and more recipes, but that's doesn't provide the depth I'm looking for in a game. More of the same isn't progressing in a game, and I feel that's where this game is heading. 5 Years in Early Access, that's one lesson I've learned the hard way.\r\nNPCs feel empty, they are not involved in the life & work of the player at all. It's transactions only. Don't add more characters if none of them are gonna have any depth.\r\nThe Tutorial Cat DID help me start, but could pop in when you unlock new devices. I love how there's freedom to do what you want, but provide us with some sense of direction, set goals for automation because the grind is beyond bad - it's cruel. These issues should not be present in a 5 year old game, some improvements had to be made by now. Instead, more and more content is added, widening the scope rather than fixing the broken core mechanics.\r\nThe perks of the staff you can hire are random, but are way too important to be random. At my last playthru I got staff with good perks. The random single flaw needs re-balancing because if they stack, your inn goes down.\r\n\r\nDon't make the mistake I made by hoping this game to be more than it is. The potential is huge but the improvements come at glacier-pace, which doesn't match the price. The roadmap shows clear signs of scoop creep, no sign of re-doing the balances. Do not buy this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When I bought the game, it was early access and fully focused on what the game said as is named for - you had tavern and would mix up drinks and food based on ingredients. Game was very chill and relaxing by testing the combinations, what works and what not.\n\nNow after couple of updates, you lost all these options, customization is minimal, they added and force as main part of gameplay doing basically anything else BUT the tavern keeping. Game is now more similar to Stardew Valley and suddenly I should run around, collect resources, refine them etc., while my tavern is solved by NPC hired help.\n\nBasically only about 4 hours are played in current state.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT BUY\nutterly ridiculous that after 5 years of development it has this many game breaking bugs in the damn tutorial, bought 2 copies one for myself and another for GF, we both had major issues in the tutorial that broke the game.  Absolute joke of a game. instantly refunded.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Its a great game, buuuut, its early access and fun at first, then very repetitive, with very little growth since start up. Maybe buy it in 10 years and see if it has gotten deeper",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Gameplay is artificially bloated, clearly designed to stretch playtime rather than provide real fun. Item prices are ridiculous—after 7 hours I managed to buy only one aging barrel and a few buckets. Most of the income just goes into sustaining seeds and pet food (or you can watch your pets starve and be unhappy if you prefer). At least half of every day is wasted running the same repetitive routes to gather resources. Overall, it felt more like a greedy free-to-play mobile game than a proper farming/management game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Subject to change: 6.5/10.\n\nIt's an early access game, I get it. BUT, while Stardew Valley was made by one person, this game has 11 developers. I digress...\n\nThis game is very grindy. Cooking doesn't need a timer; it should be instant. If there were a compelling mini-game, I would enjoy it more. However, the food recipes are complex for no reason. Why do I need an olive for a bread and tomato recipe? DEVS, HELLO? Do you get sick kicks out of punishing the player base for not min-maxing?\n\nMoney is a painful struggle. Everything costs an arm and a leg; it feels like I'm in a Great Depression. Seeds, meats, and YEAST! WHY CAN'T I MAKE YEAST? Yeast is prohibitively expensive, and I can't make beer without it.\n\nIf you are looking for a cozy game, this is not it. You are constantly battling Time, Poverty, Tavern Management, and Complex Food & Drink recipes.\n\nDon't get me wrong, I am enjoying this game—I love grindy games—but it's not cozy.\n\nDo I recommend this game for Early Access? Yes and No.\n\nYes: But play it with a friend; doing everything solo sucks.\n\nNo: There are no mines, you can't even move rocks on your property yet, you only have copper tools, I run like a land turtle, and it's supposed to be my Tavern, yet I can't set my own prices. While you can hire help, again, in this game, we're living like it's the Great Depression. I expected more from a team with 11 developers—that should say a lot. ConcernedApe spoiled me, I guess.\n\nSide Note: The wiki for this game is trash, with barely any helpful information",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun game.\nBut the recent mandatory mini games have rendered the game moot.\nI hope the developers add a \"skip\" function.\nOtherwise this game is awesome.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have had this game for years and for years i have waited for good content.... and waited... and waited....\n\nVery little has ever come out.  compared to other games like stardew valley, its just so small...\n\nThey have set up numerous areas to expand yet NEVER do so.  things i looked forward to seeing yet year after year i came back... disappointed... \n\ndont waste the time.   they arent making content.   its an old game that isnt making any real effort.\n\ni did like what was there, but its SOOO lacking in content.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love the game, but the constant crashing and being unable to save whenever I want to is making this game a real headache. You only save when you go to bed to end the day....like, is it really impossible to change it so we can save whenever we want? Most games today are adding in that feature because no one likes to lose over 10 minutes of gameplay and trust me, a lot can happen in 10 min. If you think you can handle unpleasant interruptions to your progress, then go for it, it's a great game other than the things I've mentioned. I'd definitely return to the game if I can just save my game at any time to avoid these frustrations. Currently can't even get a good 15 min in this game without the game having a heart attack because I tried to walk two feet to the left.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Has a lot of potential, but the development cycle is very, very slow and the game is still missing quite a bit of content. My main gripe though is one that a lot of these tavern/farming games tend to suffer from:  the economics part is too easy, and your decisions regarding food & drink do not really matter.\n\nIt doesn't matter what you put on the table. Sure, there are some menu items that gain a boost on certain days, but that's not enough. What really is missing is a sort of \"tiredness\" system, with people paying less and less for certain items (and maybe more for out-of-season items) so you have to mix up your menu regularly. As it is now, you can just serve the same stuff, all day, every day. Plant the same crops. Brew the same brews. Sure, you might miss out on a little bit of money here and there, but overall you don't really profit from chaning up the items on your tavern's menu. \n\nThis also leads to the tavern game loop feeling extremely same-y with little or no difference, especially since you can decide yourself when to open and when to close, without that having any effect on your tavern's popularity or anything else.\n\nI will review the game again once it leaves early access, but right now it feels hollow, same-y and uninspired after a few hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I originally bought this game for the fact you play as a tavern keeper in a medieval world, making dishes, taking care of your tavern and making drnks, it sounded very exciting! I bought this game at full price I believe, and i recommend not doing so.\nI love this game, it has such a great potential, the tavern keeping part is fun, the crafting system is nice, you can get help by recruiting workers to help you when you expand enough and you can whack rowdy customers to get them out of your tavern!\n ----\nUnfortunately the people who are making this game are slowly drifting away from that idea of being a tavernkeeper and putting into a fantasy medieval world pirates and ninjas. (Why?) Making it a rpg more than a calm tavernkeeping game.\nIt is sadly hollow, though enjoyable in the beggining. \nYour hand is held for the whole tutorial, though. But i did not mind that.\nI sadly cannot recommend it in this state and in the way it is going.\n----\nI will gladly change this review if the devs begin to focus on the tavern elements and listen to their community more.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While the idea and the concept sounds pretty amazing, it has the inkling of an amazing game, unfortunately it falls short on every aspect, the amount of grinding with no clear objective, the lack of tools to do so(or upgrades to these tools) make it incredibly slow, dull, clunky and repetitive, which the whole idea of this genre is to make repetitive tasks enjoyable(news flash this is not).\n\n\nonce you do your first thing of every aspect of it, thats it! you experienced the full game with minor tweaks, upgrades along the way, it makes no difference if i can age 30 beers or 150 beers its the same process with almost to no little change, i mean i am making legendary reserve beers! they should be valued as such! food always stay the same quality, what changes is what ingredients you use on the same dish and the final price with a small fluctuation in price, meaning i can have steaks from cows, lambs, chickens, pork, same steak recipe just different animal.\n\nFarming is BORING on this game, you have to single shove the ground, then use a different tool to prepare the ground to plant stuff, then you need to water each individual square with water(they did add a tool to help with watering props for that) and then you can plant the things, which if you dont have the irrigation system you need to water it once or twice before it grows to full, imagine doing this by square for 30 crops or 60 or 90 holy hell.\n\nSocial interactions or quest: almost none a couple here and there its early access(5 years of it but still).\nCrafting\" works like any other game of this type, put fuel, put materials it makes thing yay!\nGathering: there a serious lack of zone and materials i normally see like 20-22 materials of something a day(yep you need to sleep for them to respawn again), meaning you are wasting the day which you could advance or work on stuff if the world had more material nodes or zones for specific ones.\n\nThis game tries to be better than graveyard keeper, yet it fails in every aspect of it(gathering, crafting, social interactions, plot, farming).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Five years in early access. Very little to do in the game. Had potential. I honestly doubt meaningful effort is being put into finishing it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is fine. It can be incredbly addicting. But the game is FAR from close to full release. I feel scammed paying for something thats uncomplete. Very robotic, very glitchy. No soul.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It at first gives a good impression as a game with plenty to explore and to develop.\r\nBut it will very quickly bog down under cumbersome design decisions that for some reason is ''part of the core gameplay''.\r\n\r\nAnd i am not talking about things like grinding resources, no it is frankly tasks like taking things from one storage to a another to stay operational.\r\nThen it starts to pile up further and further as you progress and with no way to get out of it other than quite frankly shutting down operations that otherwise has all the features to be functional without the direct players input.\r\n\r\nThis also ties into a growth issue within the game too with the limitations on staff, you will hit a wall where you cannot expand anymore because you cannot have the staff to run it.\r\nSure you can keep building larger and bolder, but your singular waiter will not be able to tend to more customers, you also have one barkeep and counter but no more than that unless you yourself also get in behind the counter or tending tables.\r\n\r\nThis expands into more things as you go such as farming and animal husbandry where quite frankly tedius tasks that is expected to be offloaded on to staff at some point as a point of progression just are not.\r\nNo you are the tavernkeeper that has to do all the utterly boring things because you cannot and will not have staff for it, but the more engaging and fun things do have staff for it.\r\n\r\nIt is not exactly a game design i would have opted for nor really seen in other titles that last for more than a week, but it is the path the developer went.\r\n\r\nIn all Honesty, try Stardew valley instead if you have not.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is a little TOO spastic. The core gameplay loop is ok, but the patrons just suck the life out of the game.\r\nYou're constantly running and the patrons constantly complaining about something.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game starts with an exposition dump with information that you do not really care about and you also cannot skip it despite the game telling you to hold ESC to skip and then forces you into a very long boring tutorial with forced actions. It tries to be Stardew Valley but tavern keep version but it fails at immersing you into its world or characters. Literally the tutorial NPC will straight up break the 4th wall and tell you to press P on your keyboard to open a menu. I saw a friend play this game and thought it looked fun, but you have to slog through an insanely long step-by-step tutorial before you can even play the game, and I say this after spending 30 minutes in it, and I didn't even finish the tutorial. \n\nWhat made Stardew great is that it had a very short introduction, a very simple premise, and the game doesn't lock you into a tutorial and forcing you to take specific actions (in this game I tried to mine a rock in my way of tilling land, and it said \"I don't know how to do that\", because the game doesn't want you to do that YET). Stardew is simple, it drops you in its world and you have to figure it out yourself and the tutorial is done through quests and people sending you mail and talking to NPCs around town.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Many issues.. esp with building and upgrading",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun but two things are very bad:\n\n- its way to grindy AND not balanced between the income sources.. \n- coop performance is quiet bad (connecting to server, somtimes lagging...)\n\nOtherwise the game is great...   but for coop i cant recommend atm. Maybe i will chance the feedback later if its better...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Waiting for mine to be opened for more then 5 years.\nCool game, a lot of unrevealed potential.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "been in early access since 2020, still no relationships, broken/missing/incomplete quests (like the frozen guy in the ice)\n\nthe economy is broken, water cells for 1 silver, and its free, and expensive to make red wine tht you age for hours sells for 3 silver....i mean, what teh actual.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to love this game, but lately its become less of a tavern management sim, and more of a \"lets make this every other type of RPG and abandon updating any tavern management gameplay\" type of game lol.\n\nI didnt mind when the town got added, though that did make it take way too much time to get supplies for the tavern from the merchants bc of how huge that map is. \n\nWhat i dont like is so many other tasks (that dont involve the MAIN draw of the game) being added in while tavern keeping and creating the food + drink is being shafted (can no longer make custom dishes/add custom ingredient modifiers).\n\nI really used to like it, but i can see scope creep is slowly making it a chore to play and not the same game anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not recommend if you want to play and learn with your friends. \n\nI’m playing on both Steamdeck and PC:\n\n-if you want to host the game (without doing the tutorial) the game doesn’t let you finish character creation (on Steamdeck), the buttons just don’t work\n-if you host a new game in PC and then want to reload that later on it won’t let you unless you “finish the tutorial” which is not a thing in multiplayer\n-so the only other option is to go through the tutorial in single-player mode before opening the world to your friends, making you lose 1 whole ingame week of progress (friends can only join on day 6, missing out on the beginning days), or 1h in realtime (if you just rush through it)\n\nSo the only options are: wait a whole hour for one of your group to finish the tutorial and open a new world that makes you miss 6 days of the ingame week\n\nOr\n\nStart a multiplayer game on pc (since steamdeck doesn’t work) and have it potentially break mid playthrough if you can’t get to day 6 fast enough\n\n\nDo not recommend this game, there are definitely better games about tavern upkeeps for multiplayer on steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could be great, but a multitude of issues will ruin your experience. There are quite a few multiplayer bugs that will just get you 100% stuck in the game. The UX issues are everywhere. It's almost like no one on the dev team has played another video game before.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked it when it first came out, and while the game has cool mechanics, I think it's trying to be too many things at once and I can't get behind it again with the direction it's taken. Particularly not a fan of the narrative being about you trying to become the Tavern Keeper King. Haven't been able to suspend my disbelief in that aspect of the plot long enough to enjoy the rest of what the game might offer ever since.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is fun but crashes WAYYYYYYYYYYY TOO OFTEN for a little 3 gig pixel graphics game it should not do this crap. Not to mention i hate the mechanic of only saves when u sleep, I kno this and stardew valley games like tht crap but it is beyond infuriating when i spend an entire day meticulously decorating my tavern just for the game to crash right as i open for business. Then poof all tht work down th gutter thx game!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was enjoying Travellers Rest, before the update. I like chill games. It used to be chill. Now they have added a fast twich game. I hate it. I can't win it, so now the game had stopped for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not recommended currently due to the frustrating controller support.\n\n- The casual gamer you are playing couch co-op with is guaranteed to close your bar early and send everyone home and kill your reputation.\n- Moving items in and out of chests requires you to D-PAD to the item, press A to select, D-PAD to the target destination, press A to drop, D-PAD back down to the next, press A to select, D-PAD to the target destination, press A to drop REPEAT ONCE FOR EACH OF THE 30 UNIQUE ITEMS YOU WANT TO MOVE",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overall, I really like this game, but as other players have mentioned, the updates are incredibly slow. Five years later, the gameplay remains very monotonous. First, as long as you serve food in the restaurant, customers will come to eat, even if it's just water and porridge, which completely eliminates the challenge in the later stages. Second, the game still lacks a complete storyline, with only one main quest released. In comparison, Dave the Diver, for example, was released in less than three years, yet offers more complete content, more gameplay, and a greater challenge.\n\nI hope the development team can put more effort into this game. The gameplay and story are both very popular, and it holds great potential. I hope you will not let down the players who have waited so long, and with a faster pace and more substantial updates, you can make this game truly worth investing in for the long term.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "Travellers Rest looks charming but plays like a hollow Stardew Valley clone. The early game is mildly fun as the tavern side of things is a unique take, but it quickly becomes repetitive and shallow. \n\nThe economy is broken... complex, time-consuming crafts sell for barely more than basic ones, and the late game is extremely grindy with little incentive to continue.\n\nDespite years in Early Access, progress is slow, quests and NPC interactions are minimal, and key features are still missing.\n\nCute art aside, there’s just not enough depth or content to justify the price. Do yourself a favour and stick with Stardew Valley (or the many other clones that do it better, and cheaper, than this one).",
      "voted_up": false,
      "votes_helpful": 110
    },
    {
      "review": "I do love this game, because I like the part of running a tavern. However it quickly becomes obvious the game doesn't want you to run a tavern. The game wants you to mine resources and grind while automated employees run the tavern for you. So the first few hours are fun but as you start to unlock new things the game gets worse and worse, and it seems the devs are only more thoroughly following along this path, turning it into a sort of stardew valley clone rather than a tavern simulator. The devs are very confused about the nature of their own game and it's very disappointing that they've lost the plot entirely.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Give this game a hard pass. It was fun when it first came out, being able to add different ingredients to recipes and the like was fun.\r\n\r\nThen the game got sold, in part because the OG devs ran out of funds. New studio, while adding more content did away with some of the fun parts, like the recipe modifiers.\r\n\r\nThen they spent months coming up with 'new story' stuff, which is just a stupidly annoying 'banquet' you have to win. Several players, myself included, complained about it. Supposedly they added a difficulty slider, but you can't find it. It's not in the settings and it doesn't pop up with the event (I even started a completely new playthrough to try to find it).  And any request for help is met with a rude, unhelpful and generally toxic player base that shames people for having trouble with it (some folks need accessibilty things and screw toxic chodes who try to make that an issue. Unless they die before they get old, they too will need accessibility things as they age). Even the devs in the patch notes decided to NOT say where it is.\r\n\r\nSo uncommunicative devs, shoddy patch notes. months of development for one stupid event. Hard pass on all of that. That's not progressing the story at all.\r\n\r\nAnd did I mention the absolutely ridiculous way you have to set up crafters outside that takes up half your very small lot? Yeah, that's a thing, and you cant make a nice farm, because you can't move nodes for materials.\r\n\r\nSupposedly that is supposed to change 'in a future update' but given the shoddy nature of this last one, don't hold your breath. There are far better games made by far better studios. Give this one a pass.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "If you're looking for a game where you can run a tavern, this is about 20% of what you will be doing here. The rest is just needlessly excessive farming, running around, fishing, buying resources to craft literally anything. But you will have plenty of time to do all that after you've bought all the employees and the tavern runs by itself without you doing anything anymore besides cook. Which imo ends the game.\r\nWhen I bought it, it was better.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The game feels like it has an identity crisis cause I am spending more time doing other than being a tavern keeper. They need a better management system to keep track of progression. Also, crafting, cooking, harvesting, and farming takes too much of ones time. For being recommended as a cozy game, I could not relax at all.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "This game has been in early access for to long and has had minimal updates. They released a so called big update today took like 1 hr to complete it. It makes me think that this game will never be completed or there will be very little story to it for new players, even when it is fully released.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I didn't play stardew valley not because I don't like it. I just don't want the farming and crafting loop. I bought this game because of its unique gameplay mechanics in running a tavern, but it quickly became a farming and crafting loop once you get surplus of food and drinks to offer. \r\n\r\nMining nodes on your lot is cannot be destroyed leaving you to work around them on designing your lot. Plus crafting zones has their own fixed lots which takes up a lot of space. Love the idea of assigning chests to specific zones, but dedicated lots for iron crafting, stone works and lumber works is annoying when you want to design.\r\n\r\nThe core of the game which is running a tavern is fun early game, but when you have surplus of drinks and food and staff to do it for you, the game becomes your regular farming game. \r\n\r\nStory or monthly events should be in the game. What you only look forward to every week or month is a VIP customer which doesn't do any thing other than allowing you to gain more reputation point for the day he visits. \r\n\r\nWould I recommend it? No if you buy it full price. Buy it if you want cozy game sessions, you can easily get in hours just by doing the farming, crafting loop or if like designing your tavern.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "5 years and still no where near finished story line is still there isnt one they really need to get a move on the last update for the tutorial is a right bug fest i can see this staying unfinished shame really as it could be a timeless great",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Good base, but progress of development is very slow.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Why can’t we save manually?\nThe game disconnects so often. I carefully calculate my crop inventory, plan over a hundred plots, manage seed stock, buy more seeds, plow the fields, water them three by three, brew wine, cook food… and then boom, sudden disconnection. \nALL that effort GONE.\nI really don’t want to start over again.\nThat’s why I can’t recommend this game anymore, and honestly, I don’t even have the motivation to open it now.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have played alone and with a friend and it just sort of feels like a work simulator. Maybe after a few more hours of serving the same things to customers and rushing to make them happy I can afford to get some chickens so that I can serve slightly different things to customers while rushing to make them happy?? I can't see it being fun until I get some staff but idk when that will happen and I am tired of this already.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "still in early access (literally only v.0.7) after close to 5.5 years is ridiculous",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "My boyfriend and I bought this game yesterday to play together and we've had trouble on it for HOURS. It seems like such a cute and enjoyable game so I'm really sad that there's so many bugs with multiplayer. Constantly says \"Took too long to connect to server\" and then kicks us off. We looked it up and found it was possible we just needed to fully complete the tutorial before we can play online, so we did and that and it didn't help. Still cant invite him, still cant join him, still cant host or even create a new world for multiplayer after exiting and restarting the game multiple times and restarting my whole computer. We are at a loss here and cannot figure out how to make this game work. No problems with single player though. It feels like we wasted our time and money on this game since we bought it for the sole purpose of playing together and not separate :( Although, it seems to be a very cute and interesting game, so I would still recommend this game to other players- but ONLY if you're playing alone. If somebody knows how to fix this or what we should do, please let me know, we are stumped.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Posting this after 90 hours into the game. I really gave this game the biggest benefit of the doubt I ever gave. That's because I wanted this game to be something so badly but simply isn't. The game in its current state is too overpriced, should be €10, €5 if on sale. It's overpriced because you can do a lot but it never leads to anything. You can grind your butt off (I did, 90 hours of it) but I have nothing to show for it. I started over 7 times to figure out how to make a decent income, something the game doesn't help the player with. You can make more and more recipes, but that's doesn't provide the depth I'm looking for in a game. More of the same isn't progressing in a game, and I feel that's where this game is heading. 5 Years in Early Access, that's one lesson I've learned the hard way.\r\nNPCs feel empty, they are not involved in the life & work of the player at all. It's transactions only. Don't add more characters if none of them are gonna have any depth.\r\nThe Tutorial Cat DID help me start, but could pop in when you unlock new devices. I love how there's freedom to do what you want, but provide us with some sense of direction, set goals for automation because the grind is beyond bad - it's cruel. These issues should not be present in a 5 year old game, some improvements had to be made by now. Instead, more and more content is added, widening the scope rather than fixing the broken core mechanics.\r\nThe perks of the staff you can hire are random, but are way too important to be random. At my last playthru I got staff with good perks. The random single flaw needs re-balancing because if they stack, your inn goes down.\r\n\r\nDon't make the mistake I made by hoping this game to be more than it is. The potential is huge but the improvements come at glacier-pace, which doesn't match the price. The roadmap shows clear signs of scoop creep, no sign of re-doing the balances. Do not buy this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When I bought the game, it was early access and fully focused on what the game said as is named for - you had tavern and would mix up drinks and food based on ingredients. Game was very chill and relaxing by testing the combinations, what works and what not.\n\nNow after couple of updates, you lost all these options, customization is minimal, they added and force as main part of gameplay doing basically anything else BUT the tavern keeping. Game is now more similar to Stardew Valley and suddenly I should run around, collect resources, refine them etc., while my tavern is solved by NPC hired help.\n\nBasically only about 4 hours are played in current state.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT BUY\nutterly ridiculous that after 5 years of development it has this many game breaking bugs in the damn tutorial, bought 2 copies one for myself and another for GF, we both had major issues in the tutorial that broke the game.  Absolute joke of a game. instantly refunded.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Its a great game, buuuut, its early access and fun at first, then very repetitive, with very little growth since start up. Maybe buy it in 10 years and see if it has gotten deeper",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Gameplay is artificially bloated, clearly designed to stretch playtime rather than provide real fun. Item prices are ridiculous—after 7 hours I managed to buy only one aging barrel and a few buckets. Most of the income just goes into sustaining seeds and pet food (or you can watch your pets starve and be unhappy if you prefer). At least half of every day is wasted running the same repetitive routes to gather resources. Overall, it felt more like a greedy free-to-play mobile game than a proper farming/management game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Subject to change: 6.5/10.\n\nIt's an early access game, I get it. BUT, while Stardew Valley was made by one person, this game has 11 developers. I digress...\n\nThis game is very grindy. Cooking doesn't need a timer; it should be instant. If there were a compelling mini-game, I would enjoy it more. However, the food recipes are complex for no reason. Why do I need an olive for a bread and tomato recipe? DEVS, HELLO? Do you get sick kicks out of punishing the player base for not min-maxing?\n\nMoney is a painful struggle. Everything costs an arm and a leg; it feels like I'm in a Great Depression. Seeds, meats, and YEAST! WHY CAN'T I MAKE YEAST? Yeast is prohibitively expensive, and I can't make beer without it.\n\nIf you are looking for a cozy game, this is not it. You are constantly battling Time, Poverty, Tavern Management, and Complex Food & Drink recipes.\n\nDon't get me wrong, I am enjoying this game—I love grindy games—but it's not cozy.\n\nDo I recommend this game for Early Access? Yes and No.\n\nYes: But play it with a friend; doing everything solo sucks.\n\nNo: There are no mines, you can't even move rocks on your property yet, you only have copper tools, I run like a land turtle, and it's supposed to be my Tavern, yet I can't set my own prices. While you can hire help, again, in this game, we're living like it's the Great Depression. I expected more from a team with 11 developers—that should say a lot. ConcernedApe spoiled me, I guess.\n\nSide Note: The wiki for this game is trash, with barely any helpful information",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun game.\nBut the recent mandatory mini games have rendered the game moot.\nI hope the developers add a \"skip\" function.\nOtherwise this game is awesome.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have had this game for years and for years i have waited for good content.... and waited... and waited....\n\nVery little has ever come out.  compared to other games like stardew valley, its just so small...\n\nThey have set up numerous areas to expand yet NEVER do so.  things i looked forward to seeing yet year after year i came back... disappointed... \n\ndont waste the time.   they arent making content.   its an old game that isnt making any real effort.\n\ni did like what was there, but its SOOO lacking in content.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love the game, but the constant crashing and being unable to save whenever I want to is making this game a real headache. You only save when you go to bed to end the day....like, is it really impossible to change it so we can save whenever we want? Most games today are adding in that feature because no one likes to lose over 10 minutes of gameplay and trust me, a lot can happen in 10 min. If you think you can handle unpleasant interruptions to your progress, then go for it, it's a great game other than the things I've mentioned. I'd definitely return to the game if I can just save my game at any time to avoid these frustrations. Currently can't even get a good 15 min in this game without the game having a heart attack because I tried to walk two feet to the left.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Has a lot of potential, but the development cycle is very, very slow and the game is still missing quite a bit of content. My main gripe though is one that a lot of these tavern/farming games tend to suffer from:  the economics part is too easy, and your decisions regarding food & drink do not really matter.\n\nIt doesn't matter what you put on the table. Sure, there are some menu items that gain a boost on certain days, but that's not enough. What really is missing is a sort of \"tiredness\" system, with people paying less and less for certain items (and maybe more for out-of-season items) so you have to mix up your menu regularly. As it is now, you can just serve the same stuff, all day, every day. Plant the same crops. Brew the same brews. Sure, you might miss out on a little bit of money here and there, but overall you don't really profit from chaning up the items on your tavern's menu. \n\nThis also leads to the tavern game loop feeling extremely same-y with little or no difference, especially since you can decide yourself when to open and when to close, without that having any effect on your tavern's popularity or anything else.\n\nI will review the game again once it leaves early access, but right now it feels hollow, same-y and uninspired after a few hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I originally bought this game for the fact you play as a tavern keeper in a medieval world, making dishes, taking care of your tavern and making drnks, it sounded very exciting! I bought this game at full price I believe, and i recommend not doing so.\nI love this game, it has such a great potential, the tavern keeping part is fun, the crafting system is nice, you can get help by recruiting workers to help you when you expand enough and you can whack rowdy customers to get them out of your tavern!\n ----\nUnfortunately the people who are making this game are slowly drifting away from that idea of being a tavernkeeper and putting into a fantasy medieval world pirates and ninjas. (Why?) Making it a rpg more than a calm tavernkeeping game.\nIt is sadly hollow, though enjoyable in the beggining. \nYour hand is held for the whole tutorial, though. But i did not mind that.\nI sadly cannot recommend it in this state and in the way it is going.\n----\nI will gladly change this review if the devs begin to focus on the tavern elements and listen to their community more.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While the idea and the concept sounds pretty amazing, it has the inkling of an amazing game, unfortunately it falls short on every aspect, the amount of grinding with no clear objective, the lack of tools to do so(or upgrades to these tools) make it incredibly slow, dull, clunky and repetitive, which the whole idea of this genre is to make repetitive tasks enjoyable(news flash this is not).\n\n\nonce you do your first thing of every aspect of it, thats it! you experienced the full game with minor tweaks, upgrades along the way, it makes no difference if i can age 30 beers or 150 beers its the same process with almost to no little change, i mean i am making legendary reserve beers! they should be valued as such! food always stay the same quality, what changes is what ingredients you use on the same dish and the final price with a small fluctuation in price, meaning i can have steaks from cows, lambs, chickens, pork, same steak recipe just different animal.\n\nFarming is BORING on this game, you have to single shove the ground, then use a different tool to prepare the ground to plant stuff, then you need to water each individual square with water(they did add a tool to help with watering props for that) and then you can plant the things, which if you dont have the irrigation system you need to water it once or twice before it grows to full, imagine doing this by square for 30 crops or 60 or 90 holy hell.\n\nSocial interactions or quest: almost none a couple here and there its early access(5 years of it but still).\nCrafting\" works like any other game of this type, put fuel, put materials it makes thing yay!\nGathering: there a serious lack of zone and materials i normally see like 20-22 materials of something a day(yep you need to sleep for them to respawn again), meaning you are wasting the day which you could advance or work on stuff if the world had more material nodes or zones for specific ones.\n\nThis game tries to be better than graveyard keeper, yet it fails in every aspect of it(gathering, crafting, social interactions, plot, farming).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Five years in early access. Very little to do in the game. Had potential. I honestly doubt meaningful effort is being put into finishing it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is fine. It can be incredbly addicting. But the game is FAR from close to full release. I feel scammed paying for something thats uncomplete. Very robotic, very glitchy. No soul.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It at first gives a good impression as a game with plenty to explore and to develop.\r\nBut it will very quickly bog down under cumbersome design decisions that for some reason is ''part of the core gameplay''.\r\n\r\nAnd i am not talking about things like grinding resources, no it is frankly tasks like taking things from one storage to a another to stay operational.\r\nThen it starts to pile up further and further as you progress and with no way to get out of it other than quite frankly shutting down operations that otherwise has all the features to be functional without the direct players input.\r\n\r\nThis also ties into a growth issue within the game too with the limitations on staff, you will hit a wall where you cannot expand anymore because you cannot have the staff to run it.\r\nSure you can keep building larger and bolder, but your singular waiter will not be able to tend to more customers, you also have one barkeep and counter but no more than that unless you yourself also get in behind the counter or tending tables.\r\n\r\nThis expands into more things as you go such as farming and animal husbandry where quite frankly tedius tasks that is expected to be offloaded on to staff at some point as a point of progression just are not.\r\nNo you are the tavernkeeper that has to do all the utterly boring things because you cannot and will not have staff for it, but the more engaging and fun things do have staff for it.\r\n\r\nIt is not exactly a game design i would have opted for nor really seen in other titles that last for more than a week, but it is the path the developer went.\r\n\r\nIn all Honesty, try Stardew valley instead if you have not.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is a little TOO spastic. The core gameplay loop is ok, but the patrons just suck the life out of the game.\r\nYou're constantly running and the patrons constantly complaining about something.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game starts with an exposition dump with information that you do not really care about and you also cannot skip it despite the game telling you to hold ESC to skip and then forces you into a very long boring tutorial with forced actions. It tries to be Stardew Valley but tavern keep version but it fails at immersing you into its world or characters. Literally the tutorial NPC will straight up break the 4th wall and tell you to press P on your keyboard to open a menu. I saw a friend play this game and thought it looked fun, but you have to slog through an insanely long step-by-step tutorial before you can even play the game, and I say this after spending 30 minutes in it, and I didn't even finish the tutorial. \n\nWhat made Stardew great is that it had a very short introduction, a very simple premise, and the game doesn't lock you into a tutorial and forcing you to take specific actions (in this game I tried to mine a rock in my way of tilling land, and it said \"I don't know how to do that\", because the game doesn't want you to do that YET). Stardew is simple, it drops you in its world and you have to figure it out yourself and the tutorial is done through quests and people sending you mail and talking to NPCs around town.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Many issues.. esp with building and upgrading",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun but two things are very bad:\n\n- its way to grindy AND not balanced between the income sources.. \n- coop performance is quiet bad (connecting to server, somtimes lagging...)\n\nOtherwise the game is great...   but for coop i cant recommend atm. Maybe i will chance the feedback later if its better...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Waiting for mine to be opened for more then 5 years.\nCool game, a lot of unrevealed potential.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "been in early access since 2020, still no relationships, broken/missing/incomplete quests (like the frozen guy in the ice)\n\nthe economy is broken, water cells for 1 silver, and its free, and expensive to make red wine tht you age for hours sells for 3 silver....i mean, what teh actual.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to love this game, but lately its become less of a tavern management sim, and more of a \"lets make this every other type of RPG and abandon updating any tavern management gameplay\" type of game lol.\n\nI didnt mind when the town got added, though that did make it take way too much time to get supplies for the tavern from the merchants bc of how huge that map is. \n\nWhat i dont like is so many other tasks (that dont involve the MAIN draw of the game) being added in while tavern keeping and creating the food + drink is being shafted (can no longer make custom dishes/add custom ingredient modifiers).\n\nI really used to like it, but i can see scope creep is slowly making it a chore to play and not the same game anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could be great, but a multitude of issues will ruin your experience. There are quite a few multiplayer bugs that will just get you 100% stuck in the game. The UX issues are everywhere. It's almost like no one on the dev team has played another video game before.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked it when it first came out, and while the game has cool mechanics, I think it's trying to be too many things at once and I can't get behind it again with the direction it's taken. Particularly not a fan of the narrative being about you trying to become the Tavern Keeper King. Haven't been able to suspend my disbelief in that aspect of the plot long enough to enjoy the rest of what the game might offer ever since.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is fun but crashes WAYYYYYYYYYYY TOO OFTEN for a little 3 gig pixel graphics game it should not do this crap. Not to mention i hate the mechanic of only saves when u sleep, I kno this and stardew valley games like tht crap but it is beyond infuriating when i spend an entire day meticulously decorating my tavern just for the game to crash right as i open for business. Then poof all tht work down th gutter thx game!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was enjoying Travellers Rest, before the update. I like chill games. It used to be chill. Now they have added a fast twich game. I hate it. I can't win it, so now the game had stopped for me.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}