{
  "positive": [
    {
      "review": "A gorgeous cyberpunk themed game, that has you jumping and running and slashing in a fast-paced parkour style!!!\n\nThe gameplay can be so addicting by the time I got comfortable with the controls, I often restarted checkponts like \"Wait, I can do this much better in one go\" for that sweet dopamine hit! I love the fact that you can switch around between different upgrades during missions for whatever reason you need. You want to explore? Or do some heavy damage if you struggle in a level? Be as stylish as you can? Just put the ones you want are you're good to go!\n\nThe story is your regular revenge plot, pretty straight forward, but the gameplay is truly where all the fun is, being elevated by an absolutely amazing synthwave soundtrack that makes each movement and encounter with enemies much more intense and satisfying.\n\nThe game is also very inclusive as it offers an assistance mode that slows down the pace a bit for those who want to have a little more laid-back playthrough or if you need some help to get the feel of the controls and difficulty as you start at the beginning. But once you get going, those training wheels quickly fall off as you want to go faster and faster!!!\n\nI absolutely LOOOVE this game, but I wouldn't recommended it to someone who has trouble being one-shotted or is not a fan of fast-paced FPS games and remembering patterns coupled with reflex-timed mechanics. If you have no issues with those, I HIGHLY recommend it to get it and have fun! ❤ Off playing the DLC next! :)",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Ghostrunner is an adrenaline rush from the first jump; fast, slick, and brutally satisfying. The one-hit, one-kill loop feels super fair once you get into the flow, and pulling off clean runs is ridiculously rewarding. The cyberpunk world looks sharp, the movement feels buttery smooth, and the soundtrack absolutely slaps. It’s tough, but if you like skill-heavy action games, it’s a blast.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Pro's:\nVery fluent and nice feeling gameplay.\nVisuals that go brrr\nContra's:\n- Difficult (not in the celeste way, in the frustrating way)\n- Repetitive gameplay\n- The story seems to be pretty average but it could really be not the case.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really interesting game. Great movement, combat, story, and voice acting. It's got that Hotline Miami \"everything dies in 1 shot, including you\" type of gameplay design, and it feels really great to outmaneuver your foes with the Titanfall-2 esque movement and overcome the very carefully designed challenges set out for you with nothing but your sword and a bit of slow-motion dodging. \n\nIt's really nice to play a game that isn't bogged down by design bloat or a ridiculous amount of padding--everything feels well paced and I was always excited to press on.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h2]It was fun. Nothing to write home about, but pretty fun gameplay. 7.5/10[/h2]\n\nBasically, if you like mirrors edge or neon white, that style of game, you will like this.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "games a banger, but don't do yourself a disservice by playing this with a game controller (thats mingin)  , put it this way, some games should absolutely be played with a controller, but the opposite is also true in the case of first person shooters/parkour games like this one, also I like beating my mates score on leaderboards sending a screenshot to him so he can swear at me. the love is real ^^",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun fast paced first person hack and slash, very good sword play and the game is very unforgiving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall I enjoyed most of my time in the game. There was a spot near the end that just sucked. It placed me at a checkpoint but I still had multiple spots to grab.  The issue became is that I needed to somehow get like 10 more and even if I went to the same point it would not save my progress.  Other than that, it was a good challenging game.\r\n\r\nIf you are interested, I would recommend the demo to try.  The demo is easier since it is pretty much like the beginning of the game but if you enjoyed it and are up for a challenge then I would recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Immaculate Atmosphere, Tight Mechanics, Stellar Design. \r\n\r\nMediocre Story. \r\n\r\nOverall 8/10, really good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's actually crazy how this game goes from a 6/10 to a 9/10 just by changing to Hardcore difficulty. Unfortunately, you need to finish the 4/5 hour base campaign to unlock Hardcore, but it does serve as a tutorial I guess.\r\n\r\nThe main problem of the base difficulty is that the levels were designed with lobotomy patients in mind. Levels are VERY basic paths of enemies where it isn't really difficult to take them one after another. Hardcore makes you play through the same levels again, except they've changed enemy and hazard placements so levels actually feel as if a designer had put some thought went into them.\r\n\r\nOther bonuses of Hardcore:\r\n- No braindead walking puzzle sections where they remove your movement options so they can lore dump on you\r\n- Level design gives you opportunities where your combat abilities feel helpful and varied, not just spamming Tempest.\r\n\r\nI wish there was a middle difficulty where the level design was challenging but they still gave the needed tutorials. The devs really needed to trust the player on a first playthrough more for this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of those rare games where the difficulty is punishing, but when you die you can hardly ever blame the game. Controls are tight, responsive and almost feel like second nature. If you die, it's a skill issue. No game has ever reminded me to \"get gud\" if I want to move on. On top of that it's got a \"hardcore\" type mode, which adds to the joy. Loved every second -- even when I was screaming at my monitor every once in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better \"flow state\" games out there. Absolute blast to run through, and there are a large number of levels that are a simple joy to improve runs on, even as a non-speedrunner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't say this lightly, but... this game has movement that is on par with Titanfall 2. The combat is great, even if you're a noob to these sort of games. 10/10 love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid action game. Environment design is incredible and probably the best part of the experience. The action gameplay is placed front and centre, and while it is fun, it isn't particularly deep. Enemies are not intelligent with their aiming, only shooting at your current location, so as long as you're constantly moving you won't get hit. Traversal fairs little better - the protagonist will magnetise to walls and rails, and grapple points only require a single button click. The room for skill expression is low. About the most complex movement option is chaining a dash into a slide for a quick burst of speed. \n\nWith enemies dying in one hit, the strategy comes not from the actual killing of them but the routing between them, dodging and occasionally deflecting projectiles as they come. This necessitates an understanding of the level layout, and therefore a lot of trial and error is required, and consequently a lot of death. Checkpoints are very generously placed to compensate for this, which leads to low stakes gameplay where death is more or less considered a part of the experience - unfortunately further reducing the potential for skill expression. \n\nThis all leads to gameplay having a sort of mindless quality, being fairly enjoyable but not truly engaging. I've seen the game be described as [i] difficult [/i], and I have to strongly disagree. Its only [i] difficult [/i] if by difficult you mean you die a lot. Which you do. But despite that, the game rarely feels [i] challenging [/i], due to its shallow mechanics.\n\nThe developers wisely made restarting as quick and painless as possible - after dying, one button press instantaneously starts you at the last checkpoint with you in full control. Any kind of load screen could have completely killed the game's momentum and I'm VERY glad they ensured this didn't happen. It speaks to a level of awareness of the user experience that they clearly had when putting the game together. Similarly, the story is delivered not through gameplay-interrupting cutscenes, which would be detrimental to a game with such a heavy emphasis on fast paced action, instead opting to deliver exposition through voiceovers that play during levels. \n\nThe writing is not exactly a masterclass but it gives context to the world and is enjoyable enough to follow. The music is alright - falls into the same category as DOOM or Dark Souls in my eyes, in the sense that the tracks sort of blend into one while playing and I certainly wouldn't listen to them outside of the game - but nevertheless they convey the right atmosphere.\n\nOverall its a fun game, but don't expect anything too deep.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Be aware, this game is not easy.\r\nThere are no defensive tools, you have to solve the situations flawlessly without getting hit, if not you start the pattern again and do better. \r\nThe challenge somehow got me and i enjoyed the game. Story is mediocre, i think it excels in gameplay, style and in the challenge the game offers you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun first person movement games. Visually it looks very pleasing and the soundtrack is great. The story isn't that interesting but it doesn't get in the way. The Cybervoid sections are very boring but I only really have to play them on your first playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, however, I have some stuff I just didn't enjoy.\r\n\r\nPros:\r\n- The levels feel fast and are quite relaxing to learn through, their gimmicks on each of them make them quite enjoyable to sit through.\r\n- Enemy variety keeps the game from being stale\r\n- The soundtrack is insane and I love it~\r\n\r\nCons:\r\n- There's some enemies that ruin the game for me (bomber guys, shield men, parry only sword guys)\r\n- The part where they remove your dash and abilities as it makes you do puzzles... Man what a bore.\r\n- There's some areas where you are not told where to go and It feels bothersome when they were doing it pretty well with the level design in levels before, but then again I played without UI so that's that.\r\n- Voice acting felt so bothersome as I had to remove the VAs from constantly talking, talking and talking and holy heck they just wouldn't stop.\r\n\r\nOverall fun fast game, it took me 4 hours to beat and you will enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome fast paced action gameplay.  An underrated gem of a game, absolutely worth playing if you like Cyberpunk themes or Sci-Fi action games.  The choice to minimise ranged weapons (mostly unlocking near the end of the game besides temporary powerups) forces the player to think quickly deciding the best approach moment to moment in a fluid and surprisingly easy to learn parkour/melee combat system.\r\n\r\nTaking design cues from games like Half Life, there's very little in the way of HUD making for a very immerisive combat experience.  Using in world design elements like lighting and signage makes navigating the cyberpunk world of Ghostrunner feel like second nature.  \r\n\r\nA compelling story drives the action forward at a blistering pace, but despite the fact that you're whipping through levels at speed every area feels unique and adds to the story and world you're exploring.  \r\n\r\nThe story is fully voice acted and the actors do a great job delivering the material.  Most of the story told through conversations between the Ghostrunner and other characters via radio (or whatever cyber tech equivalent) which you won't be stuck watching cutscenes in between the action.\r\n\r\nThe majority of the gameplay consists of platforming and melee combat, you'll often need to earn enemies locations and a good route through an area before you can progress.  This is broken up with some light puzzle elements and some exciting platforming challenge sections which are consistently fun throughout the game providing some opportunities for the slower paces story sections and giving the player some breathing room to learn and master the various powerups and special abilities as they unlock. \r\n\r\nThis isn't what I'd call an easy game, but the developers have done a great job of balancing the difficulty with generous checkpoints, and the gradual difficulty curve means you get a great sense of accomplishment from progressing towards the end of the game.  Replayability wise there's a bunch of secrets to discover that much like Doom will usually be missed on a first playthrough but once you learn how to spot them you'll have a lot of fun discovering new cosmetics and lore items hidden throughout the  maps.  \r\n\r\nA masterclass in traditional linear game designg taking great elements from classic games and combing them in a way that feels totally unique and yet familiar with a high level of polish that gives some modern AAA titles a run for their money.\r\n\r\nOverall it's easy to recommend Ghostrunner just for it's gameplay but the story and visuals take the game to another level that is increasingly rare for new games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Butt clenching gameplay.\nMusic is on point as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh man, this gameplay is addicting. Wish there were more levels to play. Katana Zero meets Cyberpunk is how I would describe Ghostrunner.\nThe story is honestly whatever. It's there but not what you're here for.\nYou're here for the very fast paced, progressively more challenging combat and surprisingly well made precise movement mechanics. Parkour sections are equally as fun as combat sections. I also appreciate how much freedom you get when it comes to choosin upgrade loadouts. There's something for every playstyle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An entertaining action platform game where every hit is death. The low time to kill and fluid parkour gameplay combine together in a way that grants a sense of power over few games can match outside of the DOOM series. Every level brings a new variety of challenges, but the game's two boss fights feel a bit clunky for what they are. The puzzle segments are rather simplistic and feel hard to get lost in, but that works to the games advantage when you just want to get back to the frenetic parkour combat.\n\nThe game's story is fairly basic with the major plot twist being something people could guess from the outset. That said it's still fairly entertaining for what the story is, and gives the ground work needed for the much more story heavy second game, which focuses much more on expanding the lore of the world outside the tower.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, the arena mode is some of the most fun I've had in one of these types of games, genius choice. Cant get into the sequel at all unfortunately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ghostrunner is one of those type of games you will love to hate. Just when you think you have progressed and things start to get easier, boom! there is another challenge that is progressively harder.\n\nget ready for some serious rage bait hell, this game will have you frustrated but coming back for more like an addict.\n\npros: amazing graphics and great story line\n\ncons: takes awhile to learn the game mechanics and you will definitely get frustrated now and again with repeating tasks.\n\ni still recommend this game but maybe a 3 or 4 our of 5 I cant justify a full 5 out of 5 because of how it constantly frustrates me, but maybe i am just not use to this type of game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was difficult but was also very fun and incredibly rewarding. Graphic and environment building were also fantastic. Overall 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are someone who will get easily frustrated about dying multiple times, this game isn't for you. If you can handle that, this game is a really awesome experience and I can't wait to try out the sequel soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got ts for 3 shmackeroons so its lwk good for the price pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Samurai and ninja at once. Badass asf.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dude, Jack the Ghostrunner is so cool. I wanna be just like him.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game makes you feel stuff you haven't felt before... the good stuff...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 gameplay. 10/10 Soundtrack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a lot of fun at times but damn some parts are very jank",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best action games I've played by far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Criminally overlooked. BIg recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprising replayability imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really interesting game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good little game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than Ghostrunner 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dope & beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God i hate this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very gud gaem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "press r simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "哪裡可以入主角",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ye",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cyber Ninja go    W O O S H n' S L A S H\r\nfast 10/10 boi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are a masochist this game is for you.\nGhostrunner isn't one of those run and slash games, you have no health and a single hit can kill you. It's more of a puzzle game more than anything at least to me. The challenge is in navigating the best way to deal with the threats around you in the most reliable and efficient way possible. I have died literally thousands of times in this game but I will admit that they were on me for the most part.\n\nPros\nStory is pretty cool and in my opinion is fresh when looking at other games.\nVisuals are beautiful.\nGameplay is really smooth at least on PC.\nDying is less detrimental than it is inconvenient which helps with how much you will die.\nThere is an assist mode which can help people who are not as good with fast paced games.\n\nCons\nSteep learning curve and not a good game for people who haven't played a lot of games before.\nThe final two bosses are lacking in substance compared to the first one.\nEnemies sometimes blend into the background without one of the early buffs in the game.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This game is amazing. It has very cool and challenging gameplay and nice visuals",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I HAVE PRESS R ONE MORE TIME I'M SMASHING MY COMPUTER. Good game. Boss fights were really lacking. Would recommend I guess.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "everything is great except the cybervoid and final level(seriously f*ck that level sh*ts more frustrating than the whole soulsborne games)\r\n\r\n10/10 OST\r\n10/10 gameplay\r\n0/10 puzzle\r\n-100/0 cybervoid\r\n\r\noverall its 6.5/10 for me",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A gorgeous cyberpunk themed game, that has you jumping and running and slashing in a fast-paced parkour style!!!\n\nThe gameplay can be so addicting by the time I got comfortable with the controls, I often restarted checkponts like \"Wait, I can do this much better in one go\" for that sweet dopamine hit! I love the fact that you can switch around between different upgrades during missions for whatever reason you need. You want to explore? Or do some heavy damage if you struggle in a level? Be as stylish as you can? Just put the ones you want are you're good to go!\n\nThe story is your regular revenge plot, pretty straight forward, but the gameplay is truly where all the fun is, being elevated by an absolutely amazing synthwave soundtrack that makes each movement and encounter with enemies much more intense and satisfying.\n\nThe game is also very inclusive as it offers an assistance mode that slows down the pace a bit for those who want to have a little more laid-back playthrough or if you need some help to get the feel of the controls and difficulty as you start at the beginning. But once you get going, those training wheels quickly fall off as you want to go faster and faster!!!\n\nI absolutely LOOOVE this game, but I wouldn't recommended it to someone who has trouble being one-shotted or is not a fan of fast-paced FPS games and remembering patterns coupled with reflex-timed mechanics. If you have no issues with those, I HIGHLY recommend it to get it and have fun! ❤ Off playing the DLC next! :)",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I'm not a person to keep playing after dying so many times, but something about this game's respawn mechanism makes it easy to play the same level over and over without getting tired + the is by no means repetitive so you're guaranteed to have fun!.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "tbh i was tired of shooter games so i bought this game and i actually enjoyed it's 8.5/10 for me the music and sotry was great but bosses and  atmosphere could be much better",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Ghostrunner is an adrenaline rush from the first jump; fast, slick, and brutally satisfying. The one-hit, one-kill loop feels super fair once you get into the flow, and pulling off clean runs is ridiculously rewarding. The cyberpunk world looks sharp, the movement feels buttery smooth, and the soundtrack absolutely slaps. It’s tough, but if you like skill-heavy action games, it’s a blast.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Pro's:\nVery fluent and nice feeling gameplay.\nVisuals that go brrr\nContra's:\n- Difficult (not in the celeste way, in the frustrating way)\n- Repetitive gameplay\n- The story seems to be pretty average but it could really be not the case.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really interesting game. Great movement, combat, story, and voice acting. It's got that Hotline Miami \"everything dies in 1 shot, including you\" type of gameplay design, and it feels really great to outmaneuver your foes with the Titanfall-2 esque movement and overcome the very carefully designed challenges set out for you with nothing but your sword and a bit of slow-motion dodging. \n\nIt's really nice to play a game that isn't bogged down by design bloat or a ridiculous amount of padding--everything feels well paced and I was always excited to press on.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A visually stunning and fast-paced hack-and-slash parkour game, the DLC is also short but sweet. I waited many years to pick the DLC up on a good sale in order to finally 100% the game. Waiting paid off and I also had a lot of fun in the process revisiting the game in preparations to Ghostrunner II.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h2]It was fun. Nothing to write home about, but pretty fun gameplay. 7.5/10[/h2]\n\nBasically, if you like mirrors edge or neon white, that style of game, you will like this.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "✔ very fast paced\n✔ fluid and satisfying when executed properly, especially when you pass a new encounter on first try\n\n? separated 50-50 between combat and platforming\n? one-hit kill makes it difficult\n? the two above lead to gameplay feeling very much like an muscle-memory action puzzle of finding a correct pathing and executing it flawlessly\n? enemy aimbot - I suppose they are cybernetically enhanced soldiers or something...\n\n✘ corridor level design - fine during platforming section but even though there are sometimes multiple paths during combat arenas it still feels like there is a correct path designed for you\n\nThe game is good, but I decided to not continue playing. The first \"boss fight\" would require hundreds of attempts, repeating the same jumps again and again and again until learning the patterns and pathing and it just seems like work to me at this point, even though until that point I only died at most several times on some more difficult encounters. But that's on me, I can see why many would enjoy this boss fight.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very nice quality good effect and overall 9.5 out of 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ghostrunner is an intense and stylish first-person slasher that kept me hooked from start to finish. The fast-paced parkour, precise combat, and incredible soundtrack create a constant adrenaline rush. It can be challenging at times, but finally pulling off a perfect run feels so rewarding. If you enjoy cyberpunk vibes, fluid movement, and a good test of skill, this game is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "games a banger, but don't do yourself a disservice by playing this with a game controller (thats mingin)  , put it this way, some games should absolutely be played with a controller, but the opposite is also true in the case of first person shooters/parkour games like this one, also I like beating my mates score on leaderboards sending a screenshot to him so he can swear at me. the love is real ^^",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you love going fast and some good parkour then this title is just perfect for you. Stunning Cyberpunk aesthetics and catchy music are just the icing on the cake.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun fast paced first person hack and slash, very good sword play and the game is very unforgiving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall I enjoyed most of my time in the game. There was a spot near the end that just sucked. It placed me at a checkpoint but I still had multiple spots to grab.  The issue became is that I needed to somehow get like 10 more and even if I went to the same point it would not save my progress.  Other than that, it was a good challenging game.\r\n\r\nIf you are interested, I would recommend the demo to try.  The demo is easier since it is pretty much like the beginning of the game but if you enjoyed it and are up for a challenge then I would recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Immaculate Atmosphere, Tight Mechanics, Stellar Design. \r\n\r\nMediocre Story. \r\n\r\nOverall 8/10, really good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's actually crazy how this game goes from a 6/10 to a 9/10 just by changing to Hardcore difficulty. Unfortunately, you need to finish the 4/5 hour base campaign to unlock Hardcore, but it does serve as a tutorial I guess.\r\n\r\nThe main problem of the base difficulty is that the levels were designed with lobotomy patients in mind. Levels are VERY basic paths of enemies where it isn't really difficult to take them one after another. Hardcore makes you play through the same levels again, except they've changed enemy and hazard placements so levels actually feel as if a designer had put some thought went into them.\r\n\r\nOther bonuses of Hardcore:\r\n- No braindead walking puzzle sections where they remove your movement options so they can lore dump on you\r\n- Level design gives you opportunities where your combat abilities feel helpful and varied, not just spamming Tempest.\r\n\r\nI wish there was a middle difficulty where the level design was challenging but they still gave the needed tutorials. The devs really needed to trust the player on a first playthrough more for this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of those rare games where the difficulty is punishing, but when you die you can hardly ever blame the game. Controls are tight, responsive and almost feel like second nature. If you die, it's a skill issue. No game has ever reminded me to \"get gud\" if I want to move on. On top of that it's got a \"hardcore\" type mode, which adds to the joy. Loved every second -- even when I was screaming at my monitor every once in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better \"flow state\" games out there. Absolute blast to run through, and there are a large number of levels that are a simple joy to improve runs on, even as a non-speedrunner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't say this lightly, but... this game has movement that is on par with Titanfall 2. The combat is great, even if you're a noob to these sort of games. 10/10 love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid action game. Environment design is incredible and probably the best part of the experience. The action gameplay is placed front and centre, and while it is fun, it isn't particularly deep. Enemies are not intelligent with their aiming, only shooting at your current location, so as long as you're constantly moving you won't get hit. Traversal fairs little better - the protagonist will magnetise to walls and rails, and grapple points only require a single button click. The room for skill expression is low. About the most complex movement option is chaining a dash into a slide for a quick burst of speed. \n\nWith enemies dying in one hit, the strategy comes not from the actual killing of them but the routing between them, dodging and occasionally deflecting projectiles as they come. This necessitates an understanding of the level layout, and therefore a lot of trial and error is required, and consequently a lot of death. Checkpoints are very generously placed to compensate for this, which leads to low stakes gameplay where death is more or less considered a part of the experience - unfortunately further reducing the potential for skill expression. \n\nThis all leads to gameplay having a sort of mindless quality, being fairly enjoyable but not truly engaging. I've seen the game be described as [i] difficult [/i], and I have to strongly disagree. Its only [i] difficult [/i] if by difficult you mean you die a lot. Which you do. But despite that, the game rarely feels [i] challenging [/i], due to its shallow mechanics.\n\nThe developers wisely made restarting as quick and painless as possible - after dying, one button press instantaneously starts you at the last checkpoint with you in full control. Any kind of load screen could have completely killed the game's momentum and I'm VERY glad they ensured this didn't happen. It speaks to a level of awareness of the user experience that they clearly had when putting the game together. Similarly, the story is delivered not through gameplay-interrupting cutscenes, which would be detrimental to a game with such a heavy emphasis on fast paced action, instead opting to deliver exposition through voiceovers that play during levels. \n\nThe writing is not exactly a masterclass but it gives context to the world and is enjoyable enough to follow. The music is alright - falls into the same category as DOOM or Dark Souls in my eyes, in the sense that the tracks sort of blend into one while playing and I certainly wouldn't listen to them outside of the game - but nevertheless they convey the right atmosphere.\n\nOverall its a fun game, but don't expect anything too deep.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Be aware, this game is not easy.\r\nThere are no defensive tools, you have to solve the situations flawlessly without getting hit, if not you start the pattern again and do better. \r\nThe challenge somehow got me and i enjoyed the game. Story is mediocre, i think it excels in gameplay, style and in the challenge the game offers you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun first person movement games. Visually it looks very pleasing and the soundtrack is great. The story isn't that interesting but it doesn't get in the way. The Cybervoid sections are very boring but I only really have to play them on your first playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, however, I have some stuff I just didn't enjoy.\r\n\r\nPros:\r\n- The levels feel fast and are quite relaxing to learn through, their gimmicks on each of them make them quite enjoyable to sit through.\r\n- Enemy variety keeps the game from being stale\r\n- The soundtrack is insane and I love it~\r\n\r\nCons:\r\n- There's some enemies that ruin the game for me (bomber guys, shield men, parry only sword guys)\r\n- The part where they remove your dash and abilities as it makes you do puzzles... Man what a bore.\r\n- There's some areas where you are not told where to go and It feels bothersome when they were doing it pretty well with the level design in levels before, but then again I played without UI so that's that.\r\n- Voice acting felt so bothersome as I had to remove the VAs from constantly talking, talking and talking and holy heck they just wouldn't stop.\r\n\r\nOverall fun fast game, it took me 4 hours to beat and you will enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome fast paced action gameplay.  An underrated gem of a game, absolutely worth playing if you like Cyberpunk themes or Sci-Fi action games.  The choice to minimise ranged weapons (mostly unlocking near the end of the game besides temporary powerups) forces the player to think quickly deciding the best approach moment to moment in a fluid and surprisingly easy to learn parkour/melee combat system.\r\n\r\nTaking design cues from games like Half Life, there's very little in the way of HUD making for a very immerisive combat experience.  Using in world design elements like lighting and signage makes navigating the cyberpunk world of Ghostrunner feel like second nature.  \r\n\r\nA compelling story drives the action forward at a blistering pace, but despite the fact that you're whipping through levels at speed every area feels unique and adds to the story and world you're exploring.  \r\n\r\nThe story is fully voice acted and the actors do a great job delivering the material.  Most of the story told through conversations between the Ghostrunner and other characters via radio (or whatever cyber tech equivalent) which you won't be stuck watching cutscenes in between the action.\r\n\r\nThe majority of the gameplay consists of platforming and melee combat, you'll often need to earn enemies locations and a good route through an area before you can progress.  This is broken up with some light puzzle elements and some exciting platforming challenge sections which are consistently fun throughout the game providing some opportunities for the slower paces story sections and giving the player some breathing room to learn and master the various powerups and special abilities as they unlock. \r\n\r\nThis isn't what I'd call an easy game, but the developers have done a great job of balancing the difficulty with generous checkpoints, and the gradual difficulty curve means you get a great sense of accomplishment from progressing towards the end of the game.  Replayability wise there's a bunch of secrets to discover that much like Doom will usually be missed on a first playthrough but once you learn how to spot them you'll have a lot of fun discovering new cosmetics and lore items hidden throughout the  maps.  \r\n\r\nA masterclass in traditional linear game designg taking great elements from classic games and combing them in a way that feels totally unique and yet familiar with a high level of polish that gives some modern AAA titles a run for their money.\r\n\r\nOverall it's easy to recommend Ghostrunner just for it's gameplay but the story and visuals take the game to another level that is increasingly rare for new games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Butt clenching gameplay.\nMusic is on point as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh man, this gameplay is addicting. Wish there were more levels to play. Katana Zero meets Cyberpunk is how I would describe Ghostrunner.\nThe story is honestly whatever. It's there but not what you're here for.\nYou're here for the very fast paced, progressively more challenging combat and surprisingly well made precise movement mechanics. Parkour sections are equally as fun as combat sections. I also appreciate how much freedom you get when it comes to choosin upgrade loadouts. There's something for every playstyle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An entertaining action platform game where every hit is death. The low time to kill and fluid parkour gameplay combine together in a way that grants a sense of power over few games can match outside of the DOOM series. Every level brings a new variety of challenges, but the game's two boss fights feel a bit clunky for what they are. The puzzle segments are rather simplistic and feel hard to get lost in, but that works to the games advantage when you just want to get back to the frenetic parkour combat.\n\nThe game's story is fairly basic with the major plot twist being something people could guess from the outset. That said it's still fairly entertaining for what the story is, and gives the ground work needed for the much more story heavy second game, which focuses much more on expanding the lore of the world outside the tower.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, the arena mode is some of the most fun I've had in one of these types of games, genius choice. Cant get into the sequel at all unfortunately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ghostrunner is one of those type of games you will love to hate. Just when you think you have progressed and things start to get easier, boom! there is another challenge that is progressively harder.\n\nget ready for some serious rage bait hell, this game will have you frustrated but coming back for more like an addict.\n\npros: amazing graphics and great story line\n\ncons: takes awhile to learn the game mechanics and you will definitely get frustrated now and again with repeating tasks.\n\ni still recommend this game but maybe a 3 or 4 our of 5 I cant justify a full 5 out of 5 because of how it constantly frustrates me, but maybe i am just not use to this type of game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was difficult but was also very fun and incredibly rewarding. Graphic and environment building were also fantastic. Overall 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are someone who will get easily frustrated about dying multiple times, this game isn't for you. If you can handle that, this game is a really awesome experience and I can't wait to try out the sequel soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very hardcore platform/action game with fast paced gameplay.\nMost of the time the progress is trial and error, and the late game is very frustrating and challenging but also rewarding.\nMaybe the boss fights can be better\nThe music is the classical synthwave. Nothing new\nVery good game overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly the gameplay loop is really satisfying once you get the hang of it. the problem is that it's not well suited for 1st playthroughs, so if you're going in blind, you're gonna hate it pretty bad at first (got it on -75% and even then i was still pissed enough to almost refund it at one point). it takes some getting used to, like an acquired taste, but then it's pretty aight. difficulty is a joke once you beat a level once\r\n\r\ntl;dr gameplay is pretty good once u get it. setting is cool, story is just meh though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some of the best wall-running on the market. Only way to improve is more wall-running",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun hack and slash game where you need to be perfect in order to finish the game. If you hang on the controls you will enjoy this one. I think this is still the best Ghostrunner compare to Ghostrunner 2. DLC Project_Hel is good addition to the game. I enjoyed that DLC. Achievements are easy compare to Ghostrunner 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Summary:[/b]  This is barely a recommend; the game has just enough going for it to overcome its flaws.  It is definitely not for everyone.  If you want a parkour game instead of a bullet dodger then you will be severely disappointed.\r\n [hr]\r\n\r\n[b]Pros[/b]\r\n- It is a gorgeous game, despite some sacrifices to make it so.  Probably due to the ray-tracing more than anything.  It's drenched in neon, which entertains me to no end as an 80s arcade rat.  The ray tracing can be disabled because the game moves so fast you won't have much time to appreciate the visuals the vast majority of the time you're playing it.  Regardless, the visuals are very much a high point for Ghostrunner.\r\n- Movement is very satisfying, with level design that offers visual cues to help guide you.  This is similar to Mirror's Edge though not quite as blatantly implemented.  The default controls can be a bit much for the left hand so you may want to re-bind a few controls to your mouse (such as the air dodging).  No idea how this would play with a controller.\r\n- When everything goes right there is a genuine exhilaration in the gameplay experience.  It's fast, stylish, gory, and rewarding to nail an area.  You are always at a disadvantage in the game and hence overcoming every area feels like a significant accomplishment.\r\n\r\n[b]Cons[/b]\r\n- Running on a 3070 the game barely cracks 30fps at 4K, which basically makes it an impossible slideshow.  DLSS set to Performance was required to get this game running at a sometimes-stable 60fps.  Shader caching causes significant hitching whenever you encounter something new.  It's usually best to just run around and die a couple times to try get all the area shaders cached.\r\n- The game is a lot like Boshy, Super Meat Boy, or similar games where you're expected to die from a single hit countless times.  This isn't necessarily a con for everyone, but it is frustrating to me because of the implementation. Basically every area starts with you moving somewhere to get a bearing on your surroundings only to eat a random shot from an enemy.  \r\n- Needing to take blind deaths until you can find all your enemies and make a game plan to get through an area really drags down the experience.  A minimap shows enemies as red dots, but no walls, verticality, etc. so it is of minimal use.\r\n\r\n[b]Ugly[/b]\r\n- The best way I can describe Ghostrunner is that it is the literal videogame equivalent of bringing a knife to a gun fight.  You have a sword, and everyone else has a gun which they can aim flawlessly and shoot without ever reloading.  You can't take their guns, and there's no stealth mechanics that would preclude using a noisy gun either. You apparently prefer taking the most difficult and dangerous tactic for the sole purpose of using a sword.  There's no way using a gun is more difficult or complicated than running on walls and air dodging to get in melee stabby range.  I know, I know, it's just a videogame.  No matter how much I try I can't suspend disbelief that my character is this suicidal and/or stupid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ghostrunner is a meticulously crafted challenge that expects you to put on your cyberpunk ninja hat. If you don't already have one, this is a good step towards earning it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant runner-combat game; I found it a grand fusion between Mirror's Edge and Bioshock Infinite. The parkour and puzzle-style combat were compelling and galvanising. I think the only aspect I didn't enjoy quite as much as the intricately and beautiful levels was the interstitial cybervoid zones - they were a narrative and dramatic change of pace, but I feel the puzzles did a disservice to the non-stop action of the game. I do wish swords and gloves weren't locked behind level collectables; trying to search for things slows down the point of the high-octane run. Apart from this, I loved every moment. Even the narrative was compelling - can't wait for more of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun fast-action platformer. Fantastic soundtrack and really great visuals. Though, the environments are very gamey, feeling like many of the places you navigate are not very realistic or serve any purpose aside from being a videogame environment meant for you to beat.\n\nThe gameplay was not exactly my cup of tea, though. I get lore-wise that you're supposed to be so hyper-advanced that all of your deaths are basically just your character (Jack) calculating, and when you win is like the actual events-- but gameplay-wise it can get pretty annoying that no matter what, you die from one hit. Some areas got quite frustrating, taking me something like 50+ attempts to complete one level. At least there are frequent checkpoints.\n\nThe story had a really good premise, but was executed somewhat lukewarm. Had a really predictable twist towards the end, and overall felt pretty cheesy from the dialogue. Was expecting something more on the level of Mirror's Edge but still not a bad game at all for someone looking for some neon cyberpunk action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but not with out its faults. A lot of the time I found my self not being able to see an enemy, the highlight upgrade is practically mandatory. Second, the game doesn't really tell you about upgrades unless you die, something I would have loved to know about before i was already halfway through. This might be a me thing but the AI's aim is absolutely crazy the amount of time I've been hit by a stray bullet was insane. Also the parrying/bullet reflect is down right useless half the time because of its preciseness Finally the games parkour is awesome but sometimes i feel like i wall run when I don't want to leading to me dying and when i do want to the character seems to not want to snap on to the wall. Overall I had a great time playing through the game even if it was a tad bit too short, would highly recommend to anybody who like hack and slash parkour games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: Fluid and responsive parkour/combat, cyberpunk vibes, it's fun, albeit short. If you like games like Neon White or mirror's edge, with more focus on combat, give this a try.\r\n\r\nI'm generally not a fan of high-skill games, as I feel I waste way too much time getting good enough to enjoy them. Ghostrunner gives players like me a lifeline in the form of very frequent checkpoints and immediate respawns. This allows you to really drill the techniques and reflexes needed for each encounter, while slowly increasing the difficulty curve.\r\n\r\nThere isn't much in terms of story, it's quite standard cyberpunk fare, but that's ok. The world is nicely designed to drive home the aesthetic, and the soundtrack with its bass synth-heavy lines works perfectly with it.\r\n\r\nThe game really shines in its combat though. Movement is fast and responsive, various upgrades keep things interesting, and level design almost feels like solving a puzzle in how you approach it. The fact that you die with a single hit makes for a challenge, but also makes it feel very rewarding to clear off a level without a single scratch. I haven't seen any other game nail the cyberpunk ninja feel quite so successfully.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of my all-time favorite games. The combat is smooth, intense, and super quick. The difficulty is just perfect that it is hard but not impossible. The story is quick, but good enough that I wanted to replay it 4+ times. 100%-ing it is hard, but it was definitely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story is mid at best, but the combat is some of the best. very satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was one of my most and best favourite buys I ever done on steam. I didnt regret a single thing about this game.\r\nThe graphics? the story, the characters, Jack the badass especially and the soundtrack? All of that was AMAZING, I LOVED IT.\r\n\r\nNot only that, I remember I bought this game back then when I was having a rough time in life and identity crisis. This game honestly changed me and helped me. It made me realize a lot of things and still favourite game of all time.\r\n\r\nAnd you gotta love the silly Jack right?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, excited to play the second and just did the play test for Valor Mortis which was also amazing. Great Game developers, setting the precedent for what a game should be.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "At first it feels incredible - visuals, speed, atmosphere. But soon it becomes boring die-restart gameplay. The whole gameplay is just memorizing every step. You are not mastering the game, you are just playing pattern-learning simulator.\n10/10 Design.\n0/10 Fun.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "you never go where you want to; the core of this game is platforming but the platforming is just god awful",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Movement is good. Combat is...bad. Yeah that's the word. The combat is really really bad. The game essentially consists of fun but trivial platforming interspaced with frustrating trial & error combat sequences. The distance you need to be to kill an enemy is wildly inconsistent and the enemies can track through walls and instakill you. I’ve seen comparisons to Hotline Miami, but those are off the mark. In Hotline Miami the enemies actually react to the player in intuitive and consistent ways. The enemies in Ghostrunner stand around and are somewhat closer to platforming challenges than real combat. They function almost exactly like enemies in Mario games. I have died and tried the EXACT same thing and have succeeded, so there is extreme inconsistency with the ways enemies respond to you as well. The feeling of not knowing why you died is prevalent and this is very unsatisfying. When I succeed with a combat strategy one encounter and then fail in the next using the same tactics, I start to think that it is not my fault I died, but the fault of the game for having inconsistent mechanics. And that sucks the fun right out of any game. The one boss I faced before uninstalling this trash was named Tom and was a platforming memorization puzzle as if it were 1987. A truly dreadful boss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just get Ghostrunner 2. It resolves the endless issues present in this game and is significantly longer\n\nWallrunning in 1 is busted - You will randomly lose momentum or detach from walls. There's also an arbitrary \"sweet spot\" on walls and your jumps wont be full power unless you hit it. \n\nLedge Grab - Camera required to be facing a specific (but arbitrary) direction/angle to land the grab. You will miss grabs while facing the ledge head-on, making full contact.\n\nIn short, most of your \"failures\" will have nothing to do with you. \n\nLastly, combat isn't really combat. The enemies are more like \"traps\" in this game, which some people might actually prefer-- but if you're expecting enemies that chase/pursue you and have AI, this game does not offer that. The second game does.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate this game. Its a rhythm game and not like what I expected at all. Game is stupidly desgined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fast paced to fast, not enjoyable or easy to pick up.  Don't waste your money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great combat, awful parkour and bosses",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downloaded. Played. Fantastic. Keep dying. Quit :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe I'll come back to this game and play it more, but this game is simply inconsistent in platforming/combat and the times where I felt like a bad ass playing it were very short lived and ALWAYS fell flat because of poor mechanics; I don't feel like this is a \"git gud\" game, but more of like a puzzle game where you have figure out how to kill the enemies in the best path that provides the least chance for RNG killing you. \n\nMy first time playing this game I played for about 2 hours, which usually means for me I will continue playing the game. At times I really was having fun and at times I felt like a bad ass; then using the same moves and inputs, I suddenly am getting killed instantly, I'm missing platforms, I'm moving fast and sliding through obstacles to leap off the edge of one and not know where I'm supposed to go, etc.\n\nIt presents itself as very fluid and fast paced and at times both the combat and platforming can feel like that, but the mechanics simply don't work as well as I've seen in other parkour/fast paced games. Wall runs don't center you on the wall (making the next jump either too low or worse you are too high and start climbing on top of a wall you can't even stand on) and jumping between tight corridors often has you grabbing the wrong platform/wall; these very poorly designed mechanics make every fast paced run fall flat EVERY SINGLE TIME.\n\nCombat also seems to be very inconsistent; the core gameplay is basically dying over and over again so you can learn from your mistakes or understand what you need to improve upon. Once you develop a rhythm and understand the placement of the enemies, you will naturally start following the same path to kill them all. Following the exact same path and using the exact same inputs will work like 85% of the time, the other 15% you will die and have no clue what it was that killed you; I have never played a game where the combat seems to be so inconsistent.\n\nThe platforming needs a lot of work despite older parkour games doing a much better job with the exact same mechanics, and the combat simply felt masochistic because of the crappy parkour elements and weird RNG instakills with enemies.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "At first it feels incredible - visuals, speed, atmosphere. But soon it becomes boring die-restart gameplay. The whole gameplay is just memorizing every step. You are not mastering the game, you are just playing pattern-learning simulator.\n10/10 Design.\n0/10 Fun.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "You gotta first die a 100 times just to get across the level, hell no. Not for me. \nMight be good for player who like exclusively fast-paced action, I guess. However, this feels very limited in initial movement and abilities, especially at the start which should be the part that gets you \"hooked\". Instead it just maker you feel incapable, overall feels lacking and makes the progress incredibly hard with no satisfaction or power-up rewards after succeeding. \nIMO the game should offer much more power-ups in the beginning, a way to deflect enemy attacks, and have much less \"impossible\" levels at the very start. \nOtherwise, lovely visuals and the soundtrack... but the gameplay is incredibly annoying, unfortunately.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It’s a good game, especially if you hate yourself- I can’t really say I would reccommend it unless you are fully dedicated to spending your money on something that will make your blood boil hotter than Satans chili and will test your patience more than a fussy toddler in a grocery store. I put the game down because I suck at games like this and I don’t particularly like the feeling of being repeatedly stabbed in the kidneys, then again my opinion may have been different if I used a controller as opposed to a keyboard - That way, I feel like is the definitive way to play this game. \n\nThe graphics are beautiful and the gameplay is smooth, but ultimately, I don’t know if I can reccommend this game or not. It’s VERY dependent on if you are open to stressful gameplay that will push you to your limits.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The bullet time/dash mechanic feels almost broken the way it doesn't give you that much of an advantage when attacking ennemies that can instantly kill you with what appears to be telepathic powers. Also the movement speed will have you spamming the shift key throughout the whole game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "you never go where you want to; the core of this game is platforming but the platforming is just god awful",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Movement is good. Combat is...bad. Yeah that's the word. The combat is really really bad. The game essentially consists of fun but trivial platforming interspaced with frustrating trial & error combat sequences. The distance you need to be to kill an enemy is wildly inconsistent and the enemies can track through walls and instakill you. I’ve seen comparisons to Hotline Miami, but those are off the mark. In Hotline Miami the enemies actually react to the player in intuitive and consistent ways. The enemies in Ghostrunner stand around and are somewhat closer to platforming challenges than real combat. They function almost exactly like enemies in Mario games. I have died and tried the EXACT same thing and have succeeded, so there is extreme inconsistency with the ways enemies respond to you as well. The feeling of not knowing why you died is prevalent and this is very unsatisfying. When I succeed with a combat strategy one encounter and then fail in the next using the same tactics, I start to think that it is not my fault I died, but the fault of the game for having inconsistent mechanics. And that sucks the fun right out of any game. The one boss I faced before uninstalling this trash was named Tom and was a platforming memorization puzzle as if it were 1987. A truly dreadful boss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I  just started , I played 6-7  times and just I regret buying this game . I also purchased the version 2 and at this point I'm evaluating to ask for a refund .  The reason that I'm still playing the very beginning of the introduction again and again and again despite the fact that I have activated all the options to simplify the game  ( extra life, slow down , etc) .  IMHO the \"tutorial\" at the beginning in unclear and there isn't the necessary progression in the increment of  difficulty that is necessary to introduce new players into the mechanics of this game. That makes simply piss me off.  Moreover, it's simply hilarious that I was able to go over some obstacles easily *WITHOUT* the help options . To be clear there is the autosave that doesn't permit to save any progress , so while during the game you will start from the last checkpoint in case of error, if you don't complete the level and you restart the game , you have restart from the very beginning.  So , you fall ? Checkpoint. The game crash or you shut down the game or your PC. You have to restart from the intro. After 7 times I'm simply tired  to restart. The fact that the checkpoint are not saved is pure evil fro the developers, IMHO. And I love this kind of games. They should take example from Portal * the game from Valve) : the game is explained in a well planned progression , clearly but without reducing the fun and the same I can say about the progression of the difficulty of the obstacles. Just my 2 cents.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very frustrating game, played through it mostly to get my money's worth, but I would've been better of not playing it at all. Maybe it's just not for me, but honeslty I did not enjoy it at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "for some reason i get only 15-20 fps, but on epic games im on 120 fps without problem...\nalso on epic games i comleted ghostrunner twice",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game consistently wont grab onto the walls and i will just fall down to my death or when i go to grapple it'll pull me 2 feet then disappear and i fall to my death. It actually makes no sense what so ever",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Cheap enemy placement and horrible game play. I like games that are quick and twitchy. The controls just didn't feel good and this was very unforgiving. Disappointed because i wanted to love this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just get Ghostrunner 2. It resolves the endless issues present in this game and is significantly longer\n\nWallrunning in 1 is busted - You will randomly lose momentum or detach from walls. There's also an arbitrary \"sweet spot\" on walls and your jumps wont be full power unless you hit it. \n\nLedge Grab - Camera required to be facing a specific (but arbitrary) direction/angle to land the grab. You will miss grabs while facing the ledge head-on, making full contact.\n\nIn short, most of your \"failures\" will have nothing to do with you. \n\nLastly, combat isn't really combat. The enemies are more like \"traps\" in this game, which some people might actually prefer-- but if you're expecting enemies that chase/pursue you and have AI, this game does not offer that. The second game does.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like the idea, however the execution is just so frustrating.\r\n- Bullets clipping through your sword texture because you didn't parry 100ms precise enough.\r\n- Enemy aimbot the moment you dash\r\n- Enemy aimbot, automatic reload and homing missiles the moment you use acceleration\r\n- Clipping through textures\r\n- Dying even though you just killed that enemy\r\n- Inconsistent acceleration of bullets.\r\n- Shrödingers bullets. They are either moments before immediately hitting you after firing or observable in slow motion until observed.\r\n- Inconsistent mechanics. The acceleration module being nerfed into the ground with the aimbot+immediate reload+homing bullets+speed boost is hilarious when compared to \"move to left and right to dodge\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\r\n- Good Cyberpunk theme\r\n- Good story\r\n- Relatively fun game play\r\n\r\nCons:\r\n- Inconsistent movement (the movement can send you off the map pretty easy)\r\n- Annoying enemy AI (enemies track you through the wall and shoot you as soon as you come out of the cover)\r\n- The 'easy' mode in this game is called the Assist Mode which gives you one more life and you can only select it via the select level menu which is a weird design choice. You have to start from this menu to have this mode on for the rest of the game.\r\n- The game could've been way more fun if they'd given you an option to set the maximum lives you can have instead of the default one life or the Assist Mode's two lives.\r\n\r\nI expected more from this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shielders, suicide bombers and teleporting twats really aren't a good combination, could've been fun if some enemies were different/completely removed and if the parkour didn't feel a bit whack at times (might've been my skill issue idk)\nWouldn't say it's terrible but God knows I'm not playing this shit again, buy only if on [spoiler]BIG[/spoiler] sale",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The boss fights are infuriating and they aren't tests of skills that you practice in the game.  They are tests of patience.  Most of the rest of the game is great, and if bosses were skippable, i'd highly recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate this game. Its a rhythm game and not like what I expected at all. Game is stupidly desgined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst level designs of games I have ever played - devs did not give a lick of care, which is insanely sad because it had a ton of potential. No surprise considering the studio.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tought it will be more like Cyberpunk, not just jumping like a rabbit with sword",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "way too fast paced to fast, not enjoyable or easy to pick up.  Don't waste your money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great combat, awful parkour and bosses",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downloaded. Played. Fantastic. Keep dying. Quit :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe I'll come back to this game and play it more, but this game is simply inconsistent in platforming/combat and the times where I felt like a bad ass playing it were very short lived and ALWAYS fell flat because of poor mechanics; I don't feel like this is a \"git gud\" game, but more of like a puzzle game where you have figure out how to kill the enemies in the best path that provides the least chance for RNG killing you. \n\nMy first time playing this game I played for about 2 hours, which usually means for me I will continue playing the game. At times I really was having fun and at times I felt like a bad ass; then using the same moves and inputs, I suddenly am getting killed instantly, I'm missing platforms, I'm moving fast and sliding through obstacles to leap off the edge of one and not know where I'm supposed to go, etc.\n\nIt presents itself as very fluid and fast paced and at times both the combat and platforming can feel like that, but the mechanics simply don't work as well as I've seen in other parkour/fast paced games. Wall runs don't center you on the wall (making the next jump either too low or worse you are too high and start climbing on top of a wall you can't even stand on) and jumping between tight corridors often has you grabbing the wrong platform/wall; these very poorly designed mechanics make every fast paced run fall flat EVERY SINGLE TIME.\n\nCombat also seems to be very inconsistent; the core gameplay is basically dying over and over again so you can learn from your mistakes or understand what you need to improve upon. Once you develop a rhythm and understand the placement of the enemies, you will naturally start following the same path to kill them all. Following the exact same path and using the exact same inputs will work like 85% of the time, the other 15% you will die and have no clue what it was that killed you; I have never played a game where the combat seems to be so inconsistent.\n\nThe platforming needs a lot of work despite older parkour games doing a much better job with the exact same mechanics, and the combat simply felt masochistic because of the crappy parkour elements and weird RNG instakills with enemies.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "You gotta first die a 100 times just to get across the level, hell no. Not for me. \nMight be good for player who like exclusively fast-paced action, I guess. However, this feels very limited in initial movement and abilities, especially at the start which should be the part that gets you \"hooked\". Instead it just maker you feel incapable, overall feels lacking and makes the progress incredibly hard with no satisfaction or power-up rewards after succeeding. \nIMO the game should offer much more power-ups in the beginning, a way to deflect enemy attacks, and have much less \"impossible\" levels at the very start. \nOtherwise, lovely visuals and the soundtrack... but the gameplay is incredibly annoying, unfortunately.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At first it feels incredible - visuals, speed, atmosphere. But soon it becomes boring die-restart gameplay. The whole gameplay is just memorizing every step. You are not mastering the game, you are just playing pattern-learning simulator.\n10/10 Design.\n0/10 Fun.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "It’s a good game, especially if you hate yourself- I can’t really say I would reccommend it unless you are fully dedicated to spending your money on something that will make your blood boil hotter than Satans chili and will test your patience more than a fussy toddler in a grocery store. I put the game down because I suck at games like this and I don’t particularly like the feeling of being repeatedly stabbed in the kidneys, then again my opinion may have been different if I used a controller as opposed to a keyboard - That way, I feel like is the definitive way to play this game. \n\nThe graphics are beautiful and the gameplay is smooth, but ultimately, I don’t know if I can reccommend this game or not. It’s VERY dependent on if you are open to stressful gameplay that will push you to your limits.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The bullet time/dash mechanic feels almost broken the way it doesn't give you that much of an advantage when attacking ennemies that can instantly kill you with what appears to be telepathic powers. Also the movement speed will have you spamming the shift key throughout the whole game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "you never go where you want to; the core of this game is platforming but the platforming is just god awful",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gameplay is not very fun. The rest of the game though? Gorgeous. I should be picking this up just for the soundtrack.\nWhat I've played of the game just reminds me of the Always Sunny bit with the sword vs the gun. It takes you just as long to close the distance between you and the enemy, and every dude's got a deadshot level quickdraw.\nFor a game that's all about being fast, a good chunk of it is you being thrown out of the flow once you reach a \"combat\" section and die a dozen times in a die-and-repeat trial and error loop. Even then, you got to rely on your slow-mo bullet time just to be able to dodge enemy shots. \nSadly that's not what I was expecting. I'm sure there's many that'll like it though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Movement is good. Combat is...bad. Yeah that's the word. The combat is really really bad. The game essentially consists of fun but trivial platforming interspaced with frustrating trial & error combat sequences. The distance you need to be to kill an enemy is wildly inconsistent and the enemies can track through walls and instakill you. I’ve seen comparisons to Hotline Miami, but those are off the mark. In Hotline Miami the enemies actually react to the player in intuitive and consistent ways. The enemies in Ghostrunner stand around and are somewhat closer to platforming challenges than real combat. They function almost exactly like enemies in Mario games. I have died and tried the EXACT same thing and have succeeded, so there is extreme inconsistency with the ways enemies respond to you as well. The feeling of not knowing why you died is prevalent and this is very unsatisfying. When I succeed with a combat strategy one encounter and then fail in the next using the same tactics, I start to think that it is not my fault I died, but the fault of the game for having inconsistent mechanics. And that sucks the fun right out of any game. The one boss I faced before uninstalling this trash was named Tom and was a platforming memorization puzzle as if it were 1987. A truly dreadful boss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I  just started , I played 6-7  times and just I regret buying this game . I also purchased the version 2 and at this point I'm evaluating to ask for a refund .  The reason that I'm still playing the very beginning of the introduction again and again and again despite the fact that I have activated all the options to simplify the game  ( extra life, slow down , etc) .  IMHO the \"tutorial\" at the beginning in unclear and there isn't the necessary progression in the increment of  difficulty that is necessary to introduce new players into the mechanics of this game. That makes simply piss me off.  Moreover, it's simply hilarious that I was able to go over some obstacles easily *WITHOUT* the help options . To be clear there is the autosave that doesn't permit to save any progress , so while during the game you will start from the last checkpoint in case of error, if you don't complete the level and you restart the game , you have restart from the very beginning.  So , you fall ? Checkpoint. The game crash or you shut down the game or your PC. You have to restart from the intro. After 7 times I'm simply tired  to restart. The fact that the checkpoint are not saved is pure evil fro the developers, IMHO. And I love this kind of games. They should take example from Portal * the game from Valve) : the game is explained in a well planned progression , clearly but without reducing the fun and the same I can say about the progression of the difficulty of the obstacles. Just my 2 cents.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very frustrating game, played through it mostly to get my money's worth, but I would've been better of not playing it at all. Maybe it's just not for me, but honeslty I did not enjoy it at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "for some reason i get only 15-20 fps, but on epic games im on 120 fps without problem...\nalso on epic games i comleted ghostrunner twice",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game consistently wont grab onto the walls and i will just fall down to my death or when i go to grapple it'll pull me 2 feet then disappear and i fall to my death. It actually makes no sense what so ever",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Cheap enemy placement and horrible game play. I like games that are quick and twitchy. The controls just didn't feel good and this was very unforgiving. Disappointed because i wanted to love this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just get Ghostrunner 2. It resolves the endless issues present in this game and is significantly longer\n\nWallrunning in 1 is busted - You will randomly lose momentum or detach from walls. There's also an arbitrary \"sweet spot\" on walls and your jumps wont be full power unless you hit it. \n\nLedge Grab - Camera required to be facing a specific (but arbitrary) direction/angle to land the grab. You will miss grabs while facing the ledge head-on, making full contact.\n\nIn short, most of your \"failures\" will have nothing to do with you. \n\nLastly, combat isn't really combat. The enemies are more like \"traps\" in this game, which some people might actually prefer-- but if you're expecting enemies that chase/pursue you and have AI, this game does not offer that. The second game does.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like the idea, however the execution is just so frustrating.\r\n- Bullets clipping through your sword texture because you didn't parry 100ms precise enough.\r\n- Enemy aimbot the moment you dash\r\n- Enemy aimbot, automatic reload and homing missiles the moment you use acceleration\r\n- Clipping through textures\r\n- Dying even though you just killed that enemy\r\n- Inconsistent acceleration of bullets.\r\n- Shrödingers bullets. They are either moments before immediately hitting you after firing or observable in slow motion until observed.\r\n- Inconsistent mechanics. The acceleration module being nerfed into the ground with the aimbot+immediate reload+homing bullets+speed boost is hilarious when compared to \"move to left and right to dodge\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\r\n- Good Cyberpunk theme\r\n- Good story\r\n- Relatively fun game play\r\n\r\nCons:\r\n- Inconsistent movement (the movement can send you off the map pretty easy)\r\n- Annoying enemy AI (enemies track you through the wall and shoot you as soon as you come out of the cover)\r\n- The 'easy' mode in this game is called the Assist Mode which gives you one more life and you can only select it via the select level menu which is a weird design choice. You have to start from this menu to have this mode on for the rest of the game.\r\n- The game could've been way more fun if they'd given you an option to set the maximum lives you can have instead of the default one life or the Assist Mode's two lives.\r\n\r\nI expected more from this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shielders, suicide bombers and teleporting twats really aren't a good combination, could've been fun if some enemies were different/completely removed and if the parkour didn't feel a bit whack at times (might've been my skill issue idk)\nWouldn't say it's terrible but God knows I'm not playing this shit again, buy only if on [spoiler]BIG[/spoiler] sale",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The boss fights are infuriating and they aren't tests of skills that you practice in the game.  They are tests of patience.  Most of the rest of the game is great, and if bosses were skippable, i'd highly recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate this game. Its a rhythm game and not like what I expected at all. Game is stupidly desgined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst level designs of games I have ever played - devs did not give a lick of care, which is insanely sad because it had a ton of potential. No surprise considering the studio.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fast paced to fast, not enjoyable or easy to pick up.  Don't waste your money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great combat, awful parkour and bosses",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downloaded. Played. Fantastic. Keep dying. Quit :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe I'll come back to this game and play it more, but this game is simply inconsistent in platforming/combat and the times where I felt like a bad ass playing it were very short lived and ALWAYS fell flat because of poor mechanics; I don't feel like this is a \"git gud\" game, but more of like a puzzle game where you have figure out how to kill the enemies in the best path that provides the least chance for RNG killing you. \n\nMy first time playing this game I played for about 2 hours, which usually means for me I will continue playing the game. At times I really was having fun and at times I felt like a bad ass; then using the same moves and inputs, I suddenly am getting killed instantly, I'm missing platforms, I'm moving fast and sliding through obstacles to leap off the edge of one and not know where I'm supposed to go, etc.\n\nIt presents itself as very fluid and fast paced and at times both the combat and platforming can feel like that, but the mechanics simply don't work as well as I've seen in other parkour/fast paced games. Wall runs don't center you on the wall (making the next jump either too low or worse you are too high and start climbing on top of a wall you can't even stand on) and jumping between tight corridors often has you grabbing the wrong platform/wall; these very poorly designed mechanics make every fast paced run fall flat EVERY SINGLE TIME.\n\nCombat also seems to be very inconsistent; the core gameplay is basically dying over and over again so you can learn from your mistakes or understand what you need to improve upon. Once you develop a rhythm and understand the placement of the enemies, you will naturally start following the same path to kill them all. Following the exact same path and using the exact same inputs will work like 85% of the time, the other 15% you will die and have no clue what it was that killed you; I have never played a game where the combat seems to be so inconsistent.\n\nThe platforming needs a lot of work despite older parkour games doing a much better job with the exact same mechanics, and the combat simply felt masochistic because of the crappy parkour elements and weird RNG instakills with enemies.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "You gotta first die a 100 times just to get across the level, hell no. Not for me. \nMight be good for player who like exclusively fast-paced action, I guess. However, this feels very limited in initial movement and abilities, especially at the start which should be the part that gets you \"hooked\". Instead it just maker you feel incapable, overall feels lacking and makes the progress incredibly hard with no satisfaction or power-up rewards after succeeding. \nIMO the game should offer much more power-ups in the beginning, a way to deflect enemy attacks, and have much less \"impossible\" levels at the very start. \nOtherwise, lovely visuals and the soundtrack... but the gameplay is incredibly annoying, unfortunately.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At first it feels incredible - visuals, speed, atmosphere. But soon it becomes boring die-restart gameplay. The whole gameplay is just memorizing every step. You are not mastering the game, you are just playing pattern-learning simulator.\n10/10 Design.\n0/10 Fun.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "It’s a good game, especially if you hate yourself- I can’t really say I would reccommend it unless you are fully dedicated to spending your money on something that will make your blood boil hotter than Satans chili and will test your patience more than a fussy toddler in a grocery store. I put the game down because I suck at games like this and I don’t particularly like the feeling of being repeatedly stabbed in the kidneys, then again my opinion may have been different if I used a controller as opposed to a keyboard - That way, I feel like is the definitive way to play this game. \n\nThe graphics are beautiful and the gameplay is smooth, but ultimately, I don’t know if I can reccommend this game or not. It’s VERY dependent on if you are open to stressful gameplay that will push you to your limits.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The bullet time/dash mechanic feels almost broken the way it doesn't give you that much of an advantage when attacking ennemies that can instantly kill you with what appears to be telepathic powers. Also the movement speed will have you spamming the shift key throughout the whole game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "you never go where you want to; the core of this game is platforming but the platforming is just god awful",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gameplay is not very fun. The rest of the game though? Gorgeous. I should be picking this up just for the soundtrack.\nWhat I've played of the game just reminds me of the Always Sunny bit with the sword vs the gun. It takes you just as long to close the distance between you and the enemy, and every dude's got a deadshot level quickdraw.\nFor a game that's all about being fast, a good chunk of it is you being thrown out of the flow once you reach a \"combat\" section and die a dozen times in a die-and-repeat trial and error loop. Even then, you got to rely on your slow-mo bullet time just to be able to dodge enemy shots. \nSadly that's not what I was expecting. I'm sure there's many that'll like it though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Movement is good. Combat is...bad. Yeah that's the word. The combat is really really bad. The game essentially consists of fun but trivial platforming interspaced with frustrating trial & error combat sequences. The distance you need to be to kill an enemy is wildly inconsistent and the enemies can track through walls and instakill you. I’ve seen comparisons to Hotline Miami, but those are off the mark. In Hotline Miami the enemies actually react to the player in intuitive and consistent ways. The enemies in Ghostrunner stand around and are somewhat closer to platforming challenges than real combat. They function almost exactly like enemies in Mario games. I have died and tried the EXACT same thing and have succeeded, so there is extreme inconsistency with the ways enemies respond to you as well. The feeling of not knowing why you died is prevalent and this is very unsatisfying. When I succeed with a combat strategy one encounter and then fail in the next using the same tactics, I start to think that it is not my fault I died, but the fault of the game for having inconsistent mechanics. And that sucks the fun right out of any game. The one boss I faced before uninstalling this trash was named Tom and was a platforming memorization puzzle as if it were 1987. A truly dreadful boss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I  just started , I played 6-7  times and just I regret buying this game . I also purchased the version 2 and at this point I'm evaluating to ask for a refund .  The reason that I'm still playing the very beginning of the introduction again and again and again despite the fact that I have activated all the options to simplify the game  ( extra life, slow down , etc) .  IMHO the \"tutorial\" at the beginning in unclear and there isn't the necessary progression in the increment of  difficulty that is necessary to introduce new players into the mechanics of this game. That makes simply piss me off.  Moreover, it's simply hilarious that I was able to go over some obstacles easily *WITHOUT* the help options . To be clear there is the autosave that doesn't permit to save any progress , so while during the game you will start from the last checkpoint in case of error, if you don't complete the level and you restart the game , you have restart from the very beginning.  So , you fall ? Checkpoint. The game crash or you shut down the game or your PC. You have to restart from the intro. After 7 times I'm simply tired  to restart. The fact that the checkpoint are not saved is pure evil fro the developers, IMHO. And I love this kind of games. They should take example from Portal * the game from Valve) : the game is explained in a well planned progression , clearly but without reducing the fun and the same I can say about the progression of the difficulty of the obstacles. Just my 2 cents.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very frustrating game, played through it mostly to get my money's worth, but I would've been better of not playing it at all. Maybe it's just not for me, but honeslty I did not enjoy it at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "for some reason i get only 15-20 fps, but on epic games im on 120 fps without problem...\nalso on epic games i comleted ghostrunner twice",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game consistently wont grab onto the walls and i will just fall down to my death or when i go to grapple it'll pull me 2 feet then disappear and i fall to my death. It actually makes no sense what so ever",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Cheap enemy placement and horrible game play. I like games that are quick and twitchy. The controls just didn't feel good and this was very unforgiving. Disappointed because i wanted to love this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just get Ghostrunner 2. It resolves the endless issues present in this game and is significantly longer\n\nWallrunning in 1 is busted - You will randomly lose momentum or detach from walls. There's also an arbitrary \"sweet spot\" on walls and your jumps wont be full power unless you hit it. \n\nLedge Grab - Camera required to be facing a specific (but arbitrary) direction/angle to land the grab. You will miss grabs while facing the ledge head-on, making full contact.\n\nIn short, most of your \"failures\" will have nothing to do with you. \n\nLastly, combat isn't really combat. The enemies are more like \"traps\" in this game, which some people might actually prefer-- but if you're expecting enemies that chase/pursue you and have AI, this game does not offer that. The second game does.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like the idea, however the execution is just so frustrating.\r\n- Bullets clipping through your sword texture because you didn't parry 100ms precise enough.\r\n- Enemy aimbot the moment you dash\r\n- Enemy aimbot, automatic reload and homing missiles the moment you use acceleration\r\n- Clipping through textures\r\n- Dying even though you just killed that enemy\r\n- Inconsistent acceleration of bullets.\r\n- Shrödingers bullets. They are either moments before immediately hitting you after firing or observable in slow motion until observed.\r\n- Inconsistent mechanics. The acceleration module being nerfed into the ground with the aimbot+immediate reload+homing bullets+speed boost is hilarious when compared to \"move to left and right to dodge\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\r\n- Good Cyberpunk theme\r\n- Good story\r\n- Relatively fun game play\r\n\r\nCons:\r\n- Inconsistent movement (the movement can send you off the map pretty easy)\r\n- Annoying enemy AI (enemies track you through the wall and shoot you as soon as you come out of the cover)\r\n- The 'easy' mode in this game is called the Assist Mode which gives you one more life and you can only select it via the select level menu which is a weird design choice. You have to start from this menu to have this mode on for the rest of the game.\r\n- The game could've been way more fun if they'd given you an option to set the maximum lives you can have instead of the default one life or the Assist Mode's two lives.\r\n\r\nI expected more from this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shielders, suicide bombers and teleporting twats really aren't a good combination, could've been fun if some enemies were different/completely removed and if the parkour didn't feel a bit whack at times (might've been my skill issue idk)\nWouldn't say it's terrible but God knows I'm not playing this shit again, buy only if on [spoiler]BIG[/spoiler] sale",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The boss fights are infuriating and they aren't tests of skills that you practice in the game.  They are tests of patience.  Most of the rest of the game is great, and if bosses were skippable, i'd highly recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate this game. Its a rhythm game and not like what I expected at all. Game is stupidly desgined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst level designs of games I have ever played - devs did not give a lick of care, which is insanely sad because it had a ton of potential. No surprise considering the studio.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fast paced to fast, not enjoyable or easy to pick up.  Don't waste your money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great combat, awful parkour and bosses",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downloaded. Played. Fantastic. Keep dying. Quit :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe I'll come back to this game and play it more, but this game is simply inconsistent in platforming/combat and the times where I felt like a bad ass playing it were very short lived and ALWAYS fell flat because of poor mechanics; I don't feel like this is a \"git gud\" game, but more of like a puzzle game where you have figure out how to kill the enemies in the best path that provides the least chance for RNG killing you. \n\nMy first time playing this game I played for about 2 hours, which usually means for me I will continue playing the game. At times I really was having fun and at times I felt like a bad ass; then using the same moves and inputs, I suddenly am getting killed instantly, I'm missing platforms, I'm moving fast and sliding through obstacles to leap off the edge of one and not know where I'm supposed to go, etc.\n\nIt presents itself as very fluid and fast paced and at times both the combat and platforming can feel like that, but the mechanics simply don't work as well as I've seen in other parkour/fast paced games. Wall runs don't center you on the wall (making the next jump either too low or worse you are too high and start climbing on top of a wall you can't even stand on) and jumping between tight corridors often has you grabbing the wrong platform/wall; these very poorly designed mechanics make every fast paced run fall flat EVERY SINGLE TIME.\n\nCombat also seems to be very inconsistent; the core gameplay is basically dying over and over again so you can learn from your mistakes or understand what you need to improve upon. Once you develop a rhythm and understand the placement of the enemies, you will naturally start following the same path to kill them all. Following the exact same path and using the exact same inputs will work like 85% of the time, the other 15% you will die and have no clue what it was that killed you; I have never played a game where the combat seems to be so inconsistent.\n\nThe platforming needs a lot of work despite older parkour games doing a much better job with the exact same mechanics, and the combat simply felt masochistic because of the crappy parkour elements and weird RNG instakills with enemies.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "You gotta first die a 100 times just to get across the level, hell no. Not for me. \nMight be good for player who like exclusively fast-paced action, I guess. However, this feels very limited in initial movement and abilities, especially at the start which should be the part that gets you \"hooked\". Instead it just maker you feel incapable, overall feels lacking and makes the progress incredibly hard with no satisfaction or power-up rewards after succeeding. \nIMO the game should offer much more power-ups in the beginning, a way to deflect enemy attacks, and have much less \"impossible\" levels at the very start. \nOtherwise, lovely visuals and the soundtrack... but the gameplay is incredibly annoying, unfortunately.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At first it feels incredible - visuals, speed, atmosphere. But soon it becomes boring die-restart gameplay. The whole gameplay is just memorizing every step. You are not mastering the game, you are just playing pattern-learning simulator.\n10/10 Design.\n0/10 Fun.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "It’s a good game, especially if you hate yourself- I can’t really say I would reccommend it unless you are fully dedicated to spending your money on something that will make your blood boil hotter than Satans chili and will test your patience more than a fussy toddler in a grocery store. I put the game down because I suck at games like this and I don’t particularly like the feeling of being repeatedly stabbed in the kidneys, then again my opinion may have been different if I used a controller as opposed to a keyboard - That way, I feel like is the definitive way to play this game. \n\nThe graphics are beautiful and the gameplay is smooth, but ultimately, I don’t know if I can reccommend this game or not. It’s VERY dependent on if you are open to stressful gameplay that will push you to your limits.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The bullet time/dash mechanic feels almost broken the way it doesn't give you that much of an advantage when attacking ennemies that can instantly kill you with what appears to be telepathic powers. Also the movement speed will have you spamming the shift key throughout the whole game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "you never go where you want to; the core of this game is platforming but the platforming is just god awful",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gameplay is not very fun. The rest of the game though? Gorgeous. I should be picking this up just for the soundtrack.\nWhat I've played of the game just reminds me of the Always Sunny bit with the sword vs the gun. It takes you just as long to close the distance between you and the enemy, and every dude's got a deadshot level quickdraw.\nFor a game that's all about being fast, a good chunk of it is you being thrown out of the flow once you reach a \"combat\" section and die a dozen times in a die-and-repeat trial and error loop. Even then, you got to rely on your slow-mo bullet time just to be able to dodge enemy shots. \nSadly that's not what I was expecting. I'm sure there's many that'll like it though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Movement is good. Combat is...bad. Yeah that's the word. The combat is really really bad. The game essentially consists of fun but trivial platforming interspaced with frustrating trial & error combat sequences. The distance you need to be to kill an enemy is wildly inconsistent and the enemies can track through walls and instakill you. I’ve seen comparisons to Hotline Miami, but those are off the mark. In Hotline Miami the enemies actually react to the player in intuitive and consistent ways. The enemies in Ghostrunner stand around and are somewhat closer to platforming challenges than real combat. They function almost exactly like enemies in Mario games. I have died and tried the EXACT same thing and have succeeded, so there is extreme inconsistency with the ways enemies respond to you as well. The feeling of not knowing why you died is prevalent and this is very unsatisfying. When I succeed with a combat strategy one encounter and then fail in the next using the same tactics, I start to think that it is not my fault I died, but the fault of the game for having inconsistent mechanics. And that sucks the fun right out of any game. The one boss I faced before uninstalling this trash was named Tom and was a platforming memorization puzzle as if it were 1987. A truly dreadful boss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I  just started , I played 6-7  times and just I regret buying this game . I also purchased the version 2 and at this point I'm evaluating to ask for a refund .  The reason that I'm still playing the very beginning of the introduction again and again and again despite the fact that I have activated all the options to simplify the game  ( extra life, slow down , etc) .  IMHO the \"tutorial\" at the beginning in unclear and there isn't the necessary progression in the increment of  difficulty that is necessary to introduce new players into the mechanics of this game. That makes simply piss me off.  Moreover, it's simply hilarious that I was able to go over some obstacles easily *WITHOUT* the help options . To be clear there is the autosave that doesn't permit to save any progress , so while during the game you will start from the last checkpoint in case of error, if you don't complete the level and you restart the game , you have restart from the very beginning.  So , you fall ? Checkpoint. The game crash or you shut down the game or your PC. You have to restart from the intro. After 7 times I'm simply tired  to restart. The fact that the checkpoint are not saved is pure evil fro the developers, IMHO. And I love this kind of games. They should take example from Portal * the game from Valve) : the game is explained in a well planned progression , clearly but without reducing the fun and the same I can say about the progression of the difficulty of the obstacles. Just my 2 cents.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very frustrating game, played through it mostly to get my money's worth, but I would've been better of not playing it at all. Maybe it's just not for me, but honeslty I did not enjoy it at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "for some reason i get only 15-20 fps, but on epic games im on 120 fps without problem...\nalso on epic games i comleted ghostrunner twice",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game consistently wont grab onto the walls and i will just fall down to my death or when i go to grapple it'll pull me 2 feet then disappear and i fall to my death. It actually makes no sense what so ever",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Cheap enemy placement and horrible game play. I like games that are quick and twitchy. The controls just didn't feel good and this was very unforgiving. Disappointed because i wanted to love this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just get Ghostrunner 2. It resolves the endless issues present in this game and is significantly longer\n\nWallrunning in 1 is busted - You will randomly lose momentum or detach from walls. There's also an arbitrary \"sweet spot\" on walls and your jumps wont be full power unless you hit it. \n\nLedge Grab - Camera required to be facing a specific (but arbitrary) direction/angle to land the grab. You will miss grabs while facing the ledge head-on, making full contact.\n\nIn short, most of your \"failures\" will have nothing to do with you. \n\nLastly, combat isn't really combat. The enemies are more like \"traps\" in this game, which some people might actually prefer-- but if you're expecting enemies that chase/pursue you and have AI, this game does not offer that. The second game does.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like the idea, however the execution is just so frustrating.\r\n- Bullets clipping through your sword texture because you didn't parry 100ms precise enough.\r\n- Enemy aimbot the moment you dash\r\n- Enemy aimbot, automatic reload and homing missiles the moment you use acceleration\r\n- Clipping through textures\r\n- Dying even though you just killed that enemy\r\n- Inconsistent acceleration of bullets.\r\n- Shrödingers bullets. They are either moments before immediately hitting you after firing or observable in slow motion until observed.\r\n- Inconsistent mechanics. The acceleration module being nerfed into the ground with the aimbot+immediate reload+homing bullets+speed boost is hilarious when compared to \"move to left and right to dodge\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\r\n- Good Cyberpunk theme\r\n- Good story\r\n- Relatively fun game play\r\n\r\nCons:\r\n- Inconsistent movement (the movement can send you off the map pretty easy)\r\n- Annoying enemy AI (enemies track you through the wall and shoot you as soon as you come out of the cover)\r\n- The 'easy' mode in this game is called the Assist Mode which gives you one more life and you can only select it via the select level menu which is a weird design choice. You have to start from this menu to have this mode on for the rest of the game.\r\n- The game could've been way more fun if they'd given you an option to set the maximum lives you can have instead of the default one life or the Assist Mode's two lives.\r\n\r\nI expected more from this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shielders, suicide bombers and teleporting twats really aren't a good combination, could've been fun if some enemies were different/completely removed and if the parkour didn't feel a bit whack at times (might've been my skill issue idk)\nWouldn't say it's terrible but God knows I'm not playing this shit again, buy only if on [spoiler]BIG[/spoiler] sale",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The boss fights are infuriating and they aren't tests of skills that you practice in the game.  They are tests of patience.  Most of the rest of the game is great, and if bosses were skippable, i'd highly recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate this game. Its a rhythm game and not like what I expected at all. Game is stupidly desgined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst level designs of games I have ever played - devs did not give a lick of care, which is insanely sad because it had a ton of potential. No surprise considering the studio.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fast paced to fast, not enjoyable or easy to pick up.  Don't waste your money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great combat, awful parkour and bosses",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downloaded. Played. Fantastic. Keep dying. Quit :)",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}