{
  "positive": [
    {
      "review": "good game you get to kill child predators and terrorists 10/10",
      "voted_up": true,
      "votes_helpful": 338
    },
    {
      "review": "pretty good game - phenomenal level design and exceptional gunplay\r\n\r\nonly major downside is that its too hell-bent on completing objectives (when it doesn't make sense immersion-wise or gameplay-wise, like when you complete everything, defuse all the bombs, kill everyone, and you still need to find an unconscious suspect or hiding civilian to cuff up) which ends up causing a 10 minute perfect mission into a 30 minute wild goose chase.",
      "voted_up": true,
      "votes_helpful": 105
    },
    {
      "review": "goes to work gets scared by a gunshot shoots a man\r\n1 offcer dead\r\n2 civs dead\r\n1 suspect dead\r\ngets fired from the swat\r\ngoes home\r\nplays ready or not",
      "voted_up": true,
      "votes_helpful": 157
    },
    {
      "review": "The shooting mechanics are pretty good, though I have noticed there's a substantially larger amount of ways to create \"orphans and widows\" vs ways to take people alive and attempt to de-escalate situations. I'm not opposed to such gameplay - i.e. using cuffed civilians as ad-hoc battering rams, nondescript bad guys as godless heathens obstructing the path of my bullets, and 9mm pistols as less-lethal substitutes for taking in Quadamah alive - albeit in the most pain he's ever experienced in his split-life as a pizza delivery driver and leader of a terrorist cell.\n\nWith the DLC shifting more towards general counter-terrorism, and a lack of consequence for escalating tf out of any situation that the higher ups mistakenly deploy you and your mentally unstable goons to, the multiplayer can sometimes play closer to Insurgency coop with an arrest mechanic rather than a SWAT 4 successor. Unless you're going for S rank, which you really only need to do once to get anything significant out of it. \n\nLess-lethal and de-escalation is always an option, albeit one that is slower and in multiplayer, not really worth following through when the morale mechanic is absent. And even in SP, you can theoretically just replace your psychologically dysfunctional minions with an identically-skilled set of minions. I still prefer less-lethal regardless, because the gameplay is more engaging to me and there's been a lot of care put there. But asides from not giving my guys a mental breakdown, there isn't too much stopping me from shooting everybody and calling it a day, except for maybe yelling for compliance first.\n\nCensorship is unfortunate. The fact that they were so quick to fold has me wonder initially how genuine they were being with the more extreme elements of their environmental story-telling. If you're selling me junk food, just tell me - I know what I'm in for.\n\n I will say- despite all that, there's still a good amount of authentic story-telling with these levels, and I'll always be vouching for that vision void are going for. I can also see how recreating SWAT 4's ROE and forcing the player to only go less-lethal, punishing them for not following through with a mandate of giving the suspect several hugs and words of affirmation before deciding to end their existence might translate to uniquely intense gameplay in sparing moments, but a 1:1 system would have you failing an entire mission if you make a single mistake - which can end up being more repetitive and frustrating for general audiences.\n\nHope to see more morally grey situations like \"ends of the earth\" where you have both a story and gameplay incentive (even if the latter is still very weak at this point) to not blast the ever-loving God out of each suspect that looks at you funny (uncuffed suspects included).",
      "voted_up": true,
      "votes_helpful": 51
    },
    {
      "review": "this game is fun i love shooting a innocent person in the face after they scared me",
      "voted_up": true,
      "votes_helpful": 70
    },
    {
      "review": "good game. AI can be dumb sometimes but generally not bad",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Ready or Not is one of the most intense and immersive tactical shooters imo. It nails the feeling of methodical, high-stakes room clearing in a way few games manage. Every mission demands patience, communication, and actual strategy-rush in, and the game will happily punish you for it.\n\nThe gunplay is weighty and grounded, suspect AI is unpredictable enough to keep you on edge, and the level design does a great job of making each entry feel tense. When things go right, it feels incredibly satisfying; when things go wrong, they go very wrong, and usually fast.\n\nThere’s a strong variety of scenarios, gear choices that actually matter, and regular updates that keep the experience fresh. Playing solo is intense but viable, though the game really shines with a coordinated group - this is a title that rewards teamwork as much as aim.\n\nIt’s not perfect. The difficulty can feel punishing to new players, AI teammates are functional but not always reliable, and performance can dip on certain maps. But despite the rough edges, the core gameplay loop is absolutely solid.\n\nIf you’re looking for a serious tactical shooter with an emphasis on planning, realism, and high tension, Ready or Not is one of the best out there.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Yeah it might be a good game, but I can’t really say that anymore cuz I was hyped for it for days and finally got it… and now that I’m playing it, it’s not what I expected. You can play solo with AI teammates, but half the time one of them gets stuck somewhere and when they not all together they don’t even listen to your commands. So you gotta keep making sure all 4 of them are behind you, counting them like a teacher on a school trip XD. It’s basically just a police simulator… go in, catch suspects, save civilians, finish the objective, and that’s it. And tbh paying this much for it is kinda wild, it should be way cheaper than the actual price...",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "* Has a good balance between authenticity and playability. It never collapses under the weight of hyper-realism, yet it never drifts into arcade territory either. It is a tactical shooter that feels grounded, and deliberate; without sacrificing the satisfaction of smooth gameplay.\n* Recent updates have significantly elevated the game’s mechanics and gunplay.\n* Investing more into enemy and civilian AI could push the experience toward excellence. The small quirks and inconsistencies in bot behavior may pull players out of the moment.\n\n- Considering the rise of extraction shooters inspired by that genre (like ARC Raiders, or Escape From Tarkov), one can’t help but imagine what could be built if this game served as a foundation for a larger, more systemic project. An extraction-style survival shooter game featuring persistent loot, an inventory system, and player-driven trading could be incredible with Ready or Not's mechanics at its core. \n\nIt feels like the next major trend is taking shape. And Ready or Not's tactical, realistic foundation make it one of the most promising candidates, should the developers ever decide to expand in that direction.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The tactical SWAT game Ready or Not is somewhat reminiscent of Rainbow Six 3, where tactical maneuvers are key to achieving your objective.\n\nWith good tactics and teamwork, you can navigate the maps fairly easily, but the S+ rank is only attainable if you avoid injuring enemies, which can be quite challenging at times.\n\nThe lack of a Workshop and new maps unfortunately makes the game repetitive after 15-20 hours, as you've completed all the maps. Replay value is rather limited. However, the existing maps are well-designed.\n\nThere are no official servers, so as the host, you have to wait for others to join the lobby, and it can take a while before the match actually starts. Naturally, you only play on the highest difficulty, Hard; anything else is pointless. Sometimes things go very smoothly, and you breeze through, while other times your teammates are killed by the first few enemies or caught off guard—it's all down to luck. There's usually no real coordination via voice chat; most of the time, players just charge in like Rambo (Leeroy Jeenkins style) and die.\n\nIf you just want to leisurely stroll through the maps and arrest or simply blast armed enemies, this game is perfect for you.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "More thoughtful than a lot of FPS games, each combat encounter is like a puzzle with multiple tools at your disposal.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "If you can get this for 20 or even 25$ hell even 30$ it is worth it, for those who love SWAT and Rainbow early instalments and love methodical room clearing and tactical strategy this is for you, especially if you love a good challenge would recommend for those interested in police sims, mil sims, and FPS, or strategy games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The official VR mod for this is jank af but still playable. \r\n\r\n1) You have to use the desktop for most menus. When the game has started, press 'U' to enter VR.\r\n\r\n2) If you use the respawn mod, press 'Home' before pressing 'U' after you die, otherwise you will be floating 10 feet above your character's head.\r\n\r\n3) A lot of guns don't have proper reloading/chambering. Like the G3 you can manually reload but you can't chamber it so it fires without being chambered, the P90 can't be reloaded so it just fires without a magazine. You'll have to figure these things out on a gun-by-gun basis.\r\n\r\n4) Throwing nades is a nightmare in VR. They almost always fall at your feet.\r\n\r\n5) Having the orders on click right stick is dumb. I'm trying to keep a bead on the suspect while shouting orders and my aim keeps shifting because I have to click the right stick.\r\n\r\n6) Your avatar doesn't follow your headset 100% exactly, it sort of lags behind a little bit, which means you can't always grab things from your weapon/ammo slots without looking. Sometimes they aren't aligned the way you expect them to be.\r\n\r\nThere are some other issues but those are the main ones. I'd give this a neutral rating, if I could. Overall, it's fun when it works but super, super jank. If you're getting it for VR, make sure you grab it on sale and thoroughly test it before your 2 hour/15 day refund window is up because you might find it unplayable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ever since the console Update the game felt really off and weird, and it's not because of the censorship update but its because of the way that models rendered and the downgrade of graphics. I purchased this game like 2 or 3 weeks before the update and it was really good to play. \n\nIt still is good but after I tried what was once a beautiful AAA game to play to a game that makes me feel like im playing a not even on the AAA list.\n\nGame is more fun with mods\n\nOtherwise, great story telling, enviroment feeling and it also reflects on the brutal lives of SWAT officers that we don't see.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very much a tense but enjoyable tactical shooter offering a unique, authentic experience! I enjoyed this a bunch over the 50 so hours I’ve played, with most of those hours played with the AI. While the AI isn’t perfect all the time, it gets the job done fairly well. Multiplayer is fun, especially with friends and the voice chat. Only complaint is the lack of replayability (other than S-ranking missions, that’s a PAIN) but still a fun shooter experience nonetheless.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ready or Not Review — 9/10 (Tactical Chaos at Its Finest)\n\nReady or Not is the kind of tactical shooter that makes your palms sweat, your heart pound, and your squad yell “DON’T OPEN THAT DOOR—WAIT—FLASHBANG—NOOOO!” right before everything explodes into total disaster. And honestly? It’s incredible.\n\nThis game nails tension like almost nothing else in the genre. You’re leading an elite SWAT team through high-risk missions where every decision matters. One wrong move and the whole operation falls apart. One perfect breach, and you feel like a tactical genius straight out of a Hollywood thriller.\n\nThe gunplay is heavy and realistic—firing a weapon feels powerful and dangerous, forcing you to think before pulling the trigger. Hostage encounters are nerve-wracking, suspects are unpredictable, and the atmosphere is so intense that even opening a closet feels like defusing a bomb.\n\nBut the real magic happens in co-op. Planning room entries, stacking on doors, calling out suspects, accidentally flashbanging your own squad—it’s serious, but it’s also hilariously unforgettable. Every mission becomes a story worth retelling.\n\nThe maps are detailed and immersive, ranging from cramped apartments to massive public spaces, and the game constantly pushes you to adapt and communicate. It rewards patience and teamwork instead of running-and-gunning.\n\nIs it perfect? Not quite. AI can be weird sometimes, there are occasional bugs, and the steep learning curve might scare off casual players. But when Ready or Not is in full motion, it delivers some of the most intense and satisfying tactical gameplay you can find today.\n\nPros\n\nUltra-tense tactical gameplay with realistic gun handling\n\nDeep teamwork and communication focus\n\nAmazing atmosphere and detailed environments\n\nMissions that always feel dangerous and unpredictable\n\nCons\n\nCan be brutally difficult for new players\n\nOccasional bugs and AI oddities\n\nVerdict:\nA heart-pounding, tactical masterpiece that turns every mission into a cinematic, stressful, unforgettable experience. If you love strategy, teamwork, and realism, this game is a must-play.\n\nScore: 9/10 — Prepare to stack up, breach, and pray.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The new VR mod for this game takes it to new heights. Base game is fantastic but mod support is phenomenal",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good gameplay, beautiful visuals, dark, realistic themes, familiar command system to give orders.\nVeterans from old Rainbow Six games and SWAT 4 must try it ASAP, good challenge! 👍\nGo lone wolf or with friends/bots, the choice is yours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It feels very realistic, but when you play like 30-40 hours of it you'll start to notice the lack of replayability/maps. There are some good maps on other sites. Really recommend to get a 2-4 player squad for this",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly it’s the most invested I’ve been in a shooter in a long time. I really enjoy how replay-able the missions are and how slow paced / realistic it feels compared to other fps games. It’s perfect i definitely feel like I got my $50 worth of enjoyment out of it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[i] \"Maybe you've finally brought justice to true evil within the city: once and for all. But let's be honest.. you haven't changed a thing.\" [/i]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like this game but I don't think the DLC is really worth the price. overall though, pretty fun time!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "when the game worked i would say its a fun game to play now the game has just stopped loading up for me so now its useless to me",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game, Achievements were very fun and challenging (NOT IMPOSSIBLE) like what some people on youtube try to get you to believe because they're bad at the game, i started going for 100% achievements at 25 hours in and completed at 99 so its a fun game to grind if you don't have much else to be at. Good variety and selection in gear as-well as customization, the tazer is alot more useful than people lead you to believe, this is only cause they try to use it at 5+ meters and than complain its not a sniper rifle. My only complaint is squad AI being confused when it comes it issuing commands later in the mission because they'll be fine but after 20-30 minutes something will snap and all or one select officer will just freeze and ignore commands and follow previously issued ones, or just refuse to change a pathing direction when stacking on a door or have no idea where to look in search and secure and look down a hallway when it says \"Securing Evidence\" or \"Prepping for restraint\" which means i have to search valley of dolls for an extra 15 mins to find one piece of evidence which is a bit agitating. Overall good game just needs some QOL and its a 10/10 for a casual tac shooter. PS Stingers OP IDC what anyone else says.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The singleplayer is about saving lives and arresting criminals, the multiplayer is about killing civilians.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not much to say here. The spiritual successor with modern graphics SWAT franchise never got. Dev team keeps addressing issues as they come. My only issue I found so far was that the AI sometimes has to be ordered twice to execute your orders but that is a rare bug. I also like how dynamic the game is. Even if you play a mission a million times all elements are always changing making some runs go S and others lower simply because the enemy AI gave you no choice but to shoot them. More updates are promised so the game still has potential. Crossplay is a thing here as well (check your settings, it will be disabled by default). Overall recommend this game. The game also has mod support",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The politics and message of this game are horrendous and fundamentally evil, but it is basically the best tactical cqb-style shooter out there, in my opinion. Doesn't have the jank of other options, it's fairly challenging, and it looks good enough to be immersive.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Great game. People hated on this game because of the censorship but I don't care. Some missions are pretty dark like \"valley of the dolls\" or \"hide and seek\". Only downsides of this game are mediocre AI officers and you can get jumpscared by armed suspects. You can install mods, which can make the gameplay more fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really indepth and challenging game, not what I normally play but I still enjoy it and highly recommend",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game only hindered by the friendly AI. Needs a whole lot of improvement when responding to threats at range. Terrible reaction times and horrible spacial awareness. They will watch you die, run half away across the map, circle back and then die to the same suspect. The modding community is fantastic and allows a lot of variation in gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I've ever played next to RDR2. No real story but great gameplay. love trying to master it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ready or Not is one of the most immersive tactical shooters I’ve played. Even with the graphics and content toned down, the atmosphere is intense, the gunplay feels weighty, and every mission keeps me on edge. It nails the tension of close-quarters encounters and the satisfaction of executing a clean breach.\n\nThat said, I do have one big wish: I’d love the option to play as a team member within the AI squad instead of always being the leader. Having to constantly control the AI can get frustrating, especially when I just want to focus on the action. For a better challenge, I often leave them at the starting point and go in solo — which is thrilling, but not exactly how the game is meant to be played.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It is a very complex but fun game. I understand and preferred a unfiltered swat perspective as it made me play the game differently as I felt like these were not fictional events but a real experience. The guns and different equipment  allows for the game to be played to your specific playstyle. I wish there were more missions as once you have completed them all the game becomes boring, though this is in contrast if you play with a friend as then it has huge replayability as a co-op/multiplayer swat game but not much replayability as a singleplayer game. I thoroughly enjoyed it 9/10\n\nI am adding this part as my friend bought the game and we play it 3 times every week, as I stated it is a game where you can only have fun with friends I was correct I have had some of the most fun playing together and have had some fun on missons I despise as me and my friend enjoy challenging ourselfs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite the game's criticisms, it's still a good modernized version of SWAT 4.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game.\r\n\r\n> I boot up game for first time and join my friends lobby\r\n> he makes me go on a university map and convices me their all deep state agents trying to kill us\r\n> commit genocide\r\n> only realise my friend is the real bad guy after the population is atomized\r\n> i kill him\r\n\r\nbest fps oat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing graphics, great content and story lines. I personally prefer to play with friends, single player can be great aswell though.\r\nIt also helps you improve a little both as a leader and as a team member.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i would really recommend this game for its hard but not too hard puzzles. it is very realistic and really fun to play. it is so cool that every level has its own backstory. i recommend not giving up in a hard level. me myself took a brake of the game for a week and passed the hard level what i was stuck in. i think this game was easily worth the money. and you learn more how to play it on the way to next and harder missions. i love the customisabity of the guns and the character. it also has a good tutorial. the ai in this game is so advanced that i reeeaaly love to give commands to the ai team mates. there are so many gadgets and everything even areas in the police station to unlock that i would want them all bu i have to beat my records and myself for them. and last but not least a very good game. if i was you and like swat action and fps i would defenetley buy this.[:",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Alot of fun;\nExcellent gun play, and some basic customisation.\n\nSome maps are quite labyrinthine, but no major complaints.\n\nA good number of maps, and good cooperative whe singleplayer gameplay.\n\nGood control of AI compagnions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is full of bugs, the AI often feels unfair and the visuals tend to hurt your eyes, but if you can look past all of that, the game can be quite fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Since the last few updates this game have become really fun to play, runs good and not to difficult on normal. Would recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GET DOWN ON THE FLOOR RIGHT NOW! GET DOWN ON THE FLOOR RIGHT NOW! GET DOWN ON THE FLOOR RIGHT NOW! GET DOWN ON THE FLOOR RIGHT NOW! GET DOWN ON THE FLOOR RIGHT NOW! (its a great game)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First time I played through it the AI were cracked out spec ops shooting me through 50 feet of concrete, now that they've been nerfed to be more realistic I'm able to fully enjoy the game. Peak.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty nice game overall, I like it even though they did all of that console stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well i've got lots of death but there's so many guns fire arms just the best game in steam.I fucking love this game best S.W.A.T. game on steam go check it out i recommend it for you might be a bit scared but not always",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazingly fun game to play with friends. This game is a perfect mix of being hilarious and inviting chaos while also giving us the opportunity to play seriously and still being immensely fun. The game changes constantly, it can be a tactical shooter with high stakes and trembling hands and then switch to a comedy skit, the only thing that never changes is my love for the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game's immersive experience and realism is amazing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If it wasnt for all the 2 minute moans out of every suspect i shot, i wouldve dropped this game like it was hot.  10/10 would moan again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun gameplay, especially with friends while fooling around or playing serious!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game. Super fun and addicting. Just wish you could run short distances to get to cover when being shot at. Realistically SWAT members can run while in full gear so for that action to not be in the game is a little disappointing to be honest. Other than that, great mechanics and great team interaction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] One of the best tactical shooters. [/h1]\n\nGameplay is pretty realistic and difficulty is good.\n\nMissions are meant to be played at slower pace especially at higher difficulties.  \n\nThere quite lot of missions and mods once you finish the main ones.\n\nHowever some mods do not work and I just play on safe mode now. \n\nSome improvements I can suggest are: \nNon lethal weapons suck so improve those, \nSome enemies have aim bot in hard mode. \nAlso most enemies do not surrender unlike real life.\nMaybe increase squad size and some more AI commands so the AI teammates do not just die in stupid ways.\n\nOverall 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty immersive and lots of replayablity to each mission.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, interesting and fun but scary if your doing something alone away from your team. the one problem is that its expensive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic game, ive spent hours grinding out the achievements and i love ts so much, greatest shooter ive played in my entire life!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game, shot a man, got told to hold my fire, immeaditely die to suicide bomber",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game. Played this on shrooms and I literally felt like I was in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an amazing tactical shooter. The detail and the way the NPC interaction is great makes every level feel really intense. It gets things right that other games don't.\r\n\r\nI play the Commander single player mode a lot and also have a blast playing with friends. It works really well both ways.\r\n\r\nStuff That Needs Work:\r\nThe squad AI is the main issue. They are kinda dumb sometimes.\r\n\r\nYou need some better commander control of squad members. They should be able to look after themselves more (be more self sufficient alone) so you don't have to babysit them.\r\n\r\nAlso, they should really add the ability to control and command a squad NPC through their bodycam visual. That would make running two teams so much easier from the commander's perspective.\r\n\r\nOverall: Highly recommend it. It's easily one of the best tactical games out right now, just needs a little work on the AI for solo play and some commander control and interface reworks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will make or break friendships especially with for communication. It's a fun game, especially trying to grind to get the best score on a level. But it get's pretty boring once you get through all of the level's. It's a game I'd come back to when I can when there are new map's, other than that, it'll likely sit in my library until that happens.\n\nThe gunplay is good, and the game is immersive and realistic.\n\n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super buggy but still fun to play with friends casually.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really nice game with many ways to deal with phases but de NPC are so fkg hard. You show just 1 centimeter and if he's looking at your direction? BANG. Dead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll post a longer review later, but the biggest complaint I'm seeing is that reddit neckbeards are mad that they took Censored CP in the game - you F****** reddit neckbeard troglodyte -people like you really are a stain on the gamin community, you just complain for the sake of complaining",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game. very realistic, you can spend 5 hours on one level just to walk through a door and blow up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite being an FPS, this game has exactly one thing in common with undertale...\nbeing a pacifist is not only an option, but encouraged.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If it wasnt glitchy and buggy it would be the best most realistic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best tactical shooters ive played in sense of replayibility DLC content and just in general fun\\atmosphere and am still exploring many aspects of ready or not (clear dorms in 5 mins or less acheivement can burn in hell} and cant wait to see whats next for the future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, it pulled back a little and people are upset about that, but it's still a masterpiece. \nAfter playing for a couple of days, it really made me think a lot. The crime scenes hit hard, especially knowing these things do happen here and there. In every encounters, I’ve never felt this kind of nervousness before in a video game. \nIf you like FPS games, I’d say this is a must-play. \nBy the way, I’m now thinking about how to get into every room without getting shot in the back in real life—F-ing terrifying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think that if you like the hitman series you will love this too, it is just as calculated and the enemy spawns and behavior will change for everytime you play it is just that compared to hitman you must be even more intensive comparing both of their hard modes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic tactical shooter game with decent mod support but I'd advise to NEVER buy it at full price. The game is woefully unfinished and there are just soo many issues, mostly minor but they are frequent enough to be infuriating. It's a fun game otherwise, and I hope the devs actually do something about the bugs, censorship, and expand on the gun and attachment system in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This entertaining tactical shooter shines with a large number of atmospheric maps that differ greatly in appearance and also offer variety in terms of gameplay. The gunplay is strong, and the \"commander mode\" in particular is pleasantly challenging. The detailed customisable operator skins definitely satisfy my combat aesthetic fetish.\n\nAs has often been mentioned here, both the enemy and teammate AI, although generally satisfactory, unfortunately have their share of slapstick moments. For example, it's super annoying that your mates often block doors or turn their backs on shooting enemies. \n\nI'm also not a fan of the fact that, in order to get an S rating, terrorists who have just shot hundreds of civilians in a nightclub and then point their weapons at me have to be arrested. For a shooter that claims to be realistic, this is somehow strange (or are the developers unaware of the bodycam footage in which police officers empty their entire magazine into people because they are walking towards them with a knife?).\n\nAll in all, it's still a very good game. Would buy again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Prolly the best tactical shooter ever, definitely need some patience because this game is very slow paced. Missions go from easy to hard and you get absolutely punished for any mistakes. Also, Fuck Greased Palms, all my homies hate Greased Palms",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great military/Police game buy it if u got the 40 or wait until a sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it, its pretty fun but what's not fun is accidently kicking a door open and there is a trap and I end up killing myself and my squad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "me boom boom the bad people and want to join a real swat team, 10/10 immersive, fun, replayable, even better with friends but still flourishes in solo with ai units, the ai is smart and does exactly what you want them to once you learn your callouts and commands. bunch of customizations for not only appearance but for you and your teams entire loadout. if they could add the censored content back into the game pre console launch it would be 100/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game alone or with friends but it's much better with friends. It's kinda like minecraft where you forget about it for a year then go hard for a few days. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun tho i wish you could S rank without needing to arrest all suspects but it runs well on my hardware so 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very taut and realistic shooter which puts you in the shoes of a SWAT team aiming to defuse an active situation. The shootouts are tense and the enemy placements are difficult to spot. Some gameplay tends to get a bit repetitive. An overarching story arc with strong characters and back stories would have been a positive addition. But overall, it is definitely a game to look out for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, This is just a Fun game. While you won't see features like the ability to Sprint.. Or be forced to do some pretty tough missions in Commander Mode... It's overall really Fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "playing a game where you can either be the law or go against it is so much fun. i just bleew off a hostages head",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great game to play with friend , communicating , trolling, or just try to kill each other by not trying to",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the game for its gameplay, which creates a challenging and thrilling atmosphere, even though sometimes the NPCs in the game behave strangely, such as having agressive shooting accuracy or being very difficult to secure when pressing F.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been wanting to experience doing this when i grow up joining a swat team, but now when i think back, i rather not die getting shot in the head. Best game to play with your friends or alone anytime you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RoN feels brutally real. Every corner is tense, every mistake costs you, and that’s exactly what makes it so satisfying. It’s not about running and gunning - it’s about slowing down, thinking, and working as a team. The difficulty is tough but fair, and when you finally clear a mission, it feels earned. On top of that, the game looks great and the atmosphere is spot‑on. If you want something immersive, challenging, and honest in its design, this is 100% it. 10\\10, truly labor of love ❤️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is not casual. If you want fast-paced run-and-gun gameplay, this isn’t it.\r\nSome missions can feel overwhelming or punishing.\r\nAI sometimes behaves oddly, though much improved over time.\r\nNot every weapon feels perfectly balanced (shotguns especially).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A seriously great and immersive SWAT simulator. It makes you fell the severity of the situation, with unparalleled realism. It´s not a horror game; but it can still be pretty scary. Fearing for you´re life. But also the life of you´re fellow squadmates, and civillians. A great game overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best tactical shooter. Taking time and communication is key. They are a bit slow on new development.\nWould be fun to see them create something like MW2 Co-op missions but with RoN tactics and weapons etc etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game best game i played this year with my fellow lads zayed abdeljaleel and yas ahmed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with realistic feel still has minor bugs but overall works very well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very enjoyable game especially with friends i like how its enjoyable even when u lose for hours at a time (sounds very sarcastic but im not its VERY fun losing or winning)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely amazing game, definitely recommend people to play RoN if you want a realistic and immersive counter-terrorism game. It only gets better if played with mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of , if not , the best PvE experiences for a tactical shooter.\r\nshocking, violent, and loud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have enjoyed my time playing RoN. AI is in a decent spot compared to earlier days, both the Swat and the suspects. S ranks are challenging, but not impossible. New updates with the new rail system and LVPO and magnifiers look promising. Not a game I play as often these days but is a game I always enjoy coming back to, especially with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game really brought out my inner terrorist, last week bought my first gun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice and challenging fps game fr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4/5 * It crashes alot and takes a while to boot modless. I feel like modding needs to be more user friendly aswell. every other aspect of this game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New update broke the game's loading screens but fun game overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun for anyone that wants a challenge, likes tactical or non-tactical FPS, likes police and swat stuff, or if you like SWAT 4 or any other swat game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of best FPS, very intimate, very tactical and better play with friends. I'm ready, are you?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game.\r\nWhere SWAT4 stopped these developers went further and succeded.\r\n\r\nMust have",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is amazing, its everything that i have asked for in a tactical shooter game. It isn't pvp (which i never understood why other tactical shooter fps games try to do), However the game is increadibly dark, people will say the game was censored more however the game looks and feels the exact same.\r\n\r\nThere are some problems with replayability, the game doesnt have a lot more in there other than missions, maybe you could try more mods and modded levels but they aren't fun and a lot of cut content that could've fixed this issue are really present (video link is below)\r\n\r\nhttps://www.youtube.com/watch?v=FBI_NprbSYA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the best shooters I have played in like ever. The game explores what real officers of any police force has go through. The game is very grounded and gritty, especially with the VRO mod, oh its such fun in vr and flat screen, I highly recommend this game to any one who enjoys grounded shooters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, gun physics, blood, gore, story, and graphics; only bad thing, the gigabytes :(",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "sold out to big tech to make it pg for other platforms and broke there promise of realism and freedom of creativity to the player base. down graded the graphics and enforced cencorship they promised not to.",
      "voted_up": false,
      "votes_helpful": 696
    },
    {
      "review": "Game punishes you for eliminating active shooters and friendly AI lacks the intelligence for basic continuance of their life. Don't worry though, if you kill enough gangbangers your bot squad will put you down with better effort than that they put into actually stopping the criminals.",
      "voted_up": false,
      "votes_helpful": 150
    },
    {
      "review": "Spineless devs, downgrading graphics and introducing censorship so they can release an 18+ game on consoles.",
      "voted_up": false,
      "votes_helpful": 160
    },
    {
      "review": "Great Game but........ The AI, even on standard mode, will shoot you right through walls, aim bot you from across the map and kill you instantly. You can also only S rank using non lethal. I get it, but it puts you at such a disadvantage it makes it nearly impossible to do, even at standard difficulty. Using non-lethal, some AI just brush it off and shoot you. This game makes AI goons off the street, look like ex navy seals. The animations are slow and will get you killed, but when an enemy is doing one they are invincible. The AI makes this game frustrating. Just tone the AI down and the game would be great. \n\nThe good side, the maps are fun and have a lot of variety. Overall its fun. If you want to beat it in S rank good luck, you'll be raging like a 9 year old playing Fortnite. The more you play each level back to back, the AI goons will move around and makes it more difficult to clear the maps, or your SWAT AI will randomly start clearing an area and get killed, or they get stuck and won't do anything.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Censorship to satisfy Sonch just making this game generic and boring. Make it toggleable on PC",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "The implementation of epic games services for the online play makes this game unplayable, I have not been able to finish a single mission since they updated their servers because im \"unable to connect to the epic games services\" 20 minutes into a map. This is incompetence at best and sabotage at worst",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "With every update the ai gets worse and worse especially in the hard mode where every suspect becomes john rambo which i wouldnt be complaining about if my teams ai actually worked instead of freezing up everytime I expect them to do something, a few months ago I really enjoyed the game, sure, there was a bug or 2 every once in a while but that wasnt game braking and experience destroying but now the only way to beat some missions in commander mode is by taking all the john rambo suspects by yourself which is impossible if more than 4 spawn in the same room and all absolutely rape you all at the same time since their reaction time is like 1ms even if there not looking at you and your team won't help you cause they're frozen up at some random ass door or dead cause they decided to just walk into a tripwire or into a room full of john rambos while looking down at the floor like a lobotomised fish, for a game that costs almost 50 pounds id expect it to atleast be playable, im quitting completely unless this game actually gets that ai overhaul that everyone wants, its a shame cause I did really like this game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Just pirate the game.\n\nDevs don't care about actual feedback and removed family share which is a basic steam feature.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Was excited to play this game since im a big fan of swat games, and i was super excited to try this game out long time ago when the trailer for it came.When it first released, i bought it with a couple of friends and we played a lot of it and it was just super buggy with stupid ai that just ruin the immersive experience. Slow updates, no fixes, bad optimization and just overrall a bad game. There's this one roblox game thats unironically way better than this horrible game with way better ai and level design and its called HELLMET if any of you are interested. genuinely way better than this cash grab with a bunch of stupid streamers glazing this horrible excuse of a swat sim game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Had potential to be a good game. Developers left too many glitches and bugs. Half of your shots do not register if you are engaging. The enemy can lock onto you and shoot you through all cover so do not even bother to try to use it. On hard you will take take a head shot across the map through a wall from a pistol. Some weird glitch where there is no enemy around and you just die from a heart attack or stress i dont know. Developers should have done better and they would have had a great game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The core of the game is fun. Graphics are immersive, gunfights are tense, sound design is quite good. If you have a bunch of friends that'll run multiplayer missions with you, there's almost nothing to complain about.\n\nWell, the suspect AI is incredibly simple. Suspects rarely try to flee, sometimes they see you with their backs turned from the entire corridor while you're sneaking, and they might decide not to surrender when surrounded by five officers and being pumped by beanbags and pepperballs.\n\nThen there's equipment jankiness. Interrupting shotgun reloads or even weapon switching seems not possible, so I was once stuck loading 6 shells before being able to switch to a taser. Also, not taking any magazines for a weapon means you'll have it with an empty magazine inside. Why even take it for the mission then at all???\n\nAnd don't get me started on squad AI. Sometimes they'll restrain suspects automatically, for which I'm thankful in a room with 4 surrendered suspects where any of them might decide to pull a gun on me anyway. But sometimes they'll start restraining automatically in a middle of a corridor 2 seconds after being shot at. Or they'll restrain a civilian instead, and get surprised by a suspect faking surrender 2 meters behind them. Or they won't bag the evidence, because why would they. Or the AI will get stuck on a command like \"Open, flash and clear\". Or they'll decide to go around to the other side of the door and get absolutely blasted. Or the AI will refuse to use the shield, even though their primary weapon purposefully has no ammunition. Or it will kill a suspect with a beanbag, forcing you to restart the mission just because. Or they will disobey a \"Restrain\" command to engage with a suspect, even though there are 4 other officers already engaging him, which gets us surprised by that one surrendered suspect. The squad accuracy and adherence to Rules of Engagement is also atrocious - sometimes they'll engage immediately, sometimes they'll wait before 5 JHP rounds are firmly logged in their chests. Sometimes they can hit center of mass, sometimes they'll pump 3 rounds into a wall in front of them because their wallhack told them to.\n\nThe game can be quite fun and getting S ranks feels rewarding, but it would be a much more pleasant experience without all the jank.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Such an amazing game with the same heart-warming vibes as the beloved SWAT 4. Definitely a must-play.\n\nI bought it back in December 2021 and didn’t play much - my main goal was to support the developers and their vision.\n\nBut I’m very disappointed with the commercial side and the way the developers seemed to trade their no-censorship principles for a handful of dollars.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is phenomenal in its mechanics and overall gameplay. It's a blast, even more so with mods. \n\nHowever, censorship is ass, disrespectful to the original vision many (including myself) were sold on. Censoring the horrors that were previously bravely depicted for the sake of woke culture is outright insulting. I would request a refund if I could and buy something from a developer of greater integrity.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I am obligated to review this game negatively because they never reverted or fixed the graphical LOD downgrade from the console port patch after over half a year and likely never will. This game is neglected on PC",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "They completely broke this game.\n\nI bought the Ready or Not LSPD bundle with all the DLC's on sale about a month or so before the major censorship changes. When I say they COMPLETELY broke the game, I mean it. All of my game files are the ones included with the game; nothing extra from mods. Additionally, I have gone through Vortex and removed mods + the archives from there, as well as manually going through the files and checking to make sure that no mods are there. This was a COMPLETELY STOCK installation, and it kept popping up with \"Corrupt data found, please verify your installation\". At this point, I had already verified at least 3 times, each time double and triple checking my game files.\n\nOn top of this, when it would actually allow me to play my game shortly after the censorship changes, all of the mods were broken entirely, which was expected, but it seemed like it was less mod friendly this time, almost. Albeit mod.io is officially a menu option in-game that you can install mods through, the Nexus mods are almost entirely, if not entirely, broken. Not to mention, the other following issues, but not limited to:\n\n-Major graphical changes, as well as gore and NSFW being removed that they initially said would be there in the commitment to make the game as true to what happens with law enforcement as possible, although it can be added back with mods,\n-The community manager being fired for making controversial comments on a now dead figure that was catastrophic to a lot of America,\n-Changes, such as breaking AI and downgrading a lot of components of the game that was loved JUST to make it able to be ran on console,\n-And continuing to be mostly inactive with the community, to the point where it feels like it's almost been shut-out.\n\nFor context, I very, very rarely post negative reviews, in fact, I believe this is my first negative review, if not my second at most, due to what these developers have done to this game. Before, I loved it; no issue with the genre itself, and then the greed came along and ruined it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I returned to this game and it's performance is cheeks now (AND THE CENSORSHIP, OH MY GOD. WHY APPLY THAT TO THE PC RELEASE.). Would not recommend playing during the midst of being suicidal as it would make everything worse.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wish I could recommend the game, because when I bought it, I liked it. Now they simply censor everything, downgrade the graphics and introduced bugs.\nI really loved the idea of having a good Swat successor to play, but seems it's not going to happen, I am sick and tired of this politically correct bs.\nWant to have some fun? Go to GoG and get SWAT 4, even SWAT 3, they are honest games, imo made in a time back in the past where companies did the best they could with what they had available, and not \"good enough\" to sell an unfinished piece of crap, that they dare to change as they wish and frustrating the player consumer, and for guess what? You know exactly why, FOR THE MONEY LEBOWSKI.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I wanted to try this game again after over a year, since the game used to feel rather empty and unfinished. Welp, it hasn't changed and it in fact runs worse. The game wouldn't boot at all, kept crashing the splash screen (which it didn't use to), so I had to look around some forums to find a fix that worked for me. It doesn't run great either. This might be nitpicking at this point, but flashlights often make it harder to see instead of helping. That, and the AI still often snaps to you and you a goner, which is hard to believe when it's some random crackhead. Also, why's my guy got so little space to carry grenades/gadgets/etc, it's a PvE game anyways, can't I have fun on a different difficulty setting or something?\n\nOh yeah, that UI fucking blows and is a headache to have to fiddle with anytime you want to modify or even make a new loadout. And if you already own the game, don't even bother buying the DLC's, there's barely any content, just use community mods.\n\nI'm not about to buy DLC for a game that should've had some of that content in the first place. VOID have also proven that they care more about money than their customers (i.e., deleting user forum posts that painted them in a negative light) so y'know what, F 'em.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is brilliant but the ai genuinely ruins everything. Why are crackheads behaving like and possess the tactical skill of Delta Force Operators, they also just have built in nightvision in their fucking retinas. I need nvgs AND a mf flashlight and I just do not see these mfs, heaven fucking forbids they see a spec of my big toe nail and they instantly lock onto me and blast me with 9mm through cement.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "why would they remove content downgrade graphics and just make the game worse over time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DISCLAIMER: This is a positive review. Game's fun - Never played anything that felt this puzzle-like without being a puzzle before. I simply can't in good conscience file it as one when a game with assets THIS high quality is using AI art for various posters and photos within the game. Pay an artist, ffs!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very confusing to make S rank tied to non lethal and then make all non lethal options ineffective. Your so limited in how you can complete missions that the game becomes very repetitive very quick. There's more room for creativity if your not going for high ranks but if you are, its the same tactics, gear and weapon over and over. taser does nothing, pepper spray does nothing, stingers do nothing, beanbag shotgun works sometimes, but usually it just kills them or does nothing. AI is broken, they can shoot you from across the map with a pistol, there movement is all the same and very predictable so if your playing lethal its like shooting fish in a barrel so not very satisfying to beat them. this game just wasn't what i was hoping it would be. And multiplayer... wow....no one has mics and friendly fire is enabled, what do you think happens 9/10 times.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Post-release censoring a mature rated game is silly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had this game since it first released on early access, played it throughout various updates. The game preforms worse now than when it first released. Crashing, disconnecting and the same dramatic FPS jumping/drops regardless of what graphics settings you pick. Uninstalled after 2 years, it will collect virtual dust for the rest of time on my account.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cross play and epic games requirements ruined it.  Used to be fun, now its unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game's AI sucks ass, I have never been more frustrated in a game than this one. The AI teamates lack the cooperation with the commander and every single time I'm trying to make them clear a room/area, they stand still. In order to fix something like this is telling them to \"Fall In\" then \"Move and Clear\", it's bullshit. Even if you try something like this it'll still not work. Don't get me wrong, I love this game and I put in many hours in it(57 on console), but it's the AI that makes me hate it. VOID Please fix this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I loved this game. I hadn't played it in a few months - came back to it and started up a multiplayer mission. Oh my god what the fuck did they do to this game?? I can't get two minutes into a multiplayer mission until the game crashes. On top of that, I'm getting screen tearing even *with* Vsync enabled (when I never used to), my teammates guns are not being rendered, and the audio is all fucked up. God fucking damnit Void!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is honestly so garbage that it wont even launch me into the game anymore. do not recommend. save your money",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game crashed with friends every 2 games unplayable with friends",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i dont know why but i played this game and one day its just not starting the game its crashes out",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is very fun and the mechanics are great. The developers really used to have my support, but as it turns out, they are actually spineless cowards who bowed to executives and censored their game. There are were some moments pre-censorship that no one else had ever been brave enough to put into a video game, these guys did that and I respected it. Now that they have sold out to get onto consoles because $$$$$$$ they censored what I felt was one of the most realistic depictions of the gruesome reality that is law enforcement. I will still play the game, I've owned it for a long time, but new buyers beware these folks are not afraid to bait and switch you and for that I simply cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Force to use epic online service, and I don't think VOID are respecting their mod community. Don't buy it if you are attracted by it's gameplay video or streaming. When you actually playing, you'll get lag and bugs, even sometimes your game will crash once you join a lobby. About player, I don't think a SWAT team will like these myasthenia gravis patients. In the end, F you VOID\n\nedit: till now i've played 5.3h, but there are about 3.5h and more was trying connect the server. don't buy it if you're looking for a teamwork game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Until the graphical downgrade will not be reverted and the censorship about strong content will no be resolved (for PC players) with a specific option to turn on/off, this is what you get. Bye.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Optimization is not great at all. Gets my fans spinning like a space ship landing on mars. Nevertheless, using a shotgun with lethal ammo is my universal key to success and gets every job done. Casualties can be avoided, but I don't care.\n\nEDIT: after submitting my review I realized this is now 50 bucks. Like what in the actual world... Not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fine as a first-person shooter, terrible as a police simulator. Real-world departments have a use-of-force continuum that ends with lethal force. This game allows you to fire warning shots (lethal force) to encourage compliance from nonthreatening civilians but penalizes players for firing on an armed terrorist holding a hostage without shouting for compliance first (verbal contact, the second lowest rung on the ladder).\n\nThis is obviously a project by European computer developers imagining being American cops made with no outside input. Which is fine. Here, strung-out drug addicts have ten thousand dollar automatic weapons, nightclubs are grimy neon dance floors and EDM but also water play dungeons, and furious doctors demand to be allowed help a wounded terrorist who just murdered their coworkers. VOID took a cargo cult approach to creativity, daydreaming about an imaginary world seen only in TV shows and YouTube videos. Which is, again, fine.\n\nRegarding the actual gameplay itself, it's okay. Computer games are a series of interesting decisions; single-player scoring restricts the player's choice too significantly for this to be considered a game. You cease to be an officer and are reduced to a helpless witness, watching a squad of algorithms as they simulate shooting paintballs at an armed child molester. Multiplayer, especially mods, are where the game allows the player personal liberty to play as they choose.\n\nBuy it on sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good Game in concept awful devs, the console update was a downgrade, the ai is horrendous, performance awful but there isn't any other game like it so I still play it",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "to install this game you need epic online dependencies, i don't like epic games i just want steam thanks",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is a buggy mess. Multiple things don't work, even simple things like setting keybinds. The technical support also doesn't even answer.\r\nThe game is quite okay. Sure some thing could be tweaked form a balancing point, but it's fine.\r\nThere aren't any real competitors on the market, so there is no real alternative.\r\n\r\nIf you really want to play something like this it is fun, but the bugs and ai generated content as well as the (sometimes) bad animations got me away from it.\r\nI can't recommend to buy the game until they actually start fixing things.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No reason to censor anything in the game. Such a bunch of sellouts.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I saw it on sale and figured, even with all the censorship backlash, its still got good gameplay right? \nWrong. The game doesn't even have ADS sensitivity for M&K. \n\nLet me repeat so you don't miss it: THE GAME DOESN'T HAVE ADS SENSITIVITY FOR M&K. If you care about AIMING in the SHOOTER, give it a pass.\n\nWhats worse, its got ADS sensitivity for controller??\nLooking up ADS sens on their Discord and its just three years of people asking, \"Why is this basic feature that would take like ten minutes of labor to add not in the game?\" and the absolute copium of fanboys acting like being able to properly aim in an FPS shooter shouldn't matter.\n\nOh, but you can mod it into the game! So enjoy having to play in modded lobbies and losing your control settings whenever the game updates. Pass, refunded, gonna go buy something else. Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Best tactical shooter ever made. I love the gameplay. Sellout company though. Censored brutal content and tuned down the graphics to appease consoles.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game, but ... \ncensorship, graphics downgrade, devs sold out and broke give promise to players.\nSo, I can't recommended until it will be fixed.\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☑ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Untoggleable censorship for 18+ game bad, swat ai bad, enemy ai bad, playing with friends good",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game now freezes loading into headquarters actually unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has fallen so upsettingly far from everything it was meant to be and express. The upsetting and horrible nature of the things encountered and done should be upsetting and make you uncomfortable and upset. That's the reality of the horror of these difficult subjects and situations in life the game was meant to be commentary on. The game had done a great job of trying to showcase the terrible decisions and actions officers at times have to make and suffer from while not actually becoming pure \"copaganda\"  just blindly defending the many horrible flaws and problems in the law enforcement world. At every turn it's an amazing piece of environmental storytelling to paint the bleak struggling world on the brink of collapse and how law enforcement can only ever be an after the fact bandage for a problem that must be addressed in society. Law enforcement cannot solve poverty, mental health, systemic exploitation, and desperation. It shows how these things hurt everyone including the officers themselves as you see and hear the declining mental state of the officers around you and how these wider problems plus policy and culture within law enforcement can enable and push good officers that truly want to help the lives of those around them into corruption and failure. I can't think of any other game anything remotely similar that actually elicits this sort of emotional response and thought on these things in life and it's truly very sad seeing how more and more it keeps heading towards being another Call of Duty lacking any soul. Remember that videogames are a form of art and art is political. It always has been and probably always will be.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I actually really like this game. Its no lie that it is a fantastic game. That being said, the developers have a hard on for braking the game or ensuring it will break itself while you're gone. NEVER TRY TO MOD THIS GAME BTW. Anywho, I've had this game break on me tons of times. Always when me and some friends really want to play. Tonight the game broke so bad even a clean install wasn't working. I had to delete EVERYTHING manually and lost ALL OF MY PROGRESS IN THIS GAME. I \"S\" RANKED EVERY SINGLE VANILLA MISSION AND WAS WORKING ON THE DLC MISSIONS. It still broke twice more after before, by means beyond me, despite having tried EVERYTHING and I mean EVERYTHING, it finally started working again. Now I'm at 0% again and I am too busy with work and life to give as much time to this game as before the same can be said about my friends so I'm shit out of luck for getting back all my progress. To the developers who taunted me with so much just to take all their middle fingers and bury them in my rear, fuck you. Please help, of course. But importantly, fuck you, sincerely. I have had a shit few months and you just gave me an extra month's worth of stress overnight. Fuck you. Like, why ? Seriously. Why? Why do you have so much hate and ire towards people who enjoy your game? Why do this to me?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Would love to return the game after the changes that they insulted us for complaining about. It feels like an acravedy shoot tailored to co soke now and I really woukd like a refund.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ive never seen a dev team fumble so bad. The lack of updates and improvements is nuts, who cares if its \"playable\" on steam deck when the bots dont work properly. The censoring of the more mature content shows that this dev team doesn't care about the product only about the money. So much potential wasted by morons",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really want to like this game but it's just sucks man. the AI, the graphic, the crash, the \"you're not having a restart mission button on commander mode but hey you can alt+f4 it\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've owned since the game was Early Access and even followed along on progress since before then.\r\n\r\nSince 1.0 they've changed the game vastly, it feels like a bait-and-switch.  Devs move on to make DLC for more money than fix core issues still present from EA.  Ignore current issues, etc.\r\n\r\nWould never buy a product with their name on it again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wish i could even play the game now. Since the console update my game takes 500 years to even load into the main menu but when i try to start up single player it just straight up freezes and I have to restart my pc.\n\nDon't get me wrong this was a fun game before the optimization, I personally don't care about the censorship I just want to play the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i knew it was over when they got upset about one of their employees posting negative thing's abt charlie kirk and proceeded fired them on the spot. (cant wait to get lombasted bc of that one) not to mention the censorship prior to that, which was just a spit in the face to all the loyal fans of the game. \n(the game isn't bad btw just bc it's censored, it's just that its not what people were initially intending to buy the game for, as it was the opposite that they wanted)\n\nnow all i think when ever i see this game is the billboard image of #jerk4kirk. that in of itself should say something.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AI teammates have gone town the toilet, don't listen to commands and get stuck often now. if you plan on playing alone don't buy this",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The censorship is quite a bummer, the game was really headed in a strong direction when I first bought it when it released on steam. It was really fun, had lots of promise and was simple. Then it had its full release; it became larger, more about story, lots of needed changes and fixes, etc. But then they did a huge double take, and censored all releases for just the console port. \nTHAT, I feel is sad, and shows the studio has little back bone. To censor an entire game, instead of censoring only the console versions, is quite pathetic. I uninstalled the game a while ago, but am now writing this review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Plays pretty fine, and the gunplay is solid. I've only done a dozen or so missions, but it's all been pretty solid.\n\nPerformance is OK, but I have a 4080 Super and I'm running it on \"Epic\" settings. Not sure how much weight my statement holds with my setup at hand.\n\nThat aside, the censorship is SUPER noticeable if you've ever played the old versions. I'm only a few missions in but the tone is just not as haunting, and that is a HUGE red flag for me to not recommend the game. It's fun, but the devs seem to have set a pretty dangerous precedent if you choose to spend your money here.\n\nEDIT : I forgot to mention I got this for like 25 bucks for some friends. For 50$ it just don't seem worth it, especially for a game that's best played with friends. I'd wait till it's on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was fun when it first came out. Now it doesn't even launch, and the game basically regressed a lot. Disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is fun, and hard. If you can play with friends, and use good communication and tactics, its very good. Playing with the AI teammates is infuriating. They will walk directly in front of you, block you out of cover, get in the way of engaging enemies while you are actively being shot at, then tell you that you are in their way. If I could turn them off entirely, or turn off collision, and they stayed behind me unless I specifically order them to, the game would be massively improved.\r\nThe enemy AI is massively improved from what it would be, but I have been killed many, many times while getting good hits on the enemy, and they just ignore the hits. There's no reason my character, wearing full ceramic plate armor, should be more affected by gun shots than someone wearing just a hoodie, while they are being shot in the chest with hollow points.\r\nThe devs also don't seem to respond to the community any more. Looking through the community page here, they seem to have disappeared. After they censored the PC version after swearing they would never compromise their vision for the game, that's probably the smart move.\r\nThere isn't another game in the genre worth playing right now, but I can't recommend this game if you don't have a dedicated group to play with.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I love the game, the issue I have is that the AI is clunky as hell. Specifically I mean your AI teammates. If you have friends, might not be an issue, but these guys get lost, ignore orders, and just act stupid. Also the censor issue thing is annoying, doesn't really harm gameplay but it does show how quick the devs are to sacrifice their vision and our loyalty for a little extra money",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A realistic tactical shooter game made around randomness, but it punishes you on the randomness that it self implements. The AI swat members are beyond useless whilst the AI criminals teleport, shot through multiple walls, walk trough walls sometimes. Buy it when its on sale (75% or more).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't, in good conscience, give this a positive review. This game is riddled with bugs like infinite reloading, enemies not registering hits or registering hits but not going down when using non-lethal rounds, evidence fazing through the floor and many many more. It's incredibly fun but a broken mess... don't buy unless they fix all these game breaking bugs.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i started playing the game again and it just looks worse now. and its just kind of boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The developers lied to the early access customers, so I will never again buy a game from them.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tactical slop.\n\nDevelopers adamantly use AI, they've previously practically zipbombed us with huge game file sizes only to make it that size again later on.\n\ngive your money to somewhere else you'll actually have fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Probably the most disappointing aspect of the console update is the downgraded graphics in an attempt to cater (i.e. sell out) to the potato farmers of the console nation. Before all of the debacle I love this game despite its imperfections. After the update tho? Not so sure anymore. I really thought VOID would be different compared to other studios, and that I could believe in them. But no, lol. \n\nFuck VOID",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "You promised no censorship. I got the damn game when it was in early access. You've practically  have stabbed you're own loving community in the back. I understand it had to reach console standards but two different versions would've saved this game. \n\n-thank you VOID for wasting 50 dollars I could've saved to buy gas",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wish I could give an actual gameplay review but the game doesn't even load it just freezes constantly and I have a decent gaming computer. Wouldn't recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is ruined by the AI in two different flavors.\n\nFlavor 1 Your Teammates: The AI teammates are about as useful as a wet piece of toilet paper. When they aren't getting out gunned by run of the mill crackheads with an elevation advantage as well as shooting first; they are standing in locations that open them up to enemy fire and the best part is...they will sit there, get shot and die. They operate on a similar wavelength of Reese in the Malcolm in the Middle episode where he joins the Army. \"...I don't know how to feel sir, I am waiting for you to tell me.\" They will do literally nothing without you telling them first, including measures that will save their own lives.\n\nFlavor 2 The Enemy: Do not mistake this as me saying the AI is too hard. What makes them a pain is how unfair they are to fight against. They will literally shoot you through walls because they caught sight of a single pixel of your player model. They also all attended the Sam Fisher academy of stealthy movement, because they will hardly make any noise at all, if any. Furthermore, the player is very hamstrung mobility wise, which I am fine with, it is supposed to be a tactical shooter and I get that. But do not subject me to the most glacial movement system known to man and give the AI Battlefield levels of movement ability. They are able to run, strafe, and shoot all together in one fluid motion and this doesn't affect their ability to land shots whatsoever. Lastly, suppression, the player gets shot at and my vision cones enough to make me effectively blind. However, enemy AI gets shot at and it's as if you just farted in their general direction.\n\nOverall, I have tried this game many times over the past year or so. And each time I remind myself of why I stopped playing. The bones are there, the gameplay is there, its just the AI is so horrific in a game that revolves around it, I cannot recommend it. \n\nP.S. The whole censorship thing is another huge issue I have with the game, but that is mostly down to the developers being spineless bastards and chasing money rather than staying loyal to the core idea of their game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AI can shoots through walls even on standard mode. only a couple levels with civilians and enemies sometimes get stuck inside walls, making it impossible to complete levels. sometimes after 15 mins of playing found that they were stuck inside a wall and could not kill them or arrest them. \n\ngame has very good teamwork and cqb gameplay, but the bugs and lack of levels burns you out quickly. \nhad high hopes for this game and really loved it up to this point. just tired of the same old bugs and the same levels.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, good idea but imo a very annoying implementation.\r\nThis game (similar to Arma) shows very well how realism doesn't lead to fun. Compared to other shooters leaning towards realism, this one is even more annoying, because it (in many ways) only includes realism in ways that clash with the promised fantasy of the game. \r\n\r\nFor example:\r\n- You can't shoot to disable. Like shooting in the foot. In fact, shooting someone in the foot or leg will most often (or always) not even count as a hit.\r\n- Several possible reactions of enemies are very far from what any human would do. Sure, unpredictable humans are realistic humans, but I mean unpredictable in the AI kind of sense.\r\n\r\nIt's also technically annoying, actually. After ever mission in coop, all people have to quit and rejoin the session to be able to use their main intel gathering device. All animations are quite slow, with even slower fades in-between them. At least restarting a mission is somewhat fast.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This \"realistic\" game is not realistic at all, dogshit AI.\n\nEdit: Beat the game on hard mode - lethal, and as a 'pro' now i can say that the game is not hard, just bullshit a lot of the times",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In short:\nA cool game that gets ruined by its greedy pricing and is partly hurt by censorship to a lesser extent.  Buy a key somewhere or find other ways to play don't fund something that asks for so much for so little.\n\nlong version:\nA while fun and somewhat polished games their is a fair chunk of issues I don't like that makes me not recommend this game.\nmainly the following:\n\n-The damn pricing this game has is plain old silly. You have to pay 50 usd for a game that feels only half complete at times (I run into a decent chunk of bugs or issues even through its supposed to be a \"complete game\") along with the content and replay ability being relatively short and increasing the price for the game after adding a couple of minor things and calling it \"complete\" is also really silly many other games can offer the bang for your buck for way less than this.\n\n-Also adding overpriced dlc (10 usd) for a already pricey game is further silly and greedy especially with the fact you disabled family sharing because you have to nickel and dime in any way possible I guess (I played a couple of the dlc levels with a friend who bought them and even they agreed the price is dumb non of the content is worth it at all and could have just been free updates). \n\n-The A.I in this game is the also a significant issue when I mention bugs earlier. The swat A.I is as smart as a brick they'll constantly sit in place and get shot,ignore your commands and every now and again just play stupid in other ways not mentioned here that gets you killed or themselves killed. The suspects do have a way better A.I through but there is definitely situations were they also feel wonky or just plain old dumb. \n\n-Also because of the single player feeling wonky the game is ten folds more fun with others but good luck convincing a friend to get a game for such a giant price and this also even more a issue for a game that only itches a niche for only a few. people\n\n-A more minor one but one I do want to mention (but is far from a main or core point for this review) is the forced censorship. There is definitely in someway to make a toggle setting and the devs just don't want to bother and while again minor some of the specific changes are really odd and or remove part of the tone of the levels. The main 2 ones in specific cases that really piss me off is the valley of dolls on console and the sleeping kid. Both don't make sense and hurt the tone of a game that supposed to represent real world situations. It also makes it even harder to connect to these or take these situations seriously when your hit with a nonsensical censored replacement for what would've been a surprising moment that makes the situation feel more grounded. It also rubs me the wrong way because if there fine with changing there vision for a companies what stops them from further changing or neutering things (while sure they might not or say they wont its hard to trust them end of the day if they already did it promise or not promised)\n\n(also on this last point I would heavily recommend you form your own opinion and or views as this part is more opinionated and or situational aka do your own research make your own opinion. I'm expressing my personal opinion on this subject because its still a valid issue to the game to mention that I think is critical to a extent. )",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "performance is dog shit, i've got my settings so low that it looks worse than roblox but yet it still runs worse than BF4 on max settings",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I honestly don't understand how anyone can take this game even a little bit seriously. The ai keep hitting impossible shots while your screen starts shaking, blurring up, flashing like you have a fucking firecracker in your room so if somehow you're still alive in the game, then irl you're definitely having an aneurysm looking at your monitor. If this general experience of getting raped isn't enough for you, you're in luck because you can experience many other similarly fun things such as: 2 pixels of an enemy floating across your screen as both of your legs are disintigrated, some mexican guy floating down a flight of stairs with his back turned to you pulling out a pistol from his back pocket as he does a 180 and shoots you twice while tanking a slug shell from a shotgun from 1 meter without absolutely any armor (also people just tanking 3-4 shutgun shots before taking any harm from any distance), peeking an enemy but also just dying 0.3 milliseconds after they appear on your screen because the ai have the reaction time of a god, getting sniped from across the map by a dude holding a pistol and finally looking into a room as shots start coming out of nowhere either because it's so dark (at least turning up your brightness to the max helps with this) or simply because the enemy just blends into the map becoming essentialy invisible\r\n\r\nConclusion: 9/10 ragebait of a game, easily beats any real ragegame",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was super excited about this game, while yes it is a pretty good game, it lacks a lot. First of all map size, the maps are super unrealisticly huge. A 5 person swat team is not clearing 2 hotels. Secondly, the traps. There are an insain amount of traps in the dumbest places. You trigger one and it's over. Not even a chance to heal yourself. It's not even a fun dificulty, it's just annoying and painstaking.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game's early trailers hyped up so many features and cool things, that never made it into the game.\nThe game advertised itself as taking the tactical and strategic side of SWAT 4 and pushing it to the next level with many more tools, and pushing realism and attention to detail to the next level.\nYet, from early access to release, the game never ended up having from what I can tell, ANY of the features they advertised, that would've been a huge innovation over SWAT 4.\n\nWhat we have now instead, is, just a game that innovated nothing over its predecessors. It has some nice polish, QOL stuff, better animations and graphics, yeah, sure. That's nice and all... But, there's so much stuff that just doesn't exist.\nAll the things around pre-planning and many different ways to approach situations? Simply not there.\nDrones, ladders, shutting the power off, picking entry points and strategies? Nothing\nThe cinematic cutscenes of things like the watching your team arrive to places, which would give an immersive feeling and in turn uplifts the story and character development and named characters they talked about? Doesn't exist at all. You just go from level to level, loading screen to loading screen. Sure, that's how SWAT was, but, they advertised the above in the trailers, and didn't deliver.\n\n\nAnd then top that off with the fact that, they actually went back and started removing things that were in early access, and, then after release, they went and censored a bunch of stuff to make it all safe for console release...\nYeah... No. Its not a bad game, but its existence can hardly be justified when it feels like it barely if at all moves forward on SWAT 4 aside from graphically. Mostly, the changes are not flat improvements, but, changes that someone may simply find preferable, or not so. Alterations to the game formula, rather than additions. All for a price significantly higher, and PC requirements that are also so.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "***Be in mind that this comment is from 27.11.2025 The game features might have changed by then***\nReady or Not just didn't delivered the atmosphere SWAT 4 had given. While the game has pluses which I will not speak off cause others already commented on that I will focus mainly on negatives. \nWhat I mean about atmosphere is everything: Music doesn't much with environment (I really like the way music was in SWAT4 sort of unnerving/mysterious u could say horror-like and how the dynamic vs ambient version would fit together - is still the same song just when the action starts it goes into its modified) <- the very example that I think would fit this style would be Neon Club mission u already have the song playing in the club but on top of that u would aso have the horror-like/unnerving music right after u enter the club doors and see the first bodies and playing from this point onward (while the disco music sits in the background). Next things that contributes to atmosphere is TOC (and possibliy other swat officers?) - lets not forget they are human so after seeing smth like this they should react according to the situation doesn't matter that they are proffessionals same goes to TOC he is also the member of the team (tho he doesnt actively participate) when he hears something disturbing or even when the hostage is killed and reported to him he shouldn't just say \"Copy that entry team continue mission\" you should feel it in his voice not like him being angry rather shocked and a little disappointed but still trying to respond in a professional way. And the last elements and how the map feels itself should be more dark with more blood on the walls with some background to the situation what happened that the blood is there in the first place.\nIt is not easy task to accomplish this but I think the authors of the game should focus on things like this cause recently I feel like this game is becoming a Cash mine that they release 3 new maps + weapons for some ammount of money. Also it is now the full game but it doesn't have full game functionalities like the Swat 4 had where is the multiplayer? Swat 4 had one and it was really good for replayability (if someone got bored of coop he could go to barricaded suspects/vip rescue) and also why the other gamemodes/maps have been removed completely and never brought back I remember there were other gamemodes in coop - bomb threat, raid etc. and also the maps were removed - i remember f.e. the Big hotel map (where u spawned outside of it and had two entry points underground parking or main entrance). Feels like the game was downgrading rather than upgrading",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game crashes on launch, god himself doesn't want me to play this shitty game. Void has destroyed everything that was once great about this game so they could release it on console and make more money. I've played so many games lost to greed I've truly lost count. save your money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fix the optimization!!! Seriously i cant even get into a game without it crashing 7 times before it responds if it ever does!!! i will change my review too positive after since your'e game is great when it works",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I Bought the supporter edition of this game in pre release. they are slow on updates and neglect the game, they cut a bunch of amazing content like drones, power boxes to cut, gore and further dismemberment ,numerous levels and gadgets. and  changed the rating of the game removing nudity and gore- which the whole game was advertised to be gritty. the gameplay has improved but with the original game modes taken out and no pvp mode the replay ability is limited. Im very displeased with the way the game is going, it is not what I paid for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Long after it's release the developers have yet to fix game-breaking bugs like stutters when first looking at hostile NPC's that will ultimately end your run. Instead, they've focused on cash-grab DLC's; Spend your money and time elsewhere.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game but the censorship , downgrade in texture quality and other things for the console release money bag feels shitty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot recommend this game for steam deck. It was fine and did struggle but I was able to play at a solid 40 fps but since the latest update the menus are completely bugged. Not only can I not scroll through the customization menu, there are certain dlc levels I cant select. Until this is fixed I'd suggest playing something else on the steam deck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't you dare buying this game to play with friends, it has MP breaking bugs that are not fixed for MONTHS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The AI team in this game is horrendous. They just get stuck trying to open doors.\r\n I kept trying to get back into it but I cant anymore. uninstalling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unable to play online for days now. been trying every solution but game still wont connect to epic servers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It somehow still feels extremely early access. Like it's missing alot of key quality of life and gameplay features. There's no tutorial and you're just thrown into the game and expected to understand and pick up all of the random control methods (issuing commands to Gold Team, Blue Team etc, how to change weapon loadouts, how to manage the team, where to go in the police HQ etc.)\n\nThe missions are really uninspired and the AI is terrible. The baddies will just stand in their same pre-programmed spots on the map and will never move. The mission goals are always the same (go in, kill baddies, don't kill goodies, leave). Often I'd complete a mission and there'd be no indication that I still had more baddies to kill or where I was supposed to go, or that I was done and had to leave. There should be some form of HUD notifications guiding you better or something like someone from HQ saying 'Good work boys, that's everything. Head back\". They should give you an option to leave the normal way or just press escape or something to instantly leave the map.\n\nThe lack of gamemode variety sucks as well. You've got all these weapon choices but you only get to use it against garbage AI in only a handful of developer maps. Why can't we have an option for PVP or something like you VS another enemy AI squad. There's even mods for this. Why can't this be in the base game?\n\nUltimately a big let down as they never reached any peaks with this and just wasted the opportunity for an actually realistic tacticool shooter. It doesn't have to be another Battlefield or Call of Duty but come on, you guys spend all this effort getting voice acting and realistic gunz but can't design a fun game?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game breaking bug in the tutorial = no thanks. Steam refund policy = yes please <3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know where to start. the game is spectacular, especially in its niche. however the stress system is so fucked up and over-engineered it just becomes unplayable....what was the point of it?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "used too enjoy the game, down grading it really was a crap idea, soo its a no for me, dont was your money on a crap game like this, stick my hours where the sun dont shine",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got this for free and still wouldnt recommend it. They say the recommended graphic card is 1060. But im playing 1080p with a 2070 graphic card the game is a absolute loading simulator and crash fest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Post-release censoring a mature rated game is silly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a pretty decent game but last time i play it felt laggy and lots of bugs but its good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is very fun with friends, but the multiplayer engine is so bad, we're getting 7 disconnects & lobby drops trying to complete a single mission",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi Guys\n\nMany won't have this view point but if this was releast befor SWAT 4 then good game, but i had a much higher expextaion for this game.\n\nthe AI teams get stuck so much that they can't open and clear after some one used the opti-wand, they reply ok but don't move.\n\ni can't access the multiplayer as the game shows no ifnormation of trying to connect and after 5 min just says can't connect???\n\nI have waited long to be able to play this and the only way to have a enjoyable experiance is to go mostlly lone wolf.\n\ni know SWAT 4 set a high bar but this did come close.\n\nSWAT 4 ment alot to us.\n\nfeel free to reach out to me if the want more feedback and to make this good game great.\n\nwe would love to see it being the ture successor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought the game, worked for 5 hours and then suddenly stopped loading, error about not having enough video memory despite it working initially without issues (and no changes to my system). Asked for a refund but was denied as I'd played more than two hours. Don't waste your money on this game, absolutely pointless if it randomly stops working after a few hour. Awful customer service, would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "low weapons, low missions, low graphics, and VERY VERY terrible online system, it took me and my friend hours just to invite each other beacuse hes on his xbox the EA account of hisis offline so i cant send him an invite unless he has the launcher open on a different device so it says he is online so i can actually even send the invite since you cant send one if their offline",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Retrying this game after quite some time, and while some things have improved, the character movement is like syphillitic aids, and the AI enemies can see through walls. While the character movement can be dealt with, the AI seeing and engaging you through walls and doors is a deal breaker. To be fair, every game has this problem to some degree, but in this specific game, it makes it unplayable. I can't believe anyone actually plays this or any number of 'tactical' shooters with these issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unplayable, the bots in this game have wallhacks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game crashes all the time when in multiplayer \r\ngreat game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot in fact \"comfim\" thanks for breaking somthing I paid for with one pop-up. Edit fixed the Pop up but i couldn't close the window becase the game think my mouse pointer is in a totally diffrent spot. still don't recomend, obviously.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}