{
  "positive": [
    {
      "review": "got addicted to beating my dad every day, 10/10. cant wait till i 100% beating my dad and start beating my granddad",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "I initially bounced off this game quite hard. I went in with the typical roguelike mindset of \"I need to beat this run I am in right now,\" which meant that every time I failed, the story interruptions and the hub area felt like annoying hurdles keeping me from my next attempt.\n\nHowever, once I stopped trying to force a win and started embracing the grind, it clicked. The metaprogression and the narrative aren't interruptions, they are part of the gameplay loop. Once that realization hit me, I can understand how this can be considered one of the best action roguelites.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "I'm not usually a fan of roguelikes, but Hades is in a class of its own. \r\nSomehow the game manages to be both intensely challenging and incredibly relaxing. The \"one more run\" loop is perfected here. The combat is slick & smooth, the writing is witty, and the art is stunning. \r\nIf you have even a passing interest in action games or Greek mythology, then this a [I]must[/I].\r\nThe genius is that failure never feels like a waste of time. Every run makes you stronger, and more importantly, unveils more of a story that is somehow both epic and deeply personal. \r\nCan't wait to finish this one and start the newest game, Hades 2. 🖤\r\n(Should have added the option to pet all three heads of Cerberus!!)",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "[h1]\"Few tales are told of Hades, whose very name inspires fear and penitence, reminding us of the inevitable fate which we all share.\"[/h1]\n\n[h1]Introduction[/h1]\n[b]This review is based on playing on the Steam deck.[/b]\nI've never been particularly good at roguelike or lite games, but having heard repeatedly that Hades is such an interesting and fun experience pulled me towards giving it a shot at long last. But was it able to survive a full run, or did it die on the shores of Tartarus?\n\n[table]\n[tr]\n [th][b]🟩 Positives[/b][/th]\n [th][b]🟥 Negatives[/b][/th]\n[/tr]\n[tr]\n [td]🟩 Fun, fast-paced gameplay that requires learning and strategy to master.\n\n🟩 Hundreds, if not thousands, of possible combinations of skills and abilities to blend in your journey for discovery.\n\n🟩 A soundtrack that absolutely shouldn't have hit as hard as it did. \n\n🟩 A unique art style that doesn't diminish the game but gives it noticeable character and personality that is often hard to capture in games.[/td]\n [td]🟥 Runs do become boring after a while, with only the odd thing changing or a bit of storyline across what can be a 45-minute to an-hour run. [/td]\n[/tr]\n[/table]\n\n[table]\n[tr][th]🏆Achievements[/th][/tr]\n[td] A somewhat tricky completion as not many of the achievements are straightforward. I recommend using a guide to complete some of the more vague ones to save yourself some time.[/td]\n[/table]\n\n[h1]Story[/h1]\nHades takes place in the Underworld as you control Zagreus, the son of none other than Hades himself, who has sought to escape his father's realm and seek his fortune on the surface.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3614351173\n\nWith the assistance of your mother, Nyx, Zagreus has gained the attention of Olympus, and the Gods there are offering their aid to his plight as well.\n\nWith countless foes ahead and the aid of the Gods, Zagreus must fight through the layers of the Underworld and seek his freedom at any cost. But what awaits him at the end of his journey?\n\n[h1]Gameplay Analysis[/h1]\n[h3]Traversing the hells.[/h3]\nAs with most action roguelike games, fast, frenetic gameplay and quick decision-making are what help define Hades.\n\nMovement is fluid and simplistic but requires a level of experience to master. Traversing the landscapes can be treacherous at times, so understanding the controls is crucial.\n\nHades is fairly straightforward mechanically. You will face off against waves of enemies within each room and then are given a choice of two following rooms to enter, with their specific rewards for completion.\n\nAt the end of each floor, you are presented with a boss fight that is static for each level of the Underworld, and after this fight, you can ascend to the next level.\n\nDying means you have to start again from the beginning of the run.\n\n[h3]Weapons fit for a God.[/h3]\nIn addition to the colossal amount of abilities and skills, you can unlock and discover across your playthrough. You will also get to choose from a selection of weapons that drastically change the way you play. The starting sword you have is a good all-rounder, but each weapon you unlock will have strengths and weaknesses you will have to discover and overcome to survive.\n\n[h3]Power on speed dial.[/h3]\nThe part that makes Hades unique is the God's power mechanics, each of the Olympian Gods can give you a fraction of their power to use, across a selection of skills, randomised each time to three choices.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3614351557\n\nEach of the Gods has a specific thing they can provide, such as Ares has a lot of offensive abilities, while Hermes can improve speed and dodging.\n\nBlending these with your choice of weapon and playstyle can be a lot of fun, especially experimenting with what works and what doesn't.\n\n[h1]Audio and Visual[/h1]\nNot the most impressive visual experience on the market, but one of the most unique. The art style is chocked full of character, detail and expression that you immediately feel pulled into the story purely based on a visual sense.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3614352429\n\nThe audio is much the same, not particularly redefining anything, but is loaded with its style and personality that it's hard to not feel connected with it. In cooperation with the visual style, these aspects work extremely well together.\n\n[h1]Steam Deck Performance and Specifications[/h1]\nHades performs extremely well on the Steam Deck, and I'd probably go as far as to say that this is a staple for the hardware. At full charge, you'd get two to three hours of gameplay out of it, which is decent considering the style of the game.\n\n[h1]Final Thoughts - Excellent[/h1]\n[url=https://steamcommunity.com/sharedfiles/filedetails/?id=2529084785]Review chart here.[/url]\nHades is a phenomenal game that plays extremely well and consistently provides a fun, fast and frenetic gameplay experience that is loaded with character and story. Aiming for 100% completion does weigh the game down considerably, but the general experience with the game was nothing but high. I definitely recommend this game to anyone who is a fan of good stories, roguelites or unique art styles.\n\n[quote]Ransacking the Underworld can become extremely tiresome, so head on over to, [url=https://store.steampowered.com/curator/43064204/] Hell, Purgatory and Paradise[/url] to get the peace you long for.[/quote]",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Really fun gameplay loop. character interactions are really entertaining and the voice acting is so nice with the OST! scaling difficulties make it a fun gameplay loop and really keeps it from getting stale!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Hades is very epic. I can't wait to play the sequel.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay slaps. Soundtrack slaps. Art style slaps. Even the menu slaps.. If you love Greek mythology, this game is an absolute treat. for me its 9/10 game. \r\n\r\ncan’t wait to beat my grandad in the next title.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a good game but ever time I see the title I think of \"WATCH OUT LADIES HERE COMES HADES\" from some MAD sketch on Cartoon Network",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a bit grindy at times, but the gameplay is better than I expected once you get rolling. Boss fights are a tad more cerebral than others of the genre, and you should expect to get this on the second go. \r\n\r\nUpgrades are steady, but slow. If that's your bag, you'll love it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]“Supergiant Game’s first take on making a heavy action roguelite game. Can it break out into the surface or should it be put in the deepest pits of Tartarus?”[/h1]\n\n[hr][/hr]\n[h2]Presentation and Narrative[/h2]\n\n- Supergiant Game’s take of the Greek Mythos is a great one.\n- Beautiful looking Graphics. Art is great. Movesets are easily making every enemy move and reaction readable.\n- Even though this is a roguelite game, the House of Hades always seems lively with new dialogue each time you visit. This make this game feel really alive. I don’t know how they have done it but I am really impressed!\n- Music is Great. Not just the music too, the songs as well.\n- Sound Design is superb and I really like it as well.\n\n[hr][/hr]\n[h2]Gameplay[/h2]\n\n- Addictive Hack and Slash Gameplay\n- Amazing Gameplay Loop.\n- The mix of your Boons, Weapons and even different aspects of your weapons can make every run unique.\n- Once I’m in a run, I’m suddenly in a trance where I don’t even notice how the time flies.. I once played until 4am and I had work the same day!\n- Playing with a Controller is Highly Recommended. I played this mainly on a controller across all weapons. (yes, even with Adamant Rail)\n\n[hr][/hr]\n[h2]Technicality and Value[/h2]\n\n- You can see how Supergiant Games learn from their previous games, You can see the influence of Pyre, Transistor, and Bastion into the making the game. Learning from their past games.\n- Goes Cheap on Sale!\n- Great Regional Pricing\n- Rated Platinum on the Steam Deck!\n\n[h1]FINAL SCORE: [b]🌕🌕🌕🌕🌕 - 5/5[/b][/h1]",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I didn't want to play this overhyped game, because generally I don't like slashers and disfavor soulslikes. But in the end Hades happened to be the best thing on my SteamDeck during vacation. The game really has a finished and unique feel masterfully driving a player into unirritating grinding and having fun from dying. Good job devs!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I tried to resist the temptation of playing this one again before Hades 2 and I said again because I did Platinum (100% achievements) on PS5. Now here I am, playing it again, trying to hit the 100% achievements again here on Steam. Somehow this game manages to feel unique every single time. The art, the story and the gameplay is perfection. Can't wait to get all the achievements and hopefully Hades 2 is as good or better then this one.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hades is a fast and fun action game where every run feels exciting. The combat is smooth, the weapons are satisfying to use, and the story keeps growing each time you try to escape the Underworld. The characters are memorable, the visuals look great, and the music fits perfectly. It is easy to pick up, challenging in a good way, and very rewarding to play. Excited to jump into Hades 2 now!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I finally got my mom back from the surface, and now I can escape the Underworld as many times as I want. Life’s been pretty good down here lately — not much to complain about. At this point, I’m just collecting ambrosia so I can keep courting Meg. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I am a gay little boy from Modesto, California. The week i had access to this game was the best week of my life. Alas, after a horrible divorce, i was forced to be removed from the Steam Family from which i had access to this video game. I hope and hope i can gather the Two-Hundred and six thousand rupiah necessary to purchase this Video Game for my own. God bless",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades is one of the most replayable games I’ve ever played. Every run feels different thanks to the shifting Boons, weapon aspects, and room layouts, and even after countless attempts, the game still finds ways to surprise you.\r\n\r\nThe reason to keep coming back to Hades isn't just the thrills you'll get battling through hell, but the characters and stories you learn about along the way. The game rewards persistence not only with better skills and builds, but with new dialogue, evolving relationships, and deeper lore that unfolds run after run.\r\n\r\nThe combat is fast, smooth, and incredibly satisfying, but what really elevates the experience is how alive the world feels—even in the underworld. It’s rare for a roguelike to make you care about the entire cast, but Hades absolutely nails it.\r\n\r\nIf you love tight gameplay, meaningful progression, and a narrative that grows the more you play, Hades is easily a must-buy.\r\n\r\nJust one more run? Always.\r\nWhen will i beat this game? Soon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the story, every conversation have great voice acting and match with every character in this game, this is the selling point in this game.\nOverall the story is simple but still challenging but easy to build.\nThe true ending truly satisfied me! \n\nVery recommended! (9 of 10)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute masterpiece of a title. The gameplay is fluid and intuitive, and the way that the loop is woven into the narrative is sublime.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is addictive to say the least. This is the type of game you'll start playing at 8pm and stop playing at 3am. The graphics and story line are amazing and this is easily one of my favorite games i 100% Recommend this game to anyone who loves grinding type games but still with high reward!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades ! The game offers the most fantastic and wonderful experience ! A true piece of art ! Awesome fights ! (with different styles ! you can choose your favorite ! ) Absolutely amazing soundtrack ! wow ! Also the vibrant colors ! Magnificent art on the characters ! Outstanding voice acting and Impeccable storyline too ! A must have on the hall of great games and certainly a favorite with guaranteed fun !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After playing Hades, I’ve learned two things:\n1. I will never have the cardio of Zagreus.\n2. I have absolutely no self-control when a game tells me “just one more run.”\n\nThis game convinced me that dying repeatedly is not failure, but actually “progress.” Honestly, that’s the kind of positive reinforcement I needed growing up. Every time I got smashed by a giant crystal or turned into a pincushion by soul-catching ghosts, the game just patted me on the back and said, “Nice job, sport, try again.”\n\nThe characters? All absurdly attractive. I don’t know what’s in the water down there in Tartarus, but if Zeus could bottle and sell it, he’d finally have a product better than lightning bolts.\n\nIf you enjoy:\n- Dying\n- Then dying differently\n- Then dying better\n- And talking to your dad about it\nThis is absolutely the game for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "S-Tier game-play and mechanics, beautify graphics. Overall worth playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I mean the replayability is what sells it, the RNG achievements tho were a bit much but it was all fun. the story, set piece(fk yea Greek Mythology), the music, gameplay, artstyle etc. all earned its accolades, for its price alone or even on sale its worth it, and ive been a fan of the devs since Bastion but this is their best game yet imo, till maybe i finish Hades 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "IM HAVING A GREAT TIME \n\n\nDo I even need to write this review? It’s a classic hack and slash game with funny little moments and tons of sarcasm(I love sarcasm sm) the lore is really interesting, a very accurate to Greek mythology. It’s a common go to when I wanna play on my steam deck and one of my favorite rougelites. \n\nThe goddesses are also kinda ho-\n\nseriously though. \n\n\nIf you’re not getting HADES or HADES 2 you are MISSING OUT. 8/10 (I only say 8 bc I’m a horror nerd so It’s not exactly my favorite)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly just a really fun game. The combat feels great, the progression is satisfying. I’m still playing it and I’m enjoying it a lot — it’s really fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9/10 Peak gameplay, sound and story. Gets a little repetitive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing plot, wonderful play style, so many unique voice lines, hot Gods/Goddesses....what isn't there to love?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Such a cool game. Its perfect in every way story, art, gameplay, equipments, replayability, difficulty level. This game will always stay in my pc.  In case of bugs, very rarely it crashes out to desktop when in loading screen, but its not a big deal because the progression is saved.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Third playthrough of this game (on other consoles and such) and it doesn't get old. Great action roguelike, one of the best out there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Greek mythology AND a rogue-like? \r\nboth the progression and story are amazing and i also really like the God-mode since it can help with my skill issue, this game is just straight up peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has a unique and creative story. 94 hours and I'd keep playing this game over and over just to uncover more of the story. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Almost 100 hours in and still want more. Supergiant Giant Games delivered well this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing, Profound, dare I say PERFECT. \r\n\r\nHades was my introduction to roguelites and it's exactly what a roguelite should be. I've played this game back when it first released on PS5 & Nintendo Switch but I recently bought it again on Steam and I'm so glad I did.  \r\n\r\nHades is the perfect blend of great gameplay, good music, and a compelling story. If you're into Greek Mythology and don't mind dying a lot at first, this is indeed the game for you my friend.\r\n\r\nWill definitely be buying Hades II.\r\n\r\nBefore you buy just remember \"There is no escape...\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everyone in this game is way too hot for their own good.\r\nExcept Thanatos. He's just alright.\r\nAlso, the game is fun as hell.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy the storyline as well as the roguelike style of gameplay. I got it on sale for $4usd and think it is very much worth it. I'm 19 hours into the game and haven't beaten it yet.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very entertaining, dynamic, challenging, and the visuals are very aesthetic. Incredible! Fun game :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not only is this game good, but getting 100% achievements is actually fun? Wild concept.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best roguelikes ever, with enough difficulty that \"god mode\" feels like normal difficulty while normal feels like actual hell;",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a fan of Supergiant games, and this one is probably the best I've played, but I've also played enough that the formula of an isometric rogue-like with incredible production value/story has become a little too familiar. I enjoyed what I saw, but don't feel like replaying the same first few dozen rooms over, and over, and over. Worth what I paid, but only a slight recommendation (more for genre fans).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best roguelite game I've ever played. The combat and weapons felt satisfying and has a lot of varieties so you can create a lot of playstyle. Story is good imo, tough I don't really care that much. Every death hasn't felt punishing or frustrating so far I play the game. Music and sound is also good. Nice artstyle. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I sat on this game for almost 4 years, never played. Took a day off work and thought,\n\n\"Hey maybe I should play this, I'll get an hour or so in and see what's what.\"\n\nGenuinely, sat my ass in my chair and played for 10 hours straight, instantly addicted. Next day I played, nearly beat it, and was so disappointed in myself that I couldn't that I dreamed about beating the final boss in a grand struggle; save the pins and needles in my hands from shoving my elbows into my armrests.\n\nThe last time I did this with a game was Mount and Blade: Warband about 13 years ago. Immediately addicting, gorgeous art and dialogue, and such a polished feel. I used to think I hated roguelites; I'm entering my love-hate era.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the best way i could describe hades is \"roguelike for people that don't like roguelikes\" - despite this descriptor people who do like roguelikes will still probably like the game a lot",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game i've played in the genre, has ruined all other \"rogue-likes\" for me -- and besides being a great game, it's a real work of art\r\n\r\n10/10, would get sucked into again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I will admit in advanced that I played the sequel prior to this, with the intention of simply gleaning the sense of plot and rush out imminently. As the played time corroborated, I was enthralled, in the most positive way imaginable though by the magnificent ambient of the game. It will only do it unjust to dismiss it as a mere masterpiece of game level design or a roguelike epitome, despite ascribed accurately, since its splendor resides in between the careful organization of the plot with the concise and delicate game play design. That is to say, and please don't be disguised, this game is as good in its game mechanic as in its narrative affinity, but both aspect is merely prosaic when compares to the coalesced ensemble of them. The game itself provides sufficient impetus for the merging in the dialogues while the story guide the advocacy for the runs, it is truly rare to find another game that bears even remotely similar sense of balance to that in this game. It really is a bellwether of what a modern video game should pertained. \r\n\r\nThus, for reviews of this game, both focusing on its mechanic and plot would be a remiss, and fall prey to superficially digression. (although the performance and display is beyond perfection and along should be praise worthy for its success) Please play this game, as any aspect of it remains unassailable and inconceivable to you before actually immersing yourself in the underworld and the boundless set backs it entails.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades is chaotic, fast, and endlessly satisfying. I’ve been cursed, blessed, and hopelessly addicted all at once. Somewhere between swearing at the underworld and sprinting toward my next bad decision as I flirt relentlessly with Thanatos, I realized something important: I might actually be a hopeless romantic.\r\n\r\nAnd if that doesn’t prove it… my 700 hours definitely should. I’m basically a part-time god and full-time emotional wreck, and I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came for the grind, stayed for my love and adoration of THANATOS (HE SHALL BE MINE)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slain by REDACTED.\n\nThe game is a blast. The characters are all unique and hilarious in their own way, the story is fun and kept me going for more time and time again. Plenty of different builds, but there is obviously the \"meta\" ones that'll always just BONK. I had a blast running the gauntlet... now I'm gonna go buy Hades II and beat that. \n\nSo, yea... I think you should probably buy the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am going to be brief, this game is one of the best roguelite games I have ever played. Extremely enjoyable in all aspects and so much fun. I recommend it to anyone who likes fast paced action games. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Though I usually dont like repetitive games, this game makes it feel way less as every run is fun and unique. The way they take the story as well makes you more motivated to repeat the run. Even after that it is very much fun unlocking different perks. Probably my only second game on steam to have spent 50+ hours and will be defintely spending more time. Worth the buy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Huge fan of the snappy and responsive combat. Art style is unparalleled. Character designs, music, FX are all best in class. Progression is varied and worthwhile - there's a very reasonable variety of weapons and boons to mix up runs. The story and dialogue are great. Hades is a stunning game - absolute must play for anyone interested in roguelites or top down action RPGs. This is a gold standard game worth more than full price\n\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and challenging, I can definitely see myself logging A LOT of hours in this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Will maybe write an in-depth review once I beat it, but the tl;dr\r\n\r\nIt's a roguelike that does everything right in terms of the genre. While it can get a bit repetitive as all roguelikes tend to do, it tries to break this up by giving the chance to include optional difficulty modifiers on your subsequent runs. Every run feels like a step in the right direction, providing resources to buff your future delves into hell. \r\n\r\nIt's high octane, fast + flashy movements with a supporting soundtrack that is phenomenal. I highly recommend this as a game to play 1-2 times a week and just slowly make your way to the end. Or rush it, if you feel like it, but you might tire on it to quick if you do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is an absolute banger in all aspects. One of my all-time favorites.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Hades is a great game. It can keep you entertained for a while, but it’s also quite challenging and intense. Overall, it’s beautiful and thrilling, though I wouldn’t play it forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never thought I'd give this game looked even mildly up my alley. Bought it on a whim after getting my Steam Deck OLED. Incredibly addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hades is addictive, and I say this as a former alcoholic. The gameplay loop begs me to play one more run, just one more. I want to see what abilities I'll get, try a new weapon, try a new version of the weapon, unlock the story, etc. It's so incredibly satisfying and polished.\r\n\r\nBefore Hades I had played no Supergiant games, but I have gone back and played some Pyre, as well as Bastion, and it's incredible to see the progression that they achieved. It seems like those games were hinting at a grander experience that culminated in Hades.\r\n\r\nI don't know if this is a forever game for me, but I've got over 100 hours between this save and the one on my Switch. I also have 150+ hours in Hades II. Neither have gotten stale yet, and there are mods that I haven't explored yet. I bought this twice, both on sale and I feel as if I ripped off Supergiant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game where you create different builds, defeat enemies level by level, and progress. The loop of restarting from the beginning fits perfectly with the mythology and doesn’t feel bad. However, having to complete it 10 times just to see the ending is a bit too much work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool story, cool artwork, kinda grindy but its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "prior to this game, i'd never played any rougelike games. super good, rlly reccomend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "'Hades' feels like a living myth—every run unpredictable, fun, & full of charm. Zagreus is the perfect protagonist: effortlessly cool, unafraid to mess up, & always ready to try again. And nothing beats cutting through the Underworld with my favorite weapon, the Stygian Blade: Aspect of Nemesis. Every escape attempt writes a new chapter in the Underworld Prince’s ever-growing saga!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't think this game was for me! I was proven wrong. \r\n\r\nFirst notable feature: THE ART. Holy smokes is the art in this game amazing! I love all the voice acting and the variations of it-- I don't think I've ran into the same lines.\r\n\r\nWhile I'm never typically a fan of hack and slash games, this game maintains a nice balance by breaking up the combat with story progression. There are so many different fighting styles as well! The game also introduces great strategy through your choices in every run, as items are randomized, and you will have to decide what to prioritize.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first time playing rouge-lite/rouge-like game, and so far I am loving it! This game is designed in a way that you need to die multiple times to know the lore better but that doesn't mean you have too die (though you will for sure many times ! xd )You play as Zagreus who is attempting to escape the underworld which is ever-shifting (procedurally generated) by defying his father. On this journey of yours, the Olympian gods will assist you for you attempt of escaping the underworld. Each time you die you get to manually interact with the characters in the house of hades, which helps you understand the lore and characters in depth and also the characters will react to your death (like the way you died or by whom you got destroyed ), This game is very fast paced, hack and slash style, dungeon crawler rouge-lite with polished, no software bugs or glitches experience ( but there are bugs in-game though pun intended ). You will have an absolute blast playing this game, 101% recommended ! Also you will get the Music Kit \"Darren Korb, Hades\" in Counter-Strike 2 after you have completed 5 Hrs of playtime of this game so be sure to use it and speaking of music, the soundtrack of this game is an absolute masterpiece of art. Especially the main menu theme of this game is one of, not thee best among the games I have played ! So go for it and attempt the escape from ever-shifting underworld",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fought my way out of Tartarus, survived Asphodel, cleared Elysium, and finally faced Hades... only to get sent right back home. And I immediately started a new run.😀Hope I will complete this game someday.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of, if not the greatest roguelike out there. if you like roguelikes and haven't played Hades yet what are you doing with your life? Extra + for being greek mythos themed. 10/10 would buy again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, it’s so addictive! It took me 36 tries to beat Hades at first, but now I can beat him easily.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My personal favourite dungeon crawler game. Took me about 75 hours to hit 70% of achievements. The game is a grind but it is super fun and amazing story dialogue. \n\nWould recommend this to anyone who likes these type of games 👌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OK... I have MANY things to say... mainly in the pros and cons of this game... don't worry this is NOT a jab at the game but holy literal hell this game is a doozy... onto the pros and cons... going to take a LONG break before I play Hades 2 thats for sure...\n\nPro 1: Replayability... seriously its BUILT into the game... every time you die, you come back with various items from your trips through the location of Hades, mainly Tartarus, Asphodel, Elysium, and finally the Entrance to Hades... mainly you have to get by a LOT or if your lucky, VERY LITTLE to get to the surface... I'm no speed runner but managed to beat the game once near the 20 minute mark, pretty sure speed runners are laughing at that time since they normally would just zip by things...\n\nCon 1: The List of Fated Prophecies - mainly this isn't a con persay... it has a LOT of goodies so you SHOULD be going for them but the main issue... THERE IS NO QUEST TRACKER IN THE GAME... mainly when on a run if your trying to go for a specific fated prophecy you HAVE to remember them after looking at Zagreus's desk...\n\nPro 2: Side Quests - Mainly you HAVE to save a LOT of Nectar and Ambrosia... especially for the Epilogue but that's for its own kind of thing later... for now you have Nectar to save for to gain hearts with MANY NPC's... again its own kind of list after this...\n\nCon 2: Conditions for main story end and epilogue - now I'm not knocking the Epilogue but... *BREATHS IN* This games epilogue Epilogue is good in many ways but HORRIBLE in others... first off you HAVE to beat the main game 10 FREAKING times!... if your having fun you will enjoy this... THAT is the easy part since all you have to do is kick Hade's ass!... the God not the location... but thats not the main con of this... no... the main con is simply this... you NEED A TON OF NECTAR and AMBROSIA to gain full trust fo 6 of the 8 Olympian gods for the Epilogue ending after unlocking their 7th heart since those are locked until specific conditions are passed... I'll save you time by explaining each...\n\nZeus - Mainly talk to ALL Gods until they give their opinions on Zeus, after that, wait till Zeus says something on reconnecting with Hades and Hades response after... after that, 6 Nectar and 1 Ambrosia\n\nPoseidon - Simple... fish... fish in the Underworld like you never fished before... when you think you fished enough... fish some more... I'm not kidding... have Fish in your inventory after 18 fishes are acquired and have at least ONE on your person to unlock the 7th slot... after that you talk to Poseidon and again... 6 Nectar and 1 Ambrosia... you can sell your fish to the chef in the House of hades afterwards so profit!\n\nAthena - Mainly exhaust her dialogue on her complimenting your strength, should unlock after awhile and when you do... 6 Nectar and 1 ambrosia...\n\nAres - Mainly slay 10,000 enemies and make sure to give 6 Nectar and 1 ambrosia, its in the list of Fated prophecies but when I got it, already passed that mark by a mile... mainly should happen automatically more or less if you have the blood vial in your inventory as well... honestly bit hard for me to remember after who knows how many runs.\n\nArtemis - Mainly exaust Artemis's dialogue on her talking about her partner, Callisto, once you do, automatically unlocks the 7th slot, 6 nectar and 1 ambrosia.\n\nHermes - A surprising 8 hearts, Hermes's requires 6 Nectar and 2 Ambrosia but you NEED to max out his Keepsake the Lambent Plume, you don't need it to have any bonuses on it, just max it out to three stars for the 8th heart unlock and what not... little surprised by that...\n\nDionysus - Simply put... BE a party animal... max out the bonds of at least 6 different people, give 6 nectar and 1 Ambrosia to the Drinking God himself to more or less get on his good side... should be one of the latter gods you befriend... he has insane Boons that mix well with others so use him A LOT... guy is your best friend here.\n\nAphrodite - Mainly max out your bonds with three spacific NPC's, Dusa, Thanatos, and Megaera or Meg for short and trigger three different dialogs with the Goddess... you'll need 6 Nectar and 1 ambrosia for Aphrodite after as well...\n\nDemeter - Surprisingly the easiest to complete for the Epilogue ending after you unlock her after your first ending run (by that I mean you have to beat the game ONCE for her to appear), just give 6 Nectar, after that well if you play the game more, one Ambrosia...\n\nEnough said people you have your list... its up to you on how to save up ALL that Nectar and Ambrosia but know that its a grind in hell itself...\n\nTo make a meme of sorts and from a youtube channel's video... here is something perfect for this game:\n\nSisyphus!... I understand!\n\nThe definition of Insanity is doing the exact same thing over and over again... expecting different results...  THIS game is the literal personification of bashing your head against a brick wall and sooner or later your head breaks or the wall will... in this case... the wall broke... after 50+ runs against it... you CAN break the wall with enough effort... but you will be put through literal hell in doing so... I both love and loathe this game and I recommend it for all who enjoy the Greek Mythos with subtle changes here and there and boy oh boy if you like Rogue-likes... I love it but damn I'm burned out... until I play Hades 2 and stuff not playing a game like this for a bit... again I believe my hours and time was well worth the price but damn was I put through hell in a literal and metaphorical sense... for now I must rest... but while this review may not be seen... I hope it helps a small few because damn!... some conditions for some NPC's be insane...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More depth to the game than meets the eye. Very fast-paced and addicting gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic music, voice acting, plot and gameplay. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best roguelik(t)e ever made, no question. the combat, the music, the bosses, the mythology, just amazing all of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, it's hard to grow tired of even after the main quest. Would recommend playing all the side quests as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First Rougelite I've played. Originally got it because im a fan of Greek Mythology. Absolutely love this game and the grind. The art direction is great too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wouldnt it be funny if he said in the name of hermes instead of hades when he gets hermes blessing? hahahahahaha! anyway play the game idiot. this game might be 10/10 lowkey and im strict w my ratings",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good entry to the genre for casual gamers.\nDoing run after run may sound like they would get boring quick but the different combos of boons and the dynamic dialogue system helps to keep it feeling fresh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the art and the gameplay it's very fast and cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just hard enough to make it a challenge with every play through, but also just easy enough to not feel impossible to get all the steam achievements.  There's no way I'm getting that last statue though lo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I cant get enough of this game. I love the story and how many possibiltys I can beat the game. I really enjoyed every aspect of this game: music, art style, story, fights, humor, upgrading my home. Everything is amazing. If you enjoy roguelikes I highly recomend 10/10 <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a good roguelite. there's a lot of content, although the weapons do kinda get old real fast.\r\n8.5/10 because of the fact that many runs are very similar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my biggest problems with rouge-like games has probably been that death feels too punishing, sending you all the way back to the start. But this game so far has hardly felt repetitive at all, every run feels different since the game throws new enemies, boons and characters every so often. Makes every death feel way less frustrating. Overall, good game, very fun to play 9/10 would recommend to any rouge-like fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm absolutely loving this!\nI went into this as an avid tboi player that refused to play any other roguelikes. Honestly, my 8 or so hours of playing Gungeon traumatized me too much to give any other game in the genre a chance. Well, Hades is my form of healing I suppose. Incredible art style, fun dialogue and gameplay I got addicted to after a couple runs. I already feel myself getting better at it despite still being in the early game.\nTotally recommend :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hades is a perfect example of what video games should provide for gamers. Amazing fast gameplay, amazing boss fights, amazing quests, amazing details, amazing progressing story and different variants of character builds every run. Nonstop entertaining. Even though each run has same mobs and same bosses, each run is unique because different character builds, weapons, weapon aspects and keepsakes completely changes the gameplay. Prevents you from getting bored if you don't do the same build each run. Game has really good character designs. I loved all of characters. They are well written. You can also romance some characters. It is a perfect story about the rebel son of hades. Hades has a perfect satisfying ending and it has a perfect true ending that ended the plot without any questions in my head. Zagreus is a perfect protagonist we all loved him easily and we watched him achieving his dreams and reuniting his family. He didn't give up and fought until the very end. Great characters, gods, goddesses and heroes from Greek mythology. I really like Greek mythology. I am really grateful from Supergiant Games for making this absolute masterpiece for gaming industry and for gamers. HADES IS BEST ROGUE-LITE IN MY OPINION. And best indie game of 2020. Hades has 93 Metacritic on PC and it totally deserves it. Too many people doesn't know this but Hades is rogue-lite, not rogue-like. It has meta progress. Zagreus can be upgraded after each run by collecting materials during run. This makes each run valuable by upgrading Zagreus. After upgrading Zagreus, you realize you can finish runs easily. So there goes the heat levels that completely changes the gameplay. Hades has perfect difficulty options that provided by heat levels. Although I played 200+ hours of this game I couldn't finish all of heat levels. I give hades 9.5 out of 10. It is a perfect game for killing time and play something high quality. I am not giving it 10 because I would like more overpowered and more builds like they did in Hades II .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun! Not easy but easy to understand and get into!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was never into roguelikes before this game and now I want more that give me the same vibes as Hades. I'm really looking forward to Hades II now! \n\nBut, it'll have to wait until I've got all achievements for this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an amazing game that although I haven't played it long I can already see many hours spent on this fun rouguelite, it is an amzing game and I would highly recomend it to anyone who likes rouguelites or greek mythology.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very good game its tough.. but for those who dont want as much of a Challenge GOD MODE is a GOD SEND for players bad at it .. like me. \nPlay it normally see how you like the game flow.. if its something you really need help with.. turn it on. The story alone is worth it but the gameplay will balance it self. Its that good of a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After I heard about Hades 2 finally coming out of early access, I thought I'd give Hades another shot. When the game came out on Switch, I bought it - then promptly got stuck due to the limitations of the Joycons. Got it on a nice sale, and got to say that after 150 hours, it's an excellent use of that time.\r\n\r\nBeating the game took a long time, but after I beat the final boss the first time, that's when the real game starts. I probably did around 50-60 clears to get all of the achievements, but I could have probably done it faster if I tried to optimize. However, why would I try to optimize? This game is super fun to play with all of the different permutations from boons, weapons, and pact of punishment modifiers. I'd be able to make a lot of my own goals for getting through a run, and even did some light speed-running (18 minutes or so is speed-running for me :D).\r\n\r\nArt style? Great. Music? Maybe unbeaten in terms of the variety of music that is available. Seriously, some of the singing was weirdly good from Orpheus. Themes and storyline about family and rekindling relationships? More wholesome than I realized it was going to be. Theseus being annoying and Zagreus picking up on it and roasting him? Funny. \r\n\r\nMany of the creative aspects of this game should be a standard for what games can do with early access feedback: have a strong core idea, then refine and polish for as long as humanly possible. You can really tell Supergiant took their time with this, and that's why it won a bazillion awards.\r\n\r\nThere are some things that I think could have been explained a bit better to the player. Some of the conversations and side-quests seem to happen in a random order, but to get all of the achievements I had to max out conversations with certain characters. Thanatos, for example, just stopped appearing until another quest was completed, but I was trying to max rank his relationship for his companion buddy. Also,   wish that the weapons were easier to unlock and use earlier on - I finally got some of the sweetest aspects towards the end of the game when I no longer needed them. \r\n\r\nOverall, very important game to set the standard of work that can go into polishing a release - and also just a very fun top-down roguelike that teaches you to stick with it and eventually you can get that same Souls-like gratification out of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that depicts Greek Gods douchebags? CANON\nCount me it!\nEnd on the other hand we have so many characters that live in the house of Hades that a genuinely nice.\nI love Dusa <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game but I'd say not to the extent most reviews praise it. Personally, I don't like the controls. You're incentivized to spam x most times and in the beginning your right click ability rarely becomes useful, if ever. Your worst enemy aren't the types of enemies or their quantity if you play your cards right, but attrition. The healing is like sooo buns starting off. You spend most of your resources getting back health and increasing its cap. Not that it shouldn't be a factor, it just seems overtuned for me. Even playing a game like Enter the gungeon you don't have that much stress getting hit, even though in that game, at least to me it feels you have less health but the ways of getting it back, increasing and mitigating damage are more common. Also can't stand the fat guys on level 1 and the gorgon head with that flying rock on level 2. That's some bull. Otherwise like the progression, enemy variety and challenges. And the art is fn phenomenal. Wish there was like a crossbow that you could \"run and gun\" with but can understand if it goes against the grain when comparing rest of the options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is a reason why this is one of the big icons of rougelites/rougelikes. if you like that genre, it's a must play.\r\n\r\nthe RNG will be your biggest ally and your greatest enemy at the same time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bro, I love this game. I'm a big fan of roguelikes and the story just keeps you playing. I highly recommend buying this!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game cuz I really can pet my [strike]dog[/strike] cerberus!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best roguelike i have ever played, with a really good and engaging story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so good that I've bought & played it on every platform I own. There's nothing quite like it, a journey you really must play and experience for yourself. Can't wait to try out the second one if it's anything like this masterpiece!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun games i played, the story is good, and the combat is fast and skill expressive. i would recommend it to anyone that likes good soundtrack, visuals and great gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anything Supergiant Games makes is high quality and Hades even manages to surpass that.\n\nMusic is top tier, gameplay is addictive and story is great for a die and repeat type of game.\n\nGame of the year material.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended ⭐⭐⭐⭐⭐ (9/10)\nHours Played: (you fill in!)\n\nWith Hades II getting so much praise, I finally decided to check out the original Hades—and with my new Steam Deck, this felt like the perfect time to jump in. Now I get why everyone calls this one of the best Deck games out there.\n\nThe game looks and runs great on both my Deck and PC. The visuals are simple but stylish, with vibrant colors and a unique art direction that instantly stands out. It’s always pleasant to look at, even during the chaos.\n\nThe story won’t rival The Witcher or Game of Thrones, but it doesn’t have to. The writing is sharp, the characters are memorable, the voice acting is fantastic, and every interaction adds flavor to the experience. It’s packed with style and personality.\n\nGameplay is where Hades really shines. It’s fast, smooth, and incredibly addicting. The moment you fail a run, you’re already itching to jump back in. Even with the repetitive loop, it never feels stale thanks to the huge variety of boons, weapons, and upgrades that change how each escape attempt plays.\n\nI’ve been playing it during downtime at work, and it’s become part of my regular rotation of indies and roguelikes. Whether you’re traveling, waiting around, or just relaxing on the couch, Hades is perfect for quick sessions or longer runs. You’ll die a lot, but it never feels frustrating—unlike Souls games, this one doesn’t make me want to throw a controller. There’s something almost meditative about a clean 10–15 minute run.\n\nNo, it’s not a giant cinematic AAA epic, but it’s not trying to be. It’s a stylish, fun, endlessly replayable action game that nails exactly what it sets out to do.\n\nHighly recommended—especially on the Steam Deck. 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "surprisingly a good game. bought this because i was looking for a simple game to play and i saw this game on discount and heard a lot of people talking about this game. at first i feel a bit lazy when i found out that i can only finish the game on a single run without dying and if i die i must restart at the beginning without currency or skills i gathered before, but after several attempts i find this game quiet addicting. A perfect game to end your day after long work. just sit on your chair, chill, and progress little by little (and dont forget to pet cerberus at home)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game teaches how to make gameplay and, most of all, a story evolve throughout a genre focused on repetition: roguelike.\n\nThrough the always new and coherent dialogues and scenes, you really feel like you're progressively getting closer to your final goal, despite keeping dying and repeating always the same path, same rooms fighting the same enemies, while proceeding and improving at your own pace.\n\nThe action component also has so much variety to never feel repetitive and still make you want to try new things (at least for my first 15h).\nHowever, here, I could argue that combat is quite messy, more of a spam of attacks and dashes, because you can't really see clearly what's happening with all those lights, and also, given the high health of enemies, it's clearly a game about spamming rather than few precise blows.\nBut playing feels very good and responsive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so addictive really recommend for those on laptop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maaaaaaan this game is soo sick....\r\nSuper addictive and insanely challenging, yet simple enough to get into easily.\r\nIt's actually not TMI too, which is great.\r\nStory is pretty sweet.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Man, people love this game. And I feel like an idiot posting a negative review, but I just can't get into it.\n\nI am a HUGE fan of Transistor, but I just could not get this game to be fun for me. I found the rogue-like mechanics to be just a little too punishing, the RNG a little too random, progression just a little too difficult, and I never really found something that made it \"click\" for me. I'm not normally a twitchy-platformer type gamer, so I had hesitations going in, but I made it through Basition and SO many people love this game and Transistor was SO good I decided to give it a try.\n\nIt turned out my instincts were right. If you're not into twitchy rouge-like games that - while \"fair\" - are still punishingly hard, you probably won't like this one, either.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "So it's a good game. Probably. \nThe artstyle is great. Definitely.\nI heard that it is a roguelike even for people who hate roguelikes. And that was a lie.\nI don't like boss runbacks, ok? This is like one huge 45 min runback. \n\nI could list everything I don't like about this game. But it would be just a list of roguelite tropes. \nBut every time you unlock one line of dialogue or something like that.\n\nSo it is a good roguelite for people who like roguelites.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "movement and environments feel imprecise\r\nencounter design can be extremely frustrating or way to easy based on what you´re offered\r\nkind of makes it feel more like success is based on luck, rather than skill\r\nquite grindy too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's preface this simply by saying, I enjoyed my first 50 hours with this game. Interesting character dynamics, fun varied combat, challenging but satisfying combat, all around I enjoyed nearly all of that 50 hours; But you wanna know why I have an extra 30 hours? \n\nAchievement hunting, specifically ONE Achievement. Now, I'll be the bigger man and won't spoil what it was, but I'll explain a bit about this game's rouge-like element. Each of the games zones are made out of rooms. Combat, challenges, survive etc. There's a particular type of room called Encounter Rooms. They often give great benefits. Issue is, they're also bloody rare. You can go 10-20 runs without seeing one. To get 3 achievements, you need to find each of the 3 zones encounter rooms and that's not all. Some of these achievements can only be done AFTER finishing the prior one so if you low-ball cant get a certain encounter in a previous zone, you're SOOL for a while. \n\nWorse part is, you can customize the difficulty of your runs, you can make Zagreus stronger or weaker as you see fit, but all that pales to the sheer fact you cant control Encounter Rooms. It's literal RNG baked into the game. So you really can't cheese this outside letting the mobs kill you after wasting 15 minutes into a run.\n\nOverall, Great game but the encounter rooms made it overstay its welcome. Won't immediately try out Hades 2 now its fully released But I hope they did fix this of all things.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you DON'T like roguelikes, you will likely enjoy it (based on other reviews).\nIf you have experience in roguelikes, you will probably NOT enjoy it. Don't buy it just because of the hype (it's a mystery).\n\nHades really puts the LITE in roguelite.\n\nThe art is great. It's the best part for me.\n\nThe story is... I don't know, I didn't finish it. Lore is given in tiny bits of dialogue after each run. While it's nice to have a lot of voiced lines, it's just too much filler. From what I've seen, there's not much intrigue either.\n\nGameplay gets boring after several hours. There are fixed room layouts with the same enemies, very little gameplay variation. The most you can do is try different builds, but they all function mostly the same (basic button mashing).\nAfter completing one almost-full run, I just couldn't force myself to do it again. And from what I've heard, you have to do 10+ complete runs just to get the full story.\n\nP.S. Rant:\nHonestly, I'm sick of everyone talking about roguelikes. It's my favourite game genre and Hades is kinda giving it a bad name.\n\"If you don't like it, it's because roguelikes aren't for you.\" \"It's grindy, but roguelikes are supposed to be grindy.\"\nNo, guys, roguelikes (or lites) are NOT SUPPOSED to be grindy or boring! That's the whole point of being replayable! I have hundreds of hours in other roguelikes, but Hades isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[b]I wish this wasn't  a roguelite.[/b]\n\nIf this game stopped being a roguelite, this would be so much better game. If either:\n1) It added a checkpoint system every few levels so you don't have to start from the beginning again.\nor, 2) It got rid of all upgrades and unlocked all abilites and weapons from the very start and ending this game was purely based on skill.\n\nEither one of those and I would be actually playing the game to the end because it's such a cool game to play with especially on a handheld. In the current state I can only recommend it if you get someone's save file or a mod that does either of the above two things, otherwise I don't recommend any roguelite and that includes this game.\n\nRoguelites have blown up in popularity but people have forgot how little dopamine hits every now and then can be really addicting and can really suck you in and just feels like you're progressing or having fun while inside your head, you're just agitated, nervous and fucking terrifed of dying in a video game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I went blind coming back from other Supergiant Games and this one took me by surprise.\n\nIt is a roguelite, so by nature it is grindy. Although in theory you can beat it at the first try, most players will play dozens of runs before beating the final boss and they will repeat even more for true endings, and unlockables.\n\nHowever, Hades differences between runs feel  fairly minor. Updates are boring,  most of them are small improvements in health or damage,  poison vs critical damage, etc. Enemies feel to have too much life and need  plenty of button mashing. And unlock new things takes too many runs.\n\nIf you do not mind repetition and grind, this might be for your. Otherwise avoid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is both a really good game and a bore. There's no issue with the difficulty, just with the rate that you earn currency. It would also really be helped by more variation and more innovative enemy attacks. I'm torn on whether to recommend this because it's really good for a few hours, or to not recommend it due to it being a tiresome grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don’t understand all the positive reviews. Graphics are good and it’s a Cool concept but it’s repetitive. You die, you don’t progress, only to get stronger, and then replay everything. Rinse and repeat.  Stuff like this gets boring fast.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Pros:\nAwesome game! The best roguelike i've ever played!\n\nCons:\nTo much \"modern audiences\" elements",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good presentation and story. Boring combat, and terrible rougelite.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Simple, cool and fun round-based game, its like God of War Valhalla. I am giving a thumbs down because the game SIFU plays similarly but is 10x better. SIFU did not get the recognition it deserved. Play that instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's alright, but it definitely doesn't deserve 98% positive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shame Steam only allows a positive or a negative, cause I would leave a middle thumb if I could.  This game is ok.  Its way over hyped though.  Once I finally beat Hades, I had no desire to continue with the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is good if you really enjoy rogue likes but its just too grindy and repetitive for me.\ncharacters, story, art, and combat are all very very good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a fully negative review, but the grind needs discussing...\r\n\r\nI beat the run for the first time after 20 hours. After another 10 hours I saved an important character.\r\n\r\nAfter that? 35 hours later I am still hunting for fucking stupidly padded and grindy achievements that require absurds amounts of items to do. ABSURDS I TELL YOU! And all the events, randomized. While the game requires like 5 of those random random random events that happen once per run randomly, or maybe not. Because is random... Soo annoying.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game made me reconsider women's voting rights.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Casino and random instead of progression.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most overrated slop i have ever played",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "most over glazed rogue like created",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game... gay story tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literal dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "baby's first rogue like",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "balon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "кал",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To me it is very boring. This type of combat is not my thing.\nThe only reasons I would start loosing are: \n1. New enemy that I did not know what it does\n2. I was so bored my attention fell so I would get damaged.\n\nIf I wanna kill stuff as some greek guy, I will go play old god of war games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My good friend recommended the game to me, because I love Diablo. I also love roguelites.\n\nThis game was super fun for the first 4 hours, then felt very repetitive. The different weapons didn't add much to the gameplay and I just felt bored doing the same runs over and over.\n\nDeath Must Die and Magicraft do this kind of game much better. They don't have the story and theme (which I admit, Hades is great there) but the gameplay is so much better.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Man, people love this game. And I feel like an idiot posting a negative review, but I just can't get into it.\n\nI am a HUGE fan of Transistor, but I just could not get this game to be fun for me. I found the rogue-like mechanics to be just a little too punishing, the RNG a little too random, progression just a little too difficult, and I never really found something that made it \"click\" for me. I'm not normally a twitchy-platformer type gamer, so I had hesitations going in, but I made it through Basition and SO many people love this game and Transistor was SO good I decided to give it a try.\n\nIt turned out my instincts were right. If you're not into twitchy rouge-like games that - while \"fair\" - are still punishingly hard, you probably won't like this one, either.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I want to like this game, but it feels too repetitive and one-note for me. Yes, there are a variety of weapons and boons, which alter your attack and defense mechanics, to unlock and explore. However, regardless of what you're using, the gameplay loop is simple -- Attack, dodge the ridiculous amounts of crap the game throws at you, attack, dodge, attack, dodge, dodge, dodge. No matter how many upgrades you collect, you never feel like a powerful character. Attacks barely chip away at the health of all but the weakest enemies, so every fight is a monotonous slog. And each time you die, you get a tiny little bit of story that seems to go nowhere, you put a few points into skill upgrades that seem to make little difference, any you go out and face the same groups of enemies again and again. Maybe the game gets better after hundreds of runs, but I just don't have the patience for that. I was hoping for something akin to the experience of a good rogue-like such as Binding of Isaac, or a good action-RPG like Diablo 2/3, where the experiences changes dramatically based on the items and abilities you find and/or choose. This is not that, so if that's what you're looking for, move along.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I really just don't care for roguelites. Constantly replaying the same bits of content to be strung along with tiny incremental upgrades and unlocks for hours upon hours does not entertain me. I can deal with it when the base gameplay is fun and, well, I don't really enjoy that either. Its very button-mashy and none of the weapons particularly feel nor look good to me. Enemy designs are repetitive and oftentimes more  just tedious than anything else, and visually the game's just kind of a cluster of overlapping particle effect circles.\r\n\r\n\"The story's interesting brooooooo, its totally worth it for the narrative.\" No. If you enjoy roguelikes you'll likely continue to play it due to that and enjoy hearing the couple of lines of dialogue when you encounter a character each run, but again, you're simply being slowly strung along just to essentially hear a couple of paragraphs of dialogue with singular characters, dragged across several runs of the game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not sure what the hype is about. Narrative and art design is very good, but this is a video game not an animated movie or show. Gets stale and boring very quickly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dialogue is good. Gameplay is pretty lacking even for a roguelite..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So it's a good game. Probably. \nThe artstyle is great. Definitely.\nI heard that it is a roguelike even for people who hate roguelikes. And that was a lie.\nI don't like boss runbacks, ok? This is like one huge 45 min runback. \n\nI could list everything I don't like about this game. But it would be just a list of roguelite tropes. \nBut every time you unlock one line of dialogue or something like that.\n\nSo it is a good roguelite for people who like roguelites.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Absolutely good until first few escapes. Talents, boons, mixing things together, quite fun.\n\nAfter that, nothing interesting happens. u can just spike the difficulty for scarce rewards, cosmetics.\n\nIts just dissapointing to get through next escape only to see couple new dialogues aand start over.\n\nAbout 20h to get through, the rest - prepare for grinding to dust. Very stretched-thin. dont want to put more time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "movement and environments feel imprecise\r\nencounter design can be extremely frustrating or way to easy based on what you´re offered\r\nkind of makes it feel more like success is based on luck, rather than skill\r\nquite grindy too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's preface this simply by saying, I enjoyed my first 50 hours with this game. Interesting character dynamics, fun varied combat, challenging but satisfying combat, all around I enjoyed nearly all of that 50 hours; But you wanna know why I have an extra 30 hours? \n\nAchievement hunting, specifically ONE Achievement. Now, I'll be the bigger man and won't spoil what it was, but I'll explain a bit about this game's rouge-like element. Each of the games zones are made out of rooms. Combat, challenges, survive etc. There's a particular type of room called Encounter Rooms. They often give great benefits. Issue is, they're also bloody rare. You can go 10-20 runs without seeing one. To get 3 achievements, you need to find each of the 3 zones encounter rooms and that's not all. Some of these achievements can only be done AFTER finishing the prior one so if you low-ball cant get a certain encounter in a previous zone, you're SOOL for a while. \n\nWorse part is, you can customize the difficulty of your runs, you can make Zagreus stronger or weaker as you see fit, but all that pales to the sheer fact you cant control Encounter Rooms. It's literal RNG baked into the game. So you really can't cheese this outside letting the mobs kill you after wasting 15 minutes into a run.\n\nOverall, Great game but the encounter rooms made it overstay its welcome. Won't immediately try out Hades 2 now its fully released But I hope they did fix this of all things.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you DON'T like roguelikes, you will likely enjoy it (based on other reviews).\nIf you have experience in roguelikes, you will probably NOT enjoy it. Don't buy it just because of the hype (it's a mystery).\n\nHades really puts the LITE in roguelite.\n\nThe art is great. It's the best part for me.\n\nThe story is... I don't know, I didn't finish it. Lore is given in tiny bits of dialogue after each run. While it's nice to have a lot of voiced lines, it's just too much filler. From what I've seen, there's not much intrigue either.\n\nGameplay gets boring after several hours. There are fixed room layouts with the same enemies, very little gameplay variation. The most you can do is try different builds, but they all function mostly the same (basic button mashing).\nAfter completing one almost-full run, I just couldn't force myself to do it again. And from what I've heard, you have to do 10+ complete runs just to get the full story.\n\nP.S. Rant:\nHonestly, I'm sick of everyone talking about roguelikes. It's my favourite game genre and Hades is kinda giving it a bad name.\n\"If you don't like it, it's because roguelikes aren't for you.\" \"It's grindy, but roguelikes are supposed to be grindy.\"\nNo, guys, roguelikes (or lites) are NOT SUPPOSED to be grindy or boring! That's the whole point of being replayable! I have hundreds of hours in other roguelikes, but Hades isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[b]I wish this wasn't  a roguelite.[/b]\n\nIf this game stopped being a roguelite, this would be so much better game. If either:\n1) It added a checkpoint system every few levels so you don't have to start from the beginning again.\nor, 2) It got rid of all upgrades and unlocked all abilites and weapons from the very start and ending this game was purely based on skill.\n\nEither one of those and I would be actually playing the game to the end because it's such a cool game to play with especially on a handheld. In the current state I can only recommend it if you get someone's save file or a mod that does either of the above two things, otherwise I don't recommend any roguelite and that includes this game.\n\nRoguelites have blown up in popularity but people have forgot how little dopamine hits every now and then can be really addicting and can really suck you in and just feels like you're progressing or having fun while inside your head, you're just agitated, nervous and fucking terrifed of dying in a video game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun at first, then I got bored of clearing the same maps over and over again to the point where I stopped trying to progress. I gave up after 7 hours of game play. Glad I didn't purchase Hades 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I went blind coming back from other Supergiant Games and this one took me by surprise.\n\nIt is a roguelite, so by nature it is grindy. Although in theory you can beat it at the first try, most players will play dozens of runs before beating the final boss and they will repeat even more for true endings, and unlockables.\n\nHowever, Hades differences between runs feel  fairly minor. Updates are boring,  most of them are small improvements in health or damage,  poison vs critical damage, etc. Enemies feel to have too much life and need  plenty of button mashing. And unlock new things takes too many runs.\n\nIf you do not mind repetition and grind, this might be for your. Otherwise avoid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is both a really good game and a bore. There's no issue with the difficulty, just with the rate that you earn currency. It would also really be helped by more variation and more innovative enemy attacks. I'm torn on whether to recommend this because it's really good for a few hours, or to not recommend it due to it being a tiresome grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don’t understand all the positive reviews. Graphics are good and it’s a Cool concept but it’s repetitive. You die, you don’t progress, only to get stronger, and then replay everything. Rinse and repeat.  Stuff like this gets boring fast.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Pros:\nAwesome game! The best roguelike i've ever played!\n\nCons:\nTo much \"modern audiences\" elements",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good presentation and story. Boring combat, and terrible rougelite.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Simple, cool and fun round-based game, its like God of War Valhalla. I am giving a thumbs down because the game SIFU plays similarly but is 10x better. SIFU did not get the recognition it deserved. Play that instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's alright, but it definitely doesn't deserve 98% positive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shame Steam only allows a positive or a negative, cause I would leave a middle thumb if I could.  This game is ok.  Its way over hyped though.  Once I finally beat Hades, I had no desire to continue with the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is good if you really enjoy rogue likes but its just too grindy and repetitive for me.\ncharacters, story, art, and combat are all very very good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a fully negative review, but the grind needs discussing...\r\n\r\nI beat the run for the first time after 20 hours. After another 10 hours I saved an important character.\r\n\r\nAfter that? 35 hours later I am still hunting for fucking stupidly padded and grindy achievements that require absurds amounts of items to do. ABSURDS I TELL YOU! And all the events, randomized. While the game requires like 5 of those random random random events that happen once per run randomly, or maybe not. Because is random... Soo annoying.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game made me reconsider women's voting rights.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Casino and random instead of progression.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most overrated slop i have ever played",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "most over glazed rogue like created",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game... gay story tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literal dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "baby's first rogue like",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "balon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "кал",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To me it is very boring. This type of combat is not my thing.\nThe only reasons I would start loosing are: \n1. New enemy that I did not know what it does\n2. I was so bored my attention fell so I would get damaged.\n\nIf I wanna kill stuff as some greek guy, I will go play old god of war games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My good friend recommended the game to me, because I love Diablo. I also love roguelites.\n\nThis game was super fun for the first 4 hours, then felt very repetitive. The different weapons didn't add much to the gameplay and I just felt bored doing the same runs over and over.\n\nDeath Must Die and Magicraft do this kind of game much better. They don't have the story and theme (which I admit, Hades is great there) but the gameplay is so much better.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Man, people love this game. And I feel like an idiot posting a negative review, but I just can't get into it.\n\nI am a HUGE fan of Transistor, but I just could not get this game to be fun for me. I found the rogue-like mechanics to be just a little too punishing, the RNG a little too random, progression just a little too difficult, and I never really found something that made it \"click\" for me. I'm not normally a twitchy-platformer type gamer, so I had hesitations going in, but I made it through Basition and SO many people love this game and Transistor was SO good I decided to give it a try.\n\nIt turned out my instincts were right. If you're not into twitchy rouge-like games that - while \"fair\" - are still punishingly hard, you probably won't like this one, either.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I want to like this game, but it feels too repetitive and one-note for me. Yes, there are a variety of weapons and boons, which alter your attack and defense mechanics, to unlock and explore. However, regardless of what you're using, the gameplay loop is simple -- Attack, dodge the ridiculous amounts of crap the game throws at you, attack, dodge, attack, dodge, dodge, dodge. No matter how many upgrades you collect, you never feel like a powerful character. Attacks barely chip away at the health of all but the weakest enemies, so every fight is a monotonous slog. And each time you die, you get a tiny little bit of story that seems to go nowhere, you put a few points into skill upgrades that seem to make little difference, any you go out and face the same groups of enemies again and again. Maybe the game gets better after hundreds of runs, but I just don't have the patience for that. I was hoping for something akin to the experience of a good rogue-like such as Binding of Isaac, or a good action-RPG like Diablo 2/3, where the experiences changes dramatically based on the items and abilities you find and/or choose. This is not that, so if that's what you're looking for, move along.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I really just don't care for roguelites. Constantly replaying the same bits of content to be strung along with tiny incremental upgrades and unlocks for hours upon hours does not entertain me. I can deal with it when the base gameplay is fun and, well, I don't really enjoy that either. Its very button-mashy and none of the weapons particularly feel nor look good to me. Enemy designs are repetitive and oftentimes more  just tedious than anything else, and visually the game's just kind of a cluster of overlapping particle effect circles.\r\n\r\n\"The story's interesting brooooooo, its totally worth it for the narrative.\" No. If you enjoy roguelikes you'll likely continue to play it due to that and enjoy hearing the couple of lines of dialogue when you encounter a character each run, but again, you're simply being slowly strung along just to essentially hear a couple of paragraphs of dialogue with singular characters, dragged across several runs of the game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not sure what the hype is about. Narrative and art design is very good, but this is a video game not an animated movie or show. Gets stale and boring very quickly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dialogue is good. Gameplay is pretty lacking even for a roguelite..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So it's a good game. Probably. \nThe artstyle is great. Definitely.\nI heard that it is a roguelike even for people who hate roguelikes. And that was a lie.\nI don't like boss runbacks, ok? This is like one huge 45 min runback. \n\nI could list everything I don't like about this game. But it would be just a list of roguelite tropes. \nBut every time you unlock one line of dialogue or something like that.\n\nSo it is a good roguelite for people who like roguelites.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Absolutely good until first few escapes. Talents, boons, mixing things together, quite fun.\n\nAfter that, nothing interesting happens. u can just spike the difficulty for scarce rewards, cosmetics.\n\nIts just dissapointing to get through next escape only to see couple new dialogues aand start over.\n\nAbout 20h to get through, the rest - prepare for grinding to dust. Very stretched-thin. dont want to put more time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun at first, then I got bored of clearing the same maps over and over again to the point where I stopped trying to progress. I gave up after 7 hours of game play. Glad I didn't purchase Hades 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "movement and environments feel imprecise\r\nencounter design can be extremely frustrating or way to easy based on what you´re offered\r\nkind of makes it feel more like success is based on luck, rather than skill\r\nquite grindy too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's preface this simply by saying, I enjoyed my first 50 hours with this game. Interesting character dynamics, fun varied combat, challenging but satisfying combat, all around I enjoyed nearly all of that 50 hours; But you wanna know why I have an extra 30 hours? \n\nAchievement hunting, specifically ONE Achievement. Now, I'll be the bigger man and won't spoil what it was, but I'll explain a bit about this game's rouge-like element. Each of the games zones are made out of rooms. Combat, challenges, survive etc. There's a particular type of room called Encounter Rooms. They often give great benefits. Issue is, they're also bloody rare. You can go 10-20 runs without seeing one. To get 3 achievements, you need to find each of the 3 zones encounter rooms and that's not all. Some of these achievements can only be done AFTER finishing the prior one so if you low-ball cant get a certain encounter in a previous zone, you're SOOL for a while. \n\nWorse part is, you can customize the difficulty of your runs, you can make Zagreus stronger or weaker as you see fit, but all that pales to the sheer fact you cant control Encounter Rooms. It's literal RNG baked into the game. So you really can't cheese this outside letting the mobs kill you after wasting 15 minutes into a run.\n\nOverall, Great game but the encounter rooms made it overstay its welcome. Won't immediately try out Hades 2 now its fully released But I hope they did fix this of all things.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you DON'T like roguelikes, you will likely enjoy it (based on other reviews).\nIf you have experience in roguelikes, you will probably NOT enjoy it. Don't buy it just because of the hype (it's a mystery).\n\nHades really puts the LITE in roguelite.\n\nThe art is great. It's the best part for me.\n\nThe story is... I don't know, I didn't finish it. Lore is given in tiny bits of dialogue after each run. While it's nice to have a lot of voiced lines, it's just too much filler. From what I've seen, there's not much intrigue either.\n\nGameplay gets boring after several hours. There are fixed room layouts with the same enemies, very little gameplay variation. The most you can do is try different builds, but they all function mostly the same (basic button mashing).\nAfter completing one almost-full run, I just couldn't force myself to do it again. And from what I've heard, you have to do 10+ complete runs just to get the full story.\n\nP.S. Rant:\nHonestly, I'm sick of everyone talking about roguelikes. It's my favourite game genre and Hades is kinda giving it a bad name.\n\"If you don't like it, it's because roguelikes aren't for you.\" \"It's grindy, but roguelikes are supposed to be grindy.\"\nNo, guys, roguelikes (or lites) are NOT SUPPOSED to be grindy or boring! That's the whole point of being replayable! I have hundreds of hours in other roguelikes, but Hades isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[b]I wish this wasn't  a roguelite.[/b]\n\nIf this game stopped being a roguelite, this would be so much better game. If either:\n1) It added a checkpoint system every few levels so you don't have to start from the beginning again.\nor, 2) It got rid of all upgrades and unlocked all abilites and weapons from the very start and ending this game was purely based on skill.\n\nEither one of those and I would be actually playing the game to the end because it's such a cool game to play with especially on a handheld. In the current state I can only recommend it if you get someone's save file or a mod that does either of the above two things, otherwise I don't recommend any roguelite and that includes this game.\n\nRoguelites have blown up in popularity but people have forgot how little dopamine hits every now and then can be really addicting and can really suck you in and just feels like you're progressing or having fun while inside your head, you're just agitated, nervous and fucking terrifed of dying in a video game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun at first, then I got bored of clearing the same maps over and over again to the point where I stopped trying to progress. I gave up after 7 hours of game play. Glad I didn't purchase Hades 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I went blind coming back from other Supergiant Games and this one took me by surprise.\n\nIt is a roguelite, so by nature it is grindy. Although in theory you can beat it at the first try, most players will play dozens of runs before beating the final boss and they will repeat even more for true endings, and unlockables.\n\nHowever, Hades differences between runs feel  fairly minor. Updates are boring,  most of them are small improvements in health or damage,  poison vs critical damage, etc. Enemies feel to have too much life and need  plenty of button mashing. And unlock new things takes too many runs.\n\nIf you do not mind repetition and grind, this might be for your. Otherwise avoid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is both a really good game and a bore. There's no issue with the difficulty, just with the rate that you earn currency. It would also really be helped by more variation and more innovative enemy attacks. I'm torn on whether to recommend this because it's really good for a few hours, or to not recommend it due to it being a tiresome grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don’t understand all the positive reviews. Graphics are good and it’s a Cool concept but it’s repetitive. You die, you don’t progress, only to get stronger, and then replay everything. Rinse and repeat.  Stuff like this gets boring fast.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Pros:\nAwesome game! The best roguelike i've ever played!\n\nCons:\nTo much \"modern audiences\" elements",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good presentation and story. Boring combat, and terrible rougelite.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Simple, cool and fun round-based game, its like God of War Valhalla. I am giving a thumbs down because the game SIFU plays similarly but is 10x better. SIFU did not get the recognition it deserved. Play that instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's alright, but it definitely doesn't deserve 98% positive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shame Steam only allows a positive or a negative, cause I would leave a middle thumb if I could.  This game is ok.  Its way over hyped though.  Once I finally beat Hades, I had no desire to continue with the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is good if you really enjoy rogue likes but its just too grindy and repetitive for me.\ncharacters, story, art, and combat are all very very good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a fully negative review, but the grind needs discussing...\r\n\r\nI beat the run for the first time after 20 hours. After another 10 hours I saved an important character.\r\n\r\nAfter that? 35 hours later I am still hunting for fucking stupidly padded and grindy achievements that require absurds amounts of items to do. ABSURDS I TELL YOU! And all the events, randomized. While the game requires like 5 of those random random random events that happen once per run randomly, or maybe not. Because is random... Soo annoying.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game made me reconsider women's voting rights.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Casino and random instead of progression.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most overrated slop i have ever played",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "most over glazed rogue like created",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game... gay story tho",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}