{
  "positive": [
    {
      "review": "Hades 1 was a 10/10 masterpiece for me.\r\n\r\nBut somehow they managed to make Hades 2 a huge improvement over Hades 1 on every level.\r\n\r\nTherefore Hades 2 is technically a 11/10 game.",
      "voted_up": true,
      "votes_helpful": 112
    },
    {
      "review": "Gifted from a friend.\n\nA very worthy sequel to the first game; this has some familiar mechanics taken from the first, but gameplay-wise, you can tell Supergiant has done their homework on what they can improve from an already excellent formula. Many new combat mechanics, different resources, and plenty more to discover breaking into Tartarus, and that's just scraping the surface.\n\nDeath to Chronos.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "The video game is good. That's all for that.\n\nIs It Better Than Hades 1. \n\nOkay, that's a great question, that's the real question. \n\nSo, Hades 2 is a bigger, wider, harder game with a lot more to do do and discover. Truthfully it is Hades 2 & 3 stuck together. But-- if I'm gonna be so real, I think that Hades 1 is just... better? \n\nOkay, so this is gonna have big spoilers. For everything I guess.\n\n[h1] **SPOILERS** [/h1]\n\nSo Hades 1 is this tight really well composed story about a boy and his dad and family and secrets. It's not heady, it's not esoteric, it's classic stuff. The gameplay is quick and snappy. The builds are fun. The zones can be kind of a drag. Elysium is a pain in the ass. \n\nThen Hades 2-- big epic story about you versus Time. CAN TIME NOT BE STOPPED? Then you gotta go to Olympus and FIGHT THE FATHER OF ALL MONSTERS. And it's all this stuff and all these things and its DIRE and SCARY and the tone is VERY dark and Chronos is extremely difficult and-- and then... \n\nAnd then it just stops? \n\nThen it just... stops. \n\nIt just ends. And everyone lives happily every after?\n\nSo-- like... yeah, it just.. \n\nWhen you get to the point of Hades 1 where you're hearing \"In The Blood\" it feels like you've triumphed in so many ways. Your relationship with your family, your dad, you got your mom, your dog... it's so powerful. \n\nAnd in this one you just.. Well, someone ELSE does stuff and then...?\n\nSo, I'll be real, the gameplay is massively improved. The maps are fun. The weapons are different, largely fun. The combat is a bit slower but it feels better. I just don't feel like the story lived up to what I know Supergiant is capable of. This still feels like it's half finished. I don't know. It's worth your time. It's still amazing. It's just... not what it could have been.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "[h2]Hades II [/h2]\n\nAfter the announcement of the second part, I was skeptical. The studio had never made sequels before, and when something is created as a follow up because of financial success, it usually ends up being an average idea with lots of fan service.\n\nI was glad to be wrong, and now I believe that the second part is not only no worse than the first, but it is hard for me to even say what exactly I missed or what could have been improved. Maybe a bit more drama in the ending could have been interesting, but that is a matter of personal taste.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3579464049\nThe mechanics became deeper, there are more of them now, including a greater variety of locations, bosses, enemies, trials, and companions. The game became bigger and higher quality, which is what you expect from a sequel, and at the same time it has its own style and vibe. Personally, I have nothing to criticize the game for.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3605563038\nSome people might be put off by the fact that completing the main story requires more than fifty hours, and finishing all side quests and trials takes over one hundred. But in this sense it is only slightly larger than the first part, and this feels more like its specific feature than a drawback, especially because the gameplay is very addictive. When you get into it, you want to do one more run, and then another, and another, just like in the first game.\n\nThe story structure remains similar to the first part. The plot is built around the family of the main heroine and the special nature of relationships between gods and other beings of the underworld.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3580144772\nYou can say that the game became a bit harder than the first part and at the same time a bit easier. The meta progression offers more build options, and I would especially like to mention potion brewing, which feels very enjoyable.\n\nIt is a pity that this year Hades Two is unlikely to win the Best Indie Game award, although in my opinion it definitely deserves it and is absolutely a strong contender for the title.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "The combination of stunning artwork, banger music, and addictive gameplay absolutely hits the mark. It's the perfect formula for a seriously good time.\n\nThe mad lads actually did it. They made a better rogue-like than Hades.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "what I did: everything\n\nHades II is objectively a great game. Addictive roguelite gameplay which makes it easy to start new runs and keep going, stellar artistic design, incredible voice acting especially considering the gargantuan amount of dialogues, on point music.\n\nI'll say though that maybe at times the gameplay loop and the vibes of the game all felt a little too familiar. Hades II rightly follows the winning formula of the first game but sometime it made me wish we had more diversity, as in the game trying to take a further step away from its comfort zone, even though it's a good comfort zone.\n[spoiler]The surface[/spoiler] was a nice surprise from this point of view and if it wasn't there I'm sure I would have been even a little disappointed with the game.\nThe story also felt a little shaky. I'm aware they fixed the ending a bit in a recent patch but still it felt like the devs had problems managing the narrative and the motives of the characters. Maybe making some dialogues more direct and not so vague would have helped the cause.\n\nAll in all I still had tons of fun and I'm still 100% down to play Hades III if they ever make it, just hope it doesn't feel once again vaguely too familiar.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "There will never be a roguelike better than Hades and certainly not better than Hades 2. Do yourself a favor and play this masterpiece of a game. Its a shame it is up against Clair Obscur as I certainly think any other year this would have a chance to win GOTY. \nOver 70 hours in and I have not encountered a single line of dialogue that was the same, its insane how much more depth there is to this game compared to the first. \n10/10",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Masssive kudos to Supergiant for delivering another brilliant entry into their line of incredible games. I really wasn't expecting all that much from a sequel to a [b]roguelike[/b] of all genres, and I especially wasn't expecting Hades 2 to top the masterpiece that was its predecessor.\n\nSomehow, Supergiant has managed to deliver the same visually stylish, slick, and punchy combat from the first game, but elevated it to levels I didn't think possible. \nThe wider variety of weapons, aspects, and boons on top of different zones made this a really fun experience. Progression also feels faster, which can take away some of that typical roguelike fatigue. \nThe only downsides are IMO, a weaker story and more of a grind to get the epilogue, but the rest of the game is so good that none of that really detracts from the overall game.\n\nDefinitely a recommended play, even for those who typically aren't into roguelikes. But do play the first game first as this is a direct sequel!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Hades 2 is an action roguelike with a heavy focus on story and characters. As anyone can tell you, it’s good.\n\nIt’s quite similar to the first game. You go on dungeon runs, meet various characters during and between them, and there’s a lot of talking - with great voice acting and solid writing. Gameplay-wise, it’s probably better than its predecessor. Builds, combinations, variety of paths and enemies, optional challenges - it’s all there. Unlike the previous game, the character progression system isn’t just a series of straightforward upgrades for everything, but an interesting set of choices in itself. It also looks solid and sounds incredible. The character design is a little overwhelming, I feel (I’ll die on the hill that they should’ve kept Narcissus’ beta art), but it’s not off-putting. It’s good.\n\nI’m less impressed with the story, and that’s an important part of the experience. Supergiant games are usually about subversion and this being a sequel to their previous game makes it a subversion of a subversion. So it ends up feeling rather straightforward and dull compared to the original. It’s mostly a revenge story with clear villains, and many of the storylines don’t fit this tone as well as the first game’s low-stakes, chill premise. Much of it feels forced, as if the developers felt obliged to include characters filling the same roles as Hades 1’s cast but couldn't find a good reason for them to be there. It’s still well written, mind you, but it feels repetitive, and most conversations seem to revolve around mutual respect and sympathy. Too saccharine, you know?\n\nStill, I don’t regret the time spent with this game. Neither will you.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Finally some Hades again! I was almost addicted to the first game and couldnt wait for another serving, once i heard about it. And Hades 2 doesnt really disappoint. Hades 2 is in its world, characters and gameplay features almost twice as big as Hades 1. The new weapons, the inclusion of Magick, new bosses and the new Arcana cards are an interesting and innovative try to keep the gameplay loop fresh and to not copy the first game step-by-step. So that is a great plus. And they achieved just that. Combat also feels great and just as snappy as the first game. \n\nI do have some caveats though.\nFirst, they didnt want to copy the mechanics of certain Olympian gods from the first game. I get that. But some gods' boons just feel so..... characterless. In the first game, i knew exactly in what direction certain Olympian boons would take me. In Hades 2 many of them just feel so mushy. It is hard to explain...\nSecond, not only have the world and the features doubled in quantity, but also the amount of collectable resources, upgradeable items and their requirement to unlock stuff. The grind is far worse than in Hades 1.\nThree, i finished the story in 1.0 and it felt rushed, incomplete and weird. There were quite a few narrative holes. They tried to fix that and did fix it to a good degree in the most recent patch as of writing this review, but to me that was a big no-no. Dont release your game as finished when you have such a directionless story. That was very uncharacteristic of Supergiant. And i am not the only one. I scoured many forums like Steam and Reddit, where also a decent number of people expressed their consternation about that original ending.\nFour, the relationships between the characters sometimes feel either forced or shallow or both. Especially the romantic ones. Exceptions apply, of course. But overall they felt a bit more authentic and natural in the first game.\n\nHowever, despite my negative points of criticism, i am very happy with Hades 2. The game is a ton of fun and i will definitely keep playing the Tartarus out of it, easily reaching the 200 hour mark. If you liked the first game, then Hades 2 will leave you capitivated and satisfied, guaranteed. Even though i would consider the first game to be an all-in-all better experience. But trying to topple the masterpiece that is Hades 1 is an almost impossible feat anyway.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I completely trashed the first part in my review, but I like this game much more. It's hard for me to describe what the developers changed, but now I feel more that a lot depends not only on the build, but also on skill. I understand how to more or less keep randomness under control and collect the boons I need. In terms of gameplay, it's a great game.\r\n\r\nHowever, I still don't understand why there are all these endless dialogues with all the characters in the roguelike, since in 90% of cases they don't reveal anything about the characters and just repeat the same thing in different words, or say roughly the same things about different events. I hate this system of gifts for characters because nectar is rather rare, there is not much of it, and it is also needed for crafting.\r\n\r\nOn Steam Deck - it's a must-have. There's nothing better than quickly launching the game, playing for 15+ minutes, and then putting it aside until you have another 15+ minutes free.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I loved the first Hades - it was an incredibly personal story with great replayability and really enjoyable rogue-lite design. The tight gameplay loop, unforgettable characters and Darren Korb's soundtrack made every run feel meaningful and pushing the story further\n\nHere's how I felt about the sequel:\n - gameplay - it's an upgraded version of OG Hades, refining what already worked and adding meaningful depth - I really enjoyed it and actually prefer more than OG Hades now. Selene's mechanics, the emphasis on spells weapons (a dream for mage fans like myself), new companions and expanded boon variety create incredible synergy possibilities. With so many options, the base game feels easier, but that can be adjusted later for more challenge\n- music and sounds - Darren Korb has done it again. The soundtrack is phenomenal, don't have anything to say, 11/10\n- visuals - it's Hades, but polished. The attention to detail in animations and art direction is impressive without overshadowing the foundation that made the original beautiful. Witch theme is also nuts\n- dialogues - well-written, you don't get tired over campaign + the voiceover also amazing\n\nNot pros, but not cons either:\n- plot - This is where Hades 2 stumbles compared to the original. The story feels less personal, less intimate. OG Hades wrapped you in a tightly, human-scale narrative where Zagreus's desire for truth and connection drove everything forward. Hades 2 swaps that for grand, fate-deciding stakes and paradoxically, it makes the story feel smaller and more generic. The plot beats are predictable, mysteries are non-existent and you end up trudging through a predetermined sequence of events rather than uncovering something. It's serviceable, but it lacks the dramatic punch of what came before\n\n- characters - Melinoe is well-developed with genuine depth and certain characters like Selene, Captain Schmemelus, Arachne and, ofc, Cerberus with Bouldy, are quite interesting. But honestly? Most of the cast feels like they're just... there. They hit familiar archetypes and typical story beats you'd find in every other game. There's little that makes them memorable or unique. Some character arcs even seem to just end right after the quest, without any epilogue for their story line. Compared to OG Hades' roster - where almost every character felt like someone you genuinely connected with - this cast feels generic by comparison. They're not bad, but I won't be thinking about them months from now\n\n///\nDespite the narrative weaknesses, I still love Hades 2 for what it gets right - I even completed 100% of achievements and had fun doing that. The enhanced gameplay, the mechanical depth and the quality of combat make it an exceptional rogue-lite experience. I'll absolutely replay it in future. Supergiant made a sequel that's more fun to play than the original, even if it's less compelling to experience\n\nThe original Hades set an impossibly high bar for storytelling in the genre. Hades 2 opts for bigger ambitions and broader strokes - and while that doesn't quite land narratively(IMHO), everything else is excellent enough to carry it through. [b]It's an almost perfect sequel, just in a different way than the original was perfect.[/b]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Whoever said that 'Let's add Chronos in Typhon fight' im going to find you guys. Overall it's a great game",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Hades 1 was already a classic in of itself, but they truly stepped it up with Hades 2. The character designs are amazing and the new mechanics you get to mess around with are truly a lot of fun.\n\nDefinitely something worth going for the 100% in and a perfect Steam Deck game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "would be better if you could skip all the boring bullshit dialogue and just play the game but they but all of their budget into chaos’ design instead of a skip button\n\ngame is also maybe 60x less ocd friendly than the first so i like it way way way less but its still a good game\n\nedit: after 100%ing this game i like it was less than before and im somewhere in between recommending and not recommending it i dont like a lot of the weapons theres so much replaying bs if u wanna 100% it its like Ughhhhhhhh least medea fine doe",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "2025 oyunlar açısından inanılmaz harika bir yıl. Bu yıl birçok oyun firması, içlerinde adını çok niş bir tür ile  belki de türün en iyi işini çıkartmış olan bir tane firma da var,  resmen gösteri yaptılar. Üst üste, üst üste eğlenceli, kendi türü içinde özel bir deneyim yaşatan eğlenceli oyunlardı ve benim içinde artık yılı kapatan oyun Hades II. Aslen erken erişim olarak çıkan Hades ll şu anki tam sürümüyle oynadığım en iyi rogue-like türü oyun oldu. Çeşitli oynanışı, keyifli boss savaşları, ilginç karakter tasarımları ve eğlenceli bulduğum diyaloglarıyla 2025 yılının en iyi Rogue-Like oyunu ve bu yılın kesinlikle en başarılı oyunlarından bir tanesi. Supergiant cooked again",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Full upgrade to the first game. A few dei gimmicks from the leaving zeitgeist, but all in all solid game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "After a dozen hours, my impression is that Hades II is even better that the original game! I waited until the 1.0 release and expected the high level polish I was accustomed to from the original -- that was delivered. The combat is more tactical, less dash-heavy and less button-mashy. There are a lot more systems in the game that allow even deeper customization of builds. I also prefer the overall color palette, tone and darker atmosphere of Hades II. Only the artwork of the NPCs was slightly better and more refined in the original -- it seems the artist was changed. Hades II still has the same insanely addicting and action packed gameplay loop as the original. I am incentivised to 100% all cheevos, like I have done in the original. It's among the best Action Roguelikes along with Noita, Dead Cells and Nova Drift. Highly recommended work of love!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Marvelous sequel, I've heard many complaints about story, but I am far from finishing it, which I will slowly try to do in next year, so I don't care that much and just enjoying the gameplay from time to time, which is fun but punishing since I am not good rogue-like player, only managed to get to Chronos in 15 hrs and got obliterated by him. Game also runs great on steam-deck and looks beautiful in 1440p on PC.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A great sequel that’s every bit as good as the original. The first game ended for me after 82 attempts, but this time I got to almost twice as many - 170 nights. I think that’s a good result if a game manages to keep you playing even longer - it took me about 75 hours on NS2 - and, most importantly, it still hasn’t become boring.\n\nAt first (or maybe it’s just my age showing), the game seemed really hard. It took me about five hours to more or less get warmed up. From that point on, the game works its roguelike magic and pulls you in for countless evenings. I usually launched it just for one or two runs before bed, but sometimes the randomizer offered such crazy combinations that I ended up playing ten attempts in a row.\n\nI like that there are now two separate routes, each with distinct biomes. Even after that many runs, they never felt repetitive. Though I’ll admit, some traps can be frustrating. This time I even tried the difficulty \"modifiers\" - managed to clear two nights, but the third one still gives me trouble.\n\nThe entire arsenal is viable, and each weapon has its own variations. My favorites were the \"orbs\" and the \"skulls\". I also did a few runs with the giant axe, but it requires way too much dodging.\n\nI barely remember the story of the first game, and if you haven’t played it, that’s not really a problem. The story mostly passed me by anyway - in this kind of game, it’s rarely the focus. Some dialogues are genuinely funny, others perfectly skippable. I didn’t encounter any repeated lines, which is impressive. The art and overall style are once again beautiful [i](though I must say, Aphrodite's new design totally steals the show)[/i]\n\nSo far, I haven’t played another roguelike that kept me hooked for this long. Usually, I beat them once and move on. But this one still pulls me back, and every run remains enticing.\n\nFor its price, it’s an excellent deal.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "there are a couple small things I prefer in hades 1 but in general this game is much better in almost every single way. fantastic sequel. potentially goty",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I spent tons of hours on my Steam Deck in Hades. I've played a few hours of Hades II already and can see I'm going to enjoy this one too. I haven't tried it on my PC as I typically play more graphics intensive games and games that are better on bigger screens on it, but on the Steam Deck this is fantastic.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Woah. I waited until this game was fully out of Early Access to even try it. And wow. Absolutely lives up to the original in every way, in ways I couldn't have even expected to want. Amazing. Incredible. Fantastic game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "You really cant go wrong with supergiant games! I didnt believe they can overdo Hades but I guess they did in all levels!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Я всё ещё люблю Загрея чуточку больше, чем его сестру Мелиною, но игра великолепна! \r\n\r\nЭто всё тот же Hades с забегами, дарами, оружием, хард-модами и обстановкой, только ещё разнообразнее. Боги (и знакомые, и новые) великолепны и отлично нарисованы, диалоги прекрасны. \r\n\r\nБыть может, немного слабоват сюжетный финал, но в целом история — включая традиционную истинную концовку — прописана отлично.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It's Hades 1, but more, and different. It's not necessarily better, but they're both 9.5/10.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Hades II is a perfect sequel. Keeps the core fun spirit of the game but adds more than double the content. Having two tracks to explore keeps it even more fresh. Magick Management adds a whole new layer of complexity to builds. I miss Athena's dash but limiting her boons to one and the removal of deflect and dash spam makes for a more balanced game. Even the weapon variations provide a lot more variety.\nAnd at the heart of Hades II is an incredible story which is so well presented. It has been a beautiful experience falling in love with these brilliant characters Supergiant has crafted all over again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredible game, if you liked the first one, you'll like this one. A lot of the mechanics of the first one have been refined, there's more content, the weapons feel more distinct and as you expect if you know the first game, there are tons of special and unique character interactions. \nI played it after the patch that \"fixed\" the ending, don't know how it was before, but i didnt notice anything that seemed weird or rushed or whatever the critisicm was. \nGreat game, get it if you like roguelites.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If Hades was heroine, Hades II is some sort of magical, gold-laced heroine. Far more eloquent people than I have heaped praise on this game better than I could ever hope to elucidate. Which is probably for this best, as I am going to cut this review short to go back to playing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its not called hades 2 because its a sequel, its called hades 2 because it has double the content!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[b]Somehow, \"Hades 2\" manages to grow, evolve and surpass the original masterpiece. It doubles the number of regions you can explore and introduces fresh ideas, characters, and design elements. Once again, it shines with its stunning art style, brilliant level design, state-of-the-art gameplay, fast-paced combat, smooth animations, outstanding voice performances, and phenomenal music.\nBut the developers didn’t stop there. Their deep knowledge of Greek mythology, immersive storytelling, unique NPCs, and beautifully written dialogue elevate the game into something truly special. It’s not just about slaying foes—it’s about building relationships, uncovering lore, and experiencing a world that feels alive. \"Hades 2\" is another landmark achievement in the roguelike genre.\n\n\nManometer: 9/10[/b]\n\n\nThe good\n- Artistic brilliance. Gorgeous toon-style 3D graphics packed with intricate details. Conversations feature stylish sketch-like character portraits. The color palette is rich, and the world design is atmospheric, spanning eight distinct locations—from the depths of the underworld to the peak of Mount Olympus, literally twice the size of the original game.\n- Great concept. The infinite loop serves both symbolic and gameplay purposes. Each death isn’t just a setback—it’s a narrative evolution. New events and dialogues emerge, making every run feel meaningful.\n- One of the most immersive and deep gameplays out there. It combines close-quarters and ranged tactics with a variety of weapons and upgrades. Casting is not just a complementary mechanic, but opens up diverse strategic approaches. Combat is rhythmic, fast, and satisfying—an upgrade over, the already great, original.\n- Immersive, responsive controls. Every button press feels intuitive and precise. You feel fully in control of Melinoe’s movements.\n- Smooth animations. Visually pleasing and gameplay-enhancing, the animations are fluid and impactful\n- Perfect balance between randomness and linearity. You don't feel lost or bored inside a random generated world because the story follows your actions. Also during each run characters you meet follow the story, remember your actions, can see your weapon, keepsake or boon and comment accordingly. Everything evolves organically with both randomness and logic. \n- High replay value. Each run feels fresh thanks to weapon and boon combinations. Discovering powerful builds—sometimes by sheer luck—is thrilling. Also you can always add some fear in order to make it even more challenging and different. \n- Rich mythology. The developers clearly did their homework. Every character and event is steeped in accurate mythological detail, from gods’ personalities and relationships to obscure NPC backstories\n- Remarkably well written dialogues. Surprisingly emotional and profound for a combat-focused game. Each character has a distinct voice and personality. Conversations remain engaging even dozens of hours in. The amount of dialogues is endless and you keep taking new ones even a lot of hours after finishing the game. \n- Diverse enemies and NPCs. Enemies have varied attack patterns, and NPCs, like ancient Gods, heroes and mythological creatures are creatively reimagined in a vibrant anime-inspired style. Melinoe is a standout protagonist—dark yet kind-hearted. Dora is a charming and fitting successor to Dusa.\n- Animal companions. A delightful addition that also adds gameplay depth.\n- It is well balanced and very rewarding. Early defeats teach you the mechanics. As you grow stronger, the challenge remains, but victories feel earned and satisfying.\n- Fantastic voice acting performances. Some of the voices are really unique and unforgettable.\n- Great music. From tranquil tunes at the Crossroads to intense rock and metal tracks during battles, the soundtrack enhances every moment. Skyla’s story and songs add emotional weight to the musical experience.\n- Awesome, balanced sense of humor. The game never takes itself too seriously, but it also respects its darker themes.\n- Sandbox elements. Decorating and upgrading the Crossroads isn’t essential, but it’s oddly satisfying to create a cozy home for yourself and your companions.\n- Advanced crafting. More complex than the original, with many diofferent resources to gather, incarnations to forge, and even a small farm to cultivate.\n- Immersive design choices. The Arcana Cards system is visually and thematically richer than the original game’s mirror interface.\n\nThe bad\n- Both Hades games have remarkable level design, I cannot stop praising it. Yet, \"Fields of Mourning\" region in Hades 2 is problematic and disrupts the game’s rhythm. Wandering in circles to find boons kills the momentum. I was bored of playing the underworld because of this region. Especially with time control. it becomes so annoying when you cannot find the boons. Exploration doesn't fit this game.\n- Main story events require a fair number of runs, which is fine. But after a point, side stories and dialogue start to feel stagnant. Post-game progression lacks organic evolution—you’re stuck in 20-minute loops chasing minor changes. Roguelikes thrive on repetition, but it needs to be paired with meaningful growth. I 100% completed the game to see everything, but the final stretch felt a bit exhausting. \n- Some frustrating achievements. Some are needlessly convoluted—not due to difficulty, but randomness. The epilogue (finding the Fates) is especially annoying, requiring intentional deaths that random events can sabotage. Other achievements depend on rare spawns with no reliable strategy to increase your chances.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "In the name of Hades, SuperGiant Games, I accept this sequel!\r\n\r\nNever thought the soundtrack could top the first game's OST.\r\nStory is just as good, and the visuals are so much better.\r\nBeen playing since Early Access, it was worth the wait. 147 hours well spent.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Story-wise it's not as strong as Hades, but it god damn excels at everything else. Base customization and build variety are the aspects that get the biggest upgrades in Hades II from a gameplay perspective. Also, the art is insanely good here, even better than in the first game, somehow.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hades was a good game. Hades II is an amazing game - it leaves its predecessor in the dust in every way.\n\nFirst off, it solves my biggest complaint with the first game - the feeling of progression. It got to a point where there was no progression made if a run wasn't successful. In Hades II there is always some progress made - even if it is just a small upgrade. It feels so much better. Yes, there are a lot more resources to gather and keep track of, nut resources come in more often and faster than in the first game. \n\nSecondly, the characters are more memorable and better written. It's not necessarily a big upgrade from the first game, but the best way I can put it is that their implementation and interactions are a bit more diverse. Despite having about double the cast of characters, it doesn't feel like it's too much.\n\nAnother huge upgrade from the first game is combat. Being able to sprint makes combat a lot more fluid, and it really does feel better with a controller. The weapons are much more engaging. In the first game the primary and special attacks for each weapon felt like \"I hit this way\" and \"I hit this way but harder\", respectively. In this game they are very different. In addition, both the primary and special have a charge attack, giving much more potential variety in combat. And to top combat off there is a greater variety of enemies.\n\nThe art for the game also looks better, while retaining the art style of the original. I will say the same of the soundtrack.\n\nI'd give the original Hades a 7/10. It's a good game, but the game does start to hamstring itself up in the late game. I'm farther in Hades II than I ever got in Hades, and I'm excited to play more Hades II. Where I was at with the first game it felt more like work than fun to continue. Thankfully Hades II has kept the spark going, and I can't wait to discover more. Hades II gets a 9/10 for me.i highly recommend this game to every fan of the first game. For those who enjoy roguelights but haven't given these games a try, I still recommend the first game as it is good, but once you start the second game you will never want to go back to the first. If it comes down to playing only one of the games I 1000% recommend Hades II over Hades.\n\nNominated for best on Steam Deck.\n\nNow if you'll excuse me, I have more Time to kill.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Hades 2 – The Greek Gods Still Own My Soul[/h1]\r\n\r\n★★★★★★★★★☆ (9/10)\r\n\r\nIs there really anything bad to say about this game? Honestly, no. Unless you count that it instantly became the standard every other rogue-like fails to reach.\r\n\r\nIf you played Hades 1 ([b]which you absolutely should, do NOT skip it[/b]), this sequel feels like Supergiant looked at their masterpiece and said:\r\n“Yeah… let’s make that but better.”\r\n\r\n[b]Amazing voice acting[/b]\r\n[b]Improved visuals[/b]\r\n[b]Improved combat[/b]\r\n[b]More things to do[/b]\r\n[b]Super engaging story[/b]\r\n[b]Peak Greek god lore energy[/b]\r\n\r\nOne of my favourite, if not my favourite, games ever. It’s like they took everything that worked in Hades 1 and dialled it up to Olympus++.\r\n\r\nI played the whole thing on the Steam Deck, and it ran smooth as butter melting on a hot Greek temple floor. Looks amazing, feels amazing, and of course it plays perfectly on PC too.\r\n\r\n[b]Do yourself a favour[/b]: buy this game.\r\nAnd play Hades 1 first, they go together so well it feels like you're committing a crime if you skip the first one.\r\n\r\nMy only complaint? Sometimes the god dialogue overlaps or mixes weirdly, and I’m briefly confused about what the Olympian is talking about… but it’s rare and doesn’t break immersion.\r\n\r\nI’ve completed the true ending, and like Hades 1, the game politely pretends it’s not actually over. There’s more content, more unlocks, another ending. But after the credits, the motivation dips a bit. I’ll keep playing, but I already know I’ll stop before grinding all the way to the next finale.\r\n\r\nStill…\r\n[b]What. A. Game.[/b]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hades 2 its similar to Hades 1 but everything is better. It has way more content than its predecessor, in terms of both narrative and gameplay. They've polished everything and it feels fucking great (I guess that being on Early Access helped with that). \nI'm not into roguelikes, they are not my thing. BUT Hades and Hades 2 are something else, you feel like you're making progress even if you're not and that feels amazing. \nThe only thing you need to know before playing this game is that... you need to play the first one in order to play it. That's the only \"issue\" if you ask me. Yes, it's a sequel, you can't skip it. Sorry about that.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredibly fun, I feel like the fighting mechanics have improved a lot from the first game.\nCan't get enough of the art-style. 10/10, my favorite pastime since it came out in early access",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Normally SuperGiant doesn't make sequels, but they did for Hades. I kind of doubted how much more they could really do to improve upon the first.\n\nThey did fantastic. A lot more content, a lot more depth to the combat, a lot more story and exploration of Greek lore. Having read and loved The Odyssey, I was quite thrilled with the amount of details they incorporated from it. That's an incredibly niche and nerdy thing, but they put the research and work in to do it and that's impressive.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love Hades 1, it's honestly one of my all-time favorite games, so I was excited when they announced a sequel. Needless to say, Supergiant Games did not disappoint with this one either. The combat feels smooth, the story is great and the OST is amazing as well(the songs of the Sirens in particular are S-tier). You also have great build variety, due to the amount of boon/weapon combos. Also, the boss fights feel much better to me in the sequel.\n\nAll in all a fantastic game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An upgrade on all accounts from the first game.\nIt doesnt pull any punches, from the art style, Music, Character design and gameplay.\nThe story is also pretty good, making you feel the frustration and the weight of others' expectations kinda compel you to keep playing. I also like how they are not sticking to the original Olympian designs and making alternative and cool designs (just like the first but with more characters now). The animations got a HUGE upgrade from the first, everything feels so fluid it'll make you gasp the first time you play it.\n\nAlso the amount of content is doubled if not more, there's just so many things to do and keep track of, and instead of fighting through the underworld, you fight through the underworld AND climb mount Olympus. If you liked the first this wont disappoint.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hades 2 bigger, better, and more challenging than predecessor, combat and customization, larger world, and creative witchcraft abilities more content that offers excellent replay value more time to spend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's not only just more Hades. It's evolution of Hades in every aspect. Story is grander, game is longer (in a good way) and the relationships are more detailed. Could not imagine a better sequel to already great game, but Supergiant always delivers.\r\n\r\nCan time not be stopped?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I loved Hades 1 and it was one of the first games I got all achievements. I have around 160 hours in that game and I currently have double that and I am not even done playing it! I think there was a lot of improvement between games and my only dislikes are just personal preference. Not a huge fan of half the weapons, I miss the bow, I miss the gods that were main stay boon-givers in the first game, and I don't find the NPCs at the base as interesting. Still, despite that, I am having a great time with this game and it feels like I'm getting *more* Hades which is exactly what I was wishing for after I finished playing the first game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "easily the best roguelike i've played. somehow surpassed the first game, truly a masterpiece",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just as good as the first one and even better in many areas. Melinöe as a character is a bit drier than Zagreus but she's also subtler and grows on you. Gameplay is different in small but meaningful ways - it is not enough to transpose your old strategies to achieve victory yet it remains satisfying and rewarding to manage no-hit runs against bosses. \r\n\r\nOne small caveat, though: contrary to the first Hades, this one isn't actually DRM-free and won't launch if you can't connect to the Steam client. This isn't a big deal but when I asked the devs about that change, they clearly sidestepped the question. Transparency is always the best policy in business practices, so I found that response disappointing, especially coming from an indie team.\r\n\r\nThat said, congrats to the team, really a great experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the best new game of 2025. Going off of play time alone this is better than Hades (1). This is how a sequel should be done, if you never played Hades you won't miss any of the story.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "10/10 story\n10/10 soundtrack\n10/10 visuals\n10/10 devs\n100/100 game, no bias, no glazing. worth the full price.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Better gameplay than Hades 1 but I don't necessarily enjoy the weapons as much in Hades 2. They all feel a little more clunky. That said, the art, animations, voice acting, music, and sounds in Hades 2 are all S tier.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hades 2 is an excellent game. It's not perfect, but it's so close you'd be forgiven for thinking so, and the issues are in the very minor region. Mostly what I could complain about is the large pool of potential buffs and some of them being very superior to others(Poseidon boons, for instance, are pretty bad, while Daedalus Hammers and Hephaestus Boons are way better than all the others you can get, and within a given god's pools there are quite some duds compared to others, especially when it comes to Selene's hexes) occasionally leave you grumbling a bit. But after a while I realized that once I had a handful of the metaprogression upgrades, I never really got a loadout I couldn't beat a run with. \r\n\r\nIn fact, on my final run against Chronos I even got a loadout that was the worst I'd had in like ten runs... but I beat the game anyway, so the game is pretty good about making skill more important than luck for the most part.\r\n\r\nMy one complaint about the skill-based gameplay is that sometimes there are so many particle effects, or harmful ones with poorly chosen colours(dangerous gold on a background of gold with gold enemies and gold flooring and gold particles, or a situation where there are both dangerous purple and safe purple things around), on the very last levels that it's a bit hard to actually know what to dodge in all the mess. But outside of my first few runs... nothing run-endingly bad.\r\n\r\nSo, soundtrack? Darren Korb is good, and this is absolutely the best he's ever been. It is nothing but banger after banger after banger.\r\n\r\nWriting? Excellent. I'm not easily moved, but it got me misty-eyed towards the end. Yeah, the writers did damn good work. No notes except please give these people more work because they deserve it.\r\n\r\nArt? Supreme. Gorgeous. So many damn good designs. Polyphemus and the Sirens? Holy damn. Great work. Excellent takes on characters like Circe, too.\r\n\r\nI did find myself not really using about half the armory because Revaal, Xinth and Zoropheth(probably mucked that spelling up) just always seemed to outperform the others, but there's probably some ultra badass speedrunner out there that'll disagree with me and show me how to beat the game in 60 seconds flat with the weapons I considered bad.\r\n\r\nUhhhh. Okay, so, thinking about it, I really only have three serious complaints.\r\n\r\n1: Hecate takes off her hat in the hot springs. Terrible decision, a witch never takes off her hat.\r\n2: No romance with Scylla/the sirens so toxic it turned Oceanus into a superfund site.\r\n3: I should be allowed to give Arachne all my ambrosia because I bet she's an incredibly funny drunk.\r\n\r\nBut yeah buy this game and sing its praises. Absolutely addicting stuff that I had a hard time getting enough of.\r\n\r\nTurns out videogames are actually pretty good.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'll try to keep this review short.  If you liked Hades 1, you will undoubtedly like Hades 2.  The basic formula for the game remains the same - you keep making runs through randomized level segments and fight four major bosses to complete each run.  Hades 2, however, has double the content in that there are two different run paths you can take, one down to Tartarus (The place you always started in Hades 1), and one up to Mount Olympus.  In addition to new boons and weapons in the game, there have been some more fundamental changes to the game, such as the addition of hex abilities, charged attacks, and running, as well as the removal of the ability to make successive dashes, which causes positioning to become far more important than in Hades 1.  The story is interesting, although the ending was not as good as in Hades 1.  Nevertheless, fans of Hades 1 should have no trouble enjoying Hades 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades II was gifted to me by a very generous person whom I'll be thankful for every time I'm playing this game. It's truly amazing and deserves whatever accolades already heaped on it and more. It improves on everything that's already good in the first game, which is not an easy task to do. 2025 is blessed with a lot of amazing indie games and Hades II deserves its place among the best of them.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Some years ago I played Hades 1 and it was fun, but I never finished it. When I tried Hades 2 in Early Access, it immediately felt different: faster, more fun, and more addictive. I liked it so much I stopped right there and waited over a year for the full release to enjoy the complete experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "+ Fantastic combat system\r\n+ Long storyline\r\n+ Exceptional art style\r\n+ Brilliant handling of difficulty and related rewards\r\n+ Lots of regions to explore, each with a unique design, expanding greatly from the first game\r\n+ Weapons are all different, with aspects that multiply the variations in many ways\r\n+ Excellent voice-acting\r\n+ Captivating soundtrack\r\n+ Numerous challenging bosses and multiple challenges that you can experience\r\n\r\n- Slow meta-progression.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Incredible sequel, can not recommend enough. The story flow is perfect and everything from the visuals, sound design, and game play is basically perfect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't know why I didn't rate the game yet. Supergiant only makes great games, and this is no exception. As the first sequel they've ever done, it set a lot of expectations to be better than the last, and it is. The protagonist is decidedly more powerful than her brother from the first game, there's twice as many routes to take, the rare material unlock structure is less cumbersome and restrictive, pets are more than a once-per-battle occasion, I think the OST is longer and all the music is absolutely beautiful (or otherwise exciting), and the content after the first ending seems a lot more satisfying. The \"big\" and \"small\" versions of the protagonist are hilarious. You can try to date your frienemy who thinks you're cute as the small version. \r\n\r\nIn fact the ONLY thing Hades has over Hades 2 is that you have a dedicated singer and musician in Hades and so far I've only got a no-singing musician in Hades 2. C'mon, I wanna make sure everyone knows how the 2nd boss really feels about the beloved protagonist! \r\n\r\nBest game by awards or not, this and the other leading best game of the year would both east Astrobot's lunch if they released last year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best sequels ever, to one of the best games ever. Hades 2 improves upon the mechanics, art, combat, soundtrack... pretty much everything from the first game. I wouldn't have thought you could even improve Hades this much, but Supergiant really did. Gotta be in my top 10 all time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sin duda Hades 2 es un gran juego, aunque me ha decepcionado un poco. Con la trayectoria del estudio, esperaba más innovación, cuando lo que hay es una continuación muy clásica en todos los sentidos: mismas mecánicas e ideas, pulidas y mejoradas, pero sin innovación real. Lo cual no es terrible ni mucho menos, la base de Hades 1 es la de un GOTY así que continuarla y expandirla da como un resultado un juego muy divertido e interesante, que sigue teniendo de las mejores historias contadas en un roguelike. Simplemente esperaba más de este estudio.\r\n\r\nGráficamente es genial, como el anterior, con una personalidad muy marcada en el desarrollo artístico. El sonido sigue al fenomenal nivel de siempre. Y yo al menos no he encontrado realmente bugs en ningún punto.\r\n\r\nEl resultado es un juego muy recomendable, pero que podría haber sido más ambicioso y aspirado a más. Un 9.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has elraen levels of content! Definitely one of the most raene games of the year!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Hades but 2. New cast of people is great love the new art. Enjoying the story so far and like the idea of more content for me to reach soon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades 2 is such an amazing game with tons of dialogues, plenty of boon combinations, helpful pets, arcanas, and trinkets, a huge variety of Gods, Titans, Demigods, etc., beautiful art style, fantastic music, and incredible voice acting. The game can have different responses even if you spend hundreds of hours in it. The game can be a little bit grindy if you want to upgrade specific weapons or have a deeper relationship with other gods, but that is the life of rogue-like games overall. \r\nThe story is not as interesting as the first Hades, but I do appreciate that the devs updated the story a bit more with Melinoë and her free will. Combat is excellent, and difficulty can be tuned up more if you so desire. Excellent game overall. Almost 10/10 experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Mythology + Amazing Art + Top Soundtrack + Beautiful Voice-Acting + Tight Gameplay + Fun Progression \n\nMy Game of the Year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Одна из тех игр, в которых просто приятно находиться. Отличный геймплей, интересный сценарий, юмор, красивый визуал и топовая музыка. Все, что было хорошо в первой части, но больше",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I was keeping my expectations modest. The first sequel from Supergiant Games—who knew how it would turn out? I also intentionally skipped the early access phase, so my experience is based on the full game release with almost no prior information.\n\nAnd oh yes, Hades II delivers. There's enough depth, new features, changes, and additions to consider it a true 2.0. I had a slight fear that it would feel more like version 1.5, but no—the more I played, the more I saw the details and improvements in the game.\n\nThe most important aspect for me is gameplay, and it definitely feels familiar but different. It's also much more intense than the original Hades. The variety is higher, and the presence of a second route for runs gives you more breathing room while keeping you in the loop and making replays feel fresh.\n\nHighly recommended for all Hades fans. As for new players—I'd probably advise starting with the first game. I think playing in reverse order will not favor original Hades, since this one is a big natural evolutionary step forward from original formula.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everything the first Hades game was, and only improved upon that much more in this iteration, from music to visual style to combat feel to meta progression mechanics, even build diversity.\n\nNo idea how they'd reasonably segway into a Hades 3, but at the same time, with how good this game is, I can't blame them for thinking about it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What it says on the tin. It's a true sequel. Story, mechanics, character design. Everything is not just improved, but advanced from the first. If you genuinely do not care about the story, yes this game is probably a better purchase than Hades, but it will make going back to Hades next-to impossible. Get both, play Hades until you're done with it, then play Hades 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades 2 is a beautifully crafted follow-up that expands everything people loved about the original. Its fast, fluid combat feels even more refined, and the new protagonist, Melinoë, brings fresh energy to every run. The world is rich with personality, the dialogue is sharp, and the art and music once again stand out as some of the best in the genre. Even in its early state, the game feels polished, addictive, and full of promise. Simply put, Hades 2 is a fantastic evolution of an already amazing formula.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Like all the other reviews for this game say, its everything the first game was and more. More boons, more boss types, more dialogue, more build options, more interesting characters, more replayability. If you liked the first one you will love the second one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "More Hades!\n\nMostly improves upon Hades 1, yet doesn't repeat the first game and has a distinct gameplay feel. This means you really have to play both games!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades II is one of those unique sequels that not only learns from the weakness of its previous game, but also what made it great, and improves in every element whilst not losing the essence of what made the original so memorable.\n\nIn a different year I could see this game sweeping, with its beautiful art style, music, and impeccable gameplay; but equally stepping back what accolade Hades 2 gets or doesn't shouldn't define it. Without a doubt Hades II was the tightest, most enjoyable gameplay experience I had this year. \n\nAlso quick shoutout to this game for having one of the best, most immersive, unique and engaging bosses of all time. Scylla my beloved.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is insanely good.\n\nThe soundtrack, the artstyle, the rogue like gameplay loop and the polish... everything is fitting perfectly.\n\nMy only complaint is, that it has no Co-Op. But that does not mean that the entire game falls apart because of this, it would be an awesome addition! Please Supergiant, consider adding at least 2-Player Co-Op for Hades 3.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2]More of Hades, expanded in many ways, but for some reason didn't grip me  quite as tightly as the first game. Nontheless, 8.5/10[/h2]\n\nJust 100%'d all achievements. It was definitely a slog through much of that. But its still a great game.\n\nBasically, if you liked Hades, this is more of the same.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely one of the best games ever made. All of my criticisms are just nit-picks or \"I love this so much I wish there was more of it\".\r\nPros:\r\n- Gorgeous art\r\n- Ethereal music\r\n- Best dialogues ever written in gaming (most media really)\r\n- Amazing voice actor performance\r\n- Brilliant scenario\r\nCons:\r\n- Sometimes the art is so beautiful and on the front that the gameplay elements become hard to read or outright \"hidden\"\r\n- Number of \"utility boons\" (non-core like attack or cast etc.) feel a bit limited and they start repeating slightly earlier than I would've liked. I think Hades 1 had more side boons but this game has more gods. Perhaps this is a good thing since learning curve is more manageable for a wider section of the players.\r\n- They don't have a device to remove your memories of the game so that you can experience it for the first time, multiple times. Some people would like that I think.\r\nGet it. Play it. Rate it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best roguelike with a good story, recommend both games in the series",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While I am not the biggest fan of roguelike games, I really loved Hades II. Combat is fast and fluid and the boons keep the runs fresh. It can start to feel a bit repetitive but it never stops being fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "From a pure gameplay perspective, Hades II does feel like a proper sequel - the combat is more refined, the new Omega moves add a lot of different playstyles as do the new Hexes. There are also lategame keepsakes that enable a more RNG-heavy playstyle without forcing a given deity (and without making it feel like a self-imposed challenge either), allowing for more diversity of builds in the lategame compared to the first game. Having two biomes also does wonders for variety, although in my opinion the bosses were overall more fun in the first game.\r\n\r\nBut Hades I wasn't just a great action roguelike - it expertly mixed its gameplay with a great story with compelling characters, which was extremely surprising for the genre and made it so memorable. And for everything that isn't strictly action gameplay, Hades II doesn't live up to the expectations. The main story is pretty meh (as is almost always the case as soon as you start using timey wimey shenanigans) but more importantly than that, the sidequests are very disappointing and there's almost no character growth from anyone, nor visible changes to character's situations (like reuniting Achilles and Patroclus). The 'romances' if you can even call them that, are all disappointing and will just make you miss Megaera and Thanatos.\r\n\r\nAgain, the gameplay is very good and just for that, it's an easy recommendation. But the bar was so high after the first one that I can't help but feel a bit disappointed by this sequel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game, like the first, is a great time. Beautiful art, beautiful environments, and fun new changes. I very much enjoyed the gameplay loops in the first game and this is more of that with some slight changes to differentiate the games, as well as playing a new character. It's fun to see old and new characters and how they react to the new circumstances, and to Melinoe as well. Plus, the soundtrack is as incredible as the first, overall a phenomenal experience if you enjoy this type of game, especially if you enjoyed the first.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades II takes the addictive roguelite formula of the first game, adds a few spices with minimal modifications, and delivers an improved execution. So mote it be.\r\n\r\nFor a more in-depth review, please visit: https://ragequit.gr/en/reviews/item/hades-ii-pc-review/",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Takes what you loved about the first game and made it so much better. The boons are more balanced, the music absolutely slaps. Gameplay is great, main story is fantastic, love the new characters and the updates to the others. Played this since Early Access, it's an incredible game, I cannot recommend it enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gotta hand it to SuperGiant, they sure know how to make good games in every aspect.\r\nHades 2 more than lives up to the first one, it's even better. It's even more perfect ; makes no sense.\r\nThank you so much for the journey.\r\n\r\nWhat an amazing year it's been for gaming.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There's really not much to say other than what's already been said. Excellent experience on Steam Deck. Great price for the incredible amount of quality content. Easy recommendation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't tell you how excited I was that Judy Alice Lee voiced Melinoe, I think i bought this game just to hear the voice actors perform I can't lie",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its neat. steam deck doesn't do the graphics justice, it's amaze on biggy screen",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bought Hades 1-  and 100%d the game. Not going to lie, was not a fan of Hades 2 when I first started - as things were more about crowd control than hurry up and kill them as Hades 1 was. But the more I played the more I enjoyed - and just like before, the organic story through getting to know the characters was phenomenal. Not going to stop playing til this deserves it's 100% on my profile as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is BOTW/TOTK all over again for me.\nHades 2 is the better, more polished game in just about every way, but the first part is just special to me.\n\nLike, it's twice the game, you can go up/down instead of just up.\nThere are more significantly different aspects, the weapons play smoother, there are more bosses, more levels, more characters to talk to... I could go on.\n\nI had two minor complaints, one of them already got fixed (some prophecies took way too many steps to complete/low chance to get in the first place(Born to Win)).\nThe other is that bosses will get a shield when they phase transistion, which kind of breaks the flow imo.\n\nThats it, the rest is great, go play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely stellar what SuperGiant are able to make. Story, gameplay, music, atmosphere, and lore, they truly never miss.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing! I'm still enjoying it after finishing it a long time ago, and will start over and do it all over again in the future. It's that good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "More fun game-play, engaging story, and even better soundtrack!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game. I love the voice acting, the content, the gameplay, everything's very well done. However, I thought the story was a bit lacking. After finishing the game, the ending felt a bit rushed. Maybe that'll change in the true ending, but so far I'm disappointed in the story because it has an interesting premise with a disappointing outcome. The gameplay's enough to keep me in still. It's more hades 1, basically.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’ve put 250 hours into Hades II, even putting Silksong on hold just to keep playing—and it was absolutely worth it. Supergiant took everything great about the first game and made it even better: smoother combat, deeper builds, stunning art, and a story that keeps you hooked.\r\n\r\nMelinoë is a fantastic protagonist, the world feels alive, and every run offers something new. Even after all these hours, I’m still discovering fresh combinations and surprises.\r\n\r\nIf you liked the original Hades, you’ll love this. One of the most addictive and polished roguelikes out there.\r\n\r\nEasily recommended.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "5/5 \n\nThey put cocaine in this game, I really don't know what else to say.\n\nNo, but seriously, every single complaint I had about the first game has been amended and improved upon. The gods are hotter, the soundtrack is straight up fire, and the gameplay is so rewarding and entertaining. I couldn't recommend Hades 2 more.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Story-wise, the original still takes the crown, but everything else has been polished and improved to an almost absolute perfection and the phrase \"bigger and better\" describes Hades II quite accurately.\r\nThe option to choose between [spoiler]Surface and Underworld[/spoiler] route effectively doubles the amount of content the sequel provides and it's a treat to explore everything it has to offer - new biomes are beautiful and detailed, new weapons in Melinoë's arsenal are incredibly fun and engaging to play with and their variety, especially with their Aspects' versions, helps to keep every run fresh, bosses once again pose a serious challenge with their unique mechanics and attacks (with [spoiler]Vow of Rivals[/spoiler] turning the difficulty to 11 even for series' veterans), enhanced meta-progression systems once again make even the failed attempts feel worthwhile, and so on, and so on.\r\nHades II marks the triumphant return to the world of Greek mythology for Supergiant Games and after spending multiple dozens of hours in it, I'm still finding new things, new interactions, new ways to play the game and my body is ready to explore all of it.\r\nDeath to Chronos!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is amazing a work of art . It has great gameplay it shakes up combat just enough. It does have its flaws . The story isn't for everyone. It is its own tale and great continuation of the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The sequel to one of the best games of all time is another best game of all time. The only real hiccup is the rushed ending but there's more than enough in the journey there to make any grievances lull.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A stellar roguelike that builds on the foundations of Hades and cranks everything up to eleven. The art style is gorgeous, the game loops are faster and more addictive than ever, the bosses hit harder, and the writing somehow manages to be even sharper and more engaging.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "More Hades , more fun , the formula is still fun and the story is truley engaging and juntifies the loops and the runs.\nIf you liked the fist game youll enjoy this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Didnt think they could improve on the first one. Yet Hades always went beyond expectations and i love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hades II is an outstanding story rich action packed roguelite game. \n\nIf you've played Hades 1, you will enjoy this one too. It's perfectly different and the same at the same time.\nGame progression is about the same with new deep story to live through. There are some new and some old familiar characters in it which create nice feeling getting back into the world of Hades.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Literally the best game I've ever played. Infinite replayability. Extremely satisfying build variety. Almost endless character dialogue, making every run feel fresh. This game somehow managed to top the already perfect Hades, and by a large margin. No flaws. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is your [b] fate [/b] to read this review and pick up the game. \n\nSupergiant Games clearly cares about its players and put love into their games. [b] All [/b] aspects of the first game have been improved upon in this piece of art. The explorability, the resource economy, the pacing of combat, the variety of encounters, the complexity of the story, the philosophical themes discussed and the references to Greek mythology. All improved. Oh and there are not 1, not 2 but 3 massive twists in the game too! This game rewards your time and effort and will make you pause at times to take in the beauty of your journey and experiences. If Expedition 33 weren't released this same year, Hades II would have been my #1 GOTY pick. It goes without saying I had a blast to complete all the achievements for Hades II.\n\nIf you haven't played the first game; this game stands very firm on its own. If you care deeply about story, I recommend first playing Hades I for a complete emotional experience.\n\n[i] Return to Shadow now. [/i]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fantastic follow-up to the beloved original.  Some of it feels the same, but there isn't necessarily anything wrong with that -- if it isn't broken, don't fix it.  While maintaining much of what made the original good, they also overhauled some mechanics, added some new facets of gameplay, and polished the already-satisfying art style a bit further along the way.  All in all, a fantastic sequel.  Not many complaints here.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I want to start by saying that despite everything I wrote in this review, I really liked this game (obvious considering I put almost 40 hours into it in less than 2 weeks). It took a lot of the story and mechanics from Hades and made them bigger and better, was visually stunning, and I enjoyed the character designs and soundtrack even more than the first game. Melinoë is a well-written character and definitely in my list of favorite game protagonists. While I truly did enjoy experiencing the first parts of Hades II, and I fully intend to keep playing it, there were a few things that dragged it down enough that I had to pick not recommended (mostly because there isn't a \"maybe\" or \"kind of\" option). I still recommend playing it and forming your own opinion because some of these things might have just been me.\n\nNumber one, the ending. I've been made aware that the ending I played was the updated \"fixed\" one, and I still think that it seriously does not do this story or its characters justice. I won't go into detail to avoid too many spoilers but it felt incredibly rushed and like it took a lot of agency away from Melinoë, ignoring a lot of the motivations at the core of her character. Your mantra for this entire game is \"Death to Chronos\", and the player is made to feel this through hours of getting taunted and defeated by him, but after one 2-minute cutscene they decide he can be redeemed and he quickly goes from a great villain to a mediocre NPC. I think an ending like that could work and be interesting narratively, but there needs to be more of a setup + follow through instead of a short cutscene straight into credits. It also makes post-game runs less enjoyable because the reasons for Melinoë to be doing them don't make a lot of sense.\n\nNumber two, the progression. At first I really enjoyed the introduction of two paths to take (Underworld/Olympus) as it adds a lot of content and opens up the world more, but the difference in difficulty between the two areas combined with the non-linear progression through them made the experience less appealing. Having to ping-pong back and forth between the two areas to complete the story was frustrating considering how different the scaling was, and with the addition of even more mechanics and materials in this game it was hard to have a consistent build for getting to the final bosses. A lot of it felt like pure luck when in the first game you could reliably get a solid build going most of the time.\n\nThe final issue I had which is incredibly nitpicky and probably just a me thing was the sheer amount of materials in the game. I'm obviously not unfamiliar with grinding to get certain materials since that was a major mechanic in the first game, but the amount of them combined with my previous points on the progression made it frustrating to complete upgrades or even just minor QOL changes from the incantations.\n\nWhile I intend to keep playing this game, I can see the gameplay loop after the story starting to feel like a chore and I'm not sure how many more hours I'll get out of it before I just go replay the first game again lol.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I hate to give this game a bad review but the ending squashed all positive feelings I had for it. The ending was cut short and left me feeling like the entire game was for nothing. It's hard having a game where 'Death to Chronos' was a phrase repeated often and then not being able to get that in any meaningful way.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Spoilers for the ending\n\nI've been seeing a lot of dialogue about how post-patch the ending makes sense, how it no longer comes out of the blue. This is (somewhat) true. There's lead-up dialogue in the final few runs showing a conflict within Mel between the job she was training for her entire life and the desire to find another way. Sure. But ultimately, the bulk of this conflict comes to its climax through a deus ex machina spell that gives the main characters \"memories\" of a life thar could have been. Compared to the gameplay and story leading up to the climax, these memories basically happen off-screen. You see traces of them, but that's it. And that's what compels Mel to 180 on her life's purpose.\n\nThe story's conclusion post-patch might make sense, as the rhetoric around this game now argues, but is that sufficient? What about asking whether the new ending is actually good? What I'd love to hear from the people defending the new ending is what it says to them. What is the story trying to say? To me, there isn't really much of a message. Is it that love is magic and magic can solve anything? Perhaps the story is saying that people don't need to show an ounce of regret or growth for us to forgive them. Or what if the ending is saying that your big brother knows best and you should probably just listen to him? All about equally likely, all about equally as juvenile and unsatisfying, at least for me. After the first game did a good enough job of hashing out a story of familiar abuse and the work required to keep a dysfunctional family together, this sequel leaning into cheap narrative devices and a power of love finale left me cold.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Many people have already pointed out most of the issues, so I won’t repeat them.\nIn short — the dialogues sound like high schoolers chatting in a bar rather than Greek gods conversing. The writing is below average. The music doesn’t hit at all like it did in the first game — it completely lacks flow or emotional pull.\nThe art direction feels borderline vulgar — just compare Dionysus from the first game and the second; no comment needed.\nThere are tons of meaningless mini-games and resources scattered around.\nAs for gameplay — it doesn’t feel varied. You usually end up playing more or less the same build (just picking whatever seems best), and most weapons feel too similar and uninspired. The first game had that magic where each weapon truly changed how you played — shield vs bow vs sword — but here, that spark is gone.\nOverall, a big disappointment.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "[h1]Review of Hades 2, right?[/h1]\nUgh, that's a very difficult question. Yes, this is a negative review after 100+ hours of gameplay. The first part is one of my favorite games and definitely my favorite roguelike. But I have a complicated relationship with the second part of the game. To be honest, I would give it a neutral rating, but Steam prefers extremes. Below, I will try to briefly explain what I didn't like compared to the first part.\n\n\t[h2]The plot[/h2] I didn't like it at all [spoiler] it's some kind of joke, honestly. The recipe is as follows: take such powerful entities as the Titan of Time and the Father of All Monsters and flush them down the toilet. The Titan of Time undergoes a one-minute 'Naruto therapy', and Typhon is simply incapable of doing anything, because we are playing as HADES' DAUGHTER. Not once during the entire first part of the game did I feel such dissonance. Who are we playing for? As the god of all gods?(Yeah, i get the connection between her and Hecate, but still) Zagreus was able to defeat his father with the same help from the gods, but Melinoe would have destroyed the universe if she had received a couple more legendary boons. It's just frustrating, you had so much scope with Kronos, he's the perfect antagonist for roguelike. Why did you have to make him good, why can't anyone be an antagonist in this game? It's not even gray morality, it's just because.  All the characters in the game are good and kind, except for Typhon, but I'm sure if he had been taught to speak, he would have explained that he was climbing the mountain because his children were being killed, and then he would have helped rebuild the mountain. [/spoiler]\n\n\t[h2]Gameplay[/h2] Overall, it's good. It's no worse than the first part of the game in terms of basic mechanics. But here comes into play what the game offers us to entertain ourselves with for hundreds of runs - boons. Maybe it's just my problem, since most reviews of the game are positive. It's much harder to put together a fun build that will blow up rooms than in the first part. I still remember an incredibly enjoyable build through Poseidon with knocking that blew up the room in a couple of clicks. Overall, it's fine, but I felt that the new boons were just less fun.\n\n\t[h2]Characters[/h2] This is also a very subjective point, but I found the characters less appealing. There are many new characters in the game, but they are simply not cool, and I don't like the personalities the developers gave them. Melina lacks charisma; they just made her serious and forgot to give her anything else. Where's my charismatic protagonist with a sharp tongue? The local Dusa, a.k.a. Dora, is a caricature of a girl's best friend... etc.\nAs I said, this is a very subjective point, but if you liked the cool and charismatic characters in the first part, you may be dissapointed as i was.\n\n\tMy expectations are my own problem, but as a fan of the first game, I expected the second one to develop in a different direction.\n[b]My rating for the game is 6/10[/b].",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Mainly dropping this to be a contrarian, but also out of disappointment with Hades 2. Hades 1 was a breath of fresh air, but the concept of a sequel was always an odd prospect because of how the first game was just this thing that was greater than the sum of its parts. Zagreus was fun but sometimes a little too 'modern', sure, but whatever. Hades 2 is just... Well, it's what you get when something gets a fanbase, and the developers double down on the bits those fans liked.\n\nHades 1 had some interesting takes on the Greek pantheon, but Hades 2 pushes them into something that is entirely too 'high school anime' derived. Hades 1 had a nice gameplay loop, so, Hades 2 adds crafting for some reason. People made a lot of noise about Hades 1's boyfriend/girlfriend/relationship stuff, so Hades 2 goes further with it. Hades 1 had sexy anime deities, Hades 2 almost feels like a parody. Add on Amelia Tyler, tarot, and a protagonist with a weird arm, and it all just feels like Things That Are Popular On Tumblr.\n\nThe gameplay is fine, but it's missing something from Hades 1. It's a bit slower, a bit more CC focused. The weapons don't feel as fun or as interesting to use. I haven't gotten very far in the story, but the tone is a bit off-kilter, and I've seen enough wailing and gnashing to know that the ending is... divisive. Hades 1 had a short, sharp hook: reunite Zagreus with his mother. But Hades 2 story about stopping Chronos because he... took Mel's parents away? Maybe? ...just doesn't have the same immediate hook. Hades 1's tone could be a bit zany and funny because it was, essentially, a family dispute from the very start. Hades sending Zagreus back into the pool was basically grounding him. Hades 2 just... doesn't have that same spark because of the apocalyptic stakes. When everyone feels like they're just out of a high school anime ('Tch! It's not like I like you or anything, Mel...') it's hard to take the \"DEATH TO CHRONOS\" aspect seriously.\n\nIn Hades 1, a room might contain a power-up or a new power or something to use in this run. It doesn't feel good when, in Hades 2, you get rooms that just contain crafting materials.\n\nI'd fallen in love with Hades 1 virtually immediately, but Hades 2 is a bit like crawling through glass in the hope that it grabs me the same way.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "*Mixed review*\n\nSeems like I'm in the minority but Hades 2 didn't live up to my expectations.\n\nThe gameplay is an improvement on Hades, with the additions of sprinting and mana.\n\nBut the story lacks the sauce that the first game had, I'm not sure if it's because the hub isn't as lively, or the characters don't interact with each other as much (Narcissus). But once I reached the first ending, the will to continue had vanished.\n\nMaybe my review will change when I revisit the game, but IMO Hades is better as a self contained entry.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm sus of all these pos reviews. This one just felt undercooked to me. When building any particular run, I felt like I was always choosing between an option that I hated and an option that I hated more. This one just doesn't feel as transformative and satisfying as the first. There are better rogue-likes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like it. But I haven't loved it nearly as much as the first Hades. The story isn't anywhere close to being as strong or emotionally engaging. The returning characters are not as exciting to get to know playing as Melinoe. They feel like filler content and are just copy paste cutouts of who they were in the previous game. The new characters are fine but don't have engaging personal stories that add any meaningful depth to Melinoe's own story or journey.\n\nThe gameplay feels like a good upgrade from the previous title, but nothing is standout enough to feel like it has been an entire re-invention as opposed to just being a very large standalone expansion. It has been streamlined, but mostly feels samey overall. The game is a highly over engineered drip feed experience.\n\nEven the new systems aren't enough of a driving force to get me excited for each new runs. They are for the majority just a series of continuously meaningless unlocks to pad out the gameplay time back at your home base. Their effects feel substantial for some and hollow for the majority of your unlocks. Like they are just there to make the game feel more of rogue-lite so that it becomes far easier to make progress with each new run without requiring players to learn to become more skilled with it's systems.\n\nI have felt very underwhelmed within my 22.5 hours and so far I couldn't care less about the story as the stakes feel so minor and my relationship to every character feels far too pre-established and non-developing in any meaningful way beyond just Melinoe's relationship with her mentor. Which have been the highlights of my experience thus far.\n\nI don't remotely understand the GOTY talk. Unquestionably, Hades 2 is a good game, but it feels like a far shot off from being a GOTY contender.\n\nEven if I'm in the minority of reviewers,I'm gonna have to give Hades 2 a downvote to keep it's sky high review score more realistic. Maybe my perspective will change a little in time, but right now, I can barely bring myself to complete more runs to reach this game's final ending. I just haven't found any reason to care about the story that Hades 2 has to tell and the gameplay isn't evolved enough from Hades 1 to not just make me nostalgic to replay Hades instead.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h3]Good gameplay. Mediocre story.[/h3]\r\n\r\nAfter the success of Hades, the idea of having Chronos, the titan of time, felt like the perfect villain for the style of game that had been created. A time wielding antagonist in a loop structured game seems like a match made in heaven. The problem is implementing it.\r\n\r\nThe game design and visuals are as good as the first game. It rewards you as you learn it. I love three of the new characters: Nemesis, Medea, and Scylla. Nemesis is so cool that sometimes I wonder if she would have been a better protagonist. Medea is another really cool character with a distinctive somber persona. Scylla and the sirens, what a remarkable boss. She is as memorable as Thesius. A charismatic foe that you love to hate. The best songs of the game come from her confrontation.\r\n\r\nSome minor complaints and suggestions before the big one. The reagents and greeneries should be used for more enchantments and relationship progression. In the current state of the game, the majority of them are barely used, just keep filling up space, and are just a waste of time to collect once used. Supergiant could add incantations to the relationship system of the game instead of heavily relying on nectar and ambrosia. Melinoe could do strange and funny incantations she thinks might help her acquaintances, but which could backfire. She isn't as cheeky as Zagreus, but her naivete could be used to add some funny moments to the game. She could give some rare reagents and greeneries to Hecate, Circe, Medea, and maybe Arachne. She could give rare reagents to Icarus and Hephaestus. Give Persephone some greeneries. Her mother would love to receive flowers from her daughter. Mix things up. Not just give the same thing to everybody.\r\n\r\nMost relationships in Hades 2 have a dissatisfying development and conclusion. The alliance with the Olympian gods plays exactly like the first game so they didn't feel anything special. A suggestion here would be Melinoe learn how to infuse nectars and ambrosias through incantations to please the gods. Sort of like the ectoplasmic draught she makes for Icarus. Different gods requiring different incantations. Regarding the relations with the other NPCs, there is a clear difference between Hades and Hades 2. Zagreus helps all those who help him throughout the game. It is extremely gratifying to interact with them. Melinoe in contrast just seems to meet them and become an acquaintance to most of them. Even if you advance all relationships in the game, she is just someone these people know and have to interact occasionally. There is no emotional benefit to befriending most characters. It is just something to unlock more dialogue. It is purely transactional. In the first Hades, it is so rewarding to help Achilles, your mentor and guy who has been encouraging you and being positive throughout the whole game. Dusa, Nyx, Sysiphus, Patroclus, Eurydice, Orpheus, Megaera, etc. It feels great meeting, talking, befriending, and helping them. There is nothing like that in Hades 2. Talking to the NPCs advances the story, but in the end there is barely any emotional attachment to most of them. Melinoe may meet lots of people, but she doesn't befriend or help most of them. Even the ones she helps end up in lackluster conclusion. Even her romance options end up being dull.\r\n\r\nI did not like to face Cerberus as a boss. I love him in the first game. He is a source of comfort. I love when you first reach the final gate and instead of fighting him, you discover that you just need to give him a treat. You only see him in combat for a brief moment in the advanced final boss fight, which is hilarious (bad boy, bad boy!). In Hades 2, after having \"soothed\" Cerberus, I didn't even want to listen what Homer had to say. You turned a character that I loved in the first game into a character that I loathe having to face every single time I go to the Underworld. It makes no sense that he keeps getting corrupted even after you have freed Hades and Persephone.\r\n\r\nIf Chronos can imprison powerful characters like Zagreus, Persephone, and Hecate in those time bubbles; why doesn't he do that to Milenoe? This is a plot hole to me. In my head, I kept thinking how cool it would have been if Hecate had planned to make Milenoe's true identity to Chronos a secret because her main advantage would be that since she is directly related to him, his powers of time would not be reliable against her. Everyone who is directly related to Chronos would have this advantage. Only in later encounters he would deduce who she really is. I imagined him freezing her. After one or two seconds she frees herself, he shouts \"impossible!\", and the song \"In the Blood\" starts to play as the final fight progresses. But if I need to make mental gymnastics to justify your story, then there is definitely something wrong.\r\n\r\nNow the big complaint. The first time I reached each of the endings of the first Hades it felt like bliss. When I reached the first ending of Hades 2, it just made the game worse and worse. It felt like some Kung Pow Enter the Fist type of joke, but done seriously.\r\n\r\nMilenoe: I have diligently trained my entire life to kill the man who took my family away from me. I will never forgive him. Not in a million years. Never.\r\nZagreus: I implore you to reconsider.\r\nMilenoe: Hmm... (in a high pitched voice) Okay. Hey grandpa, you are forgiven.\r\n\r\nChronos: For millennia, I painfully reconstituted myself after having been slain by my own children. Now it is my children's turn to suffer through my rightful revenge!\r\nZagreus: I implore you to reconsider.\r\nChronos: Hmm... (in a high pitched voice) Okay. Hey family, sorry.\r\n\r\nTwo tales of revenge. One from the protagonist and one from the antagonist. They both end in an awkward family reunion. That is bullshit. Shoving a happy ending when it isn't earned just left me with a huge feeling of disappointment. Every time I met with the reformed Chronos, I rolled my eyes. The post ending justification of having to battle other timelines is such a lazy excuse. The writer wrote himself into a corner and came up with this lousy trick. Suddenly we have a multiverse to fight for eternity. Give me a break.\r\n\r\nIf I had to describe this game in one word, it would be unsatisfying. After all those hours invested in this story, you are left with a pitifully weak ending. Then play more to reach the true ending, and it is another huge let down. The meeting with the Fates is extremely underwhelming. Just like waking up Hypnos. Then you get Hecate's reveal which is a convoluted time travel mess. It made me think what was the point of it all. What a waste of my time. I have occasionally reinstalled the first Hades a couple of times to beat it once again since it is so much fun. If I had to describe the first game in one word, it would be rewarding. After uninstalling Hades 2, I will probably never play it again. I paid full price in early access only because I bought the first game in a discount and loved it so much I promised I would pay full price for the next game.\r\n\r\nIf you are planning to buy this game, most likely you have played the first Hades. If you don't care much about the story and are only interested in the game mechanics or the speed running aspect, go for it. It is as good as the predecessor. If you care about the story, I would advise to only buy this game on a very big discount. While the game is fun, the story is extremely unsatisfying.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay-wise, it's better in pretty much every way.\nStory-wise, it's just the first game again but worse.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm sus of all these pos reviews. This one just felt undercooked to me. When building any particular run, I felt like I was always choosing between an option that I hated and an option that I hated more. This one just doesn't feel as transformative and satisfying as the first. There are better rogue-likes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not as good as the first one. Combat feels janky, projectiles hit when they shouldn't have. A considerable amount of boons are useless, some weapons are not worth attempting a run for. In Hades 1, weapon aspects and different weapons were interesting and fun to use, in this game just use Medea and Circe and be done with it. Other aspects can't even end runs properly if you don't get good RNG with boons. There are too much materials than there should be, most of them are tidious to keep track of. And I personally can't upgrade arcana cards because even when I've beaten Chronos 7 times, spell doesn't appear. Also, underworld is too easy and surface is too hard. It took little effort to beat the Chronos for the first time but I still can't beat the surface because random enemy aoe attacks deal 40 damage per hit and in a second I get hit 3 times and lose a death defiance. Enemies aren't hard, they deal too much damage and have too much health. It feels like a chore playing this game rather than a fun experience. I think it was better if this game didn't come out and damage Hades's reputation.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like it. But I haven't loved it nearly as much as the first Hades. The story isn't anywhere close to being as strong or emotionally engaging. The returning characters are not as exciting to get to know playing as Melinoe. They feel like filler content and are just copy paste cutouts of who they were in the previous game. The new characters are fine but don't have engaging personal stories that add any meaningful depth to Melinoe's own story or journey.\n\nThe gameplay feels like a good upgrade from the previous title, but nothing is standout enough to feel like it has been an entire re-invention as opposed to just being a very large standalone expansion. It has been streamlined, but mostly feels samey overall. The game is a highly over engineered drip feed experience.\n\nEven the new systems aren't enough of a driving force to get me excited for each new runs. They are for the majority just a series of continuously meaningless unlocks to pad out the gameplay time back at your home base. Their effects feel substantial for some and hollow for the majority of your unlocks. Like they are just there to make the game feel more of rogue-lite so that it becomes far easier to make progress with each new run without requiring players to learn to become more skilled with it's systems.\n\nI have felt very underwhelmed within my 22.5 hours and so far I couldn't care less about the story as the stakes feel so minor and my relationship to every character feels far too pre-established and non-developing in any meaningful way beyond just Melinoe's relationship with her mentor. Which have been the highlights of my experience thus far.\n\nI don't remotely understand the GOTY talk. Unquestionably, Hades 2 is a good game, but it feels like a far shot off from being a GOTY contender.\n\nEven if I'm in the minority of reviewers,I'm gonna have to give Hades 2 a downvote to keep it's sky high review score more realistic. Maybe my perspective will change a little in time, but right now, I can barely bring myself to complete more runs to reach this game's final ending. I just haven't found any reason to care about the story that Hades 2 has to tell and the gameplay isn't evolved enough from Hades 1 to not just make me nostalgic to replay Hades instead.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If I could give a mixed feelings review I would, but I did enjoy my time playing through the game quite a bit.\n\nHowever the ending SUCKS. It feels like the time I put into the game was all for nothing after that damp squib of an ending.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I put in a LOT of time on this game and honestly, how badly they fumbled the end game ruined everything for me. It's hard to imagine how to mess it up worse. Hades 1 was beautifully written, cohesive, and was incredibly satisfying. \n\nI really wouldn't recommend this game to anyone unless they truly don't care about the story, characters or anything else and just want to grind.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "meta builds, damage sponge, resource grind\r\n\r\nmore personal ones: weak story payoff compared to 1, really lame side quests/characters, some questionable designs (boons, bosses etc.)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h3]Good gameplay. Mediocre story.[/h3]\r\n\r\nAfter the success of Hades, the idea of having Chronos, the titan of time, felt like the perfect villain for the style of game that had been created. A time wielding antagonist in a loop structured game seems like a match made in heaven. The problem is implementing it.\r\n\r\nThe game design and visuals are as good as the first game. It rewards you as you learn it. I love three of the new characters: Nemesis, Medea, and Scylla. Nemesis is so cool that sometimes I wonder if she would have been a better protagonist. Medea is another really cool character with a distinctive somber persona. Scylla and the sirens, what a remarkable boss. She is as memorable as Thesius. A charismatic foe that you love to hate. The best songs of the game come from her confrontation.\r\n\r\nSome minor complaints and suggestions before the big one. The reagents and greeneries should be used for more enchantments and relationship progression. In the current state of the game, the majority of them are barely used, just keep filling up space, and are just a waste of time to collect once used. Supergiant could add incantations to the relationship system of the game instead of heavily relying on nectar and ambrosia. Melinoe could do strange and funny incantations she thinks might help her acquaintances, but which could backfire. She isn't as cheeky as Zagreus, but her naivete could be used to add some funny moments to the game. She could give some rare reagents and greeneries to Hecate, Circe, Medea, and maybe Arachne. She could give rare reagents to Icarus and Hephaestus. Give Persephone some greeneries. Her mother would love to receive flowers from her daughter. Mix things up. Not just give the same thing to everybody.\r\n\r\nMost relationships in Hades 2 have a dissatisfying development and conclusion. The alliance with the Olympian gods plays exactly like the first game so they didn't feel anything special. A suggestion here would be Melinoe learn how to infuse nectars and ambrosias through incantations to please the gods. Sort of like the ectoplasmic draught she makes for Icarus. Different gods requiring different incantations. Regarding the relations with the other NPCs, there is a clear difference between Hades and Hades 2. Zagreus helps all those who help him throughout the game. It is extremely gratifying to interact with them. Melinoe in contrast just seems to meet them and become an acquaintance to most of them. Even if you advance all relationships in the game, she is just someone these people know and have to interact occasionally. There is no emotional benefit to befriending most characters. It is just something to unlock more dialogue. It is purely transactional. In the first Hades, it is so rewarding to help Achilles, your mentor and guy who has been encouraging you and being positive throughout the whole game. Dusa, Nyx, Sysiphus, Patroclus, Eurydice, Orpheus, Megaera, etc. It feels great meeting, talking, befriending, and helping them. There is nothing like that in Hades 2. Talking to the NPCs advances the story, but in the end there is barely any emotional attachment to most of them. Melinoe may meet lots of people, but she doesn't befriend or help most of them. Even the ones she helps end up in lackluster conclusion. Even her romance options end up being dull.\r\n\r\nI did not like to face Cerberus as a boss. I love him in the first game. He is a source of comfort. I love when you first reach the final gate and instead of fighting him, you discover that you just need to give him a treat. You only see him in combat for a brief moment in the advanced final boss fight, which is hilarious (bad boy, bad boy!). In Hades 2, after having \"soothed\" Cerberus, I didn't even want to listen what Homer had to say. You turned a character that I loved in the first game into a character that I loathe having to face every single time I go to the Underworld. It makes no sense that he keeps getting corrupted even after you have freed Hades and Persephone.\r\n\r\nIf Chronos can imprison powerful characters like Zagreus, Persephone, and Hecate in those time bubbles; why doesn't he do that to Milenoe? This is a plot hole to me. In my head, I kept thinking how cool it would have been if Hecate had planned to make Milenoe's true identity to Chronos a secret because her main advantage would be that since she is directly related to him, his powers of time would not be reliable against her. Everyone who is directly related to Chronos would have this advantage. Only in later encounters he would deduce who she really is. I imagined him freezing her. After one or two seconds she frees herself, he shouts \"impossible!\", and the song \"In the Blood\" starts to play as the final fight progresses. But if I need to make mental gymnastics to justify your story, then there is definitely something wrong.\r\n\r\nNow the big complaint. The first time I reached each of the endings of the first Hades it felt like bliss. When I reached the first ending of Hades 2, it just made the game worse and worse. It felt like some Kung Pow Enter the Fist type of joke, but done seriously.\r\n\r\nMilenoe: I have diligently trained my entire life to kill the man who took my family away from me. I will never forgive him. Not in a million years. Never.\r\nZagreus: I implore you to reconsider.\r\nMilenoe: Hmm... (in a high pitched voice) Okay. Hey grandpa, you are forgiven.\r\n\r\nChronos: For millennia, I painfully reconstituted myself after having been slain by my own children. Now it is my children's turn to suffer through my rightful revenge!\r\nZagreus: I implore you to reconsider.\r\nChronos: Hmm... (in a high pitched voice) Okay. Hey family, sorry.\r\n\r\nTwo tales of revenge. One from the protagonist and one from the antagonist. They both end in an awkward family reunion. That is bullshit. Shoving a happy ending when it isn't earned just left me with a huge feeling of disappointment. Every time I met with the reformed Chronos, I rolled my eyes. The post ending justification of having to battle other timelines is such a lazy excuse. The writer wrote himself into a corner and came up with this lousy trick. Suddenly we have a multiverse to fight for eternity. Give me a break.\r\n\r\nIf I had to describe this game in one word, it would be unsatisfying. After all those hours invested in this story, you are left with a pitifully weak ending. Then play more to reach the true ending, and it is another huge let down. The meeting with the Fates is extremely underwhelming. Just like waking up Hypnos. Then you get Hecate's reveal which is a convoluted time travel mess. It made me think what was the point of it all. What a waste of my time. I have occasionally reinstalled the first Hades a couple of times to beat it once again since it is so much fun. If I had to describe the first game in one word, it would be rewarding. After uninstalling Hades 2, I will probably never play it again. I paid full price in early access only because I bought the first game in a discount and loved it so much I promised I would pay full price for the next game.\r\n\r\nIf you are planning to buy this game, most likely you have played the first Hades. If you don't care much about the story and are only interested in the game mechanics or the speed running aspect, go for it. It is as good as the predecessor. If you care about the story, I would advise to only buy this game on a very big discount. While the game is fun, the story is extremely unsatisfying.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After completing it and getting to the epilogue I'm realizing only after the fact that... It's just not as good in terms of writing as Hades 2. It's nonsensical and unfulfilling in a lot places, with either unearned or hanging plot threads and characters all over the place.\n\nThis is one of those times I wish I could give a neutral recommendation, but forced to pick yes or no? It's no. Make no mistake, what's here is an improvement gameplay-wise on Hades, but Hades 1 was a complete package and that's why it was good: Writing and mechanics actually interlocked in such a great way to keep you playing well past the ending. That isn't present here. They really dropped the ball with the development of the narrative overall here, it's all weird and disjointed when you stop to think about it, all the way from simple bonds you have with characters, to how things 'resolve'. And that just isn't good enough when you're only standing on your mechanics, and being compared to a much better complete experience like Hades 1.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Is this a bad game? Absolutely not.\n\nIs this a disappointing sequel to Hades 1? Regrettably yes.\n\nLackluster story with a shitshow of an ending. Any narrative conflict(s), presented or hinted at by the game, either goes nowhere or gets magically resolved in the least compelling way imaginable. \n\nCharacters are in every way a downgrade to H1's cast. Melinoe is a wet noodle of a protagonist, lacking charisma and charm of Zagreus, who is just not interesting enough to listen to, let alone follow as POV in every single interaction in the game. It does not help that, unlike Zagreus, she does not seem to develop at all throughtout the story, remaining, for the most part, somehwere between preachy, naive and self-righteous. Eris is an insufferable cunt with zero attempts to redeem or endear her. Nem is a worse version of Meg. Hecate is once again a nothing character with a mentor archetype and no depth to her. Skelly somehow turns into one of the most annoying people to talk to in the camp, like a joke that has been recycled and reposted thousands of times in the most unfunny and unoriginal places on the internet. I can go on and on. \n\nThe ability of our little witch to destroy immortal gods/titans and world-defining concepts through the power of mixing a few frogs and some magic words is both immersion-breaking and disastrous to the game's world-building. Must have been a missing addendum to the greek myth anthologies I've been reading. One of the more egregious example of very many cases in this sequel where the narrative serves the gameplay to the detriment of the former. \n\nChronos is not a fun character to challenge. He is just a bitter old man that you have to put down like an old mad dog in every underworld run. At no point do they even try to make him a compelling villain whoose viewpoint may challenge the protaganist's outlook on what's going on. Every interaction they have until the very end is like going through motions. Needless to say, this is a big step backwards from Hades, who very fittingly, just like Hades 1's spirit and name, is chained and constantly tortured by his creator throughout this game.  \n\nWeird boss design phylosophy with overrelinace on mapwide/half-mapwide nukes and other \"exciting\" AoE effects, which are not only not fun to fight, but also make the bosses complete push-overs once you get decently acquainted with them. I have a laugh everytime they make me play a memory game on Prometheus boss. Typhon being a mindless dps-check is a travesty. Rival boss fights for the most part are cases of \"how can we make this boss fight more annoying\" rather than \"how do we make it more challenging\". \n\nThe visual clarity on many of these fights is so bad it is actually hilarious. AoE attacks effects make it hard to follow what the actual boss(es) is doing. Cast makes it almost impossible to see if an AoE attack is coming (especially bad on many God Choice locations). Map effects (traps etc.) are generally both less intuitive and less distinctive (easy to spot). \n\nUnnecessery and barely impactful magic/mana system which you will always try to circumvent when running a weapon relying on Hold button moves (which, IMO, are pretty shit, but let's say that is just me). \n\nEven the new mini-game they introduced (spirit hunting) is a groan-inducing annoyance you have to deal with every run until you unlock the ability to skip it with the animal familiar (the very first one, so they know) only to realize that very best farmiliar you can use instead skips a much better fishing mini-game from the first game rather than this shit. \n\nAnd whatever the fuck they were smoking with Mourning Fields region, a region with vast, multi-encounter locations where you spend 90% of time running around looking for rewards to trigger the same old fights with minimal enemy variety - trying to make something different is praiseworty, but if that is the result, then please stick to reliable old map arenas.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "End of the day, I had a good amount of fun with this game but overall the experience is meh.  Never did I feel like any part of the game was especially good.  The biggest gripe I have is that many of the melee weapons feel extremely underpowered due to enemy design.  Also the mechanic of holding to charge attacks is not great since you're required to be dashing continuously.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The short review is: play the first game, it's awesome. This one's a lame copy. \n\nThe long one is: I really wanted to love this game. The first one was one of the best games I've ever played and I've played a lot. However, I simply can't. And for many reasons: \n\n1. One of the finest characteristics of the first game was how balanced it was. Each weapon had some advantages, same for the gods. And none was truly broken. You had to do your best. Now... Well, now there are many broken combos. And you don't even need them. Just get a Selene damaging boon, improve it, get loads of life and nothing else matters. You can one-shot each phase of the final boss with it. And with enough life you don't really need to bother too much with his attacks. No strategy or ability required. This game is way easier than the first without being more interesting.\n2. This game pretends to have more options, but they are not really options. For instance, would you rather have three extra lives or deal more damage to enemies with two curses? Most of the options you have are either super powerful or mostly useless. For instance, one of the challenges of the game is to manage you mana consumption. However you can choose to start with a powerful mana regen, which makes mana management moot.\n3. Far too many resources, most of which are used once or twice, then become irrelevant. The game itself knows it and at some point gives you a magic that makes you not even have to gather them. \n4. The conversations are boring. There are far too many characters and you have to give far too many gifts to each of them, and your reward is too listen to same sentence with different words. Besides, almost everyone is super nice ever since the beginning. There's no drama and no evolution to the characters. The gods even apologize when you spurn them.\n5. Most of the characters are very tedious. The headmistress is a fortune cookie sentence generator. Odysseus only alerts you to things that you already know. (By the gods! The skeleton has better advice.) Very few characters have something interesting to say.\n6. The love interests are lame. Two weak, apologetic men. (One of them actually apologizes to you for having only you as a lover while you have a lot of people.) One woman hates you and does everything she can to make your life worse. (Really? That's the one the main character is going after!?) Only the other woman has a nice story and doesn't seem a lame lover.\n7. The antagonist could be easily swapped by Doc. Evil, given how cliche he is. And the ending (both of the main story and the epilogue) are super boring. \n\nThe only saving grace was Scylla. The idea of a boss that sings different songs throughout her level is awesome. And her songs are much more interesting than the bgm of the rest of the game.\n\nAll in all, this was not a good sequence to the first. Having played Silksong recently, the difference in quality is glaring. Whereas in Silksong the creators clearly learned from the first game and made an even better one, in this game no lessons were learned. In fact, there were many downgrades that I simply cannot understand. \n\nFor instance, when checking a god's boon list, in the first game you could see simultaneously both the requirements and the details of the boon. Now you can see only one or the other. Who thought this would be better? On the first, after you finished the main quest, the ending of a run was a lighthearted joke on the protagonist. Now we have only a boring generic ending. Is the protagonist so soft skinned that she can't take a joke?\n\nMy take on this game is that this game was not thoroughly thought before its implementation and that early access made it worse instead of better. The loudest people usually ask for a less challenging game and for more OP characters, which can be fun for a little while but make for a much less enjoyable game.\n\nFor instance, the last weapon to be created requires no brain to play. Just spam super specials and that's it. Super boring. I did the 32 darkness challenge with it at the beginning of the game without breaking a sweat. This should not happen. In the end, the hardest challenge is to play the super random challenge, where you may end with the lamest weapon and worse enemy boosts. Not fun at all.\n\nPlease do yourself a favor and play Hades 1 instead.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Okay so I have played enough to have unlocked nearly everything so this is an honest review. \nHades 2 is a better game than the first in truly ever area. Melinoe is a better protagonist with a voice actor that can finally utter a word in more than one tone. The artwork and color scheme is far more attractive and the use of witch magic as a means of expanding things through found ingredients is a lot more narratively charming than the original.\n\nThe weapon selection is pretty much the same, the variety they offer is that there are one or two linked to Magick that can offer some great additional abilities but none of which beat the vastly superior beat-em-up weapons that are offered in both the numbers (damage etc.) and enjoyable play style. They merely elongate fights to a staggeringly long and annoying amount that I've quit runs halfway through because it is exhausting running away so you can have times to cast things.\n\nThe artwork and Boons offered in Hades 2 is the furthest leap forward this game can offer over it's parent. It's downright beautiful in some areas, the animations are crisp as winter mint (mostly) and the gods have so much more personality to them. The story is far more broader across the universe and makes for a bigger sense of adventure than the first.\nHowever...it's still a bad game.\n\nIs it fun? Sure for a while.\nDoes it stay fun? No.\nDo you have to play it forever and ever to unlock story beats and progression toward an ending? Oh you betcha.\n\nI can't call this game good because it refused to fix the flaws of the first game and inherently it's poor, poor, poor, poor mindless genre.\n\nThe rogue-like cancer that's affected game design has only grown bigger and it seems Hades 2 doubled down on it instead of decently controlled difficulty (which it had the room to do) it copped out for the rogue-like elements that make a game \"hard\" instead. So here is a break down of all the flaws a rogue-like has that this game didn't (refused to) fix:\n\n1) Weapon Imbalance - the playstyles in the weapons can feel a little different at first which is pleasant but to say they are equally balanced is saying snow is brown. It is bizarre, how drastically pointless the majority of the weapons actually are and the Boons offered, although with a greater variety, I'm afraid do not equally lean toward them either. The degree to which the staff needs to be molded, catered, babied, insert-appropriate-word-for-a-shit-ton-of-effort-here, in order to be as effective as hitting someone with a big axe, is so absurd you need a degree from a lovecraftian university to comprehend it. It's a rogue-like level-based beat em up. The fun comes from the leveling up and building being effective tools to play with and for some of the weapons it literally is never worth the effort.\n\n2) \"What the fuck is going on?\" - You've said this phrase playing any bullet-hell rogue-like. You have. I have. The devs did when testing but kept it because it makes things \"difficult\". To put this into perspective, once you have reached the higher difficulties of this game, there is a point where every creature can have:\n1) an aura of a certain color that does something you hope you learned about \n2) they either shoot little projectiles of a certain color all over the screen for you to dodge\n3) they have a horribly animated melee attack (which is just basically a teleport where you have no i-frames dodging through) but don't worry they glow a certain color right before they do that\n4) they channel a nasty half-the-map-sized spell that deals fuck tons of damage but don't worry they have a big circle on the ground in 1 of 3 colors \nand/or \n5) they have 2 different kinds of armor but don't worry they glow colors to show you how many and which ones they.\nNow gee wiz that sounds at least telegraphed right? I mean it's overwhelming sure but at least you know what's happening to some degree right? Nope. You sounded stupid reading that, I sure hope it wasn't out loud. Because all of these are the same 3 colors which, coincidentally, happen to be the same colors you produce by:\n1) Attacking animation colors of certain weapons of yours\n2) Colorful circles on the ground you cast\n3) Enhancements to your weapons by gods that are 1 of 3 colors\n4) Your dash effects giving by gods of 1 of 3 colors\n5) The conditions you place on top of the already colored enemies given by the gods of 1 of 3 colors\n6) Your projectiles that are 1 of 3 colors\n7) Your animal companion dashing around doing attacks in 1 of 3 colors\n8) the dangers and explosions of the maps in 1 of 3 colors\n9) don't worry, I'll use my new cool moon power that acts like a big charge up weapon/spell. What does this one do? Oh it charges a big beam that's 1 of 3 colors? The other one? Oh shoots a big ball of 1 of 3 colors. The other one? Summons an enemy you killed who LOOKS LIKE THE ENEMIES SHOOTING YOU WHILST SHOOTING THEM WITH THE SAME PROJECTILES AND NO INDICATION OF WHICH IS WHICH IS GIVEN AND EVEN IT WAS IT WOULDN'T HELP-WHY NOT-OH BECAUSE IT'D JUST BE 1 OF 3 COLORS! ARE YOU SEEING THE PATTERN YET!?\nIt becomes impossible to tell what the hell is going on because they flood you with an impossible bunch of colorful, fast-moving stimuli that unless you are a 10 year old with a ton of sugar in you you won't ever be able to logically ascertain what is happening let alone react to it.\n\nEach playthrough isn't random. Not really. It's a set run from start to finish that you're given, you don't have a random roll each time you pick up a boon, those boons are decided from the start. You can see this for yourself by simply quitting and replaying it. Meaning the \"difficulty\" of the random boons is somewhat scripted and it feel cheap knowing that I might not get what I need not because of a random chance, but rather because the devs decided to be mean or simply not piece together that that build could exist. Kind of a dick move.\n\nThe Boons and Gods available are so far from balanced. Being able to destroy armor is so pinnacle to a successful run in the later games and there is only 1 god that offers that ability. It's naratively strong sure but what is the purpose of variety if there's only 1 solution? You're offering me a choice of keys but only one unlocks the door to get out, I wonder which I'll pick! There is an \"elements\" offered by each Boon from the gods and some abilities grant you bonuses depending on how many elements you have (2 Water, 3 Fire etc.). it's a cute side addition that opens up the leveling up a lot...if it were balanced. There are maybe 300 boons that offer fire and like 6 that offer water. Refer to the keys joke earlier.\n\n\nSome of the enemies to boot have different hit box rules to them and you simply have to learn from trial and error and seeing as the game is genuinely nothing but a rinse and repeat simulator it makes me feel they knew this and did nothing to fix it.\n\nThe game falls short because the genre was built broken and instead of fixing it they stuck to it but colored it with some exotic looking paint. Probably in 1 of 3 colors.\nThe coolest thing about this game is a difficulty adjustment setting that makes some bosses change their game, sometimes adding in a whole new companion that's joined them for the fight and it was the only possible step in the game's combat because it TOOK EFFORT! It's not \"oh these creeps are a little stronger and you didn't know they explode on death now oooooohhhh how sneaky of us, difficulty means our game is good ooooh\", it's genuine programming to add elements that kept replaying interesting. It even added to and/or respected the lore.\n\nIn short, purchase it if you want to kill time, but don't expect to be blown away by any mechanics or interesting game design elements because it's as dry as Atreus' voice acting.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Need a \"meh\" option. It tries to do way too much. Where the first was a tight, balanced experience this requires way more grinding for materials for even basic functions of the first game. Bosses are far overtuned in comparison to the first game, while Mel is a much less powerful protagonist. A step back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Overhyped Disappointment[/h1] \nThe developers were once known for experimenting with different genres. It’s a shame those experiments seem to have ended, and instead we got a game that could have easily been just a DLC (and in that case, there would’ve been no complaints).\n\nThe first Hades was a breakthrough title that showed for the first time that roguelikes can have high-quality narrative and storytelling — all wrapped in Supergiant Games’ signature art direction. For many people, the original Hades became the showcase of the action-roguelike genre and the entry point into it (myself included). Despite its click-click-dash combat, the game delivered a fresh and exciting experience.\nWhat experience does Hades II offer? With such tedious combat and build-crafting, it can easily push players away from the genre entirely: “If the overhyped Hades II is this boring, then other roguelikes must be even worse.”\n\nAt first, I wanted to describe all the issues, but once I started writing, I realized I’d spend an enormous amount of time. It’s not worth it. There are already many great negative reviews with detailed examples and explanations. So here’s a short summary of the game’s problems:\n[list]\n[*]The combat became broader, but not deeper. Just like before — it’s simply click-click-dash.\n[*]Battle balance is broken. Normal difficulty is extremely easy, while higher difficulty is absurd and tedious.\n[*]The balance of boons and build-crafting is questionable. The dominant strategy is to pick the highest damage percentages for your basic or special attack and spam it. There are far too many useless boons.\n[*]The Arcana system is dark-meta that effectively gets removed at high difficulty.\n[*]Resource grind and the grind animations show no respect for the player’s time.\n[/list]\nWhat I simply disliked:\n[list]\n[*]The visual style\n[*]The story feels childish, the characters are weak, and the developer-intended ending doesn’t match the dark and brutal tone of Greek mythology\n[/list]\nIf you haven’t played the first Hades, go play it. And if you have, you’re better off trying Curse of the Dead Gods instead.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "(Hades2 is the \"The New Colossus\" to Hades1's \"The New Order\")\n\nTLDR: Game's great, but feels subpar to SuperGiant's ridiculously high standards, so Hades1 - for coherent storytelling and consistency, Hades2 - for more diverse gameplay.\n\n.. to elaborate:\n- True & Epilogue Ending both are mediocre at best (the patch only made it a smidge better)\n- just time-travel in general messing up the whole premise and post-game justifications\n- some NPC arcs falling flat (Chronos, Hypnos)\n- subplots going nowhere or lacking a satisfying resolution. Hades1 Sisyphus stayed for Boldy, Hades2 NPCs stay because of the \"NPC in a rogue-like\" reason - they can have it better, but none take the opportunity or, in some cases, even move (Tartatus couple).\n\n.. the rest are nitpicks - outlandish style choices (suited Chaos; Dionysus's attire; the Oceanus boss - albeit entertaining but still too whimsical), tame weapon aspects (save for a few), flat God portraits (poses, not animations), boring +5% upgrades (Moon tree), ubiquitous status curses with similar effects.\n\nMechanically Hades2 is super fun, the surface climb is awesome, the music\\songs are beautiful, some characters do leave an impression, not to mention the overall level of polish and attention to details - this is still SuperGiant!\n.. but I enjoyed Hades1 more..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overrated and overhyped,play the first game instead.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm annoyed at this game.  I don't think it's even remotely on the level of Hades 1, and there is not one quality of life or any improvement I could name about the game that sets the bar higher than the previous title.\r\n\r\n  I think Hades 2 punishes the player directly or indirectly for too many things, has too much bullet hell mechanics, too much indiscriminite crap happening on screen making it impossible to predict (especially when considering your own boon effects visually proc-ing), too many mediocre min-maxed boons, mediocre pets, mediocre weapons, mediocre story progression, mediocre music except for a couple of tunes that shine (Olympus Aflame, Siren battles etc).  The game feels to me as if the developers watched too many speed runs of their previous game, and forgot that the vanilla game doesn't need to be in an arms race with insane speed runners who have nothing else to do.\r\n\r\nWhy not let the player take more boons in the first area on the way to Olympus similar to the rat maze?  Then restrict the rooms later via heat level?  Why am I staring at 8 rooms and only able to choose 6?  I honestly want to install a mod manager for the game because getting the combination you want is less likely to happen across time than the heat death of the entire cosmos.  The game could probably be balanced IMO easily by simply adding like 2-3 chambers/encounters per region.\r\n\r\nWhy are the chaos trials so fun, yet the builds from those trials are utterly and completely unbuildable?  Yet another unintentional punishment to the player \"here is something you can never do nor achieve! enjoy!\"  If the odds of a deck of 52 cards being shuffled is basically guaranteed to be unique - then the odds of a single Hades 2 game is probably unique with more than twice or thrice as many combinations.  I challenge someone to figure out the math on it.  How the heck did they even playtest it then, is also my question.  Clearly they didn't in some cases (Hermes boon that affects percentages gets nerfed on Sea Star if you level up Sea Star later for example).\r\n\r\n  I'm having a difficult time enjoying any of it, and just fizzling out on heat level 6 Olympus runs because the heat level bosses are just stupid.  I never felt this way about Hades 1 heat level bosses, it was always epic and exciting getting amped for the plus level boss fights.  Now it's like \"what random 2-frame timing projectile bullshit are they going to throw at me now\".  Too much projectile hell in a world where you basically never get Athena's dash.  It's nearly impossible to get a decent intentional build, and even when I do ( for example just did a run where I got a Zeus + Hera duo boon granting me +12 on all my zeus boons) but then of course I have like 1 death defiance left because the poison battle with Medea and Polyphemus is absolute and pure bullshit, and then the fight with whats-her-bucket after that will finish you off.\r\n\r\nIt feels like this game never left beta, and I'm just not excited to play it anymore, or even finish the story.  It's extremely frustrating.  Melinoe is possibly one of the most boring characters written in the history of games, she isn't exactly unpleasant at least.  She seems to be the kind of girl girls would aspire to see themselves as, fair enough.  But just bland as pouring baking flour in your oatmeal.  The only carrot is the story of Melinoe's family dragging me along, and it's so few and far between that this story develops, it makes Persephone's presence in the previous game seem like she practically lived in Tartarus.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Basically a hades 1.2 that improves on fighting skills, drastically decreases powerlevel/fun and bloats everything that you have to do in between runs. \n\nEnjoyable changes:\nFighting is deeper than before mana + omega adds great variety\n\nApart from that it’s basically hades 1 with a lot of „let’s tone it down a little“ everywhere. \n\nMy playstyle of hades 1 was to try something crazy and jump in directly again after failure. The inbetween world was nice but I never cared for it more than to modify my next run. \n\nNow inbetween world is bloated. You will have to farm there, walking to your next run takes double the time, underworld renovations takes 5s instead of one click. \nMost of the game is hidden in beginning so good luck having the same run with the same gods over and over and over again. \n\nGods powers are significantly worse than before. Where Zeus had lightning strikes that took up large parts of the display, now enemies get a cloud over their head as if they were sad Sims and a tiny flash hits them after some time. The damage but also visual presentation does not seem like Zeus the father of all/most gods head of Olympia has granted you power. It feels rather like a minor level up in path of exile 2, nice to have but nothing to remember. \nDaedalus hammer used to be game breaking/morphing now it’s an ok buff but nothing exciting. I actively avoid it. \n20% of the time when having to selecting power ups I look for the „skip“ button or just choose randomly since nothing offered sounds interesting or inspiring. \n\nAnd where the mirror in part 1 gave you a clear lookout what you might get soon and what you are working on there are now thousands of crafting resources locked areas to explore and other stuff. Ultimately you will spend way less time in runs and way more time organizing stuff. \n\nIn hades 1 I got the feeling that every click and every decision is important here everything is so bloated and devoid of focus that it’s just difficult to not uninstall.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't buy this game expecting a good follow up from Hades 1. Its a complete disgrace to Hades 1. Absolutely horrible, boring mechanics that I tried REALLY hard to overcome because I wanted to justify my $30 purchase. Waste of money and time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[Spoilers alert]\n\nThe quest of Locating the 3 Fates is utterly ridiculous. I followed the instructions carefully, but the game just refused to let me have the epilogue. Guess what? I am not wasting a single more minute for this meaningless struggle anymore. I am freeing my hard drive from this game.\n\nGetting killed after you are ridiculously strong is infuriating, it is also an imbecile idea. This is not funny at all, the game on one hand tells me to execute every single move perfectly, but on the other hand, tells me to die 4 times with the 4th time is to die for real? Whoever think is a good idea should learn how to develop a puzzle game 101. A puzzle is supposed to be interesting and attractive. It isn't supposed to tell me to act like an idiot and gain nothing helpful in return.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It doesnt click as the first one, Hades 1 is perfect and this one tries to be similar but different at the same time.\n\nThe characters are less charismatic copies of the first game. For example, Nemesis and Oddyseus feel like aliexpress versions of Meg and Achilles. The new gods are bland, and the returning ones come off like actors worn down after six seasons of playing the same part.\n\nPersonally  I didn't enjoy any of the weapons and I'm not having fun with the magic system. Any weapon in Hades 1 is more fun than the Witch Staff.\n\nAlso, I'm color blinded and I didn't have problem seeing things in Hades 1 but after 60 minutes playing this one my eyes were exhausted.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "For me it wasn't entertaining to do the same thing with different abilities. I didn't like much of the weapons so I used mostly one. I didn't enjoy the grind. It became monotonous and far from fun. Feels like I wasted half of 40 hours and could have wrap up earlier.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is more Hades, they added a bunch more stuff to Hades. It just feels like a bunch of busy work, the original game is much more streamlined and enjoyable as a consequence.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "7/10 Bit of mixed feelings about this game. Compared to Hades1 I feel like this game was less appealing overall. \nStory is big and epic but very long and tiresome. Kinda boring and less feeling, maybe because it feels dragging.\nBut it is very dialogue heavy and it's very  impressive how they made so many variations of them and all voiced too.  Not too sure if I like the ending of the Chronos \n \nGeneral gameplay, feels way too slow early(even considering it's a rogue like..) especially with too many..things I have collect and unlock? but once more things unlock and surface opens up it's way more enjoyable, having two very different maps really enhances the roguelike aspect of the game.\nI really did enjoy the battle with Z, that was the climax of the game for me. I could only defeat him with sprint boon, constantly running was the only way to defeat him at the first encounter. \n\nWish they spent less time on making this game and instead make the game shorter but produce more games in the same world or something.\n\nI like the game BUT thumbs down because exactly 0 person in my friends group would have enough patience to finish this game. They didn't even have patience to finish the first one. Who would I recommend this to..? Sadly no one. I feel like there can be a same world game with different genre",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overrated. I think fans of Hades (original) which I am, WANT to love this game. However, the characters just don't connect the way they did in the original, and it just feels like a spin off that just didn't have the gas in the tank. I would rather replay Hades to be honest.\n\nI wanted to love it, I know many do, but it's just not as magical as the first. More complicated in camp, doesn't have the same Bass voice of Hades driving you to escape.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Купился на популярность первой части, продолжение должно было выдать весь контент за часов 30, но нет, у тебя будут десятки забегов в попытке встретить нужного персонажа и реплику, которая двигает сайдстори. По итогу чтобы выбить сраный подсолнух мне пришлось гриндить эти тупые и однообразные забеги 60 часов сверху. Кому плевать на ачивки – можете взять, основной сюжет проходится как оаз до того как игра становится невыносимо скучной.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really, really want to like this game. Supergiant Games seems like a great studio that makes great games, and a lot of the new character designs are gorgeous. But it's just. Not fun. The characters feel flat, there's way too many different materials, I hate that casts are no longer the ranged option, I hate Sprint, and none of the weapons feel as good as Stygius or Aegis. I've apparently played for 30 hours, and still haven't seen any character development (Nemesis is slightly less abrasive after copious gifting, but that's it). I'm still waiting for more interesting story moments to trigger somehow, but I don't know how to trigger them. Also, most new artworks of characters from the first game look quite bad. I understand that they probably would have gotten flak if they'd reused assets from the first game, but... it all just feels like a bad remix. I also simply don't understand why they would make a bad remix of Hades when they could have made a new original game, as they have done excellently in the past.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Constantly crashes. At this point, I give up. It would be fun, but it's unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved Hades 1 and was so, so excited for this game. And I really enjoyed it for 60 hours! And then i reached the ending and ate the greatest dissatisfying nothingburger 0 character development of all time. The game and characters had so much potential and none of that is ever addressed. Melinoe isn't particularly likeable and she never gets character development throughout the entire game, she isn't even a satisfying protagonist which sours the otherwise great gameplay. The art style change was just disappointing, considering how Hades 1 had an incredibly unique, dynamic style",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall a disappointment for me, I'll probably eventually try and come back to it, but 5 hours in and the game doesn't feel great.  Not a fan of the focus on casting and charging attacks and hate the dash sprint as compared to the dash from the first game.  Unlocked 4 of the 6 weapons so far and don't particularly enjoy any of them.  Staff being a worse bow, daggers are alright as a fist analog, torches feel very meh, axe is awkward with how ungodly slow it is.  Oh well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A solid follow-up to Hades, gameplay-wise. And, ofc, it's a rougelike, so the \"story\" such as it is isn't the most important part, but at least in the first there was a certain satisfaction along the way, and something like character development running through it. This had... none of that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally just did the incantation to do the final run when the entirely new ending to a supposedly 1.0 final release dropped.\r\n\r\nBut now I can't see any of it until AFTER I beat the game, so I'm stuck with a new ending with none of the context...\r\n\r\nJust let me turn back time without having to hit credits and this negative review disappears. In the meantime, I suggest you don't rugpull customers with a 1.0 release if you already know you're gonna change the entire thing a month later.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i think its my own fault for coming to this game with expectations too high for the story itself and relying too much of my motivation on it, but i physically can't get past that limp **** of an ending. [spoiler] Some of us actually wanted to bring \"Death to Chronos\".[/spoiler] \n\n[spoiler]To be honest, i feel like the team cornered themselves into a shit ending when they decided to go the time travel and forgiveness route, it sounds so cheap and lazy, like everything Mel went through was for nothing and all the suffering and destruction caused by Chronos can be excused cause in some other timeline he was not a major a**hole. Supposedly theres a [i]possibility[/i] of stopping him from turning into a tyrannical monster(again) by retracing her steps, and erasing other possibilities in that timeline while doing so(?!) This is just so convoluted and abstract and \"F* you, thats why\". Also the time skips in the postgame makes the narrative and relationships feel weird, like every character just kind of accepts simply because why not, and everything is brushed off like \"oh lol, that was just grandpa being goofy while off his meds.” im sorry, but everything just sounds so stupid/rushed, and making so many characters adress how nonsensical it all is, for so long after the ending, really doesnt help me get over it.[/spoiler] \n\nI dont want to be too pessimistic, so i'll say that most of the story progression was amazing. The characters are intriguing and complex, some of them played their part perfectly in both the narrative and Melinoë’s character development. The art is phenomenal, and the voice acting absolutely flawless. The combat and skill systems were insanely well done too, way better then the first somehow, also peak OST. The only problem is the ending for me, everything before that is perfect.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You know what I loved about Hades, well one of the many things, the difficulty curve was well balanced, the enemies felt progressively harder and even for a not great gamer like myself it was accomplishable. You know what I don't love about Hades II, the 900% difficult increase brought about by the second set of Rivals from the pact of night. To further explain, in Hades the opponents get more challenging in ways that feels like it makes sense and is still doable without going stupid, the second set of guardians in Hades II turn into bullet hells with the screens filled with projectiles and it's like playing a different game. The point of this, just so it's clear, is to demonstrate the difference between the 2 and that Hades II is a substandard game to Hades, if you are expecting the same gameplay experience, you won't get it. Just sucked all the fun out of the game and I have no interest in continuing. Well done Supergiant.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had fun with the first half of the game, but it eventually just got onerous. They followed the same strategy of requiring repeated clears of the game in order to advance the story, but because there is twice the content, it just starts dragging on. Having to clear the surface 5-6 times just to get enough items to do a spell to clear the game after already doing the underworld several times just seems unnecessary. In addition, it becomes a collect-athon with too many different items in order to clear spells, with trying to give items to random NPCs on top of that, but only allowing once every run, assuming you even have the option.\n\nIn general, this game just doesn't respect your time. In reality, I would prefer being directed toward having heated runs, but instead I have to do a stupid trick like die three times in succession in oceanus and recover with a keepsake equipped then die on purpose the last time only for nemesis to show up in the fourth room, preventing me from dying and nullifying the quest, making me start over. Who came up with this and why is this supposed to be fun?\n\nAll the collectibles, all the multiple runs, all the NPC requirements were almost fine in the last game, but using the same strategy here was definitely a miss. They should have cut 1/3 of the mindlessly grinding runs to meet story and item requirements and instead directed the player toward heated runs. If you get all the skelly statues, it should unlock everything and you should be done. No more. Everything else just takes away from the core game and makes it not fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My thumbs down is on account of Melinoe not having any heavy weapons besides the axe that has a similar moveset to Excalibur just worst. Her weapons are light weight and mostly ranged due to her being a witch I get that but she should have access to at least the same type as her brother. Her playstyle isn't a match with mine at all and to be completely honest I thought I'd be able to get some sort of fist weapon on the level of Gilgamesh..Black Coat isn't it so for me this game was a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The meta progression in this game is absolutely brutal. At first, I thought they had improved it with the addition of arcana cards. These encourage mix-and-matching rather than just linearly upgrading stats. Then I unlocked the ability to linearly upgrade my arcana cards, and I just stopped caring. \n\nIf grinding out meta currencies doesn't bother you, there's a lot to love about this game. To me, it feels like a chore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "How is it possible? I Mean... How?\nThe first Hades game was great all around:\nGreat combat\nGreat pacing\nGreat story\nGreat characters\nGreat music\nGreat endings (both of them)\n\nOn the other hand, this one still have a good combat, but it's very hit and miss, glacial pacing, terrible story, boring characters, ok music (except for the Sirens, they are great) e abysmal endings (especially the epilogue)...\n\nAdd the total lack of respect for greek mythology acurracy and you have Hades 2... Such a shame...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The dog boss sucks big time , but the game is good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kind of just boring and repetitive much like the first game. Big issue is that it seems to take forever for plot to move forward (this is based on the Early Access release, I am currently replaying to play the full game)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's an okay game - mechanically speaking. It's a good follow-up to Hades 1 but that said - it gives of this vibe of just \"more of the same\" with incredibly boring, bland and very much - oh so annoying - hero that Melinoë definitely is. You will see that this review pretty much falls into a category of comparative qualities between the two games which (given it being a direct sequel to Hades 1) is valid in my opinion.\n\nWhile the story in Hades 1 was gripping and tense up until the very end, this time it's very predictible and boring. Every character stays the same throughout the story (because the plot demands it) and writers kind off written themselves in a corner with this one. In the first one I've listened to literally every single one voice line this time I've found myself skipping over large amounts of dialogues simply because they weren't changing anything or affecting the status quo. Maybe with an exception of I think two characters - everyone is incredibly annoying to the point I cannot stand interacting with them including the main protagonist which is a typical self-insert \"yes man\" who grovels and fawns over everyone. Zagreus in comparison was quippy, exuded verbosity and a kind of bratty \"ADHD gremlin\" energy which lead to funny dialogues. And then after the credits - somehow - it gets even worse. That being said - I think the quality of writing in Hades 2 has definitely fell off. [b]Hard[/b].\n\nThe weapons are ok, but they're definitely worse than in Hades 1. Even the additional extra aspects aren't anything special and I often found myself struggling with inventing new builds and taking blessings that were synergizing well with any specific Nocturnal Arm. Finding specific synergies became a chore, most blessings don't fit or combo with each other. I feel like every weapon has a specific setup that it wants and taking anything else straight up demolishes your build. I feel punished for theorycrafting and trying.\n\nMusic itself is worth it to play Hades 2. Heavy guitar cords mixed with weird sometimes dissonant synths and a sprinkle of surprise such as experimental Jazz track on sax while fighting a certain individual.\n\nI wish I could've leave Neutral review, but given the fact I wanted to quit multiple times (and did actually - making large breaks between individual runs before hitting the credits) I'd say - watch a playthrough, listen to the amazing soundtrack and save yourself some time. It's a good game just... not good [i]enough[/i].",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't walk away happy after playing this game. Like honestly. \n\n[PROGRESSIOIN SPOLERS AHEAD}\n\nI beat Typhon and Chronos both 3 times. I beat Polyphemus like 50 times. And you still do not give me a normal ending after all that,.....that's not ok.\n\nI just lost interest in trying to beat this game. In fact I already did, multiple times, but you rigged it and designed it in such a way that forces your players to keep coming back over and over again. \nVery scummy and I didn't enjoy this.\n\n[GAME LORE]\nAlso I think it's very obvious you guys wrote yourself into a corner and then pretended like everything is okay. \nIf you played the 1st game, It doesn't make sense that Zagreus would like his father. I can't accept that in Hades II you tried to make this an reality. That's just wrong. \nI would understand Melinoe loves Hades and respects him but that's only because she has never met him when he was a ruler. Hades treated his son Zagreus horribly and there is no way Zagreus or his mother do not remember/do not vocalize that! You guys DESPERATELY TRY TO COVER THIS SIMPLE TRUTH throughout the entirety of this game!!!\nThi s*** too woke. I'm out. Honestly bought this game and gave it an honest try but you disappointed me. Give players who beat Typhon a proper ending. \n\nStop treating us likes tyour slaves, likeyour lab rats, that's disgustying what you tried to pull.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The ending is rushed and the story is underwhelming. Hades II requires context from the first game to follow the story as well. The sequel does not hold up well on its own. \n\nThe gameplay loop is the only redeeming quality for this game, but after that terrible ending, the dialogue of a certain character ruins subsequent runs for me...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]Felky Fun Meter[/h1]\r\n[h1]|-|---------| [1/10] Meh fun![/h1]\r\n[b]I played 500+ Roguelikes and I have never seen a mechanic like [u]Blessing of Strife[/u] which is clearly designed so the player doesn't beat those easy bosses-spawning-adds encounters on the first try and forces you to restart.[/b]\r\n[b]After that, back to having to kill 10+ times in a row the same easy bosses with slight variations to get to some kind of ending.[/b]\r\n[b]So many lines of dialogue that if you progress slightly too fast most of the talks are about stuff that happened 2 or 3 loops ago which feels underwhelming despite the great voice acting.[/b]\r\n[b]Many more things to say but people consider Hades a masterpiece so it's a waste of [u]Time[/u] (haha get it?) to type more; I'm not trying to ruin anyone's fun but this is a badly done Roguelike.[/b]\r\n\r\n[b]The one point from the rating is Ashley Barrett doing some heavy lifting.[/b]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly this game is NOT as good as the first one. for starters its plagued with \"Diversity and Inclusivity\".  The art is worse in very futanari. the weapons arent as good nor their aspects, despite having 2 different directions to go neither is as well done as the 1st game to the point the bosses dont seem very well done aside from scyla. None of the characters are likeable some even unlikeable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h1]Hades 2 is a \"good game\". Hades 2 is a horrible sequel[/h1]\n\nI waited a long time to write up my review of Hades 2. I went to play on launch and it just didn't feel right. So I slept on it. It's a Supergiant game, they've earned the benefit of my doubt.\nSo I play Hades 2 again, made a little more progress and still just...wasn't enjoying the game. Now, I've played every Supergiant game, I've bought Bastion on more platforms than I can remember, I [i]even played Pyre[/i] but Hades 2...it just left a terrible taste in my mouth when I played it. Factually Hades 2 deserves more than 14.4 hours of a review but I just can't wrap my head around the hype and accolades around this game. Did I play the same game everyone else did? Did everyone play Hades 1? Hades 2 goes out of its way to spit in my cereal for liking Hades 1.\n\n[h2]Hades 2 has nowhere to be and hopes you don't either[/h2]\nGod this game is [i]SO SLOW[/i]. [b]First[/b] and most noticeably the combat has been slowed to a crawl. You get a singular dash now. Forever. No upgrade no boons to give you more. You also have no ranged cast as you would in the first game, now you have an AoE cast* that traps enemies in its area and that means you are either standing where your cast was dropped or you have crowd controlled a group with it and will have to come back and finish that group. Imo, the first Hades was an edge of your seat, frenetic wonderland of fast runs. The only thing stopping you from exiting a room was how fast you could clear the enemies. You could kill bosses before they entered invulnerability! Here in Hades 2 you wait. You wait patiently for your turn, get some attacks in and then get back to waiting. God help you when you get to the Fields of Mourning! *yes I know you can upgrade your cast with boons and change it slightly but never in a way as dynamic as your casts in H1.\n\n[b]Secondly[/b] they added more dialogue. Isn't that good? Yes! and no. In previous games the stellar interactions were a cherry on top between the excellent gameplay stretches. They felt like a reward for making it wherever you were.  I'm unsure when SPG started being known for the writing/VO first and gameplay second (it was Hades 1. Hades 1 had great dialogue AND gameplay and the fanbase just coming in to Hades latched onto the dialogue) but why is the camera panning up and Artemis is singing to me and telling Mel to join in?? Do you know when you got a song in Hades 1? When you earned it by god damn bringing your Mother back to the Underworld, not because you died in the second room of the first area and you just pet your frog. Someone wished for more conversations and boy that monkey paw curled up. Everyone is SO VERBOSE, there's this shade who replaces Hypnos when you die (jk you never die in H2 ;) return to shadow~) and honest to god I've never read an entire conversation from her. I'll walk over to start a new run and [u]dread[/u] seeing a '!' above Nemesis because I know she's going to bend my ear for the next 7 minutes calling me a dumbass shithead for trying to fight Chronos. Simple solution then, don't talk to NPCs, but talking to NPCs and seeing interactions has always been fun in SPG games- there is just SO. MUCH. here. \nAnd tying the two points together: [b]Bosses are SO quirky and have so much witty dialogue they just HAVE to share BEFORE the fight[/b]. You just want to play the game you bought and have fun but Scylla just won't shuttt uppp and you hover over the refund button but the game deserves a fair shot and aaaaHHHHHHH\n\n[h2]The Field of Mourning[/h2]\nAre you serious? This whole level just blows plain and simple. You have an open map, not many discerning features, colors are basically the same everywhere and you have to [u]find[/u] the boons scattered around the [u]empty map[/u] which will then open the exit you must then find in the empty map. Wasn't Hades 1 a fast rip roaring good time? Time to SLOW DOWN. This game has no respect for your time, it is just so slow all the time. Yes, you get a ritual spell that shows you a guide light that *kind of* works (maybe im colorblind i just cant see it) to lead you around the Field of Mourning, but you won't have that spell the first time you go there, and you might not for a few runs!\n\n[h2]Melinoe is a pimp, fuck Zagreus, fuck Hades and fuck Cerberus[/h2]\nOkay so this section is going from \"I do not enjoy this game\" to \"I have been called a fool by a studio I've supported for 15 years.\" Famously, Supergiant hasn't ever made a sequel. They wrap a game and start up a new project that feels seperate from their other works with it's own ideas. Hades 2 straight up does not feel like a sequel to Hades. It feels like they took whatever project they had in line next (slow, methodical gameplay) and took the name recognition, shuffled some characters around in the background to appeal to veteran players and if you happened to prefer those other characters to these new shiny ones, you are an asshole.\nWhen I play a game I tend to put myself in the shoes of the protagonist, many people do I'd wager, and this game tells you to your face: \"everything you did was for nothing. The family and kingdom you brought back together has fallen asunder to a character you never even knew was a player- your time was a waste.\" That doesn't sit well with me personally, but the BIGGEST disrepect SPG has done to their player base involves the third boss. IYKYK but [spoiler]are you fucking kidding me? It's Cerberus, it really actually is Cerberus. Not a shade or some magic whatever or totally unrelated creature but fucking CERBERUS. Zagreus' dog, that you were LITERALLY UNABLE TO INJURE every single run in Hades, you had to go out of your way and find treats to make him move, now HAS to be killed in every single run of Hades 2. And guess what, when you beat the game and everything is asspulled back together, you STILL have to kill Cerberus in every single run post story[/spoiler]. Honestly whoever made that call can go right to hell, that genuinely feels like a slap in the face. And gotta be honest, I didn't beat Chronos! I read a comment detailing the absolutely ridiculous wet fart of an ending that they're already patching out as the true ending and just felt fully deflated.\nI give up, for the first time I will not finish a Supergiant game. I will not buy the next Supergiant game no questions asked as I have since Bastion. And (almost) in closing, I've ridden the company Supergiant Games quite unfairly in my review and that just comes from a place of disappointment. I'm truly grateful for all the good years I've spent playing Supergiant Games and I hope their next project is out of this world.\n\nHades 2 is a good game. I cannot sit here and tell you it's bad. Mechanically it shines, the gameplay is tight and fluid; truly if this was called Melinoe and wasn't [i]directly tied[/i] I wouldn't view it with such vitriol. But it is. This is Hades 2 so it must be compared to Hades 1. There is so much [b]MORE[/b] in Hades 2, the scope is so much more [u]IMMENSE[/u], everything is much [i]RICHER[/i] and sadly, it is inferior in every way to the less of the original.\n[h3]The best part about Hades 2 is that I can go play Hades[/h3]",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game almost needs no introduction based off the well-deserved \"Overwhelmingly Positive\" reviews this game garners. If you loved the first game and its implementation of the roguelike genre, you're certain to like this game as well.\n\nI'm leaving a negative for a very specific, almost niche reason. If you own this game on two platforms (Switch 2 and PC in my case), be very careful on the cross-save mechanic. You can sync both platforms to use one save. If you quit out of the Switch 2 version by closing the game to the \"desktop\" of Switch, that save can absolutely be lost and the previous save on the Switch will overwrite progress made on Steam.\n\nIn my case, my 30 hours played on PC was lost and the 5 hours played on Switch overwrote the Steam save, reverting the progress much further back. Admittedly this is user error on my part for not quitting and saving in-game and doesn't reflect the quality of the game itself.\n\nThe only reason for the negative review is because of this instance and is a warning for others to be mindful of, if you choose to use cross-saves between different platforms.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hades II is a difficult game to review. On the one hand, the gameplay is still excellent, better in some ways than the first. On the other hand, so many other aspects of the game are considerably worse.\n\nBy far the biggest problems are the story and the characters. Hades had a tight story about Zagreus, his family and their relationships. Every character you encountered had a part to play in the overall story and your relationship with them would evolve over the course of the story. Every conversation would reveal more of the backstories and relationships of the characters, which both advanced the main plot and fleshed out each character you talked to.\n\nHades II's story on the other hand is a basic, boring revenge story with a horrendous, abrupt ending. An ending so bad they immediately tried to fix it. Gone are almost all of the interesting conversations with other characters, almost every one boils down to \"Wow, I had never heard of you before\", \"This is what is happening in the story\", or \"You're so awesome and you're the only one who can do anything\".  Why would the gods take essentially no action other than giving boons when they should have both the desire and capability to do more?\n\nAlso, so many aspects of the game are \"bigger\" than the first, but are often to the detriment of the overall experience. Having to collect all the different resources needed to progress is a slog. The indicator of a good system is not to have the end goal be to finally get to ignore the system almost entirely. And far more character power is locked behind the several progression systems. You will lose runs, not from playing badly, but because farming the copious resources takes forever. Do you need one specific resource for a key upgrade? It could take double-digit runs before you get another chance at it. \n\nInstead of having well designed, interesting arenas, most of the maps are just a wide open space. Do you like needing map markers to find where things are on the map quickly? And oh, you need to both unlock the markers and activate them on each stage. How fun.\n\nLastly, the boons are far more powerful than in the original, but lack the ability to meaningfully change how you play. Each weapon plays essentially the same regardless of the boons you get. And some combinations of boons are so absurdly overpowered, it feels like a waste to pick anything else.\n\nIf all you care about is gameplay, and don't mind some unnecessarily long grind, you will probably still enjoy this game. If you want a far more polished experience/care about the story even a little bit, just play Hades.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why theres no tutorial for skills like u new to game but game just spams with many skills and things and u just dont know how these items work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same formula as the first, but nearly as tight. They added more systems, but a lot of it is frustrating rather than intriguing. Super builds aren't nearly as common which adds to the frustration. All-in-all a more poorly paced game that has issues with the story and the presentation.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SGG I love that you made a sequel for Hades but for the love of god, why do I have to move the mouse cursor just to attack, instead of clicking my mouse and attack where I'm facing, you didn't have this problem on Hades, why isn't this not yet implemented?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I believe this game doesn't do a good enough job of living up to the narrative standard its predecessor set.\nI find myself skipping over dialogue becasue it isn't as interesting or related with the story of the game. \nI expected much more and was left a bit disappointed. \nThe gameplay is fine however.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hades I was really great. \r\nI played Hades I until I cleared all achievements and jumped to Hades II right away. \r\nWhat I don't like in Hades II there are simply much more conversations, which are also longer and characters speak slower. A lot of description for everything. In 1st game I red it all, in 2nd it was just pointless and not fun. \r\nThe direction in game is not really clear, sometimes stuff just pops up, other times you don't really know what to do..for example with some major Prophecies. \r\nThe story is mild. I don't like the end...c'mon!! \r\nThe whole thing just looks sloppy comparing to Hades I. I don't see that someone enjoyed even making this..simply not worth it. \r\nBoring. Sorry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Supergiant were the masters of \"Narrative through gameplay\" approach, and I know it's not fair give a negative review to an on-average-good-game because you know that the people who did were capable of so much more, but it has enough good reviews so I will do it anyway.\n\nI don't how it happened. For years, this studio entire focus was telling unique narratives that can only be done in a game format. And then, with Hades I, they nailed it. Hades 1 told a family drama story that had no villians, no heroes, and no seemingly no stakes, and it was beautiful, because the story fitted the rogue-like gameplay so well. No one else could have told this story. If it was a book or a movie, I wouldn't watch, read or care about it. But as a rogue-like, it was a masterpiece.\n\nHades II has the same gameplay, improved even, but the narrative is backwards. Everything is serious now, the stakes are infinite, the villians are bad, the allies are desperate... but the gameplay is still telling the story of Hades I that doesn't exist here.\n\nDoes the long journey of SuperGiant end with the conclusion that no one cares about narrative through gameplay, if the game is fun, the art is good and the memes are viral? If so, the ending of this journey is so much worse than the ending of Hades II itself.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "why does the game not give me boon for my main abilites (attack, special etc). i am in the third area without encountering them with multiple boons too. the first game always made sure i got em",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Early access has always been a business model I'm suspicious of, but between what I've experienced of their track record and the good will people have for Supergiant, I gave it a chance. The gameplay was fun, the music and dialogue were engaging, and I was interested in the story taking a different direction than the first game.\n\nUntil the game released and I got to the ending. Without too much spoilers, everyone gets hit on the head with hammers and thinks they're back in Hades 1. Very disappointed, but whatever, the gameplay holds up and it's fun to do that at least.\n\nUntil a month after release, where the studio releases a patch \"fixing\" the ending by adding a bunch of additional content throughout the game I'd have to restart to experience. There was no admission upon release that the story of all things was not done for the 1.0 FULL RELEASE, and from what I hear of the amount that has been added, I doubt they weren't already working on it leading up to and during release. Even if that's not true, I don't know how they wrote that non-ending and decided it was good and released it.\n\nGame is fine, but don't support developers releasing unfinished games. It's exhausting at this point, and now I have another developer to add to the \"not to be trusted list\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't recommend a game where there's a studly-imagined Odysseus and they won't let you peg him.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't stand how this is even more meta-progression focused and decides to split the fucking game into 2 paths (lol and multiple Gods are locked behind this too.. wth) instead of adding actual room and encounter variety which this game lacks in even more than the 1st game as well. Enemy design is safe and lacking. Everything just feels safe as hell. Nothing wowed me even close to the last 2 areas and boss encounters of the 1st game.\n\nThe fact that the rat miniboss in Oceanus is something you can encounter past the 1st time you see it too.. wow, peak fun. Peak game design having to read an instantly dashing tiny ass rat you can barely see on your screen while you're bombarded from all sides. Who the hell designed this?\n\nGame is good overall, but I'd prefer to be critical considering how overblown this game's praise is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I personally don't like this game because it is not dark enough and relies on addictive elements such as progress through dying. It is good technically but not edgy enough for me, and I don't like the voice acting because they remind me of people in real life, and I don't want to be reminded about that. \r\n\r\nI'm going to make a vote against this game, but I'm sure many of you would like this game for the same reason I dislike it. \r\n\r\nSorry.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "everything has too many mechanics--bosses, character upgrades, weapons, gathering, crafting,  etc. Its an exhausting grind for very little reward in terms of power gain. It takes hours until you are even given the crafting recipe to allow you to see whats needed for weapon upgrades. Every single one of the mechanics is like this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A bit of a different experience from the original Hades, some things are better some aren't. Story wise it has its ups and downs. Melinoe is everything that Zagreus isn't (which is very good honestly, doesn't make it better or worse, though). What we fell in love in the original is there, but also the Steven universation... The old story of old dude can do all terrible things and get a pass. There are better ways to solve a conflict, talk no jutsu is one of the worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "better gameplay, worse story. \r\n\r\nI got a white antler keepsake on the summit in a chaos run. Any game that has a mechanic that just bricks your run at the end just fucking sucks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The ending triggering condition is just ridiculous.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "... pretty not like Hades, is that a good thing? Apparently, because a lot of the game feels like someone said \"we have to do something different, because Hades was so amazing but we don't want to do the same thing again because....\" fade to silence.\n\nSo I guess the review in case someone actually reads this is that this mess is really irritating in a lot of ways.  The boss fights are pretty boring, are full of patched in after-thought mechanics, a-la the classic clone battle mechanic, the bosses are nowhere near as entertaining character-wise, the minions are kinda weird and kinda annoying, think Hades annoying minion mechanics x10, the maps I managed to play before becoming totally disgusted with the game are all reskinned versions of the originals with different names (and pasted in hazards that are not well flagged)... generally the whole thing feels underbuilt, like something solid has been stretched out and colorized through some kind of chemical process.\n\n[b]The final insult for me was being perma-slowed in a forced cut-scene that reskins you as your character's child-self to relay some kind of very important who-knows-wtf about ?, hence, if follows of course, that you get a perma-slow and half-dash effect because it makes the bizarro segment authentic because of shorter legs? lol. Also, while slowed this way, you have to search around a very large area for someone who is hiding. Think 4x the size of a basic fight room. Oh aaand add a bunch of child-speak voice lines as accompaniment, because everyone loves that cringe, or well at least everyone apparently said they loved it when it got crammed into the game at probably great expense.[/b]\n\n\nholy ****. This is unskippable, shows up directly after a run, and generally ****s up just trying to play the game which is already a pita with all the systems, characters and fun footnotes you'll be expected to interact with just on your way to the next run.\n\nPretty obnoxious. Oh well.. Hades was pretty obnoxious in the same ways, but there was a lot to love there. Here, not so much, not at all. How could anyone let something go so wrong, and not even for a good reason like an old fashion cash-out. wth... this should win the award for most inexplicably terrible sequel.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game play is not my cup of tea. The fact that they throw waves of a lot of enemies at you in several rooms and expect you to dodge all the stuff with only one dodge is ridiculous. Also, Eris debuffing you if you get too far in a few runs is stupid. If you need to pad your game play length by doing this, you have a bad start to your game. Also, dealing with Cerberus is a very large ramp up, and by the time I get to Chronos, I have very little health just because of one boss that has too much damage and AoE. I will keep trying to play the game, but I usually only do 2 runs before I have to stop because this game play is ridiculous.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Difficulty is significantly higher. If ur into the hardcore stuff, sure u'll probably like it, but if u just want a hack and slash, this second game is much more involved than the first. very frustrating. the supposedly roguelike mechanisms where u get stronger through prior failed runs don't work at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I truly enjoy this game but EVERY TIME I launch it forces me to verify the game files.  I cant recommend it until they fix this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I really like this game and enjoy playing it, just like I liked the first, but 2 in particular has a really glaring and obnoxious design flaw that is egregious enough to warrant a negative review. That is the mix of visual clutter and bullet hell projectiles in a roguelite like this. Straight up: there are WAY too many projectiles in the game, even in the base playthrough starting in the 4th zone, but it's really obnoxious when you start adding the night difficulties. It's not challenging, it's just annoying to continuously take chip damage from things you can't even see, while having to carefully kite and throw out one single ranged attack every few seconds to avoid being hit by the *literally* 20-30 projectiles shot at you or orbiting around the zone at once.\n\nIt's a game of limited health and health restore, yet there is constant chip damage from the dozens of tiny projectiles that get flung at you that you literally cannot see under the clutter of your own attack effects. I think that's objectively bad design. It's one thing in an ARPG like PoE where health regen is not a precious and limited resource, but it's strange that  Supergiant thought this way okay. It almost seems like it's there just to prevent/challenge the \"no hit\" speedrunner minority.\n\nThe randomness of if you can get your build going at all coupled with the bullet hell bullshit is really souring on the entire game, and really squeezes build diversity and viability. I really hope they don't continue this trend of tuing up difficulty by way of just making it tedious and irritating to play in their next game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It worked for the first game but I already got bored clearing rooms after 10 minutes. I think it is pretty overrated.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As a big Hades fan, Hades 2 does not make you feel like you're getting stronger enough after each run (Which Hades is all about). I've completed 21 runs (nights) and still i'm struggling with first stages, i'm not getting powerful enough to easily destroy early enemies just like we were doing in Hades 1. This game is all about getting stronger each run, and Hades 2 just doesnt give you that !",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it feels like a dlc character to the original game and honestly i prefer just about all of the characters, voice actors, and the setting of the original game by far. hilariously the trailer video you see on this page is better animated and graphics than 99% of the game and is never featured in the game. also, big gripe now that i've spent a ton of time in the game, but they really gatekeep you meeting alot of the npcs for stupid amounts of time/replays. i shouldn't need to do 4 runs trying to get a certain npc to appear to even attempt one of the contracts. that's a complete waste of time.\n\ni can chalk most of this up to my personal preference (i'd much rather be hanging with orpheus singing in a grand palace bar drinking alcohol than some run down phantom woods where you don't get a singer until far later) but the music in this game is just a catastrophe compared to the first game. if it's not some weird mick gordon doom tribute done by a 2006 devil may cry 3 fan it's literally jerking off a theremin for hours on end. i'm going to be sick.\n\nooooOWEEEEEEOOOOOWOWOWOOWEEOWOOWOWOEOWOWOEWEWAEWEWEWEWOOOOOOOOOOOOOOOOOOOWEEEEEEEEEEEEEEEEEEEWOOWOWOWOWOOOOOOOOOOOOOOOOOOOOWEWEWEWEWOOOOOOOOOOOEOWEOWOEOWEOWOEWOEOWOEOWEOOOOWOWOWOOWEEOWOOWOWOEOWOWOEWEWAEWEWEWEWOOOOOOOOOOOOOOOOOOOWEEEEEEEEEEEEEEEEEEEWOOWOWOWOWOOOOOOOOOOOOOOOOOOOOWEWEWEWEWOOOOOOOOOOOEOWEOWOEOWEOWOEWOEOWOEOWEOOOOWOWOWOOWEEOWOOWOWOEOWOWOEWEWAEWEWEWEWOOOOOOOOOOOOOOOOOOOWEEEEEEEEEEEEEEEEEEEWOOWOWOWOWOOOOOOOOOOOOOOOOOOOOWEWEWEWEWOOOOOOOOOOOEOWEOWOEOWEOWOEWOEOWOEOWEOOOOWOWOWOOWEEOWOOWOWOEOWOWOEWEWAEWEWEWEWOOOOOOOOOOOOOOOOOOOWEEEEEEEEEEEEEEEEEEEWOOWOWOWOWOOOOOOOOOOOOOOOOOOOOWEWEWEWEWOOOOOOOOOOOEOWEOWOEOWEOWOEWOEOWO\n\nkind of shocked this got so much acclaim. did ya'll even play the original?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You know, I'm just disappointed how this game is turning out. \n\nI LOVED the first Hades game. \n\nGreat fights, interesting story, fun characters,  good mechanics and it felt fun to play. \n\n- This game makes Melinoe feel worse than Zagreus.   I know they were trying to make her OWN playstyle different from Zag, but they shouldn't sacrifice a good movement for it.  It just feels dumb to me. \n\n- Lack of Dash boons really hurts, especially since those Boons were Hermes best ones. his other Boons just aren't as good in comparison to the old ones he had.\n\n- Input lag is also real, because when I try to dash away from the enemy Melinoe sometimes does nothing but stand there and gets hit. It's very frustrating.\n\n-Eris Boon creates an artificial difficulty spike, which is then used to punish players and speedrunners  who are playing TOO WELL and allows the game to prolong its story telling.   \n\n- Chronos is an obnoxious boss to fight against.  Getting use to his fighting style is one thing, but allowing him to have instant death attacks in his 2nd form is an absurd thing to lose to, especially if you happen to make a one little mistake and step out of the safe zone to stop one of his minions from HEALING HIM. \n\n\"Whoops!  Looks like you wasted a whole hour for nothing.  Back to the start!\" \n\nAt this point, every time I make it back to the beginning and see everyone holding exclamation marks over their heads; ready to spill some \"juicy lore\" over the story or their background. \n\n It starts to feel more like a punishment than anything else. \n\n1st Hades didn't make me feel like this.  I use to love hearing Hypnos and the others talk about themselves, but this game just makes me slowly despise these people as I try to rush through their dialouge, upgrade my stuff  and get back into the fray.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "all the good stuff in hades 1 isn't provided in hades 2 ( slow gameplay - all weapons are boring and slow )",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm Goin To Resume the Game: \nA Vegan Lesbian Who wants to save her family but First she needs to conquer some Girls xD\n\nGodly Music like hes predecessor, A Better Gameplay at certain point? as Roguelite... Story is really Bad is practically the same story as Hades xD they even updated some new stuff for the story lol. The game is too Woketoki for me its make more important the Agenda than Family stuff and is Cringe as... Hades 1 do the opposite likes has to be... i finish the game having 3 lesbian relationship, 1 Dream relationship that feels almost like a sexual assault, and 1 \"straight\" relationship xD  I felt like Melinoe was some kind of Only Fan girl more than a God... as a Roguelike Fan with more than 1,000 Hours in Multiples Roguelike Games in multiple Platforms, i always consider Hades as one of the Weakest, and the reason why is that is one of the only Roguelike that fakes the difficulty, the way they do is simple, just limit your self to not use Any RNG and play as a Hack and Slash, you see other games like Deadcells for example that  increase the difficulty based in RNG as a Roguelike not as a platformer or Metroidvania. i though they were go in to Solve this but is guess this is the way most people like this game... I'm Very Disappointed With Supergiant Games and this is gonna be the last game i will play from them, i stop playing AAA games for a few reasons, 1 Agendas, 2 minimum effort 3. Prices for what they offer in game. and this game  Meets everything i just mention this game can be easily  a DLC of Hades its feels just like a Reskin of Hades with new music to be honest.\n\nPD: Hollow Knight Silksong is About the Story of Hornet where Shes Finding out who are these Powerful Beings  named the \"Weavers\" any coincidence? well lets Keep Walking like Johnny!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "they copied PoE probably worst design by having a boss with a memory game. dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good Luck getting past the fuck you mini boss in Erebus. Can't get past it. it destroys every attempted if he spawns. I really wanted to like this game. He heals way too much too quickly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't get it It's not fun it's just mob after mob and crappy art! Once again I have wasted my money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game, but having an unskippable credit sequence that pauses when you change tabs is just obnoxious",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It just didn't click with me the way Hades 1 did.\n\nThe story for what I played seemed fine and the fact there are 2 routes was nice but the combat felt off.\n\nI dont really like any of the weapons, and the variants of them all seem rather bland. The main difference between them all was their use of the charged magic attacks that slow or lock you in place but when everything is coming at you at once and the bosses are fast as fuck these attacks just didnt land with me.\nI also thought the blessings were more boring than 1 and never once in my 7 hours managed to put together a build that felt fun or cool to play.\n\nA shame really, I was looking forward to this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trashest rogue like game I've ever played. What is the purpose of the melee weapon if u don't provide us with lifesteal or some healing factor!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "story rich combat if thats your thing but the tags on this game are all wrong... barely any action just die and repeat left and right click simulator. way to boring for me but im also not a story person",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lacks a stronger female focus in this game. They changed Chaos from the first game to be a chick, why couldnt they change Zeus or Poseidon to be girls as well? I feel like Erica Cartman in the Pandaverse.  I also dont like having an actual male hero like Odysseus in my main hub. What has he accomplished? Why isnt Nemesis more buff? Is she weak? Also, why are only 75% of the Greek gods and heroes have darker features in this game? Ive studied Greek Mythology, obviously all the Gods in the myths looks like they are from latin america or africa.\n\n Subnautica 2 did it great btw. I hope Supergiant takes on God of War next! Why isnt Kratos female yet? Also you really need to fix those gods, some of them actually have blond hair and skin.\n\nFinally, i loved the female Ghostbusters movie.  But dont you dare make Bayonetta or Lara Kroft or Samus or Liara T'Soni male. That's not cool.\n\nOh, and there always were female Adeptus Custodes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Another crappy small maps killem all open portal game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "An inferior version of Hades. Everything feels like a downgrade. Character art, weapons, god blessings and story somehow all got worse. The more I play the more it feels like a cash grab because they had all the successful components from the first game but dropped the ball on every. single. one. You can tell they listened to the \"vocal minority\" on combat design because every fight is giant F U AOE attacks, with secondary damage. Attacks that track you seemingly forever, or bosses just going invulnerable while they perform their color varied spirit bombs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The resource system is extremely tedious, it is extremely annoying to track which of the fifty different resources you need to upgrade something. Then you have to spend half an hour travelling to the final area of one of the two paths in order to have a small chance at getting one of the five of them you need for the upgrade.\r\nCompared to Hades I, I didn't find the story or dialogue engaging, and I didn't end up caring about any of the characters.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much gay stuff. I get it's Greece, but still. Ew. Makes it go from a 5-star to a 3, and then you can't even skip the end credits.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Over hyped game\n\nit's just more of hades 1 with few idiotic and unnecessary changes like farmville and crafting of items (which you'll need to craft only 1 time and doesn't make sense why it's there)\n\nit's still a fine game with good visuals and music\nthe bosses were fun, not very challenging compared to hades 1, but still fun\n\nThe ending is bad and dumb, the most leftist propaganda of weakness one could write. the ending doesn't make sense for the story, if you go back in time and tell this story with this ending, there is a high chance you'll end up burning to death.\nI guess soy boys and people who hate mythology stories will like ending like this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game sucks, play the first one, it's much better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's too tough. I know my way around rouge-lites and arpgs. But this one is uneasy. You can't help and lvlup enough to reduce damage done by mobs. And I played Hades 1. Unpopular opinion but do not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}