{
  "positive": [
    {
      "review": "I’d like to thank the developers of Icarus.\n\nI was looking for a survival game with an open world that truly challenges the player.\nAs an adult, I don’t have endless hours to spend grinding — which is unfortunately the norm in this kind of games. The sense of progression and character development in Icarus is a masterpiece.\nThe fact that the game offers a skill tree providing meaningful support for a solo players is something truly special. It’s not overcomplicated, rather subtle and perfectly balanced.\nYou don’t suddenly become a superhero, but you do feel well and fair treated if you play solo. \n\nThe atmosphere of the world is outstanding.\nThat first dusk on the planet, the distant sounds, the whispering wind, and the echoes of unknown creatures - all of it creates a powerful sense of isolation. You genuinely feel surrounded by something unknown and unpredictable.\n\nThe planet doesn’t make survival easy — the environment is harsh, and the wildlife can be hostile.\nGet too close, and you’ll be attacked. Yet those same creatures can also be tamed, becoming your companions as you venture farther from the safety of your base.\n\nFrom a crouched, frightened survivor clutching a wooden spear, you evolve into an explorer whom planning, logistics, and resource management become essential.\n\nThe lore and the world itself form a cohesive whole — every anomaly and strange occurrence simply fits.\n\nIt’s a wonderful adventure that can fill many evenings.\n\nOnce again, a big thank you to the developers. I wholeheartedly recommend Icarus to anyone seeking an open-world survival experience that is unpredictable, genuinely challenging, yet ultimately fulfilling and rewarding.",
      "voted_up": true,
      "votes_helpful": 62
    },
    {
      "review": "Purchased when on sale and feel like I got my money's worth. I would have played this a lot longer if some of the missions weren't so tedious and aggravating. I would have gladly bought DLC expansions, but was afraid the tedious missions would be the same and didn't want to punish myself any further.\n\nExploring the Olympus map:\nI really enjoyed exploring the map, but was disappointed that there were only a few biome types especially when snooping through the tech tiers and seeing items from places mentioning swamp and volcanic in the description. This led me to believe we would be encountering these places on the Olympus map, but as far as I could tell these are DLC locations. The biomes you do have don't vary much in appearance and maybe might offer you some additional resources or animal encounters. \n\nLeveling up your character:\nLeveling seemed to happen quickly in multiplayer. We were unlocking skills and tech tiers so quickly it was a little overwhelming so we spent much of our early game building a base and crafting new workbenches and storage. This is what mostly drove us to explore as we needed resources not found in our immediate area. Due to this, we weren't running the missions very much, which partly led to us feeling a bit let down and frustrated when we did engage with the operational missions.\n\nWeather system:\nOn the whole, I thought the weather system was really, really cool. I don't want to spoil too much for new players, but seeing how things reacted to weather was super exciting for us. In the long run, as you level up, it feels like it can become tedious as you are heading out to do something and a storm hits causing you a delay if you are trying to avoid it.\n\nFood & Water:\nFood is everywhere and that's a good thing because spoil times happen quickly since it's hard to preserve items. You have to salt everything not in a jar to keep it longer, and even then it goes quickly. There are enough water sources as long as you have the means to clean it.\n\nMissions: \nThis is one of my biggest gripes. Missions are not always well thought out and start in static areas so they don't take into account where you are at on the map when they are activated. On a dedicated server, we spawned in the river area of the map and not the forest. Most of the missions were so far away from our base it became tedious constantly traveling there to complete the earlier missions. We ended up setting up a second base to avoid running across the map with constant stamina drains with slower animals (buffalo).\n\nThe missions can be frustrating and the objectives aren't always clear. For the \"build an outpost\" type missions, you don't understand you are practically going to build another base (ridiculous) since they require nails or ingots for some of the workstations they ask you to craft. Or you travel to a start area and are sent to several other areas of the map. Most of these are OK, but sometimes they send you back to another area you just came from so there could be a lot of backtracking to complete their objectives. A couple of other missions closed off pass throughs to other biomes that we normally had open (avalanche) making that pass through completely useless.  Also, and this was huge, the mission pods can sometimes land IN YOUR BASE, which causes damage on takeoff. Toward the end of the Olympus map, it felt like we were only logging in to complete missions in hopes of unlocking some additional content and it wasn't super engaging after being led around the map.\n\nDLC's:\nIf I love a game, I don't mind spending the additional money on content if it's something I want. I did pick up the creature comforts DLC for this game and enjoyed it while we played. My biggest gripe about the DLC's? Throughout gameplay you constantly come across DLC items and it makes you think you are going to encounter this stuff on Olympus, but you're not. So there is a big tease for bosses and items you are never going to encounter or craft because you don't have have access to those areas. You don't understand this at first and are soon disappointed that you beat this creature and can't craft all of the items you think you are going to because it's not available to you. In that case, I would rather you not show it to me.\n\nUpdates: \nThe game receives weekly updates which is impressive. Most of the updates are not for issues on Olympus and seem to pertain to DLC content. There are the occasional items for Olympus, but the list of fixes/changes/added content seem mostly for stuff that you are not going to encounter in the base game and seem to pertain to DLC items.\n\nOverall:\nI enjoyed most of the gameplay we had until we started trying to finish the operational missions. It feels like Olympus could do with more engaging content and not rinse repeat missions, and an easier way to travel around the map like a fast travel or teleporter ( you have all this amazing tech) if the missions are never going to take into account where you are located on the map for open world gameplay. I did not experience the mission based game play so cannot speak to experience with that. Because I enjoyed most of the game, I am going to recommend the game, but hope that the devs improve the missions so they are more accessible and engaging for the open world players.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This is the first survival game that realizes different people play in different ways. I'm a solo player who likes base building and this game is perfect for me. There's just enough direction to give me goals but not so much that I feel like all my time is spent on it. Instead, I spend most of my time preparing for missions which are super quick once I get there. \r\n\r\nOthers could play differently. You can start a mission on a whole new world and fight for survival with friends. That style of game play is almost unrecognizable from mind but both are perfectly possible in this game. \r\n\r\nMy only complaint is that the directions aren't clear at the beginning. I had to go online to understand the difference between Open World, Missions, and Out Posts and I wasted a LOT of time on a mission when it would have been beneficial. Once you get started though, it's pretty easy to figure out what to do. \r\n\r\nI will add, however, that there are quality of life problems. I wish I could add spots to the map much earlier in game. I hate the idea that I'm a space traveler with inter-stellar communication but I haven't figured out how to make a charcoal mark on a map. Seems pretty basic. I also wish there was some sort of teleport between bases. Some people may enjoy the grind of having to walk or ride everywhere but I'm a busy man with a job and kids. Sometimes I can only play for half an hour and it's sad when that entire session is spent walking across a snow field.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Ever wanted to just burn down a log cabin by getting out the wrong side of the bed, or be hit by lightning on the way home from your adventure, or to be killed by a giant emu because you nipped to the loo then this is the game for you.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing Game, \n\nCan be played solo or with friends, Many missions per map.\nthe developers go beyond what other ones tend to do. Icarus has weekly updates fixing bugs, adding new content for free etc...\n162 hours in at this review. Skipped the first map and went to the second, once finished the mission I will be going back to the first. before i take a crack at the 3rd, and waiting on the 4th.\nworth every Penny for this game, there is a few bugs here and there but always expect that when a game is always being worked on.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best Survival crafting game I've ever played. Totally worth it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I originally played in 2021 when the game released. It was fun, but eventually I bounced off since it was quite repetitive and felt unfinished.\n\nNow, almost 4 years later, a lot of love has been put into the game by the devs and the experience is pretty amazing. The open-world + operation fixes a lot of the tedium that was associated with constantly starting over. This has allowed me to fully explore the map and truly build and live in the world.\n\nThe devs continue to update the game and add DLCs which add significant playtime to the game.\n\nIf you enjoy base building, exploring, strategy and organization with a dash of challenge, you will likely enjoy Icarus as much as I do.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Love the game, always something new and enjoy playing with friends.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've played a lot of survival games. It's my favorite genre. I've dumped countless hours into them. This one is one of the better ones I have played. It's been out since 2021 and is still getting regular updates on top of it.\r\n\r\nOne thing I love is it forces you to explore beyond your base. Resources are finite, at least for the first part of your experience. Finite resources means you have to explore farther and farther out when you need more materials, meaning you explore more of the map and come across new creatures and biomes. (Yes, you can respawn resources with certain Tier 4 technologies, but those are a ways off)\r\n\r\nThe co-op is a blast. I've been playing mostly with my buddy and it's been a good time the whole time. The game can be a chill building simulator where you and your friends can make a nice base, or you can take on missions together. \r\n\r\nThe mission variety is good. You have simple missions which are usually quick and relatively easy, good for farming xp, and you have campaign missions which force you to explore more and more of the map, often sending you far from your base. Some of the campaign missions even unlock new biomes for you.\r\n\r\nThe game is very pretty. A lot of the views are very picturesque and the landscapes are beautiful. The devs outdid themselves with the aesthetic visuals.\r\n\r\nI have a few nitpicks, but nothing serious enough to detract from my enjoyment of the game. (Tamed wolves not having a 'stay' option like the mounts, fishing lures not always working as advertised, non-refrigerated food's overly quick spoil timers)\r\n\r\nOverall I would wholeheartedly recommend this game to anyone who enjoys survival games. It gives you the tools to have just a chill base-building experience to survive and thrive, or solid exploration for those who like to get out and do things.\r\n\r\nBeware the polar bears!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Short review.\n\nAside from optimization issues, game is a nice survival game, nice visuals and a silly ( in a great way ) update history.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great open world survival game. You can build your base, green house, connect electric devices all around the map with incredibly short but infinite and free power cables (LOL), fight world bosses, complete missions, and also not play open world and do just deploy and extraction missions.\r\n\r\nAlso there is kinda big (not really complex like in PoE) talent tree which feels like the good old WotLK where talents sometimes ment something and sometimes they were just +5something, well it is good balanced overall in my opinion. Some stronger, some general, but it helps in the end.\r\n\r\nAlso there is Tech tree and each and every piece of equipment and building you have to unlock.\r\nFor every action (missions) you get orbital currency REN and can buy some niche things to help you during your journey. It does really helps and is fun to unlock (research) and buy.\r\n\r\nCan reccomend for everyone who likes open world games or extraction games. I cannnot believe it I found it just a few weeks ago.\r\n\r\nI am finally max level 60 and killed some world bosses but I still have so much things to do. Also when I finish with base campaign, I will for sure buy New Frontier DLC and start/continue there, then buy and do some Great hunts, and then maybe Styx?\r\n\r\nI bought the game for full price and would do it again, absolutely zero regrets (made way worse purchases in the past), maybe I will buy even some DLCs for full price to support devs (even when you can grab it during the sales for 60 or 80% off), it is (for me) just that good and well worth it.\r\n\r\nWell, better got to it again. xD",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is addictive and enjoyable, and what I loved most is how easy the building system, designs, and overall gameplay are.\nThe main highlight is the beautiful and stunning world of the game, especially the variety of environments.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Watch for the bears... and the boars... and the wolves... and the... yeah, I'm just going to say don't touch the wildlife and you should be fine... well then there's the weather, and the infections, and the parasites, and... where was I going with this... right, nature bad, just stay away from it all and you might just make it out alive. (spoiler, you won't)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So far so good, honestly a good calm survival builder. \ngood amount of exploration, crafting and resource use for items.\nSo far from what i've read the player base seems mostly happy with Dev progress on things so thats hopeful for the longevity of the game.\nDo have an issue with trees where some lumber will roll into the ground never to be seen from again. \n \nDelving into the other biomes soon but i do see that it could use some things to help bring life to the game (more immersion if it may)\n\n-Perhaps NPC stations (Small trading posts for excessive build up of items.)\n-Enemy prospectors (NPC enemies, add a little competition with the companies and difficult ranged enemies)\n-More natural alien predators. \n-Huge cave system addition to maps for rarer resources and untold dangers/horrors. Make them huge, long and dangerous.\n-Random encounters on maps (like finding a random previous prospector house or storage chests, rare animal or alien creature encounters, or hidden missions for unique gear or resources.)\n-LEVER GUNS!!! (sorry, can never have a enough of them, plus prospector... goes hand and hand.)\n-A random map generator for maps that are completely random.\n-Just cause, MORE DANGEROUS ALIEN LIFEFORMS!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great Sci-Fi survival game. The devs have continually improved the game since launch and are still putting out weekly updates of varying sizes. \n\nIf you're just starting out, I recommend doing several of the missions before starting an open world. If you jump straight into an open world with a fresh character you won't have very much direction or goals for a while. Doing missions lets you learn the game and accumulate currency and skill/blueprint points. Once you've leveled up a few times, you can grab the Contact Device which will allow you to make the most of an open world map.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very good game with alot of content I have enjoyed playing this game in open world doing missions and so deciced to get the new frontiers dlc .\n\nI do have one negative id like to add \nI feel that if someone duz a mission on your map and it edits the game files from some dlc you don't have messing up the way you like to play \nId like to see only the map owner being able to access the missions if it can edit the map in some way .",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "SO. ESSENTIALLY. If I'm to summarize this game, it's a tightly put together game focused on survival crafter experiences with a roguelite flair. This game is not for normal people. I am not a normal people. \n\nOriginally, the game had not launched with a traditional open world \"Do as you please\" sandbox style of survival crafter. Instead, and what's still the focus, is the idea that you drop in from orbit to accomplish a contract, then leave the planet. This requires you to drop in with, generally, nothing. Grab rock, bang rock, put rock on stick, unga down the wildlife, drink river water, get dysentery, continue stick and rock and more rock and stick until you wake up with a shotgun. \n\nWhat helps set this apart from other games like Enshrouded, is that the gameplay loop is extremely concise. It's not like other games where you have to depopulate the walrus for the one is ten chance for it to drop a factory new taint, where you need seven of them to craft a 5% better hammer to build your furniture faster. This game is FAST, there's very few base materials in any given tech tier. At the stone age you've got abooouuut eight different materials? Half of which is just pick up every bush, rock and tree you can get your hands around. Building a base is SUPER fast, with only mildly finnicky snap mechanics. The resources you DO get are in decently large quantity as well, so it's easy to piece together large, LARGE bases with only a few hours of work. The same cabin I slap together within minutes of each drop would take me /hours/ of grind in games like Runescape: Dragonwilds, Enshrouded, Valheim, or any of these other titles that I love. Even when you're teching up into metallurgics, the materials don't become varied and diverse until way, waaaay later on. It's a little like Factorio or Satisfactory in how materials can feed into new types of materials and become more mechanically interesting. \n\nThe game is F A S T.  You scrounge fast, you build fast, you do your mission, you leave the planet, and everything on the surface gets reset. The game has several ways of trying to convey the idea to you that everything is temporary, don't be careless about stuff, but also learn to let go. Your base won't be there in the next drop, and that's okay. Your longbow that you popped twenty deer with won't be around forever, and that's okay. Pick your next mission, take a breath, dive in. The ACS has money, you won't get any of it staying in orbit. \n\nI do have some genuine criticisms. The game can be frustrating at times, when the animal spawn mechanics decide to light a polar bear under your ass. You could be having a merry stroll through the woods, when OOPS bear. Even worse is just trying to get through the desert, just point A to point B will see you fending off cougars like a twenty-five year old quarter back in an Applebee's. The amount of wildlife that live their entire lives, going about their own survival and building up nothing but pure HATRED for the player is insane. These critters coexist just fine, I've seen zebra and cougars/hyenas just hangin' out like gators and capybaras, but THE MOMENT one of those silly suited up people creatures show up, OH IT'S ON. They will throw themselves by the dozens into spiked walls just for the mere opporotinity to bite your ankle, it's absurd. \n\nBeyond the frustration, building is a little jank. It's ALWAYS jank in these games, and I can't expect the same amount of autism spirit bomb levels of detailing that games like Avorion and Vintage Story allow me to get into, but there's lots of pieces that are just... missing? yeah there's pieces straight up missing. Pieces such as the middle roof bit for half roofs, so you can use half blocks to create a nice, gently sloping roof on a house with odd dimensions. Or the wood beams that are diagonal but don't point in one of the four directions. There's also plenty of bizarre grid snap interactions the moment you start using the beams in the first place. The lack of terrain modification... I understand, but it does often lead to dirt poking up through your floor. This has caused me to just raise all my houses off the ground, it works. Also the foritified walls are direcitonal, but I've not seen them actually display their direction, which can lead to instances like the one where I built a wonderful little defensive perimiter wiiiiith all the spikie pointy bits pointed at ME. That... didn't work so well. Tearing down the walls to spin them around lead to me falling into a WWE cage match where every time I defeated the two cougars I was currently fighting, a scorpion, or hyena, or more cougars would just pop out of nowhere and bonzai charge me. I'M JUST TRYING TO WALL. PLEASE. LEAVE ME BE. \n\nGAME IS GREAT. Game is not for normal people, BUT IT'S GREAT. If you're a survival crafter FREAK like me, this game is crack. This game is C R A C K. Say goodbye to your family, to all your important things to get done, because the UDA is building a new station and they're paying you a handsome amount of ren to get them a ton of glass and oxygen bladders. Get to it, prospector.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely love this game. I adore that every week the devs add new content in (even if it is small). It shows they truly care about this game and their fans. I am a huge fan of survival games and this one is my favorite. The one downside to the game is it takes a LOT to run. It is a high end game even on lowest settings. However, the content, the pets, the construction, the enemies, I love it all. I would recommend this game to someone with lots of spare time or has the ability to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game really scratched that survival game itch that no other survival game managed to do for me. I really enjoy the pace of the game. I also enjoy that crafting is pretty easy, and that repairing tools isn't a complete pain in the ***. Will definitely spend many more hours on this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful world, expansive skill and blueprint trees, fun and rewarding gameplay. This game is great with friends, and is very stable. I can see myself putting in a lot more hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game but paying so much for content is why i stopped playing as £16 just for pets and more money for decorations and so on . this game is good but will break the bank.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1] Excellent game, BUT [/h1]\n\nIcarus is a brilliant game, without a doubt. However it does come with its flaws and issues, like any other game. It is an excellent open world sandbox game, that's for sure. However, before you venture onwards. The two biggest issues we found:\n\n[b] Missions: [/b]\nThe missions and campaigns in open world are questionable. The biggest issue we found is simply the lack of information provided to the player, which often led to frustration rather than enjoyment. A prime example was a mission where we had to go and find a bandit output. Once we got there, the game then informed us we needed to power 10k into a radar - we did not know this, and thus we had to cross the map to get the resources and then go back. Only to then find out we also needed a beacon as well, which resulted in a third trip. So much time was wasted and our enjoyment was at an all time low.  Missions need to be clearer on what needs to be done in advance. \n\nMission rewards are also not worth the effort and time you spent. We had to introduce a mod that made the rewards better.\n\n[b] Performance: [/b]\nPerformance is iffy as the world goes on, I can only assume due to the sheer volume of stuff building up behind the scenes. We noticed our FPS dropping as we played. This is noticeable on Olympus, the later DLC maps seem to be better. But overall, improvement is needed. Running an i7 with a 4070ti on Ultra with DLSS, averaged 200 FPS which lowered down to 100-80 as I played.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I dont know if it'd be an amazing game solo but if you get a dedicated server with a couple of friends and do missions when everyone is on then this game is spectacular. Yeah there's a good bit of jank and there needs be some quality of life changes such as pinning recipes like you can on Satisfactory, but all in all there's plenty of fun to be had if you take the time to learn the mechanics.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great for solo or multiplayer even if you are playing both with the same character. Seamless transition between them. \nThey have a lot of story content and continue to add more. With weekly updates usually adding items and or content.\nPlus many DLC's to give even more variety.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have not been able to stop playing, updates regularly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After years of update the game came a long way from its initial setup, no longer are the mission timers ticking down in realtime (I am kinda bummed about that as it was THE feature that got me to pick up the game initially) now we get to play with a persistant open world (sadly missions are non repeatable but thats also understandable from the technical side)\n\nits really fun solo thanks to the solo tree bonus, but just as good if not even better with others",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nice open world lots to explore and find, building is pretty good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Comes with an expanding tech/talent tree system, regular patches, and several operations/missions that are both challenging and rewarding. The dedicated server system while still in beta is very buggy. Two other players and I had continuous issues with even seeing servers listed at all, despite several restarts to both the application and our PCs. \nVery fun, lots to grind, constantly improving, but still with its flaws.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I both love and hate this game. Open world solo grind is rough but still enjoyable, only thing that I don't like is how you lose everything on your person when you enter your dropship, lost a composite armor I forgot to take off when trying to go back and put on a newly crafted envirosuit. Many other games retain persistent inventory across worlds, so I'm not sure why this one requires you to drop in with nothing on your character but your suit. Also, not sure why but you are kicked clear back to the character select screen whenever you leave in a dropship and it's not intuitive about how to change envirosuits in the first place, you do it when dropping into a world/mission/outpost rather than on the more obvious loadout screen. The lore leaves some to be desired too, for some reason you have a space-faring people that can't even spare their pioneers a complimentary pocket knife, oxygen tank or even a basic canteen to put their dysentary-laden water in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed this game.  Playing the beginning part is fun.  However, since the Devs stopped the mines from repopulating resources it has gotten difficult and no fun at all.  Apparently you need a \"thumper\" to repopulate the mines.  The thumper takes some rare and exotic materials to make, more difficulty to add to the stack.  This is unfortunate because I would recommend the beginning of the game but not after you have played out all of the mines nearby.  Then good luck sniffing around for more untapped mines.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "RocketWerkz has given me a new faith in game developers that they care about making and updating a game that the community cares about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game with large map. Survival with missions and operations. GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have many hours in this game...I started the game when it was in beta and have loved watching it evolve into what it is today and excited as to where it is going...I played when the ores were outside on mountain sides and when skunks would steal your food...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, love it lots. Very in depth and long form gameplay, great for small groups to have a long term game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4 years after release and this is a great game that keeps improving. Weekly updates, lots of content, lots of fun and challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but difficult to make it look good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is right up my alley and I keep coming back to it. Kind of wild to think that they've been doing weekly updates, big or small as they are, since launch.\n\nThe progression is nice, even though I feel like the first ten levels are a bit rough, but from the it's pretty good.\n\nThe talent trees are nice. Lot of very useful talents, but also some less useful ones I don't see myself ever using. Fun to experiment with though! Blueprint points per level seem good and it's nice to know you continue to earn them after the level cap of 60.\n\nVery glad they switched from purely session-based missions to allowing you to build outposts and open world stuff too. Personally much prefer persistent worlds over session-based ones so you can play and progress at your own pace while still having a good amount of variety available to you. Nice to go out on a mining trip for a while, come back to base, do some inventory sorting and then do a mission or two.\n\nSometimes wish they'd allow you to work with half tiles better though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played many Survival Games, but Icarus is one of it's kind and truly a uniqe Gem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "me and this game have a love hate relationship most days i hate how it picks you yes its a hard game ridiculously tedious tasks for building mining and yes everythings out to kill you lol but im still playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh, Icarus.\n\nBuilt a huge house into a river gorge where it entered a cave...  3 stories, all the storage and crafting and such you could want with a destroyable bridge for access so that none of the wildlife can get in.  Spend hours building house, setting up crafting, decorating.  Built it out of wood.\n\nThunderstorm happens.  No big deal, I'll just wait it out in my new house.\n\nHiding inside from the scary lightning....\n\nHouse is suddenly on fire.   Multiple floors simultaneously.  OF COURSE I haven't made a fire whacker yet- what would I even use that thing for?\n\nNo more house.\n\n10/10 would build a flaming deathtrap and lose it to the weather again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’d like to thank the developers of Icarus.\n\nI was looking for a survival game with an open world that truly challenges the player.\nAs an adult, I don’t have endless hours to spend grinding — which is unfortunately the norm in this kind of games. The sense of progression and character development in Icarus is a masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4 years later, the game still needs some work. However, The Devs have continuously been updating the game with patches, expansions, and DLC. This is the one game I consistently come back to just to experience the changes they've put in each week. Is it perfect? No. Is it worth 34$ USD? Absolutely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game since Beta. It's come a long way and is a great survival game with some different and good mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "literally has had weekly updates since it launched (more of less, as far as I know). This game has everything and is super easy to lose yourself in - I don't have any of the DLCs either. \n\nAbsolutely worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good survival game \n9/10\nbit expensive with all Dlc etc my only gripe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome! Innovative and always being updated by the Devs. Keep up the good work and continue to make this game even better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "while the game does have some jank and frame rate drops, i believe that is caused by how the world data is stored, ie trees being chopped down, mining nodes being mined, etc. setting up a dedicated server on my old laptop for me and my friends has mostly mitigated those issues.\r\n\r\nOverall i have really enjoyed Icarus, for me it scratches the survival itch like some others don't, and the ability to take your character between saves, both your own and other players, makes me more willing to put another 180+ hours into the game.\r\n\r\nAs far as gameplay is concerned it plays like most other survival crafting games, you start slow with easy to build, though weaker, weapons, armor, and buildables, but as you progress into the higher and more complicated tiers and complete missions the gear and such get a lot better. Back to the character transfering between saves thing, as you progress through missions and harvesting resources on the world you can earn currencies that you can spend while \"at the space station\" which is what the game calls the lobby you are in when you have selected a character but haven't loaded or joined a save/mission, for gear unlocks that you can buy multiples of once unlocked to drop into new games with, or call in on existing saves, speeding up the start of a new save, or even making some missions speed runable for more currency to spend. \r\n\r\n8/10 would recommend and be willing to buy for a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love survival games. And this is survival in its purest form: originally you'd have to start over with each mission, now you can play in an persistent open world, but this game still offers a compelling mix of survival mechanics and exploration that's hard to put down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd heard so much about Icarus when I first bought it, but good and bad. I'm glad I decided to give it a try, it's quickly become one of my favorites! Sure there's alot of grinding, but that grind is rewarding. I love that the devs are still constantly updating and adding to game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game to play with friends. The mission mode can get repetitive but now that they have added open world, the game is much more enjoyable. You can complete the missions on your time and continue on the same world rather then building your base over and over. The game has come a long way. Give it another try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very laggy, doesnt work well on mid to low end pcs, the system requirements are also wrong. you NEED 32 GB ram to run this without crashing. (at least in my experience).\n\nOther than that an absolutely brilliant game. you will enjoy this game if you like grinding resources and progressing through bench tiers. Being a mission based game your progress does reset between missions however there is an open world where you can complete the mission and still keep in world items. \n\nOverall, a very good survival game with very good mechanics, and it gets updated consistently.\nRating: Dont try to dodge bears in multiplayer / 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was easy able to lose track of time when playing this game.  With an attention span of a squirrel, it rare to play a session greater than 2 hours.  This game I get wonderfully lost in time as I venture around.  The developers are always tweaking and introducing something new every week is an indicator this is a project of love and care.  100% back this game.  I even bought all the DLC even though I'm still working my way though the first area's missions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like survival games this one is great. It's different than most because you can load into different \"saves\" with the same character, and the progress on one save impacts that character everywhere, even on friend's games. The marketplace where you can purchase items is a nice change as well, allowing you to start a new run with some decent gear of the bat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My husband got this guy for both of us to play and  I wasn't sure how I'd like it, but its pretty fun. I have a whole greenhouse and became the medic/homesteader of the group and its really fun. Lots to do in the game and lots of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tons of content on 3 different maps and outposts for the more laid back and relaxed type, fits right in in the survival genre while also giving different options for playstyle, be it solo or with a group, doing missions one at a time or completing all of the operations in an open world, all the way to hunting down and farming bosses for that lucrative purple ore that every prospector seeks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and unique gameplay would recommend to play with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my go to games when I want to relax and just build.  I love the fact that there are so many things and materials to build with.  I definitely suggest this game to anyone that just loves to farm materials and build awesome base homes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great open-world-survival-craft game here.  More fun with mods too. Weekly updates from the developers is nice. Some quirkiness with late game play due to so many things accumulated by then, but still playable. All expansions just add to the story line more. Fun questing along the way.  Achievements where fun to get (118/119), but that final one is still bugged it seems. (spend 5 hours in the null sector)  Tame some wolf pets early on and the game is much easier to play (solo or with friends).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. 5/5. The graphics are awesome and the fact the devs have released an update every week is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game and enjoying the new DLC content. So much to explore and build.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for playing with mates, takes a while to get to the later stages but it feels very rewarding to design and set up systems to make the game easier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to spend hours hunting and building",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent game, with beautiful graphics and a great story. I also like that you can do a lot of things on foot. The building system is excellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game on Sep 26, 2021 and I dont regret it. I love the fact that they still update this game and add new content every week. The modding scene is still very alive after all this time. I enjoy exploring the maps and finding those bigger caves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game and the graphics are great would reccomend to you if you like open world survivals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lonmg,gruling, and can get boring. But good long game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{Graphics}---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ Paint.exe\n\n---{Gameplay}---\n☑ Very good\n☐ Good\n☐ It‘s just gameplay\n☐ Mehh\n☐ Starring at walls is better\n☐ Just don‘t\n\n---{Audio}---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}---\n☐ Kids\n☐ Teens\n☐ Adults\n☑ Human\n☐ Lizards\n\n---{PC Requirements}---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boiiiiii\n☐ Ask NASA if they have a spare computer\n\n---{Difficulity}---\n☐ Just press ‚A‘\n☐ Easy\n☐ Significant brain usage\n☑ Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isnt necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You‘ll need a second live for grinding\n\n---{Story}---\n☐ Story?\n☐ Text or Audio floating around\n☐ Average\n☐ Good\n☑ Lovely\n☐ It‘ll replace your life\n\n---{Game Time}---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{Price}---\n☐ It’s free!\n☑ Worth the price\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{Bugs}---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\nFor an added layer of context, I purchased this game over 2 years ago and have never stopped enjoying the progress the devs have continued to make week by week. the game itself has went down a story path that I love so far, especially with the missions associated with the Great Hunts DLC. Outside of the story, Icarus is rich with exploration and crafting recipes that'll give you hours of content to play and enjoy. I am very excited to see what the newest DLC has in store for us Prospectors!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having played this game on and off since it's launch, I have always loved how they've kept up on the weekly content updates. Every time I come back to this game I find it more and more appealing every time. I've barely scratched the surface of missions, but I am enjoying them more and more as time goes on. Best played with friends, but solo can also be pretty great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely one of the greatest games I have ever played. Stunning visuals, amazing survival. Pure bliss!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very good game. Beautiful graphics. You land on a earth-like moon/planet and you have to survive. You have to get water, food, oxygen and build a shelter. It has an extensive tech-tree with a lot of things to research. You level up and get better and smarter :-) There are roaming animals that can attack and kill you, but after a short while you can easily kill them. There is a big mission tree where you can do missions. You can choose to do them from your spaceship or to do them from an open world. The developers are very active and the game is updated every week. It takes some time getting into, because you have noone explaining things to you. So you have to experiment or look on the Internet. There are also constant weather events and different biomes (dessert, forest etc). You can sink hundred or maybe thousand of hours into this game. It is definately worth its price. The only downside I find is that the dlcs are way too expensive. If I want to get some nice cats (pets) I have to pay $15! I think the developers should change their economic system, to attract more players, with lower prices on some dlcs. But the new planets, should be more expensive, naturally. Anyway, a big thumbs up for this magnificent game! Go play it now!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The devs constantly provide free weekly updates and are committed to keeping this game up-to-date. Not many do!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed very much 50 hours of this game, and for 35 dollars thats very reasonable.\n\nBUT i will say its such a blast of cold water seeing all the things that should be in the base game be a DLC. Late game stuff feels stupid because everything that could be a threat can be killed before tier 4 items. you have to get DLCs to actually get cool enemies to kill, which i refuse to get on principle. \n\nNot complaining too much, tho. good 35 dollar game that DOES fall flat at the end. i almost downvoted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ICARUS is one of the best open world survival games I've played. The mission set up is enough to keep you playing and the Dev's are constantly adding new stuff and giving weekly updates. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play this game solo, or with friends. Just play this game. The devs ship updates weekly, and it keeps getting better and better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most fun you can have on a planet that wants to kill you with every molecule of its existence.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had huge grinding at the start of the game, but its now much better. instead of restarting with every mission you can just be on an open world, grind to the last tier of building (t4) and keep that base to complete all the missions in one go without a time limit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "300+ plus hours. I've chopped trees, mined ore, fought a wolf with my bare hands, build a home and all the weapons I could ever want. Ive done it all...\r\n\r\nBUT im sitting in the main menu about to boot up the server and work on my castle. I cant get enough,\r\n\r\nGo hunt some giant creatures and fight in the dark with cave worms. \r\nDevs...for the love of god, give me a ATV to ride",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best survival game I've played. Has everything: survival, base building, leveling, exploring. And something I didn't know I needed until I played this game, missions. The missions keep away the stagnating feeling I get in other survival games once you get everything \"done.\" The game also continues to be updated with new content to keep things interesting. Solo play is 100% possible and actually enjoyable, most other survival games I've played become almost impossible to play alone after the beginner levels. Group play is also done very well and I can play with others when they available but don't have to wait on them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lovely game Keeps u on your toes at all time it better with people if people are wondering but a great game either way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I consider this game the best survival game of the early 2010s style survival games, jank included. You can do free play or what I prefer is the missions, which give each run an objective.  As you complete missions you get money to buy upgrades to start new missions with.  The devs have a clear passion for the game as they have updated this every week since launch without fail, from bug fixes to new content, mostly new content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very fun to play. Only issue - crashes completely randomly out of the blue, not sure how or why - the last crash I had was literally 5 seconds after i crafted a load of copper wire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game and gets a lot of updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Forget the bad reviews, the games awesome.  People are mad due to caves being 4 types and such but really this is like rust without the downsides, only there's a storyline and you're hunting animals not people.  Devs keep up the good work!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the gameplay and how the missions have specific objectives and are timed, instead of the do your own thing vibe many survival games have. New frontiers and Styx were fun. Only negative is the lack of optimization and weird glitches sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game i would recommend this game to anyone that i know im slowly getting the dlc as i cant afford to out right buy it all but im loving the new stuff They are always coming out with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "seams like good game so far.  devs seam to be on top of things with weekly updates and new content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game even solo; lot of interesting missions to choose from, and tech to try out,  some semblance of a story, and frequent updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got a small group of freinds playing on a private server, great game would rebuy to support devs as they update weekly with new content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Icarus offers one of the most immersive open world survival experiences I’ve played in a long while. The scale and variety of its biomes—from dense forests to scorching deserts and frozen tundras—make exploration feel endlessly rewarding. Every environment is beautifully crafted, and venturing further into the wilderness always brings new challenges, resources, and surprises.\r\n\r\nWhat sets Icarus apart is how alive its world feels. Weather systems, wildlife behavior, and environmental hazards constantly keep you on your toes, making survival more than just a checklist—it’s an adventure. Whether you’re building a base tucked into the mountains or roaming vast plains with friends, the freedom to carve your own path makes each drop unique.\r\n\r\nIf you love open world games that combine exploration, survival, and stunning visuals, Icarus is a must‑play. It’s a world that begs to be discovered, and every journey feels like a story worth telling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been enjoying this game for some years now and seeing the devs take a lot of care in making it an absolute masterpiece is a damn good sight to behold. \r\n\r\nThis game is easily my #1 in the survival crafting genre, with weather that can kill you if you're caught out in the open, creatures that can make your life a pain and a visual beauty like no other I've seen, every survival fan needs this in their library! You're free to just run missions, build in a sandbox or mix the two with open world, there's something for everyone in this game. The weekly content updates are also a cherry on top and if you don't own this already, I recommend you change that!\r\n\r\nDevs, you are doing amazing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in itself a nice (solo / co-op) game which still get's updates\nthough if you want everything DLC wise it's quite expensive.\nif you are unsure about it try the basegame on a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Icarus is a wonderful open world with challenging missions, a rich smorgasbord of crafting and building, and beautiful graphics to explore!  Survival, building, combat... its all here!  I love this game, and bet you will too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an amazing game. I enjoy the twist on the survival genre.  The mission oriented aspect changes how you see the game, and drives you to explore other portions of the game. GREAT JOB TO THESE PEOPLE FOR THIS GAME...THANK YOU!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a splendor game, jolly fun with or without companions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, if u really like hardcore and somewhat realistic survival this is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game gets better with each update. Developers remain active after a number of years, adding items, missions and content to the game as well as improvements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The visuals are great, the missions are tense, and progression feels good, but the game can get repetitive and performance drops happen sometimes. still, im enjoy the crafting and survival. Its pretty solid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun game that I enjoy playing a lot. I really appreciate the aspect of the open world, but I don't really like the fact that as I'm working inside my base or just doing anything if I'm not crouched, the Terrenus appear to keep coming and attacking me from out of nowhere, and I can't even hear them before they suddenly attack me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game. Graphics, sound and combat are very good.\n\nAt first I was fighting the elements and avoiding animals, barely surviving inside a carved out rock... now I have a fairly large stone brick base with running water and electricity, full armour, a horse and a powerful shotgun, to name a few things.\n\nStill there are challenges, waves of mobs and bosses to overcome and connecting and gathering all your resources can be arduous but is necessary if you want to excel.\n\nIf you like extreme survival games and crafting, go for this one. You won't be disappointed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game. many hours into it. and they still pump out updates, it's great.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game was alright, but there is simply too little content for the base game. You need to buy the expansions, but they are way too expensive.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "ICARUS is a very weird lil' game.\nOn one hand you have a somewhat complex skill-tree and tech-tree, with roughly a bit more than a dozen different materials you can mine and use but the longer one plays, the faster one realizes that the game's very, very shallow.\n\nThere are weird bugs, questionable design choices, a wonky multiplayer but most critical, there's no real sense of progression.\n\n[h2]The Good: [/h2]\n+ The open-world is really big. It contains a couple of biomes and they are interconnected via pathways, tunnels, etc.\n+ The setting is very interesting, being a prospector on a hostile planet on which the air is toxic.\n+ Building is snappy and quite easy to do.\n+ Tools and weapons have a clear use but can be used outside of it as well (for example as a weapon).\n+ Some graphics, especially for the animals, are quite well-done.\n\n[h2]The Bad: [/h2]\nHoo boy, where to begin...\n\n-- The Multiplayer is glitchy. From fires that continue to burn to weird animation for downed players.\n--- There is no sense of progression in the game. You can stay in your starting biome and farm XP till you are max-level and build then build your base. There's no real need to travel, there's no challenge to overcome to unlock the next tier. It's blunt and boring farming.\n--- A good part of the game (which might give some sense of progression or danger) is locked behind DLCs that cost over €100+. I don't mind DLCs if they are substantial and are build on top of an already well-made game but ICARUS is not a well-made game and the content of the DLCs is sometimes a bad joke. There are developers who bring out better content updates for free.\n-- Animals just feel... artificial? You find all sorts of animals all over a biome and there are no nests, no territorial behaviour, no nothing. They just spawn in and exist and don't feel like part of the ecosystem but just to be a farm for easy food and XP.\n-- I honestly don't understand why we have such a massive skill-tree. Are we meant to play the game it with others? Does it try to cater to different playstyles?  I don't fully know because some skills are so niche that you get the feel you need others to be as efficient as possible.\n-- The world despite its size, is very bland. It's no fun to discover the 6th cave (that are hidden actually quite well) with a device that is pretty much pointless to figure out where caves are when you simply can look 'em up on the internet. There's just no sense of discovery\n-- Survival is easy as cake. There's no challenge anymore during the mid-game. Storms don't feel threatening when it comes to ones base nor person, especially as exploration isn't necessary. Managing oxygen, water and hunger is very easy and even the different debuffs aren't really challenging and remind me strongly of Empyrion Galactic Survival's debuffs.\n- The quests and missions just create an appeal, I've tried the first and got bored of it. The rewards and the workshop system feel rather pointless as well. Why would I want a knife, armour, bow, that I cannot easily repair if I can simply craft one out of natural resources, can repair it and have the same effect?\n\n[h2] Conclusion: [/h2]\n\nICARUS is a survival game that tries to put the player into the shoes of a prospector, doing missions or just roaming around in the open-world, trying to survive. But the core-gameplay is so lacking with no real danger, with no real struggle. While the early-game still shines with the possibilities what one can do, what one has to do to survive, those needs are swiftly met and one simply wonders what is there to do. Exploration is unsatisfying, you find the same resources, fight identical animals and worms, endure the storms that just have another flavour. The tech-tree and skills are locked behind levels that you gain by murdering the fauna and flora, nothing crucial is really tied to exploration as the world is, in fact, empty.\nAfter nearly 18 hours of gameplay I've had my fill of ICARUS and cannot recommend it to anyone seeking a survival experience.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "So after 600+hrs on this game i can honestly say i have lost the love for it...  End game crafting is far to much work. spend more time gathering than actually doing anything fun. I love the concept of the game. Boss Fights are alot of fun. But getting there is to much of a chore.  Also after spending weeks building a very decent base with everything electric etc, I lost everything by going back up to the ship. SO NO I would not recommend this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Icarus is a world surviving game that focuses on base building, stat management, and operations. Operations are missions that you take either on your world or off-world for more rewards. Any equipment must be a \"workshop\" item for it to be transferred to different planets, aka, you cannot take your equipment and such from your base world. This was my original reason for my negative review, however, I think the more pressing issue is the purpose / goal of the game.\r\n\r\nIf you take everything considered, this game is a base-building game, a survival game, pure and simple. There are bosses, but you only have one boss you can encounter in the base game, with all other bosses being on DLC planets. This will also lock out some materials and certain exotics (this to be used for the workshop items). With that being said, there are plenty of other games that are base building while being more explorative, combat oriented, and in my opinion, entertaining. I am not sure what the over-arcing goal of the game is... the lore is uninteresting, the combat is pretty decent with less than interesting enemies, and exploration resolves rather quickly. Doing anything with the workshop or offworld missions is super grindy, and all the other interesting material for the game is locked behind DLCs.\r\n\r\nWatch some streams or gameplay videos before you buy the game. The only way to keep truly interested is to buy the DLCs, and the base game itself should be entertaining enough without spending more money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The first few hours of game play are fun whilst figuring it all out the building and crafting is what you would expect from a survival game skill tree is nice but after a few missions it all just starts to feel a bit repetitive and boring its just go over there collect that or put a radar station over there. Maps feel empty and lifeless combat is terrible animals all seem to do the same thing to defeat them step to the side after they charge you do a 180 shot with arrow rinse and repeat until animal is dead that's if it doesn't kill you first due to the ridiculous size hit box they seem to have character movement isn't great either which dull combat scenarios.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a shame to leave a negative review, but I have to. The game lags horribly at times, making it impossible to enjoy the gameplay properly. My computer is powerful and can handle all exclusive titles on ultra settings, but this game manages to freeze nonstop even on minimum settings. Otherwise, the game is excellent, no issues there. It's a shame that the developers frequently release major and minor updates to the game, but they add everything except optimization. Despite my love for the project, I feel pain every time I play it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Promising game, fun, and can scratch that adventure itch you're having. HOWEVER... so many bugs...  the most annoying one would be the Worm Boss... IT DOESN'T DO ANY DAMAGE AT ALL!! It's just a huge punching bag and a source for exotic with no challenge whatsoever... Very disappointing. \n\nNow, I understand the developers need (want) money, but making every DLC paid is too much, especially if there are A LOT of bugs going on. Also, my friends and I couldn't really fully enjoy the game since after building a base, the server couldn't handle everything anymore, and our FPS are stuck in 20 below, EVEN THOUGH my friend's PC already has high specs. \n\nDevs, if you even have the SLIGHTEST care for your players, before you add more paid DLCs, fix everything and make the game more replayable for many... \n\nFor now, for those thinking of buying this game... UNDER ANY CIRCUMSTANCES, DO NOT BUY THE GAME! \n\np.s. Even the bosses have to be bought as DLCs if you wanna fight them... you only fight 2 types of boring bosses in the base game. *table flip* Greed ain't good, devs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is fun most of the time. But you come across these completely fucking unreasonable game design decisions.\nI fell and died. As I get up, my following pack animals walked into a polar bear and proceeded to lead it to my base. So then, several mountain lions and a polar bear begins to rip my base apart like it's made of tissue paper.\n\nAfter spawn killing me multiple times, I call down a shotgun as I'm unable to get to my equipment in any way whatsoever. I'm killed trying to get to the drop twice, now I have a severe wound that makes the game unplayable.\nAfter several minutes of struggling, I manage to kill the animals.\nOnly then do I realize that the pack animals with all my base equipment has now despawned.\nThis is INSANE, it is completely destructive for the experience, and it is not the first time it's done so. The wildlife aggro system towards passive creatures is completely out of control, and it has been for a while. I do NOT recommend this game. It is a frustrating nightmare.\n\nI am set back around 20 hours. It is awful.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Persistent injuries through death is one of the dumbest things. I understand the whole hardcore aspect but what in the hell is that kind of dumb idea.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I will admit i have not played since 2022, but i still will say i can't recommend this game to anyone. The gameplay may have gotten better since i last loaded it up but the DLC creep and pricing has gone insane.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If every mount I raised and cared for didn't die the moment I looked away, maybe I could stomach playing this stupid ass game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After almost 40h of farming and getting ready to do some main missions for the \"Story\" it gave me a pay wall of another 30$ DLC. Waste of time. Good for those who like to farm Emus and chop trees forever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought a game and supported them through early access. my purchase of a game doesn't include anything. zero content. honestly a scam. I would appreciate my money back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A pretty good game that is made frustrating by bugs and lack of any meaningful direction at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pros\n\n• True freedom on a huge, handmade map\n• Decent graphics on nature, foliage, landscape etc\n• Huge tech/perk trees\n\nCons\n\n• No real goal, just \"Here's the world, good luck!\"\n• Janky melee-combat\n• Inelegant building mechanics\n• Frustrating learning curve. Plenty of trial and error, and not always in a good way\n• Animals know exactly where you are immediately after you shoot at them\n• Fauna gets stuck in the geometry of the landscape, and look kind of robotic. Immersion-breaking\n\nConclusion: Should a game be frustrating and cumbersome, or should it be fun? There is a good game buried in here somewhere, but it's a little too inaccessible for my taste. When the core mechanics feel like a chore, and not like a game, I lose interest. \n\nScore: 6/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun but every time I try to start it, there's a new problem and I have to uninstall, clean out all the caches, reboot Steam, etc. Different things every time. Nothing else on my computer has this problem so I can only conclude this game is a mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its fun building in this game!!! its combat is so so, so i feel like the game is half baked and the bioms feels emthy some how, came back after 2 years for this game and feel like its could be better.. i dont hate the game, but feel like the price are to much for the current price tag on the game and dls .....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I get real scared during lightning storms. At this point, I'm more afraid of my laptop catching on fire than the wooden shit shack I built (I get 0-1 fps during lightning strikes). Should've tried it right after buying, can't even refund now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is needlessly over complicated in some areas, and missing all but the bare minimum of content in others. I enjoyed it, but so many of my \"hours\" of playtime are pure grind for the sake of grind. This is interesting once, but quickly gets tiring. Yes it's fun, but it doesn't feel like a complete game... and I'm not willing to spend $100 more on DLCs for the chance of it getting better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wanted to return to the game since a lot has happened.. no ultrawide support :/ pls fix",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself it honestly really fun, especially when you play with people. There's plenty to do in the game with missions, progression, and building. However, I cannot recommend the game in it's current state. The optimization is atrocious. It starts off fine for the most part, but as you build more in the world it becomes more and more difficult to play. It stutters very frequently and the fps is very choppy. It goes from decent fps to 30-60 fps during endgame gameplay. Not to mention some missions are bugged and have been known since launch, yet haven't been fixed yet. The devs seem to be more focused on adding more dlc and content updates rather than improving playability.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty good game. altoug i do have a problem with the mix of survival game, with debuffs for everything and the timed missions. these two aspects just dont mix. theres so many different things in the game that you quickly get confused on how you should play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I must be missing something here. The environment isn't hard to survive in at all. There are barely any creatures and the horses are the most dangerous somehow. The quests maybe were supposed to direct me somewhere but outside of those the map is dead and the quests boost your progress so fast that it ruins the game mechanics.\r\n\r\nCompared to other survival games theres not enough going on in here and expecting other players to simply bring that by being there isn't enough when there are so many good options nowadays for these types of games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The base game isnt great.  It was made out to be a game heavy on collecting exotics to buy better tools and gear, but then you learn that you can craft things better than everything in the ships marketplace. Aside from that and the Playstation 2 level combat, Dean DLC Hall has put all the best content behind paid DLCs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do love the game honestly. You people who complain about the hours played on a bad review are jokes, I've played enough to know the game and figure out what I do and don't like about it. I DO NOT love paying over $70 to have to buy the prospector edition just to have to buy the great hunt and all other DLC separately. It should've been equivalent to a season pass but only got us 2 items. Tired of companies charging so much for such lackluster content. Some bugs in the game are still present from launch but at least we have tame able Zebras, if you pay for it...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good survival game, but there's a narrow line between \"difficult but satisfying\" and \"difficult and annoying\", and sadly this game lands a couple steps in the annoying category.\nI do like things like the taming system, throwing weapons, and various food buffs. However, the more annoying pointless things come from stuff like the random weather event system where if you're joining a friend, you could just be dying to exposure out the gates because you joined during a rain drizzle, or you step into a cave and just get smacked with a whiff of cave disease.\nMaybe it's just from my own playthrough, but this game almost just encourages me to never leave within 50 meters of my base because everything just becomes a necessity whenever I go further than that. From getting air to getting water that won't give me dysentery the moment I let it touch my lips. It just makes trying to explore just tedious and eventually not worthwhile.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am disappointed that when I buy the game Icarus i only have access to one map OLIMPUS .if i want to play for sure the game ICARUS I  have to spend over 100£ and for a game of this caliber it is probably some kind of joke\nRegards \nSzamrok 58",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Simply put, this game is ridden with bugs.  I would have given a positive review except for the never ending game breaking errors that happen over and over again.  From mounts disappearing that take hours to level to my entire workshop of items I have worked to acquire getting deleted for no reason, I cannot give the game a positive review.  The devs simply do not care.\r\n\r\n\r\n\r\nI have played a dozen games in early access, even games that are very early in that process, and I have never played any game with this many bugs.  It is not even close.  \r\n\r\n\r\n\r\nDon't bother with this bull.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At first I actually liked the game, it looks good, the progression is not too slow and I got lucky and started with the first mission instead of an open world which happens to be the tutorial (nothing really states that in the menu). A few bugs makes building and using the workstations a bit silly, wildlife is almost no challenge. It doesn't fee very rich an variety but I liked wanted to see how the core gameplayloop feels, which is not the survival but rather the missions and extracting rare ores from the planet to the spaceship. Unfortunately the game feels so clunky that I lost interest before I even fully got to that point. \r\n\r\nThe nail on it's coffin was my end of mission 4 where I died because I couldn't jump into the escape pod while beeing hunted from two wolfs and one of those stupid horses. I already died 2 times and was playing on \"hard\".  I couldn't fight them because I just died before that moment and figured, since I completed the mission, I don't need my loot but can just use the pod.\r\n\r\nWHO IN THE GAWD DAMN JABBAWALKY DESIGNED THAT POD?\r\nWas it an intern?! AI?\r\nYou need to jump exactly from the perfect angle, distance and speed te ever make it into the pod!\r\nHow did this pass QA?!\r\nI had this problem in every mission but now it caused me a game over after 6hrs into that mission! What a waste of time and money!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game i was waiting for years before purchased. Even purchased in discounted price, this game not worth the price. clunky movement, bad combat, bad animation, bad graphic. I am so disapointed....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is ass. not fun and graphics are shit. looks chill in the pics, but they are cap.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Positives:\r\n1. One of my favourite open world survival games so far\r\n2. Love the maps, missions, base building and expansions\r\n3. Excellent single player game\r\n4. Excellent multi player game if you host your own server or are happy just to be on with friends at the same time...but (see Negatives)\r\nNegatives:\r\nIf you want a server so your group can play whenever they want (rather than just when you are on) this is not the game for you (unless you have the hardware to create your own server). \r\nI pay for  a G Portal  server and have had multiple issues where it will not load my character into my world. I have created new characters, I take regular backups yet the problem still happens at random times. G Portal blame an issue with the game and the tickets I've raised with the developers go unanswered. There's nothing more frustrating than completing missions or buildings, taking a back up and then the next night it will not log you in so you need to load an earlier backup but the progress from the previous night is lost.\r\n\r\nIt's time to look for another game (and definitely cancel G Portal) which is a shame as I actually love the game itself.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They sure do like to create new content to sell, and they need to fund their mediocre work somehow. The initial gameplay loop has a basic level of polish that you can expect in other similar titles. However, this does not last long and you are quickly forced into a strange grind for resources. They seemed to plan for EVERY game/instance to be multiplayer, thus reducing the time required to get said resources. This is asinine. Discovering the absurdity of this game took me about 6 hours. 4 of those hours were enjoyable (but odd) and.. well.. here we are. Just look into the game. Very bleak prospects. It had a chance and it never caught on, rightfully so. This has no right being presented as anything other than a mobile game scam at this point. Lemmings gotta eat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game single player mode isolates you and charges a large xp penalty. This is a multiplayer game with single player as the very last concideration.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly one of the worst games I've ever played. After only a few hours it gets very boring, it's just the same stuff over and over again. Also, building in this game is a joke. Just simply horrible, I regret I wasted my money on this thing.\n\nUpdate after playing some more since Steam refused to give me a refund:\nA lot of things feel off in this game and the thing is that this game normally would have a lot of potential but something is just lacking. It feels like it's an early access game that just came out but it isn't. Then I went to Steam to read reviews and they are not as positive as they seem, actually some people took some time to write very long, detailed analyses about what is wrong with this game. I really regret I didn't read those reviews before buying it. \n\nLong story short, there's a potential but there's also a lot of greed. I'm guessing if someone buys a lot of DLCs for this game, it can be decent. But that's not really the point since the game should be nice even without DLCs. Maybe I'll try to play again if DLCs are free..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game ever because my friend likes it and refunded ARK. I'll never forgive you StuE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They have do nothing to fix the progression becoming stale and repetitive. I also cant support the abhorrent DLC releases and content pay walls. DO NOT BE FOOLED BY POSITIVE REVIEWS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"DROP DOWN\" misclick and the bag with all inside disapeared, 3 times not one, remove \"DROP DOWN\" or movie it Further DOWN in the list if you are not going to fix it. you idiots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As a solo player, not having an option to keep inventory on death is just annoying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Total: 3/10. Graphics: 5/10, almost pretty, but on the cartoonish side. Story: 3/10, ultra-simplistic, no stakes, nothing interesting there. Gameplay: 2/10, does the basics for a survival game, tool durability and food meter degrades RIDICULOUSLY fast, no immersion or semi-realism to be had. Tech tree is almost realistic. EXTREMELY simplistic quests. Steam app merrily counted away the hours long after I quit at the 1h 50m mark ... so I wound up paying full price for 2 hours of frustration.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not buy if not buying dlc. super grindy unfun game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BIGGEST ISSUE: the DLC. you already knew; every time they release a new tree or dog they're gonna make sure it isnt available unless you pay them and thats incredibly scummy no matter how you shake it. Base game is $35, New Frontiers DLC is $30, and Great Hunts DLC is $25; that should be EVERYTHING YOU CAN BUY and thats still nearly $100. Outposts should either be free or included with certain DLC; there is objectively NO positive reason from the consumers viewpoint that each outpost and animal you release is $15 and from the publishers/developers viewpoint the only objectively positive reason is money. Thats what we call a cash grab and is highly looked down upon across all communities. There is no reason the entirety of this game should cost nearly $200, and the argument \"dont be poor\" doesnt work here because i have ALL the DLC, YOU dont be poor. returning to my original point though, nothing that can be said can justify the price point in todays economy; it isnt like this is a painting i can hang on my wall that will accrue value over time or a tool i can use for work that will generate income; this is pixels and there is NO REASON PIXELS SHOULD COST $200 USD.\n\n2ND BIGGEST ISSUE: There is NO INTERACTION unless the player is DIRECTLY involved. deer walks up to a bush, does he eat? nonono he just stops, stares for a second, and turns and walks away. Wolf runs into another wolf, do they form a pack and start hunting together to increase their odds of success? nonononono they just walk right past each other and continue their trip to nowhere in solitude. exactly how wolves act in real life, and you KNOW making my games feel somewhat real in certain ways really helps keep me immersed and hopefully you can see my point here through all the sarcasm. \n\n3RD BIGGEST ISSUE: While the game is incredibly pretty, everything they chose for this game from the lay of the land to the way the forests are structured and the animal AI that cant do anything except walk and attack all the way to the music is incredibly basic. This game feels less like it was a product made BY people FOR people out of passion and dedication and more like a product made with minimal effort, maximized profit margins, and to appeal to the widest possible audience purely with the intention of Big Money. Which is why they certainly wont put anything controversial in it because then they couldnt sell to some of the biggest countries in the world. hey, cant have steaks because we want to sell to the indians; hey, better not mention any SQUARES or TANKS because we want to sell to the chinese; HEY, BETTER NOT MAKE THE GAME FUN BECAUSE THEN PEOPLE WILL ACTUALLY PLAY IT INSTEAD OF SLAVING AWAY AT THEIR CONSUMER HOTLINE DESK JOBS.\n\nIn short: if you want to play a cool survival game, go play minecraft or the long dark; no reason to torture your bank account just because new zealand decides to run their country like commies and now we have to deal with their awful financial decisions through steam.\n\nI honestly shouldnt be this surprised about the company founded by a man best known for ghosting his hugely successful game community and then coming back 10 years later to release updates that should have come out a decade prior with no explanation. \n\nOh and the game hasnt been properly optimized either so it runs like cold dawg shit. hey but keep eating that $200 sandwich, im sure theres corn in there too, somewhere. \nmaybe. \n(they took all the corn out beforehand)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Good thing it took me less than 2 hours to figure out that this game is not worth playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Base game has way too little to do. It sounds like the DLCs helped with that but I'm not gonna waste my money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels unfinished still... Dirty devs try to make money by locking content that should have been in the game with DLC.... How this is mostly positive in this point of time is beyond me. Probably bots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not sure what is this game trying to be. Can be fun at times, but its not a mc or like other survival games...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game, but when you reach a certain stage, and want better equipment, you're forced to update and spend more money to unlock a map where you can mine super cooled ice.  The only reason why this bothers me is because in the base game, they give you the option to unlock the tools necessary, but they don't give you access to where you need to mine it, so it's easy to hit a wall of not being able to continue playing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game, just poorly made. Its jhankey af.  ai pathing sucks, ai sucks in general.  It doesnt feel optimized all thew way.  You can loose entire charactors to buggy mission on prospects. i lose more stuff to the games programming than i do in the game itself. i lost 20 tames all at once cuz the game crashed after i called them down, and there was no save between me bringing them down and the server crash. All of them were just deleted.  so no i would not recommend. id say wait till its out of beta... but it doesnt seem like it was ever in beta.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "decent game can be good at some points but the building mechanics PMO",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many quality of life (QOL) things that are still left out of the game.  I've played a few hours here and there.  Today I was picking it up again 11/7/25.  Scrolled through my tech tree to pick a talent.  Made a mistake and clicked on the wrong talent.  The only way to respec is to return to space and have enough Ren (money) to purchase a respec.  I currently don't have enough. So I'd have to complete a mission to get enough to do that.  So that means my respec is hours away.  This is just one instance of the lack of QOL.  There are MANY more.  All of which very distinctly don't respect your time.  I've got over 50 hours in the game and barely have any equipment to show for it.  The special equipment you do purchase breaks over time.  You you have spend currency to repair it, pushing your unlocks further and further away.  If you're 15 and have a couple friends to play with, you can waste the 500+ hours you'll need to get anywhere in this game.  If not, skip this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a survival game, that can make you mad. if you hate that, come play, if you love that, come play. not recommended.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great bones, the meat is full of bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No way to travel fastcin between biomes or bases",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its insane that they could top the greed of ARK",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible Controller support !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fucking RAW",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how get refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very mid",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "FIX YOUR BUGS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shallow game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shits just ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game a few years ago. Initially I looked past the empty open world where you've encountered 90% of what the entire game to offers within the first 10 mins. I hoped for change. I heard there was an active dev community who updated the game often. I looked past the jankiness of pretty much everything, from building to combat, hoping it would get better.\n\nThere were glimmers of fun but they were few and far in between and too short-lived.\n\nSo I read up online. There were so many positive reviews, I thought surely myself and my friends are missing something? So then people said, the Styx DLC is really it. This is the game.\n\nBut then I read that actually no Prometheus, the other DLC is where it's at. OK weird that people don't seem to be sure about this, but we started a new game recently in 2025.\n\nThings were identical. The mobs looked different but functionally there was no change. We ran around for a few hours and quickly realized it was the same as the first map. Just running around 1 shotting every animal you find for xp. We went to caves, identical to the first map. Identical tech tree, no new unlocks, no new talents or progression. Nothing new to build.\n\nSo I went and did more research and people said, the mission system on Prometheus is where it's at. It's new and revamped. So we got to level 10 and made the mission quest thing.\n\nThere is something new. As advertised it's a whole story with a campaign that has real impacts on the world. So we clicked on this, excited to get started.\n\nAnd were hit with a paywall that this is locked behind yet another DLC.\n\nSo I went and looked up this DLC and it's mostly Negative because it apparently adds so little and you also have to make  a base on every map to unlock everything.\n\nAt this point I said to my friend, we're done. We're not buying a 3rd DLC to try and make a game that offers so little hopefully give us some kind of return.\n\n------------------------------\n\nTo all the people with 100s of hours who've left positive reviews - I don't understand you. I've tried my best to give this a fair shot but at some point you have to concede that there is so little of value here.\n\nI even though I was missing something - playing the game wrong or whatever. But if you look deep enough, you will find many people who have the exact complaints I do.\n\nThere are so many good survival builders out there that offer 100x more than this game, which should have all of its DLC features in the base game I might add. If you total up what this game and all its DLCs cost, it is insanely expensive.\n\nDon't make the mistake of falling for this. It's one of the most empty games I've ever played. Spend your money elsewhere, avoid.\n\nNote that this is also made after I came back to the game after giving it years more to cook. What did they cook? More DLC .\n\nDon't play this. You will regret it unless your bar for good games is on the floor.",
      "voted_up": false,
      "votes_helpful": 1350
    },
    {
      "review": "You know how AAA games are starting to cost $70?  That's crazy right?  Good thing we have small game studios to give us games like Icarus where the full game only costs $171.55.\n\nGood thing we're not tolerating $70 AAA games anymore.",
      "voted_up": false,
      "votes_helpful": 965
    },
    {
      "review": "It's a game that, at least in the beginning, makes you wonder why you haven't heard of it. The initial impression is strong, but as you play it becomes incredibly tedious. Once you hit T4, the fourth tech level, everything is an unreasonable grind and it takes hours of real life time to build things. The game also features no fast travel, plus a punishing stamina and weight system. Important resources don't respawn so you need to move around the map a lot...turning the game into a walking simulator. The end game experience is absolutely the reason this game didn't blow up.\r\n\r\nAnd then there are the technical issues: massive memory leaks, the physics engine bugs out and grinds your cpu to a halt and performance drops are all over the place. The longer you play and the more you've done on a map, the worst performance gets, and your endgame worlds run like crap. There was little to no thought given to map performance over the long run.\r\n\r\nSo all in all, a big disappointment: a game that gets worst the longer you play it.",
      "voted_up": false,
      "votes_helpful": 105
    },
    {
      "review": "Icarus has a lot of potential, but instead of putting their work into the base game, they put it all into their paid DLC money farm (170€ for the full game with all expansions). The game's been out for almost 4 years and there are still ancient bugs from launch that you can encounter when playing today. Early-game I've enjoyed Icarus a lot playing with my friends, but the more I've progressed the more I realize that it's simply lacking a lot of things. It's good at the start, but then mid-game or late-game you start to realize the game feels unfinished and overall monetized instead of expanded. You want that knife? No! Finish the mission locked behind a world locked behind a paywall.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "They are stuck in a loop of constantly adding features each week, which has made the game bloated and difficult to maintain. The number of bugs and server crashes has become frustratingly high. Please spend some time optimising and fixing bugs instead - no more guns or arbitrary features, please.",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "The game was alright, but there is simply too little content for the base game. You need to buy the expansions, but they are way too expensive.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "I cant justify how grindy and over the top boring some mechanics are. \r\n\r\nWALK WALK WALK, MORE WALK. Thats the game. its promising and fun for a bit and you quickly realize that all you do is walk. \r\n\r\nmissions are painfully generic and boring.  i hoped it would get better but it has not. i give up\r\n\r\nps. this game needs fast travel / cheap and infinite teleport system + infinite map markers with labels + interestring missions",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "ICARUS is a very weird lil' game.\nOn one hand you have a somewhat complex skill-tree and tech-tree, with roughly a bit more than a dozen different materials you can mine and use but the longer one plays, the faster one realizes that the game's very, very shallow.\n\nThere are weird bugs, questionable design choices, a wonky multiplayer but most critical, there's no real sense of progression.\n\n[h2]The Good: [/h2]\n+ The open-world is really big. It contains a couple of biomes and they are interconnected via pathways, tunnels, etc.\n+ The setting is very interesting, being a prospector on a hostile planet on which the air is toxic.\n+ Building is snappy and quite easy to do.\n+ Tools and weapons have a clear use but can be used outside of it as well (for example as a weapon).\n+ Some graphics, especially for the animals, are quite well-done.\n\n[h2]The Bad: [/h2]\nHoo boy, where to begin...\n\n-- The Multiplayer is glitchy. From fires that continue to burn to weird animation for downed players.\n--- There is no sense of progression in the game. You can stay in your starting biome and farm XP till you are max-level and build then build your base. There's no real need to travel, there's no challenge to overcome to unlock the next tier. It's blunt and boring farming.\n--- A good part of the game (which might give some sense of progression or danger) is locked behind DLCs that cost over €100+. I don't mind DLCs if they are substantial and are build on top of an already well-made game but ICARUS is not a well-made game and the content of the DLCs is sometimes a bad joke. There are developers who bring out better content updates for free.\n-- Animals just feel... artificial? You find all sorts of animals all over a biome and there are no nests, no territorial behaviour, no nothing. They just spawn in and exist and don't feel like part of the ecosystem but just to be a farm for easy food and XP.\n-- I honestly don't understand why we have such a massive skill-tree. Are we meant to play the game it with others? Does it try to cater to different playstyles?  I don't fully know because some skills are so niche that you get the feel you need others to be as efficient as possible.\n-- The world despite its size, is very bland. It's no fun to discover the 6th cave (that are hidden actually quite well) with a device that is pretty much pointless to figure out where caves are when you simply can look 'em up on the internet. There's just no sense of discovery\n-- Survival is easy as cake. There's no challenge anymore during the mid-game. Storms don't feel threatening when it comes to ones base nor person, especially as exploration isn't necessary. Managing oxygen, water and hunger is very easy and even the different debuffs aren't really challenging and remind me strongly of Empyrion Galactic Survival's debuffs.\n- The quests and missions just create an appeal, I've tried the first and got bored of it. The rewards and the workshop system feel rather pointless as well. Why would I want a knife, armour, bow, that I cannot easily repair if I can simply craft one out of natural resources, can repair it and have the same effect?\n\n[h2] Conclusion: [/h2]\n\nICARUS is a survival game that tries to put the player into the shoes of a prospector, doing missions or just roaming around in the open-world, trying to survive. But the core-gameplay is so lacking with no real danger, with no real struggle. While the early-game still shines with the possibilities what one can do, what one has to do to survive, those needs are swiftly met and one simply wonders what is there to do. Exploration is unsatisfying, you find the same resources, fight identical animals and worms, endure the storms that just have another flavour. The tech-tree and skills are locked behind levels that you gain by murdering the fauna and flora, nothing crucial is really tied to exploration as the world is, in fact, empty.\nAfter nearly 18 hours of gameplay I've had my fill of ICARUS and cannot recommend it to anyone seeking a survival experience.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "Make the DLCS more expensive (in the sale) because they notice that their game has some new players criminals",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I played this game a lot.  It is a ton of fun but when you work hard for stuff and then you die and your gear disappears its annoying.  This has been an issue forever so instead of fixing all the bugs and there are a lot of them they seem to focus on making decorations and crap.  FIX THE GAME BEFORE MOVING ON!!!! You would think they would fix the stuff thats gonna drive people away before adding dlc that the people that left the game wont buy......",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Yet another open world survival game with nothing to do. \n\nYou bash and collect resources, build a home, fill it with useless furniture like its a doll house, then.... look at it. \n\nThat's all, there is nothing else to do. You don't need to travel the map to unlock everything, and there are no vehicles or fast travel. You run everywhere, you will spend most of your time running. Again, that's it, that's the game. \n\nA boring, pointless, survival game, like the 100 other ones out there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Cash-grab Unreal Engine asset flip. The animals on the \"failed terramorph experiment planet\" are dogs, spray-painted horses, bears, ostriches, fish, and rabbits (that can breathe the air on Icarus, but apparently I can not) and other cheap UE4 models that you can find on the Fab marketplace. Aside from the upkeep of oxygen, there is nothing that makes this game \"sci-fi.\" The marketing art on the store page is not even remotely similar to what you will see in-game. \r\n\r\nThe game is not optimized and looks terrible at 1080p. My Ryzen 9 5950X and RX 6600's performance became irrelevant during in-game thunder storms, which genuinely freezes the game every time lightning strikes the ground or structures around the player.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Game is 20% of the game. Rest are DLCs. Thats a malpractice needs to be punished.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Cant really recommend this game. Its fun BUT you have to buy many DLCs which got content what really should be in the base Game.\nThe server adjustments which recently got out via patch to help with bad FPS (ASUS Nvidia GeForce RTX 4090 24 GB\nAMD Ryzen 9 7950X3D.....) were out way too late. The bad FPS made the Game unplayable and while its better now thanks to the latest patch, DLCs were more important.\nThats a clear \"know what youre getting into\" when you really want to get this game.\nDont even try to just play the base game without any DLCs cause the content youre missing is way more than the basegame (and the DLCs are way too expensive).\nBTW some FPS drops are still happening and thats a joke for my system. Seems like its allergic to RocketWerkz \"work\".\nBye",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Game was on sale for $7, figured I would give it a try. I paid $7 too much.\n\n- Devs have falsely advertised it as 1.0 when it is clearly an early access game, with weekly updates since \"full release\"\n\n- Starter mission is intended to be git-gud trial-by-fire but ends up being 50% walking simulator and 50% BEEEEES as you wander around looking for animals slow enough to murder so that you can actually get EXP and/or fur\n\n- Extensive skill trees promise lots to do, but only once you purchase up to $160-something of paywalled content\n\nBut hey, at least we don't have Randy Pitchford telling us that the reason it's an incomplete cash grab is because it's \"\"\"premium\"\"\".",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "The game has made some generally favourable changes in the time since it originally released and now, but in all honesty it's still not a good game overall, or worth the investment in future potential.\n\nLike, I could overlook so much about the game back on its original Early Access release due to it feeling like a foundation for more to come. However, coming back to it again in 2025, not only does it feel like they had no idea what potential they were aiming for, but many of the core, fundamental baseline elements of the game are barely passable, if not outright broken still.\n\nThe best example would be the creatures in the game. Complete ass hitboxes, horrendous pathing and just so incredibly boring to fight. Literally died to a Moa because my attacks were going through it without dealing damage, and between every hit it made on me it glitched out and ran all over the place for no reason, going up and down rocks and stuff.\n\nLike... this is stuff that should have been fixed FIRST. The fact it still exists in the game to this day makes it quite evident there is no real passion in this product and not worth your time or money.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Let’s be honest... the way this game is designed is horrendously bad, especially when it comes to physics, collision, animals, grinding, performance,  mission structure and other bad experience you can get. If you think that’s not true, you’re either ignoring criticism or just trying too hard to defend this game.\r\n\r\nGameplay primarily consists of nonstop traveling, grinding ores, and doing meaningless quests that don’t make sense in the main story. For beginners, the experience is even worse, you build your first base, pick a quest, and then the game already forces you to travel across half the map and back again like an idiot. There’s no real fast travel system or blueprint technology to make that process less painful.\r\n\r\nDon't get me started with animals. Their movement and attacks feel broken, they can hit you from a distance without even touching you. Weapons are inconsistent, shots often miss despite hitting the target directly, while other times you kill something you didn’t even hit. The hitboxes are completely screwed!\r\n\r\nMounts are so ridiculously designed that they force you to kill them and never use them again. Their jumps are clunky and unreliable, you often have to stop moving just to jump, and even then you still fall into tiny gaps the game clearly wasn’t designed to handle. \r\n\r\nMissions are both boring and buggy. In one quest I had to use a mining laser to break open cave walls, but it didn’t work at all. I was forced to abandon this goddamn mission. The game has a “report issue” button, but it doesn’t fix anything, doesn’t compensate wasted time, and doesn’t guarantee other players won’t face the same problem. It just shows how those lazy dog developers are and don't actually value player's time and experience, they just ignore it.\r\n\r\nCollision issues are everywhere, you can walk through unmineable rocks in desert or arctic areas and end up walking on the skybox. In multiplayer, when you get knocked unconscious, your character doesn't fall naturally but instead standing upright and looking like a stupid scarecrow, waiting for someone to be revived.\r\n\r\nPerformance is just as bad. The game runs on unreal engine 4, yet it constantly stutters, lags, and crashes especially during exploration or walking in base after exploration. The only way to play smoothly is to restart the game and basically avoid doing anything, just sit afk like an idiot.\r\n\r\nweird phenomenon occuring in the game like random trees spawning inside your base or elsewhere that never existed before. You can’t cut down or pass through, to remove them, just restart again.\r\n\r\nAfter 50+ hours, the experience doesn’t evolve. It’s the same grind you already saw in your first 15 minutes of the game. No changes, just endless loop with bunch copy pasted content.\r\n\r\nAnd of course about greedy \"DLC\". You already pay for the base game, but it feels like a demo version since you need to buy more and more just to access new biomes, monsters, and bosses. Even then, there’s still no basic portal or fast travel system. Game is still trash after DLC.\r\n\r\nThis game came out in 2021 and yet offers nothing but garbage, broken systems, annoying bugs and shallow content. It’s a huge waste of time and effort. Not recommending you to buy this, save your money to something better, or otherwise, enjoy being a masochist and witnessing massive bugs in this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its a scam - The game is locked behind a lot of DLC.\n\nCan’t ride a horse without DLC. Can’t access entire campaigns like Prometheus without DLC. Can’t use outposts or advanced systems without DLC. Those aren’t side-missions or skins, they’re fundamental to how the game plays. \n\nThe real progression is paywalled. Calling that ‘free’ is like saying chess is 90% free because the pawns are included but the queen, bishops, and knights cost extra. The base is deliberately hollowed out to sell the DLC. \n\nThat’s not free - it’s a scam model.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "should be Early Access game, average! and tons of DLC's and full of free crashes every time!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I tried to enjoy this game, I really did. Rocketwerkz also made Stationeers which I quite enjoy, so I thought that this might also be good,\n\nHowever, it's really not. The game being bare is one thing, but it also feels very low effort, with very expensive DLC, which I frankly regret buying. As you might read in other reviews, nearly everything in this game is paywalled behind DLC, so the game effectively costs over 100 euro. \n\nThis might have been forgivable if the game was good, which it definitely isn't. \nBasically the only thing to do is run around a very bare map one-shotting the local wildlife and building a base with a very mediocre building system.\n\nTaming animals seemed like fun, however, this also is very poorly implemented. The atrocious pathfinding for wildlife is even more apparent with tamed animals. \nAnimals get stuck on things constantly, even on non player built geometry.\nThe creature riding also looks hilariously bad; It looks as if it was modded in the game with minimal effort, and feels entirely non-physical.\n\nThere is also a quest system that bassically has you doing: Go to place -> build thing / get thing / kill thing. Which really doesn't make things any better.\n\nI really hate throwing the word 'lazy' around, especially since this is a small studio. However, it certainly seems this team doesn't have the manpower or resources to pull off a game of this scale, and it shows in the lack of polish.\nThis might also explain the exorbitant DLC cost, which might indicate the studio simply ran out of money to keep developing it normally.\n\nIn conclusion, I think this game won't fundamentally get any better than it is now, and it certainly doesn't look good at the moment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bruh how are you going to make someone buy extra maps to an already unfinished game? greed is the death of games it almost makes me not want to finish the base game, but i guess the gameplay is challenging enough to be a little fun so ya, i hate greedevelepors",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I know I should of known better but the youtuber I watched play this game made it look really fun and have excellent visuals. Instead what I got was blurry mess after spending a solid 15 minutes making adjustments, no real explanation on where to find a tutorial for new players, and the displeasure of finding out how much content is locked behind dlc. I am most definitely refunding this game and going to stick with other games of similar themes that are better developed and don't require me to pay $166 for content that should be part of the base game.\n\nIf I wanted $7 (on sale price right now normal is $34.99) worth of disappointment I'd of gone to McDonald's.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can't really recommend this game. As someone with poor eyesight, I would expect the basic accessibility feature of being to increase the text size, but this it not possible. That pretty much makes the game unplayable for me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too expensive for a game that is half baked... It sounds good on paper but was not really fun to play...",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "So after 600+hrs on this game i can honestly say i have lost the love for it...  End game crafting is far to much work. spend more time gathering than actually doing anything fun. I love the concept of the game. Boss Fights are alot of fun. But getting there is to much of a chore.  Also after spending weeks building a very decent base with everything electric etc, I lost everything by going back up to the ship. SO NO I would not recommend this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Hardcore game, inusable for me. Icuarus Team: In single player savegames are not a gimmik, they are a must. A game that destroys hours of your life for a single mistake is useless. A single mistake made my mount be killed, A mount I rised 2 hours. This spoils the game, as I liked it. And I do not have the patience to invest 2 additional hours just to restore the savegame. There are people who can cope with that. And in multiplayer it is ok. But not in a progression game in single player mode.\nEDIT: I tried to give the game another chance by loading a backup savegame. I tried now for more than 2 hours to restore the save by editing the saves in C:\\Users\\*\\AppData\\Local\\Icarus\\Saved\\PlayerData. Nothing helped. Fail.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I like base building. I don't like building it again, and again, and again, and...\r\nThis game is okay for the first few missions. Then you get into this endless cycle of building the same things over again. Also, you're supposed to be on an alien planet where you can't breathe the air, but the animals are Earth animals and have no problem with the \"alien\" atmosphere. The planets aren't alien at all. They look like Earth. They have Earth weather and Earth animals and Earth plants.\r\nWhomever made this game did it with no imagination whatsoever. As a sci-fi fan, I'm disappointed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Honestly it's such wasted potential. The concept was such a good idea. The live action trailer really sold this game. The concept was so much cool and there were so many opportunities to have fun with it. The execution was SO BAD. The actual gameplay is the most unoriginal regurgitated slop I have ever seen and it does not fit the concept whatsoever. Don't even get me started on how they made a dlc for stuff that got promised in trailers. Let's assume you are dropping into the map for the first time. You were able to look past the sloppy character creation and the questionable ui. You drop in. First you're greeting with the most boring and unnecesary hud ever. The crafting system is boring and not interactive at all, it has a skill system? a tech tree? It kinda feels like the game is having a full on identity crisis with all these different features. To top it off, none of it is original. Every single hud feature I saw was something I could link to another game. The whole character system as a whole; the crafting, leveling, and tech tree just did. not. fit. I know this game looks awesome, but it's a lie. and definitely not what the trailers showcased.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I saw this game on sale and decided to give it a try,  really disappointed to see that 70% of the game is locked behind DLC's. \nApart from that the game is an empty open world with little thing to do. In 15H of gameplay you'll discover basically nothing , the map despite being huge is empty. And yes I saw the reviews of people saying that \"oh but you only need to buy 3 DLC's to make the game interesting\" and it's absolute bullshit. DLC's are made to add content to a game not make it \"playable\" and \"fun\". Beside that the game has a really interesting crafting scheme and upgrades (that you won't be able to all reach because progress is almost non existent passing a certain point since there is nothing to do apart from cutting trees and killing the same 3 animals the game has to offer in the only region you can explore without getting annihilated since you can't upgrade yourself so you are stuck in the main part of the map to endlessly cut tree and kill animals). So no Icarus is not a game i'll recommend buying, even on sale, the game is an empty map with not so interesting missions to do.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really want to like ICARUS, which is why it pains me that I can’t recommend the game in its current state. The game’s performance is simply too abysmal for me to keep playing.\n\nICARUS was originally designed to be based on missions, meaning players would drop into the world, complete different objectives and return to the menu. This meant the game didn’t have to keep track of any changes to the world, such as player built structures, felled trees and damaged ores. With the introduction of the open world mode, that’s no longer the case. Since the OW is persistent, every instance has to be saved in its updated state. All this means that the more you build and progress, the harder it gets for the game to keep up, and that’s when major stutters and freezes kick in. This is also present in other survival games like Valheim and Enshrouded, but not nearly to the same extent. I fear the devs would have to rebuild this game from the ground up to truly make it work as an OW experience. Since I doubt that will ever happen, I just don’t see myself coming back to the game.\n\nI’ve done testing on 3 different rigs (RTX 2080 Super&12600K; RX 7800XT&7800X3D; RX 9070XT&7800X3D; 32GB of RAM each), and the issue remained the same. Tweaking settings can bring some level of improvement to the overall framerate, but it doesn’t help with the constant FPS drops.\n\nFor those only interested in the missions, this one is  still worth checking out. Those who only want to play OW should probably skip it and save themselves the headache. Props to the devs for still releasing small updates every Friday, but I really wish they’d take a break from adding DLC to focus on improving the performance side of things. Fix your game first, then sell additional content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It took me 10 hours to get stuff that would take 1 hour in other survival games if those 10 hours were engaging and worth my time like vintage story i wouldn't mind however in this game those 10 hours require at most 3 actions on repeat. maybe it gets better later in the game but i have already had enough and wish i could've gotten a refund",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a shame to leave a negative review, but I have to. The game lags horribly at times, making it impossible to enjoy the gameplay properly. My computer is powerful and can handle all exclusive titles on ultra settings, but this game manages to freeze nonstop even on minimum settings. Otherwise, the game is excellent, no issues there. It's a shame that the developers frequently release major and minor updates to the game, but they add everything except optimization. Despite my love for the project, I feel pain every time I play it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Excellent game, great ideas, especially the lightning storms burning down my house, But.... graphics are extremely poor, blurry and unable to fix. Bad graphic frame rate lag. Kept getting killed by wild animals because the frame rate would lag so badly on the animals fur. Tried every preset and even a few custom video settings but did not get it any better. Maybe needs a patch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In my opinion this game is not enjoyable. Do a mission and starting over every time is not my cup of tea. Build a shelter and then the environment in 1 storm destroys it.  or a lonely wolf.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ark Clone. But the grind is very slow and not fun.Your better off playing ark.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly just play any other survival game. an absolute snooze fest",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After over 1700 hours in-game, I have no choice but to NOT recommend it to others, even though I enjoy playing it.  That is because they have had almost 4 years to fix optimisation issues in the core game and they still have not managed to ... after nearly 4 years of weekly updates, I have to assume they can't fix it.  Then, they throw paid DLCs into the mix, all with their own bugs & issues?\n\nGranted, they release weekly updates to Icarus & the DLCs but these are invariably new features or additions with the occasional bug-fix to scripted mission content.  They seem unable to fix the major issue with this title - core game optimisation which stutters & lags, even on high-spec PCs & the in-game settings tuned down.\n\nAnd don't get me started on the Arctic/Tundra Snow Wolves, which seem to have radars built into them - the damn things can spot you from miles away, even when you're stealth & crouched!",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}