{
  "positive": [
    {
      "review": "If you like fallout, try it. \r\nIf you like survival builders, try it. \r\nif you have at least 1 friend, even better, try it together. \r\ni have always wanted a multiplayer fallout, and this begins to scratch that itch. \r\nit DOES have moments that feel... stale... after you get to a certain point. the gaps between events, often filled with grinding, can get repetitive. \r\nif you have a friend or S.O that has a hard time with first person shooters, VATS for the win. \r\nit's very open, it's fairly user friendly, the community has been one of the most positive, helpful, and kind i've EVER encountered... it's got bugs - shit. sorry. not bugs. \"operationally challenged features\" is what we've taken to calling them - but we've worked around/through/with every one of them and enjoyed it thoroughly. \r\nI'm a fan.",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "Imagine camping, but the squirrels are radioactive and judge you for every bit of junk you pick up.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "[h1] Fallout 76 [/h1]\n\nI started to play Fallout 76 during the Quarantine around 2021. When the game had the major content updates to improve the major issues of lacking stories, npcs and other things in the game. So i am reviweing the product from the perspective how the game feels since that. (I did not play since launch). \nAt first when you make character you have option to start at lvl 1 or 20. Which i find super awesome, for those who knows Fallout games in it's core of gameplay then they can choose the higher lvl with starter build of cards. Yes cards, in F76 the progression system of your character let's say ,,build'' is summarized into more simple way of handling compare to F4 and F3. You still have perks, but you use perk cards with its description. Each card has different attributes or meaning what they do. For example Aqua Boy does literally allow you to swim everywhere without getting it's radiation from it's water. I find this very awesome, as F76 is live service online game, so i do not feel strssed much about it. The story feels quite alright, it's of course not the best Fallout story ever made, but i can say at least it's decent, and explain some small things to other games, because this game is described as ,,Prequel'' to Fallout games. Time to time there is small detail that explains some minor stuff, that happens let's say in Fallout 4 and vice versa. The combat is quite almost same as Fallout 4, except that V.A.T.S works a little differently, you can still highlight the parts of body and shoot, but you do not get the slowered time or action camera when you kill some enemy NPC. What i really like about F76 is the open world, and huuge sepration of ,,biomes'' each region is looking differently. For example there is more natural side of West Virginia like Forest, where i like to relax and explore every single time when i do not feel like for much of danger. Or Toxic Valley, as it's say in name, yes it is very Toxic with radiation and things are quite messy. The game as whole feels bit better everytime they do release Major Content Update every 3 months, this year we go for the first time ever ability to play as Ghoul and also Beth added side activity Fishing, which i mean i find welcoming, as sometimes i want relax and do something else than just killing stuff all the time. \nThere ofc are negatives, such as classical clunky UI by Beth, animations sometimes glitch and it can be annoying during Public Events, sometimes i am stuck in the rock and need to relog. Also the balance of current builds might feel very frustrating specially for veterans, as they did nerf some stuff or over power some stuff, that does not make much of sense in Fallout logic, but hopefully they will balance it out with future updates. \n \n\n[b] Pros: [/b]\n+ Vision of Fallout 76 to be friendly for solo players either multiplayer players either casual scene of players\n+ Modding scene is active, i recommend to check out specially ,,Text Chat Mod'' very handy to have\n+ Awesome soundtrack as every Fallout game always had\n+ The niche of lore, weird humor, classy jokes of Fallout\n+ Perk Card System for making Build of your character, very friendly for newcomers and vice versa\n+ Combat is quite fun, specially in first person mode (my preference) \n+ Different type of ranged and melee weapons to choose from, some even has funny sound effects! \n+ Graphics are quite decent, but that is again about preference of each person, so it's difficult to recommend as positive or negative\n+ Content Updates every 3 months with change of ,,Seasons'' which is kind of Battle Pass, the biggest expansion like updates occur usually every year of late November to early December\n+ Replayability of game, in the meaning, it is fun to play with alts, to explore different builds or different choices in story lines\n+ The bagame offers subscription, which is voluntary, i can't play without it as i am quite addictive hoarder so the unlimited scrap box is for me much needed, but you can survive without subscription there are many handy guides for hoarding organization so your stash box is not over consumed\n \n[b] Cons: [/b]\n- Optimization can be tricky to review, i would say, it definitely can use some rework major update to support modern hardware right from engine,  The Creation engine is known for being bit clunky\n- Animations are quite clunky, but i find it charming, but some can find it ,,cheap'' or old \n- Some of locations could you rework or revamp with lighting or better textures compare to new places that has been added as of late \n- Wish the Character Creator has more hair options for woman characters specially, there are only so few \n- Atomic Shop furniture, clothes may feel bit over priced, always wait for discount\n- Some balance issues with perk card builds of Characters \n- Clunkyness of glitches, sometimes i glitch into rock, and need to relog or restart game \n- For some reason the game can crash out of nowhere, not often, very rarely, but it happens \n\n[b] Result: [/b]\nI am giving The Fallout 76 decent 8/10, while the story is not ground breaking Fallout story, it does still deliver answers for some things about it's core lore. The combat is quite fun, specially in first person, building your own camp is also fun after the last update of improving the Ui to be way more friendly, soundtrack is again stellar and the future of Fallout 76 seems to be very interesting with it's ideas from Developer's Blogs on their Youtube. Is it worth the full price? I would say no it's not, i would say wait for discount because there is also optional Subscription with benefits either Cash Shop called Atomic Shop with sometimes really nice decorations and customizations like clothes. \n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3538095992",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "What can I say, I LOVE THIS GAME!!! Though there have been many disappointments with the additions and it is not a true fallout I have actually turned down other MMOs offered me by friends. The last was my 50s year old son offering me a game he loves. I told him, \"buy some surprise flowers for your wife instead of wasting the money on giving me a game I'll never play\". I have no intention of leaving 76 before I die, even though I may throw temper tantrums and threaten when they basically attempt to force people to team up.\r\nThat bothers me, and I know they will never restore the morality programming or joining factions, another ugh.\r\nThat said if you can't find something new to do in this game perhaps puzzles are they way to go. LOL\r\nFrom building to fishing to quests, to just killing stuff for the sake of killing, it is all in FO76.\r\nJoin us, and stay frosty out there.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "It has had some great changes since its release.\nIt has a good story and gameplay, and it makes for a great experience playing with your friends.\nIt's one of those special games that has a really great community, and playing in the Westland is a beautiful experience!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Dude I'm autistic and depressed, I get to wear a dog head and fucking shoot things while playing base building legos. At least it doesn't have AI voices. It's a good game to take pictures in, the sunsets/sunrises are nice and the people do funny enough stuff to snap a pic of. Play it if you want a MP game that doesn't expect much of you.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "After many years and updates, I can wholeheartedly recommend Fallout 76. \nIs it perfect? NO\nIs Bethesda at least trying to make it enjoyable? HELL YEAH\nYou can do so many things like questing exploring public events, become a ghoul or simply build your ideal Post-Apocalyptic home. The monetization is NOT that bad compared to ESO, no content is gated behind paywall mostly convenience. Latest update, the Burning Springs, is bringing a new feature, Bounty Hunting and a new area plus a new story. With friends it becomes 100% better. Not to mention that you can become a ghoul and change your playstyle altogether!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I have played Fallout 76 off-and-on since release.\nYears of free updates have transformed this game from what it was back then.\n\nSome highlights of the changes I've witnessed over the past 22 seasons:\n\n• Devs listened to community feedback: they improved existing systems, reduced barriers to entry, and added loads of new content.\n• It now takes significantly less time to gear a character for end-game content.\n• There are now multiple methods to obtain desired modifiers on weapons and armor, making it easier and allowing players to min/max builds without so much grinding.\n• The building system has been completely overhauled making it more user-friendly and addressing countless bugs.\n• Perk cards have been tweaked and rebalanced to allow for a greater diversity of builds to be viable.\n• Several unique factions were added, each with a complete story-line to explore.\n• Season passes - allowing you to unlock subscriber rewards - are now purchasable using in-game premium currency.\n• New characters are given the option to advance directly to level 20 on start and are given a generous kit, offering a quicker progression to end-game content. You can get to level 50 within a few hours of beginning your journey.\n• Multiple new locations have been added, including an extension of the world map to the south.\n• Multiple new end-game dungeons and bosses have been added. Compared to the original end-game, the amount of content is enormous.\n\nAt the current sale price of $10, Fallout 76 is definitely worth trying out if you enjoy the series and would like to explore the wasteland with your friends.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you go into this thinking it's like 3, NV, or 4, you aren't going to have a good time. If you go into this wanting a multiplayer experience with fallout elements, you are going to have a really fun time. Once I realized this isn't going to play like the others, it became my favorite out of the series, so much that I even went for every achievement. It had a rocky start, I will admit, but it really won me over after about a year or so of updates. Customizing the shelters, weapon builds, and characters leaves you always feeling like there is something to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most underrated Fallout game. Immersive world, addictive gameplay loop. Maybe the last good Bethesda game....?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have a character on PlayStation, Xbox and now PC. If cross save was a thing on this game like it should be then I’d be such a high level. Honestly this is one of the best Fallout experiences I’ve had out of all the Fallouts I’ve played since 2008. \n\nUpdate: Anyone who trashes this game should probably stop saying they’re a fan of Fallout. You only like Fallout New Vegas and 4. Get a hold of yourself.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[h2]Adventuring[/h2]\nI started Fallout pretty late with Fallout 4 and loved it, so stepping into Fallout 76 felt familiar right away. Waking up in a vault, walking outside and exploring a ruined world full of tapes, notes and small stories still hits perfectly. I’m around 110 hours in now and still feel like jumping back in.\n\n[h2]World and gameplay[/h2]\nThe game looks great and the shooting feels good, just like Fallout 4. Every location feels like it has something going on, and if you actually stop to listen to holotapes or read notes, you’ll find surprisingly good side stories. With all the updates since launch, there’s now a main story with the Overseer, human NPCs, new areas and a ton of quests.\n\n[h2]Building, events and co-op[/h2]\nBuilding with the C.A.M.P. system is one of the best parts of the game. You can create some really creative bases and even run a player shop. Public events keep the world active too, like Radiation Rumble or Scorched Earth. The community is friendlier than you’d expect, people drop gear or help out all the time. Co-op works well but you can solo most things if you feel like it.\n\n[h2]Progression and endgame[/h2]\nThere’s a lot to work toward with perks, mutations, legendary gear and builds. Endgame has nukes, Daily Ops, expeditions and seasonal rewards, so there’s always something to chase. Nuking areas to spawn tougher enemies is still one of the coolest features in the game and changes the map in a big way.\n\n[h2]Final thoughts[/h2]\nFallout 76 had a rough launch, but today it’s a completely different game. If you enjoy exploring, looting, building and slowly rebuilding a wasteland, it delivers exactly that. I’m taking a break for now, but I know I’ll return soon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has come a LONG way and is currently in a really good place. If your looking for an MMO with a helpful community, accessible raids and an overall positive environment, give it a try! It's everything you love about a Fallout game but with the option to play multiplayer. If you subscribe to Fallout 1st, one of the benifits is you can play in a private world by yourself if you want, among other things.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game keeps getting better. Ghouls, Fishing, Building, and Rich Quest lines. What's not to love?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It makes me sad that people seem to have made up their mind on this game without giving it a chance when other games with similarly bad launches are now well regarded. It is a game I have had nothing but fun with and only continues to improve with each update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nach anfänglichen Schwierigkeiten hat sich das Spiel zu einen echten Suchtfaktor gemausert.\r\nIch finde es gut, Viele verrückte Missionen, immer was zu tun, auch im Endgame. Das meiste kann man sich erspielen und im Coop macht es, zumindest mir, viel Spaß.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "trust me if u love fallout u gonna enjoy this one too. decent amount of quests, activities and events and of course, a little bit of bethesda's greed. overall a good game in 2025",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game got me going for hours!\nGrinding, grinding and more grinding.\nAt first I didn't like it after playing FO4, but now I really like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game to play with friends but horrible lore wise. I always ignore whatever the fuck is happening in the game and just try to have fun through all the... additions. I am also only posting this so it can stop asking me to review it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's ok now, I guess.\n\nEdit: Ok, real talk. \n\nThe game has vastly improved from the release I bore witness to from years back. The gunplay feels good (much like Fallout) and the game loop is good enough. Looting is fun and the stealth is braindead which works for me, I guess. I never expected the experience to be great and it never reached that point anyway, but what I didn't expect was a passable game at all considering what happened on launch for the world to see.\n\nThe key points that ruin this game now is the multitude of factors that snap me out of the \"immersion\" that companies love to tout. I can list it as points just to keep it short:\n\n- Inventory and storage system detract from the whole looting and shooting experience, eventually either robbing you of all your playtime in the effort to manage or make you constantly make critical decisions on what should be an inconsequential aspect of the game.\n\n- Enemies are stupid. Stats are used to compensate for this. Skill has almost no involvement in PvE fights as you either curbstomp everything in sight or get slapped back to last Tuesday on the drop of a dime. Not the most fun experience.\n\n- A playerbase that's seemingly so bored of the game that they go completely out of their game to find ways to kill you and really, really make the highest effort to ruin your day, even if it means hounding you for hours. It's hard to trust any player that coaxes you in a certain direction, expecially since communication is dumbed down to a spam of generic emotes...\n\n- A very poorly written story. This wouldn't be so bad if the choices had any major impact on the gameplay. In fact, call this a hot take but actual consequences in the decisions for a game you can't savescum sounds like a nice change of pace. Instead we have all choices leading down a golden road covered in horseshit that the writers used to pad out a lot of the story with. Really, some of the plot points are mind-numbing even when you don't think about what you're reading or hearing.\n\n- Lag. Mf'ing lag. Ever fought a skyrim dragon with 3000ms ping that kicks in when more than 5 players go rambo in one location? This is the game. Never expected to see a turn-based raid in a FPS MMO.\n\nThat's about the gist of what I want to complain about. Get the game when the price drops down by 75% or something. It ain't good enough for its regular price tag but you can definitely find some good time wasted with this game on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the game where you show up to a party two years late, and it finally has enough chairs and working air conditioning.\n\nLet’s be real: at launch, this game was less \"post-apocalyptic\" and more \"apocalyptically buggy.\" But they fixed it! They added NPCs, they added real quests, and now it genuinely feels like a weird, wonderful, and chaotic MMO version of a classic Fallout game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite the extremely flawed launch and the issues the game had when it came out, 7 years later the game is much more enjoyable to play. If you have friends who own 76 or are Fallout fans, get them to play 76 with you and you'll have a blast.\n\nMy only major complaint is the same as many others have said; Fallout 1st locking QoL improvements behind a $13/mo paywall is absolutely ridiculous and the Scrapbox should be free for players because it is very easy to have hundreds upon hundreds of pounds of scrap and junk in your stash box.\n\nThis being said, 76 is a much better game that it was when it came out and is definitely worth checking out, just don't play it alone, it's much better to play with friends and tends to get dull playing solo.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tl; Dr : overall 6.5/10, 'it just works', the game is a fun fallout experience and you won't be shoehorned into paying for the sub unless you absolutely need that extra can even though you have 250 of steel and lead already stashed. It is kinda worth it for the free atoms though ontop of infinity storage, also you get a private server.  You will get a todd howard induced headache for every 20 hrs you play though.\n\n\nThe ranting:\n\npeople mad they can't sort loot. Or utilize the multiple ways to lower the stash bulk, or the crafting 'resources' lowering cost perks that you should take if your crafting (which you can switch perks and builds freely now-a-days)\n\nyea if you are LIKE me , and need that extra can for steel and lead, I'll admit fo1st definitely changes the game, you can give into your inner loot goblin without shame. Otherwise?, just stock up rarer resources in your stash then bulk them for even lower weights.\n\nAmmo comes in droves now to the point a early hot pvp spot (munitons factory) is left alone anymore, and there's really no reason to be storing 3000+ rounds of every type of ammo in your box, and if you are a lmg/flamer/minigun user, you can at least store 3000+ of your favorite type and it'll still be less then like 20-30 lbs, you do that for every available ammo type and yea it eats up space. The heaviest ammo types are fusion and plasma core with a weight of 5lbs per core, probably should take the bandolier perk if that's the case (90% ammo weight reduction) also with crafting perks, and a legendary crafting perk which starts at lvl 50 I believe, at any given time you can craft like 1000 rounds for two sets of crafting resources, so ammo is insanely easy to come by.\n\nPower Armor, each piece not on a armor chassis is incredibly heavy, 5 individual pieces is at the very least 100lbs of storage, but you can put em on a chassis and that weight is cut down to a whole 10-20lbs, I literally have 5 full sets in storage, plus two I keep on me.\n\nWeapons/aid items are really the bulk of the issue, but from what I gather, most people don't store 30 weapons in their stash like I do, they usually pick like 10 guns and switch between two 'loadouts', even more people don't even stash aid items but just loot/craft them as they need.\n\nBasically the shortened version of this rant is, no you don't need fo1st to enjoy the game, it doesn't change anything other then letting you hoard every single thing you find, with basic inventory management you'll probably never even exceed 800lbs even if you have 5 sets of PA, 22 guns, 1000 rounds for each gun and like 100 stims/radaway/and rad-x respectively stashed. ( i lie that might actually bring you to the max limit but that's ludicrous amount of stash as it is)- Which BTW isn't accounting for whatever your character has in their inventory which even with 1 str and no reductions perks is like 3-4 guns, 50 heals, some food and water items, at least 500 rounds for each weapon you have and your armor (non -PA, again a chassis makes PA like 10lbs, and doesn't count when you wear it if it's got active fuel, which is more of a unprepared situation)- everything i just listed has weight reduction perks, plus if you invest in str your carry limit goes up, ontop of that there are other perks in other trees that increase your str from being irradiated, there a str perk for like 2 or 3 str that adds a bonus for low str investment too.\n\nYou really, really, gotta be hoarding all the loot to ever see that 'exceeds stash limit' message. which for loot goblins is definitely a bad thing, but 13-15 bucks a month and you no longer have to see it, and you get like 10 dollars in-game premium currency and freebies for that, so uhhh, at least theres a 10 dollar kickback for buying infinity storage?\n\nyou know how many games where essential mechanics are paywalled behind a higher price? or even just to play the game you already bought? And people mad here because they can't store a game-breaking amount of items (which is why theres a stash limit, this is bethesda and spaghetti code we are talking about, you could crash your F04 game for the same reason, multiply that by 30 people to a server)\n\nFunnily enough, as I like to roleplay a merchant, by biggest amount of stash personally comes in the form of plans and recipes, which I already know and have duplicates of. And that is with my 22 guns, 300 nades,  5 PA sets, surplus of chems that'd make hancock call me an addict, and 150 purified water(every quest gives you like 5 water), and 10,000 rounds of various types of ammo from .50 cal - .38 ammo. Most of which I never use within the same week of playtime.\n\nSo why that's the main complaint here is an alien concept to me, especially when the game itself has a bunch of bethesda classic bugs like just not being able to open a door, or npcs staring at you because they are done talking in the middle of their dialogue (wards name comes from him being a ward of the state), or how you will definitely experience a crash at least once if you play over 4-5 hrs in a session because RAM bleed is apparently still part of their engine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "so far still so good taking the game very slow but i will say i feel like this game is way more fun with friends then solo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Does anyone know how to fix the stuck on sign in? It's not frozen, it just won't complete Loading, like the dial is spinning and I have a bethesda account, so it isn't that this is my second time purchasing the game in the last 2 days.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "S'good now. It actually feels decent to play now, and it's fun to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When this game launched there was almost no content. Baron wasteland, without any reprieve from the emptiness. Now, in 2025, this game has so much to do I am almost at a loss as to what I should do now. The graphics got revamped at some point as well, along with the crafting system getting a desperately needed overhall. A crafting system which btw was structured around a microtransaction store gated behind digital currency. Now, we have fallout 4.5 w/online features and I couldn't be happier. I got bored the other day and and decided to travel around and view bases built by the plethora of players, only to find extremely racist and borderline satanic bases. I thought, that's fine, freedom of speech right? but then I said fuck it and farmed some nuclear codes. As it turns out you CAN in fact nuke peoples bases and it DOES destroy them and forces them to either change servers or rebuild with materials. Best few hours I spent in a loong time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't think I have ever been more surprised with how good a game is after playing it. I tried the game when it was on it's free weekend and only had about 3 hours (1.5 spent designing the best looking character you have seen in your life) and after it just felt like the gameplay was lacking. I was really lost and bored and had no idea what I was meant to do.\n\nMy friend wanted me to try the game and I'll admit I was really interested. I have never really cared for the fallout series other then the lore and the show was good but the gameplay was meah to me. After getting through the rough patch in the start again I kinda got hooked. I have played about 30 hours of this game in the last two weeks which I don't typically do unless I am addicted. I have about 1 thousand hours on destiny (steam + xbox) and this is the closest thing to scratch the destiny itch that I have been feeling. The builds are so satisfying with how many perk cards you can get and expand with, the damage numbers after you get a build actually working and it just look ridiucles is so fun. Don't even get me started on the leveling up because I love it too much. I am really glad that I have this game right now even if I get addicted for a bit and stop because the game is basically immortal with how much content bethasda keeps adding. If you have a PVE itch and escaped the hellscape that is destiny please try this out because omg it is so much better AND it doesn't charge you a monthly premium to just play the game (unless you want really cool cosmetics)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fallout 76 has grown into a surprisingly rich and rewarding experience, evolving far beyond its rough launch to become one of the most immersive post-apocalyptic sandboxes in the franchise. Exploring Appalachia feels alive thanks to atmospheric world design, dynamic seasonal events, and the addition of memorable NPC factions that bring story and personality to the wasteland. Base-building is deeper than ever, and teaming up with other players makes hunting cryptids, diving into mutated events, or tackling end-game bosses genuinely exciting. With frequent updates, fun gear progression, and a world that encourages curiosity, Fallout 76 now stands as a uniquely social Fallout adventure that’s well worth diving into—especially for fans who love the thrill of surviving together.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Made the mistake of staying away from this game for years due to poor reviews. The internet is wrong. This is a fantastic Fallout game. If you are a fan of the series, this is possibly the best. The stories, lore, action, weirdness, humor, everything... its all here. Absolutely love it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fallout 76 has successfully redeemed itself, evolving into a vast, content-rich, and engaging open-world experience that is well worth playing. The core gameplay loop of scavenging, leveling, crafting, and surviving is seen as addictive and rewarding. Fun experience especially when played with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall a good and enjoyable game, the game has its bad sides as all things do like the fact that you have to pay a subscription to use scrapbox and the fact because of that you are over encumbered 90% of the time. But other than that the game is good a lot of content with the fact that the game is still updating. Heard people have issues with game crashing cant relate my self as i havent had a single crash.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game with a great community. I have never met a nicer community of players having just picked up the game after trying it when it first came out. Tons to do, good building system, good quest chains and the A++ community make this game one of my top rated MMO's.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I started playing this right around when it came out, and it did feel a little empty, but these last couple of updates have been great, I just got back into it and there's a noticeable difference. \r\n\r\nI'm a 90% of the time solo player (by choice) but I do enjoy the times I get to co-op with others on goofy events.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a buggy game, with a lot of bugs, and too many bugs, and its a grinding game p2w game. but i still play it sometimes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1446 Hours in and I can easily say that after having dropped out of the first day launch due to the lack of NPCs and other mechanics -- this game got me back into the Fallout universe... as a long time fan I do miss the darker lore and gameplay form the FO1 and FO2 era (heck even FO3) but there is still a lot to enjoy whether you are playing in a group or solo. The camp and settlement fun from FO4 is leveled up here and it can give a nice chance of pace for when you are needing a little break from blasting ghouls and healing from rads.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is good now. Wastelanders, Skyline Valley and Steel Reign added NPCs, (side) quests, all the fallouty stuff. Gleaming Depths added some much needed true endgame content and it's still fun to check out other peoples camps.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is super fun but I really wish it didn’t have as many technical problems. Between constant crashes, unstable servers and frame drops, it doesn’t matter if you have a supercomputer, you WILL have problems with it. It’s just something to keep in mind before buying. And definitely don’t go in expecting to play this like any Fallout game. I’ve played the game on my own, focusing on the story missions only and, oh boy, was it insufferable. You should absolutely only play this with friends. They will help you progress a lot faster and get to the actual fun parts of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy it. Tried it during launch, even played the beta and didn't really enjoy it back then, came back this year and something just clicked, fell in love with the game. It's also relatively friendly to solo gamers, most of the content can be done solo with the right build.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hated the game when it first came out. Felt empty and bland. Now? Full of NPC's, events, regular updates, and the ability to play with randoms and friends (Yes, that was the intent on release). They even made it where you can turn PvP off in Adventure mode to really enjoy the game and all it has to offer. 9.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fallout 76 Was quite the Ride since 2018 Knowingly it was a Shitty Game but it was a Pretty solid Gameplay since 2025. I still love it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 108.2 hours here is my experience about this game.\nIt should be noted that due to my 15-year-old laptop and university, I am not always able to play.\nThis is MY PERSONAL opinion, regardless of what anyone writes on forums and in comments.\nAnd...I am only level 70...\n\nPROS:\n- I love Bethesda games. I had the opportunity to play Fallout 1 through 3. The 4th game was also very good. But 76 is the best so far. I think it's because of the multiplayer mode. Or maybe something else ? :)\n\n- Even though it's \"not quite complete,\" coming back here later feels like nostalgia for an old favorite place that you loved, and there's a little place in your heart for that feeling :)\n\n- Community is number one in the World. It's worth playing just because the people here are the NICEST. (Of course, there are one or two jerks everywhere, but where aren't there?)\n\n- The player's support and helpfulness here is absolutely top notch. Even without chat!\n\n- Maybe because of the movie series? But lately we've been getting more and more new features for the game! I hope there will be even more updates and new features to come!\n\n- Did I mention that 9 out of 10 people always help you out and give you something awesome at random ?\n\n- I hope I can try playing with FULL graphics at least once in my life with a decent PC... :')\n\nCONS:\n- Unfortunately, since I have a very old computer, I can only play on the Cloud platform.\nWhich has a monthly fee. And I've never had a Fallout 1 subscription btw, largely because of that.\nBoosteroid, that's why you get a star from me !\n( This isn't an advertisement, but if you don't have any money and want to play, or a computer you could play games on, it's better than nothing, right? You can try GFN too ! ) \n\n- Many people complain that the game is buggy. Or rather, that it has flaws. I've encountered such things  too, but it didn't bother me \"that much.\"\n\n- I still need to get used to the menu system. PipBoy - How to quickly switch weapons, how to recharge health, etc. (Yeah, skill issue...I know, I know).\n\n-- The two biggest cons. I would really like to see these changed in the future, because this would make it an excellent game!\n\n- I would like to see more people playing it/giving it a chance ! More gifts, more free shop items. More Twitch drops, for example to boost morale.\n\n- \"No, Fallout 76 does not support crossplay between PC, Xbox, and PlayStation. Players are limited to playing with others on the same platform.\"\n\n-- This needs to be changed !!! :(\nI would like to see as many players as possible! I would also like to adventure with console players!\n\n--- --- ---  Overall (FROM ME):  It's a 8.9/10 * --- --- ---\n\nMy points were \"mostly\" boosted by the Kindness of the players! Fallout 76 has the Kindest and BEST players ! No. 1. <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fallout 76 has the best user community.\r\nThe game is extremely friendly to casual players more so than any other MMO I've ever played.\r\nThe open world is massive and so many great little details and stories to find.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fallout 76 has come a long way from the release day. There are still some bugs as you would expect from Bethesda games, but the game has been quite enjoyable.\r\n\r\nYou can use a bow in Fallout universe and create a stealth archer like you would in Skyrim. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I avoided this game for so long because it sounded like trash garbage, but it's actually pretty damn fun (especially on a discount). It's no New Vegas or anything of course, but it's a fun Fallout entry that's fun to play with a friend even though the \"multiplayer\" aspect is kinda just like a bunch of people playing Fallout solo together--there's not a lot of \"teamwork\" so to speak but again, still a good time. Appalachia is also beautiful and one of the best settings so far in a Fallout game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I honestly don't know how to feel about this game. It's like a 50/50 split of addicting and boring. Also, the game EVEN to this day still has way too many bugs...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I’m not going to lie — when I first booted up Fallout 76 a couple years ago, I wanted to dislike it. I expected the $5 I spent to confirm everyone’s early complaints. And yeah, the first impression wasn’t great: it was janky, the resolution and refresh rate looked rough, and I ended up digging through INI files just to disable VSync and clean things up.\n\nBut once I got past those initial hiccups, the game started to grow on me — a lot. What Bethesda built here is genuinely a work of art. The community is one of the best I’ve ever seen in a multiplayer game: helpful, friendly, and actually fun to interact with. The gunplay and VATS feel incredibly solid — honestly some of the best in the entire Fallout series. The dynamic player economy isn’t perfect (it’s no EVE Online), but it adds a layer of depth that I really appreciate.\n\nNow, after more than a thousand hours — most of them spent playing with my wife — I can confidently say I’ve had an amazing time. Fallout 76 is absolutely a Fallout game, and for me, it might actually be my favorite.\n\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quick Note: Much larger than I thought it was when I bought it. Fantastic.\r\nReally hate the slow unlocking of base building items and that some are only available when you have a monthly subscription.\r\nStill, you can accrue lots of things to build with without paying extra. Great game. Great story.\r\n\r\nPlays flawlessly on Ubuntu Linux using Proton.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dont see the hate has the friendliest playerbase and most creative community id rate a good 4/5",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Darn it, it's simply irresistible. After playing for almost a year, I finally gathered courage and decided to look for somethin' else, which I did, but only to come back after a few months. The hunger.For,Fallout.76. Can't explain it but it's under my skin, I missed the public events, monsters, eerie experience of revisiting previously discovered locations, weapons, shooting, more exploring, collecting and getting better stuff... One thing I didn't miss is TOO SMALL INVENTORY LIMIT! But, hey, I'll just have to deal with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very lovely game, I very much enjoy it. Especially when I get to run around the wasteland in my underwear!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR; 6/10 - the game is so close to getting a thumbs down from me. The clincher is that I'm still playing it - only the gods know why, I honestly don't myself.\r\n\r\nGood news though - the game doesn't suck, when it works as intended. The end of the good news.\r\n\r\nFallout 4 is one of my all time favourite games - by comparison Fallout 76 is just terrible, but I can set that aside, no problem. Comparing it to one of my favourite games is a very high bar.\r\n\r\nHowever, FO76, which will be celebrating its 8th birthday next time, has the dubious honour of being the buggiest, most screen-freezing and crash-prone game I have ever played BY FAR.\r\n\r\nIt's worth noting, that according to my maths, a subscription to FO76 is horrifically poor value for money compared to any game I have ever played. Personally, I refuse to buy it, which is something I normally always do for the games I play, because I feel like it would be giving Bethesda permission to wee up and down my back.\r\n\r\n\r\nThe bugs:\r\nYou'll experience them most, if not every gaming session, regardless of length.\r\n\r\nFor instance, I have 5 characters and 500+ hours in-game. Yet, none of them have ever successfully delivered a quest to one of the daily questgivers, Chloe in the Mire, because no matter what I have tried, it's impossible to talk to her, but receiving the quest has only been a problem on one of my characters.\r\n\r\nOther frequent issues include: unlootable corpses, invisible enemies or enemies stuck under ground or inside objects, and the like. That will often block quest progression, and if it happens in an instance you'll have to start over, same goes when the game crashes in an instance, which can be very time consuming.\r\n\r\nC.A.M.P. objects, including ones you have bought, disappearing, and a whole array of visual bugs, that makes FO76 seem like the game was designed by a guy in his basement, and he was in a hurry.\r\n\r\nMost weapon types have multiple bugs, however those often change, since Bethesda are constantly screwing up, I mean 'balancing', the weapons.\r\n\r\nAnother bug is when you're just walking, and you randomly die. No hostiles, no nothing, you just die for no reason whatsoever.\r\nThat's particularly fun when you're on your way to a new area, where you have no fast travel points, so you have to go back to find your stuff from halfway across the map.\r\n\r\nPersonally, I think one of the worst ones, is when your weapon breaks every time you attempt to store it, equip it or fire it.\r\nIf you don't have a stash of mods (500+ hours and I'm not even close to having that), it feels near game breaking because the only good weapon you have or just the weapon you really like. The weapon you have basically built your character around is now lost forever. This has happened to 3 of my characters, a total of 5 times. I now keep a back-up as similar to my main weapon as possible for on all my characters for the next time it happens - I read about this bug after the first time in a 6 year old reddit thread(!).\r\n\r\nSadly, I could go on, but I think I have made my point.\r\n\r\nThe crashes:\r\nWhen I started playing Fallout 76, I spent 2-3 hours checking my specs, my internet connection, and testing other games, because I couldn't understand why it was constantly freezing/crashing or disconnected from the server. I couldn't find a fault except with the game, because, of course, it turned out to be another well-known, years old, issue.\r\n\r\nI got so annoyed with it though, that I actually did the maths on it (cause I'm that kind of nerd) over a 4 day period of heavy gaming:\r\nFallout 76 crashed, on average, every 2 hours, 18 minutes and 51 seconds during that period, and there is nothing that suggests that it has changed for the better since. The good news is that if your gaming session are usually short, you shouldn't experience that many crashes...\r\n\r\n\r\nI'm not even going to waste my breath with Bethesda's inability to roll out any update without screwing up the entire game for a few days.\r\n\r\nI'm still here though. I'm still playing it, because there are good aspects of the game, although I'm struggling to find any that could make up for all these issues.\r\nHowever, I can't imagine that I would be wasting my valuable spare time with this game, if I hadn't been gotten bored with my other games and wasn't stuck at home with a broken foot.\r\n\r\nI certainly wouldn't pay 25% more than a subscription to WoW every month to receive next to nothing except a few cosmetics and storage space, and frankly WoW is a much better and of course stable game.\r\n\r\nI would love to have access to private worlds, so I could trade between my characters, but that's an incredibly low bar for a subscription. Something that, for instance, is free and easily done in WoW and other games. Bethesda has just gone the greedy route, and charges you a lot of money for things that should have been a free part of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a perfect game for inventory management in a post apocalyptic world :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, all the atom stuff are not pay to win but do provide cool stuff, would recommand the MIRELURK STEAMER for extra carry capacity and its only 500 atoms, you can get that within a week of playing, also the CARNIOVORE mutation gives even more carry weight when you eat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have been playing since it's release, the fallout franchise is one of my favorites. they've put so many of the things i love about fallout in this game from early on where it was just robots to now. i've been waiting for this new dlc for months since they've announced it and in all the years i played i've never seen the game tell me their servers are down for going on 2 days now. why am i paying for a subscription to a game i can't play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It started out a little sparse (I started playing the day the game was available) and with updates it has become something really cool and unique in the Fallout universe. Jump on in there and start blasting Scorchbeasts and trying not to die!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the game, but there are some minor bugs I already experienced that were not fixed already for a long time - some since the game's launch. I would be absolutely happy if Bethesda does get that done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if you get it on sale. Crafting is in depth and really easy. Lots of options and a lot of content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll let the game speak for itself. All you have to do is take the first step and buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good interesting story lines, and achievable solo or with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fallout multiplayer. you will have some laughs. encounter some bugs. play at your own pace. Enjoy the shenanigans!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fallout 76 is what it says on the tin. A multiplayer FALLOUT world rooted in the FALLOUT 4 engine (base building) and with all the bells and whistles of a an inoffensive but very present \"live service\". I did not play it at launch because people said it was trash. I have played it recently and keep coming back to this game because by the time I played it, Fo76 had a huge open world to explore with many NPC's, factions, dungeons, raids, and quests to do. Which is all stuff that was added post launch apparently? There's also extremely detailed base building. Also, people can fight each other, technically, but not one does thius because that's stupid and everyone prefers to be super nice. The game is pretty good. If you wanted more fallout, with no MAIN questline, and with other actual people (like your buddies) running around then this is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The community is what makes the game fun. To have a seasoned players help out new ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fallout 76 is my new favorite game. I came to FO76 after playing \"Wasteland 3\" and the F2P FO-Shelter game (Also very fun)\n\n1. The business model is perfect IMO. The cash shop is mostly cosmetic and the items aren't crazy in price, while most of it can be earned if not all by just playing the game.\n2. There is a ton to do in the game from crafting to fighting to building your camp.\n3. The crafting makes sense and its fun instead of feeling like work.\n4. The combat is really fun compared to old tab target MMOs.\n5. The level of immersion you can feel in this game is very high.\n6. The Updates are at no additional cost.\n7. The Subscription is worth it and it helps keep new content coming to the world.\n8. The cosmetics are diverse and interesting as well as just normal clothing if that's your thing.\n9. The community is amazing and helpful.\n10. You don't need to subscribe to enjoy it.\n\nThe only feedback I have for this game is to add mounts. Things like skateboards, bicycles, maybe even motorbikes. These items wouldn't be hard to assemble in real life tbh. I think it would see players doing more adventuring than fast traveling tbh and it wouldn't take away from the game at all. Obviously you couldnt use a mount in power armor, but adding a few mounts would make this game, by far the best MMO I have played. There used to be a game called Secret World by Funcom (Worst company ever) that had a similar feel and their mount system was really cool, in a world that was probably 1/100th the size of the FO76 map. If it worked there it can definitely work in FO76.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fallout 76 has been fun for years. They continued to support the game and new content has appeared with enough frequency to keep me interested. If you like the fallout universe and have not played this game yet, then you need to play it. If you haven't played this game for  years. Then you need to come back a play the new content you have missed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game when it first came out. I liked it a lot then but stopped due to the bugs in the game and laggy servers. I just started playing this again and I have to say, a lot has changed for the better! This game is by far something else entirely then when it first came out. I almost have no lag, Quality of life improvements have been made that make it way better then it once was. This game is definitely worth a try if you are any type of fan of Open-World Apocalyptic games. 100% Recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They've made a lot of improvements, since I stopped playing, way back in 2020.  Game was boring, without NPCs.  The factions make the living space much more interactive.  Still like the core game.  Scorchy Queen is still a fun fight.  Haven't played with the Pitt or Altantic City content, yet, since coming back.  Looking forward to getting into Burning Springs too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game hhope it will be much moe updates and lots of playes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great community of players the game wAS NOT GREAT ON LAUNCH BUT HAS REALLY BECOME A GREAT GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the quest side of the game as not all of it is slaughtering creatures, having said that the fighting side of the game breaks it up nicely. the  visuals are awesome and failry realistic. all in all the more you play the more captivating it is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great community game, as a new player even years after launch. Players are helpful and fun. The content is fun and leads you places you would never guess. The building system deff needs some work, It seems like the updates they have been making are leading in a better direction.  It is easy to sink hours. Have not reached end game yet but at lvl 100 I am liking what I have done. Community events and rewards are fun and worth while. Will update more when I reach end game or 1k hours.  Would recommend to new players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who played when it launched on Xbox, and didnt make it long at all because of the bugs and player issues, to someone who bought it here on Steam and started playing again recently, totally different game. \r\nRecommend 100%, fun with friends 150%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has really improved over the years. Love that they add new content here and there. I actually enjoy playing on a team. A great variety of players too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't been able to change my gamertag since starting and support has been no help, other than the broken bugs that takes weeks or months to fix its not that bad, it just works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great over all game to chill and have fun with groups, solo, or just building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story funny guns, raids, and over leveled people helping me get to level 50. also got it for like 4.50$",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game IS NOT THE SAME GAME it was at the launch. I attempted to play it then but was thrown into a battle other players & was nothing like the other FO games I've played. But I gave it another try this year & it has grown on me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "some aspects are annoying when compared to fallout 4, mostly the sheer onslaught of enemies as opposed to more unique challenges, but the gameplay loop is extremely fun, and just playing around and messing with friends can get you on this game for hours at a time. I haven't quite completed the game yet, because has mentioned, I play with friends, and am waiting for everyone to finish up their respective stories, but I assume that the ending will be just as intriguing gameplay wise as every other interaction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was reluctant to play 76 because I always modded the previous games heavily, but the gameplay is mostly pleasant. But I would still mod the hell out of this game as some game mechanics are weird.\n\nI love the map full of content like in Fallout 4 and a lot new lore. Overall I would say it is great past time when waiting on Fallout 5 :D.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good reference and what if  the world will become if we don't pay attention to everything around us. Hell some of the politics in the game is like what it will be if our gov does not wake up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been a Fallout fanatic since Fallout 3 was released. I purchased Fallout 3 knowing nothing about it and quickly fell in love with the quirky sense of humor and the storytelling. I didn't mind the rough edges at all, they were part of the charm. Fast forward to Fallout 76. As I write this Fallout 76 has been out for like 7 years and though it had a very rocky launch it's a very different game than it was on day 1. \r\n\r\nFirst, let me be clear, Fallout 76 has never come close to touching the soul of any previous Fallout titles. It's missing much of the dark tone and humor, though the new Burning Springs update looks to bring some of that back, hopefully. But, there are other things I love about this game and that's why I've poured nearly 5,000 hours into it. Here are a few:\r\n\r\n1. The vendor system and trading community\r\nWhile I don't love the 40k cap limit by far the biggest reason I play this game is to search for and resale items in the game. What can I say, it scratches an itch. When you add the Fallout 76 trading community on top of that you have something that borders on an addiction forming experience for me.\r\n\r\n2. The daily/weekly events/rewards\r\nI don't know what it says about me, but I love completing the dailies and unlocking items on the scoreboard. I know that it's the collector in me that wants to own as many in-game items as possible, but I enjoy it!\r\n\r\n3. The community\r\nThere are many days where my interactions with other F76 players helps restore my faith in humanity. I've had so many free items given to me and incredibly positive interactions with players on Discord/Reddit, in fact I can count on one hand the times I've been griefed by other players.\r\n\r\nIs F76 a perfect game? Not even close. It does run very smoothly and with great performance on my PC but there are always going to be bugs with Bethesda games. In short, this game is easily worth the prices I've seen it for on Steam, you should try it and see if you love it as much as I do, and I DO love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've only logged 13 hrs because I just bought this,but I own every one of the fallout series so I know whats good and what isnt  Let me just say if you dont get this game at that 10 dollar price then you are really missing out. This game plays like the other fallout games (DUH) but with other players around. With the passive mode you have no worries. It does have a few bugs but what game doesnt? Its taking me some time to remember the learning curve again but its all coming back now. This game keeps getting better. Its not the disaster it was at first launch,and from what I have read,another really big update is coming soon. You can't go wrong for that 10 dollar price tag.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game cause you can meet nice group of people and build a community and just chill and have fun playing with you friends and family and grinding through the raids and get awesome stuff out of doing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a nice callback to fallout 4. My only real complaint is that the missions and events are in my opinion, watered-down content. The adult and horror elements from F4 are gone and replaced with tea parties and butterfly hunts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love Fallout series, and since they have done so much to Fallout 76 since release it has become amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Some bugs are expected. It's a lot of fun to nuke and shoot things, even the clunky building is sometimes fun but mostly frustrating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game very good mission rpg. if you liked any of the other fallouts you might like this one because it is multi player so get this game for you and friends, hop on and lets play this amazing fallout creation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always have been a fan of the Fallout games and its lore. When Fallout 76 came out it was awesome and something new and refreshing. Over time it got pretty repetitive and most of the original fanbase stopped playing. Not sure how the game is now but in 2025 if you wanted to purchase, just don't bother grinding anything, have fun, meet strangers, complete the main story and stop playing. The PvP is meh and not very exciting, having a great build and boosting others feels good. You can avoid PvP altogether with passive mode on if you want. Hopefully the next Fallout game is much more bigger and the updates for the game are more exciting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game lots to do, camps to build, lots of new updates. I have enjoyed the fallout experience, I highly recommend you play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Personally, I preferred the single player Fallout games but Fallout 76 does scratch that Fallout itch. It does offer the Fallout RPG character creation, exploration of convincing environments and some single-player campaigns. It also offers events that you can play with friends and a great online community. Game is constantly getting updated with new features and expansions. A negative aspect is that while collecting new gear, weapons and other junk, you will soon run out of space in your personal storage and to remediate that, you would need to pay for a \"Fallout 1st\" subscription which allows the player to store their junk, ammo and and meds in separate storage boxes. However, this won't happen until you reach a higher level or well after you beat the campaigns and by that point you can decide whether you want to invest further into this MMO or play another game. Overall, it's a good time wasting game... again, if you need to scratch that Fallout itch and need a break from the older series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who played the beta, 76 has come along way. Are there bugs and problems? Yes. Is it still fun and overall enjoyable? Also yes.  If you liked Fallout 4 and want more, 76 is the way to go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every Fallout fan out there should be playing Fallout 76. There are still a few bugs here and there but I don't care, I had and I'm still having a blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game especially after all the updates. Very enjoyable especially if you are a fallout fan. Not perfect but in this day and age what game is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has improved a lot since its release, very good game 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love all fallout games alot! this game is one of the best open world games out there!! worth buying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "76 is still not perfect, but in the years since its launch it's improved massively. It's great for lore, gameplay, grind (if you want, but not really necessary) building, and roleplay. Plus, the community is one of the kindest you'll find in any MMO. Don't expect many people to be actively using microphones, but a surprisingly large contingent at least are listening.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has come a long way. It's not free of bugs and I did have the odd crash or three but overall, this game is in a really good spot. It's fun! I recommend giving it a try! Considering the absolute mess it launched as it really is a pretty big turnaround.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As somebody who's only really watched friends play fallout due to it's lack of co-op and my lack of enjoying singleplayer games, this game is pretty solid, there were some bad talks about it ( mostly when the game first game out ) but I'm yet to find anything lacking, from my perspective, old fallout players, new, and returning could all enjoy the game, the 1st stuff is not needed and from what I can tell really doesn't effect me, furthermore, this is their premium battle pass, and like fortnite, you can acquire points very slowly without paying real money and spend them ingame on custom outfits etc, it's a grind, but purchasing premium may take away your incentive to grind for personalized things anyways. \n\nIf you've got a fallout friend, this would be an ideal social experience for you guys.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game, like Fallout 4, but with all the worthwhile mods, and multiplayer. More compelling story too, even if it's told in a rather peculiar way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All the changes they have made recently has really made this game so good! This is probably my favorite game right now, and i have sunk 107 hours into it in like 2 weeks.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I want to like it, but (crash) Bethesda does everything they can to prevent it. Limiting the storage to 1200lbs without a monthly subscription, (crash) the game has problems booting up and sometimes takes multiple attempts (crash) to start, the fishing is so janky and sluggish. (server not responding) I love the fallout franchise and I wish Bethesda did too, but instead they chose money and greed.\n\nBuy any of the other Fallout games instead",
      "voted_up": false,
      "votes_helpful": 265
    },
    {
      "review": "you got the game full price for 1/2 of the game because half of the content are locked behind a paywall that is called \"Fallout 1st\"\nthe remaining half also divided by half of the content that is no longer avaiable because they were limited season.\nhave fun playing 1/4 of the game that you paid full price for\n\nedit:\ngave it another try. still not recommend it\n\nto those who said no content were locked behind paywall\nshelter, weather changing station, survival camp\nlocked contents are still contents\nyou paid for full game, you should have access to full game",
      "voted_up": false,
      "votes_helpful": 246
    },
    {
      "review": "Here's a tale for the 21st century.\n\nBethesda launches a game called Fallout 76, forces you to play it through their crappy launcher during the era of mindless corporate zeal for advertising in-house IPs to a captive audience\n\nBethesda's crap launcher, being useless and annoying, is later abandoned\n\nBethesda tells all those who bought the game that they can no longer use the launcher to play; instead, you have to migrate the game to Steam (where it should have been released in the first place)\n\nBethesda then tells you that, sorry, some of that content you bought for the game? We can't migrate that. So you have to choose: either you get the game (which you bought) for 'free' on Steam, and give up the extra content you paid for, or you repurchase the game on Steam (and give up the content you paid for)\n\nAfter repeated attempts to explain to Bethesda that this is their fault; that they insisted gamers use their launcher, which everyone knew was useless and anti-consumer; after pointing out that they never explained that you might some day have to choose between purchases made for the game and the game itself; and that you're willing to accept the migration if they just refund the purchases they can't carry over, even using in-game currency... you are told, repeatedly, about 7-8 times, the same generic, canned, ape-like, zero-accountability response. Not a response that in any way addresses any point made (especially that *they created this entire situation*), but which simply repeats ad nauseum their drone-like requirement that you give up paid content for the migration to happen. You are pretty convinced that you are not dealing with people, but bots.\n\nAll attempts to contact higher-ups, the 'thinkers' at Bethesda (i.e. anyone with basic comprehension and customer service skills, like a supervisor) end in failure. The conversation goes nowhere. You are now cooked. You've lost everything you paid for over a few years. They really don't give a crap.\n\n\nThis company does not respect its audience. \n\nThis company does not think ahead. \n\nThis company does not admit its mistakes. \n\nThis company does not value Quality.\n\n\nThis company continues to charge full price for a 7 year old port of a 10 year old game's system/assets, which even at release in 2015 wasn't great to look at and was prone to crashes and performance issues. \n\nBut they've got time to linger on the development of a sci-fi game that drains all the fun out of sci-fi, because Todd Howard can't understand the distinction between actually going to the moon as a contemporary human, and running across procedurally generated blandness as a gamer.\n\nNow we have to wait 7+ more years for another decent Fallout game. And what's going to happen then?\n\n\nYou suck, Bethesda.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A lot of reviews seem to be about the poor monetization efforts of Bethesda. While I agree, I'd like to instead focus on the gameplay itself.\n\nBut how do I say this? The game just feels .... [b]empty[/b]. The map is huge and there's a lot to look at, but every location I venture in to feels incomplete. On occasion I'll come across some random world event, but in almost every location I'm finding absolutely nothing. All the enemies are dead, killed by a player that just recently passed through.\n\nTo circumvent this and experience the location in its entirety, I need to hop servers until I find one where the POI I'm exploring hasn't already been ransacked. Even then, the enemies are few and are no real threat. They die quickly, don't put up much of a fight, and have very little variety.\n\nFallout games are known to be packed with mini adventures in every corner. You walk into a town and there are a thousand things happening around you. You, as a player, can choose to interact with any of the things happening around you. Sometimes the things happening around you push you into a massive quest line where your decisions are paramount in the telling of your story. Sometimes the distractions simply show you pieces of lore, hint at a unique location, or give you some mini adventure to help immerse you in the world.\n\nFallout 76 has none of that. \n\nAnd, I know what you're thinking: \"This is an MMO, not a traditional RPG story telling game.\" and I hear you. So let's focus on it from the MMO aspect and you'll still find it really has nothing to offer. Player interactions are very infrequent and there is often no incentive to work together. World events offer no challenge and don't warrant working together. And since the world scales around you, enemies will be just has difficult when you're level one then when you're level 1,001. The only difference is you'll have a different weapon to kill them with.\n\nI have absolutely no incentive to grind and unlock gear, or to explore locations to find unique items. Everything requires an absurd amount of resources and, inevitably, you'll find you can't gather everything without paying more real money (I know I said I wouldn't talk about the monetization, but come on!)\n\nWhatever makes MMOs great, Fallout 76 doesn't offer it. It fails to be a Fallout game and/or an MMO.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Without Fallout 1st this game sucks. Fallout 1st also sucks. Bethesda sucks for making Fallout 1st. This game sucks and so does Bethesda.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Slop Game, which needs a subscription to get the full experience. \nBugthesda ripping you off as always the case for at least the last decade. \nHave fun with a \"pay to pay to play game\" i guess.\nOh and by the way, I didn't get the game for free. \nI bought this abomination of a game at release in 2018 and it got ported for free to steam, because Bugthesda couldn't sustain their own forced launcher against steam.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Useless, Been trying to play the game for the last 24 hours since the update and still can't sign in. Typical Bugthesda. It's pitiful that these people can't even do their jobs right.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Terrible corpo-slop.. Don't trust the positive reviews, they are all Reddit \"adult-baby\" cattle satisfied because of bright colored powerarmor and Battlepass skins. The cosmetics are shiny so the herd is thrilled... A perverse insult to the previous games.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "terrible netcode and devs will hype an update for months just to not be prepared when it drops",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Its fun when it works but they keep breaking the game with every update. The battlepass model is also pretty draining.\n\nMy advice is just to play the story and get out.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Once upon a time i would have recommended this game. Until i got on today for the new update. \n\nI overlooked the servers being broken for almost a day and a half. \nI overlooked the several nerfs they added to alot of the buiilds i made\nI overlooked charging people to have nearly no stash cap\nI overlooked the raid \"fixes\"\nI overlooked time and time again this game didnt just work.  (todd howard talking about the game before beta release \"it just works\")\nI overlooked alot of absolute disrespect from the developers when it comes to peoples time spent in this game.\n\nWhat i cant overlook is that i put my time in on last season for one specfic reward. The red cherry bomber work bench. I even bought the pegasus work bench because of the cherry bomberr and built a whole mechanics garage. Now My CBWB is gone. No answers.. No communication about it. Nothing. Its been completely removed from the game. Fuck this game and fuck you bethesda\n\nJust a huge hole in my decorations now. I do not recommend this game to anyone who values their own time.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's alright, a good time waster game. But they paywall basically any and every minor convenience behind either their subscription for a paid game or the in game shop. At best, get it if you want a fallout themed way to waste time.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "[h1] Why The Negativity? [/h1]\r\nI like the game, I enjoy it and I want to keep coming back for more. Then why the negative verdict you ask? Because Bethesda is fu***ing lazy and incompetent. While Fallout 76 was a lot of fun to play its not without its problems\r\n\r\n[h1] Some Fallout 76 History[/h1]\r\nBefore I even review the game itself let me tell you what I had to go through to get this to run in the first place. Yes you heard me correctly I had to fix a game released back in 2018 which was a buggy mess on launch and that is currently being \"maintained\" by Bethesda and they still haven't fixed a lot of issues.\r\n\r\n[h1] How Did I Get it To Work? [/h1]\r\nFirst of all the game didn't even work properly. I had a lot of stupid stutters that prevented me from enjoying the game. Now any sane person would think this is an issue with my pc itself (even though its an RTX 4070 mobile GPU with more than the required specs) I tried by lowering the settings not once not twice but at least 10 times.\r\n\r\nThen I had to install a lot of 3rd party files to MAYBE fix whatever the issue is. Didn't work either. I spent 4 hours just trying to get this to run. Then my last resort? Ask the steam forums. Same old bs everyone suggested what I had already done but then?\r\n\r\nThis is what ended up helping, a person on the steam forum said\r\n\r\n\"Try waiting for the title screen to change at least once before pressing any button to sign in. works for me and some others\"\r\n\r\nWow Bethesda.. just wow.\r\n\r\n[h1] The Positives [/h1]\r\nNow for the game itself\r\nA large open world with daily quests, seasonal updates, friendly community, The \"C.A.M.P\" building mechanic which is basically a heavily nerfed version of settlements from Fallout 4 (still fun though). Other than a lot of unique new weapons exclusive to Fallout 76 and then there's the main story quests too which are also quite engaging. \r\n\r\n[h1] The Major Issues [/h1]\r\nThe game itself is a lot of fun and I won't deny that but that brings us to our first major issue. Fallout 1st subscription model is a predatory monetization scheme. It doesn't offer any substantial benefits and is just a scam to be honest. Instead of being base game mechanics they lock them behind paywall. Your storage is running low? We know we designed the game in such a way that you'll eventually have to buy our premium so here's Fallout 1st so you can have unlimited storage. You can't buy certain items from the shop? Here's Fallout 1st. You want to play on a private server with friends? Well Fu** you buy Fallout 1st or take a hike.\r\n\r\nBasically their answer to every question is \"Pay more for a game you already paid for to access basic features\". Then there is the C.A.M.P \"budget\" which means you're only allowed a limited amount of space/storage/bandwidth to build your base (Which is fair because the server has to manage a lot of players at the same time) However the budget can be increased they just dont want to improve their infrastructure at all.\r\n\r\n[h1] Conclusion [/h1]\r\nI like this game a lot. I even want to see it succeed because Fallout is one of my favorite franchises of all time. I've been following since Fallout 3 and here I am now still trying to support 76 because Fallout as a franchise means a lot to me. However we cannot allow Bethesda to treat it like this and keep shoving slop in our faces.\r\n\r\nIn short a great idea with a lot of potential but extremely poor execution. Despite the fact that I had a lot of fun the issues I faced make me come to this conclusion I cannot recommend Fallout 76 in it's current state no matter what. Do better Bethesda we're not going to tolerate this anymore.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Having to pay 15 Euros every month for basic functionality that should be included in the game from the beginning feels like a total scam. I don't mind supporting the developers of some of my favorite games, but this... It honestly hurts. 1-2 Euros per month as a symbolic payment to support Fallout 76 is something I could understand and accept, but 15? For what? For storage? And this \"Fallout 1st\" Trial – where is it? I have never seen it in the Atomic Shop during all 400 hours of my playtime. Is it just another scam from Bethesda? What did I pay 40 Euros for? For half of the functionality?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I have played off and on since release and actually like the game, BUT you should not have to pay a monthly fee for basic game features, such as storing scrap at your base. If you want unlimited scrap storage at your base you must pay for Fallout 1st. Without this, the game basically becomes about what to keep and what to discard. Stop charging us for game features that should be standard.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's more complicated than a yes or a no; even as I am writing this, I'm currently playing it, and I've put 94 hours in in the past two weeks, apparently.  \r\n\r\nFallout 76 was one I initially picked up on PS4 when it dropped; I've been through a lot of the highs and lows, and so my recommendation is: if you can find your own fun in things with friends or alone, you might like this game.  However, that said- there is absolutely NO REASON this game should be as buggy as it is, 7 years out, over some of the most basic of things.  It's a real shame that Bethesda doesn't give this so much more technical support, too, as it could really be a good game- but it's ultimately stunted by some design choices, by lack of bug fixes, and a healthy dose of corporate greed for microtransactions.  \r\n\r\nAgain- overall, I personally really enjoy my time with the game, but I can't in good conscience suggest it to others at full price.  Wait for a sale.  There's a ton of FOMO marketing at play with it, too, which frankly sucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is shockingly not as dumb as I expected.\n\nBut it's still really really dumb. And there's hardly any players. Pointless game with a pointless existence.\n\nSomebody tell Bethesda we've got Fallout 4 at home ... as soon as they're done constantly breaking all the mods for it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unable to login after verifying linked accounts on Bethesda's webpage multiple times.  Spent way too much time researching and trying different things to get past the failed to link message.  Bethesda support was zero.  Not worth the headache.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you can get past crashing 5 times a day, having to reset, regularly, because you were ported inside of a solid object, staring at a dark screen for more than a minute, every time you change locations (fast traveling or entering through a closed door), losing items into the ether, then this game's for you. The gameplay and the story are great. The software is some of the worst I've ever seen.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have been addicted to playing this game because it is familiar. On that note It means You can do the same thing over and over. Even the special events like launching a nuke. I however have not tried the raid but I haven't found anyone doing the raid. Probably because of how little communication they allow in game? Honestly the new update Burning Springs and how everything has failed again just makes me seriously question why I continue to play this shit anymore. Sorry my post is a mental spill. But Maintenance straight into failure. Fucking absolutely Bethesda.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "many, if not all, essential QoL features are locked behind monthly paywall (1/3 the price of the game itself) despite the game isn't free to begin with.\n\nMany things can be done to improve experiences such as reduce the weight of junks and ammo, increasing base stash limit every 1 to 2 years, reduce crafting and repairing cost,... But knowing Bethesda, they probably making those junk and ammo heavier then say \"go buy the subscription instead\" before any of those happen.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "hello everyone \r\nhaving played F76 now for a while 130+ hours here's my view .if santa was to give you one game this christmas f76 or f4 go for f4 and join nexus (free) and choose from the thousands of mods on there all again free (some ask for donations)=everything you'd ever want on there and more.\r\nI've reached level 50 now and it feels like thats it really\r\nthe whole join 1st (are non 1st members 2nd class!! players)  for more stuff to unlock is rigged, grab as much rl money as we can from these suckers !!! ironic really given fallout stories of corp greed and power \r\nwe gamers like doing quests to get every gun/ammo/clothes/armour/bobblehead/etc then find you carn't store them!!.\r\nnot only is there atoms (money) but also event tickets (more money!!) you have to send/save/swap!!!\r\nif like me you spend hours building in workshop mode (fallout 4 nearly everything free/unlocked) not so in F76 =all about the \"money/atoms\" again \r\none thing about F4 is you F*** up a mission etc you just go back to a old save not so on 76 (i accidently spent most my atoms on something thats locked for 1st members only !!=doh \r\nI will try 1st for one month only just to see ( £12 a month= £3 a week= £1 per hour anything over that and your winning surely) +just to unlock the freebies !!\r\nIf you are into team playing(i just play solo) it may be better (if you all chip in for a sub/private world etc it would'nt cost much =I'm not really sure how that all works though \r\nall in all my score for f76 is 50/50 .at the end of the day it's just a game =switch off the pc and go outside",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "cant find any animals to tame and its been like a solid month :(\nedit: i found a deathclaw after like 2 weeks and they walked off a cliff and died right away\n\nbeen playing since the beta, and played the whole \"canvas\" bag game back then, too. the little niche creature comforts are exceedingly rare/expensive and id rather spend the hours grinding on something a little more productive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is horrible, every patch brakes the game even more then before, bugs that have been in the game since day 1 still exist, they are owned by microsoft yet have servers worse than indie games, flying enemies are bugged 90% of the time, earl gets stuck in the floor, sometimes weapon you fire just shoots blanks but still uses your ammo turrets do nothing at a base, they are just their for looks, the building is somehow worse than build a boat, the game also locks multiple features behind a subscriptions and most of the good self generating items behind the shop, super greedy company that doesn't care, the devs might care but the higher ups obviously doesn't, save your money and if you still want to buy it wait for a sale but beware, this game has no cross save, and no cross platforms! Save your money until a deal or spend it on something better than this trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly just a really poor attempt at making a live service RPG. Not to mention it's disgustingly over-monetized.\n\nI'm a huge fallout fan, but this is just not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wanted to like it. \n\nWhy does it stutter (jutter maybe?) so badly? The poor responsiveness can be forgiven, it's an MMO. The brain-breaking stutter that gives me motion sickness cannot. The other games using this engine also stutter some, just not nearly as badly as this, probably because they don't have additional networking lag. \n\nAlso seemed boring, but that might just be MMOs in general.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1500 hour in game with a fallout 1st subscription and can't log in whilst the press can? Hello? Whos' paying for a service like that.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "After launching and when attempting to sign in the game often freezes requiring a restart. If I do manage to get it running 1/3 the time I get audio bugs that remove certain ambient sounds, footsteps etc.. and the loading times are very rough in general and occasionally the game freezes. Then there is the Atomic Shop where I just want to build the most basic things/have storage and much of it is locked behind a paywall which is all so shoved in your face. Almost $20 a month for Fallout 1st. That is brutal.\n\n76 is more of a chill vibe which is nice but there hasn't been anything storywise that feels exciting or captivating. Like usual the staff at Bethesda couldn't make a compelling NPC that didn't move like a robot if their lives depended on it. \n\nOn a positive note the music, ambiance and environments are beautiful. It's a bit of a step up from Fallout 4 in terms of visuals and combat physics. It's just a shame Bethesda can't get their act together. The ip needs to go to more capable hands.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy this game in spite of itself and Bethesda. Try not to give them your money if you can help it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I started playing in the middle of Season 9 (August 2022) and stopped playing at the end of Season 19 (March 2025). As one of my friends put it, this game is largely unplayable without a Fallout First subscription. I did purchase first for two years. 76 quickly becomes a game of inventory management and I found that given my play style, I was eventually only logging on to do the daily tasks to keep up with the points required to unlock everything on the scoreboard. The FOMO was real. If you don't care about the unlocks. both cosmetic and functional, the game does offer a good number of quests and storylines to follow with plenty of hours of play and decent play mechanics.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CORN WORLD!!! This newest update is absolute ass! I'm never playing this game again, hundreds of hours and time and money drained into this for fucking corn world and a reference to a TV show i could give less of a fuck about. Giant raider camp?? 8 raiders inside a defense fort that reaches the skies and has tons of junk and pipes and crap all around for 8 guys and maybe a dog and some bloat-flies to die in 2 hits of your lucky. This is supposed to be the \"biggest\" expansion yet but its pretty easy to make something big when 90% of it is empty fucking desert with inaccessible buildings and deathclaws that pop out of the ground with broken animations where they stand still and just take a beating. Bethesda , I honestly hope your company gets completely absorbed and turned to some shit stain in the hands of Microsoft cause you guys deserve it with how much of a let down this was. You cant properly make games anymore and you're completely washed. All of your new releases are filled with bugs and your passion is dead and gone with the wind for corporate greed. Choke on your wealth and success from microtransactions and predatory purchases cause I'm willing to bet most of your die hard 76 players will leave after this nuclear winter of content and you wont see any kind of profit from any other releases you make cause any other release will be filled with doubt and sadness for seeing such a great game creator who could pump out skyrim and fallout turn to money siphoning and shovel-ware to some of the most dedicated fanbase. I will be uninstalling and completely removing this game from my steam list and blocking you as a developer and sticking to modded skyrim. Since a man in his basement can make a better addition to your own game then a multi billion dollar company with hundreds of \"skilled\" programmers that eat fucking dirt for breakfast apparently. They cant even make their start screen render more then 5 fps for the past few years until enter the atomic shop and suddenly you have 800 frames to browse and spend money all you want. Eat a fucking dick Bethesda",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "To start, I have no comment on the game as it is, PVP multiplayer world.\r\nI am playing this solo PVE on a private server/ private adventure.\r\nI like the game itself, the fallout world.\r\nI don't the mechanics of the game.\r\nThere are no saves but autosave, being based on an open pvp set up.\r\nThe servers crash or kick you off a lot, so whatever you were doing, you need to redo it.\r\nThe fade system is stupid, so everything in the distance looks blurry all the time, even if you \r\ntry to change your settings.\r\nYou can't mod the game even to try to fix the graphics, because it might affect the pvp game and you could get an account ban, even playing solo.\r\nTo play solo or private requires a monthly fee.  So I won't be playing this long term, a month here or there.\r\nSo far I didn't have any issues canceling my membership, but I used my wallet.\r\nSo far everything is overpriced in traders, caps are scarce, and you have to find any crafting mods by breaking down things for materials. Trying to sell them is horrible, one gun for one cap kind of thing,\r\nbut I just started the game.\r\nThe game textures are bright orange most of the time, an autumn effect, which looks really bad.\r\nThe perk system is still asinine like most of the fallout series.\r\nI bought the base game on sale, but I wouldn't recommend buying this at full price.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "fuuuuuck me I really do not like this game, its decent with friends but it gets boring really fast, early game is just a huge walking sim around the entire map, all the cool stuff like items and cosmetics are locked behind a pay wall or a 99.99$ a year membership.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bethesda really hates it's premium customers.  The game itself is really fun.... the company is evil and greedy because they refuse to modernize their platforms and refuse to compensate premium subscribers.  \r\n\r\nplay the game, accep that bethesda is literally the worst developer besides maybe ubisoft.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "honestly its a bit disgusting paying 70 dollars for a game then they think youre gonna pay 13 a month to be able to enjoy the game you already paid for like seriously? 13 a month to play by myself? what a f*cking joke i knew i shouldnt have given this pos a chance",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Servers went down on Tuesday at 3 PM UK to apply the Burning Springs update. After 5 hours of maintenance, Bethesda states it's now available to play across all platforms, only for no one to be able to log in. Bethesda status portal shows 76 outage shortly after but no word from Bethesda until 40 minutes later. \n\nAround 6 hours of \"investigation\" later, Fallout 76 servers are back online according to Bethesda \"We're seeing positive signs that the login issue has been resolved\" with many users still being unable to log in. For those that could log in, they where treated to almost an entire hour of play before being kicked from the servers. \n\nBethesda continues to investigate with zero communication for 12 hours with the only news being servers will be undergoing maintenance, as if they haven't been in maintenance for 23 hours at that point. \n\nIt's now 6 PM on Wednesday and 20 minutes ago Bethesda said they are still investigating login issues across all platforms. 27 hours of maintenance and counting. Extremely embarrassing for a company worth 7.5 billion to fail to roll out an update so badly that they set records for longest server downtimes. This company is done for.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As a big fan of the Fallout series, I waited for this game to be patched for years, but holy cow! It was such a boring game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible just terrible . Just started playing and had my first major update . Usually other games gets an update, you're able to log in after a few min of maybe an hour . this takes a whole day to even enter the game . Vault tech fix ur damn servers",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "While the game is a ton of fun with a huge amount of content, it is a frustrating, buggy mess. I first played on release on xbox but haven't played since they added npcs (I just beat everything with the solo version, doing it all again with npcs felt pointless) but wanted to see how different the game was after so long. I was extremely disappointed to see that there are STILL some of the same annoying/game ruining glitches present after as many updates as they've done. It would be worth hopping in if you can get the game on a big discount, but nobody should pay full price for a broken product that the creators seemingly have no intention of fixing. I will admit, it's a good way to kill time... when you're not falling through the floor, encountering invincible enemies, keys not opening doors for quests, animations getting stuck and making you reload just to move again, etc...",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "the game is really fun until you have to do a several weeklong repetitive grind. for example: Union PA, the easiest and most grindable mission has several inexcusible bugs with the update having come out over 4 years ago. not to mention the raider rep is annoying as can be too. several weeks for nothing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have played this game for close to 1000 hours, and somehow it still mamages to take 5x restarts for my computer to actually load the game without crahing. What a joke of a devloper. P.s my computer is more then able to run this game, its honestly outstanding how you managed to create such a buggy mess!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dislikes: Power armor spits you out in the middle of a hectic gun or missile fight so fun when we have to run back to collect our dropped stuff fun fun fun. We also dislike that there are no containers, No Containers, NO CONTAINERS in our C.A.M.P. Not a single one. We have to fast travel somewhere else to store our junk. Yes this game seems to be the model of American Capitalism. And this is only 160 hours in we will come back to amend later.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is extremely uncomfortable and janky to play on PC. The game needs a bunch of .ini file edits to even feel slightly okay to control in the first place, but that doesn't fix the inherent jank and incredibly blurry presentation.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lol no \n\nShite game, shite developer, and the worst most disrespectful show to accompany it. \n\nES6 is gonna suck and suck haaaarrrrddddd.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stop trying to get me into your cult 76 players. The game still sucks at a fundamental gameplay level and no amount of golden sparkles or flashing Christmas lights you buy with real money from the Atoms shop will hide the fact that this game is still at its core a peace of crap. You will always at some point run into the wall that is running out of inventory space in a game that only rewards you with stuff to put into your inventory space and the only solution to this is to subscribe monthly for $13 or yearly for $100 in a game you already paid $40 to even play in the first place. (unless you were unlucky enough to buy the game when it was $60 for the standard or even more unlucky like me and got the Tricentennial Edition for $80, ugh)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game and updates are not alpha or beta tested, they are having major problems and just seem to f'ck stuff up over and over.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The best way to describe this game is aggravating. \r\n\r\nWhen it's working properly, it is fun, but it rarely works properly. It's full of bugs. When I search Google to find out how to progress from where I am stuck, the most common statement I see is \"That is a common bug. Exiting the server and reentering will usually clear it\". The problem with this is the game does not save your progress in instances until you complete the quest so you end up having to redo content, and re-kill monsters, to get back to where you were. \r\n\r\nThere is not enough content. Many people run through all the content quickly and start posting \"OK I ran though all the content, what do I do now?\" questions on social media. I find none of the posted answers satisfying. Doing dailies every day is boring. Doing raids and other team activities is difficult mostly due to the fact that the game totally lacks any way to talk with players other than emotes which is equivalent to your dog barking at you and you trying to figure out what they are saying. \r\n\r\nThe economy is a mess. The main currency \"caps\" has a very low limit after which you lose them. You can sell items in your own vending machine at your base, but if you happen to sell two high value items quickly, you'll likely lose a portion or all of the caps from the second sale. Most high level tradable items like weapons and armors have values that exceed the max caps limit so player-to-player trades are necessary where you trade one high value item for another. The problem is, the game has no safe interface for player-to-player trading. In order to avoid being ripped off, players go to an external third party website and hire (pay) a trusted courier to do the exchange. And again, it's difficult to coordinate an exchange when there is no chat system in-game. \r\n\r\nI am still playing this game because I like the aesthetic and it allows a lot of solo play, but I can't recommend buying it. The quality of the product is much worse than I would expect from a professional game studio.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unless you play with friends/family that makes it worth paying for the private world. This game is not worth it due to glitches and issues alone. \nGlitches such as monsters not doing as intended, why a scorched with a party hat can fly up into the sky and run around at the airport is beyond me. Not to mention players somehow walking through walls! Heres the kicker, they werent hacking when the gouls do it to when giving chase! \nIssues such as players not being appropriate (Harassing of the female player base as well as new players) or causing immense hazing/grief. Sorry but if someone accidentally hits you in a combat event with a ton of monsters coming in waves, dont be that guy who decides to fire back. Especially when that person who accidentally fired the shot is a 100+ lvls below you and happens to be below Lvl 10. Clearly it was an ACCIDENT. Game doesnt allow new players to learn the game by the way so could be that player simply cannot aim yet. \n \nPatches that break the game for months when you have a computer fully capable of running the game. Pc Specs;\nIntel(R) Core(TM) Ultra 9 285K (3.70 GHz)\nRam 64GB\n64-bit operating system\nNvidia GeForce RTX 5080\nEven my prior computer was capable of playing this game without issues. \nPatches are also flawed. My character from launch still has an unmodified machine gun that was nerfed but to this day still hasnt shown the nerfed stats. This is a prime example that the game developers are still keen on not fixing their bugs/glitches. Something notorious in the single player games from this developer. \nExamples being Fallout New Vegas and Skyrim. Problem and difference between the two games is, in New Vegas you wont know the game is broken till end game if you sided with Caesars Legion and in Skyrim the first village/Whiterun quest Npc's.\n\nFor feedback on this game. It was poorly executed from the beginning when attempting to increase fan base. Like FF15 its the guinea pig of the franchise. \nMy main issue is PvP. It was poorly thought out and brought in players that more or less chased off their primary fan base of RPG'ers. From what I know, everyone I have ever talked to about Fallout has always been a RPG'er and dislikes PvP or will PvP with friends only. \n1. PvP is capable via PvP map when choosing a world to enter. There was no need for PvP in the main map. \n2. PvP starts prior to Lv 5. New players who do not know how to play suffered immensely under those who are more experienced with the game/pvp gameplay. \n3. Pacifist mode was a joke. A means to falsely appease their RPG anti PvP fans. Once activated the mode prevented one from fighting back, nothing else. PvP still occurred, there was no way to escape it. \n\nA means to correct such issues are as follows. \n1. Pacifist mode should have rendered full immunity to PvP and must be turned off when capturing resource points since its clearly a PvP intended zone. \n2. Full on PvP should have kept to the PvP map and resource points on the main map. \n3. PvP should have been allowed at lvl 20 to allow ALL players the ability to learn how to play the game. \n\nFor the gameplay and content, it was great. Only thing that should have been done differently in my opinion to help with lore/rpg wise would be adding phasing. Phasing is done in many games, world of warcraft, final fantasy 14, city of heros, guildwars 2, starwars and even in elder scrolls online. \n\nNew players should be able to enjoy the game as intended by needing to complete the overseers questline which all players receive once leaving the vault which takes you all over appalachia. A means to enjoy that raw feeling of being that lone wanderer discovering hidden quests and lore scattered all over. \nOnce the quest with the overseer is over, players can then experience those returning to appalachia and so forth with each patch of content that followed. \n\nAs it stands. This game was worth the try. I say go for it if you are a die hard fan but otherwise, this was not a pleasant experience despite the developers intentions. \n\nAlso I dont know what steams issue is but I bought this game on my playstation initially. For all I know could be a console problem. Otherwise I got this game via gift for christmas for PC.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So Bethsoft spends 12 hours trying to patch the servers for an \"update\" and when it fails spectacularly, all the staff just goes home and gives freaking up for the night?  Subscription canceled.  Thank you for save me $14 a month.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Please create some sort of \"Public Test Server\" or something so that the updates can be prepared and tested before they go live 🤯",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "tried to get myself to like it. i really wanted to like this game but genuinely just could not get into it. think my biggest issue is being forced to play in multiplayer, i shouldnt have to pay in order to play single player. i only own this game because it came in the bundle with all the other fallout games :(",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The majority of the 5K hours I spent on this game were leaving my computer running during events \n\nThere are truly no words strong enough to capture what I see as Bethesda’s abysmal fall from grace—and that hits especially hard because Fallout is my favorite IP of all time. More than Lord of the Rings, Game of Thrones, Harry Potter, Call of Duty, Resident Evil, or Battlefield. Nothing comes close. Fallout shaped my taste, my imagination, and what I expect from an RPG.\n\nWhich makes the studio’s decline feel personal.\n\nBethesda’s golden age was undeniable:\n• Oblivion (2006)\n• Fallout 3 (2008)\n• New Vegas (2010) — more on this later\n• Skyrim (2011)\n\nThat era was legendary. Those games were ambitious, strange, soulful, and they meant something. They were cultural events.\n\nAnd then something happened.\n\nBy “something,” I mean what felt like Bethesda flipping the switch into online-service, monetization-heavy, creatively hollow “slop mode.” The spark vanished. The identity faded. The corporate design philosophy took over.\n\nFallout 4 (2015) was the first major warning sign. Beautiful to look at, fun moment-to-moment, but the role-playing depth had been gutted. Settlements overshadowed story. Choices felt shallow. The soul wasn’t there.\n\nThen came Fallout 76 (2018), which to me was the moment the decline stopped being subtle. Instead of building on what made Fallout great, Bethesda pivoted hard into live-service systems—battle-pass-style progression, cosmetic shops, and engagement-loop design. It felt like a Fortnite-flavored Fallout, without the heart or identity that defined the series.\n\nAnd before anyone says, “But Obsidian had Fallout 3 basically done—Bethesda did all the work!” let’s remember something:\nObsidian had 18 months and reused Bethesda’s assets to make New Vegas—and ended up creating one of the most beloved, richly written Fallout games ever made.\n\nFast-forward to 2015–2018. Bethesda had Fallout 4’s full asset suite, the same head start Obsidian had—plus three years of development. And what we got was, in my view, a sloppily executed, aggressively monetized live-service experiment wearing a Fallout skin.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i'm done with bethesda it's over i will not be buying bethesda crapware anymore good luck burning your foundations for the 30% microsoft lean HA",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Look, if you have friends to play with and generally like the setting and gameplay, you'll have fun! I love playing with my friends on a private server, but I love it in spite of this absolute mess of a game.\n\nI'm sick of tired of giving Bethesda a pass. They are a hugely profitable game studio with the money and resources to do better than this. There are glimmers of a great experience here, completely overshadowed by so many issues that it boggles the mind. \n\nThe controls and interactions are just a mess. Tab to back out of anything except when it isn't tab. Placing pieces of your camp is like playing Lego with oiled up hands. Navigating the Pipboy is, in every regard, something you can get used to but will never enjoy. And so much more. This stuff work just often enough that plenty of folks will convince themselves it isn't a problem, but is that kinda stuff bugs you, trust me, it will drive you up a wall.\n\nWhen this game released, there weren't really any NPCs, and people lost their minds. So they have NPCs now, and these dingdongs won't shut the hell up. Holy crap do they love to talk, and trying to skip dialog in these games will lead you to selection options you don't want, continuing the dialog even more. Oh, and are you in a group all doing the same quest? Well, I hope each and every one of you wants to wait in line to talk to the NPCs one by one, because heaven forbid there be any kind of group-based quest progression. How dare you expect a simple feature like that in a co-op focused games.\n\nHonestly, I could write a book on Bethesda's bad design choices and buggy gameplay. What makes it all the most frustrating is that there really is a really fun game buried under all this garbage. When I'm playing with my friends, I can ignore a lot of it and have some fun, but honestly my friends are so great I would probably enjoy watching paint dry with them. But if you ever asked me to play this game alone, I would assume it was because I wronged you and you wanted to see my punished. \n\nLook, it isn't awful. It isn't unplayable. And with the right friends, it's fun. But dear lord, don't pay full price for this mess. I got this on sale for like $5, and that feels about right. And I'll continue playing with my friends, because they rule and make this game fun. Frankly, only other people can make Bethesda's games fun these days, because Bethesda doesn't seem to know how to do it themselves. \n\nPS. - I forgot to mention that the monetization for this game is so far beyond gross that it makes me want to scream. They should be paying people for putting up with their garbage, not the other way around.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This would be an amazing fallout game if they actually fucking cared to fix the game breaking bugs. \r\n\r\nPA stations are broke and out of the 20 times I've tried to use them it only worked once, the other 19 times it soft locks me, quests break all the time and for the life of me i cannot stand the atom shop.\r\n\r\nNo wonder it went on sale for 7$ because in this state that's all its worth.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "DO NOT BUY THIS GAME. I PREORDERED IT AND STILL 5 YEARS LATER COMPLETE GARBBO. Unless you only play till about lv.15. After that you will spend more time collecting and repairing then playing. Pro Tip: just exit the game if something is to strong. The enemy is most likely gone if you do. Bethesda programmers dont seem to know how to use the greater than < and less than > symbols for programming. The \"Daily Quests CAN NOT BE SHUT OFF\" THERE IS AN OPTION BUT IT DOESNT WORK. (THEY HAFTA KNOW THIS) Final thought your character will get stumped on every single pebble. MY 2 year old can program so that pebbles dont effect the player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a prime example of why people hate you Bethesda. You are lazy. Plain and simple. Lazy and greedy. Not one single bug has been fixed since this game came out and you have the gall to charge people money for it. Every quest breaks and you have to switch servers. You constantly get stuck on two inch high cracks in the ground. Quest doors don't open. The game is unstable all these years later. Essential NPC's for missions just straight up don't spawn. The most needlesly obnoxious and tedious mission \"I Am Become Death\" is STILL broken and is 100% more difficult because while you are trying to go through three thousand unfun and stupid tasks, everything is breaking and then in my case you finally get to the very END of the quest and it disconnects you from the server and you lose 100% of the progress you just sat there for an hour or more trying to make. It's not just this game either. You pigs have re-released Skyrim over and over and over, and just like this game not ONE of the bugs that have been dumping on players for years has been fixed. And that's not even mentioning how terribly you treat the New Vegas IP because Todd Howard is a pathetic child throwing a literal tantrum that he got upstaged on how to make a fallout game, and now he's planning on ransacking the canon in Fallout season 2 as an F you to the fans. Starfield was a lazy boring sack of garbage that nobody likes because it's a glorified scavenger hunt where you just walk back and forth and talk to people through a boring story and OCCASIONALLY see some combat. The space travel was literally just a cutscene. Todd has plugged his ears like an obstinate child and refused to listen to a single fan criticism because he's a ego maniacal loser, and openly disrespected every single solitary person that has invested their money and time into their properties over the years, with that fallout day infomercial. He told the fans \"No we're not listening. No we're not fixing our games. Give me money\", and then acts confused why everyone hates him and the shell of its former self Bethesda. Microsoft. Dissolve Bethesda and let studios that are legit trying to put out a quality product handle these properties. Todd and the lazy hacks at Bethesda will run away all the fans if you don't. Screw you Todd ~ literally everyone",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I cannot believe people are saying THIS is better than release, I bought it on sale and only played an hour only to be greeted with what I can say is a bad Fallout 4 mod. What a terrible release and what a terrible studio to call this a \"new\" game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is alright, but there's a lot of convoluted stuff that doesn't need to be. The BIGGEST issue is needing to have Fallout 1st ($12.99 USD a month) as a quality of life option, which is absolutely terrible. Fallout 1st having the option to have unlimited junk/medical/ammo stash to save weight in your main stash is just terrible. For me it's just greed, they created a problem and the solution was for you to pay money.  BUT I will say they have improved a lot over the years; they just need to readjust Fallout 1st or just get rid of premium stash implementation completely.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Basically a giant torture chamber designed to sell you quality of life items. \n\nLeft the vault and got immediately swarmed and killed by enemies I couldn't outrun. Not fun at all.\n\nNo desire to continue playing - uninstalled - give me my $10 back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Currently unplayable. Crashes the complete computer. Good job.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "to answer the \"would you recommend this game to other players\" well the game has its bugs and with most you stop laugh then continue playing however the recent update the game is unplayable those small bugs are still there but now with the addition of freezing stuttering and crashing with wildly unstable fps rates and a''hole moderators who monitor players booting players out of the game within a minute of logging on for absolutely no reason, I mean I didn't pay £50 just to endure that crap Bethesda seriously needs to sort that crap out and maybe introduce a closed world single player option to the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly the game is so buggy and the servers are constantly under maintenance. The game seems to crash or just plain fail after ever update and hotfix that paying for Fallout 1st is kinda a waste of money, but if you don't pay for the annual sub the game itself punishes you.\r\n\r\nIt is typical of a Bethesda title though, which is unfortunate with the new Burning Springs update just failing on launch. Alongside the game and save ending crashes from Fallout 4's 10 year anniversary update. It should make everyone wary before putting their faith in any upcoming Bethesda games like The Elderscrolls 6.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "2 things\n\nFirst, if you are looking for fallout 4 w/ multiplayer, you are at the wrong place, this game has nothing to be related to a fallout game or Bethesda rpg except it has \"fallout\" in its name. Story? No. NPC companions? No. map is big but empty, and all you do is running from point a to point b.\n\nSecond, \"Its much better than when it first launched\" doesnt mean \"It is good\". The game is still made of bugs, and guess what, you dont have a console to fix these bugs like u do in other fallout games. A membership which cost you $12.99 / month is a must if you want to enjoy this game instead of spending tones of time managing your weight and your stash capacity.\n\nSo Better find someone high level to carry you through the level up or just wait for fallout 5 for.. who knows how long",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bethesda is a disgusting sc*mbag company and I wish them to go bancrupt yesterday. One scam after another, one rotten product after another, its enough. We need market consolidation, get rid of these trash companies that cant produce anything of value and do nothing but leech money out of customers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "absolutely terrible game that just stacks bugs on top of bugs every update to the point its practically starting to become unplayable. don't buy any Bethesda games anymore it's  clear they would rather cash grab then make a functioning game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Literal trash. The people who say this game is fixed are huffing serious copium and are just Bethesda addicts like me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It would be a good game if the servers actually worked, They've been down for a few days at this point and we've heard nothing about getting them fixed. Ill be happy to change my review once they get everything sorted out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bought this on sale, so I decided to post a review to help prevent others from dealing with the disappointment.\r\n\r\nI bought this game for myself and my girlfriend and boy did we get into it. Classic open world questing and combat Fallout style. Feels great to play just like FO4 but also reminiscent of FONV in a lot of ways.\r\n\r\nThe game had been unplayable for 2 days straight as of this moment. All servers have been down and we have not had any indication as to why, nor have we had any updates.\r\n\r\nThis game is ABSOLUTELY NOT WORTH $40. I bought two copies for $10 each. I would be getting a refund if I had paid more.\r\n\r\nA lot of things about this game are decent and I like that you can earn cosmetics through gameplay. Just can't get over the horrible service and support.\r\n\r\nDO NOT PAY $40 FOR THIS GAME.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This update has been a nightmare. I haven't been able to get the game to go beyond the login screen without crashing much less get to the servers that are all offline anyway. And when you do finally get to play the fuck ass new update it's frustrating because everyone on the server has merced whatever head you just paid to spawn long before you could even load in. 370 hours and over half of them being a nightmare. ill fix my review when you fix your game bugthesda",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I could'nt even play this. Its way too overwhelming with the amount of stuff to do, And theirs not to much guidance on how the mechanics work and how to play the actual game. Just my opinion, but not for me unfortunently",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is decently fun, and definitely a step up from FO4 mechanics wise.  The micro-transactions are relatively unobtrusive and are mostly left to cosmetics and workshop stuff.  Unfortunately, I absolutely cannot recommend that anyone play this game because the intro is now totally broken for me.  Whenever I load into a new game now, after the character creator when you are forced to use the photomode the camera gets stuck in a 3rd person perspective looking at my character head on while I fall through the floor infinitely.  I have tried multiple times to create a new character and literally cannot get past the intro for this reason.\n\nIt's super frustrating to be unable to play this game at all because of this bug.  I have no mods of any kind and have previously played with no issue, but I guess I literally can just never play this game again because the intro is bugged.  I have uninstalled and reinstalled and everything and it just won't work.  I've paid money to have 95gb of wasted space on my drive and a shiny icon of a game that I cannot play no matter how hard I try.  Even with Bethesda's reputation for bugs I would hope that an issue this massive would not go overlooked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've got platinum on fallout 4. Don't buy this game, it really shows they didn't put effort on this. Main complains:\n- Bad introduction, I didn't understand who I'm supposed to be, why is nobody in the vault with me?\n- No tutorial to explain basic fallout things, what if I want to play with a friend that didn't play other fallout games?\n- I cannot play alone without paying for it! this wouldn't be a problem, if it wasn't for the fact that most of the time I join a lobby, there is another player's base where mine is supposed to be. Was it really that difficult to automatically make me join a lobby where my base can exist?\n- WHY DO I HAVE TO BUY STRUCTURES FROM THE STORE??? at least don't make EVERYTHING locked behind a paywall...\n\nI remember so much hype when this game was announced, I waited 5 years for the price to drop, I'm still disappointed even if I paid only 10€ for this, I cannot imagine the remorse I would have felt buying this on day one.\n\nIf you're thinking about buying this game, do yourself a favor and buy fallout 4 instead, there must be a mod to add multiplayer to that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They let you buy your own private server so that people that like playing solo can do just that, then they make the only thing that can give you any crumbs of end game gear impossible to solo? Good job, really solved the games biggest and baddest problem there. \nBecause clearly that's the thing you needed to fix, not the countless bugs that breaks the game, not the Horde bosses spawning inside the terrain, making them impossible to complete, not the fact that you can't sometimes even enter your power armor because you're bugged in the animation startup, not the fact that your camp pets can push your power armor while you're working on it and make it disappear until you reload your game. Really glad i renewed my subscription in the nick of time so i could get bent over and recieve endless backshots of disappointment. Much love.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yeah great game cant even fucking play it let alone create an account. Bethesda and their constant bullshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, is difficult to write a positive review for a game I can't even start, since I'm stuck on a 'signing in' screen, and nothing happens.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not vary good pergretion and after getting it for free i lost axsess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the latest update, my mouse curser no longer stays on the game when in any configuration of display settings. This makes the game unplayable when using 2 monitors. Oh well. Bethesda have always been lazy sacks of shit who know best how to break games with updates.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "glitch,bugs,server,pay to win    you wont be able to play some missions as the dialogs are stuck or bugged, so you logout and login again the you do same mission one more time and the dialog still stuck you cant back off from it. not worth wasting my time. and also the game lags too even at medium setting on rtx 4060 why? no optimization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a very buggy game and I've stopped playing because they destroyed my camp (not the only reason but this made me quit). Please, don't waste your money buying this. The story's good but it's literally unplayable. If u want the experience of a good story and not so buggy gameplay, try fallout new vegas.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played for about 35 hours and had to uninstall some programs to free up hard drive. Reinstalled the game and all it does is go to a black screen and within 3 seconds returns to start menu. Tried the verify file as suggested by steam support with no luck. The verify process states the files are OK, Just dead space now as it still will not run and the refund TIME has passed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game sucked, then it got better! And now trying it again in 2025 shows that it's back to being unplayable again?? Why is a game I've played 500+ hours in just fine on the same machine now barely able to launch correctly let alone play at anything higher than 10 FPS.... I actually told my friend to get this since there is a sale right now and boy do Iook stupid. Neither of us can get this game to even run on our PCs right now. what the actual eff.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shid game, server are laggy af when there is a popular public event, tons of bugs, and alot of weapon so ridiculous it flashbang you every 2 second if other player used them. but i got a lot of friend from playing it, and hanging out with them while doing the most mundane things is one of the joys of playing this. but seriously don't buy this game stockholm syndrome is a fukery that i can't deal with",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played the game for 30 minutes and ive already ran in some game breaking bugs. The game shoves microtransactions down your throat the second you open up the game and there even is a subscription for 130 dollars a year without even counting the dlc's and microtransactions. I would've said go play fallout 4 instead but even the new \"update\" broke a ton of mods and made the game even buggier.\n\nWill update my review if I find anything positive about it ( don't worry I will make sure I don't go above 2 hours )",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your money on this piece of crap. \r\nIt's poorly optimized, full of bugs, crashed at random intervals and, in my case, doesn't even launch. It says it is, but it isn't, then it just shuts down by itself while never even attempting to load a game window.\r\n\r\nDon't recommend, if u want a looter-shooter with rpg elements this aint it chief.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Join game.\nIt auto-launches in borderless windowed mode.\n40 FPS lock.\nSet to fullscreen.\nRestart.\n70 FPS.\nSpend 2 hours making your character.\nLeave vault.\n'You have been disconnected from the server.'\nRejoin.\nGo to the nearest location to the vault, a lumber mill.\n'You have been disconnected from the server.'\n\nI suggest not paying for a 'game' that you can't even play. How is this game 5 years old and I still can’t even start it?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd make a really long winded review about why I don't recommend this, but I would hit the word limit pretty fast\n\nI've never seen a single game shit all over a franchise's themes and identity than Fallout 76.\nIt's also just, unbelievably boring, unfulfilling, lackluster, unresponsive and has more microtransactions and premium currency than an EA game. \n\nIt's just not good man, I can't be more dejected about it. It feels like I've played several hundred hours from how drab it is, despite only playing maybe 20 or so (I played it through Bethesda's launcher before it came to Steam)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredibly terrible optimization. refunded after playing and trying to make it run better(it didnt)\nsucks cuz this game is actually very fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Alright, look here. Look, listen. This game is both good and bad. You can't expect a masterpiece or even a very memorable experience, but it is a fun experience. If that's enough for you, then get this game. I played this game almost every day with my brother back in 2020-2023 on the PS5. I have over 600 hours on this game over there. I bought Fallout First all those years, though one of those was because I forgot to cancel the auto-renewal. Still, I enjoyed playing this game and completing the battle pass every season. There's plenty of content in this game now after all the updates to keep you engaged for as long as I was.\n\nHere's probably something more important for most people: why I stopped playing Fallout 76 for a while. I believe the only reason I was able to play this game every day without getting tired was because of Fallout First. Like Elder Scrolls Online, the subscription gives you an unlimited stash amount that is required for long term enjoyment. Even though I didn't craft so many things to the point I needed all that space, it just cuts out a significant amount of frustration. There's already too much micromanagement and menuing in this game that I hate. Adding more by requiring me to stop playing and drop all my junk items and ammo so I can sprint again is astronomically stupid. I already spent more on this game than any other game I've ever played by paying for Fallout First for 3 years. That's $300 + $40 (PC version a few weeks after launch) + $10 (Xbox version a year after launch) = $350. I never buy microtransactions or subscriptions for any games. I play 100s of hours of Call of Duty and progress the battle pass, all without paying a dime. I can ignore $50 skins and $20 battle passes that only give emblems and calling cards with a couple double XP tokens mixed in. I don't excuse any of that nonsense, but I can enjoy the game with it. This game is an exception for me, and all the money I've paid isn't enough for them (the developers / publishers). I truly can't enjoy this game without Fallout First. I love scavenging and collecting things in the open world. Dropping them all the time makes it feel like a waste, and there's not enough storage space for non payers. The more I talk about the game's bad business practices, the less I want to recommend it, so I'll stop here. Just know that I could go on. I could go on and on and on...\n\nThis game is pretty great and should be an easy recommendation to anyone who just wants to play something with their brain off while they watch a video or chat with their friends. It provides a casual experience where there's always something to do, but you can stop whenever you want. The biggest flaw that completely drives me away is that the game doesn't want me to play unless I'm always paying. Other games provide a playable experience for the base price of purchasing the game, but not this one. If you're anything like me, you'll have a hard time recommending this game without a massive caveat. Honestly, the only thing that got me into this game as much as I was was playing with my brother. I enjoyed so many experiences I had with this game in all the years it's been out, but I can't get that anymore without continuously paying. I'll pop back into this game occasionally to try new content, but it never holds me for long. It's just sad that it has to be this way. This game is capable of standing alongside the other live service juggernauts but holds itself back needlessly. \n\nI'm only writing this review because of the Steam Awards, but it really let me reflect on the kind of game this is. I have so much more I could say, I mean I probably have close to 1000 hours of playtime across Steam, PS5, and Xbox. I just don't think anyone will read this on a 7 year old game with over 40,000 reviews. I guess if what I said is interesting enough to others, I'll come back and write more, but I've already spent enough time writing what I have. I hope anyone reading this understands where I'm coming from with this review. I doubt I'll be changing anything in the games industry with this, but I just wanted to say what's on my mind. Games can be better. So much love, care, and passion is poured into these 100 million dollar projects that it's such a shame to take all that away for a quick extra buck. But I know nobody does anything for free, and money has to be made at some point. The truly talented people are able to place that barrier in appropriate spots. If I could take this game offline and play with mods, I would easily add 100s of more hours. As it is now, though, as it was designed... I'm just sad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is always stuck at the main screen and no one has this problem so can't troubleshoot it. Can never play it. Thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is basically fallout 4 but choppier, the basebuilding is based on a single location but so much of the base stuff is locked and you have to either find all the plans or pay real money for them. BUT my biggest issue is the quests are incredibly lazy in paticular a set of quest lines with Rose in which they re used an entire map from an earilier quest line, which left a bad taste in my mouth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do I think Fallout 76 is a good game? It's complicated, I like it on its own merit, as a psuedo-mmo with decent looter-shooter mechanics and base building; I do not like it as a Fallout game or as an RPG.\n\nNow based on that you would expect me to recommend the game but I cannot; the reason I don't recommend the game is because of a few reasons:\n\n1: This game is optimised like absolute ass, it is one of the worst performing games I've played in years, which now seems to be a trend with modern Bethesda titles. You can optimise your settings to get maximal performance but you only get to see said performance in instanced areas, the engine just cannot handle an open world with multiple players in the slightest and if you look in the wrong direction even with all your distance sliders set to the minimum you'll lose like 70fps. Though when you're in those instances you do get like 130+ fps I just want that to be the rule not the exception.\n\n2: Constant crashing and general instability, this goes without explanation I hope.\n\n3: Terrible Servers: Do you like doing a stupid fetch-quest where you go from point to point across 25% of the map clicking on plot devices just for the server to boot you at the very end and reset the entire quest? no? really, why not? It seems like Bethesda likes doing that.\n\nI bought this game on Xbox when it first came out and *hated* it, I wasted over a hundred CAD$ on this thing and I've finally come around to it years later, I can now actually enjoy it and am glad it exists to an extent, but I cannot it good faith recommend this product to other people when it is barely functioning even today after all the patches and fixing they've done. Get it heavily discounted or not at all, not unless something changes.\n\nEdit: add buggy mess to the list of problems, I am now permenantly stuck listening to the \"scoreboard\" constantly make noise endlessly because of a years old bug that Bethesda has not fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Note: This game was received as a gift from a friend.\n\nLook, it's Fallout 76, you know what you're looking at. It was and still is a low effort title motivated purely by Bethesda's desire for a live service cash cow, and includes all the scummy behaviour associated with both those things. No, it's not as bad as it was at release, but it's still a far cry from even \"decent\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rough start but it’s come a long way. Appalachia’s pretty, the updates helped, and it’s decent fun with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, I would've given it a review if it was fucking playable. It isn't. At all. What do I even expect from Bethesda lol. Doesn't even support me fixing the fucking game for ultrawide and keeps resetting my settings that I should be able to make in-game and not through a fucking ini-file! When I do load in though, its just a rubber banding stutterfest,\n\nThank god the fucking store works.\n\nHey, at least I got Fo1 and 2 with it, so might as well play actual games instead of this heap of shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Freezes after 5-15 minutes of play all of the sudden now no matter what I do. Highly upset because it was my current favorite.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played this game on launch the glitches were horrible so was the lags, the story was soo flat back then and very little actual humans to talk too complete waste of my time try it now the story still sucks feels very flat only liked the enclave parts but hated that there is no other members and again very flat story with them only liked the encalve parts cause it didnt make sense why u could not just join Autum instead of putting the FEV in for the ZAX computer, the story seems very hopeful and not gritty like other fallouts the combat is very repetitive overall just a bad cash grab and the weight in this game plus the card system is horrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no, if you dont have a group, of friends its a boring lonely game pretending to be an RPG and the only thing that works is the shop. they say bug are fixed but is a lie, disconection loading issues, hackers and ppl so over geared that is not fun anymore, i hadover 500h that how much time you will need to get to end game , after that its jsut and endlessgrind of endless stuff, eventually you will ahve all cards and some ridiclous build that oneshots mobs and kills the fun. go get NVew vegas if you want a true arpg add the verylastkiss collection on nexus or wildcard with wabajack, this shop with some game doesnt worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Upon starting up the game after a while away, I found that I needed to \"transfer my bethesda account to my steam account\" when I tried to do this, it failed to transfer every time. I am locked out of the game because this is required with the bethesda launcher having gone away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do date 11/11/25 I heard this game was good now. I Only played a few hours during launch so i saw the disaster. This cash grab \"Update\" was trypical \"Bethesda, \"Dethesda never changes...\"\nWhat another dumbster cash grab fire... 10 mins in game, the game is still broken. They keep saying \"it's better now!\"\nNo it's not.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}