{
  "positive": [
    {
      "review": "My Review:\n\nI like it. \n\nThe pacing is faster than OG Titanquest but slower than Path Of Exile/D2 etc (I like this). \n\nI think there's a surprising depth of build customization from this system, which seems frontally similar to how Pillars of Eternity handled abilities.  \n\nThey do ACTUALLY mean Early Access, as the current available content (11/09/2025) extends to what I think is the end of \"Act 2\" and there are a decent number of graphical bugs and things like equipment sometimes failing to pull text from the string ID it's trying to draw from. \n\nRespeccing is available and feels fairly priced, albeit seeming more expensive on the \"stats\" side of it. Skill respecs are low-cost for the most part. \n\nReview Score: 8/10. \n\nI think when refined and expanded this score will elevate to an 8.5 or a 9. Incorporated in this score is SOME implicit expectation of improvement (with bug resolution and expansion of storyline content expanding playtime being where most of the implicit expectation is), but there's a lot of room for additional elevation aside from that and I do think that the devs actually... enjoy gaming and understand player-focused design pretty well.  \n\n------------------------------------------------------------------------------------------------\nAdditional notes on my experience:\n\nI feel that abilities are decently customizable and that what they've done is pretty clever in terms of meaningful build diversity. I utilized Elementalist (EarthFire + ColdLightning masteries) and I felt that there were a lot of directions to take with that build. I feel like barrier, meaty-tanking, and skilldodge were all reasonable defensive avenues. I feel like there are good mono-element builds much more focused on individual casts and that I can find favorable synergy between a lot of stuff. \n\nIn my case used central themes of (Spells), (Mana Reservation), and (Many Skill Hits) to have good general killing power while also being able to activate 150 Amplify Tempest nukes that deal a LOT of damage. The (Many Skill Hits) are mostly relevant to Tempest alone, and I do consider it the \"Ult\" of this build that can fire once every 10ish seconds. I do utilize the \"discharge\" ability as another good sustained single-target DPS ability.\n\nI did get smoked from time to time. Most deaths felt fair to the point where I was like \"yep my poison resist sucks\" or \"yup I failed to see/avoid the obvious telegraphed thing\". Game is an interesting mix of \"not THAT hard\" with \"consistently threatening\".\n\nI just picked what I wanted and ran with it and the build felt pretty strong. It was nice that it went this way, and I did think about macro themes and synergy a lot while playing.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Pros.\r\n-Great scenery\r\n-side quests adds to the story\r\n-there is a story\r\n\r\nEnjoable game overall. Not overcomplicated.\r\n\r\nWould like to see more side quests and or secret areas. possibly more puzzle like secret doors. Would also like to see more character classes or more options for better skills. Though there are already a decent amount of skills.  Nature druid plants/animals,  Holy/Unholy type death/life. maybe even a steampunk/tinker class?",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "I like it! A little buggy here and there, and it's not finished yet, and sometimes depending on your build and gear, certain fights can feel completely impossible with a lot of potential for one-hit-kills, and if you're playing as a ranged character you're gonna have a bad time of it, using left click to move, only to for your character to stop dead to shoot some pots, but it never scared me off. \r\n\r\nI like the story, the acting, the music, the gameplay... It definitely focuses on telling a story compared to TQ1, but you do miss out on the long cross-country journey that you got from TQ1, the game instead opting for open-ended areas of impressive size.\r\n\r\nI do have criticisms, for instance, Areion needs to be a little less tutorialising, and it can be buggy with each patch introducing new ones, but idk. It's hopefully gonna turn out a good game. I'm tired. Recommended.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A new and very interesting storyline. If you liked the original you will enjoy this as well.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Titan Quest II is a game I personally enjoy♥, but I would still suggest most players wait and see👀 before buying💴. \n\n🟢The visuals🖼️ are impressive, with great lighting, detailed environments and a strong mythological atmosphere. The mastery system is fun to play with, offering plenty of build combinations, and enemy👾 animations and boss👑 designs are a clear step up from Titan Quest.  \n\n🟡Performance📊 is generally okay, but there are occasional micro-stutters and the GPU tends to run quite hot.\n\nIt is a promising ARPG with satisfying combat🗡🛡️⚔️🪓🏹🪄⚡❄️🔥🧪☣️, but for now it is better to put it on the wishlist🛒 and wait for more updates.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good start. It doesn't really \"feel\" like Titan Quest just yet, mostly because of the (very generic so far) bestiary, but the gameplay is solid is the game looks great. I just miss my Conqueror...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Titan Quest 2 is a Classic-style ARPG game with the ability to design your own character class through the diverse mastery system as you face off against beasts and gods straight out of Greek Mythology.. The story is surprisingly really good and I found myself drawn in and not only wanting to know what happens next but speculating about what's going on behind the scenes and looking for any hints inside the game itself, and the gameplay feels absolutely phenomenal. I am a huge ARPG fan, and while I got into TQ1 late (after Grim Dawn and the Diablo franchise) and I've put in ~500 hours into Last Epoch, my 116 hours spent in this Early Access has been the most enjoyable ARPG experience overall.\n\nPros:\n[list]\n[*]The Mastery system gives you far more customization than a standard class system from other ARPG games like Torchlight 2 or Diablo 2. The game currently has 4 masteries, with a 5th coming soon, and that alone gives us 6 unique combinations, 4 \"pure\" classes, and the \"Unblessed\" where you don't pick a mastery at all for a challenge run. The 5th mastery will bring that to 10 unique combinations and 5 \"pure\" classes.\n[*]The story is quite engaging and, while a bit cliche at times, has a lot of potential hidden in the background lore if you know where to look. On top of that, the writing for the side quests and characters is quite impressive and makes them quite enjoyable. One lore note actually brought me to tears, which I wasn't expecting at all.\n[*]The game is designed in such a way that any class combination can be played in any playstyle. Want to play Elementalist (Storm/Earth) as a melee frontliner and heavy armor instead of a caster? Go for it. Want to play Battlemage (Warfare/Earth) as an archer, picking off his targets with arrows and fire? Go for it. Want to play Stormblade (Rogue/Storm) as a pure caster, shocking your enemies with lightning and freezing them with ice? You can do it! There's really no limitation other than what damage types your specific mastery combination provides.\n[*]The soundtrack and visuals are both fantastic, even with the visuals on low for the Steam Deck it still looks great. But seriously, the soundtrack is amazing.\n[/list]\nCons:\n[list]\n[*]To get this out of the way first.... Yes, performance is not great right now. The developers are aware and have mentioned that they have some candidates in mind that could improve performance but their focus is on adding more content for now and optimizations are mid to long term goal. That being said, 110 of my 116 hours have been played entirely on the Steam Deck getting 25-30 FPS on average with rare dips to the 18-20 FPS range, so as long as your PC isn't on par with a Steam Deck, you should be perfectly fine to get 30 FPS at the very least, just don't expect an older system to get 90+ FPS on Ultra Settings.\n[*]With that caveat out of the way, again this is early access so the content [b][b]is[/b][/b] limited. At the time of writing, we have two chapters that cover what other ARPGs consider an \"Act\" (same location and enemy types with a final major boss at the end before transitioning to a new area). The Prologue + Chapter 1 took me ~10 hours on this recent playthrough with maybe an hour spent AFK, and now I'm approaching 18-19 hours nearing the end of Chapter 2 with another hour or so spent AFK, note that I clear the whole map on every playthrough. That means that for one character you can expect ~22-23 hours of gameplay, I clearly have around 5x that because I play more than one character.\n[/list]\n\nNeutral:\n[list]\n[*]This game is not a seasonal ARPG. I would personally consider this a pro, but I know people love their seasons. The devs have confirmed that this game will never be a seasonal ARPG as they wanted to capture the enjoyment and replayability of classic ARPGs like Diablo 2, Titan Quest, and Grim Dawn. Yes, I know Diablo 2 has a seasonal ladder, but it's not \"seasonal\" like PoE or Last Epoch are with seasonal gimmicks/themes, or at least it wasn't.\n[*]No Mounts: Again, I consider this a pro, but some people love their mounts. The devs confirmed again that this game will never have mounts. Do with that knowledge what you will.\n[*]No Mastery Respecs: I consider this a pro, I like my games to have some permanency of choice. Some people are really upset about this, I get it. So if this is important to you, understand that your mastery choices [b][b]are your class!!![/b][/b] Not a single ARPG on the market lets you change classes mid playthrough, Titan Quest 2 works the same way. If you really care, you can edit your character save files with a tool to change the masteries.\n[*]Lastly, the multiplayer is not ready yet. I'm listing this as a neutral because many people are really wanting to play with their friends, and I get it, but you will be able to on release and the devs didn't even want to have the multiplayer available when Early Access launched, but they did because they knew people wanted to try it. It's in a heavily \"work-in-progress\" state, so it's got major bugs and issues.\n[/list]\n\nOverall: The game is fantastic, even in this early state, and I can see myself playing for years to come. That being said, I would only recommend it to people who understand what \"Early Access\" means and want to help the game improve through surveys, feedback, bug reports, and suggestions.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really enjoying this game, it is very involved, story is great, and combat is good as well, nice range of skills available. Graphics looks great and runs flawlessly on Linux which is a plus",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the Titan Quest II that we were waiting for a lot of years. At first I was worried about Crate Entertainment was not making the game but Grimlore Games did an amazing job. Gameplay, quests and polish are great even at early access state. If you like action RPG games, you should buy this game and support it. \r\n\r\nI think it will be classic when it releases in future. Can't wait for it, keep up the good work Grimlore Games! Also purchase the soundtrack too, it is great for your ears.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "kept the feel and thats all i couldve asked for, its prettier feels responsive and has some quality of life, i just need a button that sells the whole inventory and filters for loot in the world and filters for the inventory as well",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even in early access, this game is a great investment. It is polished and the developers are doing a great job of meeting consumer standards. In every area this game is a better game than Diablo IV. And in many areas it rivals Path of Exile 2. I give this 10 out of 10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is great, history is great, it reminds me of the OLD Diablo where you could LVL up as much as you want, adjust individual stats by points. EXCELLENT game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really beautiful, nice ambience and music, love the quests framework and character skills customization.\n\nCombat and gameplay wise, it's also all good and totally in line with TQ1 style.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is AMAZING. I loved the first game and I love this game so far. I am so excited to see where the game goes from here. The possibilities are endless. Get in on it now while it is still this cheap. \r\n\r\nThe detailed art is so perfect, my eyes can't even take it all in",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good mastery system, however would be nice to change mastery at least one or reset for a cost or something.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game as the slower, more traditional RPG combat ttracted me to it (along with the fact that it's Greek mythology and a sequel to a great ARPG)\n\nThe gameplay is top tier. No zoom zoom, skills/attacks feel impactful. The spec system is interesting, similar to Grim Dawn's where you can combine controller support.\n\nThe OST is phenomenal, with great voice acting and a decent enough story so far. I love the pacing, loot and just overall gameplay. It has controller support and accessibility settings.\n\nAs for the negatives - the maps are linear and you get a lot of useless loot. The game feels better optimised compared to when i first played, but could be better.\n\nAs it stands, this is the early access game I am most looking forward to watching progress. Will it appeal to everybody? Probably more so to the older generation of gamer and not so much to the 'teleport zoom zoom brrrrr big numbers' PoE/D3 player.\n\nThumbs up, keep up ze good work",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The story telling and quests are well thought out, engaging and exciting. The game itself is different enough to feel like a whole new game yet familiar enough to have the nostalgic Titan Quest I feel. Can't wait for more chapters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For an early access game it is very good, There has been very little glitches and I am looking forward to all functions of the game to be unlocked.\r\nI would like to see an option to map controler functions. And maybe a way to rotate the map .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After several hours with Titan Quest II, I can say the immersion is excellent. The environments, the Mediterranean coastlines and villages are gorgeous.  The quality of the scenery is so high that it genuinely made me want to go to Greece and swim in the Aegean Sea. \nThe level design is very well done: there is almost no pointless backtracking, quests flow naturally, and the difficulty and enemy distribution feel very well tuned. The narrative is always present without feeling heavy, and the light altar puzzles add an extra layer of gameplay without breaking the pace of combat. The soundtrack is also sublime and really supports the atmosphere.\n\nOn the downside, the build depth feels almost nonexistent. I played using basically one skill up to level 20 and never really felt pushed to experiment or rely on synergies. If synergies exist, they are not clearly communicated. The game is not very clear about what each mastery (skill tree) really offers. Skill descriptions are too vague, and the naming of masteries and stats is not intuitive. \nFrom a UI perspective, it is also strange not to have a permanent stats panel when you open the inventory. You have to click on \"Details\", and even then you do not get a satisfying overall view of your character’s stats.\n\nDespite these issues with build clarity and depth, Titan Quest II is still an excellent game in my eyes: beautiful, immersive, enjoyable to play, with a fantastic atmosphere and an outstanding soundtrack.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the Titan Quest Anniversary Edition a lot and really liked it.  Titan Quest II is very similar and I am enjoying it so far as it is developed in Early Access.  The game does crash on occasion (usually during startup).  I also experience a lag after taking a portal back to town that continues to get worse as you proceed from there.  Going back to the Main Menu usually resolves the lag.  Performance and optimization problems tend to be a lower priority during development.  I am sure these issues will be addressed in the future during Early Access.  Overall I am enjoying the game and I will continue to play during Early Access and await the full release.  Recommended !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good so far. Bit of the first's flavor with updated graphics and systems. Looking forward to more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game looks very promising, So far it manages to combine the strength of the original with modern mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The peak old classic gamplay from the best gaming times in early 2000s!\n\nMusic, characters, quest design, skill tree, mystical monsters, etc. the old perfect mix from the first Titan Quest + fresh innovative playstyle is back. Environment is setted in ancient Greece within conflicts between gods and humans. Accordingly your journey will starts again.\nThe world is the most stunning point for me. Absolutely lovely map desgin.\n\nAppreciated Grimlore Games, staying loyal the old scenario! Thank you!\nYours thurly from fan, from the old times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very stunning graphics and gameplay.\r\nIt comes with  an beautifull story aside.\r\nI recommend this to all my friends!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! I am enjoying it so much! I love the period that we are in, the story and the characters! Very happy with the progress in it so far! Now working on getting a better build going.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid undertaking. Enough like TQAE to feel familiar, different enough to not feel like you overpaid for just another chapter. And it's still EA, so I expect it to get much better.\n\nNot quite a must buy yet. There's a lot they still need to tweak and add. So if you want a polished, complete product with all systems set then maybe hold off a little.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Enjoable game, love the new character customization that was added, love the pace of the game and good story also side quests add to the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have made 3 different characters on this game so far and it's been really good watching my builds come online. I love that every character actually talks so I can listen and not read. The story is good, the gearing is fun. It's getting better and better with each update. Worth every penny. I love that I can just pay gold to level up the previous areas, and respawn bosses.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of hours playing TQ on Steam and any where I could find it. It's one of my all time favorites. I expect TQII will be the same. So far it has been a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a big fan of the original Titan Quest.  This one is similar, but a little different.  Excellent visual elements, challenging enemies, character flexibility/creativity.  I'm not a fan of the healing potion strategy though.  No more running around in circles healing yourself with your several stacks of 99 potions in your inventory.  Healing potion recovery is done by doing damage to enemies.  Overall a great game at this point, but they continue to improve/add to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For an Early Access with limited content (only the first chapter), it is a very promising game.  It does have the feel of TQ with upgraded graphics and UI.\n\nI do recommend it based on what's readily available, can't say how it will change or how long it will take them to release the rest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fantastic game with beautiful graphics and a great skill tree. You can do all the nice things you want to do as an RPG character in ancient Greece: Beat your enemies, steal their gold, loot them, explore the map, and buy special items. So I think if you love RPG hack-and-slash games, you should definitely give it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, very smooth for an EA build!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Promising Start to the Game - looking forward to seeing how they update it over the lifetime of development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game should get it now while it in early release and the content is still releasing and it cheap.\r\n\r\nprice has already gone up once and if oyu a titan quest fan this is worth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve only put about 3hours into Titan Quest 2, but the beginning already feels really solid. The world, the atmosphere, and the early gameplay hooked me right away. Combat feels smooth, the setting is beautiful, and it definitely captures that classic Titan Quest vibe with a modern touch.\r\n\r\nCo-op isn’t in yet, and that’s the feature I’m most looking forward to. I’m also hoping they add more classes down the line. But based on what I’ve seen so far, the foundation is really good.\r\n\r\nI’m giving it time to grow, because if the start is this good, it could become something amazing once co-op and more content roll in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR - Worth every penny\n\nGreat game with a limited experience for obvious reasons. You'll have future expansions to look forward to while playing, giving you a reason to come back. Love the Art and the sound is great. After finishing the first chapter, I took and break and have come back to continue the story (after more content was added in October).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, fun mechanics, altho still limited content in this phase of development",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a fan of the first version and I like the ability to build the characters and enhance their abilities with the charms and relics.  I also liked that the different levels enable you to go back and replay with more difficulty.   I really liked the secret section in the first version where you got the santa suit etc & that you could share artifacts with other players.\r\n\r\nIn this version I like that you don't have to keep buying health & power, also that it is easier to store things  to share between your characters.  I like that there are more hidden sections that you need to watch out for  and that it is more map like, so there is more exploring of the world not just following a basic path. The graphics are better in this version as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was skeptical at first as I love TQ but most game succesors are cash grab trash. And while it's still in it's infancy, it's already a lot of fun! Can't wait for more content. Great successor to Titan Quest and Grim Dawn. It pulls the best elements from both (in reality it feels like an up spec'd Grim Dawn in a darker Titan Quest theme'd world). And it skips some horrible mechanics that Titan Quest and Grim Dawn both have that you don't realise are so terrible until you play this. Worth a shot at least!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great start to the adventure! loved the first and this so far is lining up to be a great\r\n predecessor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Short Review\n\nIs it fun? - Yes, if you liked TQ1\nIs it too early for full review?- Yes, EA and can still be abandoned\nShould you get it? - See answer 1 and if you want to support developer to keep it going",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "reminds me of grim dawn which is a plus. plus its a good game and i cant wait for multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At EA stage, it's a very good foundation to build upon. As a sequel, it misses a lot of elements from the first game. Relics, charms, artifacts, equipment sets etc. Fans are expecting certain aspects of the game would exceed the original. Let's see how the game is doing in a few years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The visuals in this game are stunning.  I've thoroughly enjoyed this ARPG as well, even with the big pool of games in this genre.  The 2 Acts that you get to play was a very smooth experience.  Recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid gameplay, some bugs and weird difficulty spikes that are to be expected from early access, but it's shaping up to be a pretty decent scratcher for that arpg itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for early access I am more waiting for it to release retail before really playing but so far so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best looking arpg rn. UE5 is fantastic if you have the power to run at epic settings and unlimited fps. If you like mythology and arpgs, this is a MUST.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great first steps, looking forward to the rest of the game. First two acts are fun and the new masteries and talent system are interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stunning graphics, expecially seasides. There is still a lot to do on mechanics and gameplay.\r\nDifferent approach from PoE; less skill but more understanding of what you choose and how it impact on your char. Also slower and more \"don't kill everything\" gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Titan Quest is a game that you can easily come back to once a year. I'd recommend it for that reason. It still feels like it is in the earlier stages. A great game is there right now, it just needs more. The game originally only had 1 act up when it first hit early access. This game needs another year or two of progress before I feel like it can be considered a \"full\" game. What's there right now is great for what it is. There is easily enough game here to charge around 30 bucks for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying this game, story is great, and combat is good as well. Graphics looks great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is still in EA, so it has much missing content, but the currently implemented 2 Acts are fun.\r\nThe classes are okay, though not as many as in the original TQ, but hopefully there will be more.\r\nThe character builds are a bit few but you can already build classes that are synergising good together.\r\n\r\nI really like the on what path it is going now, and I will probably also recommend it on release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked TQ1 you will like this game. It still needs lots of work and balancing of skills.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it would be nice if they can optimize the coop gameplay during EA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. It's like a slightly more difficult diablo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Waiting for the new chapter and full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think Titan Quest will be a great game when it is done if they listen to us. The way it is right now I am not feeling the Titan Quest vibe as much as I would like. The game play is good but I don't like having to pay to do bosses again. Overall I think it is good but not great so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been waiting for this game for a decade and the waiting is almost over. The graphics and the soundtrack are simply beautiful. The gameplay brings just enough innovation without straying too far from the original recipe, which I appreciate. Looking forward to the complete game and to the next decade of add-ons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From what i have seen so far, it catches the atmosphere of the old Game very well. It is still early release, so i wont comment on the other elements of the game, as they will propably change a lot in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though I played the whole thing in Early Access, I can still recommend the game. I hope it will soon shine as a full-fledged game like its predecessors. I would be very happy if, like Titan Quest, it could be expanded in the future with many DLCs containing numerous sections and characters. For now, though, it definitely gets the green light.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice gameplay, good graphics and awsome story gives me something I played whole on one sitting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It brought back all the nostalgia and joy from the first installment. I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not finished, but very promising at its current stage (Chapter 2 playable at the time)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly strong start. The game keeps the classic Titan Quest feel but modernises everything, graphics are great, combat is smooth, and the world looks incredible. The story and atmosphere already feel more polished than the original. Still Early Access, but stable and fun with tons of potential. If you like mythological ARPGs, this is absolutely worth jumping into.\n\nExcited for the next Chapter release!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best ARPG I've played. It still has some rough spot as its still an early access game but it still has potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ładny świat, jest jakaś fabuła, duży potencjał buildów",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Titan Quest 2 ocuses on fun combat, mythological storytelling, and a sense of adventure. Whether you’re a longtime fan of the original or new to the genre, Titan Quest 2 offers a rewarding journey through ancient Greece that’s both relaxing and exciting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has its flaws but its in early access, with that being said titan quest 2 is just as epic as the original and i love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far, so good. I feel like the game preserved its vibe perfectly, but needs more diversity and it will obviously get it in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far, a worthy sequel to Titan Quest. Very true to form, excellent controller implementation both in gameplay and UI. Mechanics are updated without reinventing the wheel. Performance could be improved, just borderline playable on Steam Deck. Early access review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can see how this is developing nicely, with deep, rich story lines similar to the original. Skills were a bit cumbersome to understand at first (I ended up having 26+ passive skill points unused because the passive skills are on the right side of the skill tree, not a separate page/tree), but once you get settled in it's enjoyable and still challenging. Can't wait for the full retail to be ready to go!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Superbly done early access game that has potential to make real waves if they keep up the steps that they are doing. Loving the Story progression and graphics, smooth play and connections of skills, cant wait for more to be released to see how its synergys work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gameplay and story seem pretty cool, still some bugs to work out, but lot of potential",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This. Is. Awesome. Waited this geme 5 years. THQ delighted me with long-awaited sequel to mychildhood game. The visual stule is excellent, gameplay is pleasingly improved. I'm really looking forward to the new classes and the continuation of the story.\nThank you, THQ!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THQ Nordic, I never thought I'd see this game again, and I am beyond hyped to enjoy the game that Diablo wishes it could be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been waiting for the game for how many years? TBH I lost count. Is Titan Quest II worth it? Absolutely! is the game more of less the same as the old one? Yes! It is everything you will expect from seeing this old classic game, Yes! It is the same as the old one just with 10x better storyline and huge visual update. The mechanics is more or less the same, and no it is not a copy and paste from the previous one.\r\n\r\nAnyone who remembers this classic game would know it is a must have. The devs are really trying their best to make it as good as they can, but it is honestly sooo much better in my opinion.\r\n\r\nWould I recommend this to any Titan Quest fan? YES!!! x1000 \r\n100/10 would buy it again if I could",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoyed the visual and gameplay, there's a long way yet,  but its promissing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a great time playing this game. The story kept me interested and the overall experience was fun especially when playing with friends. Definitely recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played act 1 and it is better than expected for now. waiting for game to release to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good. I like Titan Quest 1 far more but that's just me. I see that it copied a lot of elements from other popular games in this category but that sometimes takes away from what the original game was and it feels more like a copy of another popular game in this genre compared to Titan Quest 1. You would assume the game is more complicated now (keep in mind it's still early acess) but that's what I saw so far. It feels a bit bland and generic but I am just happy they made a second game of one of my all time favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, an outstanding experience! \n\n*Bought it at the first stage of Early Access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game with good gameplay, nice graphics, and music that will get stuck in your head.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had to stop playing due to moving house but I cant wait to pick it up again. Great game, easy recommendation!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good ARPG that, at least in this state, feels very faithful to the original game. Highly recommend and cannot wait for more features to be added.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great successor to the original, 10 years single TQ1 and baby did they deliver. \r\nPROS: plenty of class/ ability combinations, items are diverse, no more worry about teleport scrolls\r\nCONS: graphical settings seem a little too much for an older style game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game but wait for the full release. High expactaction with their choice of new and retro mechanics for this genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Personally I loved playing Titan Quest 1 and when the 2 was announced I was over the moon. When it released into Early Access I was there like many others waiting for the buy button to appear. It is in Early Access so not all Chapters and Masteries are available. Chapter 2 came out a few months ago and I am currently paying it now. I definitely think its an improvement on the first one. I have only encounter 2 bugs, non of which were game breaking, when I reported them they were fixed in the next update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far this game is great. great story, great sound track, great graphic and very great play time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "seriously happy they have brought the game back with a sequel and its a smooth play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Titan Quest 2 is an outstanding successor that delivers everything a fan of action-RPGs could hope for so far. The story is rich, engaging, and masterfully woven, pulling you into a mythological world that feels both epic and personal. Every narrative moment in the available acts feels meaningful, and the worldbuilding is beautifully crafted.\r\n\r\nThe progression system is equally impressive—smooth, rewarding, and perfectly paced. Every upgrade, new ability, and piece of gear feels impactful, giving a constant sense of growth without ever feeling grindy. The game respects your time while still offering depth and customization for a wide range of playstyles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got it in early access and enjoying it hugely. Longtime Diablo II and Grim Dawn fan. I've had no problems at all in single player, it's pretty as heck and has some really fun ideas. Absolutely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really liked it, the storyline keeps you intrested, very similar to diablo, but not p2w type game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its modernizaed Titans Quest, less confusing. Less loot, but less clutter, and more sense. Sense Epic is well preserved, as well as many enemies. Still needs final touch, including archievements etc. but nice direction THQ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this game is the sweet spot of ARPGs - it strikes a very good balance between depth and casual play potential. Plus, it is absolutely gorgeous. If you can play this marvel in 4k you will find yourself staring at the landscapes all the time. No dislikes so far other than it's still a work in progress but I'm impressed by the smoothness of the game at this stage. Definitely recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh wow THQ have really excelled themselves in making this fantastic game, at the moment it beats all games ever made, you have to check every part of the map because you will find fantastic Epic items and lets hope that they do not stop solo players from getting good gear ,the game is really beautiful in graphics, well worth the money they ask for the game, I hope they will expand the game without making it complicated.\nI am 74 years old and this game pleases my brain and heart.\nYou do feel like you are living in those times, what pleases me more is the tiny insects that are going along doing their own thing, like as insects do.\nI hope they add more beautiful things into the game that might be pleasing to the eyes, maybe like flowers growing trees loosing their leaves in the winter and animals coming out in the spring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with stunning visuals and fun gameplay. Plenty of scope for build customisations. early access so looking forward to more items to take builds to the next level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very nice sequel so far . The gameplay is solid and I fell like travelling playing this game. \r\nIt is early access so it lacks elements like monster variety and branches but it is very promising",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on permadeath, really enjoyed the experience and grind of it all. My only beef with this particular mode is the huge difference in difficulty between melee and range classes, like almost no shot with a melee class in permadeath.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Even being in early access I have clocked about 30hrs of game play. It has the goods to be great. Looking forward to more content.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This is a tough one - I'm saying \"not yet\" because it could go 2 ways at this point.\n\nRight now it's quite pretty and feels like the old Titan Quest BUT there's quite a lot of things missing that even TQ had and in 2025 there's a quite a lot more people will be expecting.\n\nI found what's there now \"OK\" - but there's not a lot of challenge, not enough things to do - it's hard to know if this will be worth your time when it's done.\n\nYou want it cheap?   Buy it now and take that risk - I'm happy to wait and see but won't be playing it until it has a LOT more content \n\nYou want to see how it pans-out?  Wise - see you at launch!",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "Man, I desperately wanted this to be good. I even installed my original TQ games to give them another run to get into the spirit of things. I know this game is still in early access, and I will revisit my review again at a later stage, but for now, I dont feel like even returning to the game to see what has been added.\r\n\r\nPositives:\r\n- The world looks nice\r\n- The story line, I guess? I'm not even sure about that. I couldn't get drawn into it. But there was only one act out, so I'll give it the benefit of a doubt.\r\n- I kind of like the balance in complexity vs ease of use regarding the skill tree/masteries. It's not difficult to get something good going without feeling like you have to go study some guide.\r\n\r\nNegatives\r\n- There are so many of the same repeating monsters\r\n- The voices don't feel authentic, I'm not sure what it is, but it just feels off.\r\n- The UI feels very outdated.\r\n- Updates take forever (3 months cycles are rediculous for a game with a moderate player base)\r\n- Boss fights feel static. I just run around most of the time with the boss following me around. \r\n- Movements feel stuttery\r\n- WASD is not playable. The world seems like its not rotated on the right angle, you constantly have to toggle between directional keys to move in the direction you want to go.\r\n- On the movement, the character's directional movements is not fluent at all, again, feels very jittery\r\n- The game simply stutters too much. I have a decent spec, but the game still feels like the frames drop to a very low value for seemingly no reason\r\n\r\nAgain, I know this is in early access. But you have to look at the competitors. POE II is an absolutely amazing game, and then for people who just want to run around and get their dopamine hit from shiny things on the floor, Diablo is your go-to game. This just doesnt feel like it can compare with these games as it is. \r\n\r\nI tried going back to this game a few times, and it just doesn't feel like it is worth the effort at the moment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Slow, clunky and runs very bad even with upscaling on 7800xt/5700x3d machine",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "After playing POE for 15 years, I thought I knew what a boring game felt like, until I played TQ2. It's like playing Everquest but without the soul. I'll gladly go play the original again over this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Oh, no! No, no, no, no! Please don't bring soulslike rotten formula to TQ! Please don't make constant dodging and rolling around the only viable playstyle. It may be an option for a light-armoured assassin, but a huge guy in a full plate with a shield should be able to tank anything, maybe except for the final boss. I hope it is still time to change the course.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "At the moment, I don't think I would recommend this game to anyone I know. It needs more time cooking and figuring out what it actually wants to be. It also feels all over the board in regards to difficulty, and the same can be said for most other aspects of the game (including the graphics).\n\nI oddly enough enjoyed the first chapter of the game when it was first released, but now after the update, I find the game less approachable.\n\nHopefully as they work out the kinks and polish the systems the game comes together, but right now I would recommend waiting.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I dont know if its just me, but movement, combat feel bad. Progression and gear feels somewhat strange for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you want souls-like in Greece settings  or like games like Hades, with interesting plot it's game for you. But if you expect solid isometric ARPG like first Titan Quest or Grim Dawn, with pleasible gameplay this is not your game. \n\nI can understand why developers trying to follow popular trends, but in my case it's just destroying genre I like. Just like in modern souls-like games Titan Quest II hardly relies on dodge ability and avoiding as much damage as you can and like in any souls-like in this game mages are busted and melee suck ass. No matter how you build your character, you can't tank anything that include channel or big hits, and while melee need running for your life any range can just kill everything from safe distance. Its so fun came to the Boss in melee build and take bow just becouse it's FASTER to kill him with unscaled shit white bow, than running away wfrom every attack boss making.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun gameplay and beautiful environments. This is negated entirely by the characters and story. ALL of the noble and mighty and peerless paragons of virtue in the game are all women and all the men are portrayed as weak, cowardly, listless, and dumb or evil.\n\nIts not 2016 anymore. And for every one girl playing this game there are 300 dudes so your trying to appeal to an audience that does not exist and your scotch taping your misandrist and played out ideology to yet another IP with an installed fanbase to keep it alive, like a parasitic cancer.\n\nEvery studio and media entity embracing that ideology is either dead or dying. You have let the enemy in and now they are wearing your IP as a skin suit in an attempt to cling to their fetid life for one more day, for one more dollar. Eventually the flesh suit will rot away and you will be exposed to the light and all that will be left is a bad memory for everyone else.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Well, we are banking on it being a good as the previous ones, but better.  The solid rep encourages us to go ahead and gamble on buying it while it is cheap and funding the development.   Odd how game development has changed and put so much risk and bankrolling on players before the game even comes outs.  At least there is no micro-transactions and seasonal DLC crap, right?! \n\nSo far, well it is pretty.  Something they did with the update today has really altered performance for me graphics wise.  I will research it and post it in the forums, but I generally run all my games at max settings.  I usually run a primary game, and then two other games, like an idle and a semi active like SNAP or something.  Plus, discord, web browsers, and generally 3-4 Twitch streams.  I generally do not have issues with all of that.  I closed eevrything sans the game today and still is barely satisfactory.  Sluggish and jump.  I will work it out or they will, I am sure, who every the issue lies with (I hope).  \n\nThe specializations are limited, and no matter which you choose, they are almost identical in ability, you just change the theme and graphics.  So, it is more cosmetic than actual diversity and truly changing your spec and gameplay.  NOT a fan of that so far, I have to believe, they will change that eventually.\n\nThe rest of it, the gameplay and story is basically the same, just prettier.  So, would I get it now?  I would not tell anyone they must grab it, no.  They can wait and spend elsewhere unless they want to gamble and maybe save a few bucks on hopefully a good game when it is complete.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played the game enough to give it a fair shakedown I think. Overall a solid and fun experience with some QoL and mechanical adjustments needed. The visuals are very nice, although I'm running a heavy rig that takes some FPS hits sometimes. Needs some smoothing out on the optimization, but it's not a constant. Seems to fluctuate throughout the game.\n\nEarly Access says that some of these criticisms can be worked on so I'll update as/if necessary. The game is fun, which puts it already above a lot of games however that doesn't save it from some glaring issues. The combat is satisfying but hit boxes and direction control are wonky. It's inconsistent and could certainly use some smoothing out. My biggest complaint is the weapons and skill tree. It feels bare bones (might just be an early access thing) with a lack of skill variety and hard to understand mechanics and wording. The toot tips are very vague and use mechanical terms I'm not familiar with not having played TQ1. The game difficulty is hard enough that if you aren't using a synergy with your build you won't succeed, leading to only 2-3 ways you can enhance skill tree. Otherwise you'll get rolled, at least in my experience. I wasn't able to successfully tinker with builds other than maximizing damage/hp/armor, therefor any fun utility skills get overlooked.\n\nIt's a good game but has some pretty front facing issues. I've had fun in my 17 hours but I'll put it down and wait for 1.0. I'd love to see some mechanical polish and some better build variety with skills. And more options for classes hopefully as well (only 4 classes now with some cross-class availability). At this stage of EA, I don't think it's worth the price of admission.\n\nAs of now (11/9/25) 6/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They've made a pretty basic walking simulator. The map is so big that I'm tired of walking. Killing creatures or farming doesn't make much sense either. I don't understand why you repeated the mistakes from Titan Quest 1 in this game. The game is already slow enough...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h2] Can't recommend at the moment (November 2025) [/h2]\n\n[h3] Good [/h3]\n[b] Graphics. [/b]\nIt is beautifull. Very good contrast with dark fantasy Action ARPG like PoE, Diablo. Althought there are some frame drops, especially in town\n\n[b] Story. [/b]\nI generally liked it. Offcource after the first character I stopped listening to it, but for me you can't have a story good enough so i will listen to it on all me character :)\n\n[h3] Not satisfied with [/h3]\n[b] Locations. [/b]\nCompared to TQ1 feels empty and non-balanced (difficulty). Because of a difficulty I still can't go any direction i want because of ememy level being much higher. Which makes the \"open\" map basically linear. By the way, have no issue with linear progression. It worked very good for TQ1.\n\n[b] Playstyles [/b]\nIn my oppinion the good old TQ1 approach works wery good and it is something that I would expect from TQ2. The additionall modifications to the abilities extend the TQ1 experience a bit. But what would I also expect, is more deep integration between the Masteries. [b] For example: [/b] Combination of two Masteries opens skills that exists only for this combination or unlocks new modificators for skills. TLDR: I like the current system, but it seems evolved not deep enough comparing to the previous\n\n[b] Itemization [/b]\nIt's not enought even for an early axes. The current itemisation is really flat. When I open chest or killing an enemy there is a chance to drop an item with random rarity and random stats. Tast's it. The TQ1 system is also preety shallow, but here there is nothing to do with an item after you found it.\n\nIf you found a high tier white base, there is nothing that will help you to improve it. If you found the magic item with one good mod, there could be a white item with higher tier (and damage/defences) that makes you magic item useless. You found a decent rare? There is nothing to improve it and prolongue its utility. After a several levels it will be worse than some normal items.\n\nIn my oppinion the itemization at the moment should be the first priority for the developers. At least untill there is at least something.\n\n[b] Rewards [/b]\nThe rewards from bosses are ok, but there are not that much bosses right now. I am talking mainlty about the semi-secret paths with the chest in the end. They felt like a regular chests that I can see on the fields or roads. So I felt like my attention to details wasn't rewarded enough.\n\n[h3] Can't rationalize yet [/h3]\nIn TQ1 even after hundreds of runs it felt good starting the new character (even without the nostalgic fellings). Here already after third run I feel like the world is empty, although it might be much more comparing to TQ1 locations",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this game has a ton of potential, but it just doesn’t feel like there currently enough content to be worth buying at this point in development. Wish there was a neutral option.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I actually don't have anything against this game being incomplete as some reviewers - seriously why would you give thumb down for an early release not being complete? - but what I can't get past is the clunkiness and slowness of the game. Moving around with your character is not rewarding - you slowly plod through the landscape, as if through molasses, and when you hit something or cast a spell, it feels as if it the action was in slow-motion. If this is how it stays, I can't really recommend this game to anyone who likes fast(er)-paced gameplay - it feels like watching a YouTube video on 0.8. \n\nAlso, what I don't understand is why would you sink so many developer hours into designing a really, really advanced character creator where you can choose your eyebrows, scars (want them fresh or dated?), and the size of your character's head? Come on, this is top-down RPG - you'll never see your character past the character creator anyway - who cares about this stuff! \n\nI will come back to this when the development has progressed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I expected far better from Titan Quest 2, but the animation quality is shockingly outdated for a 2025 release. The character movement and combat are so stiff and unnatural that it feels like the team has unintentionally set a new industry benchmark, just not in the direction anyone hoped for. Honestly, at this point they almost deserve a special award for managing to ship animations this rough in a modern ARPG.\n\nEvery action, from walking to fighting, looks clunky, robotic, and completely devoid of fluidity, making the gameplay feel more like a struggle than an adventure. It’s hard to appreciate anything else when the core mechanics feel this off.\n\nUnless the animation get a serious overhaul, I can’t recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a slow pacing game and crushes during gameplay. I don't recommend. It's not worth the money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one of the most mid games i have ever played in my entire life. it's not terrible, not good. it feels like a pre-alpha game that has no business being in \"early access\" but early access is what game devs rely on now to bait money out of people. \n\nit's slow, runs like sh*t, has bland characters, gameplay, combat, progression, and customization. the itemization is as barebones as it could possibly get. there are no interesting choices to make regarding anything about your character, skills, stats, nothing. it's all just generic rpg slop. it has barely any content at all. i beat the entire game then went around killing bosses to get the same items over & over. how this is $35 is GENUINELY INSANE. it's worse than Last Epoch was 3 years ago... \n\nthis game has \"very positive\" reviews for 3 reasons:\n\n1) nostalgia\n2) video game addiction (consumerism)\n\nthat's literally it.\n\nmaybe in 3 years it will be a fun experience, but right now it's not worth $5 let alone $35.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "up dates are taking too long to be release, this game should have been release when complited",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the latest update, the game won't launch. A complete reinstallation of the game doesn't help. Updating the drivers doesn't help((",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very Early Access.    Crashes at startup often.  Lots of potential \n\nFun enough, in an at-release Grim Dawn sort of way.   Don't expect to zoom around, and the loot chase isn't a big part of the game, since it's hard to tell what the new gear is doing for you. \n\nI kinda like being part of the beta ground floor, where it's  bad session if you don't have at least one bug in the tracker.    If that's not your form of fun, chill until full release.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm playing on a Laptop, Here's the problem it's loading CONSOLE Only not PC CONTROLS Fix this or lose a lot of PC Players like myself who aren't interested in buying and using Gamepad! Don't become another BLIZZARD/BUZZARD ENTERAINMENT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I could never get multiplayer (co-op) to work even with help in discussion so I just gave up and got my money back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game before chapter 2 release was alright, if a bit empty (it's early access so not faulting them for that).\n\nChapter 2 feels rushed? fps issues are still there but recent hotfix seems to have mitigated like 70% of it.\n\nCollision with environment seems to still be an issue in a lot of areas (bug that existed since the beginning of the game is still there too with the jump markers at spots that are otherwise impassable terrain, still block player projectiles but not hostile npc projectiles).\n\nStill no idea if I'm just imagining it, but movement and reactivity of button presses feels somehow worse than it did before chapter 2 release.\n\nHoping things get smoothed out but right now it just feels bad compared to chapter 1 release (which I thought was great, and had me hopeful).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I didnt want to give this game a negative review, it looks and plays great compared to the first one and i loved the first one, i love greek mythology games, ive played the game till the first boss and killed it, i had fun but what kept me from enjoying the game further was the optimization, it wasnt lagging nor it had any frame drops but at capped 60fps on 1080p low settings with FSR or DLSS at ultra performance my fans were noisy like a jet engine, compare that to Path of exile 2 with which i play on medium with balanced FSR/DLSS at 1080 without problems, and that game had massive eye cancer with the effects and my RTX 3060 still took it like a champ, this game has a massive discrepancy on its optimization, even on the main menu my fans whirl so wild capped at 60 fps. being in town makes my fans go brrrrr, compared to its competitors which has better graphical fidelity it runs poor.\n\nplease please devs, i see the potential and fun of this game but if you dont optimize it for medium to lower range PC's it will kill your sales, greek myth is so great of a concept for an ARPG but an unoptimized UE5 engine just sucks the fun out of things, hopefully it gets better, i mean its still early access and i see the great potential it has but whats the point of it if it tries to kill your PC before you get the full experience?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Audio bug with constantly changing range and volume of music and sound in general is still not fixed since release. This only happens in this game, so I know it's not my hardware / software. Tried Steam forums and the community is just a toxic unhelpful cesspit of biowaste. Yikes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At this point what I dont like when playing as a hunter are:\n- no storage for items\n- movement is so old school like bulder gate 2 or ps2 era. POE2 or Diablo IV are so way better.\n- sometimes when a little object in front of enemy, arrow wont hit them.\n- character creation is just a feature to put it there to be able to list it that the game has. Very very poor for 2025 if it is 2008 it's ok",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved and still play TQ1 and could not wait for TQ2 to come out. I really wanted to love it too, But i just don't. Its worse than TQ1 by a long shot. The skill tree is weird. The movement feels like a game from 20 years ago, The fighting feel forced and clunky. Its still in \"Early access\" what ever that means...But still feels like it should not have been released yet. Hopefully they \"Finish\" it and make it what it should be. I bought it with my own money for the ~$26.xx, So not free, But i think it will be a great deal once it's finished in a years or so....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "crashes at load screen, not playable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Жутко тормозит.\nИтемизация просто в ужасном состоянии - почти всё под мили билд.\nДа и с разнообразием билдов как-то очень туго. Очень мало билдов, которые работают.\n\nИ судя по всему, нет надежды, что на релизе будет иначе.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Story feels like AI and fighting is boring, just one active skill does everything.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I will not lie to you.\n\nI played POE1 D1 D2 D4 DS1, and now, i just started playing Grim Dawn, i had a sleepless night and it should be a good sign for a top ARPG game.\n\nIf you buy TQ 2, there is no gaming, you are only buying promises and ideas that doesn't mix to create the game that you have been waiting for.\n\nYou had enough of fomo, microtransactions, battle pass, seasons, wait queue, internet connection needed, that any game that goes without it, and lacks the rest, is rated positive?\n\nNO.\n\nThe only reason i put a negative review is because of their updates PRIORITIES, knowing that you have already bought the game in EA, and will surely, only get 4 updates in a year.\n\nThe game is extremely, painfully, very, too much, so, slow paced, bland and clunky. \n\nThe only good update was adding divinity LVL 30 new skills.\n\nThe rest judge by yourself.\n\nA New Zone have been added within the bland state of the game, before trying to revive any existing excitement in the gameplay or even better, wanting more of it.\n\nCharacter creation should have been delivered at the beginning, nevertheless it counts as the latest update NOW.\n\nAnd a price increase NOW? it is way TOO SOON. The game NOW will become very expensive for an EA.\n\n\nA quick explanation, update wise, in EA without updates, it should already feel like a steal, with already Very Positive reviews, playing hours non stop and again wanting to get back to it as soon as you can.\n\nAnd it doesn't happen here.\n\n\nFor those who wants an ARPG, even in a EA, that worth every penny and were the devs know their updates PRIORITIES.\n\nIt doesn't happen here.\n\nIt is enough? would you still buy it? The game sure yet is artistically gorgeous, set in ancient greek, the lore the graphics, the music voice acting are good, one good skill update? but the rest? there is none.\n\n\nFor me TQ2 - uninstall - remove from favorite - waiting months for next updates and gets a price increase and a character creation which was the CORE of every THE TOP TIER hack and slash ARPG like POE1 GD D1 D2 /s.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Charging full price at this point is ridiculous\n\nNeeds A LOT of work. Its still lacking so much to give a proper review, even if in EA. Still waiting on crafting, gear, new possible systems. Masteries leave much to be desired, they feel boring. No pets, traps, etc\n\nGameplay is slow, and dont like this dodge/roll and barrier mechanic being forced for each character. The illusion of choice has left nothing unique for any mastery.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "idk, i played many arpg´s (and a lot), but i dont like this one so far. Cant really put my finger on it tho (yet).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great 25% of a game. Will be amazing when it's all out but at the moment your halfway through the game when suddenly it's over, not even end game missing it's the middle & end missing.\r\nI know it's early access but cmon",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not BAD, per-se, but the lack of a pet build out of the box like the prior entry at a baseline is a turn-off for me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs more time to cook. More content and more optimization, especially on linux systems...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "do not buy. they are selling a very incomplete game and then not giving you the option to pay for more content in a dlc.  hopefully i am understanding it wrong and the price is just going up for people buying it from here on out.  if they had offered the content if you paid the extra then i wouldn't have an issue.  nope, it downloaded automatically when i went to play the game again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got 20 mana regen when my friend hosts... when i should have 80... fix this issue ! until then i don't recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Early Access Review (as of Chapter 2 release):[/h1]\n\nGame has a solid skeleton, it is cinematic and looks great but there's some glaring issues with the overall game design so far which need to be fixed. Currently Grim Dawn is a better sequel to Titan Quest than Titan Quest 2 is.\n\n- Itemization is a joke. Really, it is the worst itemization I've ever seen in an ARPG\n- Skills are awful and there's a serious lack of passive or toggle skills for passive builds\n- Skill UI and overall system is designed for mobile phones, not for a PC\n- Severe lack of Greek Mythology characters, creatures, Gods and mythology. Currently it feels more like mythological fanfiction\n- Movement and combat is very clunky \n\nOverall, the current itemization and skills need to be scrapped and rebuilt from the start because currently it's a complete no-go. Devs, if you see this, just look at Grim Dawn - they got 99% right, why are you getting 99% wrong here?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gonna agree with others and say not yet, however I'm scared it may, for me, be a never.\n\nI'll start by saying I am a huge TQ1 fan, and to a lesser degree a GD fan. I think the two mastery system in general is the most fun I ever have with ARPGs, by design it creates hundreds of builds. I have hundreds of hours in TQ1 and I'm sure I'll break one thousand soon enough.\n\nThat being said I want to be clear about this, this game is NOT for TQ1 fans. It doesn't mean a TQ1 fan couldn't like it, but in the way Grim Dawn was clearly a TQ spiritual successor this game just isn't. So because of that I'll end it there on the TQ1 comparison, this could of course change, as of writing they ARE adding charms and relics, but it is SO much different for the worse in comparison to TQ1.\n\nSo as just a general ARPG how does it stack up? Eh it's ok. I have 3 main reasons I've been consistent on since the early Demo last year that have not been addressed as of the time of this writing.\n\n1. Progression is boring\n\n2. Combat is stiff\n\n3. Skills and attributes.\n\nI've written these 3 points multiple times so I'll be as brief as I can warrant while still trying to get my point across.\n\n1. Progression IS the gameplay loop of an ARPG. In MOST ARPGs you can never really become \"the best\" version of your build, at least not sub 1k hours per build, maybe more. You theorycraft a build (or use a guide) do X to get the build going, beat Y to test the build, then grind Z to make the build better. Rinse, repeat. This game is in early access yet so I'm trying to be fair with this but man when I say the current skill trees/progression does NOTHING to excite me about the progression loop, it'd be an understatement. \n\nOne of the beautiful things about TQ1 is each layer of your build, for simplicity I'll just say Normal, Epic, Legendary, had depth to it. You wanna create that dual wielding berserker, pick Warfare and by like level 5 you'll see your idea starting to form with clear goals of where to go from there. This game however, since 90% of the power of each skill is hidden in a sub menu, there's none of that. Can you even create a fun dual wielding build (actual auto attack not just having two weapons equipped), no idea because I have no clue what works with dual wielding and what doesn't.\n\nThere could be amazing perks that some skills have SPECIFIC to dual wielding but again, there's no clear way to know that without spending WAY too much time in very boring menus. The bright, and inviting skill tree of 1 is replaced with a dull, boring, and hard to actually theorycraft skill tree. \n\n2. Auto attacking feels bad, casting feels bad, arguably the one ability that felt good has supposedly been nerfed to the ground, and even that would have gotten old regardless. I don't have much to say about this, but just do better. Almost every obvious pick for \"best ARPG\" has better, and more fluid combat.\n\n3. The meat and potatoes. I have no clue who designed the current skill/progression system but they need to be relocated to another department. So for those unfamiliar with how ARPGs.... and really many RPGs, work it's like this. Invest a point in Skill X, Skill X gets better, normally in the sense of +damage. This game had the revolutionary idea for skill points to just add.... the possibility of giving your skill traits? \n\nIt's awful, unfun, and I'm sure adds to my first point about progression feeling so unfun. I don't understand this direction but think a simple workaround would be something like this, actually let a skills level increase it's effectiveness (i.e. +damage), have nodes like TQ1 and GD that replace the current perk system, allow perks to have level requirements for base skill and qualifiers if necessary (i.e. can't use with X, must have Y equipped). \n\nOn top of that mastery level not adding anything to attributes just feels, again so boring. In TQ1 if you put all points into the bar as it was called you still GOT stronger, albeit in a more \"number go up,\" sort of way. This game there's none of that. So there are 100% level ups where I'm just not progressing at all. 1 point into bar, 2 into a skill I don't get a perk in yet in the higher levels, and 2 points being saved for a later passive. \n\nI also think the 1 point mastery, 2 active, 2 passive split is awful. Just give people 5 points per level up, let them put it in whatever they want.\n\nOverall I wish this game all the best, I hope these devs prove me wrong and make this game as amazing as it very well could be, but as of right now it fails as a TQ sequel, fails as a good APRG, and just fails to be fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "copy paste of last epoch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too difficult",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not as good as the first",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not great.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring back ice shards",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Is this Titan Quest? NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has a unique character progression system, but the game play managed to make itself feel tedious just a few hours in. Movement feels clunky - POE2, Last Epoch, and Diablo 4 all feel better in regards to movements and skill/action execution and impact.\nCombat feels weird. Fails to ever grow out feeling like i'm fighting tutorial zombies with a blunt knife despite skill and gear advancement.\nThe skill system offers the illusion of choice. No matter which classes you pick there is clearly a prescriptive guiding hand pushing you build a character based on specific skill combinations.\nDidn't get far enough to declare comprehensively, but itemization is \"meh\". Show me something half decent if you want me to keep grinding.\n\n\nIt's not bad, but I can't find a single specific things it does better than any of its competitors in the genre",
      "voted_up": false,
      "votes_helpful": 73
    },
    {
      "review": "I was pretty excited about this, since the first TQ was amazing. So many hours spent on it. And I still have high hopes that they can improve TQ2 throughout the EA period. But I can't recommend this in it's current state. The graphics overall are nice, but the combat and skill sets are pretty bland - as are all of the overall systems for that matter. Gear is also bland, I have yet to equip and upgrade that really made combat feel any different. Yay for those 1% improvements? The mobs are also pretty spread out and too few in number. \r\n\r\nIn the end, I just didn't find myself enjoying this - it is very simple and bland in its current state. That said, did give me the itch, so I started playing Grim Dawn again, and that game is simply light years ahead despite the somewhat dated graphics. Definitely hoping they can fix this!",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "i loved the first TQ, and was looking forward to a sequel finally.\r\n\r\nUnfortunately the magic for me in TQ1 was the Class/Mastery system.   Allowing meaninful customization options and different feel based on your decisions.   In TQ2, it's watered down so much, that you really only focus on 1 ability.   It feels bland, and while the skill point respec costs are fair, the attribute respect costs are way to high, limiting your ability to try different play styles without excessive grinding (not that the variety available feels all that different).\r\n\r\nGraphics and story are decent, and the slower pacing isn't bad.   Just completely disapointed in the mastery/skill system",
      "voted_up": false,
      "votes_helpful": 95
    },
    {
      "review": "📷 Graphics (8/10)\nAbsolutely fantastic environments: buildings, landscapes, rivers, and water effects are stunning.\nArmor models look solid.\nHowever, inventory textures feel overly dark and gloomy.\nPoor optimization hurts the experience in some areas.\n🖥 UI (5/10)\nThe basics are clear and functional.\nGreat addition: filtering advanced stats.\nBut I miss seeing DPS and the classic old-school stats.\nInventory icons are too dark, hard to distinguish, and often blend together.\n⚔️ Gameplay (7/10)\nSome bugs with dash, NPCs in T-pose, NPCs stuck on obstacles — but nothing game-breaking.\nThe map is much larger now, with many towns instead of just one main path as in the original TQ.\nDungeons sometimes require loading screens, which breaks immersion a bit.\n👍 Improvements over Titan Quest I\nYou can reset enemies on the map — farming bosses for a small gold cost is great.\nHuge stash space with the caravan.\nNice little touch: the ability to rename your caravan \"chests.\"\n👎 Downgrades compared to Titan Quest I\nItems no longer drop directly from monsters (bats don’t drop clubs, skeletons don’t drop the armor they wear).\nThe “anything can drop” magic is gone — in TQ1, any random torch, legendary sword, or ring could appear thanks to RNG. Farming a cyclops for his club 20 times felt rewarding. Here, that nostalgic randomness is missing.\n\nIt’s very hard to decide if I should recommend this game in its current state. While it has a solid foundation, beautiful visuals, and some great quality-of-life improvements, the lack of content and poor optimization make it feel unfinished. For now, I do NOT recommend it.",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "Titan Quest II brings players back to a world inspired by Greek mythology, with gods, monsters, and a handcrafted world that looks genuinely impressive. The presentation is strong across the board and the skill system shows a lot of promise, but the game currently struggles in areas that matter most for an ARPG.\n\nOn a high-end PC the performance is surprisingly poor. Even at max settings the game dips down into the mid-50s FPS, which shouldn’t be happening given the hardware. Visually the game looks great, but the optimization simply isn’t there yet.\n\nThe character creation system is excellent and the dual-mastery skill system feels flexible and fun to experiment with. Being able to modify abilities as you invest more points is a great addition and gives you a nice sense of progression. Unfortunately, the gameplay itself lands somewhere above “alright” but not much more. Movement feels slow and stiff, and the lack of a sprint or mobility option early on—especially after playing something like Path of Exile 2—makes traversal feel sluggish.\n\nItemization is where the game really falls short right now. Loot feels bland and inconsistent, and it’s strange to pick up two white items half a minute apart and have a piece of cloth provide more armor than a metal helmet. It breaks immersion and makes loot progression feel uninteresting.\n\nThere’s real potential here thanks to the setting, atmosphere, and solid foundation, but as it stands Titan Quest II still needs a good amount of work. I’ll definitely revisit it once it releases, but for now I’d recommend holding off on purchasing it.\n\n[b]Final verdict: Wait for release. [/b]",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Man, I desperately wanted this to be good. I even installed my original TQ games to give them another run to get into the spirit of things. I know this game is still in early access, and I will revisit my review again at a later stage, but for now, I dont feel like even returning to the game to see what has been added.\r\n\r\nPositives:\r\n- The world looks nice\r\n- The story line, I guess? I'm not even sure about that. I couldn't get drawn into it. But there was only one act out, so I'll give it the benefit of a doubt.\r\n- I kind of like the balance in complexity vs ease of use regarding the skill tree/masteries. It's not difficult to get something good going without feeling like you have to go study some guide.\r\n\r\nNegatives\r\n- There are so many of the same repeating monsters\r\n- The voices don't feel authentic, I'm not sure what it is, but it just feels off.\r\n- The UI feels very outdated.\r\n- Updates take forever (3 months cycles are rediculous for a game with a moderate player base)\r\n- Boss fights feel static. I just run around most of the time with the boss following me around. \r\n- Movements feel stuttery\r\n- WASD is not playable. The world seems like its not rotated on the right angle, you constantly have to toggle between directional keys to move in the direction you want to go.\r\n- On the movement, the character's directional movements is not fluent at all, again, feels very jittery\r\n- The game simply stutters too much. I have a decent spec, but the game still feels like the frames drop to a very low value for seemingly no reason\r\n\r\nAgain, I know this is in early access. But you have to look at the competitors. POE II is an absolutely amazing game, and then for people who just want to run around and get their dopamine hit from shiny things on the floor, Diablo is your go-to game. This just doesnt feel like it can compare with these games as it is. \r\n\r\nI tried going back to this game a few times, and it just doesn't feel like it is worth the effort at the moment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Interesting approach, I enjoy it for now, but the game has more questions than answers. I haven't even ascended to the first temple but there are already many things I have to highlight.\n\nWhere did the cool old skill system go? In TQ1 not only did I skill specific combat passives, I saw them work, which made the fighting a lot more entertaining. Now I'm doing some anime moves and oneshot everybody with the main attack. It is kinda fun but I really liked the basic attack evolution in TQ1. Isn't the basic attack the cornerstone of all ARPGs? Making the game more casual? Sure, I would like to skip several dozen hours of grind. Ignoring the fundamentals of good ARPG game design? Whole another story. The essences? Haven't seen the weapon & armour upgrades yet. I really liked the essence mechanics, the whole crafting system behind it, now it's gone (or I haven't seen it yet, which would be weird too). \n\nThe narrative seems very mobile-game-ish (Look for the person, go into cave, save the maiden because you are the hero and YOU HAVE TO). No explanations, the lore completely lost its depth. Where's the Greek setting? It's all Roman now. My dude looks like a Roman too. Yet the greek letters are still there. The narrators are fine but I suspect the narrative is dictated by the corporate and you see women on all kinds of positions doing \"good\" things while the bad treacherous men do their \"bad\" things or everything they do falls apart. Diversity, huh? Enjoy the repelled ARPG fans that will come crawling back to PoE's Isaro dungeons. I've had enough of women telling me what to do in other \"diversified\" games. Not like PoE doesn't have the diversity, it's just so smoothly intertwined into the story that you barely notice it.\n\nLoot system? It is alright. You do a fight, you kill a miniboss, you get loot from the miniboss and the adjacent treasures. No mob drops. Sets a less ADHD-inducing pacing and I really don't mind that. \n\nVery casual. I am sort of disappointed with the skill tree. More disappointed with the narrative. The skill system feels oversimplified and the narrative feels bland, feels like the game has lost all its character to fit into the corporate bullshit frame. I sincerely hope the release version will cover all the holes in the narrative. I like to have a purpose to what I'm doing and don't like being treated like a mule. If I'm the hero, then treat me like a hero, not like a hore.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Oh, no! No, no, no, no! Please don't bring soulslike rotten formula to TQ! Please don't make constant dodging and rolling around the only viable playstyle. It may be an option for a light-armoured assassin, but a huge guy in a full plate with a shield should be able to tank anything, maybe except for the final boss. I hope it is still time to change the course.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Beautiful to look at but boring to play at this point. It's just running around pushing buttons, (which don't lock on close enemies/bosses about a 20% of the time), and getting way too much generic loot. Plus the bosses are not very balanced.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Slow, clunky and runs very bad even with upscaling on 7800xt/5700x3d machine",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "After playing POE for 15 years, I thought I knew what a boring game felt like, until I played TQ2. It's like playing Everquest but without the soul. I'll gladly go play the original again over this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "At the moment, I don't think I would recommend this game to anyone I know. It needs more time cooking and figuring out what it actually wants to be. It also feels all over the board in regards to difficulty, and the same can be said for most other aspects of the game (including the graphics).\n\nI oddly enough enjoyed the first chapter of the game when it was first released, but now after the update, I find the game less approachable.\n\nHopefully as they work out the kinks and polish the systems the game comes together, but right now I would recommend waiting.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Why do we call this TQ2 when it is nothing like the first one? The stuttering is terrible, the UI's are not good, the skill trees are probably one of the worst parts because they feel bland and not even a 1/4 good as the original. Overall im extremely disappointed in this game. its almost like the same studio didn't make this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fun gameplay and good graphics. Not quite as fun as TQ1, but looks better.\nHaven't been able to play since the last update days ago (asset/login glitch), and there was not enough of the story/content ( basically a mini boss and one boss fight).\n\nWait for the full game is my advice. This will be my last early access buy (no longer a fan of that business model for many reasons)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I dont know if its just me, but movement, combat feel bad. Progression and gear feels somewhat strange for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I REALLY want to like this game, i have loved Titan Quest 1 soooo freaking much\n\nBut so far in TQ2 there isn't much to love really.\nThe entire Greek Mythology Theme doesn't really come across, for the most part you are either fighting 3 different versions of Crabs or a bunch of Bandits, sometimes a Snake.\nThe Bosses are well made and i like that but the fights DRAG insanely due to super underperforming masteries for the most part.\n\nAnd masteries are the biggest weakness of Titan Quest 2, Titan Quest 1 had a ton of abilities, each felt useful in its own right, and no matter how bonked your build was you still felt powerful and if you have made the right choice.\nHere you get maybe 3 or 4 really good looking and semi strong active masteries per Specc, the rest is more or less just passive damage or defensive buffs, which honestly never felt good in an ARPG.\n\nEven the passive choice you make when leveling an active skill hardly change anything other than \"The skill now has a .5 second delay but deals 50% more damage\"\nOr in other words, you really won't spend a lot of time building a cool character because every choice you make feels super underwhelming.\nThe final Tier choices that came with the latest patch are also more or less the same, but you choose \"Do you want the Skill to be red coloured or would you rather want it in blue?\"\n\nI hope that Masteries get reworked and a lot more love than what there is now. I want this game to be good, but right now, i can't recommend this game to anyone really. \nRather wait, see where it heads and then give it another shot.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is very early access but there's promise. Needs a lot of work but I decided I'd rather buy it now when it's cheapest.\n\nPlease fix the optimisation, it runs horribly. No reason my 3060ti should not be able to run this level of graphics at a smooth 60fps at medium settings.\n\nThe levelling system needs a full rework in my opinion. How are we still getting such dull passive skills as core parts of the progression?",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "For me the motion blur when moving makes this game unplayable, even on the low post processing setting. Its really bad and makes everything so unfocused and its incredibly noticeable and takes you out of the game. So I cant play it right now which is incredibly frustrating - so for that alone I cannot recommend this game sadly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you want souls-like in Greece settings  or like games like Hades, with interesting plot it's game for you. But if you expect solid isometric ARPG like first Titan Quest or Grim Dawn, with pleasible gameplay this is not your game. \n\nI can understand why developers trying to follow popular trends, but in my case it's just destroying genre I like. Just like in modern souls-like games Titan Quest II hardly relies on dodge ability and avoiding as much damage as you can and like in any souls-like in this game mages are busted and melee suck ass. No matter how you build your character, you can't tank anything that include channel or big hits, and while melee need running for your life any range can just kill everything from safe distance. Its so fun came to the Boss in melee build and take bow just becouse it's FASTER to kill him with unscaled shit white bow, than running away wfrom every attack boss making.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game isn’t complete yet, but what’s available so far doesn’t really stand out.\nMost modern isometric ARPGs bring something new to the table, that’s not the case here. Titan Quest 2 mainly reuses old ideas, and not even to the point where it feels polished or refined.\n\nTheorycrafting feels underwhelming, combat is slow and clunky (I don’t mind slower combat, but mobility feels choppy and you can’t even attack while moving), and skills are limited in both number and quality. Lore can be amusing at times, but overall it feels shallow, and the variety of enemies and areas is quite small and not very engaging. Some locations do look good, and while certain details are rough, the game does have a certain charm (though it still lacks passion in my opinion).\n\nAs mentioned, my criticism focuses only on core aspects of the genre that are usually well-established by now. Unfortunately, even these foundations aren’t executed very well in 2025. It’s not a strong start, but I’ll give the devs time as it’s only early access. I’ll definitely try the full release later, but for now, playing early access has left me more demotivated than excited.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Poor enemy variety, all available areas are very similar to one another, not enough content to be worth it and fuck your scummy regional pricing too.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I very much enjoyed the first game, and later enjoyed Grim Dawn which builds on the foundation made by the first Titan Quest game. \n\nWhile there are some interesting new concepts in the way skills work in TQ2 - I think it falls short. I don't feel the same level of build diversity, quite opposite I felt trapped with too little skill/build options. \n\nIt is possible there will be more skills added to the skill trees that make me not feel this way, I suppose time will tell, if so I will gladly change this review as the first Titan Quest holds a special place in my heart.\n\nFor now though, go play Grim Dawn, it does a better job at being a sequel to Titan Quest.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Animation fundamentals are not nailed down. Movement (running and everything around it) is sub par. The current mechanism is both way too complex and way to amateurish in quality with an excessive amount of tertiary animation an ARPG does not need. If this isn't addressed I'm not compelled to play the game regardless of how elegant any other aspect of the game may end up being.\n\n[url=https://steamcommunity.com/app/1154030/discussions/0/601917463282722920/][u]Here's my post[/u][/url] elaborating on the above if anyone'd be interested.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In this day and age this game feels like I went back in time to the 90s. Back than I'd be thrilled to play it, but now it's kinda meh.\nIt really is a diablo clone. Some ppl here say it's D2, I'd say it's more like D1, the original Diablo, which I did play when it just came out. D2 is still more interesting than this even if I'll forever do cowruns for strangers on the battlenet.\nIn this game I'm like gigabored, falling asleep while playing. If that's your thing - sure, give it a go.\nThose who say like it takes effort to win here are probably not great at making effective builds. I did some math and ended up with ice shards clearing 2x screens in front of me with a pretty much one-button spam build. I love one-button spamming in PoE and PoE2, cuz drops there actually matter, clear speeds matter, maps are random to some degree, there's crafting, trading etc. Here you just see things pop. On the same map. You can boost monster lvls. that's good, I guess.. what for? dunno. It's just there. I did it. Stuff pops slower - that's the whole difference.\nIf you ever worked with Unreal Engine, you'll immidiately recognize it too. Okay, maybe they change the standard doll to some other asset, but oh my, it's so cliche. At least some other guys have like you know, their own engines that they put effort in. UE is like the bane of the industry right now. Ofc I had no lags or stuttering, doesn't mean you won't - I just happen to play on a top tier rig.\nAnyway, to sum it up - if you'd like to take a nap through a generic \"greek-myth-like\" story - play this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As much as I am a fan of the Original Titan quest game. This one so far seems like a slight disconnect from the Original Game in terms of Mobs and content.\r\n\r\nSo far with Titan Quest 2 i seem to just be Killing Crabs, Boars, Birds, Snakes, Wolves, Fish men and Different versions of Humans (ghosts, skeletons, dark entities, pirate/bandits) For two acts so far that is ALL you are killing. No diversity in the mobs.\r\n\r\nThe game moves at a snail pace as opposed to other genre titles (Diablo IV, Path of Exile 2 and the likes) It has no way to swiftly move around other than putting a lot of investments into movement speed. No run mechanic like POE2, no mount like in Diablo IV, but the maps feel large enough to need something, but nothing is delivered, so you just feel like you a slogging along at a snail pace through the maps.\r\n\r\nThe distance between mob density and the slow moving of the character makes the game feel very slow and most of the time with the Same mobs all the time, very Boring. I find myself playing for a little bit then exiting the game because I am just bored.\r\n\r\nGame has potential, but for now i need to say that it is tedious and boring at this stage.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Looks really solid. I like the gameplay and talent building. The thing I don't like and certainly can't recommend the game is the performance. If you don't own a high-end PC, it won't run well.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'll give the TL:DR at the start for anyone who doesnt care to read the full review.\r\n\r\nAs it stands, I cannot recommend this game to people for one simple reason; Its not finished. This game has a long way to go before its in a state where I could recommend other people to buy it, and if you are curious about the reasons, i'll go into it, if not, I would say come back in 12 months and see where the game stands then.\r\n\r\nNow for the full review.\r\n\r\nI want to start by saying that this game has potential, its not all bad, and what I do find bad can still be fixed. My biggest complaint with the game right now would be the gameplay, specifically the loot system. What made Titan Quest 1 and Diablo 1/2 so much fun was that loot felt interesting, you would drop cool items that felt genuinely unique and would then tailor your gameplay around those items. THIS GAME DOES NOT DO THAT. This game falls into the same pitfall that Diablo 3 and 4 fall into in that loot feels completely uninteresting, its all about min/maxing stats, finding the right affixes, and rather than build around unique pieces of gear, you make a build and then find the right stats to make the build work, its utterly boring. 99.99% of all gear that drops for you will be nothing more than vendor trash as you fight the rng to find gear that actually has the stats you need, personally I dont find spending potentially hundreds of hours farming the same boss over and over trying to drop a piece of gear that has the correct set of stats on it, its about as fun as filling out a tax return.\r\n\r\nTQ2 has Greek Mythology as a backdrop, the potential for storytelling in this setting is incredible. I want to play through some of those incredible stories of Greek myth. if I wanted to play a generic modern arpg, which is just an endless loot treadmill of min/maxing stats, completely soulless garbage, I would just go and play Diable 3/4. I'm here for the cool Greek Mythology, so is just about everyone else.\r\n\r\nWith this upcoming crafting system, please just allow us to choose the stats that we want to put on our gear, then focus on making an amazing story to play through, with some interesting and UNIQUE items sprinkled in along the way. No more endless loot grinding.\r\n\r\nWhile the story starts off pretty slow, by the end of ACT 1 I was getting quite interested in the story, and the environments at the end of ACT 1 were fantastic. I think visually this game is very nice, it feels like the right amount of detail, no so little that the world looks bland and uninteresting, but also not too much that details just kind of get lost in the amount of stuff on the screen, the world feels believable, which I like.\r\n\r\nThe only other real major I have with the game currently is the performance, Usually the game runs pretty well, but once you get about 15+ enemies on the screen the performance tanks massively, I can go from 75 fps on ultra settings down to less than 10 in situations like that, and in a game where the price of not dodging attacks is death, the game turning into a slideshow in tense moments is really not ideal. I have a Ryzen 3800x and Nvidia rtx3080, which while not a high end system, its not an entry level system either, I really shouldnt be getting performance issues like that, not when in situations where there are less than 15 enemies at once, the game runs buttery smooth.\r\n\r\nOverall, I think this game still needs another 12 months in the oven, its not ready yet, there isnt enough content yet to justify the pricetag and there are still basic features missing from the game like crafting and transmog. This is a decent start, but its still realistically only 1/4 of a game at best.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "As of 0.2 it's probably most irresponsive and slow ARPG out there (out of \"big\" ones). \r\n\r\nCharacter building is WAY weaker than in Grim Dawn (2016 game that is developed by actual devs of TQ 1). Among modern games it's barely different from D4 (up to you to interpret is as you like).\r\n\r\nStory is... there? That's it.\r\n\r\nVisuals are nice, but visuals alone are not enough.\r\n\r\nWill update when new versions come out, hope things change.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun gameplay and beautiful environments. This is negated entirely by the characters and story. ALL of the noble and mighty and peerless paragons of virtue in the game are all women and all the men are portrayed as weak, cowardly, listless, and dumb or evil.\n\nIts not 2016 anymore. And for every one girl playing this game there are 300 dudes so your trying to appeal to an audience that does not exist and your scotch taping your misandrist and played out ideology to yet another IP with an installed fanbase to keep it alive, like a parasitic cancer.\n\nEvery studio and media entity embracing that ideology is either dead or dying. You have let the enemy in and now they are wearing your IP as a skin suit in an attempt to cling to their fetid life for one more day, for one more dollar. Eventually the flesh suit will rot away and you will be exposed to the light and all that will be left is a bad memory for everyone else.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Well, we are banking on it being a good as the previous ones, but better.  The solid rep encourages us to go ahead and gamble on buying it while it is cheap and funding the development.   Odd how game development has changed and put so much risk and bankrolling on players before the game even comes outs.  At least there is no micro-transactions and seasonal DLC crap, right?! \n\nSo far, well it is pretty.  Something they did with the update today has really altered performance for me graphics wise.  I will research it and post it in the forums, but I generally run all my games at max settings.  I usually run a primary game, and then two other games, like an idle and a semi active like SNAP or something.  Plus, discord, web browsers, and generally 3-4 Twitch streams.  I generally do not have issues with all of that.  I closed eevrything sans the game today and still is barely satisfactory.  Sluggish and jump.  I will work it out or they will, I am sure, who every the issue lies with (I hope).  \n\nThe specializations are limited, and no matter which you choose, they are almost identical in ability, you just change the theme and graphics.  So, it is more cosmetic than actual diversity and truly changing your spec and gameplay.  NOT a fan of that so far, I have to believe, they will change that eventually.\n\nThe rest of it, the gameplay and story is basically the same, just prettier.  So, would I get it now?  I would not tell anyone they must grab it, no.  They can wait and spend elsewhere unless they want to gamble and maybe save a few bucks on hopefully a good game when it is complete.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I know game is in early access phase but performance is BIG issue, my pc: 3060ti 8GB, ram 48gb, processor: i7 13700F, i played at 1080p & 2k and both was same <=> so lagggggg.\n\nIf you run game in a long time, lagging will increase, i think this game have many memory leak. I have played chapter 1 but really dont want to play chapter 2 because of lagging.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Buy it to support, not to play (yet ?).\n\nI wouldn't recommend the game as-is.\nTried it for nostalgia, plays like a generic hack'n'slash.\n\nLacks content, ok for an EA, still, wouldn't replay the story.\nOnly got a single bug, which indicts good enough stability.\nVisuals are great, audio is subpar, lore is dull.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Played the game enough to give it a fair shakedown I think. Overall a solid and fun experience with some QoL and mechanical adjustments needed. The visuals are very nice, although I'm running a heavy rig that takes some FPS hits sometimes. Needs some smoothing out on the optimization, but it's not a constant. Seems to fluctuate throughout the game.\n\nEarly Access says that some of these criticisms can be worked on so I'll update as/if necessary. The game is fun, which puts it already above a lot of games however that doesn't save it from some glaring issues. The combat is satisfying but hit boxes and direction control are wonky. It's inconsistent and could certainly use some smoothing out. My biggest complaint is the weapons and skill tree. It feels bare bones (might just be an early access thing) with a lack of skill variety and hard to understand mechanics and wording. The toot tips are very vague and use mechanical terms I'm not familiar with not having played TQ1. The game difficulty is hard enough that if you aren't using a synergy with your build you won't succeed, leading to only 2-3 ways you can enhance skill tree. Otherwise you'll get rolled, at least in my experience. I wasn't able to successfully tinker with builds other than maximizing damage/hp/armor, therefor any fun utility skills get overlooked.\n\nIt's a good game but has some pretty front facing issues. I've had fun in my 17 hours but I'll put it down and wait for 1.0. I'd love to see some mechanical polish and some better build variety with skills. And more options for classes hopefully as well (only 4 classes now with some cross-class availability). At this stage of EA, I don't think it's worth the price of admission.\n\nAs of now (11/9/25) 6/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not much to do at the moment. 6-8 hours of content done at a very slow pace. For the current price I cannot recommend it to anyone else. Wait for a bigger update...",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game runs terribly. I could not play it beacuse of low FPS no matter what quality setting I chose.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Titan Quest is one of my favorite games - I’ve sunk thousands of hours into it. The first part was genuinely unique for its time: cool graphics, an unusual ancient Greece setting - all of that made it special. When I found out about the announcement of the second part, I was pleasantly surprised and really waited for the release. But what did we get?\n7 hours of gameplay and only 4 skill schools. In the original Titan Quest at release there were 8. In the first part you could create 24 different skill combinations, and here - a miserable 6. That’s just laughable. Variety - zero.\nPros\nGraphics — good. Optimization is also not bad for Early Access (yes, I ran into bugs, but nothing critical).\n\nLevels — really interesting. Level design is solid, there are mechanics unusual for the genre: dash, jumps from heights, climbing ladders - and all this makes exploring the world more interesting. There are also simple puzzles, which is a plus.\n\nBosses — fun to fight. You can’t just click them down or spam skills; you have to dodge attacks and hit only at certain moments. The combat is dynamic and fits the gameplay well. Bosses don’t feel like mobs with lots of HP — they feel like truly unique opponents.\n\nSounds — realistic and add a lot of atmosphere.\n\nCons\nMain con — VERY little content, even for Early Access. This looks more like a demo than a full-fledged Early Access.\n\nYes, the game is sold cheaply, but with this amount of content — it’s actually expensive, not cheap.\n\nThe game has only 4 skill schools, you can beat it in ~7 hours. Only one act is available at the moment. Mobs are monotonous, and weapons look the same and aren’t interesting. After two playthroughs I got only 2 unique items.\n\nNo crafting at all. Neither the artifact system like in Titan Quest 1, nor unique-item crafting like in Grim Dawn. Titan Quest 2 doesn’t even have upgrading items with amulets like in the first part.\n\nSome passive skills literally duplicate each other, giving the same buffs, just worded differently.\n\nThe schools combine very poorly with each other. I spent most of the time leveling skills from just one school, because I didn’t find anything in the second school that would actually work with my main build.\n\nBalance (I played before the first small patch with fixes, maybe some of this was already adjusted, but I’m describing my experience BEFORE the patch): magic skills are much stronger than physical ones. If you play through weapon attacks — you have to click down every mob for 5 seconds. If you play as a mage — you press one button and a whole group of mobs just disappears.\n\nConclusion: Titan Quest 2 has a pleasant core — the combat system, bosses, levels, and sounds are really well done. But overall there’s just nothing to play here. Content is critically lacking, and even for Early Access it looks very poor. Yes, the foundation is okay, but for now it’s more of a demo than a full-fledged part of the legendary series.\n I want to believe the developers will add content with patches and that by release the game will turn into something worthy. But honestly — I doubt they’ll meet their own timeline (end of 2026) and that they’ll have enough to make Titan Quest 2 into the game everyone is waiting for.\n So my verdict is simple: the core is interesting, but there’s no content. No point buying it now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its just repetitive boring Shtuff, if you like Diablo you gonna love it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They've made a pretty basic walking simulator. The map is so big that I'm tired of walking. Killing creatures or farming doesn't make much sense either. I don't understand why you repeated the mistakes from Titan Quest 1 in this game. The game is already slow enough...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h2] Can't recommend at the moment (November 2025) [/h2]\n\n[h3] Good [/h3]\n[b] Graphics. [/b]\nIt is beautifull. Very good contrast with dark fantasy Action ARPG like PoE, Diablo. Althought there are some frame drops, especially in town\n\n[b] Story. [/b]\nI generally liked it. Offcource after the first character I stopped listening to it, but for me you can't have a story good enough so i will listen to it on all me character :)\n\n[h3] Not satisfied with [/h3]\n[b] Locations. [/b]\nCompared to TQ1 feels empty and non-balanced (difficulty). Because of a difficulty I still can't go any direction i want because of ememy level being much higher. Which makes the \"open\" map basically linear. By the way, have no issue with linear progression. It worked very good for TQ1.\n\n[b] Playstyles [/b]\nIn my oppinion the good old TQ1 approach works wery good and it is something that I would expect from TQ2. The additionall modifications to the abilities extend the TQ1 experience a bit. But what would I also expect, is more deep integration between the Masteries. [b] For example: [/b] Combination of two Masteries opens skills that exists only for this combination or unlocks new modificators for skills. TLDR: I like the current system, but it seems evolved not deep enough comparing to the previous\n\n[b] Itemization [/b]\nIt's not enought even for an early axes. The current itemisation is really flat. When I open chest or killing an enemy there is a chance to drop an item with random rarity and random stats. Tast's it. The TQ1 system is also preety shallow, but here there is nothing to do with an item after you found it.\n\nIf you found a high tier white base, there is nothing that will help you to improve it. If you found the magic item with one good mod, there could be a white item with higher tier (and damage/defences) that makes you magic item useless. You found a decent rare? There is nothing to improve it and prolongue its utility. After a several levels it will be worse than some normal items.\n\nIn my oppinion the itemization at the moment should be the first priority for the developers. At least untill there is at least something.\n\n[b] Rewards [/b]\nThe rewards from bosses are ok, but there are not that much bosses right now. I am talking mainlty about the semi-secret paths with the chest in the end. They felt like a regular chests that I can see on the fields or roads. So I felt like my attention to details wasn't rewarded enough.\n\n[h3] Can't rationalize yet [/h3]\nIn TQ1 even after hundreds of runs it felt good starting the new character (even without the nostalgic fellings). Here already after third run I feel like the world is empty, although it might be much more comparing to TQ1 locations",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this game has a ton of potential, but it just doesn’t feel like there currently enough content to be worth buying at this point in development. Wish there was a neutral option.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I actually don't have anything against this game being incomplete as some reviewers - seriously why would you give thumb down for an early release not being complete? - but what I can't get past is the clunkiness and slowness of the game. Moving around with your character is not rewarding - you slowly plod through the landscape, as if through molasses, and when you hit something or cast a spell, it feels as if it the action was in slow-motion. If this is how it stays, I can't really recommend this game to anyone who likes fast(er)-paced gameplay - it feels like watching a YouTube video on 0.8. \n\nAlso, what I don't understand is why would you sink so many developer hours into designing a really, really advanced character creator where you can choose your eyebrows, scars (want them fresh or dated?), and the size of your character's head? Come on, this is top-down RPG - you'll never see your character past the character creator anyway - who cares about this stuff! \n\nI will come back to this when the development has progressed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I expected far better from Titan Quest 2, but the animation quality is shockingly outdated for a 2025 release. The character movement and combat are so stiff and unnatural that it feels like the team has unintentionally set a new industry benchmark, just not in the direction anyone hoped for. Honestly, at this point they almost deserve a special award for managing to ship animations this rough in a modern ARPG.\n\nEvery action, from walking to fighting, looks clunky, robotic, and completely devoid of fluidity, making the gameplay feel more like a struggle than an adventure. It’s hard to appreciate anything else when the core mechanics feel this off.\n\nUnless the animation get a serious overhaul, I can’t recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a slow pacing game and crushes during gameplay. I don't recommend. It's not worth the money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one of the most mid games i have ever played in my entire life. it's not terrible, not good. it feels like a pre-alpha game that has no business being in \"early access\" but early access is what game devs rely on now to bait money out of people. \n\nit's slow, runs like sh*t, has bland characters, gameplay, combat, progression, and customization. the itemization is as barebones as it could possibly get. there are no interesting choices to make regarding anything about your character, skills, stats, nothing. it's all just generic rpg slop. it has barely any content at all. i beat the entire game then went around killing bosses to get the same items over & over. how this is $35 is GENUINELY INSANE. it's worse than Last Epoch was 3 years ago... \n\nthis game has \"very positive\" reviews for 3 reasons:\n\n1) nostalgia\n2) video game addiction (consumerism)\n\nthat's literally it.\n\nmaybe in 3 years it will be a fun experience, but right now it's not worth $5 let alone $35.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "up dates are taking too long to be release, this game should have been release when complited",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the latest update, the game won't launch. A complete reinstallation of the game doesn't help. Updating the drivers doesn't help((",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very Early Access.    Crashes at startup often.  Lots of potential \n\nFun enough, in an at-release Grim Dawn sort of way.   Don't expect to zoom around, and the loot chase isn't a big part of the game, since it's hard to tell what the new gear is doing for you. \n\nI kinda like being part of the beta ground floor, where it's  bad session if you don't have at least one bug in the tracker.    If that's not your form of fun, chill until full release.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm playing on a Laptop, Here's the problem it's loading CONSOLE Only not PC CONTROLS Fix this or lose a lot of PC Players like myself who aren't interested in buying and using Gamepad! Don't become another BLIZZARD/BUZZARD ENTERAINMENT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I could never get multiplayer (co-op) to work even with help in discussion so I just gave up and got my money back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game before chapter 2 release was alright, if a bit empty (it's early access so not faulting them for that).\n\nChapter 2 feels rushed? fps issues are still there but recent hotfix seems to have mitigated like 70% of it.\n\nCollision with environment seems to still be an issue in a lot of areas (bug that existed since the beginning of the game is still there too with the jump markers at spots that are otherwise impassable terrain, still block player projectiles but not hostile npc projectiles).\n\nStill no idea if I'm just imagining it, but movement and reactivity of button presses feels somehow worse than it did before chapter 2 release.\n\nHoping things get smoothed out but right now it just feels bad compared to chapter 1 release (which I thought was great, and had me hopeful).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I didnt want to give this game a negative review, it looks and plays great compared to the first one and i loved the first one, i love greek mythology games, ive played the game till the first boss and killed it, i had fun but what kept me from enjoying the game further was the optimization, it wasnt lagging nor it had any frame drops but at capped 60fps on 1080p low settings with FSR or DLSS at ultra performance my fans were noisy like a jet engine, compare that to Path of exile 2 with which i play on medium with balanced FSR/DLSS at 1080 without problems, and that game had massive eye cancer with the effects and my RTX 3060 still took it like a champ, this game has a massive discrepancy on its optimization, even on the main menu my fans whirl so wild capped at 60 fps. being in town makes my fans go brrrrr, compared to its competitors which has better graphical fidelity it runs poor.\n\nplease please devs, i see the potential and fun of this game but if you dont optimize it for medium to lower range PC's it will kill your sales, greek myth is so great of a concept for an ARPG but an unoptimized UE5 engine just sucks the fun out of things, hopefully it gets better, i mean its still early access and i see the great potential it has but whats the point of it if it tries to kill your PC before you get the full experience?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Audio bug with constantly changing range and volume of music and sound in general is still not fixed since release. This only happens in this game, so I know it's not my hardware / software. Tried Steam forums and the community is just a toxic unhelpful cesspit of biowaste. Yikes.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}