{
  "positive": [
    {
      "review": "CK3 got me through COVID and 2021. This game is a must buy for anyone interested in history, strategy games, roleplay, conquering the world, making hundreds of children, pretty ladies, and tough choices!",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "[b]Crusader Kings III is one of the most polished and accessible grand strategy games Paradox has made, but the real depth shows up once you’ve spent a lot of time with it.[/b]\n\nI’ve played around 3,500 hours, and what keeps me coming back is how different each campaign ends up feeling. The role-playing side is stronger than in CK2, the UI is cleaner, and the game is much easier to get into — but it still has that familiar Paradox chaos where your entire dynasty collapses because of one bad heir. Some of the base game systems feel a bit light without DLC, but with expansions the game opens up a lot.\nIf you enjoy character-focused strategy and watching your plans fall apart in hilarious ways, CK3 is definitely worth the time.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "With a relatively feature-complete base game, a pleasant UI (ever so important for a menus game) and some fairly user-friendly renditions of grand strategy aspects even with achievement-eligible game settings, CK3 is possibly the most accessible that its Paradoxical kind have ever been.\n\nLargely due to the fact that it scales back any excessively inconvenient realism of medieval warfare, lest that get in the way of your court politics simulator too much. A perfectly acceptable trade-off, when it allows you to jump in and enjoy the absurdity, salaciousness and drama of the roleplaying side after simply watching someone play for a while. For this genre, that's downright casual.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very nice and addicting game. Playing with custom characters is very nice, forming your own dynasty and expanding borders or focusing on a smaller territory.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]SHOULD YOU PLAY CRUSADER KINGS III?[/h1]\nDo you like big fancy maps? Role-playing games? Game of Thrones? Because Crusader Kings III [i]is[/i] a role-playing game, played on a big fancy map, with all the violence, sex and skulduggery you would find in a mature fantasy novel. While it’s certainly an intimidating game at first glance, believe me when I say it’s well worth getting into, and after you’ll have grasped the fundamentals, it’s nowhere near as hard as it appears from the offset.\n\nDespite having played strategy games my whole life, I’ve never before tried out a 4X title with so much emphasis on the [i]characters[/i], rather than factions or races. You’re not a faceless commander with some vague backstory hinted at during cutscenes; you are a person, with their own looks, personality, sexual orientation and probably a spouse [spoiler](or two)[/spoiler]. Every power play is a natural byproduct of the characters’ personal desires, and the emergent political narratives are as intriguing as they are believable.\n\n[h2]SANDBOX HEAVEN | TONS OF CUSTOMIZATION[/h2]\nEvery game of Crusader Kings III is a stand-alone story of you, your family and the pursuit of greatness, whatever it might be. There is practically no limit as to what can you do within the context of its setting. Can you start a dynasty as a eunuch? How about conquering Europe as the pagans and overthrowing the Church? Maybe create an empire without waging a single war? If you can think it, it’s probably possible.\n\nDespite the ‘grand strategy’ label, CK3 plays a lot more like a role-playing game, only [i]with[/i] strategy elements. Befitting an RPG, there is a character creator, which could give ELDEN RING or MONSTER HUNTER a run for their money. You’ll customize your coat of arms with hundreds of adjustable icons, pick a drip for yourself & your family and rename almost anything within your sphere of influence — lands, castles, cities. Later you can even [b]create your own religion and fine-tune your laws and traditions to a ridiculous degree[/b]. More on this in a moment.\n\nEvery character has their own subset of physical, mental and fame traits, and [b]all of these have a tangible effect on the game[/b]! An ‘arrogant’ character might be unlikeable, but gains additional prestige per month. Gluttonous characters are fat and less attractive to the opposite sex, but lose stress more easily and are harder to poison! Whether you want to be benevolent or tyrannical, righteous or conniving, beautiful or hideous, everything comes with a trade-off, and even unorthodox ‘builds’ are surprisingly effective.\n\n[h3]Don’t worry about stats – just be yourself and follow your heart![/h3]\nMaybe your character is a bad diplomat, but their ability to make money allows them to bribe their way up the cursus honorum. Maybe their only redeeming trait are their looks, and you could leverage that to seduce someone important. Whether you prefer overt or underhanded options, the choices are nigh limitless and your own emotional investment will dictate how hard or easy the game ultimately will be.\n\n[h2]Pacifist-Friendly[/h2]\nOne thing that usually prevents me from taking role-playing in video games seriously is the lack of non-violent means of solving problems. Most RPGs are ultimately about killing enemies, gaining more power and seeing your avatar grow. While there isn’t anything wrong with it, it can limit the scope of what characters can you come up with, since they narratively have to make competent fighters.\n\nIn Crusader Kings, there is practically no limit as to what can be accomplished without bloodshed. Through clever use of diplomacy and intrigue, neighbors can become your allies and foreign rulers might give up their independence, if you can guarantee strong leadership. By focusing on your court and family, you can turn your kingdom from a squabbling patchwork of hillbillies into a tightly-knit collection of counties, all owned by your friends and relatives. [b]Stripping my subjects of their titles, so I could hand them out to my daughters made me feel more powerful than if I had commanded an actual army[/b].\n\nThe sheer breadth of non-violent possibilities makes me wish more 4X games focused on fleshing out similar systems, instead of combat.\n\n[h3]Down With Patriarchy![/h3]\nHell, if you are a staunch feminist like myself, this is your chance at building your matriarchal utopia. You can enter into a homosexual relationship, adopt a child and have that child become your heir, without ever getting pregnant yourself!\n\nYou can even abandon Christianity and create an utterly debauched, incest-abiding sect that approves of murder, cannibalism and adultery. If you want, you can plunge medieval Europe into a hedonistic hellscape, where witches are saints, priests can become army commanders and cardinal sins like lust or gluttony are virtues. It’s like being inside of a Slayer song, and it’s awesome.\n\nDespite having both ‘crusades’ and monarchy in the title, Crusader Kings III is probably the most—and I’m using thick as balls quotation marks—[b]”[/b]woke[b]”[/b] strategy game I’ve ever played. You can go along with patriarchy if you want, or you can castrate every single man in your kingdom, deprive them of political rights and have your sorority of queens rule Europe.\n\n[h2]HOW TO PLAY[/h2]\nParadox games can be tough to get into, so here’s a quick tutorial.\n\nFirst of all — this is NOT Civilization. You won’t build cities, conduct research and build the biggest army ever. You always play on the map of Eurasia and historical events will take place during your playthrough. Your choice of a starting location will determine a lot and it’s what makes each game so special.\n\nEach character has six [b]ability scores (“skills”)[/b]: diplomacy, martial, stewardship, intrigue, learning and prowess. There are five talent trees (“lifestyles”) from which you can pick different bonuses, depending on what do you want to accomplish. You needn’t stress over this – simply put points into whatever sounds the most interesting to you. [b]These don’t matter nearly as much as you might think[/b] — different skills make accomplishing certain tasks easier, but any path can be viable. The game will accommodate even the most oddball of characters, provided you know how to play to their strengths.\n\n[b]Number one thing to do at the start of each game is to stabilize your realm[/b]. This means checking that all of your subjects either like you, or are too terrified to openly oppose you. You can befriend, bribe or even imprison characters, and also summon new ones to replace existing ones. (Just press C, set diplomatic range to ‘Inside’ and invite someone to your castle).\n\n[b]Always read notifications at the top of the screen![/b] The game will tell you exactly what needs doing as you go along. You can [b]click the mouse-wheel and move your cursor over the tooltips to read up on anything highlighted in blue[/b], without ever having to open the wiki.\n\n[b]Number two thing is getting married.[/b] Marriages create alliances, and having a strong ally means you can go to war against a neighbor you wouldn’t conquer on your own, so marry wisely. Don’t marry for love; marry for an alliance! The game can go anywhere from here on out, but you will learn other things organically as you go along.\n\n[h2]CONCLUSION[/h2]\nAll in all, Crusader Kings III is a game I cannot recommend enough. It proves that learning how to play can be a true art, and that you don’t need a big bold victory screen at the end to feel accomplished.\n\nParadox have always been masters at letting players make their own fun, and the sheer dedication to making such deep, intrinsically motivated experiences is a testament to what can strategy games really be. Whether your ambition is to rule the world, or just screw around and become an utter menace to society, CK3 will be tons of fun. You can also comment or add me if you have any questions!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well Ck3 is many things, Laggy, addicting, annoying, but one thing that it is not is bad. Crusader Kings Three has two types of players people who play tall and people who play wide, (and new players who try to play wide and fail horribly). If I could give one bit of advice play tall trust me it works.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Typical Paradox game – lots of DLC, which has its pros and cons. Grand strategy game where player control character/dynasty create bigger chances of RP or creating amazing/absurd scenarios. The game itself is also a platform for many lesser or greater mods",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "With the new DLC I feel I got back what I loved in CK2, the republic and personal estate.\nThe game might look daunting for the first time but play it as a rogue lite, die a couple of time and use the experience to start anew.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AGOT mod best thing ever, also the game is better then ck2 in some aspects.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fucking addicting, especially love starting Viking, going to another land and impose my Norse ideology on them\nAlways fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's one of those games that I always enjoy coming back to because it keeps getting better with every update and DLC. The depth and stories that i've made capture me year to year for hours, even with the base feudal systems and basic map locations could use a refresh to match the new DLC standards. Still, it remains one of the most enjoyable sanboxes, specially with mods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game. The freedom to do more or less anything during the dark ages and shape your legacy to your desires. And not to forget the amazing modding community. Be it Game of Thrones, Lord of the Rings or Warcraft. Dive into your favourite fantasy worlds",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Smooth gaming once you pass the early learning curve. Excellent game. Huge replay value, and devs are always actively working to improve game. Learned 10 languages, had 10 kids to secure the bloodline. Very fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I rarely play more than 2 generations. If you become a King or Emperor - there's nothing more to do in the game. The game is a joke, and you need to treat it as one. The AI is an absolute shitshow. Never trust a liege, even if he's your brother and/or friend. Never trust an ally. The game is actively working against you. Your perfect heir will not make it. If you like maps you'll spend a lot of time in this game. Lots of fun mods",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Lots of content, great mechanics, immersive gameplay. Love it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can't borrow money from Jews and then immediately expel them to cancel the debt. 0/10 for realism.\r\n\r\nCan seduce the pope though.\r\n\r\n1/10 for realism.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In this game, I can do things that I'll never be able to do in real life.\n\nBully others.\nBe financially stable.\nHave a wedding.\n\n10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Crusader Kings III is a grand strategy game developed by Paradox Interactive that focuses on medieval dynastic management rather than direct empire control.\n\nGameplay centers on ruling a noble house across generations. Players manage politics, warfare, religion, and personal relationships, balancing power through marriages, alliances, and intrigue. Every decision affects the stability of the dynasty rather than just territorial expansion.\n\nThe character system defines the experience. Each ruler has distinct traits, skills, and personality-driven behaviors that shape events. Choices such as marriages, betrayals, and education determine succession and long-term legacy, creating emergent narratives rather than scripted campaigns.\n\nMechanically, it improves on Crusader Kings II with a more intuitive interface, detailed 3D character models, and streamlined management systems. Military control, vassal relationships, and faith customization are more accessible while maintaining depth for experienced players.\n\nThe visual presentation is refined. The world map is richly textured, with realistic terrain and smoother animations. Events feature dynamic illustrations that match tone and context, giving each decision weight and clarity.\n\nSound design supports immersion through ambient music and environmental audio. The orchestral score shifts between peaceful and dramatic themes, reinforcing the atmosphere of medieval politics and warfare.\n\nOverall, Crusader Kings III is a complex but well-structured strategy simulator that prioritizes storytelling through systems. It transforms political management into personal drama, rewarding patience and long-term planning. It stands as one of the most complete and replayable grand strategy titles available.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my friends hates the multiplayer because it turns into a seduce his whole family speedrun. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Some of guys \"Not recommend\" but 50+ hours on record.\n\nJust like they not recommend KFC but eat everyday.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Usually takes my day—and wallet—away if I get around to playing it, but at least it's worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun game, but some things are just ruining the feeling of being in a real world. Today I played Tamara of Georgia and I was married to a family member ruling another realm outside of Georgia. He decided to attack my father for a province. The father of his wife. I just don`t get it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game to sit down for hours and plan long term for your kingdom. Don't go into this expecting to 'win', just set personal conditions and enjoy the fruits of your labour!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, what i love so much about this game is that you can play with your own ruler and make your own legacy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game made me fall in love with a whole new genre (grand strategy) which i didn't know that i could enjoy this much. it's also amazingly well-crafted story generator and role-playing game at the same time. perfect starting point for anyone who's curious to give these types of games a shot!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Create, explore, expand, conquer\nI came, I saw, I came, I saw\nI praise the Lord, then break the law\nI take what's mine, then take some more\nIt rains, it pours....\nIT RAINS, IT POURS!!!!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been wanting to buy the whole collection for a long time since it's a type of strategy game that I enjoy. I think it's very much worth it to get all the DLCs for the maximum experience. After trying it during the free play period, I'm surprised to see it even has the Southeast Asian region where I'm from, especially my country. I'm totally buying this once I have extra funds to spend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, best of its kind. But needs more patch to fix bugs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "5 minutes in and the game asks you whether you want to marry your son and daughter, 4 hours later and you have restored the byzantine empire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has 600h in Hoi4 300 across the vics at least 150 in euIV-V and more still in other map games, This is probably the best paradox game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crusader Kings 3 is a great medieval game. The main goal of the game is more about role-playing and enjoying the medieval world. You can wage wars, create religions, engage in forbidden relationships, or be a ruthless killer and mercilessly murder your wife, child, or prisoners. In short, you can experience in this game many things you couldn’t do in real life but wanted to. What more could a person want?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game you can spend 10 000h playing. I wish it was more like Imperator Rome, but that is just me wishing Imperator Rome would be worked on instead. I will try to make my own mod, to change this that I find need adjusting, so that I can spend even more time playing the game. Performance is an issue, the game stuters, and lags when you zoom out and try to look what is going on around you. Performance drops when opening menus like council etc. So it has issues that need to be worked on, it is a strategy game without crazy graphics it should at least have a stable 60 fps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just realized i havent reviewed this game after 500+ hours lmao\r\n\r\nit's very good, and the mods are absolutely insane. if you're into any sort of fantasy or historical setting like AGOT, LOTR, Elder Scrolls, Ancient Rome, etc, etc, you'll have some absolutely fantastic conversion mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really do enjoy the strategy of the game and the fact it lets you sort of play in a sandbox manner.\r\n\r\nI quit playing RTS games competitively a long time ago because they often get very toxic as well as it being sort of a test where the person who is able to perform more inputs more quickly wins which I don't particularly enjoy. This doesn't have this issue at least though and you can play in a purely cooperative manner. Also the AI grants a decent challenge for me at least which is nice too, although granted I've not played enough to be anywhere close to good at the game lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "judging by the fact the last dlc added japan, i wonder when the world map would become spherical",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive, engaging, obsessive-compulsive harem simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have not experienced a game that feels more like a proper Game of Thrones game than CK3 AGOT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that tells the story of your dynasty. Currently playing a wandering samuri raising an army to have their lineage rise up to emperor of Japan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sicuramente tra i migliori gestionali in circolazione. La profondità e la personalizzazione sono una firma unica.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest medieval strategy game out there, so many different and unique playthroughs you can do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recently revisited the game with the All Under Heaven DLC being released. There is a new tutorial which has the player explore the introduced mechanics of navigating China's meritocracy. My character sat for 2 exams and assisted with 3 others and it was concerning how often I got repeat story/event encounters. I think the development team would have done well to flesh out the variety a player experiences around these exams as they are THE major barrier to your character advancing in the merit system. It also didn't help that the travel encounters which triggered when my character traversed the realm were the same old repeat ones from prior DLCs. Still I am looking forward to seeing what becomes available as my character continues to ascend in status. Also, I'm excited to see what has been introduced into the game with Japan and other nations in the region.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the type of game, and have the patience to learn the mechanics, CK3 can be a deeply immersive and brilliant game. So many stories to tell!\r\nIt's not the most intuitive game, so play the tutorial and be prepared to fail multiple times before you get the hang of it. If you do, you'll be rewarded with a rich, dynamic historical sandbox. The depth of the character interactions, the unpredictability of historical events, and the ability to weave your own family saga across centuries makes every playthrough unique.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good laid back strategy game, that keeps being fresh with the updates and DLC from the dev team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Way back in 2020 I played this game way too much and when I tried to explain what I'm doing to my housemate she ended up calling it the \"medieval baby murder simulator\".\r\n\r\nSee, I can re-establish the Roman Empire, found a new religion based on gender equality, travel to far off lands to learn exciting warfare techniques, have a secret homosexual affair with my steward, commission a great piece of art. But no, you imprison, torture and execute your 6y/o nephew once...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is real fun and kinda addicting. Making custom people is nice, and you can make your own family and take over stuff or just chill with a small area.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the desire of most to paint the world in your nations colours and bulking to the fullest extend, I would rather describe this game as Sims with \"different\" options.\n\nThere are too many personality traits and vairing factors to only see this as medival conquering, even tho it is also fun to shoot your cannons end game. \n\nEven tho it has alot of DLC`s, I think only a few like the viking, the warden and the Roads to Power once are truelly essential. Vikings, if you are interested in the north (which most are), Warden because you get more family interactions and Roads to Power cuz it increases your survivalbilty by not just going to Game Over once you lose your lands in an unwise war but instead makes you homeless; with hopes of getting land back once again.\n\nAnd no, I`m not just writing this because I nominated this for Steam Awards, what a wretched accusation that would be >:(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played Crusader Kings 2 years ago and was absolutely obsessed with it, but I always wanted more out of it. CK3 is a wonderful continuation of the franchise, if you enjoyed CK2 you will love Ck3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crusader Kings III has grown a lot since I first played it on release when it did not provide much of a reason to choose it over its predecessor. With the addition of east and southeast Asia as well as 5 years of post-release development CKIII can finally stand beyond the long shadow of Crusader Kings II, and though I have my doubts CKIII will ever be able to truly eclipse CKII it has proven it is worthy of standing alongside it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most user-friendly Paradox game out there. The mechanics are very easy to learn and the game itself isn't too difficult as long as you have knowledge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love CK3. It is probably my favorite paradox game. Every game is unique, and there is so much going on. But what really makes CK3 stand out is it feels like the world is alive. Each NPC has their own agenda and does their own thing. Other grand strategy games kind of feel empty by contrast; the enemies just kind of exist without really interacting in a meaningful way. With CK3, I enjoy the personal touch as I'm being backstabbed by my digital offspring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an alright game. I can't endorse the tons of worthless DLC, though, I wouldn't download any of it myself. But, the base game is pretty fun, albeit annoying, with plenty of nonsensical bullshit moments. It's better with mods that allow you to adjust the difficulty and things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It'd be between this and Stellaris for most accessible/least intimidating Paradox grand strategy title---the menu system is a lot more comprehensive, it's almost like an RPG or The Sims in terms of focus on characters. A very good place to start if you're interested in but haven't tried this kind of game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for strategic as well as goofy gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very enjoyable game, a steep learning curve but many different options to rule your Dynasty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good, strategic game, lots of elements to take in while you play.. Fun if you want to play for a long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great gardening simulator, in which you garden your beautiful family bush into legendary status. I have restored Rome, subjugated the great Khan and revived a dead religion all in one sitting. Think you are a powerful emperor? Come meet my 10,200+ inbredded cousins across the empire who will flood me with infinite influence and reknown. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For all the hate Paradox gets for releasing DLC upon DLC for this game, I can still say that this is a fantastic game. There is a reason why it was my choice for the Labour of Love award. I think the support it has continued to receive is a good thing, and the continuous release of DLC only expands and keeps the game alive.\n\nI can, of course,  criticise the prices these DLC have, but what difference is there between their prices and any other game or DLC today? Almost all of them cost the shirt of our backs.\nThis game was larger than Crusader King II was upon release, even if it wasn't bigger upon release than Crusader King II was after the latter had expanded. Since then, it has grown to become just as expansive and even richer than its predecessor, and also way more balanced, so I consider my money well spent on these DLC. There are few games I've put this many hours into, which is due to its rich content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Start as a count. Fight neighboring counts to become a duke. repeat until king or emperor. Give seats of power to loyal vassals who love you more than life itself. Die a honourable death at age 84. Play as heir now. You are despised by all your vassals. you fight the rest of your life putting down rebellions. die. play as heir. repeat...\r\nGenuinely would call this the best game I have on steam.\r\n+ Awesome modding seen. Would recommend playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well what can I say.\nI have had this Game for years now and I always get back to it.\nForging my own kingdoms, creating my own faith, reviving fallen empires are the things I enjoy the most about it.\nIt has much depth and gives you the freedom to do what you want (if it works out of course).\nYou want to kill the King of France, or rather seduce his Queen you can do that.\n\nTo be fair many mechanics are behind the DLCs so I recommend the game but I would wait to buy the DLCs when they are on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, great mods available, Pretty good DLC's so far as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I put off buying CK3 for about a year, unsure about jumping into a new franchise at full price. Now it’s one of my favourite games, and the Paradox title that pulled me into Hearts of Iron and Europa Universalis afterwards.\n\nCrusader Kings III shines through its focus on characters, diplomacy, and dynasty-building. Every campaign feels unique, whether you're expanding through warfare, forging alliances, or preparing your heir for the throne. Compared to Paradox’s other grand strategy games, CK3 is far more personal and politics-driven, and that’s where it excels.\n\nThe game is consistently supported with major updates and expansion packs. They can be pricey, but the quality is absolutely there. Mod support is excellent too, with everything from simple quality-of-life tweaks to full conversions like Game of Thrones and Lord of the Rings.\n\nIf you enjoy deep strategy, storytelling, and shaping the fate of a dynasty across generations, CK3 is absolutely worth picking up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great historical simulator for any kind of feudalistic governance gameplay, especially considering the fact that it takes into account the fact that there is was an interplay between an individual as a person ruling and what they represent as the ruler of one or more places (that all have their own histories and laws associated with them).\n\nThe game does lack some crucial features and moments, like the whole Catholic Church balance that rulers had to contend with or being a member of the church as a ruler (like a bishopric); but, some of these can be implemented by modders (still wish Paradox did it though).\n\nWhile the game can get repetitive and boring, at times, it is still enjoyable for the times I have played it. It is just like a two week Minecraft phase, if you get the reference.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Out of all of Paradox's games its the easiest to get into. I just wish the DLC's weren't so expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Be honest I love this game so much, It can let me experienced various historic moment happened in the past",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Paradox did really well with this one. Having the whole map including Japan is amazing.\n\nThe stories you can tell with this game are so fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "55.7 hours of this game and I still don't understand 90% of the mechanics. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not sure if it's as good as CKII, it relies heavily on the 3D avatar to immerse you in the story and less on the event narratives, but definitely a good game and paradox experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can actually die from cuteness overload in this game\nOr you can die from laughter, after having heard a joke from your jester.\n10/10 realistic historical death simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy this game. It is very much like its second installment, in the sense that there is always something new whether it's DLC or mods. I find myself coming back to this came constantly and enjoying it more and more each time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun. I'm playing the tutorial as Petty King from Ireland and I can't get off this Scottish King from attacking me. I will not rest until I get enough army to beat his ass!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome. Love it, it really captures the vibe of managing your realm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so Crusader Kings 3 is basically a medieval soap opera you control. Seriously, it's all about family drama, plotting, and trying not to get assassinated .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best strategy game ever. You can never be bored from this because its never the same. So many possibilities it is insane.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun, engaging, bizarre.  Loads of replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, one of my favs.\nHowever, the whole DLC-thing is very confusing.\nI don't get what to buy for the complete experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game, the content updates (well, most of them), the mods. \nEverything makes it potentially eternal. Until the day a CK4 is released, of course.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a CK game, in all of it's buggy, unoptimized mess.\r\n\r\nBut its my mess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, with many different things to do. It becomes very customizable with mods, and has several total conversion mods to choose from.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is utter peak although I originally had a problem with my ram so I couldn't load the game right but other than that utter peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Utter perfection in a game. DLC that is paid for (some free ones that have been brilliant!) but genuinely adds to the game, but the base game is good enough to keep you hooked for years before you'll need DLC. The learning curve is both steep and heavy but oh so worth it! Enjoy!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Paradox game to this date.\nEven though didn't enjoy the asian DLC \"all under heaven\". \nThe rules of the game were great but the ones now imposed if you want to play China or Japan aren't any good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has everything that I want in a game, resource management, trade, city management, politics, culture, economy, council, military, character personalization and growth, relationships (familial, friendships, rivals, love etc), genetics, generational planning / scheming - which is probably my favourite part and of course, murder, kidnapping, extortion, tourture, as well as tournaments and weddings (bloody weddings too). 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing simulation game with expansive opportunities, fun with friends when the connection works (which I will admit isn't always). Still a fun game and the new DLC All Under Heaven is really amazing and adds incredible opportunity to the Eastern side of the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of my Three Addictions on Steam. Mods are fun, especially when you have a good playset mostly up to date. The All Under Heaven expansion was a longtime coming, I am however greatly dissappointed that Oda Nobunaga and the other two of the Three Great Unifiers of Japan aren't a starting bookmark for the Expasion. \n\nOverall, the best and most critical Expansions to get are Northern Lords, Fate of Iberia, Tours and Tournaments, Coronations, Legends of the Dead, and the Wards and Wardens DLC's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "basically game of thrones but with some random map idk what it is. Love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game and I hope in the future to support the Arabic language",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got hooked into paradox's main style of games via family share of hearts of iron 4, and this is probably one my of favorites, paradox may be greedy, yes, but they are a company, they still need to pay their workers and those employees still need to feed themselves and/or family, i love the in depth feel of ck3, and having your own character to visibly play as is quite fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game! a little laggy but that might just be my computer, Would Rec.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crusader Kings 3 is like a drama series. There are character-driven plots, interesting storytelling, and intimate relationships. You engage in political scheming, arranged marriages, and the pursuit of power. Unexpected events, characters' personal traits and psychological stresses will suddenly change up your game when you think you are in peace. Your playthroughs become legendary medieval stories you can tell your friends about!\n\nNote to all: Try not to get assassinated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-Play as any germanic state in 800s\r\n-Eastern Frank splits\r\n-France makes HRE by overrunning Eastern Franks and middle ones\r\n-Revolt against Bavaia with HRE\r\n-lose \r\n-play as Grand daughter in israel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Out of all the Paradox games CK3 is my most played. There are a couple things from CK2 I wish they would bring over to CK3 though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, it has its goofy moments but its a cool medieval sandbox experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion, this is one of the most interesting political strategy games ever made. The atmosphere is outstanding, the music fits perfectly, and the graphics are lovely for a game of this genre.\n\nIf you're looking for a strategy game that focuses more on political depth and decision-making rather than just constant battles and sword-fighting, this is the one. I'm not saying the war mechanics are bad—far from it—but the core of the game lies in governing, diplomacy, and managing your nation, rather than simply rushing to conquer everything like a careless child.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Build greatest dynasty known to man\nHave 30 kids to rule every known corner of your land\nCharacter dies of pneumonia after traveling because you just had to go to that feast\nremember that u forgot to change your succession laws\nYour next player character inherits a small piece of your large kingdom and instantaneously all your siblings start fighting eachother\nalso die to pneumonia 10 days later\n11/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spend 30 minutes checking out every single character in the world and how they are related to every other character in the world. \nSpend 20 minutes playing the start of the game.\nRealize that your culture does not have temporal revocable clergy. \nGo back to main menu.\nDelete your saved game.\nGo to start date.\nSpend 30 minutes checking out every single character in the world and how they are related to every other character in the world.\nRealize that you actually feel like playing another character now.\nSpend 30 minutes checking out every single character in the world again and how they are related to every other character in the world.\n\nI have over 2k hours in game and I have only played three generations of about two different characters. \nI have loved every second of every restart and new beginning.\nAmazing game in so many ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game where i can modify every aspect from my realm, my religion to my genetics. Yes please. or maybe i just love using many many hours watching maps change.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of the best games I've played, even without all the DLC, it's very good. Playing with mods in CK3 is also very easy and enjoyable. I recommend this game to anyone who wants to start a family in a medieval hierarchy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like incest simulator with random events that destroy your latest favourite inbred , and i love it .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sophisticated game for intellectual and squeaky individuals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CK3 is probably the easiest entry point to Paradox's lineup of grand strategy games. There are still many systems to learn, and once you have mastered them (it takes an investment of time to get there), the game can start to become a bit stale. Luckily, Paradox continues to release updates and expansions on a regular basis. Not all the DLCs hit the mark, but it's enough to keep me coming back to the game year after year.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The team needs to take a break from new content and spend time being custodians of the game they've created. The old DLCs need to be polished and brought up to the current standard, they need to fix the near-constant desync'ing in multiplayer and take a hard look at the current state of the game before adding new content.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Constant crashes with a godly PC, I have built computers since 1999. I own a computer company, also have 260 clients... game is buggy as hell multiplayer is unplayable single play you better save every 5 minutes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I do enjoy the game, but after the most recent update it keeps crashing after like 10 minutes of playing. Never had this problem before.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I know it's weird to write a negative review after 400 hours gameplay, but this is an honest final rant after a very long struggle.\nBasically I could like this game, if I ever had the chance to build any empire or family tree, but I wasn't able to, generally I could not play a character longer than one generation.\nWhy? Because for a mysterious reason this is a game which is patched frequently, and each patch destroys the current savegames. They can no longer be played in the new version, they become 'invalid', the game warns you they could be corrupted, and indeed they crash when you load them anyway.\nI've never seen a game construction like this in other games. In other games, however frequently patched, the already existing saves remained perfectly playable. Not in Crusader Kings 3!\nToday, I tried to start my 1.17. version Save in the 1.18 version, no way. Crashed. I tried to go back to Beta 1.17, no way. My mods are already 1.18, warning me not top play 1.17 anymore. Crashed again. So the only path for me (as always during my past 400 hours gameplay) is starting a new character again. From the start. In the game version.   Until a new patch (within weeks) destroys my savegame again. I have had enough.\nI don't recommend this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The new expansion has made the game unplayably slow on macos - or, anyone not using the DX11 renderer, according to the forums.\n\nI realize we're a minority of the userbase, but we also paid to be able to play the game. Paradox's apparent indifference to testing on all platforms they allegedly support - and for which they're still happy to charge just as much money - is really disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is oddly one of the only Paradox games that I think has gotten worse over time. With the latest DLC, it’s pretty clear what direction this game is going in. Paradox seems to think that releasing more and more DLC, adding new features in hopes of making the game more interesting, will somehow fix the core issues that still plague it. Unless you’re specifically interested in one particular region or scenario, each DLC basically adds nothing. The content added to Asia, Iran, or Iberia doesn’t connect to the mechanics in other parts of the world — it just adds more bloat.\n\nWithout going into too much detail, this game has just become boring. I look at a new system or mechanic, play it maybe twice to learn it, and then I’m able to complete my goals in one lifetime with almost no resistance. Each DLC adds more things that buff the player but don’t affect the AI, since it can’t manage the new mechanics properly. Unless I intentionally limit myself, every character — no matter their skills or traits — can become a conqueror and form a massive empire in less than 40 years. This game has become the epitome of power creep.\n\nMaybe if this game focused more on actual gameplay instead of trying to find a new gimmick to market a DLC around, I might consider recommending it — but that ship has clearly sailed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The multiplayer in this game is currently broken because it will desync repeatedly after playing for a certain amount of time. This is apparently an issue that has been happening for years and has not been addressed. So if you're planning on playing with friends, avoid this game until this gets fixed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is really good but has so many stupid inconveniences and you need mods to make the game not a miserable experience. For example, if you are a target of a great holy war, you're land, the game will randomly select a vassal of yours as the main target. So all you're allies will be digging in their butts whilst you try to fight the enemy because the random vassal is fighting his own wars. And you lose the war. I do not understand why the game has to do stuff like this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In classic paradox fashion, the game I bought to play with my friends does not work in multiplayer, do not buy it if you want to play online with your friends.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I give up ... be trying to play this game for 4 months now ... with no fixes or patches that have worked. It was a great game ... some tweak made it better others made it worse. Now i can't even boot up the game.  Over 65 days of actual real time played and now i can't play the game ... just sad :'(",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Agh so, The game updated, And I lost a 40 hour save, and I can't revert the game, That's fun, Good one Paradox as always you are walking damaged goods, How to fail at giving quality service to your gamers, So many companies allow you to revert updates, Or give you a warning trying to resume your game ability to switch version where your save does work, \nBut you don't you, This is even with your YEARS of experience yet newer developers code better games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't run well on Linux (ARCH), been trying with proton and the native build, changing render, everything. I do have the recommended config for that game, maybe it's wayland related but yeah it's important to know that because I'm not the only one going through that apparently",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Out of sync simulator since the last update. MP is just unplayable at this point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unacceptable for a game with Native Linux compatibility to run so poorly it is better to run the Windows version through Proton.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is great when you get it to load; oftentimes you get stuck with unacceptable loading times, if it loads at all, and it gets worse with every new patch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm going to keep playing this game because I'm sick in the head by playing in 2025 the UI is just absolutely atrocious.  You move your mouse a single inch, (or 2 cm for the lames) and you get blasted with 2 menus about someones family history, an option to scheme, a marriage proposal, all wrapped up in a declaration of war.  The game itself is not confusing and very easy to learn they just completely dropped the ball to making it actually digestible.  All in all, just buy the base game do not give them anymore more money they do not deserve.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Incredibly lacking in economic tutorial so you cannot focus on the other portions of the game because you constantly run out of gold before competitors destroy your and your lands.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Epic. Complex. Philosophical. Boring. I had high hopes for this game and it sadly just doesn't deliver. The player can expect to be making the most redundant and tedious decisions whilst trying to expand one's power and territory in an unworthy interface with constant interruptions, awkward controls, and a notably long load time. No epic nail-biting battles here, no last minute desperate decisions that snatch victory from the jaws of defeat, just expect to be asked to name your fourth daughter and then appoint a new horse master in the middle of watching your troops march into uninteresting representations of battle. Ambushes and surprise attacks are absent, as well as fortification infiltration. You can't even toss the ol' diseased cow carcass over the castle wall. The attempts at realism are noted, plagues and all, but simply don't add up. From a historical standpoint, On the rare occasions that medieval armies met face to face on the battlefield, the battles typically didn't last for weeks. The odd placement of women in leadership roles outside of domestic management is a little weird, but plausible (I guess) in a contemporary politically correct way. Seeing the intricate paintings on the load screens loaded with women present during the war council meetings makes me cringe. The emphasis on plots and assassinations merely subtract from the escapism and dissolve any real fun or attempts at pixelated glory. As the hours go by, one feels more like the game is controlling you rather than you controlling it. \nAs the player files endlessly through text message after text message, list after list, making appointment after appointment, this game will interrupt you with even more decisions that are occasionally interesting and provide a stimulating backdrop narrative for an otherwise boring experience. It's almost as if someone removed all the guts and glory of commanding medieval armies and economies and replaced it with constant paperwork and choose-your-own-adventure paperbacks. The player must spend significant amounts of time analyzing statistics and dossiers before putting together a strategy that doesn't seem to do much or amount to anything resembling profound amusement. Despite the appointments, ransoming, plotting, diplomacy, and hostage/subject exchanges the player has little control over the characters and the overall game environment. Don't expect to really be able to accomplish much outside of the historical context (that ain't no fun!). Be sure to join any Crusades and/or Jihads that pop up every now and then, they are the key to attaining wealth and power as the game title insinuates. \nThe RTS nature of this game feels out of place and the player will often have to speed up time to make something happen. A turn based style might have served better and provided more balance. The pause button is useful, but after a while it feels pointless to unpause the lack of action and continue to simulate the most boring and tedious aspects of being a medieval ruler.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the addition if the rest of asia made the game very hard to run on lower end computers\r\nseeing as a lot has already been done to optimize the game, an option to disable some parts of the world would be greatly appreciated as not every run is aiming to conquer japan with asturies",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wish I could say positive things about the game, and of course I could, but I can't even play it! I have over 700 hours in this game, so obviously I enjoy it, but since the newest update, I can't play past a specific date from when I load my save. The game crashes no matter what I do.\n\nDevelopers, please, PLEASE fix this. I've obsessively checked the forums and seen that you're aware of this issue, but still nothing has been done to address it. This bug makes this game impossible to play. I cannot recommend this game in the unplayable state it is currently in for players as misfortuned as I.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've had it with this game after years of repetitive gameplay. I find myself playing the same campaign with a slightly different coat time and time again. Both wide and tall playthroughs I find myself ending the game within a generation or two of achieving the main goal of my campaign. The occasional decent dlc paradox drops usually adds only few hours of decent content before I feel I'm playing my average Cornwall or Bohemia playthrough with a new coat. It's been five years and paradox is still filling the void that is crusader kings 3 with overpriced dlc's. This game offers little to no late game content other than fighting the mongol empire or forming a hegemony. The release of various new governments has resulted in the five base game governments to be forgotten and never expanded upon. Maybe Paradox will one day finish this game, but it will likely take several years of extra dlc before they finally retire this game and release another empty Crusader Kings entry. I personally don't see myself playing this game again even when that day comes, because it is has already been way too long since this game's release for it not to be finished.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is very little \"Grand Strategy\" in this game, the core of the gameplay is playing Game of Thrones, assassinating and sleeping with whoever you fancy, in order to further your goals and power.\n\nAll the \"systems\" tied to the social, economic and military history of the period are dumbed down and only function as a mean to play The Sims : Medieval Edition, which is what this game really is.\n\nMaybe this could be fun, but the gameplay is mostly you dealing with countless pop-up events that are as as annoying to read as they are boring to react to.\n\nA true disappointment of a game, and unworthy of its predecessor Crusader Kings 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crusader Kings 3 is definitely one of my favorite games of all time, if you like history and administration this is your game, the perfect singleplayer medieval strategy/simulator, however there are a major amount of problems within the base game, which is the main reason i'm gonna give CK3 a negative review. CK3's Multiplayer is simply unbearable, some base mechanics simply don't work in multiplayer and are EXTREMELY bugged, even without any mods at all, which shouldn't be the case, playing tours, tournaments and other activities is extremely difficult when you can't stop clickling when events start happening and you can't track them all when time is not paused, which happens in singleplayer and not multiplayer, also missions are extremely bugged when you are an adventurer, so you can't play a game as adventurers with your friends without bugs starting to appear and missions and caravans bugging a lot. The sudden crashes and incapacity of playing even in 3x speed makes the game torturously slow, it almost feels like (which is probably the case) they don't test the new mechanics they add on singleplayer on multiplayer at all, this negative review is also because of predatory dlcs such as the Coronations DLC and other very basic dlcs they could simply add as updates but instead they decide to make us buy unfinished and unpolished content, the new dlc that increases the map size and add China, Korea and Japan probably contributes for that, the game barely starts and bugs may randomnly appear, and when they do you have to quit the game and host once more. So if you want to but CK3 to play by yourself just buy the game and knock yourself out, however if you have a friend that wants you to buy to play multiplayer i strongly suggest you not to, the best multiplayer mode of paradox games imo is Stellaris, but when it comes to CK3 you are basically playing russian roulette.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a vet of ck2, I disliked a lot the initial state of ck3 during 2020-2023, game didn't really launched propperly until 2024, and this year 2025 they're still adding stuff that was present in ck2(coronations) and some OK, some half-assed new content (AUH)... But they're still missing many key mechanics of ck2 that would've easily fit ck3 by now: Republics, societies/monastic orders, historical bloodlines, trade routes,...\n\nSome mechanics are better in ck3, but not all of them. The only features that I would agree that warrants the upgrade is not needing Ironman for achievements and that they FINALLY made the character editor work... But not for this prices, the only thing that PDX seems to be improving at is milking money of their player base.\n\nFor me, unplayable without mods.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pathetic excuse of a game. Its a glorified RNG simulator with a premium price tag. There is no fun to be had and the core mechanics ALL consist of stacking countless random buffs in order to turn your 2.3 income into a whopping 2.7.\r\n\r\nYou can start as any leader in 867, get constant negative events for the next 6 years, and have your game die in 874 without you ever even having a chance to change your fate. its genuinely absurd just how willing people are to defend a game where its almost solely up to RNG instead of any kind of skill or intelligence.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So, while the game is very big, and in theory there should be enough to do, I just get bored very quickly for reasons I do not fully understand myself.\r\n\r\nHowever, I do think that the repetitive nature of events, plus the fact that starting as a custom character (Which has the thing that really got me interested in this game in the first place.) doesn't really let you customize or create interesting family members, friends, etc. Kind of makes it hard for me to put in more than 30 minutes into a campaign before losing all interest.\r\n\r\nI know there are enough historical characters you can play as, but as I said, custom characters were the thing I was really interested in.\r\n\r\nIn conclusion, the game is just not something for me personally, due to the fact I feel I keep seeing the same events and clicking the same buttons over and over again, without getting any closer to my goals for a campaign. But maybe I'm just impatient. It is a game that is supposed to take place over multiple generations after all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There was maybe a point in time a year or so ago I'd recommend CK3, but no longer. Paradox will call this game Crusader Kings, label it a grand strategy game to boot. Cool, right? A medieval game with a focus on the crusades and jihads of old; the steppes become more prevalent too as wildcards once you hit the late game. Scrap all that. Years of nothing done in Europe to help the games repetitive nature west of Greece and north of Iberia. You still cannot play as a Republic, I doubt that or leading a Crusader State will ever happen. The Catholic Church and Orthodox have gotten no love, period. Cardinals, Patriarchs, what are those? As a King and Emperor, local Bishops are a complete hinderance to the Feudal only Europe- that literally doesn't even make historical sense. There hasn't been a single update to the way the HRE functions, nor France. \n\nBut you know what WILL fix all this? Adding China! Japan too, and Indonesia. The far east was an integral aspect of the crusades and jihads. But don't worry, even if you don't purchase the $30 DLC, the rest of the map east of India is still tacked on, but with no silk road. Fret not, you'll be getting that piss optimization whether you want it or not. Seriously, if you were begging Paradox for China and beyond, you shouldn't have been playing a Medieval grand strategy. Games like Europa and HOI would be perfect for you. 1.18 has crippled this game.\n\nMy one praise of 1.18 is that the map looks gorgeous, they really knocked the visuals out of the park with the improved terrain and color system. Of course, when you click on a Kingdom and the leader pops up, they look terrible now. Or the UI changes... dear God, how do these AAA studios not know how to UI in 2025? Just another example of one step forward five steps backwards. The lack of love to Europe only to add on this gigantic tumor on the end of the map is just complete nonsense. Not even the content creators could squeeze more than a weeks worth of content out of the nothing DLC, All Under Heaven. Where is the TRUE strategic depth? Why does every DLC make the game run like shit for two weeks, receive a couple of patches, and that's it? I can count on one hand the amount of times the base game was given genuinely great QoL changes.\n\nStarting a new character for the roleplay can only entertain you so much. And instead of taking a page of out of their own playbook, Paradox has decided to play wide instead of tall. They do not, and never will, enhance existing ideas and mechanics. They don't need to, because people with >100 hours in the game will buy every DLC full price, play maybe two playthroughs in that region and bugger off to find their next slop to enjoy. \n\nYou have ZERO inclination to purchase this product if you have any intention of playing west of the steppes... in a video game called Crusader Kings. Yes I have many, many hours. It is very easy as well, but it was easy on hour 50, and that just goes to show how much fun I've had to put in an additional 700. I could've recommended this game a while back because the overhaul mods pretty much always carried hard for myself and many others. EK2 and the LOTR overhaul are an absolute blast, I've read great things about the GoT overhaul too. But eventually, those mods will have to move to the unoptimized, disorganized, 1.18 update. That'll be the true nail in the coffin for this game for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crusader Kings 3 lacks the strategic depth its premise promises. While the game presents an impressive array of interconnected systems. From succession laws to religious reform, none feel meaningfully developed. After a few campaigns, you'll notice that playing as a Norse chieftain, an Irish duke, or a Byzantine emperor follows largely identical patterns of optimization, with regional flavor amounting to little more than cosmetic differences.\n\nThe DLC strategy exacerbates this problem. Rather than deepening existing mechanics, Paradox continues expanding the map and adding new systems that suffer from the same shallowness. Tours, plagues, and administrative governments all feel like they're checking boxes rather than adding meaningful decisions.\n\nMost frustrating is the event system. Where Crusader Kings 2's events often presented interesting dilemmas, CK3's feel like a bombardment of pop ups requiring the same rote responses. You're not making meaningful choices you're just clicking through interruptions to return to what you were actually doing. It's less grand strategy and more cookie clicker at that point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty good game but instead of fixing old issues and mechanics they just slap more dlc on to it and hope for the best.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you guys have no idea how bad i want to give this game a good rating. i love this game so much, somthing has changed though, it crashes like every time i open the game making it unplayable. i played this game alot a year ago or so with no issue but now when i boot it up it crashes even with a new playthrough. this game is broken right now, sorry guys.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has become incredibly convoluted, complex, and ridiculous. I cannot recommend this game in its current state. One is unable to even continue a game upon a major update. This is way beyond early access. An update should not break save games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game but absolutely wouldn't recommend it to anyone who is even thinking of playing multiplayer. No matter what you do, it has constant desyncing issues to the point of making the game unplayable. I have tried playing with no mods, starting at different times, playing with more or less people, trying a bunch of the recommended solutions from others online - it doesn't work. Eventually, no matter what you do, there will be desync issues. \r\nRealistically for the amount of time this game has been out, and the amount people pay for it, it should not have such an integral issue.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Once you get passed year 1300 the game is a lagfest. it takes minutes for any action taken",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mechanics about as clear as mud in a darkened room, andit has an AI that makes a potato-clock look hi-tech. It's a game that takes umpteen hours to understand, and even then, the AI of your enemies and/or allies just screws you over, with rolls and multipliers that make no sense or are wrong/lying to you.\r\n\r\nI get that this is a niche grand strategy game, and that it's SUPPOSED to be complicated and complex, but it's just not fun when the game just decides \"HAHA F**K YOU\" after you've put hours into trying to get to grips with things only for everything to fall apart.\r\n\r\nComplex doesn't mean better, especially as the cash cow of infinite DLC tends to just makes things even more unstable and worse.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bit of a niche situation but ever since right before (and now after) the release of All Under Heaven the game is unplayable on Mac. Constant memory leaks and force quit notification pop ups until the game force quits itself. If you're lucky and the memory leak is slow enough to get a half hour of playtime, the performance gets increasingly worse over time eventually requiring a game restart. Very upsetting, I have tried every possible workaround such as clearing shader caches, clean reinstalls, and even launching straight from terminal but the issue persists.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Paradox:\n1. ruined VTM\n2. has to start releasing finished games\n3. has to stop draining people's money with no-content dlcs.\n\nAs for VTM, just sell the franchise to someone competent, none of that \"on a licence from us\" crap. Cannot believe I am saying this but literally worse than EA.\n\nOtherwise, would be a decent game if all the dlcs content was in base game for the price that its sold at.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very shallow, CK2 is the more interesting STRATEGY game. Barely any relevant gameplay mechanics added/refined 5 years after release. Still missing features that the predecessor already had. Events are very repetitive after a short while. No thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't run properly on Linux and has predatory DLC like all other Paracox games.  RIP with Ubisoft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's actually a really great game. But the fact that the game scores may no longer work as expected due to updates is simply outrageous. The game is a full-price game and not in early access status. If I don't play for a year and the game is updated in the meantime, I expect that game score to be 100% playable. Without restrictions. Therefore, no recommendation until this issue has been resolved!\n\nEigentlich ein wirklich tolles Spiel. Aber das Spielstände wegen Updates nicht mehr so laufen könnten wie erwartet ist schlicht eine Frechheit. Das Spiel ist ein Vollpreis-Spiel und nicht im Early Access Status. Wenn ich ein Jahr nicht spiele und das Spiel aktualisiert wird in der Zwischenzeit erwarte ich, dass dieser Spielstand 100% spielbar ist. Ohne Einschränkungen. Daher keine Empfehlung bis dieses Problem behoben wurde!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New update completely fucked the lighting for map and portraits...Looks like a shitty instagram filter and also cant revert back because all mods are broken. Genius developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game's quality is overshadowed by Paradox's monetary modus operandi.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do you want to spend hours managing a plethora conflicts and interests just for the game to crash to desktop without warning? Oh, it was near the end of the month / year? No recent autosave, so time to do all that again 5 more times while avoiding whatever landmines are causing the crash. \r\n\r\nFinally got your campaign on track? Don't worry, the new update will make your saves incompatible. Now you get to do it all over again. \r\n\r\nIf you liked the idea of playing the game, you're in luck - all there is is [i]the idea of playing it[/i]. No pesky reality of a playable game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not purchase unless you purchase all the DLCs. The base game has been made unplayable due to the legitimacy update. Cannot even play old versions just crashes every time, was a great game at one point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve had years of patience with Crusader Kings 3. I’ve played countless runs, tested scenarios, restarted after every patch, and collected over 1284 hours — not because the game is flawless, but because I’ve spent most of that time wrestling the same fundamental issues over and over again. And now it’s time to be direct:\n\nThis game, in its current state, is a technical disaster, becoming worse with every new update.\n\n🗑️ Let’s start with the highlight: My review was deleted.\n\nYes, my previously posted review — neutral, factual, and genuinely constructive — was removed.\n\nNot because I insulted anyone.\nNot because it was toxic.\nNot because it violated any rules.\n\nIt was removed from the official review section where you normally rate the game.\n\nAnd the only way a review disappears from there is…\nSteam was notified by Paradox.\n\nThis does not look professional.\nThis does not look confident.\nIt simply looks:\npathetic and ridiculous.\n\n💍 Now for the core issue (and the ultimate joke): You can’t get married anymore.\n\nA dynasty simulator in which marriage is broken since patch 1.18.1.1.\n\nHere’s the exact situation:\n\nBoth characters are adults (20+)\n\nBoth have +100 opinion\n\nBoth are “Soulmates”\n\nBoth at the same court\n\nNothing blocking the marriage\n\nNo mods activated\n\nAll DLCs disabled\n\nRoyal Wedding greyed out\n\nRegular Marriage greyed out\n\nError message: “Both characters must be adults”\n\nAnd the best part:\nEven forcing the marriage event via console commands does nothing.\nThe button remains greyed out and the event doesn’t fire.\n\nPatch 1.17.1 → works.\nPatch 1.18.1.1 → broken.\n\nA dynasty game where marriage doesn’t work is not “a bug.”\nIt’s a collapse.\n\n🔧 Technical Overview – A Scientific Breakdown of a Game in Regression\n\nLet me quote things that ANY player can easily observe:\n\nPerformance Analysis – Department of Stutter Physics\n\nScrolling stutters → permanently\n\nZooming in stutters → noticeable\n\nZooming out stutters → even worse\n\nMenus micro-stutter → reproducible\n\nMap freezes → regular occurrence\n\nLoad times getting longer → ~5 minutes without mods\n\nMemory leaks → everywhere\n\nDX11 → uneven, unstable frametimes\n\nVulkan → no better\n\nEven the smallest mod → amplifies all problems\n\nThe engine behaves like it renders each frame whispering:\n“I’m trying… please believe me…”\n\nIt doesn’t.\n\n🧬 Regression, not progression — Every update breaks something new\n\nParts of the game feel like they age backwards with every patch:\n\nAI gets worse\n\nLoading times increase\n\nNew crashes\n\nDelayed menus\n\nMultiplayer de-syncs\n\nUnreliable event chains\n\nCalculation errors in tooltips\n\nBroken artifacts\n\nBugged marriage logic\n\nStuck courtiers\n\nArmy pathing issues\n\nCharacters „between two states“\n\nChildren getting duplicate traits\n\nEvents firing twice for no reason\n\nFrozen portraits\n\nDecisions not updating\n\nCourt graphics flickering\n\nRandom freezes during autosave\n\nThe scientific term for this is:\n“catastrophic update regression with systemic instability.”\nPlain English:\nThe game is falling apart.\n\n🖥️ And before anyone says my system is the problem — here’s my hardware\n\nAll purchased two days ago:\n\nCPU: AMD Ryzen 9 9800X3D\n\nGPU: RTX 4070 Ti\n\nRAM: 32 GB DDR5\n\nSSD: 2 TB PCIe 5.0 M.2 (14,000 MB/s read / 14,000 MB/s write)\n\nOS: Windows 11 Pro 64-bit\n\nBIOS: latest version\n\nWindows: fully updated\n\nCyberpunk 2077 runs on Ultra with Ray Tracing at a stable 120 FPS and loads in seconds.\n\nCK3?\n100% CPU usage on loading, 5-minute wait, stutter party when zooming in.\n\n🤡 DLCs disabled → no improvement\n\nFree content off?\nDLCs off?\nMods off?\nFresh install?\nCache deleted?\nFolders recreated?\nFull reset?\n\nThe issue stays.\nIt was introduced specifically in 1.18.1.1.\n\n😑 And then players are expected not to be frustrated\n\nI don’t want to open every patch hoping:\n\n“Please… just this once… let the base game work.”\n\nI don’t want to restart a dynasty to check whether the update broke my previous run.\n\nI don’t want to endlessly diagnose which mechanics regressed this time.\n\nI simply want to play.\n\nBut right now CK3 is:\n\nmechanically unreliable\n\ntechnically unstable\n\npatch-regression prone\n\nunoptimized\n\nand in many areas simply non-functional\n\n🛑 Conclusion (politely stated):\n\nCrusader Kings 3, in its current patch, is not something I can recommend.\nNot to new players, not to long-time fans, not to anyone.\n\nWhen fundamental mechanics like marriage no longer work, it’s not „a small issue.“\nIt means the foundation is cracked.\n\nI have uninstalled CK3 indefinitely.\nNot because I hate the game — but because I loved it, and it honestly hurts to see what it has become.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Looks promising, but unfortunately is just a really expensive screen saver, with it unable to get past the initializing scene. Nothing to do with my tech specs, so I guess just some kind of bug? Shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game tooltips literally lie to your face about the consequences of actions.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to give this a rave review but it is 50/50 whether it can be played. If it's not crashing as it loads, mid or when you go to close it it's refusing to connect to the paradox servers and locking you out of multiplayer. Crash reports won't upload either.\r\nBut when I CAN play it, it's pretty fun. Great replayability, if it actually worked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I play a lot of sim games, but not this style. Really don't like it and my biggest (steam) regret is not giving up on it soon enough to get a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has so many bugs , glitches and exploits",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't take me wrong, I love this game, but at the same time I hate the fact that after all those years devs still didn't fix multiplayer and just add ever more DLCs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game\nbut unplayable multiplayer because of perma desyncs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant pause the game, and then negative things happen. Then if I load, I cant get trophies. Im just so annoyed im walking away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, I really enjoy this game. But if, like me, you wanna play with your friends... Just don't. As soon as you try to play with more than two players the game might as well be called desync simulator. Constant desync every 10 minutes or so, with some leading to crashes.\nI've did some searching and apparently it's been an issue for 3+ years so not likely to be fixed anytime soon.\n\nIf you wanna play this game solo, sure, go ahead. But if you wanna play with your friends I wouldn't recommend buying it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is unplayable, cant even get past starting loading screen without crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crusader Kings III is an historical game that doesn't care about history. What a sad step down from CK2, a game that felt like you were playing a character set in this time period. The developers took the complexity and authentic feel of Crusader Kings II and said \"Ok, now lets make CK2 but dumb it down enough for 6-year-olds to play it. Make the game map at the starting year look vaguely historically accurate, but then have all the historical characters just do random crap\". 10 years after the starting year you get France somehow inheriting half of Ireland and some Muslim ruler inheriting random counties in England. This sort of thing should be almost impossible for the AI to do. Maybe a skilled player can make it happen if they want, but I see this sort of thing every time I play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "as i tired really hard to get into this game, i just cant. exteamly boring, i dont know why this game has such high reviews.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "From a completely new player's perspective.... went through the tutorial. Got an army but unable to declare war in any way, shape, or form. They just wander around while it says something about a casus belli, but doesn't say how to get this even after a fabricated claim from the priest. Idk what to do, I have a day job so trying to learn a game that apparently takes 100 hours to grasp the basics is just not fun at all. Should be covered in the tutorial. It's also not very interesting to have your own nobility character, but there's no customization of what he looks like. You just kind of have some generic king instead of building a custom character to feel more immersed. Maybe this game would be fun if I had 100 hours of free time to devote to learning it, but it's definitely NOT new player friendly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unless you like overwhelmed by \"essential\" info to read early game. the 2 hour kind. I do not recomend crusader king.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MACOS EXPERIENCE:\r\n\r\nFirst impressions are excessively bad. As of writing this review the game has not even launched yet. It is absurd that a game in 2025 takes this long to even launch, and I don’t even know if it can. And my setup is not even that bad…\r\n\r\n16gb ram\r\nM4 processor\r\n1 TB SSD\r\n\r\nWhile not a gaming setup, these stats easily clears the recommended stats, and the game has still not launched.\r\n\r\nIn the meantime I have time to make a cup of coffee, while I wait. \r\n\r\nI did only pay 15 € for this game, so for now I’m willing to try to make it work, and I will let you know of the efforts it took. Paying full price for lunchtime this bad, is personally not something I am willing to deal with. \r\n\r\nThat cup of coffee, btw, is done. All I can do is for now is waiting. Having time to read online it seems that I am by far not the only one having this problem. People report launch times up to 30 minutes. Wild.\r\n\r\nSo far I have embossed 20 minutes of play time, And the game has not even launched. I wanted to mod the game with magic, and let’s see what happens when I turn it off. \r\n\r\nI drunk my coffee… Last thing I will try before heading off is launching without cloud. Not ideal… 30 minutes of playtime. Not a single of them inside of the game. 4 relaunches. \r\n\r\nPutting the charger in enables gaming mode. Maybe that will help. 42 minutes… \r\n\r\nTrying going offline now and launching in different ways. Over 50 minutes now\r\n\r\nGetting close to the 1 hourmark, and I have not been in the game yet. If I get to 1hours 45 minutes, I’m filing for a refund. I need more than 15 minutes to properly review the game. \r\n\r\n91 minutes spend not launching the game. I’m loosing my patience.\r\n\r\nThere are so many other games I could play, I am getting a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed CK2 and Stellaris but at this point I have to say I'm over it.\r\nAll the games suffer from the same issues.\r\n- endless dlc's which increase the price of the games to a ridiculous level if you want the \"full\" experience\r\n- crammed full of systems that conflict with one another or were abandoned or do not serve a purpose at all.\r\n- nonsensical arbitrary conditions that stand in the way of what you actually want to do.\r\n- RNG that will F ur shit up, what? you prepared for years for a war, have superior research, commanders, armies and terrain well the enemy rolled a better number so get fucked.\r\n\r\nThe one and only reasons why these games persists is the meme status they have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible performance on Mac. Latest release wont even run.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am not sure why it's got so high rating but the interface to play is just horrible.. and logic way to complicated to play... Seems also a lot of bugs when the state stuck and only bounce it will resolve...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For a \"grand strategy\" game, it's terrible.\n\nIt's good for funny intrigue and \"how f-ed up can my dynasty get\", but as a strategy game it's horrible. Boring autocombat with auto dice rolls that's just RNG behind the scenes. \n\nPlay it as a story generator type game, don't play it if you're hoping for tactical warfare with strategic planning.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really never understood the hype with any Paradox game except for Stellaris. I love history, geopolitics, and nation building but this is so boring that it puts me to sleep faster than melatonin (minus the heart failure).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is slop. Boring auto combat. The create a character is pointless. And all campaigns/scenarios are programmed to have automatic outcomes, meaning this game might as well be a play-along novel game instead of an actual strategy game. None of your decisions matter. Everything is determined to go a certain way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Multiplayer is unplayable. As the game reaches the late stages, the desync issues get worse and worse. I’ve checked the forums and it’s the same problem people have been reporting since 2023. It really seems like they don’t care enough to even consider fixing it, so my review is negative.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This was my first CK and I found it honestly terrible: the war mechanics are way too simple as well as the economy. The activities are boring, unrealistic and pointless. The whole relationship with vassals is very weird, and I am pretty sure not historically accurate.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Booted Up, took a long time to load into the start menu and then into game. \nThen Crashed.\n\n\nAlso in the future this game will cost like 200-300 dollars to get all the game mechanics paradox splits into dlc, which practically makes it a 200-300 dollar game in typical paradox fashion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you have Windows 11 I wouldn't even try playing this game. My \"playtime\" hours have been the time I've spent in the main menu and launcher trying to change settings and get this game to work. The game would load for about 20 mins, finally load, and crash once I clicked on a ruler or just pressed play. I've updated my drivers, done clean reinstalls, checked my logs, etc. I cannot get the game to work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A great game that is ruined by little bugs, inconsistencies in game design and broken mechanics. Having a great time with the game? Hey, paradox has prepared yet another stupid thing that does one thing very poorly and breaks almost everything. Play ck2 not this slop.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overwhelming amount of options, very unfriendly for casual player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Damn game wasted nearly 3 hours of my time. First time it took over 40 mins to launch, I tried to be patient and told myself that maybe it was just for the first launch, how wrong I was. So I tried to load a new game and it crashed after 3 minutes of waiting for it to load. No problem, I'll just turn down the settings to the lowest quality on everything and maybe it'll work? Nope, a few more crashes later and the games failing to send my crash reports, I think like 1 actually sent. Anyways, don't waste your time or money, the game WILL crash. I'm genuinely surprised this game has good reviews. For context, I have a game from 2009 that's double the storage and doesn't have its own launcher to help yet it runs smoothly and WORKS, wish I played that instead of wasting my time on this scam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My God, this game is totally unplayable on windows 11. Really in 2025 i have to wait for a freaking 45 minutes just for a game to launch? Fix you shit Paradox!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "With the addition of the god-awful operating system that is Windows 11 came a fair amount of technical difficulties, which I get. The game freezes, along with my whole system, so I have to take the risk and do a hard reset.\n\nYou would think that, the way it’s described by Paradox, the problem is of recent discovery — yet it is not. It has existed for at least a year, as is evident from the many posts circulating around the web. The developers have been saying that they’ve pinpointed the exact reason and have been working on a potential fix for several months now — to no avail.\n\nThe explanation behind all the aforementioned is simple: throughout this game’s lifetime, Paradox Interactive has done the bare minimum to optimize it, creating load upon load on top of its ongoing development, thus affecting the performance and general compatibility it should have had from the start. Each and every unoptimized DLC burdens the title to the point where it’s unplayable for many, when, in the past, it was not.\n\nI love the game dearly, and having to review it negatively is painful enough. A better treatment is all it needs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crusader Kings 3 is otherwise an incredible game, but a severe, long-standing bug tied to succession and cultural reformation makes it impossible to recommend.\r\nThis bug has been known since 2022 and is still active.\r\nThe Problem: When your ruler dies, and the Culture Head title briefly transfers to an AI, that AI instantly uses the chance to cancel and change your ongoing cultural reformation.\r\nThe Consequence: This arbitrarily wastes 20-30 years of development time, gold, and prestige and is an unfair punishment for a core game event (succession). The AI is operating under rules that the player does not have (players cannot cancel their own ongoing reforms). Do not buy this game until Paradox addresses this critical inconsistency. The core mechanic of shaping your culture is currently too vulnerable to random AI interference.\r\nThis is a widely reported issue, confirmed by the community:\r\nConfirmed - NPC's switching your Cultural Tradition mid-establishing\r\nCK III - AI cancels the current reform culture type while my emperor is a child\r\nCK III - New culture head changes a reform in progress, but I can't do the same!\r\nGame breaking issue, AI randomly changes culture reformation in progress",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "AAA Garbage. \nGame has a big Learning curve for people 1st time getting into it.\nThe DLC's are priced at indie game prices maybe even more.\nGame has been out for years and still has Constant visual bugs that won't verify fix.\n\nIf the Games price was $80 TOTAL with all DLC included then yes I would say it's a good buy but the price for what you get is about as satisfying as oblivion horse armour . . .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT WORTH THE PRICE\n\ndont get me wrong i have enjoyed my experience of the base game but for its price its simply not worth, sadly the developer made basic mechanics DLC only let me explain you play as a medieval noble but most of the fun of being a medieval noble you have to buy a DLC no cant hybridize with other cultures to create new culture like the vikings did you cant die from plague you cant do tournaments.\n\nBAD DESIGN FOR ARAB AND MUSLIM WORLD\n\nPalestine Syria and good chunk of north Africa have a terrain called dryland despite those regions being having a climate similar to Spain and Italy those regions in the time period of the game used to have more greenery and forest despite that paradox made it look like it was something from madmax, and the problems dont end here all Muslim countries have a clan government while it represents small Muslim countrys it does not represent muslim empire correctly you cant raid your kafir neighbor to get young boys to be your raised as your slave soldiers like the Ottomans or Abbasids so you can give the provinces tbh there should be two government types for Muslims iqta a mix of clan and administrative government for empires and clan for everything else\n\nTHE CRUSADER ARE BORING\n\nyes you heard me right despite the game name the crusades are boring and disappointing from the pope ignoring Muslims conquering half of Europe and calling for a crusade for Tibet or random place in Siberia to the FUCKING CRUSADER EMPIRE BEGIN THE MOST UNDERWHELMING EMPIRE THE GAME, you will have more fun as a racist German crusader conquering byzantine at least the Latin empire have unique mechanics\n\nthere is more to say but only buy the game on sales with some DLCs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tried the free weekend and couldnt get it to launch for a few attempts. After that, the gods shined upon me and let he game launch... but wouldnt get past the \"loading\" screen? I actually forgot I was waiting so long I finished an episode of a show or two i was watching. I don't think it was 10hrs worth, but if i tried this on a previous free weekend, I don't recall the game being impressive at all... soooooooo i guess the inability (based on many reviews) to get the game to launch... means I don't really care to try this going forward anymore.\r\n\r\nYes, everything updated, restarted, reinstalled, re-whatever~ i know basic troubleshooting steps. if a blood sacrifice actually worked I would have tried that too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A feudal simulator in which kings apparently aren't allowed to protect their vassals until 3 years has passed. Utterly stupid gamey limits tossed in without proper consideration. Even if they rediscover their sanity and reverse this absolutely inane design choice, they've lost me: I can't trust the continuing development of this game and won't be buying any more DLC for it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shitty company re-launch Surviving Mars and demand we pay again for game we bought. It's a big f**k you to fans. So f**k you to you too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried really hard (52 hours) to learn the game, and I kept failing at it. It was a constant barrage of new rules. I found playing with gemini on the side was necessary for me to understand how to get out of tricky situations. And even with this extra help it didn't work out for me. \r\n\r\nSometimes I felt in control, to find out 20 minutes later that my lineage was gone and I had no way to carry on. Other times I went through what felt like a never ending war, not winning nor losing for hours (playing at standard speed). I lost some battles that were predicted as guaranteed wins, and vice versa. Still no idea why.\r\n\r\nIt feels appealing when one finally understands a bit of the game mecanics. But too many times the game  smashed my face into the ground and I didn't have a clue why.\r\n\r\nSorry, not for me!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes constantly, wars feel like sh*t, movement is abysmal. Everything else is solid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is enormously complicated to learn. If you're an adult who has limited spare time to game then I would not recommend this game at all. It seems to require watching endless hours of YouTube tutorials. If you want a relaxing experience then I'd look elsewhere. This game is homework.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No longer playable after the new patch, I'm tired of playing any Paradox game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hope the developer can see this comment, I don't know where to feedback.\n\nI was going to play this with controller on my windows handheld device, I know this game does not support controller, it is OK, I can use controller companion to simulate the mouse like other games. However, when I plug in the controller, there will be a invisible mouse moving around with the stick!!! Why would you add this function??? can you just entirely disable  the controller, instead of half supporting it. This is making this game impossible to play with controller....\n\nPlease fix the half supported controller issue.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "On 7950x3d, 4070 ti super, 64 gb ram you do will experience slideshow, 5 fps, input lag, because this awesome game is written in a way that can't handle more than 1 cpu core and everything is binded in a single thread, so unless you have quantum cpu - stay away from it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "whoever designed paradox launcher to interact so badly with the useless nonsense that is onedrive should never be allowed near a computer again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's snow outside and I have the whole day free, finally, I can sit down cozy and warm with some hot coco and look at the map game. BUT WAIT NO. I had to stop playing because it kept crashing my pc with an unpassable freeze screen, better be sure you put the auto save on on monthly or else you're going to lose half a year in Ironman.\n\nPlenty enough of people on the internet mad about it with better PCs than mine and yet there is no option to remove half the useless map to get the mythical distant update to fix old issues.\n\nDo I want to buy the new DLCs? Yes. Why won't I buy the new DLCs? I literally can't play the game I paid for 5 years ago, [b]the product does not work as intended[/b]. If you really want to try Crusader Kings 3 - try Crusader Kings 2, the only real difference is the intro into the game and character details, oh, and of course in my 1248,7 hours in that game it never had any issues running on my older, much worse, PC.\n\nHope I get to amend this review soon, because I had the most fun playing Crusader King 2 and I feel that the 3rd game has the potential to be better, but all the stories I hear about any game development anywhere give me the vibe that I better go back to the 2nd one and do that pagan Ashkenazi world domination game that I was thinking about doing on the 3rd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Depiction of some Islamic figures are considered disrespectful, like prophet Muhammad PBUH, his daughter Fatima PBUH, Shia Imams and their wives (Especially things like visible hair and neck)\nI hope Paradox does something like they did for prophet Muhammad PBUH.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Don't want to buy ssd. Why you can't optimize it so hdd can run it?!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't recommend Crusader Kings III because this game is not interested without DLC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've downloaded the game, it's just stuck on the loading screen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game crashes on startup. Unable to resolve it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is addicting when it works but it crashes soooooooooooo much T_T",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can't play multiplayer out of sync issues fix your shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do sincerely hope that the devs live miserable lives for the rest of their existence",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is really good, when it doesn't crash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The mechanics are as wide as the ocean and as deep as a puddle. Paradox keeps adding new systems that barely if at all interact with each other which leads to the game world feeling empty and disconected.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah, the first year or so was fun. The first set of DLC was fun. Now, having put 730 hours into it, it is a mess. Every new update totally fucks up things more and more. My last drop was how the addition of the new eastern areas totally broke my long game in Europe. Do not pay them money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get me wrong, CK3 has its fun moments, but it has one massive, underlying issue: It's a combination grand strategy game and life sim. Because of this, it never really is able to be a good version of either. It's strategy components are puddle deep and easily exploitable. Warfare amounts to building centralized military in the 800s, and because the AI can't think strategically, you just steamroll everything that hasn't been over-buffed by the devs (Like the mongols).\n  The roleplaying elements have a shelf life because everything is handled through events, you play through menus so you can only be given character moments through text, and because its all random events that have been pre-written there`s a distinct lack of character for your characters. \n  Several of the game's systems have also just been left to rot completely. I don't even need to list them here because almost every game system has just been neglected. Devs are focused on adding new content, which is fine, but surely you can hire a new team to update and upkeep the old content? Stellaris is actually a great example of this working. (Despite that game's current issues.)\n  Unfortunately I just don't think you should play CK3. If you want a good Grand Strategy game, play EU4 or HOI4 or even VIC3. Heck, go play Imperator: Rome. It's very underrated and managed to have characters included in a way that wasn't game defining. If you want to Roleplay, go play Kingdom Come or Manor Lords. CK3 is an unhappy marriage of two genres and it need to split, one way or the other.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}