{
  "positive": [
    {
      "review": "Gameplay: 9/10\r\nReplayability: 8/10 (has sandbox and mods)\r\nCampaign: 7/10 (has weirdly difficult levels)\r\nPrice: 4/10 (Extremely over priced. Buy it when a sale is happening)\r\nPerformance: 8/10 (Plays really well for what it is on low end computers/laptops)",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "I like the satisfying essence of blowing up stuff and allows me to relieve stress playing this game! 10/10",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "very good game, great for when your angry or just feel like destroying something. can get boring, so do in short time periods, 15-45 mins i like to do but it depends. also don't expect updates often. but good game",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "This is a game where you invent the most madcap strategies to save time once the alarm is pulled. I once made use of prop-flying, a brazen violation of the rules set forth by Newton and most DarkRP servers, as a legitimate speedrunning strategy in the flood level.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "The \"heist\" framing actively hinders your enjoyment of the game. it would be much more fun if it was  just destruction with some specific directions, something like hardspace shipbreaker, but instead this is more of a \"plan an optimal speedrun route through this level\" which isn't super fun. There are levels where you just destroy stuff, and mods that add some cool stuff. Buy if on sale.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "so addicting love the game and def the mods!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very satisfying game and I cannot wait to have the ability to enjoy with friends!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's funny, this game starts real high with a \"wow i love this game\"-feeling - then almost directly tacks into a \"wait is this gonna be it\" mood for most of the first half, with all the heist missions. Rather same-y.\n\nBut it really sticks the landing in the last half. Very different missions. Explores the game mechanic opportunities in interesting ways. I think my favorite is precisely demolishing a mall to get sightlines to multiple antennas, but the blast-corps-like finale was a close second.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game if you want to truly feel a proper sandbox while aswell having a proper story. Personally i think 15 yr olds would be allowed to play it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is a beauty, now all I need to do is get a computer that can’t handle it.(I’m using a ASUS laptop, I’m surprised it even works… with 5 frames.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you've ever wanted to feel the satisfaction of destroying everything in your site this game is for you. This game also comes with a complementary burning smell to accompany your destruction from your very own pc. 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game, the physics are the best I've seen, fun gameplay, and basically everything is destructible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool sandbox game where u can destroy stuff to satisfy the ADHD cravings",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really fun game that can be a little laggy with a lot of mods but overall a very fun game i would recommend and it is a 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super awesome for taking anger out on buildings and sometimes lighting stuff on fire and blowing up buildings for fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great sandbox game, a little performance heavy. I didn't really like the difficulty of some of the missions, there could've been more levels of just destruction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game with fully destructible enviroment. It has campaign and sandbox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Teardown is a fire planning heists game personally i just really like the physics engine and multiplayer is coming soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game to just chiil and break stuff, nice sandbox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only game where you rob by destroying peoples houses. 10/10 would destroy a persons house again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it, there is nothing really else to say. Instead of WASTING your valuable time looking at the game, buy it. Have things to do in life? Teardown doesn't care. Play Teardown now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun, can be laggy at times when using mods, needs multiplayer and controls menu",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the campaign is honestly underrated, maybe even better than regular sandbox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I love the workshop mods and I can have fun for a bit I think what drags this game down is how brutal the campaign is bs time limit, unfair mechanics that is frustrating and I like to believe the developers that of this in a week without testing the balance with stealing whatever you need to. \nOverall its fun for a while but be cautious of how brutal the campaign is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is perhaps the most amazing game I have ever played, I already have about 2500 hours on it, and I don't regret a single moment. If anyone likes games where they can to whatever they want, play a campaign, get mods for everything, play thousands of sandboxes, and like to destroy shit; This is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like destroying things am I am Hatsune Miku :3 although you will need a butt ton of mods to make it fun (atleast thats what ended up happening with me)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to pass time and cause chaos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an absolutely terrific little game. Fun tools, fun scenarios. Easy enough to progress without challenge but plenty of side objectives if you want to really push and challenge yourself. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☑ Kids\r\n☑ Teens\r\n☐ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☑ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☑ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for someone who love demolisons and cars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gaphics  are amazing and there's so many mods you  can get so fast easily. GG [great game]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very fun to be able to construct paths however you want in an enviroment to pull off a good heist, enjoyed this one quite a bit. Some of the later levels incorporate quite annoying mechanics that ruins the fun but, for the most part this is really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game would Teardown my free time if I didn't have self control.\n\nGreat game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun games i've played. i love destroying anything and everything in any way i can imagine and using mods really elevates the game. tools like the jetpack and firefighting hose are essential to me. you can use mods to turn your game into a firefighting simulator.. you can use mods to launch missiles and rockets at anything. you can use mods to drive and shoot tanks, planes and many many vehicles from racecars to perfect recreations of emergency vehicles with working lights, theres so many mods and theyre all awesome! I cannot stress enough how awesome it is to DESTROY EVERYTHING you want. door blocking you? blow it up. a wall in the way? decimate it. I'm not even a fan of the core gameplay of doing required things before timer counts to 0, but with mods its no problem. just play a mod that has its own gameplay loops or just destroy a whole lot of amazing user created maps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun, 10/10 great graphics! spent over 60 hours on this game and its just getting more and more fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story is alright pretty good at times worst at  others the real money is in the workshop u can so much with mods its not even funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool game, fun to play when you have nothing else to do and want to have some fun, mods are very abundant (and very easy to download on steam) and make the game so fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, very smooth controls, beautiful graphic, I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good it has great game play i love it you can get mods like anything and has good lore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, and I enjoyed this game and have currently 1,625.2 hours so far, and I would say its very fun and entertaining",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kinda boring at first but get mods and its gonna be rlly fun cant stop playing with the mods i got",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game if u got a 3070 or any card better then 3060 its best for people who love distruction would definetly recommend this and its only 4gb memory def worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its so cool the graphics are pretty nice the destructive phiysics are great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game because the career and sandbox modes both have unique fun to them. Also the amount of mods you can get to shape the game to how you like is just ridiculous",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing game. A true recipe for creativity, excitement, challenge, and fun. Can not recommend this game enough. Has fun upgrade mechanic's, the story is great, the feel and moment of the game is awesome, incredible replayabilty with the base game, community, and challenges. Has so much freedom and personality. Love being able to experiment and explosions go boom good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is amazing with the mods as now i have made Teardown my own i wish to you new beginners to understand the beutifullness of the teardown community with planes.. ships.. heh even rockets you've got everything here! as now there is a lil problem that i dont want to explain but its confusing but anywho nice game.. future multiplayer *which i am exited for!*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect fun for those of us who tried but can't get into Minecraft.  Tearing down is much more fun than building, and nothing more satisfying than planning a heist for 30 minutes and having it work out with less than a second to spare.  Great game with tons of content and replay value!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strategy, creativity, and physics: 10/10. This game is so much better when you complete all objectives and, if you want real challenge, all of the achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good, modding carries the game, and not many updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game if you have a mid-high range PC (What I mean is a good or excellent PC), But if you have a low end one like me, gosh. It is very laggy, can't even place a bomb without it lagging. And the lowest graphics is what I half to use but it still lags, and don't even get me started on the quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive bought this gasme 13 tiems on different occasions and it is the bnest game ever made dont leyt anyone tell you otherwise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, i usually make it a warthunder game using tabs framework and  machines of war",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ah the heist game of 60 seconds to steal anything before time runs out + sandbox and voxels to destroy anything you see",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic. Not only is it a sandbox, but the story missions are challenging and fun as well. I can't wait for multiplayer, hope they pull that off in a way that works well. Even so, it's a fantastic singleplayer game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun sandbox, me personally I don't like the campaign.\r\nThe mods are what make this game so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Great Steam Workshop implementation too, it has some amazing mods like The World Trade Center and Aircraft Spawner!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really like this game i have on my play station account and thats how i started playing but on pc it like crazy better you got so much more thing and addons the ps5 game seems like a demo game in compareness",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its great, I love it, almost 200 hours and its still fun, there are fun mods and fun maps. the destruction physics are crazy if you're into 8bit style games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has been great. of you have been looking for a racing/destruction/simulator with loads of mods, this is your game. you can download mods for new cars, content, maps, or you can make your own! this game unleashes full creativity in a pixelated simulator. 5 stars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great premise! Very fun! Hope there's a sequel. I can't not give this game a good review if only for the simple fact that the last level was Blast Corps resurrected.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game with good destruction physics not recommended for low end computers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game's campaign wasn't for me. While I loved doing the demolition stuff (Why I bought the game), I found the exploration of the levels to be kind of boring and the idea of spending long chunks of time fighting the in-game physics to make a route that may or may not work to pull off heists within under a minute gave me a headache rather than excitement.  I also think the game would way more enjoyable with a co-op mode, but that would take a lot of rework with the mechanics of heists themselves.  I blame myself for not researching the game all that much before buying because if I'd known about the heists and their conditions and requirements for completion, I would have likely skipped out on buying the game.  But you know what?  I *respect* the campaign for what it does, I *respect* the people who find it fun, and I respect the developer for crafting what was clearly a game mode for people who love heists and doing the planning.\n\nThat said, the sandbox, modding tools/support, and fun you can have with blowing stuff up or smashing it all down with your sledgehammer make this game worth recommending even though I will not be likely coming back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Any kid who lived in 2012 would have their brain explode at a game like this. It's absolutely magnificent!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amzing game well put together one of the best games i have played i would recomend to others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do not buy it unless you have a very good pc, budget pcs cannot run this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I caused a catogry 5 hurricane and destoryed thw white house. 10/10, peak game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game including with mods its the best for example the multiplayer mod is such underrated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good singleplayer experience even without mods. Pretty unique gameplay compared to what I've seen before and still good variety with the different types of missions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Teardown executes a unique premise quite well. Missions are satisfyingly difficult, the visuals are fantastic, there's robust mod support, and maps are well designed. My one critique is that there aren't enough missions about directly destroying things. I look forward to destruction shenanigans with my friends once the multiplayer update releases. Easy recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like destroying? love driving recklessly? you can do it in real life, but at the cost of jail. Buy this game to do it scott free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the way it doesn't require a Nasa PC to run such beautiful graphics and physics is amazing! \r\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game even better sandbox, mods are extremely reccomended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember planting explosives in people's homes with my friends. Their houses went kaboom. This game brings me back to the good old days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a fun  game and soon it will have multiplayer which = more chaotic fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It offers a challange and an exiting storyline",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so satisfying but the only flaw is that you need kinda good hardware to run it but everything else is just perfect i recommend the game to everyone who has like anger problems and etc. WORTH THE MONEY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game for destroying things, the campaign was fun and the workshop is even better. Solid game by the developers 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything brakes burns or explodes so that's pretty cool. Destruction in this game is on point with good maps and lots of mod support shockingly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great but repetitive game but mods fix that, also if you cant open it and checked the requierments , then set the game to prev build 1.5 in the settings , this worked for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely a fun game, I usually play some games and give up on them due to them being not as entertaining. But Teardown is one of the games I can't stop playing lately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ระเบิดภูเขา เผากระท่อม เล่นเอาสะใจ \r\nถอนสมองวางข้างๆแล้วเผาบ้านกันเถอะ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the physics in this game its kinda expensive but its great you can get so many mods for free and they are built-in!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game. You can just be creative with the destruction of voxels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is honestly super fun and idk why i hid it from my acc but destroying citys in a game is kinda satisfying and fun i highly recommend this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "no glaze but this game is actually amazing, and the soundtrack is phenomenal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, easy to mod, Idk its js fun. Buy if you like minecraft and have the money for it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty fun if ur looking for something fun to do like a sandbox or something. modding very easy and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game, it has a rlly good level of destruction and pixelation that fills me with happiness and enjoyment\r\n\r\n10000000000/10 would buy again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "legit bought this for my son and he loves it. I also have my fun with it, love that you can destroy absolutely everything. 10/10  the mods bring in a whole new MODE!!! thx everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Teardown is a really fun Voxel based destruction game, lots of mods adding cool maps and weapons to destroy them with. the story however is very short and doesn't offer too much, you'll spend most of your time just destroying maps you downloaded for fun.\n\n7.7/10 very good stress reliever but not much too it other than mindless destruction which is still fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game! The fact you can destroy anything, as well as drive large cars trucks and boats. Just *chef's kiss*. And it's incredible how insane the graphics are for a voxel environment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun!\r\nwould recommend if u get bored quickly, cuz that wont happen in this game\r\nand the mods make it even more fun!\r\ntry the everything revolver ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OH MY, this game is sooo good. I liked the campaign it was cool, but where the real game is, is in the modding community, there are so many good mods out there you can almost anything and as you can see I have played this game a lot, if you are here and want to play on console too, don't. the console version is I believe 30 dollars and is the whole game without the mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great, chill fun game to just do whatever you want. Also a great game to 100% if your looking to add to your collection. Worth the buy and so are the DLC on offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is really creative and fun and you can release your anger by destroying things and you do sorts of missions. Really its fun so buy it and you will be amazed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, the part where you can burn down hospitals is breathtaking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good sandbox and amazing modding community, can't wait to see what multiplayer looks like, but if they nail it, this would be the game of the year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing even without mods the campaign is so interesting and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a Great Game with great Mods and Mission's. The Game is pretty Entertaining, I Recommend The Boeing 747 Mod and The Dinosaur Mod. All the Missions are Creative and Fun. I Would Understand if the Game Get's a Little Boring But There's A lot lot Of Things to do If you're Creative.  This Game is Over All Great Even Without Mod's Its Great. Like I said Its Overall Great, Destructive, and Creative. This Game I would 100% Recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "although the actual destruction of stuff is fun, I didn't expect the \"heist simulator\" aspect of the game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "this teardown wont launch on my pc i tried fix this but did not successful fix this problem or cause be bug of this game is not launch anymore then i lost money of fault this game not work my pc",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "at first this game seemed fun and the first couple levels were fun but later on in the game the devs ran out of ideas so they decided to abuse the shit out of wired alarm boxes and making the game extemly frustrating and annoying especaly that theres no way to defuse them or avoid them as theyre literally attached to the object you need to steal im not willing to complete this game ever",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game was good at first, till some cash greedy cow bought it to release as much dlcs as possible and to challenge EA in not giving a single fuck about the players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "used to play was good, then game stopped working like would crash as soon as i opened it not happy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game engine is great but the game isnt really there, the heist thing is ok but if im gonna heist i need to be able to run and move a bit better. im sure it will get interesting with mods and updates but the game dosent live up to the engine currently. nice mood to it, great graphics and music, if i could run i could be more positive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It will not open and it kept closing after i clicked  Campain mode",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they moved the goal posts again with the DLC without announcing anything. it was moved from end of 2024 to end of 2025 now to the first half of 2026. How much do you guys wanna bet that this multiplayer game mode is going to be the paid DLC like Battlestate Games did for Escape from Tarkov?\n\nThe game itself is fun mindless destruction but I can't recommend overall because absolutely terrible communication with players and horrible goalpost moving. Also I can tell that this multiplayer mode is going to break the vast majority of existing mods unless they decide to scrap it entirely.\n\nI hope I'm wrong about multiplayer being the fourth DLC because that would be a textbook definition of a bait and switch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I literally can't play it. Either it's my computer, or it's the game. Every time I open Teardown, whenever I click, the game full on crashes. The few times that it worked, it was extremely laggy and also very repetitive. Watching others play seems fun, but actually playing is boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game, but I just can't.  The concept of having a complete voxel world you can tear apart is fantastic and THAT part of the game, along with the mechanics and physics, is top-notch.  But the game isn't about tearing down a voxel world; it's about completing missions for various NPCs. This honestly isn't a bad thing, either. \r\n\r\nWhere the game goes south is in the handling of those missions. You are given a set of increasingly complex tasks which requires you to set everything up absolutely perfectly--which requires many, many attempts to get it just right--and then given 60 seconds to complete the overall task or heist.  Instead of letting you figure out different ways to fully complete a task, there is literally ONE way to complete it and it has to be done in that 60 second time frame.  It's not fun at all and IMHO, that ruins the game. \r\n\r\nAfter a few hours, I simply lost interest in wasting hours upon hours trying to blow up a wall just right so I could \"hopefully\" dangle a safe out a window without tripping an alarm.\r\n\r\nAnd that's too bad.  Could have been stellar.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "simulated every terrorist attack to ever exist meh tbh. diddnt even play that much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Well LOVED IT i should say. It used to work good for me. But i didnt play for a long time and now that ive come back to it it doesnt even work. It opens up I can get into setting and options but as soon as i click to go into the game it just closes down. completely just shuts the program all the way down. I try and get in thrrew with a mod world and regular play and nothing?! doesnt work no matter what i do? how do i get this fixed?!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sad i couldn't blowtorch my foreskin off, wanted to see if there was a jewish option to make me more money per mission. Was very disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game doesnt work on start up pls fix this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "same one mission again and again. so much potential and such boring gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage, i cant even play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dose not even let me lond it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is broken retruned",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CAN NOT PLAY 0/10!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "STUPID",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I will likely keep playing the game (sunk cost fallacy) and maybe even be Stockholm syndromed into liking it. But, so far, I am really not feeling it. The game has beautiful voxel graphics and crazy destructibility. The tools, like a blowtorch that lets you sever metal, and vehicle driving is very fun, and the missions where you simply have to destroy stuff are great.\n\nWhy the problem, then? Well, after a few missions, everyone amps up security on their stuff, and the game ceases to become about any sort of demolition and becomes a timed heist puzzle game. it's essentially a bait and switch. This alone isn't necessarily bad, I mean, I loved Monaco: What's Yours is Mine, and it was one of my favorite games. But, the alarms simply don't make any logical sense whatsoever. Somehow, the targets slap a museum tier motion sensor solely on the things you have to steal that can't be turned off by any means, as there is no power box for them to find and destroy. Whereas most heist scenarios feature stuff like distracting guards, hacking computers, shutting off power, or misdirection, this game simply uses the invincible alarm as an excuse to make the game harder. Conveniently, these geniuses forgot to put security on anything BESIDES precisely what you are trying to steal.\n\nAs a result, most of the demolition you are able to do doesn't matter in the slightest and is purely for messing around. You can still win just by making a few small holes in walls and proper placement of cars and boats. \"Teardown\" is something of a misnomer.\n\nAdding to the annoyance is that demolition is finicky. Stuff seems to be equally susceptible to destruction no matter the material, so cars crumble like balsa wood when they hit anything and construction vehicles that ought to be nigh-indestructible somehow come apart at the seams. At least at first, you can only attach things with planks that come apart at the slightest bump. This makes it easy to fail complex missions for ridiculous reasons. While it also makes for humorous moments, it doesn't conform to any logic, and in a game that is not just about sandbox goofiness but precision heists, it needs to work when you actually want it to work.  The game urges you to quicksave at every opportunity, probably because it knows it just randomly breaks, but that isn't really a substitute for working properly.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "5 hours in, I'm very mixed. This game feels as if it was built with its destruction first and foremost in mind, everything else was secondary. The missions are restrictive and repetitive. The way you unlock new tools is so unsatisfying.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The dev team retroactively added an EULA which strips anyone who bought before the EULA of their ownership of the game. The devs have fully given into greed with this move. They are literally saying \"fuck you, we have your money and we decide you dont own this anymore.\" Whos to say they wont further change the terms of your \"ownership\" and use of your game?\n\nThis game isnt even multiplayer. Even once that is added, its not PVP. There is quite literally zero reason for an EULA other than pure addiction to money\n\nOh, and they collect data from your PC as well. This game literally has had spyware added into it and you agreed to let it collect data from you when you agreed to their nonsense EULA. I cant install a game I paid for without being forced to consent to having data collection software installed along side it.\n\nIf Tuxedo Labs gets to twist the definition of \"buy\" and \"purchase\" then so do we. Ive decided I own this game and will have it on my PC without spyware and without agreeing to your EULA. As of this moment I have \"bought\" Teardown, that is to say I have the files for the game installed on my PC regardless of the source I am forced to get them from in order to secure my ownership rights.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "this game is an example of developers who don't try their own product before launching it. not even talking about story mode that costs you an insane amount of sanity, folkrace is straight up bullshit, AI cars are made of brick while yours is made of water, you bump their cars and nothing happens. The opposite happens and you're out of the race...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this teardown wont launch on my pc i tried fix this but did not successful fix this problem or cause be bug of this game is not launch anymore then i lost money of fault this game not work my pc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "at first this game seemed fun and the first couple levels were fun but later on in the game the devs ran out of ideas so they decided to abuse the shit out of wired alarm boxes and making the game extemly frustrating and annoying especaly that theres no way to defuse them or avoid them as theyre literally attached to the object you need to steal im not willing to complete this game ever",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This was a great idea for a game with horrible execution. The story missions consist of grabbing some item, then making it out of the map before time expires. Why build a game based on destruction if the only thing you need to destruct is a few walls to steal items and get away in a minute or two?? The one destruction mission I got to didn't even give you the tools to destruct anything - I had to take down a brick tower, and my sledgehammer wouldn't break brick, so I found a bulldozer to use. Yay! right? NOPE - this giant bulldozer gets easily high centered running over small items, it even got stuck trying to run over a handful of voxels, and once it gets high centered it's done. Also, the machine tips over like [b]crazy[/b] even trying to make a turn or climbing a curb, making them completely useless. When you can use the machinery without getting high centered or tipping, the dozer goes through only a handful of walls or moves a car 50 feet before the dozers bucket is [b]completely destroyed and useless. WTF??[/b] - is it made of plastic!?! Why build this whole destructible environment and not let us do anything. Plus the physics are waaay out of whack, one example being the machinery issues I just said, another example -  I took out almost the whole first floor of a brick tower's walls, there were 3 bricks connecting the tower to the ground, and the tower magically stood there without collapsing. AND, when taking out those bricks, the brick tower fell 10 feet to the floor and stayed completely upright intact. I just don't understand how this game has so many positive reviews. ::shrug:: idk, maybe I'm somehow playing the game wrong somehow... I'm extremely disappointed in this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i used to love this game on my ps5 but know when i open it on windows 10 it acts like its opening then closes right after. I have all the right specs for it but it does not even start.   1 out of 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i always wanted teardown but ive been disapointed ever since i got it. everytime i oprn the game, click play, and selected somthing the game kicks me. nothing works and ive just given up. please fix this problem if you can!\n\nnote: im on laptop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was good at first, till some cash greedy cow bought it to release as much dlcs as possible and to challenge EA in not giving a single fuck about the players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yet another victim of DirectSlop 12.\n\nAlso, the developer has phobia towards integrated graphics cards, probably explains why this game has no DirectBased 11 lol.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "First, requires Steam to run. That right there earns any game a thumbs down with me. Now on to the games problems.\nBoring! The entire campaign is just doing the same thing over and over again on the same maps over and over again. Only the location of the objects you need to collect changes. They call them heist missions but it's really just grabbing a number of items and getting to your vehicle in 60 seconds before the alarm sounds. So the entire game play is just setting up a scenario where you can get from point A to point B to point C, etc... before time runs out. Which usually just means knocking a hole in a wall and placing a vehicle where you can get to it quickly. Once you've done this once or twice it begins to feel very repetitive. Especially when it's on a map you've already done this on several times. There is just no variety to the missions.\nThe racing DLC is not much better as the AI drivers are atrocious. They don't acknowledge either you or the other AI drivers. So they constantly try to drive through you and the other AI as if you are not there. So you are constantly being bashing into by the AI. Many times they will literally be stuck to you as they try and occupy the same lane as you. So you will start races over and over and over and over and over and over and over again. And that is not nearly enough 'overs' to come close to describing the extent of the issue. And the AI is so bad that the only way to they could make it a challenge is to put you in a slower car then the AI. And it suffers from an issue seen in many racing games with bad AI. Whatever AI manages to get into first place usually get way ahead because they are no longer bashing into the rest of the field. So for you to win requires that the first place AI crashes. Because they are always faster then you so you will never catch them unless they crash. So that entire DLC is just junk. Unless you just like being wreaked by bad AI repeatedly.\nOn the plus side it supports mods and the modding community is WAY more creative then the devs. And the modding is pretty simple if you have some 3d modeling and coding experience. \nSince I can only thumbs up or down it's down. And of course Steam needs to fix this ridiculous system as up and down is NOT a rating system. It's a vote. Well I vote no! To this game and to the Steams voting system. Devs really need to pressure Steam to change this to an actual rating system.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "In short\n\nNo idea why this game gets such great reviews, it's crap.\n\nIt's incredibly dull, lazy and extremely irritating. \n\nSlightly longer.\n\nThe vast majority of the mission is to steal something attached to an alarm which COULD BE FUN but here's the most idiotic part. As much as the world is destructible, has bags of potential to be creative about different ways to complete a mission, and as much as you're given several tools to ACTUALLY BE CREATIVE ABOUT IT, sadly you just can't do anything other than being forced set off the bloody alarm and so the game's basically a one minute countdown to do X Y and Z even though you could have had way more fun trying to just take the items creatively without having to actually set off alarms.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "used to play was good, then game stopped working like would crash as soon as i opened it not happy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game engine is great but the game isnt really there, the heist thing is ok but if im gonna heist i need to be able to run and move a bit better. im sure it will get interesting with mods and updates but the game dosent live up to the engine currently. nice mood to it, great graphics and music, if i could run i could be more positive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It will not open and it kept closing after i clicked  Campain mode",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they moved the goal posts again with the DLC without announcing anything. it was moved from end of 2024 to end of 2025 now to the first half of 2026. How much do you guys wanna bet that this multiplayer game mode is going to be the paid DLC like Battlestate Games did for Escape from Tarkov?\n\nThe game itself is fun mindless destruction but I can't recommend overall because absolutely terrible communication with players and horrible goalpost moving. Also I can tell that this multiplayer mode is going to break the vast majority of existing mods unless they decide to scrap it entirely.\n\nI hope I'm wrong about multiplayer being the fourth DLC because that would be a textbook definition of a bait and switch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I literally can't play it. Either it's my computer, or it's the game. Every time I open Teardown, whenever I click, the game full on crashes. The few times that it worked, it was extremely laggy and also very repetitive. Watching others play seems fun, but actually playing is boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game, but I just can't.  The concept of having a complete voxel world you can tear apart is fantastic and THAT part of the game, along with the mechanics and physics, is top-notch.  But the game isn't about tearing down a voxel world; it's about completing missions for various NPCs. This honestly isn't a bad thing, either. \r\n\r\nWhere the game goes south is in the handling of those missions. You are given a set of increasingly complex tasks which requires you to set everything up absolutely perfectly--which requires many, many attempts to get it just right--and then given 60 seconds to complete the overall task or heist.  Instead of letting you figure out different ways to fully complete a task, there is literally ONE way to complete it and it has to be done in that 60 second time frame.  It's not fun at all and IMHO, that ruins the game. \r\n\r\nAfter a few hours, I simply lost interest in wasting hours upon hours trying to blow up a wall just right so I could \"hopefully\" dangle a safe out a window without tripping an alarm.\r\n\r\nAnd that's too bad.  Could have been stellar.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "simulated every terrorist attack to ever exist meh tbh. diddnt even play that much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Well LOVED IT i should say. It used to work good for me. But i didnt play for a long time and now that ive come back to it it doesnt even work. It opens up I can get into setting and options but as soon as i click to go into the game it just closes down. completely just shuts the program all the way down. I try and get in thrrew with a mod world and regular play and nothing?! doesnt work no matter what i do? how do i get this fixed?!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sad i couldn't blowtorch my foreskin off, wanted to see if there was a jewish option to make me more money per mission. Was very disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game doesnt work on start up pls fix this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "same one mission again and again. so much potential and such boring gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage, i cant even play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dose not even let me lond it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is broken retruned",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CAN NOT PLAY 0/10!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "STUPID",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I will likely keep playing the game (sunk cost fallacy) and maybe even be Stockholm syndromed into liking it. But, so far, I am really not feeling it. The game has beautiful voxel graphics and crazy destructibility. The tools, like a blowtorch that lets you sever metal, and vehicle driving is very fun, and the missions where you simply have to destroy stuff are great.\n\nWhy the problem, then? Well, after a few missions, everyone amps up security on their stuff, and the game ceases to become about any sort of demolition and becomes a timed heist puzzle game. it's essentially a bait and switch. This alone isn't necessarily bad, I mean, I loved Monaco: What's Yours is Mine, and it was one of my favorite games. But, the alarms simply don't make any logical sense whatsoever. Somehow, the targets slap a museum tier motion sensor solely on the things you have to steal that can't be turned off by any means, as there is no power box for them to find and destroy. Whereas most heist scenarios feature stuff like distracting guards, hacking computers, shutting off power, or misdirection, this game simply uses the invincible alarm as an excuse to make the game harder. Conveniently, these geniuses forgot to put security on anything BESIDES precisely what you are trying to steal.\n\nAs a result, most of the demolition you are able to do doesn't matter in the slightest and is purely for messing around. You can still win just by making a few small holes in walls and proper placement of cars and boats. \"Teardown\" is something of a misnomer.\n\nAdding to the annoyance is that demolition is finicky. Stuff seems to be equally susceptible to destruction no matter the material, so cars crumble like balsa wood when they hit anything and construction vehicles that ought to be nigh-indestructible somehow come apart at the seams. At least at first, you can only attach things with planks that come apart at the slightest bump. This makes it easy to fail complex missions for ridiculous reasons. While it also makes for humorous moments, it doesn't conform to any logic, and in a game that is not just about sandbox goofiness but precision heists, it needs to work when you actually want it to work.  The game urges you to quicksave at every opportunity, probably because it knows it just randomly breaks, but that isn't really a substitute for working properly.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "5 hours in, I'm very mixed. This game feels as if it was built with its destruction first and foremost in mind, everything else was secondary. The missions are restrictive and repetitive. The way you unlock new tools is so unsatisfying.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The dev team retroactively added an EULA which strips anyone who bought before the EULA of their ownership of the game. The devs have fully given into greed with this move. They are literally saying \"fuck you, we have your money and we decide you dont own this anymore.\" Whos to say they wont further change the terms of your \"ownership\" and use of your game?\n\nThis game isnt even multiplayer. Even once that is added, its not PVP. There is quite literally zero reason for an EULA other than pure addiction to money\n\nOh, and they collect data from your PC as well. This game literally has had spyware added into it and you agreed to let it collect data from you when you agreed to their nonsense EULA. I cant install a game I paid for without being forced to consent to having data collection software installed along side it.\n\nIf Tuxedo Labs gets to twist the definition of \"buy\" and \"purchase\" then so do we. Ive decided I own this game and will have it on my PC without spyware and without agreeing to your EULA. As of this moment I have \"bought\" Teardown, that is to say I have the files for the game installed on my PC regardless of the source I am forced to get them from in order to secure my ownership rights.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "this game is an example of developers who don't try their own product before launching it. not even talking about story mode that costs you an insane amount of sanity, folkrace is straight up bullshit, AI cars are made of brick while yours is made of water, you bump their cars and nothing happens. The opposite happens and you're out of the race...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this teardown wont launch on my pc i tried fix this but did not successful fix this problem or cause be bug of this game is not launch anymore then i lost money of fault this game not work my pc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "at first this game seemed fun and the first couple levels were fun but later on in the game the devs ran out of ideas so they decided to abuse the shit out of wired alarm boxes and making the game extemly frustrating and annoying especaly that theres no way to defuse them or avoid them as theyre literally attached to the object you need to steal im not willing to complete this game ever",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This was a great idea for a game with horrible execution. The story missions consist of grabbing some item, then making it out of the map before time expires. Why build a game based on destruction if the only thing you need to destruct is a few walls to steal items and get away in a minute or two?? The one destruction mission I got to didn't even give you the tools to destruct anything - I had to take down a brick tower, and my sledgehammer wouldn't break brick, so I found a bulldozer to use. Yay! right? NOPE - this giant bulldozer gets easily high centered running over small items, it even got stuck trying to run over a handful of voxels, and once it gets high centered it's done. Also, the machine tips over like [b]crazy[/b] even trying to make a turn or climbing a curb, making them completely useless. When you can use the machinery without getting high centered or tipping, the dozer goes through only a handful of walls or moves a car 50 feet before the dozers bucket is [b]completely destroyed and useless. WTF??[/b] - is it made of plastic!?! Why build this whole destructible environment and not let us do anything. Plus the physics are waaay out of whack, one example being the machinery issues I just said, another example -  I took out almost the whole first floor of a brick tower's walls, there were 3 bricks connecting the tower to the ground, and the tower magically stood there without collapsing. AND, when taking out those bricks, the brick tower fell 10 feet to the floor and stayed completely upright intact. I just don't understand how this game has so many positive reviews. ::shrug:: idk, maybe I'm somehow playing the game wrong somehow... I'm extremely disappointed in this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i used to love this game on my ps5 but know when i open it on windows 10 it acts like its opening then closes right after. I have all the right specs for it but it does not even start.   1 out of 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i always wanted teardown but ive been disapointed ever since i got it. everytime i oprn the game, click play, and selected somthing the game kicks me. nothing works and ive just given up. please fix this problem if you can!\n\nnote: im on laptop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was good at first, till some cash greedy cow bought it to release as much dlcs as possible and to challenge EA in not giving a single fuck about the players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yet another victim of DirectSlop 12.\n\nAlso, the developer has phobia towards integrated graphics cards, probably explains why this game has no DirectBased 11 lol.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "First, requires Steam to run. That right there earns any game a thumbs down with me. Now on to the games problems.\nBoring! The entire campaign is just doing the same thing over and over again on the same maps over and over again. Only the location of the objects you need to collect changes. They call them heist missions but it's really just grabbing a number of items and getting to your vehicle in 60 seconds before the alarm sounds. So the entire game play is just setting up a scenario where you can get from point A to point B to point C, etc... before time runs out. Which usually just means knocking a hole in a wall and placing a vehicle where you can get to it quickly. Once you've done this once or twice it begins to feel very repetitive. Especially when it's on a map you've already done this on several times. There is just no variety to the missions.\nThe racing DLC is not much better as the AI drivers are atrocious. They don't acknowledge either you or the other AI drivers. So they constantly try to drive through you and the other AI as if you are not there. So you are constantly being bashing into by the AI. Many times they will literally be stuck to you as they try and occupy the same lane as you. So you will start races over and over and over and over and over and over and over again. And that is not nearly enough 'overs' to come close to describing the extent of the issue. And the AI is so bad that the only way to they could make it a challenge is to put you in a slower car then the AI. And it suffers from an issue seen in many racing games with bad AI. Whatever AI manages to get into first place usually get way ahead because they are no longer bashing into the rest of the field. So for you to win requires that the first place AI crashes. Because they are always faster then you so you will never catch them unless they crash. So that entire DLC is just junk. Unless you just like being wreaked by bad AI repeatedly.\nOn the plus side it supports mods and the modding community is WAY more creative then the devs. And the modding is pretty simple if you have some 3d modeling and coding experience. \nSince I can only thumbs up or down it's down. And of course Steam needs to fix this ridiculous system as up and down is NOT a rating system. It's a vote. Well I vote no! To this game and to the Steams voting system. Devs really need to pressure Steam to change this to an actual rating system.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "In short\n\nNo idea why this game gets such great reviews, it's crap.\n\nIt's incredibly dull, lazy and extremely irritating. \n\nSlightly longer.\n\nThe vast majority of the mission is to steal something attached to an alarm which COULD BE FUN but here's the most idiotic part. As much as the world is destructible, has bags of potential to be creative about different ways to complete a mission, and as much as you're given several tools to ACTUALLY BE CREATIVE ABOUT IT, sadly you just can't do anything other than being forced set off the bloody alarm and so the game's basically a one minute countdown to do X Y and Z even though you could have had way more fun trying to just take the items creatively without having to actually set off alarms.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "used to play was good, then game stopped working like would crash as soon as i opened it not happy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game engine is great but the game isnt really there, the heist thing is ok but if im gonna heist i need to be able to run and move a bit better. im sure it will get interesting with mods and updates but the game dosent live up to the engine currently. nice mood to it, great graphics and music, if i could run i could be more positive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It will not open and it kept closing after i clicked  Campain mode",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they moved the goal posts again with the DLC without announcing anything. it was moved from end of 2024 to end of 2025 now to the first half of 2026. How much do you guys wanna bet that this multiplayer game mode is going to be the paid DLC like Battlestate Games did for Escape from Tarkov?\n\nThe game itself is fun mindless destruction but I can't recommend overall because absolutely terrible communication with players and horrible goalpost moving. Also I can tell that this multiplayer mode is going to break the vast majority of existing mods unless they decide to scrap it entirely.\n\nI hope I'm wrong about multiplayer being the fourth DLC because that would be a textbook definition of a bait and switch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I literally can't play it. Either it's my computer, or it's the game. Every time I open Teardown, whenever I click, the game full on crashes. The few times that it worked, it was extremely laggy and also very repetitive. Watching others play seems fun, but actually playing is boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game, but I just can't.  The concept of having a complete voxel world you can tear apart is fantastic and THAT part of the game, along with the mechanics and physics, is top-notch.  But the game isn't about tearing down a voxel world; it's about completing missions for various NPCs. This honestly isn't a bad thing, either. \r\n\r\nWhere the game goes south is in the handling of those missions. You are given a set of increasingly complex tasks which requires you to set everything up absolutely perfectly--which requires many, many attempts to get it just right--and then given 60 seconds to complete the overall task or heist.  Instead of letting you figure out different ways to fully complete a task, there is literally ONE way to complete it and it has to be done in that 60 second time frame.  It's not fun at all and IMHO, that ruins the game. \r\n\r\nAfter a few hours, I simply lost interest in wasting hours upon hours trying to blow up a wall just right so I could \"hopefully\" dangle a safe out a window without tripping an alarm.\r\n\r\nAnd that's too bad.  Could have been stellar.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "simulated every terrorist attack to ever exist meh tbh. diddnt even play that much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Well LOVED IT i should say. It used to work good for me. But i didnt play for a long time and now that ive come back to it it doesnt even work. It opens up I can get into setting and options but as soon as i click to go into the game it just closes down. completely just shuts the program all the way down. I try and get in thrrew with a mod world and regular play and nothing?! doesnt work no matter what i do? how do i get this fixed?!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sad i couldn't blowtorch my foreskin off, wanted to see if there was a jewish option to make me more money per mission. Was very disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game doesnt work on start up pls fix this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "same one mission again and again. so much potential and such boring gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage, i cant even play the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dose not even let me lond it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is broken retruned",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CAN NOT PLAY 0/10!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "STUPID",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}