{
  "positive": [
    {
      "review": "It's about the journey, not the destination. The ultra late-game of Necesse is characterized by an endless stream of boss fights against bosses you've already fought, just with boosted stats (barring a handful of new bosses in unique zones who then become part of the repeat-with-boosted-stats roster). I may or may not see the game through to the final boss, because the reward at this stage is just boosted stats on my own equipment.\n\nBut that doesn't put me off of recommending it. It just feels like I've hit the \"infinite mode\" at the end of the game (though I know it's not infinite, I'd estimate the ultra lategame provides about as much gameplay as the rest of the game put together, but missing a lot of the variety).\n\nAll the reviews compare this game favorably to other popular games, I'll try to give some details on why those favorable comparisons get drawn. It's in the little details. Like the forge, operating the same as a furnace in minecraft or other games, has two slots by default for smelting. It only smelts one thing at a time, but it smelts the higher-tier ore into bars first, then smelts the lower-tier ore, and it has two output slots so it can go automatically. This prevents you having the \"wall of furnaces\" so common in this kind of game, in my wife and I's MP game, we've gotten to the end of the game using two forges the whole way through. It lets you build a smithy that actually looks like a smithy.\n\nAnd that's another great thing about the game. The decorations. They really let you dress up your base so it feels lived-in. Characters' mood is improved by having a well-decorated bedroom, and your mages enchanting chances are better if they're happier, so you're rewarded for decorating. And it's easy to do, too! Slap down a table and a couple of chairs, craft a decoration for on the table, a few potted plants, and you've got a lively looking bedroom in a few seconds.\n\nA caveat: We play on Adventure (the second-easiest) difficulty, with item drop on death and food spoilage turned off. Neither of us is a big fan of padding playtime with increased difficulty. And at least for us, this is the perfect difficulty. We still die occasionally in fights, but we never get stuck. So my advice if you're reading reviews and put off by some of them mentioning hard bosses: You can change the difficulty midgame, and have nothing to prove to anyone, just tune the difficulty to where you feel comfortable. There aren't even achievements related to difficulty.\n\nAnother great thing to mention is how easy it is to feed your settlers. I'll remind you again: We play with food spoilage turned off, so I'm unfamiliar with how the icebox works, but compared to Rimworld, where the primary difficulty with large bases lies in reliably feeding your colonists, some quick back of the envelope math is all it took to have an infinite food supply going. We have about 45 settlers in our settlement, and I planted 40 of each crop once we had them all available (conveniently, the storage boxes show \"x unknown items\" in the categories, so I knew how many types of seeds there were before we had access to them and could prepare the farmland ahead of time), we had 40 settlers at the time. Settlers automatically replant crops when they harvest them, and every settler is capable of farming and equally competent at it, so combined with a few cooking stations (each workstation can only hold 10 automatic recipes for settlers to craft, which annoyed me when I first ran into it but then I realized naturally makes your base look larger when it [i]should[/i] look larger), we have our settlers automatically crafting every variety of \"gourmet\" quality food. Even before we had the high-tier cooking crafting table, feeding our colonists was never an issue. Nothing is wasted in this game, if you break a blueberry bush, you get a blueberry bush sapling, 100% of the time. So just relocate some blueberry bushes near your housing in the early game and your settlers will be contentedly eating \"simple\" quality blueberries all day until you can sort out your production lines.\n\nI saw a negative review that mentioned the settlement storage settings were confusing. I'm biased coming from 100s of hours of Rimworld, but I found it all fairly intuitive. The kinds of problems you run into with the storage are the same you run into with rimworld, you set a list of allowed things and a priority for the container, so if you forget about a chest on the other side of your base that allows the same things as the one you're looking at, you might be scratching your head wondering where the stuff you're looking for is. But this same system has copy/paste so you can delete a storage and remake it with the same settings instantly if you find a new container you like the aesthetic of more, and you can set a limit to how many stacks of each item are in a container, preventing a \"drops\" storage from filling up with 10000 bones. In the midgame, you unlock a shipping container you can send your colonists on trading missions to sell the contents of, and this is also an option for \"settlement storage\" that you can buy extra copies of. Our base has a shipping container set to lowest priority, all types of seeds, so after filling a couple chests with enough seeds to feed an apocalypse, the extras automatically get sold and donated to the village fund for mining trips. Which that's a whole 'nother fun thing, the mid-game mission board lets you send colonists on mining trips automatically, using coins from settlement storage chests. Combined with automatic crafting at the forges and anvils (remember to actually set the recipes, and for goodness sake avoid my mistake and check that it's set to \"do x times\" not \"do until x\", lest you craft 20 more helmets than you intended to because it doesn't count equipped items), you can easily re-equip your whole base with just a few directions.\n\nThe only downsides to this game are the fact that it leaves you wanting [i]more[/i]. More variety, more to explore, more for your villagers to do. But that isn't to say there isn't a lot there. There really is. I'd estimate we got a solid 50 hours of gameplay each out of the game before we hit the endgame boss grind (so-called \"incursions\"). Someone playing on a higher difficulty would certainly get more time out of the game before reaching the end. Personally, I don't believe games should offer or try to offer \"infinite content/replayability\", I think it leads to bland games. I enjoy the experience of \"running out of game\", after an appropriate length of time of course. Games that go on forever give me a sort of stress because I'm a completionist. This game hits the perfect note of having just barely too much for me to feel like I can do it all (the \"collect every item\" achievement sounds perfectly impossible, if that makes sense), while still being something I can finish to my satisfaction without devoting my life to it. Definitely my game of the year for 2025.",
      "voted_up": true,
      "votes_helpful": 68
    },
    {
      "review": "If you are into RimWorld, Terraria, Core Keeper, ect. This is definetly a must buy !\n The devs are very passionate about this game, and the amount of details and polish truly shows that.\n\n It plays like a top-down Terraria with colony mechanics like RimWorld, after you place your banner you will be assigned to a plot and villagers will start appearing in your settlement. Every villager has different skills, with the exception of the common \"Villager\", which does a bit of everything but doesn't have a particular specialization.\n \n This game also have an automation mechanic, where you can, for an example, send Miners to collect ores for you, Anglers to catch an specific kind of fish you need or Explorers to bring resources/acessories from a specific biome. They can also organize the chests for you, which for me is one of the absolute BEST features of this game!\n\n The progression is linear and felt very satisfying. Essencially you have different biomes and you'll progress through them, every biome has new ores, materials, ingredients and a boss that you can farm to upgrade your gear and keep up with the difficulty, pretty normal stuff.  You can also have your settlers follow you so you can have a party to explore, but be aware that the bosses will have more health the more settlers you bring.\n \n The settlement part for me is where this game truly shines. Managing your colony the way you like, deciding who does what, where they live, what they'll eat, making new houses, decorating them and making everything look nice, it all felt so relaxing, i was always looking foward to having to expand the village and make some new houses for the new settlers, never felt like a chore, which in some games, for me it was.\n\n Overall this game is a true gem, the bosses were honestly, quite easy, but personally it didn't bother me, it was more about the experience rather than the difficulty. This is an easy recommend.\n\n 10/10",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "[h1]Necesse[/h1]\n\nCore keeper x Terraria? if you like one of those games or both you are gonna enjoy necesse a lot. a great game with interesting mechanics and a new fresh way of interacting with npc's, making them feel more \"alive\" and becoming really useful and not just because they can sell you goodies making a army with them to take down bosses it's chaotic and fun. a super positive note that i want to point out is how great the multiplayer-coop features are implemented, i never saw a easier and smoother implementation than this: joining a world, hosting a world, importing save files ecc,,, it's super easy smooth and especially fast without any problems. \n\n[b]Still as much i liked this game i want to provide a honest FEEDBACK because there are few things to talk about[/b]\n1. incursions poor balance: some bosses are way too hard and annoying compared to the others. the biggest example are the moon and sun bosses, moon is braindead easy you could do it even tier 10 with tier 4-5 equipment without any problems just have sprint boots meanwhile, the sun boss is still kicking my ass even with full tier 10 equipment cause? his damn pounches that have aimbot and outrun you even in the overboard the faster you go the faster they will follow you.\n2. surface exploration being stale: literally what i said there are like 4-5? biomes on the surface while underground and incursions have wayyy more variety.\n3. NPC AI: yes i praised them but at the same time if they have a melee weapon they keep rushing so they keep taking contact damage draining all the heals you gave them in a matter of seconds, and if you give them a ranged weapon they will get close anyway not as much as melee npc's but very close.\n4. the graphic?: it's fine but it could be better in terms of shadows, lighting, water and reflections. if this game still had the same graphics of 1-2 years ago i would never have played it, on this field core keeper is years ahead.\n\nso far this game is very promising keep working on it! the road map looks interesting but don't give up on this project necesse has his unique charm and feels/play differently from terraria and core keeper, each of these games are unique on their own way and it's worth playing/trying all of 3.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I honestly started Necesse thinking I’d try it for a bit and move on. That didn’t happen.\r\n\r\nYou jump in for the combat and progression, fighting bosses, upgrading gear, exploring new areas, and it all feels smooth and rewarding. The grind is there, but it’s the good kind. You’re never doing something just because the game tells you to; there’s always a clear reason behind it.\r\n\r\nWhat surprised me most is how naturally the building side sneaks in. One moment you’re out exploring or fighting, the next you’re back home reorganizing storage, tweaking your village layout, placing paths, setting up NPC houses, or just making things look nicer with cosmetics. It never feels like a separate “building mode” it’s just part of the experience.\r\n\r\nIf you like games that balance combat, progression, and creative freedom without overdoing any of it, Necesse really nails that mix. It’s one of those games where you lose track of time without even realizing it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is fun overall. I would like it a bit more with some more polish on gameplay mechanics.\n\nThe game has a great blend of exploration, crafting, and (semi-decent) colony management.\n\nThe game mixes elements similar to Terraria, RimWorld, and Diablo. It does the element mixing fairly well, but does not excel at anything at this time. The game can feel a bit grindy in the middle or so.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The best combination of Core Keeper and Stardew Valley with just a dash of Rimworld.\r\n\r\nEngaging with a satisfying play loop that keeps you coming back for more.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Necesse – A Cozy Chaos Adventure (Couple-Approved!)\r\n\r\nMy husband and I dove into Necesse and were honestly surprised by how much fun we had. The game feels like Terraria and RimWorld had a chill baby—with boss fights that definitely did not get the memo about being chill. They’re creative, varied, and occasionally made us question our life choices. In a fun way.\r\n\r\nThe only real disappointment? Villagers are about as deep as a puddle. You collect them faster than Pokémon, and once you have them all, there’s not much reason to go exploring for more—unless you just enjoy kidnapping NPCs for sport.\r\n\r\nStill, Necesse is a great game with tons of potential, and we had an absolute blast playing it together. Highly recommended for couples who want to build, fight, and laugh at questionable villager AI.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "For me, playing Necesse with friends was more exciting and enjoyable than Stardew Valley, so I'd rate it a 10 out of 10. I also appreciated the game's visuals and mechanics, and I didn't run into any significant bugs during my playthrough.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Big fan of the settler mechanics and I play mostly for this. They can can do work a bit like Rimworld colonists, albeit far simpler (no social dynamics, they just have a happiness attribute). They can also come with you on fights and they're pretty strong. Nothing beats the satisfaction of rolling up with 40 settlers and watching as they melt a boss or blast raiders into oblivion\n\nThe end game material can get pretty boring, though. The incursions are repetitive and feel uninspired. The gear progression can also feel a bit weird at times. Sometimes you get new equipment and it's just a downgrade.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is genuinely a very satisfying play. I stumbled across this via family members and after being burnt out on most gaming, this game seriously uplifted my love of Stardew/Terraria/Minecraft style gameplay.. Only this has all of what I want in ONE GAME!!. Adding settlers to your village is an absolute blast, watching them scurrying around sorting out all the junk you bring back from your hauls is ultimate. Very fun game, and realised a little too late that your worlds are actually saved in the load out screen! LOL... yes yes im a dork. Watched so many youtube videos and it helped with tips to thrive. Only 1 suggestion I would have would be to be able to make a backpack to expand your inventory.. (Not sure yet if this feature is in). Love this game so much. Would recommend any one who loves this style of gaming to give it a shot. Not yet tried Multiplayer, but heard it works like a charm. A+++ So excited to watch this game grow and expand.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Terraria-like game with top down perspective. Has a wide variety of weapons and equipment for different builds and playstyles, as well as two dozen of bosses to use said builds on. It has a settlement manadging elements, with some degree of automation for your farming, fishing and even item manadegement. \r\n\r\nUnlike Terraria, exploration often feels shallow. regular mobs rarely drop anything of value and surface levels are kinda barren. You can find exactly three interesting set pieces there - Village, Dungeon and Pirates, but that's about it.\r\n\r\nOther then that, it's a solid action RPG, with a decent build variety. Can recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Necesse feels very similar to Terraria in terms of progression, and is superior to Core Keeper in practically every way except graphics. It's a game about mining, upgrading gear, base building and light colony simulation. There's a huge overworld which is connected to an underworld (and an under underworld), and you can move between the two freely. 2D combat is decent, with 4 different combat styles. There's a massive ton of decorative elements and structural materials for base building, and exploration is really rewarding.\n\n[b]Pros[/b]\n- The entire world has an above and below - and you can create ladders between the two anywhere\n- There are different trees that all drop specific kinds of wood, rather than just \"wood\" and they all have their own furniture\n- Has craft from nearby chests, and quick stack to nearby chests\n- Handmade dungeons to explore\n- In addition to the mix of Core Keeper / Terraria gameplay, you can also create settlements, hire villagers, create bedrooms and crafting rooms, and create zones for them to work in, with priorities\n- Way more content than Core Keeper\n- Lots of different gear sets and crafting materials\n\n[b]Cons[/b]\n- I hate character movement with acceleration\n- In Core Keeper, if you explore the map while you've got an item on that lights up an area, it uncovers the map. Here, the map only uncovers if you put torches down, which makes the items that light up a lot less fun as you still have to use torches.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A super immersive world with a really solid progression system. Nothing ever feels like a chore, and watching your villagers work in the town you built, which grows alongside your own progress, honestly puts a smile on your face. Every time you think you’re done, the game surprises you with a new system or an area hiding a ton of fresh content.\n\nFirst time in a very long while that a game leaves me feeling almost empty after \"finishing\" it, in a good way! See you next update! :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game just looks like my childhood dream, when I was struggling without the new content in terraria and starbound. World explaining, digging, crafting and so on - they all are maked perfectly. The story is not the shortest one, but not a big as well, and when u start to feel that end is nearby - THERE IS A FREAKING END GAME CONTENT FOR MORE 50+ HOURS (which called incursion mode)... And the true finale in incursion mode... I don't wanna spoil this, but this is was the best one finale lvl I ever play. Claim that there is a coop (I was played with my girlfriend) and other stuff, which I write before - this is the game of the year for me!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My personal game of the year. Necesse 1.0 is truly amazing with a great gameplay loop with some simple but fun colony management thrown into the mix. Haven't enjoyed a game as much as this since Terraria fully released. Absolute must play. Enjoy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just don't play as a group with SEAN BRADLEY. He'll try to bogart EVERYTHING in the base for himself instead of playing communist-necesse like the rest of us!!!!\n\nSean Bradley no longer plays this game with me. He only plays Arc Raiders now. Sad...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "all the best from stardew, terraria, and minecraft combined into a better game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game with more depth than it initally shows. It's pretty much a Terraria in top down view. (which I prefer any day)\nIt's not too challenging (for all your hardcore gamers out there it is probably too easy) - with some expections on some bosses, but it's the perfect mix for me.\nThe 'rim world-y' part is a bit rudimentary but it's okay.\nIt's comparable with Core Keeper which I found a bit more immersive but the colony life in Necesse makes up for it.\n\nIt's great fun in multiplayer but it also shines in single player with option to create an adventure party with NPCs.\n\nHighly recommended!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "é só craftar um barco e viver como pirata, recomendo muito roubar camas dos vilarejos o que não vai faltar é emoção",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing, the love child of minecraft, terraria, rimworld and stardew. Very hooked already and looking forward to playing many many more hours. \n\nThe early game has been quite easy to navigate so far, with the tutorial and starter house providing a good spring board to learn how to play. \n\nThe mechanics are very familiar but with a new twist, im a particular fan of the settlement and villager system, having people be able to do the chores works well. \n\nKeen to see where this game goes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is still in it's baby-shoes but it's got great potential and the endgame is such a nice change to these type of games. 8/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "เกมดี ผู้พัฒนาใส่ใจผู้เล่น มีอัปเดตให้ดูตลอด \nQuality of life มาก ๆ มาลองเล่นกันได้นะ สนุกเต็ม 10 เลย",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rimworld esintili, mod destekli, scripted boss fight lı oyun işte. İndirimde gideri var.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First time coming back to the game with the new incursion system. Super rewarding to be able to complete the game, primarily due to the difficulty of the bosses itself but also being challenging almost like a souls game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "boi i love this game its like the third lost brother of minecraft and terraria",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Retro look is amazing and the gameplay loop is very fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic little gem of a game, it's mainly an exploration game, with some combat, and a surprisingly large amount of automation possible with the settlements. Though, like most other Terraria-like games, playing with friends is significantly more fun, whereas the game can be downright boring at times in single-player",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very relaxing game, I love relaxing in it with my girlfriend (double bed for the win) and the music is nice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a very similar game to Terraria (one of my personal favorites), but it changes enough to make it interesting. There is a lot more automation with your villagers, including making them sort your horrendous storage for you. With the release of 1.0 this year (which added biomes blending together, among other things), the game feels much more alive. Definitely would recommend checking this one out if you're a fan of games like Terraria",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game description is accurate. Early access was very good, 1.0 release is even better. A++ Would play again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "zerei, compensa mt, mas vai chegando no end game vc vai ficando numa raiva pq os bosses ficam desgraçados de rapidos",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "More fun playing underground, and beyond underground. 😁",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a great game with a lot of content. It feels like a mix between Minecraft and Valheim. There are lots of quality of life features that make the game relaxing to play and I predict the community mods for this game will be terrific. The content feels endless, however by the late game (end game) it can feel a bit repetitive. The only real issue I have with the game is that I paid for a server to play with my friends and after logging off for the night when we logged back on we would mysteriously loose multiple villagers. At first we thought they were dying to offline raids but upon further testing, we concluded it was a bug. We don't know if it's an issue with the game or the server (We used the recommended server website called \"shockbyte\"). Other than that I would highly recommend playing this game, with it's fair price point, variety in bosses and content, you can't go wrong. 5/5 stars.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is straight fire holy you need to play this its like terraria and some other game had sexy time or sum idk just play it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Necesse is great, buy it, play it, love it.\n\nMy favourite part about it is the NPC automation/settlement Stuff, I love the fact that the NPC can defend themselves, fight for you, take them on adventures and makes it fun to take care of them since they take care of you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great fun!\n\nI love to make a cozy and neat looking settlement. \nExploration feels rewarding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game and I can't wait to see what they add next",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Necesse is a fun game. I've played for 13 hours and feel like I have barely scratched the surface. It's best enjoyed playing blind so you get a true sense of adventure and exploration.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's good. \nA bit challenging, but that's a bonus imo.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An amazing mix of Rimworld and Terraria. \nManage your settlement, employ settlers to farm, cook, chop wood and do several more tasks for you. Then go into the underground to fight monsters and bosses. You can even equip your settlers with equipment and take them all with you!\nEquipment is very varied in each category (melee, ranged, magic, summons, armor) and fun to play around with. \nThe artwork is amaing, everything just looks great. There is plenty of different decorations to craft/find for your settlement and most of my time I just spent building new houses and decorating them. It's something I was really missing in Rimworld, and this game really scratches that settlement building itch :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If Terraria, Rimworld and Stardew Valley had a baby it would be called Necesse.\r\nEasy to learn, a lot to explore and multiplayer! \r\nAll that for a good price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its like Animal Crossing & Terraria loved each other very much imo. The type of game where \"I want to not be stressed out, and explore when I'm alone at 2am on a Friday after work\" experience is done right.\n\n- Interesting boss fights.\n- Mayor of your own town, the residents you choose from random strangers.\n- EXPANSIVE map system (its huge, I can't drive that home to you enough lol).\n- Cozy retro style graphics, with nice modern frame rates.\n- Vast Topside, and Deep Dark Dungeon delving exploration mix is perfect.\n\n+Recommend! I hardly see myself playing this game for more than an hour at a time, but that doesn't discount the game feels cozy like a warm blanket on a snowy night. The game feels light and endearing, while satisfying my itch to explore. Dealing with inventory management, villager satisfaction, and the odd boss fight is about as stressful as this game gets. Its worth it on sale, probably full price too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really liked the game so far! its great for someone who likes to explore,build,micromanage npcs,fight,etc.\r\n\r\nThere is a lot to like about this game for me right out the gate, and I will provide some examples (although I'll narrow it down). The range of combat items, the very customizable storage options + the hauling mechanic, Very useful items given early game (scrolls that let you tp to your settlement), the amount of cool armor and ability to use it as cosmectics if desired, blah blah blah etc. I just have a lot of things I like about this game, I could go on. \r\n\r\nThe game is new, so keeping that in mind while I explain one dislike I do have\r\n-biome fatigue. So far there are not a lot of biomes, so I often find myself exploring but cycling through the same structures above and below ground. I do not know if there are plans to expand that, but I would be nice to have more biomes in the future!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game! Did a full playthrough with a mate of mine we had a blast! Definitely recommend! Everything is fun, nothing felt like a real grind.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mix of minecraft, terraria, stardew valley and rimworld. Best of all worlds and just a crazy amount of content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Little Game to have Downloaded, Awesome Playability and Replayability.\r\nSingleplayer is Good and Game is Even Better with a Friend or Two on Multiplayer.\r\nTerraria/ Rimworld Style Game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "How did I manage to get over 600 hours played? When did that happen?! Yes, I like this game. REALLY like this game. I just hadn't realized that I've sunk that much time into it. \n\nThis game hits the sweet spot between engaging and not too complicated. Even if I've had a rough day at work, I have have enough mental power left to chill out and work on a small project or near mindlessly clear an Incursion. If I want something more challenging, I play a map that's more challenging. If I want something chill, I play an easier map. \n\nThere's a certain charm to setting up whole themed villages and making all the NPCs dress up like jesters, or frogs. Swamp village. Everyone wearing frog costumes. That is a WIN.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm surprised this game hasn't gotten more attention. Honestly one of the most fun games I've played in a while. \n\nIt's kind of like 2D top down minecraft with some elements of Stardew Valley / Rimworld, but in the late game, it becomes more like Diablo 2 or Path of Exile. \n\nYou can decide what playstyle(s) you're most interested in, and how much to automate/outsource vs. how much to do manually. \n\nIt really is like 3 games at once, and somehow they are all executed well. Really excited to see what future updates are like, and hope more people buy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Never played Stardew Valley, but I love Terraria, and mainly Terraria Unique weapons, bosses and overall combat vibe. This game gives Stardew Valley up-down look, Terraria combat, and RimWorld villager systems (never played RimWorld)\n\nI'm addicted",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "been playing since beta and was sad by how plain it felt, picking up the game a year later and everything is much more polished and amazing, the graphics are 100% better and the gameplay is much more impressive, definitely would recommend to play!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game. You can tell it's inspired by similar games, but has a feel of its own. I love the sorting mechanics in the game, they thought of everything for that,\r\n\r\nThe companion mechanic is nice, its fun that you can personalize everything.\r\n\r\nThe new release changed the maps, which I am still conflicted about, but it does make some mechanics in the game more useful. The new settlement system so that there's a range rather than a whole square. The only issue is the lingering mobs from stronger areas coming into the forest.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Combination of Terraria, Minecraft, Stardew Valley, Path of exile(near end) in a cute package.\r\n\r\nA great combination wich doesnt force anyone in a perticular playstyle, freeroaming sandbox.\r\n\r\nCan recomend 10\\10 if your into this sort of game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played this game briefly ~4 years ago and recently seen that it had been released into 1.0. I gave it a go again and now have over 30 hours and still climbing! Definitely worth a pickup if you like a Terraria-esque survival sandbox with some elements from Rimworld sprinkled in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's been a while since a game has had me so hooked! This game would be my personal GOTY for 2025. there is so much content and such a great open world with some fantastic bosses. Its a simple formula but done spectacularly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good mashup of terraria and rimworld, maybe even a little bit of stardew valley, actual goated game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After playing Stardew Valley, Terraria, and Core Keeper, this has become my favorite. Necesse has crafting, farming, and adventure with lots of exploration. It also has some management and automation via NPCs. It has a wonder full mix of all these things. When I get tired of exploring and mining, I can sit back at home base to build and plan out roles for the NPC. Not to mention arm those NPC to join me on quests. This game is awesome and hope more gamers check it out! I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got the game to play co-op and honestly it's been really fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's basically a top down Terraria with mild colony sim elements (mostly for automation & settlement defense). My only gripe would be that it is of course closer to the release version of Terraria, than the one we know after all its updates today, but hopefully this game will also receive a lot of long term love & updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Base building, management, rpg builds necesse give you alot to like!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun mix of Terraria and Rimworld, even better with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A combination of Minecraft, Terraria, Stardew Valley, and Rimworld. I really enjoy the building, mining and settlement building aspects. Having quests that drive you to fight bosses and grow stronger gives direction, while allowing for different paths for improvements. The game lets you automate nearly everything using your settlement's residents. This allows for more time to mine, build and explore if you desire. Hoping this game continues to add new content. Mechanically it is in a great spot, although melee combat is quite underpowered compared, to Ranged, Magic and Summon styles. I'm over 100 hours in and still enjoying the game, with bosses left to fight.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Came to this game from a suggestion after playing Keplerth.\r\nVery fun. Love the settler system and managing and buildings towns/villages.\r\nThe combat is fun and the ability to switch playstyles via trinket swapping prevents things from going stale.\r\nEndgame incursions are fun and upgrading our your gear makes you feel powerful.\r\n9.9/10   ( -.1 this game has crappy hairstyles)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[b] The game is a great companion to Terraria and a distant cousin of Rimworld. [/b]\n\nVillage management is shallow and pointless; the only thing that really interests us is making sure that food doesn't spoil and that our residents have some armor and weapons. The entire chest management system is pointless because it works without any involvement from the player (the refrigerator is the only thing we care about). To complete the game in this part, all we need is some farmland, fruit trees and bushes, beehives and bees, and an artificial water reservoir - this way we have unlimited food.\n\n[b] Terraria is famous for its combat and bosses. Here, well, according to the meme “Terraria at home”. [/b]\n\nDespite the truly numerous options for armor and trinkets, classic styles such as warrior, marksman, mage, and summoner can be really disappointing. The bosses in this game are fast and rarely find themselves in a static phase that should be a window of opportunity for shooters and warriors to deal DPS. Of all the bosses (13), only six were fair to the warrior class in my opinion, while the rest favored mages and summoners for one simple reason: almost every boss (except for the witch) is bullet hell. We have about 100 trinekts, which is quite a lot, but what's the point if many of them are just there for the sake of it and don't make sense. We have shields that negate up to 90% of damage, but then we can't do anything else but block. Overall, combat in this game is torture. Enemies are fast, and our projectiles/magic are slow. What's the point of having a dozen or so weapon options if we're stuck with the one that works better, despite often dealing much less damage and having a longer time to kill? It has come to such a pathology that the only right choice in this game is weapons with auto-targeting.\n\n[b] Even though fighting is exciting and even fun, it's like having fun at a water park without water. [/b]\n\n[b] Exploration in this game is like playing with a dead cat. [/b]\n\nThe game is divided into several “layers.” The first is the normal surface, where we encounter minimal danger, collect basic resources, and encounter animals, villages, and NPCs. Then there are caves, which, as is usually the case with caves, are underground, and this is where the main part of the game takes place. We can encounter some truly amazing structures that outshine Terraria. Some of these structures were really great, almost like in Starbound – a slime farm in the swamps? Or maybe a vampire tomb with a victim on the table?\n\n[b] Finding newer and newer ready-made structures is the best part of this game. [/b]\n\nThe rest of the exploration is torture, biomes overlap, there is no minimum size for biomes, which means you can end up with a seed map where you won't be able to progress because the boss arena simply won't spawn. While the second layer of the game, “caves,” is great, and I recommend finishing the game after defeating the pirate captain, the third layer of the game, “deep caves,” is a total mess. I tried 5 different seeds and each one was the same, with cut-up map strips that don't connect, biomes that fight for every pixel - overall, something didn't work out here.\n\n[b] I still recommend the game, but it really does have a lot of issues that become apparent over time. It's a great diversion for 20-40 hours, but nothing more. [/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Necesse is a top-down Terraria-like. While at a glance it might seem more similar to Core Keeper, it has a lot in common with Terraria that doesn't apply to Core Keeper, so I think it's important to point out the relation to Terraria even if it visually looks like Core Keeper.\n\nThis was the first game in a while I played with a keyboard and mouse instead of a controller. I used a Pinky4 keyboard and a Ploopy Classic Trackball mouse. I had researched the game for a few days before starting it and many people mentioned the controls being a bit bad on controller, particularly for the menu navigation and Settlement management aspects, though some say controller is fine for combat. Maybe with a handheld Steam Deck or Steam Controller it'd play okay.\n\nNecesse had me hooked within the first 3-6 hours or so. Once you get a handle on the controls and some of the basic stuff you'll be doing a lot of (mine ore, fight boss, repeat, etc.) it's easy to get into a nice flow. The soundtrack is pretty good and you can find in-game vinyls for most (all?) of the BGM and then override what you hear playing back at your base, or even on the go if you get a portable player.\n\nYou have hunger to manage for both you and your Settlers. Food satiates your hunger and also buffs some stats. You can only have the buffs from one food item at once, and whatever you eat last is what \"wins\". Higher tier food tends to keep you full longer and have better buffs, but it will spoil faster. For your Settlers, variety of food matters for their Happiness stat. You'll ideally want to automatically be crafting a variety of Gourmet food items to get the best Happiness bonus from food.\n\nSpeaking of automation, that's the main point of your Settlers. What would probably be done with machines in another game is done with slav- I mean Settlers in this game, a bit like how Senkuu outsources his labor in Dr. Stone. Settlers come in different varieties. There is the basic Villager that can only do the same 4 jobs most types can do, and then there are specialists like the Angler who can buy/sell certain items and can do other kinds of work. While it may be tempting to ignore the Settler system if you're coming from a game like Terraria where you do everything by hand, I would strongly encourage you to learn it and use it. It goes from \"ugh they keep moving my items, this is so annoying to deal with\" to \"oh okay this is pretty nice now that I'm figuring out the chest rules and stuff\" and later \"wow that final boss was way too hard, it would probably be impossible to beat without my army of 30+ Settlers assisting me in battle\". That's right, you can take them into battle. This is a very cool mechanic and makes the game feel more like multiplayer even in singleplayer. There is a special type of Settler known as the Guard whose main purpose is basically to go into battle with you, but you can take the other types with you as well. The main reason to prioritize Guards is probably just that they can't do much work otherwise, just move items around, not farm or anything.\n\nNecesse seems to encourage a lot of JIT (just in time) production, for better or worse. I touched on the spoiled food thing earlier. Basically, you might see you have the ingredients to make a whole stack of Fried Chicken, so you do it. Now you'll be eating well, and so will your Settlers, right? Well, this is satiating stuff, and it spoils in 2 hours. Most likely it'll go bad before you can possibly use it all up. You can make Spoiled Food into Fertilizer, but generally you want to avoid letting too much food spoil. So you end up setting max amounts of each food type to be made/stored that aren't much more than the # of Settlers you have, and then maybe automate the selling of the rest via Shipping Chests. There is a lot of micromanagement of the chest rules while you're figuring stuff out, and they can be annoying, but it does work well once you have it all in place. An example of an annoyance is you see swords are appearing in your ores/bars chest for some reason and you don't want them there, so you disallow them in the settings, but then it turns out they were allowed in 1 or 2 other chests and your Settlers keep moving them to the next one until you've properly banished the item from them all. Automated selling is also a bit risky as they may try to sell a nice item you don't want them to, and if you aren't manually checking your Shipping Chests, you can say goodbye to that cool sword you forgot you had. If you do wanna hoard random cool stuff without it being moved or sold, you can have chests outside the \"network\" so that the Settlers can't touch them.\n\nI was able to get all the achievements in this game after around 120 hours or so. Complete Collector was the last one I got. You may want to start on it early if you're also going for all the achievements. Specifically, farm pigs to make the Majestic Pig Statue ASAP, dig up every type of floor and wall you see, pick up every type of furniture you see. Don't leave new items on the ground. As long as it's passed through your hands (inventory) briefly, it counts. You can also enable a tracker for the achievement and view a list of items you haven't found yet, although I wouldn't enable this until you're done with most other stuff in the game since it takes up a lot of screen real estate.\n\nA few of the bosses in this game struck me as \"bullshit hard\", but usually changing up my build, using more buffs, taking more Settlers with me, or improving the gear of my Settlers was enough to get unstuck eventually. I played the whole game on the default difficulty and never turned it up or down. I have read comments from people taking more tries than me to beat certain bosses, so I would say I was at least somewhat skilled at the game, meaning you may have even more trouble than me. If you are sensitive to difficult/unbalanced games (after 100%ing the game I think I can safely say they could tone down some things without it just being considered a skill issue) you may want to steer clear or at least play on a lower difficulty (or just turn it down when you get stuck).\n\nI would say this game is significantly harder than Core Keeper. I haven't played Terraria in a few years now so I'm not sure if I'd say it's harder than Terraria or kinda similar.\n\nI hit one extremely nasty bug near the end of my run that I think needs to be noted. I loaded up my world and noticed almost all my Settlers had vanished, along with their expensive equipment I'd given them. I had 6 Settlers instead of 32. No idea what caused this. Luckily the game takes automated save backups. I loaded the previous day's, still gone, repeat a few times, 4 or 5 days back in time they were all there again. I finished my run on that restored save. Unfortunately restored saves are treated like new worlds and my map was blank and unexplored again. This would probably be fixable by the Cartographer Table, but... it's currently broken and disabled. Quite the nasty combo of issues. At least I knew my map well enough to get around and I was almost done with the game by this point. I would not have been able to continue beating the final boss without my Settlers and would not have been able to get the last of the achievements, so I consider this a game-breaking issue and extremely serious. Almost enough to make me not recommend the game, but the dev seems active and he seems to care about the players, so I think it'll get sorted out. Plus, I played over 100 hours before I ever hit the issue. I'd say just check your Settler count when quitting out and when loading back in, and roll back ASAP if something is fishy.\n\nOverall I enjoyed the game a lot and it kept me entertained for the whole month of November. There's a lot of depth to it and if you like games like Terraria and Core Keeper, possibly RimWorld also (haven't played it), you will likely enjoy this. You can likely get the game on sale for under $10 also, so it's a pretty good deal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So, first of all, my review is before the 1.0 update, and I hope to come back to update this later, but...\r\n\r\nHonestly I'm a big fan It took me a while at first to figure out how to play, but finding documentation is really easy, and once I got that I was able to really get going. It's clear this is a labour of love - not unlike how Terraria and Stardew Valley and other such games are.\r\n\r\nI'm not going to go too in depth on anything, since 1.0 is out and I'm about to start for the first time since it's release, but even in early access this game had over 30 hours of content - and I didn't even get to the truly hard stuff - so I'm happy giving this a recommendation!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stardew valley, terraria, core keeper and a dash of something else.\nCompared to those games, content is still fairly limited, even at 1.0\n\nBut it scratches an itch, for now.\nDefinitely better with friends - as base building is pretty expansive, and bosses are quite hard to face alone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I loved this game, especially in its early stages. The core loop of farming for items, crafting powerful gear, and tackling tough bosses is incredibly satisfying. Creating a living army to fight alongside you is the icing on the cake! If you enjoy games that deeply immerse you in resource gathering and challenging boss fights, I highly recommend it.\n\n-also, review for the badge.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun, worth the money. Terraria crossed with Rimworld base, with a slight hint of Deep Rock Galactic \r\n and Trove??",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, I wasn't expecting much from this game but it has completely surprised me with how enjoyable it is. \r\n\r\nThere's tons of content to get through, the combat is fun, bosses are challenging but not impossible, builds are very customizable, automation is intuitive and pretty easy to set up, and the building aspect of the game has a decent amount of options.\r\n\r\nI think if you like games like terraria then I think you'll enjoy this game, but if you don't like terraria then I think you might still find something to enjoy in this game. Personally I'm not a big terraria fan (I only played it because my friend forced me lol) but I've had a lot of fun in the game especially when it comes to the colony sim aspect of it. If you enjoy stuff like colony sims, sandbox games, rpgs, or maybe even farming sims then I think you'll find something to like about this game.\r\n\r\nTLDR: the game is great! lots of fun with or without friends and there's lots to do, something to like for everybody.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well, it is Terraria with top-down perspective. Progression, items, all very familiar and so are bosses abilities. However, w/o gravity gameplay feels a bit shallower. On the other hand you get some QoL, like batter management of settlement and automation via villagers(totally optional).\n\nHaving said that I really wish there would be a neutral review option, but just to show developer support I'll leave it as positive. For me game only lasted for few hours, and then it became just same stuff over-and-over again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought this from sale and got addicted to it straight away! Worth every penny, even when it's full price. The co-op is super fun; I get to decorate and build the village for our new settlers (and also spend all of our money in new outfits) and when the other one gets tired of bringing materials to build, we can head to the mines to slay some monsters and get gold (also we got really really addicted exploring the caves and getting gold). It's also super addicting and fun as single player too but if you always hoped for Rimworld x Stardew Valley-kinda game with co-op possibility, this is it. It's definitely more casual than Rimworld but at the same time definitely more interesting than Stardew Valley. There ain't no stupid energy level or clock to follow, only health, stam and food (and I guess mana if you pick mana weapons?). You can be in the mines as long as you want to so you don't need to run back home in panic because \"it's 2am, you're 'bout to pass out\".  The mines also offer you everything you need. Forgot your torches? No worries, you'll get them from the mines. Forgot health? No worries, you'll find them from the mines. Getting your butt kicked in the mines because you went a bit too deep? No worries, you'll find recall rolls that teleport you immediately back to your spawn if you wish so. There are so much variety on the enemies too. My favorite so far is the \"Suspiciously Tall Goblin\". I seriously can't think of anything bad to say about the game, it's waaay more than I expected it to be and I'm super positively surprised. There is definitely a reason why the reviews are overwhelmingly positive!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You like to explore, build or manage your own village?  You'll enjoy this game either solo or with friends.  Fun to create your own village with cool NPCs, farms, livestock and defenses.  Many bosses to find and defeat.  Also the great Steam Workshop community to tweak the game how you like.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's basically Terraria with a top-down view and significantly better NPCs.\n\nThe NPCs can do practically everything: \n- Chop down and replant trees. \n- Grow crops and flowers. \n- Care for animals (feeding, harvesting, slaughtering). \n- Undertake expeditions to mine ore. \n- Fish/hunt. \n- Craft/cook. \n- Act as a guard/private army for the player and fight monsters and bosses (depending on their number and equipment). \n- Sort loot into storage chests. \n- And much more. \n\nAchievements aren't difficult to obtain, except for the \"Complete Collector\" achievement, which requires collecting almost 2,000 items and involves a significant amount of randomness.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love terraria, and this is like a fleshed out top down terraria and i like it, and I perseonally love it just as much as Terraria",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is great, scratches a lot of different itches:\n* fun to explore the world with lots of little points of interest\n* good sense of progression from going through the bosses\n* colony management without much hassle\n\nThe main thing I want is more. More biomes, more points of interest to discover, more varied weapons. What is there is great, I hope the dev and modding community will continue to add more content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun sandbox survival game. The game allows you to build a settlement with villagers and automate farming, animal husbandry and crafting. Some game play still necessary. Simple enough but fun for a casual like me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is really nice, trying to merge the best of games like terraria and minecraft, but with something fresh. I think they need more time to polish the game and fix some things, but I would definitely recommend this game to seasoned miners and explorers of fantasy worlds, like me. I don't really like the pixelart, and they need to put some more items and equipment like mounts, but nothing that can't be fixed with time. I hope this game will not be abanoned like many others.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A pretty cool little game, great to play with some friends and different enough from Terraria and other Sandbox survival  games for it to be unique. Plenty to do from building and automating a base to exploring what the depths of the underground have to offer. Boss fights with ranging difficulty of mechanics to peaceful base building and resource gathering. \nNot only is the base game great, but the mod support is pretty awesome too. Make the game more replayable, add new monsters, weapons, armour  and more automation. Better base building, more NPC options and cool new blocks to decorate with. \nDefinitely a game worth playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun, better with Friends for sure but is doable solo.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The perfect friend group will always have:\n- One friend that likes to build the base and automate item farms\n- One friend that likes to explore the map and find new things\n- One friend that wants to craft everything in the recipe book\n- One friend that constantly rushes bosses to farm expensive items\n- The merchant",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Necesse is basically a (worse) copy of Terraria but instead of side view perspective its has a topdown view. \n\n\n+ Co op works great and is a lot of fun.\n+ There is a lot of content - base building, village management, bosses, dungeons, crafting, magic, combat.\n+ Its a huge, neverending sandbox, you can do a lot if you have the imagination and time.\n+ Environments are varied and there are a lot of items, weapons, armours and trinkets.\n\n- Combat and especially bosses feel uninspired, none of them are interesting.\n- There are no unique locations, everything is randomly generated so nothing feels interesting.\n- Incursion post end game content feels a bit lackluster, its also very grindy and there are like three new bosses, everything eisel is copy pasted from previous content.\n- Village management is annoying and not really worth it for most of the aspects of it.\n\n\nPersonally i didnt enjoy it as much, its alright, doesnt shine in any aspect but doesnt have any glaring issues either. Instead of this I would recommend playing either Terraria or Core Keeper for much tighter gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lovely game! I very much enjoy building my settlement and taking my time discovering new things. As usual, it's very satisfying top get a new tool and hit the caves! I wish there was a little bit more interaction with the villagers, storied interactions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's sort of like a Terraria from top down instead of side view.  But it's different in a lot of ways as well.  Core gameplay is survival crafting and a sorta fallout 4-ish settlement system.  It's a nice one, it plays well, and I'm enjoying it so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is incredibly fun. I played pre 1.0 and found there to be some problems, but honestly every complaint I had is gone. The open map without loading zones for the different areas (aside from going deep and deeper) is really good. I love being a mage in this game, its so fun to just blast enemies with any number of different spells. \r\nThe settlement system is fun, though I wish there was more the settlers could do. I enjoyed building my little hamlet and making the goobers happy (Give them carpet and whatever placeables I can find in the world).\r\nI do think some things could be improved, such as getting void shards as after your first dungeon completion it can be kinda tedious waiting for the apprentice to spawn and then die, or killing the mage over and over. I guess I'd like a mid game version of the dungeon, i.e something you can do around the same time your going into the deep caves. I also think that more settlers should be able to go on missions or have unique abilities besides selling stuff, as after the 3rd boss or so I did not really need to buy anything from the settlers so they just farmed and maybe crafted some food or did ingots. The 4 settler types who can go on missions are some of the most useful and everything else falls, at best, into second place.\r\nThe game has a lot of potential and I look forward to seeing where it goes!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like stardew valley, minecraft, and terraria, you'll probably also love this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far I am really enjoying this game. I think this definitely deserves a play if you enjoy mining / recourse collecting / settlement building games games like Stardew or Terraria this could be one for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the game I have been looking for during the last decades! Finally someone made it!\n\nColony, survival, and monsters! Play it, you need to play it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun! Sort of a cross between terraria, star dew valley and uh dwarf fortress or rim world. Don't know how I didn't find this sooner but it's a blast especially with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starts out as a decent (if a little too obvious) Terraria clone, but grows into a brilliant game in its own right.\n\nSettler management is one of the highlights - you can assign all your settlers to various tasks around the place such as farming, hunting, and taking care of your animals, making it feel more like an actual village rather than an NPC storehouse. You can also have them tag along with you on adventures - i'm not entirely sure about the pros and cons of this, but i love that you can.\n\nDecent variety of weapons and armour, stifled only by progression being perhaps a little too fast at times - you can kind of ignore a lot of the gear, but at least theres options. Many sets of armour have interchangeable helms depending on what type of build youre using, making it easier to swap around.\n\nThe weakest part of Necesse is the mid/late game - i think some of the later biomes lack personality somewhat; you just kind of show up, clear the area out, do the boss and leave. There is far less focus on mining, and the games strength lies mostly in exploring existing caves/dungeons, and mining when you have to. The first few areas capture that joy of discovery and exploration, the later ones far less so. The bosses are still good it just feels like the biomes themselves could have had more to do.\n\nEnd/post game content is surprisingly engaging, and really brought the game back for me. You are able to rematch scaled up versions of bosses (and some new ones) to farm new gear and scale up old gear. This gear can also be farmed somewhat easily (if you arent bothered about random parts) to catch up your villagers, which was a brilliant design choice to avoid monotonous/frustrating grind.\n\nGreat soundtrack and some really cool boss designs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has consumed the last 2 days of my life, buy this goddamn game. its that good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game me and my dad got this and played it together and built up a grand fortress of a settlement we kept calling it a mix of terraria and RimWorld.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The attention to detail in this game is off the charts!\nkeeps surprising me with \"Those little things\"...\n:)\nTwo thumbs up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got this game on sale thinking i would play it for a for a short time and forget about it., Well 96 hours in and still going strong. it will suck you in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the rare heavily Terraria-inspired games that actually manages to scratch the same itch, and even improve upon Terraria in some ways instead of trying to mix in its own thing and failing at it. The settlement system is genius, as it allows you to automate parts of the gameplay loop you don't like while focusing on the parts you do like, while also feeling like a natural expansion on Terraria's NPC system. For me, I am not a fan of farming, chopping trees, and sorting my chests, so assigning them to my settlers was a godsend while I went off to enjoy spelunking and getting loot from the caves below.\n\nSpelunking is great fun in the first half of the game. The caverns are spacious and give you a lot of movement room to fight enemies, and you rarely need to dig long tunnels to reach more caverns. Every biome has the usual basic melee and ranged enemies, but mix in unique enemy types and hazards to keep you on your toes. The bosses are also a lot of fun and have good variety.\n\nUnfortunately, I think that the game stumbles in some major areas. You're going to see a pattern here.\n\nBecause light blocks off enemy spawns, dying outside of boss fights means absolutely nothing, since you can casually walk back over to pick up your stuff without any pushback from enemies. Terraria makes it significantly harder to block enemy spawns to the point where it's not worth doing, so in that game you have to fight enemies to get back to where you died. The only thing you can do to make death actually mean something is to enable permadeath, which I'd rather not do in a game that can take 20+ hours to finish. I modded the game to allow enemies in caves to spawn in light, and found it much better for it.\n\nBeing able to place ladders anywhere to go underground seems like a great idea in theory, but it results in them being hilariously overpowered. The surface has no real threats to you, even at night, so you have a cheap craftable item that lets you essentially teleport to wherever you want underground, making it too effortless to sequence break and undermine the whole spelunking aspect of the game. I modded ladders to be static objects that I can't craft, and must use the starting house and nearby villages to go underground. This forces me to actually interface with the caves. (Deep ladders are still craftable and placeable, but I restricted them to only be placeable near normal ladders.)\n\nCavelings (think of them as reverse mimics) and certain enemies dropping ores encourage grinding to get the gear you need to progress instead of exploration. Certain boss arenas can be a pain to locate since biomes don't always spawn them. The Portal Flask you can get late into the game kills all sense of danger even more than enemy-blocking light does, since you can place an instant fast travel point literally wherever you want for free. It can be annoying to die to a boss multiple times since it means grinding for more of its summon item each time you fail, when I'd rather just immediately retry the boss from the beginning of the fight, since restarting the fight already has enough weight on failure (although to be fair, Terraria has the same problem). There are two enemy types in the second half of the game that look exactly the same but must be treated differently in combat because of one being melee and the other being ranged, making them obnoxious to fight. Of course, I fixed all of these issues with modding.\n\nBasically, this game reaches similar highs to Terraria for me, but only after I tweaked a bunch of stuff with mods. If it wasn't for the game being so easily moddable due to it being written in Java, I would've dropped it a long time ago. It also helps that most of my complaints with the game only require some small tweaking to fix.\n\nThere is one thing that isn't easily fixable, though. I am not a fan of the second half of the game, the Deep Caves. It throws what I liked about the first half of the game out the window with overly cramped cave systems that require ridiculous amounts of digging to reach more caves, practically begging you to abuse the \"place ladders wherever you want\" mechanic to get anywhere (which is just not a fun way to go spelunking and why I modded it out), and doesn't provide enough room to fight the much harder enemies without spending a ridiculous amount of money on dynamite. What was so enjoyable about the normal caves was all the open space and natural interconnecting tunnels making it more about exploration than digging everywhere and blowing up walls. Modding deep cave generation to be like the normal cave generation is going to be much harder than the other stuff I fixed, but if someone can pull it off it would save the second half of the game for me.\n\nTo summarize my review, Necesse is the closest I have seen a game be to Terraria's quality in this genre, but it misses the mark in some key areas. Thankfully I have the programming knowledge to fix most of these issues myself, but for others it's a cautious recommendation.\n\nEDIT: This review doesn't go over the endgame incursions simply because I am not interested in them. The rest of the game already gave me my fill by the time I reached them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the game lacks some more polish but overall quite fun to play, especially with friends.\r\nOnly major complaint is the class balance which makes some bosses substantially more difficult with some setups, despite that still a solid experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Perfect Blend of Your Favorite Games\nIf you love Stardew Valley, Terraria, Minecraft, and RimWorld, Necesse is the game you didn't know you needed. It masterfully combines the best elements from each: the cozy progression of Stardew, the exploration and combat of Terraria andMinecraft, and the colony management of RimWorld.\nI've been playing since before the 1.0 release, and the improvements have been incredible. The developers have significantly enhanced replayability, added many new items, and revised the map to be seamless between regions providing a endless world to explore and colonize. The 1.0 release wasn't just a milestone, it really improved the depth and my enjoyment of exploring without loading times.\nWhether you're building your settlement, exploring dangerous dungeons, managing colonists, building traps for npc raids or playing with friends, Necesse offers that \"just one more hour\" addictiveness that makes great games unforgettable. Highly recommended for fans of any of the games mentioned above. As of the time of writing this have over 60 hours in and many more to come. One of the best values I have come by in some time. If you are just looking to relax or just enjoy making your villagers doing all your chores and day to day grinding around the settlement, I would recommend giving this title a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. I'm in the end game now, and realize how much more there is to play and unlock. This is 1.0, and I would like to see more depth in the future in regards to exploration and objectives in the future. However, the colony management leans more towards cozy, which is what I wanted based on the rest of the gameplay. This is not the kind of game I want to micro manage colonists or have to spend countless hours farming, raising livestock, etc. They do a really good job of balancing going out for loot and utilizing different colonists or in-game features to reduce grind so you can focus on fun.\r\n\r\nThis is where I would like to see more depth. Because the game actually has built in options to allow you to focus on playing the game and having more fun, I'd like to see more reason to explore this infinite world (and the underground). You can basically play through the game and only explore maybe 2 minutes in each direction in the overworld. There are really neat generated houses/towns in different biomes, but they're more of a novelty that wears off quickly because it doesn't add much. The underground is better at rewarding exploration, but I do see some room for improvement (mini-bosses, etc.). \r\n\r\nCrafting is made easy to understand, and there are so many options at 1.0 if decorating is your bag. Really nice to see with the focus on building your own town/colony with NPCs to live and work in. The gameplay loop is very rewarding from explore, loot, craft/upgrade, fight bosses. The options for building your character are vast and allow you to not only use your preferred playstyle, but allows you to explore multiple options in that playstyle. End game does a fantastic job of making the weapons and armor you liked but have progressed past viable again, expanding your options even further. Not sure I can compare it to another game, it was very surprising and welcome, and I'd love to see other games play with the idea in similar ways.\r\n\r\nTL;DR: This game is a lot of fun, puts a lot of effort into its systems in fresh ways that are focused on enjoyment of the game. It has a cozy/casual feel while still challenging enough to warrant continuing to progress and build. The game has great breadth, and could use some more depth in exploration/progression. Can't wait to see what future updates bring!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oonga boonga make friend be mayor while beat wall with stick under dirt. it gud. -Deep Cave man",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good sandbox game! With lots of mechanics to do what you want",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute game, love the art style. I have enjoyed going in blind so far most parts of the game feel familiar with their own little twists on things. It feels like I have barely scratched the surface so far.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Necesse is missing something in the sauce. It’s fine. It’s the white noise of coop terraria/minecraft-likes. It avoids making any huge stumbles and won't piss you off, but fails to really elevate itself meaningfully. What you do in the first hour is more or less what you’ll be doing by the 30th. For $10 I’d recommend it if you’re bored. Anything more and you might wonder why you bought something so bland.\n\nThe npc sim that is one of the big selling points is… *fine*. It’s nice and powerful, sure, but why? Why does it exist? *Oopsie, just because*! They needed to either provide some game design reasons for it to exist (e.g., factory-style; having to actually give giant clumps of resources to your king or something) or to make the npc sim way more personable, like Dragon Quest Builders 2, where the npcs are way more greedy. It’s not even like Terraria where you’re trying to figure out how to get npcs to move in or what makes them happy — they show up like an unceasing assembly line to your base from the jump.\n\nIn Necesse, you can set up 25 3x3 prisons, give the npcs only a diet of raw vegetables, make them work all day long and they’ll be like 95% happy. You’ll probably have this figured out in the first few hours. Whereas in DQB2, the npcs want taverns. They want toilets. They want baths. They want a pool. They want a sauna. They want a castle. They come to you with demands. They want all sorts of things — that you can make just as well in Necesse, but there’s no reason to. Eventually it becomes white noise on a tv screen that you completely ignore.\n\nCombat is fine. There’s lots of bosses. There’s a decent amount of weapon variety, but the AI is braindead and lacks any ability to pressure you meaningfully so it ends up not mattering.\n\nLike most games mimicking Terraria, Necesse totally fails to reinvent itself after the first act. Trinkets and mounts and weapons are just not impactful enough. You don’t transform from the lowly trudging settler into a racing, flying, unstoppable vestige of death. You’re just the same dude, with a little bit more particle vfx and higher numbers. Monsters similarly — they’re basically all the same walking towards you in clumps that all do the same things.\n\nThe art is ugly, even after this redesign. Biomes lack personality. Exploration is flat and boring, there needs to be more POIs and definitely more ore in the walls — it’s way too empty feeling. The “Deep Caves” which is the quasi-hardmode area is incredibly unfun to explore because of lava being everywhere. It needed to be limited to lava POIs rather than making every biome covered in annoying lava pools.\n\nAnd that’s one of the pitfalls of the infinite generated world — you never get the sense that you’re pushing into some exciting new boundary, like in Terraria, or Core Keeper’s world generation 2.0 re-do. You just explore the same biomes over and over and pray you get some new POI. Even if you do it often doesn’t have anything terribly interesting or useful.\n\nEnemies don’t even appear to drop anything useful either — all your main weapons and items are either going to be from ores, bosses, or POIs — so there’s no real point to killing anything.\n\nOverall, the game is fine. How much more mid you want in your life is up to you.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game initially hooked me because it takes features from other popular games like Terraria, Rimworld, and Core Keeper. Unfortunately, the experience began to flatten after going through the initially enjoyable early stage. Overall, progression seemed pretty simple despite the actual rate of progression feeling drawn out due to combat and movement feeling pretty clunky. I never really struggled, but I never felt satisfied with my power level. Enemies and bosses were fairly consistently spongey.\n\nBy the time I reached the end, I knew I was uninterested in continuing with the endgame loop which is performing incursions repeatedly. These are basically instanced maps with variable gameplay modifiers. But outside of that, there was really nothing else to do. Despite having an infinite map, I didn't feel incentivized to explore beyond what I had already seen.\n\nWhile this game has potential, I personally don't want to review games based on their potential (especially post early-access) and instead what is actually delivered. Based on what we have and what other similar games can offer, I would ultimately just recommend playing those instead to experience a more content-heavy, refined experience.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Endgame are just looping incursion with not fun roguelite and grind. \nand only few new boss, rest of them just deep cave boss \nit is way too boring.\nI recommend it until fallen wizard, but after fallen wizard the game experience straight all the way down to grind and boring gameplay",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "No story.\n\nGameplay loop is repetitive.\n\nVisual design is lacking. (e.g. a late game boss is red with red projectiles on a red background, leading to unavoidable deaths because you can't see anything)\n\nGame suffers from stuttering even on a single player world. (e.g. with 5 summons, bosses skipped their usual movement animations and teleported on my head, instantly ending a run)\n\nInfinite world doesn't provide value. Effort could have been better spent elsewhere.\n\nI gave this game a good try, and enjoyed some of it, but can't recommend it.\n\nEdit:\n\nMore colour issues. [spoiler]Last boss is in a pink arena, with 5 different kinds of pink projectiles, vs my pink summons, with a pink layer over the whole thing. [/spoiler]",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's not bad, but the progression is very repetitive. Weapons are very repetitive. The rewards for the quests just seem bland. I get that they are there to introduce things that help progression, but it just seems like a really cheap way to introduce mechanics to the game. It all just feels so copy-paste. Go here and fight blank by using blank. Every. Single. Time. Game definitely has great potential, but I don't think its there yet. It feels as if the dev's lack creativity, and are really banking on how hard they can copy terraria. I mean, almost all of the weapons are straight up copies, the events, the enchants. I'd like to see more creativity from this in the future.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Gameplay is enjoyable. Lost an entire day of progress which completely turned the experience sour.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Have to disagree with the majority on this one - I didn't have a lot of fun with this one.  I heard this game described as a combination of Terraria, Minecraft, and Rimworld, which I think is quite accurate, but not in a good way - in trying to do many different things, it makes each of them feel shallow.  It has the unsatisfying gameplay loop of Terraria (kill boss -> get loot -> use loot to kill next boss -> get more loot, repeat), but lacks its charm.  It has procedurally generated worlds, like Minecraft, but Minecraft made that world interesting by allowing the player to interact with and reshape it in a satisfying manner, which this game lacks.  It has RimWorld's graphics and the tedium of colony management, but not the rewarding diversity of characters - in this game, you can interact with an infinite number of procedurally generated NPCs and towns, and not a single one of them will be significant or memorable in any way.  The friend I played with seemed to enjoy the game (he said he found the colony management relaxing), but I could not for the life of me figure out what I wanted to do - there were many things I could do, but none of them were actually enjoyable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "gameplay loop is fun for 4 hours then it is an unimaginably boring grind",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Do I recommnend this game? Sort of. Could it be improved? Absolutely. Is it fun? For a time... \n\nI'm playing co-op with my friend and we're having quite a bit of fun doing it. Having said that, the mechanics/systems get boring pretty fast. Here are some of the negatives:\n\n1- Progression: The gear progression is odd...  At the begining, you gain access to starter tools but quite quickly (and almost at the same time) you unlock copper, iron and gold which allows you to skip the progression of the in-between materials, launching from starter tools to.. well.. gold in no time. I found this disapointing and completely underwhelming. I would have loved a slower progression towards unlocking these better tools. This seems to have robbed me of any sense of achivement regarding said tools. \n2- Biome progression: So far, the world appears to be nothing but the same biomes, stitched together on a wide, open map. I would have loved to see the world become tougher, the biomes changing as I walk away from my start location and run 3000m 5000m, 10,000, away, in a straight line, away from home. Alas, it appears that it's just the same biomes, at the same difficulty, over and over again, no mater how far I make it away from home. The same loot, the same monsters, the same biomes. Seems to me like there is very little reason to spread out and build in any other location other than my start location. The first level of dungeons appears to be the same; the same dungeon biomes, repeated ad nauseam, with the same loot, same monsters, same difficulty, no mater how far I travel. \n3) Gear crafting: Once I found and went into the swamp dungeon, a quick run around allowed me enough material to build an entire armor set. It didn't take much effort; it didn't take very much time, it didn't take any planning. There was no 'working on' this gear progression; it simply happened once I found the right biome. Found the ore, processed it and voila; a brand new armor set with minimal effort. In another hour, I made 3 more, for my settlers.\n\nAs much as I enjoy playing this game with my friend, now that I know what I'm doing, I can't see myself playing it for a second playthorugh. It lacks a real sense of progression. It lacks depths. I didn't take long for me to get a 'same old, same old' feeling, when I left my settlement to go on an 'adventure'. Very quickly, any sense of adventure gets replaced with a sense of 'I've seen this 100 times already'. Once you know what you're doing, progression will be absurdly easy and would require very little effort / play time. \n\nIn short, it lacks a ense of biome progression. It lacks a sense of gear progression. It very quickly devolves into a feeling of 'same old' biomes, same old monsters, same old loot. There is very little to ZERO need to spread out and rebuild anywhere. There is no need to build a step up base. There is no need to explore anything other than the biomes that you can already access from the first hour or 2 of playing. \n\nThis game has some good, strong bones. Alas, the implemention seems... off...  After 24+hours of gameplay, the game seems very shallow. It lacks a solid progression system. The sense of adventure quickly wears thin and dissapears almost entirely. Perhaps I just got addicted to the likes of Valheim, where opening a new biome feels exciting; where exploring and maping new island makes me happy; even after 1000+ hours of gametime. \n\nThe Pros:\n- Settlement building was fun. Had a great time building our home, building settler homes, building farms, animal pens, roads, chest rooms and so on. The dev did a great job on this! Lots of decorations, building bocks etc. \n- Love the 'cosmetic'  slots that allowed us to wear one armor set while looking like another. Kudos for letting us look how we WANT to look. My friend was super-happy to wear the frog head while I loved rocking purple robes, orange boots and a bone headpiece. Alas, 'metal' progression doesn't really exist so we didn't need to update our settler rooms. They don't seem to care if something is made from wood, copper or gold. We'd love to see a more in depth 'room happiness' mechanic. Of course, this means that the ease of which you can access iron, gold etc would need to be re-tooled. \n\n- The ability to 'mod' your chacter using trinkets was amazing; From being able to build for mana-regen to extra armor. We loved the ability to tailor our enchants based on our build wants. We spent WAY too much gold re-rolling our enchants :)  but we see this as a positive because this meants that even 24+ hours in, gold still retained value for us. \n\n\n-------------\nSuggestions: \n- Change the whole map system where you can hit tougher biomes when you travel far away. Give us a reason to build step-up bases; to link bases using mine cart rails. To fight out way through the map to get to other, tougher places. As it stands, there are zero reasons for us to move away from where we started. \n\n- Need a 'settler leveling' system where we can assign points to our settlers. They can acquire XP from completing certain tasks. IE: Unlock cook recipes the more they cook. Unlock better mage enchants the more they enchant our stuff etc. This would breath new life and new choices into our settlers. Once programmed into their tasks, we had no need to even care that they existed. We have no emtional connection to them; there's no need for us to interact with them other than pay our mage for enchants.\n\n- Would love a skill based leveling system where we become better at mining, farming and so on. Killing countless thousands of monsters, in a game where spawns just keeps comming, holds little to no value. There is no real reason to keep killing monsters. If anything, the goal is to drop 100,000 torches to monsters STOP spawning since mobs don't have any value other than being a general annoyance. \n\n- Speaking of useless monsters: We'd love to see a \"+1% damage to <x> after 100 kills, 1k kills, 10k kills, 25kills, 50k kills (or some such). At the very least, it would give us a small tangible benefit for slauthering mobs and add some goals for a small increase in damage to certain bosses. ;) (example: 10k purple mage kills gives me a 4% extra dam on the mage boos? Heck yeah! Bring on the farming slaughter!) I love such proverbial carrot danglings. They give me purpose, something to strive for. \n--------------------------\n\nOverall, it's fun but in its current state, I'd pass if I wasn't playing with a friend. For me, this game offers zero replayability. I'm of the opinion that this game needs some serious redesign from someone who has experience with progression systems.  \n\nWe had fun poking around and learning about the gameplay systems. Once those were figured out, there's not enough depth to keep us here. For me, replayailty value is zero; which makes me sad. I truly wanted to love this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you like crafting and collection new materials for more crafting, this is fun. If you don't, it stops being fun after about ten hours or so when the exploration more or less has been done.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "5/10 for me - I don't really get it, it feels like this is a worse version of a ton of other games. Minecraft, Starbound, Elin 2, Terrarria - it goes on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would kindly like to ask what is this type of progression. Doing the same bosses over and over again just to get about 30+ dmg on ur weapon/ 8+ armor and u have to do it 10 times on every single piece of armor (helmet chestplate and leggins) before even trying to take on the final boss. Also what on earth is the final boss ? Why do u think any human being would kill this on brutal? Me and my friends were playing whole game on brutal but as soon as we saw last boss we gave up. This thing is literally impossible to do.\n\nTo sum it up progession is good till incrusions and last boss is absolutely fucked up u just have to nerf it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's got a nice style, but the bosses all felt pretty similar and a few of the late game weapons for mage and summoner were underwhelming or felt bad to use imo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I guess there's a different set of expectations here for what makes a \"1.0 ready\" game.\r\nDespite the fact that this game has been in development for a long time, it remains very unpolished. The concepts are great, with village management and exploration, there's not quite any other games I can compare it to in terms of what it provides.\r\nHowever, that does not excuse what I would consider very poor execution.\r\nFor art style: This is a very nice style, a more pixelated look can make things feel nice and encourages the creativity of the artist, but the textures in this scenario are just awful. My eyes glazed over, looking at the crafting menu and seeing a massive blob of \"things\" that make it profoundly difficult to quickly find what you're trying to craft at a glance. I found myself using the search bar to find things, which is a nice add, but that doesn't mean it should be a crutch for a system where better artistic style would make it easier to point out what you're trying to craft. Along with that, something feels odd with the aliasing, as it feels like I am looking at everything with glasses off. That alone gives the game a very unpolished feel.\r\nFor gameplay: I'm willing to give this a \"pass\", not that it means its' good. The villager automation is cool and reminds me of RimWorld, but lacks a level of depth that would make it comparable. The movement is janky and it feels like you're floating wherever you walk, not to mention that you move very slow, even when you having the boots that allow you to run equipped.\r\nRight now, that's all I have to say about this game. I didn't get very far, because for some reason the game crashes every time I tabbed out to take notes. Maybe another time I'll pick this back up, but from the past 2 tries I've given it, I was not impressed. Beware if you're looking to buy this game, I'm sure the content is there, but you must lower your standards.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game got old quick for me and i hate that all the biomes are so close to the spawn point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was really excited playing this game for the first few hours and was enjoying the game immensely.  Little did I know that once you've played for that length of time, you've likely seen all there is to see in this game.  The core gameplay loop becomes repetitive and the procedural generation is lazy and gives little reason to explore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's good, but still buggy. Started a new world on V1.0 and the starting NPC settlement is just not there. I also just prefer Core Keeper graphics.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For context.\nPlayed thru the game up to incursion 9 with a friend, was able to beat that without too much struggle, but could not bother to farm up the last couple thousand arcane dust to unlock the tree up to the final boss.\n\nAside from the idea of the settlement folks being able to automate the routine tasks around the base, this is just top down diet terraria, so many things are close to being satisfying, without ever getting there. Most of the spells and summons are very similar to like 3 types and lackluster in creativity outside visuals. \n\nThe settlement system is cool, but is severely lacking in quality of life for things like designating chests contents or setting quantities or conditions to do work, all those systems exist but are lacking in implementation and ease of use.\n\nAlmost none of the armor sets or trinkets do anything \"cool\", and the ones that do are lackluster in power level, some are literally detrimental to use (looking at you armor that blows up minions for less damage than the minion hits for)\n\nArt was fine, didn't hit any bugs that I remember, all over that kind of stuff was fine, its well made, just poorly designed.\n\n3/10 experience, it was a distraction that went from OK to meh rapidly as the content just repeated itself over and over with a new coat of paint. If I didn't play it with a friend I likely would have returned it before the two hour mark.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game will blind you. It feels like the days last almost nothing, but the nights are nearly eternal. About 90 percent of what you do in the game is place torches, and those torches barely light anything. Without them, the cave areas you have already visited do not even get recorded on the map.\n\nThe game does have some items meant to light up the environment, but some of them manage the impressive feat of making a lit area even darker.\n\nThen there are the crashes. This game crashes both on Windows and on Linux. Strangely enough, it runs without crashing on an extremely weak computer I have here (Arch Linux, by the way). I guess that is because it is fully AMD.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not the worst game, but there are so many identical games out there. No inspiration",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game doesn't understand visual cues/telepgraphs at all. It also becomes extremely boring once you get to the incursions, its a nice gimmick to keep it going but it's very anti-survival crafting game.\n\nHonestly the issues are too numerous once you get past the Pirate Captain, that I don't really see a point in listing them.\n\nThe only other callout I'll make is, with the 1.0 / removal of the map tile system, there were a lot of oversights, that were just not given enough time to be balanced or updated for those 2 updates. The best example I can give, is the weird semi crafting attention given to boats, but boats are pointless now because there are no oceans, and hover boots are better :/\n\nCorekeeper is definitely better, and actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "8 hours in and we have called it quits on this game. I cannot imagine the end game grind if it is anything like what we are experiencing. \n\nYou will spend most of your time sorting chests, and running around the generic and unexciting map at what feels like an unnecessarily slow pace (even with a mount). The intention is to have the settlers do this for you, but setting that up is just as fun as doing it yourself.\n\nWe fought the pirate boss a couple of times, who decided to run away at 1% HP and then healed back to full health (we were both in range and it was daytime).\n\nI'm fine to admit the game isn't for me, but I will also admit the game is poorly designed in some ways.\n\nWorth a try on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tries to be like terraria, unbalanced classes - summoner/ranger is viable other classes neglected. only fun part was incursion roguelike in endgame.\n\nalso not hard enough, kinda a kids game tbh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a cool game thats like Terraria X Minecraft, but it feels grindy early on and repetitive. We were playing on the hardest difficulty which could be it, but it seems like it needs more depth and uniqueness. Like it only has 50/50 from both games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's an ok game, i feel its a little too unbalanced, for context i played summoner and the armour sets and weapons seemed to try and be unique more than being an actually useful upgrade, after a certain point everything felt like a sidegrade or downgrade and the incursions feel more like post game content in a newer pokemon game, pretty much  just more of the same, and not that fun, my friend who was playing ranger said they felt the same way\n\nwe feel this game has greatness in it already but not equally in every system, it feels like it needs more time in the oven",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Это top-down terraria, но очень сильно нудная. Весь игровой процесс зачем-то сделан максимально однотипным, как в плохих мобильных играх. Какого-то драйва или челенджа здесь нет, всё очень ванильно  .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The endgame is literally a extremely repetitive raid grind.\r\n\r\nYes you read that right. Raid grind. In a single player game.\r\n\r\nTo make matters worse, you are not even grinding for things like unique drop or rare items. You are grinding for materials to upgrade your existing gear's stats. From gear tier 1 all the way up to tier 10. Using material tier 1 all the way up to material tier 10. Note, they are not even different materials. They are literally called something like \"Essence Tier 1\", check the list of achievements.\r\n\r\nThat's as boring as it sounds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything about the game is extremely well made. However, the late game, game loop of incursions feel out of place and rushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Multiple crashes in 40 minutes of gameplay on a good setup. It's unfortunate because the game was pretty fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Heartbreaking, waited for months before I try out this game, thinking it's finally ready with 1.0 and would be a good time. It just.. isn't.\nIt had a strong start, the first boss was simple but great, being a decently challenging but not unfair fight considering you have limited mobility at this point. Flawed yes with some telegraph (fireball rain) not really that well done. It went downhill from there.\nThe game shows you the gameplay/progression loop pretty much immediately. Go to new biome, get the summon item which usually means mining around a bit for new ores/materials (skippable by sending miner to errands instead, because beating a boss unlocks next ore tier mining task), sometimes find the summon area, kill the boss, repeat the cycle. There's almost never any twist. It just ends up repetitive and boring. The biomes are essentially same ish as well.\nThe bossfights are pretty much easy and not really that notable, a lot of the unique things just feels like gimmick instead of a mechanic. Also, I play melee and it's generally pretty bad in boss fights except for one weapon, disproportionately so compared to other classes because the bosses are generally so mobile you need dash to catch up, and projectiles originate from bosses so you cant dodge as well on top of running out of dash.\nThe other thing is that how much the game copies stuff from terraria, often items/bosses/mechanics doing exactly the same things. It goes from \"cool it's like in terraria\" to \"can they get more blatant? cant they be more original?\" over time.\nThe only part that feels unique and well done is the settlement system, but at the same time it feels like they're ultimately just resource generation/automation disguised. And there's less control over it unlike, say, palworld, where you can assign specific tasks. \nFor what it's worth, it's cheap, and there's still a decent game here. I just can't recommend it. The best part of the game is how it makes me crave more terraria for combat/exploration and minecraft for automation again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What I played so far? It's okay. Terraria meets stardew meets rpgmaker but can be server based.\nthe sound is my main issue, when I loaded the game twice, both first launch and after verifying the game files, there was just no audio. And no it's not my drivers. Freetube works. Firestorm plays audio. Robobeats plays audio. Even the steam notification ping plays.\n\nNecesse? Nothing. Silence. Which I guess is good if you're playing and are listening to something else, but when it's your first time and you've heard so much about the music in the game? Idk. Gonna be a hard no for me. Luckily got it in a bundle on Fanatical for 3$, so not that much of a loss, but like. Audio, man.\nI am running OG Steam Deck with an upgraded SSD(1tb). Other than that it's standard hardware.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Every week is a new bug, thought we were almost finishing the game then portals are broken now and its a chore just to reach places, won't play again until it gets fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "VERY monotonous and repetitive. I was expecting something closer to Rimworld where I could have workers do a variety of tasks, etc., but instead there is just as much management without the diversity of things to do.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I found it honestly quite boring and disappointed by how useless villagers are. The Inventory system is also too simple and needs a function to be able to deposit only certain items.\n\nI don't see the point of a game like this. it doesn't do anything really unique or different than other similar games (terraria for example).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fun little game in the early stages but at ~10h of gameplay i hit a wall where every boss was just hitting like a truck even though i've upgraded and enchanted my gear, ate food and drank potions.\r\nMaybe I did something wrong but the game doesn't tell you much and searching on google didn't help either.\r\nI think this just needs more polishing before I would recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like many of the other similar reviews, I feel the game in a very odd style of choices - missing that special flavor, the magic or pizzazz. Jack of all trades, master of none type feeling ended up with it feeling strangely shallow, despite all the things it attemps to do. \n\nAt about 5 hours of play time, I had my smallish colony running more or less happily with no actual need to ever touch it again - exploration topside led only to endless \"very samey\" biomes and NPC settlements. By the time I saw a few of them - I had seen them all. Loot was very underwhelming, Despite running around in a gold armor set and sporting an enchanted weapon (and guns) - combat felt rather underwhelming and had that odd underdog flavor.\nCave or underworld had a very similar vibe, except that it is  annoyingly dark and sported endlessly spawning enemies. After beating the first boss, Im not sure Im willing to give it anymore time...\n\nLuckily after falling for the hype, I managed to get from a sale - and would recommend you do the same if you absolutely must.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The pacing of the game isn't very natural. \nI got overwhelmed by the amount of things this game has, which may be good for some but too me there was too much within such a short amount of time. \n\nGiven more time, I think I could understand it but as of now there is too much for my small brain to comprehend. \n\nAlso trying to host online sucks, seems their are issues with the game regarding this and also bugs where you can't do borderless full screen because HDR triggers and makes it full screen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's an ok game, nothing special. Worth the price. The only minus is that is focus on crafting and colony, i let the npc to do it, but alot of crafting space is still a sim farm. The exploration and maybe \"rpg\" i think is at mediocre at best, it's missing the effects of weapons, the combination of weapons or armor. Is more like a \"do this, the next is this, then this. Is missing the play style, Is more like this is better then this or do zone 1 then zone 2.Is not a bad game but is not a good game. I recommend to play with mods this game as is more fun, the rpg mod is really good. This is just my opinion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The early game is fun and engaging but the second half/ENDGAME is genuinely cancer and brain rotting. The boss designs are stupid and just unfun to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If a game had all these features but had a less clunky combat and inventory experience it would have something.  i simply cannot stand the lousy clunky combat and the terraria-like inventory system.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly just go play Terraria; boss fights are annoying and everything else is a shallow version of other games. Had my fun with it but the final stage bosses are just straight up not enjoyable to even attempt to fight.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "if you like terraria, you might like this game.\r\n\r\ni, unfortunately, do not like terraria.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game starts off strong and is genuinely fun at first, but everything changes when you reach the last two bosses. From that point on, the experience goes downhill fast.  \n\nThe final bosses are so difficult that I had to lower the difficulty just to enjoy the game. On top of that, the build balance is poorly done—some setups are clearly better than others, and the game practically punishes you for using swords or melee weapons.  \n\nBecause of that lack of balance and fair design, I can’t recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat/movement is frankly terrible. They copy/pasted a bunch of content from Terraria and changed it just enough to make it \"unique\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Autotrash is a horrible QoL Key bind. Lost my pouches, and quality gear. Tried recovering save file, went back multiple in game days.  No luck. \r\n\r\nUninstalled and moving on to something else.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: Game is amazing but the late-game ruins the whole thing, and amplifies every little issue the game has. Play with friends or suffer an endless and tedious grind... or just quit after the mid-game.\r\n\r\nAs much as I loved the early-mid game, the end game tries to do something different and falls completely on its face. By the time I got to the final boss, I was begging for the game to be over with- I would've stopped playing if I hadn't already sucked so much time into it. \r\nThe incursion system is an interesting idea, one that I found interesting at first- but the more I had to grind the more I hated the game. I had to grind like 12 incursions to get a single crystal tablet. The sun arena boss is terrible, and his fists often bug out and teleport directly into me with no warning. Playing summoner became miserable as I had to switch to lower-tier weapons solely due to their better summon AI/targeting. The crystal resilience armor sounded cool, but the second I started using it, it flopped on its face and made my play style turn into a miserable slog.  \r\n\r\nI didn't care for any of the settler/building aspects of the game: it was easier to just travel to nearby villages and use their mages and traders for what I needed. Additionally, I would usually ask villagers to come to my settlement because why not, until a raid (which are complete trash by the way) killed all of them and their dead bodies are still lying on the ground, and I'm not bothered to slowly nudge them out of my house because there isn't way to get rid of them other than go on a tedious fetch quest to get revive potions. The enchanting mechanic is somehow more miserable than the one in Terraria- tinkering is way more expensive and way less rewarding. It squanders potential for different playstyles and reduces the amount of fun you'll have to pure luck. It took 5 incursions and 20k coins just to try and get a single enchantment I was looking for, just for me to have to replace it because theres way too many armor progressions that make previous tiers obsolete.\r\n\r\nLots of the incursion bosses are cool, but its ridiculous how bad they get when you have to fight them over and over. Spider Queen is in walls half of the time, and I don't have the resources time or money to keep blasting open temporary arenas to kill her faster. The crystal dragon boss is terribly telegraphed and mixes horrifically with the background of the incursion. I don't think there's been a single fight in any game where I enjoyed fighting a bosses minions, and this game stands as a testament to that.\r\n\r\nSwamp Pest could've been an interesting fight but it just wasn't- i felt like the fight was a dice roll depending on where it came from and how big your arena is, mixed with how OP your weapons are at the point in time.\r\n\r\nThe issue with Swamp Pest was only amplified by the fact the boss summon item required an item from a creature from a sub-biome that was not only hard to find, but when you do find it, it requires literal hours of running back and forth, praying the creatures will spawn and drop enough Silk to allow you to craft a SINGLE attempt at a dice-roll boss with terrible AI and core mechanics.\r\n\r\nAt least with the Empress of Light (Terraria), the boss was tough but it was ALWAYS the players fault- every move in that boss fight was well-telegraphed and enjoyable, even when you lose to it. However, EOL also suffered from the issue of having to grind for a chance-related item in order to have another go at a difficult boss fight. I thought it was a terrible mechanic in Terraria, and I found it to be an even more terrible mechanic in Necesse.\r\n\r\nWhy can't you craft enchantments? Why can't you craft gateway tablets? Why can't you craft all the games trinkets instead of having to wander endlessly though the same biome hoping you'll see it in a random chest? Why can't you just let settlers die and remove their corpses from your house? Why is it necessary to make a pickaxe for every biome when you can just use dynamite to skip the tool progression entirely? Why is enchanting locked behind a settler? Why does food expire? Why shouldn't the player be able to attack through walls? Why do the summons have drastically different AI that completely changes the intended summoner progression? Why are the \"raids\" so terrible and contain nothing but NPC reskins with reused weapons? Why can't you fish the same biome-related fish from underground? Why don't spiders spawn as much as every other enemy in the game? Why is there a crazy influx of enemies when incursion objectives are almost completed? Why are incursion metals locked behind the \"extraction\" objectives only? Why does the health potion hotkey prioritize the lowest-tier potions? Why is the players hitbox so weird and hard to control? Why does Spider Queen have that near-impossible to dodge attack? Why is there not a potion to regain resilience? Why does it take so long to regenerate resilience when sleeping? Why does the Skeleton Staff suck so much? Why is the sun arena so bright that it makes it difficult to even see the boss, which is the exact same color as the floor? Why would it target summons onto NPCs instead of talking to them when you hold a summon weapon? Why does enchanting cost SO much? Why would the carpenter bench upgrade be so convoluted? Why can't omni-crystal convert into other essences? Why do you have to re-fight bosses if the Elder quest wasn't accepted beforehand? Why doesn't dynamite sync with your highest tool but bombs do? Why is there only like 2 treasure dungeon types, and why can you just run past and skip the both of them and tank the damage? Why do flamelings projectiles go through walls? Why do banners need a stand to be placed? Why do pawnbrokers have shop wealth- matter of fact, why do ANY traders have shop wealth? Why are none of the late game tools faster than the mid game ones? Why do the overworld biomes even really exist if they serve little to no purpose for the games progression? Why does the elder stop giving you progression quests when the incursions start? Why does farmland require so much wood? \r\n\r\nI usually write stupid steam reviews for fun, but the endgame of this pissed me off so much. I was grinding the hell out of this game at first, and I loved every second of it, but the incursions ruined the entire experience and I think it would've been better if the game ended after the pre-incursion wizard fight, or just did a similar boss progression gauntlet like the rest of the game. It disguises a sell-out way to reuse boss fights as a terrible but unique end-game to an otherwise amazing game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good for the first 10 hours or so then get boring real quick with very little to do.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is tedious and full of bugs. \r\n\r\nThe \"settlers\", refuse to actually put any of their items into storage, so they are all wandering around with full inventories, despite my having put down over 15 chests for them to put stuff in. Instead they sit on a stupid bench, after having walked passed ten or so, ignoring each.\r\n\r\nThe graphics are straight out of the early 2000s at best. And it crashes to desktop more than any game should. \r\n\r\n/UNINSTALLED",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another Minecraft / Terraria / Stardew Valley clone with even more spreadsheet gameplay. Avoid.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Necesse is what happens when Minecraft and Core Keeper have a baby. TBF I don't enjoy either of those games, either, so I'm already biased against Necesse. It feels like a big empty with the typical MMORPG gear hamster wheel. Each new biome has its own set of gear that completely out classes the previous set, and until you're rocking the new duds, prepare to get spanked mercilessly by the mobs. Even with nimble on all my gear, which is movement +4%, the controls feel so slow. I do like that the villagers will tell you how happy they are, and how to make them happier. The music is pretty, too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I turned all the things down, it still made me super sea sick. It looks cool, but had to refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Practically a Terraria clone sprinkled with a \"RimWorld/Dwarf Fortress\"-style settlement management. The caveat is that is takes the worst from the both worlds.\n\nI will start with the latter part. You can recruit/find various settlers and assign several different work orders to them like managing a forest, animal handling or farming. It's one to one from the RimWorld, with zones, work orders, priorities and bedroom assignments. And that's it. You have what basically is a bunch of one-dimensional slaves to haul and craft. Borrowed diet and grades of meals from RimWorld baffle me the most. This is in-game automation of menial tasks which become irrelevant and self-serving several hours into the game.\nSpeaking of automation, all crafting orders have to be done manually. No strategic bird-view of RimWorld, where the whole settlement is at your fingertips. You can assign a storage or a workstation to the settlement, but still you need to haul your slow avatar to the workbench or anvil to make \"do X thing Y times\" orders.\n\nAnd the former part. The similarities border on blatant copying. Where do I start? Characters and their inventories separate from the world, acting as a save files? Running around, breaking stuff to loot cave systems and different biomes? Equipment modifiers capped at exactly 4%? Tool progression through better ores and loot? Don't get me wrong, none of these are bad things in themselves, or a excuse to throw tantrum about how \"Terraria did it first so no one else should be allowed to implement features this way\". But when I take take every little bit that makes this game and look at them as a system, I can't see anything other than Terraria. The only difference is that it is top-down rather than sidescroll.\nOh wait, no. There is another one. It is worse in every way. Yes, Terraria has 10+ more years since release compared to this game, which got a 1.0 version a month ago (at the moment of writing this review). Yet, considering how one can see the primary inspiration this game has in every pixel, why not borrow something more important? Fluid controls with shortcuts. Biome-specific loot tables for chests. More interesting enemies rather than hordes of bullet-spongy shamblers who do nothing but waste your health, ammo and, most importantly, your time (that's because they don't drop anything 4 times out of 5).\nI haven't even gotten to the first boss of the game, because the only weapon I looted in my 6.5 hours of gameplay is some stone-flinging hammer that had the same damage as a ninja star. What I got in droves is a Mysterious Portal. Which summons the first boss. Game really wanted to make sure I had a dozen Mysterious Portals at my base rather than weapons and trinkets to fight it.\nThen I found underground desert biome, which had noticeably harder enemies. I found a chest there, opened it and it had the exact same loot as a chest I found walking 10 meters from a spawn point. My game-closing thought was \"What's the damn point?\".\n\nMayhaps I am too harsh to someone's passion project that's been in development for quite a while now. So, here's truly personal nitpick to the game. Spritework and attack animation reminded me too much of Stardew Valley. And I DESPISE Stardew Valley.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's terraria but like rimworld and shit. \n\ndoesn't really do either of them too well idk",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I refunded it after it took multiple attempts to chop down a tree. You need to be in the absolute perfect place pressed right up beside it. After experiencing such a bad hit box with something as simple as a tree I could only imagine how bad it would be if I was trying to melee an enemy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "melee kinda SUCK even in end game. PLS BUFF MELEE I will GIVE Thump up",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was quite dissapointed by release, looks like the only thing dev did is changed visual numerous amount of times and deleted map system (even if you check 1.0 trailer there is simply showcase of visual changing over time). Gear system is basic, difficulty is too high even on easy, a lot of mechanics are not needed (whole town NPC system, hunger [which can be turned off], farming and alchemy - cus you can just buy food and potions from shop). Dungeons are generic, boring, without much to do. It does not implements any new systems, just a copy of Terraria. Bosses often have only basic gear which is a copy of previous gear tiers, just slightly different attack pattern and quite often it is even worse than something you started wearing 3 hours ago.\n\nGame was in EA forever and never really became it's own thing, staying in a shadow of Terraria and hoping Terraria 2 will pop up, so more ideas can be stolen. I would strongly suggest playing Sun Haven instead, which also has quite good battlles, better loot system, upgrades, researches and 4 distinct bioms with fifth coming soon, which are trully different from eachother.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It feels too rough and unfinished to even be playable. A huge amount of polish is needed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this pre-release and after and I can confidently say the game is a 4/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's too easy to be fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "اول مره اشوف لعبه تخرب شاشه 10/10\r\nوا مافيه استعباد 0/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unfinished and unbalanced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh, not fun, sorry...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This aint it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont-buy-it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Midcesse",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "miserable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i'm taking a massive sheet right now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I did want to give this game as much of a chance as I could, so I've reached the endgame, done a few tablets (their version of maps from path of exile) and I am quite bored unfortunately. The game suffers from some design decisions I'm not a big fan of personally.\n\nSo the game is a mix between core keeper, terraria and some farming/city builder sim mixed in one. It definitely takes a LOT of inspiration from terraria, with many items doing the exact same thing as their terraria counterpart. This is great, I like terraria. However, it fails to capture what truly makes terraria fun and replayable.\n\nFirstly, character movement throughout the world. In the endgame of terraria, you will ride a UFO blasting through the world with infinite explosions - nothing gets in your way. In this game, you can get a good amount of movement speed but... just walk in any direction and you bump into a tree. Or a rock. You can't RUN through the overworld without constantly bumping into things. The game NEEDS to make trees intangible so you can actually move in the overworld uninterrupted.\n\nSpeaking of the world, I'm not sure why they hyped up infinite worlds so much. I have currently explored all the biomes in a smallish area around my spawn, faught all the cave bosses, got most of the items. I literally have no reason to ever explore the world infinitely as the content now is just the endgame maps which Ive set up at my homebase. This to me feels like a lack of understanding as to what actually makes games fun - take terraria for example, the game they are inspired by. Terraria doesn't have an infinite world, because it would be pointless after a certain point, and the world it has is filled with everything you need to beat the game. And if you are missing some optional items like a desert pyramid, you would just generate a new world! On top of this, when you reach hardmode in terraria you would constantly revisit old areas to fight the new mobs and mine the new ore, truly utilising the finite world you created. In this game, it's pretty much one and done (maybe they'll make a hardmode in the future?) because you visit a biome once, kill the boss, and theres no reason to really go there again if you got all the drops. In my opinion it should have just been a single, large world with all the biomes and that would have been enough.\n\nRegarding the endgame, I am so BORED. I've done like 4 maps in a row all forcing me to mine 100 or so blocks of ancient ore. WHY. I don't NEED anymore ancient ore, I already have thousands! There's nothing I can do with this ore except sell it! On top of this, there's no super FAST way to blast through these levels, even with bombs, dynamite and a tier 10 pickaxe with a mining trinkets it still takes too long. I was stuck in a map for an uncomfortable amount of time because I missed an ore vein. (if anyone played path of exile 2, do you remember when players complained about this sort of thing, where they almost complete a map but miss one enemy at the beginning of the map and have to backtrack the whole map trying to find the enemy? This is kinda similar). It would be much better if the game was able to select which kind of incursion we want to generate, like a straight up boss arena where you just fight the boss and get rewards, because mining ore to complete the map is getting reaaaal old. The boss fights themselves are kinda fun, even if they are just the same bosses again and again with \"number go up\".\n\nEven with all the weapons and items, the combat in the game is less complex that you would think. The game has hordes of enemies swarm you. There are weapons that can only attack one single enemy at a time, and weapons with piercing. You pretty much have to use the piercing weapons/spells otherwise you it would take forever to fight all the enemies. Theres even a boss thats a swarm of bats with each bat having its own health bar. GOOD LUCK trying to use a single target weapon. I understand \"different sets/tools for different jobs\" but in 90% of cases a piercing weapon is the best choice. And also, summons are ok but the ones that can't phase through walls are pretty useless as they have to walk around blocks which means even with a high summon speed they can take forever to pathfind.\n\nSo yeah, that's about it. There's some minor stuff as well like how I hardly interacted with the villagers after a certain point, and the music is kinda annoying after a while, and the lighting is not that good. It's way too dark half the time.\n\nMy final verdict would be... try it out as a lot of people seem to like it and its quite cheap on sale. But if you played terraria for hundreds of hours, you may feel frustrated with certain aspects and systems here. I think with time it could become great with updates, so maybe I'll check back in the future.",
      "voted_up": false,
      "votes_helpful": 214
    },
    {
      "review": "Necesse is missing something in the sauce. It’s fine. It’s the white noise of coop terraria/minecraft-likes. It avoids making any huge stumbles and won't piss you off, but fails to really elevate itself meaningfully. What you do in the first hour is more or less what you’ll be doing by the 30th. For $10 I’d recommend it if you’re bored. Anything more and you might wonder why you bought something so bland.\n\nThe npc sim that is one of the big selling points is… *fine*. It’s nice and powerful, sure, but why? Why does it exist? *Oopsie, just because*! They needed to either provide some game design reasons for it to exist (e.g., factory-style; having to actually give giant clumps of resources to your king or something) or to make the npc sim way more personable, like Dragon Quest Builders 2, where the npcs are way more greedy. It’s not even like Terraria where you’re trying to figure out how to get npcs to move in or what makes them happy — they show up like an unceasing assembly line to your base from the jump.\n\nIn Necesse, you can set up 25 3x3 prisons, give the npcs only a diet of raw vegetables, make them work all day long and they’ll be like 95% happy. You’ll probably have this figured out in the first few hours. Whereas in DQB2, the npcs want taverns. They want toilets. They want baths. They want a pool. They want a sauna. They want a castle. They come to you with demands. They want all sorts of things — that you can make just as well in Necesse, but there’s no reason to. Eventually it becomes white noise on a tv screen that you completely ignore.\n\nCombat is fine. There’s lots of bosses. There’s a decent amount of weapon variety, but the AI is braindead and lacks any ability to pressure you meaningfully so it ends up not mattering.\n\nLike most games mimicking Terraria, Necesse totally fails to reinvent itself after the first act. Trinkets and mounts and weapons are just not impactful enough. You don’t transform from the lowly trudging settler into a racing, flying, unstoppable vestige of death. You’re just the same dude, with a little bit more particle vfx and higher numbers. Monsters similarly — they’re basically all the same walking towards you in clumps that all do the same things.\n\nThe art is ugly, even after this redesign. Biomes lack personality. Exploration is flat and boring, there needs to be more POIs and definitely more ore in the walls — it’s way too empty feeling. The “Deep Caves” which is the quasi-hardmode area is incredibly unfun to explore because of lava being everywhere. It needed to be limited to lava POIs rather than making every biome covered in annoying lava pools.\n\nAnd that’s one of the pitfalls of the infinite generated world — you never get the sense that you’re pushing into some exciting new boundary, like in Terraria, or Core Keeper’s world generation 2.0 re-do. You just explore the same biomes over and over and pray you get some new POI. Even if you do it often doesn’t have anything terribly interesting or useful.\n\nEnemies don’t even appear to drop anything useful either — all your main weapons and items are either going to be from ores, bosses, or POIs — so there’s no real point to killing anything.\n\nOverall, the game is fine. How much more mid you want in your life is up to you.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "I’ve had a good amount of fun with Necesse, especially in the early stages. The settlement-building system is one of the game’s strongest points — it’s satisfying to recruit NPCs, set up houses, and assign them to different jobs. Having workers take care of farming, crafting, and other tasks gives the world a nice sense of life and progression.\n\nThat said, once you get past the early game, the progression starts to feel less rewarding. After a while, it feels like you’re just moving from boss to boss without much need for mining, crafting, or meaningful exploration in between. The gear upgrades and rewards start to feel less impactful, and the mid-to-late game loop doesn’t quite capture the same sense of discovery as the beginning.\n\nFor the sale price of around $10, Necesse is definitely worth picking up — there’s plenty of charm and solid mechanics to enjoy. But with just the 1.0 content, it left me wanting more. The foundation is great, but it feels like there’s a missing layer of depth or incentive to keep pushing forward once you’ve seen most of what the game offers.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "My review is just regarding Steam Deck and controller support.\n\nI bought this to play on my Steam Deck and was very excited since it looks right up my alley.  I love games like Minecraft, Don't Starve, etc.\n\nUnfortunately the controller support is abysmal.  Controls make no sense in many cases.  I don't think this should be marked as compatible with Steam Deck because it's very obvious the entire game is made to use a mouse and keyboard.\n\nI will update my review in the coming months and years if that changes.  But currently I can't recommend this game for anyone using Steam Deck or Controller.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The only reason why i started to love Necesse was because of its city building experience and the only reason i stopped playing Necesse in my 2 playthroughs was its city building experience, You can take your villagers, you can give them the absolutely best godlike armour in the entire game and its not going to matter, the enemies scale infinitely so they are always going to kill every single villager you ever have in every city you ever built so the only way to sustain villages is to accept that they all die and just farm pots to revivive all of them but at that point the game just becomes a revive simulator, You can turn off raids in the game but i feel like thats not the point, the most enjoyable part of the game shouldnt be completely impossible to sustain.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The game's endgame is not well-designed in terms of balance. Unlike other similar games, you can never say \"I've got it now.\" When you enter a map close to your tier, you can tank a maximum of 3-4 hits, and it's like this from start to finish. My advice to those who want to play melee(except range attack melee weapons), give up on that ideaf before you even start xdd. The bosses' attack patterns are overly simple, so they speed up once their health drops to 50%. This speed increase is extremely annoying with some bosses. Apart from what I've said, it might be a good game for those who just want to chill, but never play it on a difficulty level higher than casual like I did. (played only in hard mode not even brutal xdd)",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game initially hooked me because it takes features from other popular games like Terraria, Rimworld, and Core Keeper. Unfortunately, the experience began to flatten after going through the initially enjoyable early stage. Overall, progression seemed pretty simple despite the actual rate of progression feeling drawn out due to combat and movement feeling pretty clunky. I never really struggled, but I never felt satisfied with my power level. Enemies and bosses were fairly consistently spongey.\n\nBy the time I reached the end, I knew I was uninterested in continuing with the endgame loop which is performing incursions repeatedly. These are basically instanced maps with variable gameplay modifiers. But outside of that, there was really nothing else to do. Despite having an infinite map, I didn't feel incentivized to explore beyond what I had already seen.\n\nWhile this game has potential, I personally don't want to review games based on their potential (especially post early-access) and instead what is actually delivered. Based on what we have and what other similar games can offer, I would ultimately just recommend playing those instead to experience a more content-heavy, refined experience.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Not a fan, progression is boring, kill the boss in one biome, go to the next, it's just different colors with slightly different enemies the layouts are pretty much the same or at least look the same. I beat the game on hard, without the use of villagers, there was only one boss that gave me trouble in the game(no spoilers) the rest was a breeze, felt like I was speed running. Terraria has way more variety and feels different at each stage of the game, with high replayability.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Gameplay loop becomes super bland very quickly as it is designed to force you into making settlements, which becomes a problem in Multiplayer as it removes quite a lot that a player can do. In Singleplayer I guess its okay, but villager micromanaging hell is not for me.\n\nThe game very heavily leans towards a summoner playstyle, with there being a lot of trinkets and armor sets that buff / increase summons as well as being able to recruit party member NPC's. (which you will also have to micromanage)\n\nIn general, there is no real sense of progression, accomplishment or even acknowledgement from the game's world- you simply go into a new biome every time, acquire biome-specific minerals, kill a boss specific to the biome and repeat until you reach the end of the game. I didn't feel satisfied when I killed the first boss for the first time.\n\nThere is more engagement and recognition of your actions in Terraria than in this game, as in that game you will literally cause raids, events, new ores and new monsters to appear with (almost) each boss fight you've fought off. \nNone of this happens in this game, which is funny considering that this is the [i]only[/i] thing they were unable to replicate after taking so many ideas from Terraria.\n\nI don't think Necesse even knows what it wants to be at this point.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A game that is too much like its inspiration, Terraria, without really improving upon the gameplay loop in any way. I would argue that most of it is just downright worse but I wouldn't call this a bad game by any means, I did enjoy my time with my friends, but that's not enough for me to warrant a suggestion that others play this game. \n\nLike terraria the combat loop in this game is mine stuff, build stuff, fight enemies/bosses, repeat. Unlike Terraria the sense of progression in this game is very shallow and there is no real movement going on in the world. The game refuses to change up its rules or alter the gameplay AT ALL in order to shake things up. For the period of literally the entirety of the game it goes as follows:\n\n1. Mine in new area to get ore unique to that biome\n\n2. Build new pickaxe with the aformentioned ore to break be able to break the next biomes blocks\n\n3. Repeat\n\nThere are of course bosses unique to each biome and they're alright, kind of easy if I will be honest but I did enjoy the pursuit of trying to kill them all. That desire quickly fades when you realize that the cycle I mentioned before is entirely unchanging and it just becomes a slog. Each new biome is basically a reskin of the last with very minimal differences. There are unique enemies but they're mostly, (but not entirely), the same thing even lacking lots of visual flair to even make them distinctive. The actual tile-sets themselves I think are lackluster but I may be conflating this thought with just how samey the gameplay is between the biomes.\n\nTerraria is not a game I love to death, but it is a game I respect. Each biome/region has such distinctive visual and gameplay differences from each other that it makes you have to change your approach upon entering them. Once you beat Wall of Flesh suddenly hard mode occurs and you are showered with such crazy shit constantly, and the rules change (like corruption spreading) where it switches up your goals. That game forces you to adapt and fight for your goals. Necesse has  at most a minimal amount of that. I was hoping when I unlocked the deep cave ladder that it was basically the \"hard mode transition\" that Terraria has but nope, it's the same shit but now there is lava in some places. Boring, not entertaining, barely an obstacle.\n\nI think why there isnt a sense of world progression is because Terraria has this problem where people who join a world late in have this feeling of missing out on the events that previously occurred, especially hard mode and on. It does have a linear path to advance the world and once it's been tread that's it. I think the Necesse devs recognized that issue and made Necesse about individual progression rather than a world progression. An interesting idea but they didn't solve more issues than they made, and as a result they made a mediocre experience. This is made more obvious where after mining and upgrading your stuff when you leave the mine everything on the surface is completely trivial in terms of difficulty. That's a shame.\n\nThe settlement system is fine but there's really not much to it, it sort of just exists but it's not bad. I'm sure as time goes on they will flesh out that system but I don't have many complaints beyond \"needs greater depth and focus.\"\n\nThe art and music is fine but I don't like any of it. Personal preference thing, not a real criticism. I think some of the sprite work is a little too cluttered and big. \n\nI don't like the UI at all even if I admit it's better than the Terraria UI in many ways. I think it lacks a lot of personality and is just really cluttered but still readable. The UI is especially messy to navigate with a controller and I'd like to see them improve the controller support but this is a minor complaint. \n\nNecesse is a fine game but I already own Terraria, there is no reason to come back to this game.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Endgame are just looping incursion with not fun roguelite and grind. \nand only few new boss, rest of them just deep cave boss \nit is way too boring.\nI recommend it until fallen wizard, but after fallen wizard the game experience straight all the way down to grind and boring gameplay",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fun at the beginning but the other review was right. It becomes a grind of boss fights and mining an arena to fight a boss over and over again. Like 20 boss fights type of grind one after another. No good weapons or trinkets till the very ended. No good progression. Just the same stuff but you have to tier it up. I dont want to play a game that reminds me of roblox rebirths.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The devs played Terraria, Minecraft, Rimworld... And they fell in love with the surface, apparently, while missing the actual depth.\n\nFor example: there's wires. They're clearly copied from terraria. They come in 4 colors. You can connect them to logic gates, even to counters, and timers, and delays...\nBut what I/O is there?\n- Motion sensor\n- Music block\n- Led panel\n\nThat's IT! That's all you can do with all that Turing-complete logic. Enjoy making Darude Sandstorm or a 4-bit adder for no fucking reason I guess, since you can't use all that logic to actually affect the world besides triggering traps.\n\nBase building is so secondary that I got an achievement for killing an enemy with a trap, and only 0.6% of all players got it, demonstrating that it's all really just an afterthought.\n\nThe whole game is an afterthought.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "5h on hardmode, already out of content. Mediocre. If you're expecting a Terraria-like experience you'll be disappointed.\n\nProgression isn't very interesting or exciting. Bosses are just bullet sponges, some have poor visual clarity. Your character glides across the floor like there's ice everywhere, very poor character control, which is funny considering there are dungeons where you need to avoid traps. Gear choice feels limited.\n\nIt's not the worst thing out there but I wouldn't recommend it either.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "No story.\n\nGameplay loop is repetitive.\n\nVisual design is lacking. (e.g. a late game boss is red with red projectiles on a red background, leading to unavoidable deaths because you can't see anything)\n\nGame suffers from stuttering even on a single player world. (e.g. with 5 summons, bosses skipped their usual movement animations and teleported on my head, instantly ending a run)\n\nInfinite world doesn't provide value. Effort could have been better spent elsewhere.\n\nI gave this game a good try, and enjoyed some of it, but can't recommend it.\n\nEdit:\n\nMore colour issues. [spoiler]Last boss is in a pink arena, with 5 different kinds of pink projectiles, vs my pink summons, with a pink layer over the whole thing. [/spoiler]",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's not bad, but the progression is very repetitive. Weapons are very repetitive. The rewards for the quests just seem bland. I get that they are there to introduce things that help progression, but it just seems like a really cheap way to introduce mechanics to the game. It all just feels so copy-paste. Go here and fight blank by using blank. Every. Single. Time. Game definitely has great potential, but I don't think its there yet. It feels as if the dev's lack creativity, and are really banking on how hard they can copy terraria. I mean, almost all of the weapons are straight up copies, the events, the enchants. I'd like to see more creativity from this in the future.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "World does not feel very alive so I don't feel like building in it. The villagers are robots for you to automate your resource production. The boss kill progression does not feel terribly rewarding (I collected all my villagers and dumped them on the few bosses I killed). When you find a biome you will not find much anything different in the next biome of the same type. Usually finding just one is enough to get the resources you need. This game really suffers from the \"infinite world of nothing\" syndrome. Does not get me excited to play it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gameplay is enjoyable. Lost an entire day of progress which completely turned the experience sour.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This was a much better game than Core Keeper, both \"Terraria but across.\" Core Keeper is probably the better game for the first 10 hours, but then becomes absolute trash with huge voids of empty, an ocean system that hates players, and only vaguely tolerable with the addition of drills. \n\nThis game is pretty tight up until the second go around of the biomes, which is to say, something on the order of 10 tiers worth of gear, which is no small feat. The game manages the \"RNGscrew\" of \"but I haven't found 15 more chunks of the latest ore,\" by having NPCs that repeatably can produce ores, alleviating the doldrums of most games of this genre that get sucked into the \"let's just increase the numbers to drag out the playtime!\" spiral.\n\nHaving left my settlement to run overnight a few times (a mostly superfluous exercise to \"solve\" waiting for crops I had missed and likely adequately done in 30-60 minutes); so I'm estimating back from my 20 hours. \n\nThe entirety of this review being negative falls on the suddenness with which a game that has many mechanics to manage \"RNGscrew\" suddenly forgets them with the \"Deep Plains\" biome (\"Deep\" being synomyous with \"re-run\" conversationally) which requires you to find a specific boss arena in order to advance, but as in the genre, everything is RNG, so I spent 2 hours of doing nothing but digging out a grid search pattern.... no accomplishment, no advancement, no fun, no nothing.\n\nNothing. Nothing. Nothing.\n\nHorrible drop into awful from a great game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is honestly amazing, until you reach incursions. Up to that point, it somewhat captures Terraria's sense of exploration and progression, with clear goals, and a similar feeling of discovery. But once incursions begin, all of that falls apart.\n\nAt that stage, the game turns into a grind for what’s essentially currency, used to push your gear into higher tiers (Which does not feel rewarding). You’re stuck replaying the same map layouts over and over, doing boring objectives like mining ore you no longer need or killing a certain number of enemies.\n\nAnd the \"Infinite Seamless World\" quickly loses its meaning once you’ve cleared each biome, there’s simply no reason to go back. This problem becomes even worse once you reach incursions, as you’re no longer in the open world at all, you’re just interacting with an altar you place in your base that removes the open world entirely. Which leaves the endgame feeling like a boring and dumbed down version of PoE, with none of the depth that makes PoE engaging.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Have to disagree with the majority on this one - I didn't have a lot of fun with this one.  I heard this game described as a combination of Terraria, Minecraft, and Rimworld, which I think is quite accurate, but not in a good way - in trying to do many different things, it makes each of them feel shallow.  It has the unsatisfying gameplay loop of Terraria (kill boss -> get loot -> use loot to kill next boss -> get more loot, repeat), but lacks its charm.  It has procedurally generated worlds, like Minecraft, but Minecraft made that world interesting by allowing the player to interact with and reshape it in a satisfying manner, which this game lacks.  It has RimWorld's graphics and the tedium of colony management, but not the rewarding diversity of characters - in this game, you can interact with an infinite number of procedurally generated NPCs and towns, and not a single one of them will be significant or memorable in any way.  The friend I played with seemed to enjoy the game (he said he found the colony management relaxing), but I could not for the life of me figure out what I wanted to do - there were many things I could do, but none of them were actually enjoyable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Well, I hate doing this but I can't really enjoy this game. I bought this primarily to play on the Steam Deck and I'm not too pleased at all. The controls are absolutely chaotic and obnoxious. You can tell this game was primarily for PC gaming which is fine but I highly don't recommend this for controller/handheld devices like Steam Decks and such.\n\nGonna have to pass this up.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Really want to play - but within ~30 min of opening for the first time, I've had it completely crash/lock up my entire computer twice. Back to back. Just reached out to support and will happily update this review if the issue is fixed.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "It's empty. The overworld is almost pointless because exploration doesn't offer you any new experiences very quickly. The game is damned empty, with a strict and flat vertical climb. The automation for the NPCs is finicky, and ultimately pointless as you can set up massive networks, but for what? What purpose? The game is *empty.* It doesn't matter how many developers worked on this. It's, just empty. \r\n\r\nAll of the comparisons to Terraria are disrespectful to both Terraria, AND this game's dev, as it puts an unfair idea as to what to expect prior to entry, hence my review. It's a perfect 5/10 experience, and 5/10s often feel worse than 3/10, because you've realized you've wasted time, for no emotional payout. \r\n\r\nThe game, is empty.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Multiplayer is a buggy mess of desync and chunks not loading.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Purchased in early 2022 while still in very Early Access. Total playtime nearly 150 hours (including offline playtime).\n\n[b]TL;DR I do mostly recommend the game up until Incursions with the understanding you may want to stop then, but this locks you out of about a third of the game unless you want to mindlessly grind for bigger numbers and stop interacting with the rest of the game.[/b]\n\n[h1]Pros:[/h1]\n\n+ Slightly simplified top-down Terraria + simplified Rimworld. The mix of colony management optimization and Terraria-style progression is addicting in every way. If you enjoy anything close to Terraria, this is an instant buy.\n\n+ The soundtrack has its own vibe that's hard to describe. It's good... perhaps fewer epic highs compared to other games, but the overall floor is higher. The first boss' song is an absolute banger... and it's just the first boss.\n\n+ The new seamless world gen is so much nicer than the island style of Early Access. Just a straight upgrade.\n\n[h1]Cons:[/h1]\n\n- The first and most serious con, and the ultimate tipping point for a negative review, is the Incursion system. For most of the game, you're playing Terraria+Rimworld. Once you complete the \"main story\" missions, the game turns into an oversimplified Diablo/Path of Exile game. You run tablets (maps/rifts) that have random modifiers to get a few types of currencies. You use these currencies to linearly increase the stats of your existing gear. At the end of the tablets, you fight a boss which is usually poorly balanced and either super under or overpowered relative to your current power level. Rinse and repeat, grind, grind, grind. You can basically ignore your settlement and the rest of the game at this point.\n\n- Difficulty settings feel under-cooked and tacked on. There are no mechanical differences with combat or boss mechanics between the difficulties, only \"things hit harder\" and \"you can't revive settlers if they die.\" \n\n- At v1.0.2, there are still quite substantial balancing issues. Oftentimes I would upgrade to a newer weapon that did less damage than the previous one even taking into account AOE/piercing abilities. Some weapons in mid game I ended up keeping until the very end.\n\n- Significant performance issues later on. Running a 13600k and 9070 XT at 1440p and I can't get more than 120 fps (usually bouncing from 80-120) at end game with a single settlement. During the penultimate boss fight, I even dropped to consistently below 60 fps. Max single CPU core usage around 20% which points to optimization issues. This game shouldn't have a problem running at a locked high refresh rate on a weaker system, let alone mine.\n\n- Most of the bosses are... bland and simple, I guess? In Early Access this was forgivable because I expected changes to be made, but every boss boils down to three things: classic worm boss (easy to defeat with piercing weapons to ignore all mechanics), a magic boss that circles around you and shoots projectiles (just circle them back and attack with a homing weapon until you win), or a boss that charges/rams you in a straight line (run in a circle to avoid and attack with a homing weapon until you win). One of the later bosses changes it up slightly by making you play tic-tac-toe against them while also dodging projectiles which was well designed, but it's the only boss with anything interesting going on.\n\n- In addition to the previous point, bosses are also bland in the sense that the fights aren't much of a spectacle, even the final \"main story\" boss. While this game isn't Terraria, it's probably the best comparison so I'll use it. The first time you fight bosses like the Wall of Flesh, the Empress of Light, Celestial Pillars/Moon Lord, and others feels like an epic war of attrition. Here, there was very little difference between the third wizard and final wizard bosses other than the arena location.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gameplay loop is fun for 4 hours then it is an unimaginably boring grind",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Do I recommnend this game? Sort of. Could it be improved? Absolutely. Is it fun? For a time... \n\nI'm playing co-op with my friend and we're having quite a bit of fun doing it. Having said that, the mechanics/systems get boring pretty fast. Here are some of the negatives:\n\n1- Progression: The gear progression is odd...  At the begining, you gain access to starter tools but quite quickly (and almost at the same time) you unlock copper, iron and gold which allows you to skip the progression of the in-between materials, launching from starter tools to.. well.. gold in no time. I found this disapointing and completely underwhelming. I would have loved a slower progression towards unlocking these better tools. This seems to have robbed me of any sense of achivement regarding said tools. \n2- Biome progression: So far, the world appears to be nothing but the same biomes, stitched together on a wide, open map. I would have loved to see the world become tougher, the biomes changing as I walk away from my start location and run 3000m 5000m, 10,000, away, in a straight line, away from home. Alas, it appears that it's just the same biomes, at the same difficulty, over and over again, no mater how far I make it away from home. The same loot, the same monsters, the same biomes. Seems to me like there is very little reason to spread out and build in any other location other than my start location. The first level of dungeons appears to be the same; the same dungeon biomes, repeated ad nauseam, with the same loot, same monsters, same difficulty, no mater how far I travel. \n3) Gear crafting: Once I found and went into the swamp dungeon, a quick run around allowed me enough material to build an entire armor set. It didn't take much effort; it didn't take very much time, it didn't take any planning. There was no 'working on' this gear progression; it simply happened once I found the right biome. Found the ore, processed it and voila; a brand new armor set with minimal effort. In another hour, I made 3 more, for my settlers.\n\nAs much as I enjoy playing this game with my friend, now that I know what I'm doing, I can't see myself playing it for a second playthorugh. It lacks a real sense of progression. It lacks depths. I didn't take long for me to get a 'same old, same old' feeling, when I left my settlement to go on an 'adventure'. Very quickly, any sense of adventure gets replaced with a sense of 'I've seen this 100 times already'. Once you know what you're doing, progression will be absurdly easy and would require very little effort / play time. \n\nIn short, it lacks a ense of biome progression. It lacks a sense of gear progression. It very quickly devolves into a feeling of 'same old' biomes, same old monsters, same old loot. There is very little to ZERO need to spread out and rebuild anywhere. There is no need to build a step up base. There is no need to explore anything other than the biomes that you can already access from the first hour or 2 of playing. \n\nThis game has some good, strong bones. Alas, the implemention seems... off...  After 24+hours of gameplay, the game seems very shallow. It lacks a solid progression system. The sense of adventure quickly wears thin and dissapears almost entirely. Perhaps I just got addicted to the likes of Valheim, where opening a new biome feels exciting; where exploring and maping new island makes me happy; even after 1000+ hours of gametime. \n\nThe Pros:\n- Settlement building was fun. Had a great time building our home, building settler homes, building farms, animal pens, roads, chest rooms and so on. The dev did a great job on this! Lots of decorations, building bocks etc. \n- Love the 'cosmetic'  slots that allowed us to wear one armor set while looking like another. Kudos for letting us look how we WANT to look. My friend was super-happy to wear the frog head while I loved rocking purple robes, orange boots and a bone headpiece. Alas, 'metal' progression doesn't really exist so we didn't need to update our settler rooms. They don't seem to care if something is made from wood, copper or gold. We'd love to see a more in depth 'room happiness' mechanic. Of course, this means that the ease of which you can access iron, gold etc would need to be re-tooled. \n\n- The ability to 'mod' your chacter using trinkets was amazing; From being able to build for mana-regen to extra armor. We loved the ability to tailor our enchants based on our build wants. We spent WAY too much gold re-rolling our enchants :)  but we see this as a positive because this meants that even 24+ hours in, gold still retained value for us. \n\n\n-------------\nSuggestions: \n- Change the whole map system where you can hit tougher biomes when you travel far away. Give us a reason to build step-up bases; to link bases using mine cart rails. To fight out way through the map to get to other, tougher places. As it stands, there are zero reasons for us to move away from where we started. \n\n- Need a 'settler leveling' system where we can assign points to our settlers. They can acquire XP from completing certain tasks. IE: Unlock cook recipes the more they cook. Unlock better mage enchants the more they enchant our stuff etc. This would breath new life and new choices into our settlers. Once programmed into their tasks, we had no need to even care that they existed. We have no emtional connection to them; there's no need for us to interact with them other than pay our mage for enchants.\n\n- Would love a skill based leveling system where we become better at mining, farming and so on. Killing countless thousands of monsters, in a game where spawns just keeps comming, holds little to no value. There is no real reason to keep killing monsters. If anything, the goal is to drop 100,000 torches to monsters STOP spawning since mobs don't have any value other than being a general annoyance. \n\n- Speaking of useless monsters: We'd love to see a \"+1% damage to <x> after 100 kills, 1k kills, 10k kills, 25kills, 50k kills (or some such). At the very least, it would give us a small tangible benefit for slauthering mobs and add some goals for a small increase in damage to certain bosses. ;) (example: 10k purple mage kills gives me a 4% extra dam on the mage boos? Heck yeah! Bring on the farming slaughter!) I love such proverbial carrot danglings. They give me purpose, something to strive for. \n--------------------------\n\nOverall, it's fun but in its current state, I'd pass if I wasn't playing with a friend. For me, this game offers zero replayability. I'm of the opinion that this game needs some serious redesign from someone who has experience with progression systems.  \n\nWe had fun poking around and learning about the gameplay systems. Once those were figured out, there's not enough depth to keep us here. For me, replayailty value is zero; which makes me sad. I truly wanted to love this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you like crafting and collection new materials for more crafting, this is fun. If you don't, it stops being fun after about ten hours or so when the exploration more or less has been done.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "5/10 for me - I don't really get it, it feels like this is a worse version of a ton of other games. Minecraft, Starbound, Elin 2, Terrarria - it goes on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would kindly like to ask what is this type of progression. Doing the same bosses over and over again just to get about 30+ dmg on ur weapon/ 8+ armor and u have to do it 10 times on every single piece of armor (helmet chestplate and leggins) before even trying to take on the final boss. Also what on earth is the final boss ? Why do u think any human being would kill this on brutal? Me and my friends were playing whole game on brutal but as soon as we saw last boss we gave up. This thing is literally impossible to do.\n\nTo sum it up progession is good till incrusions and last boss is absolutely fucked up u just have to nerf it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's got a nice style, but the bosses all felt pretty similar and a few of the late game weapons for mage and summoner were underwhelming or felt bad to use imo.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}