{
  "positive": [
    {
      "review": "From the very first duel to the final boss, everything felt larger than life. The combat is pure brilliance — every clash of the lightsaber, every perfect parry, it all makes you feel like a true Jedi. And when that iconic Star Wars music kicks in... you can’t help but get chills.\n\nAt first, I was lost. The world felt confusing, the paths winding — it’s a 3D Metroidvania after all, full of backtracking and hidden routes. But once I understood the flow, exploration turned into adventure, and every return to an old area felt rewarding.\n\nIf there’s one thing I didn’t fully connect with, it’s the world design — but the story, the characters, and the atmosphere more than make up for it.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "Good story and Interesting characters. Nice combat as well.\nThe only issue for me being the unnecessary combat with hostile flora and fauna, its as if the Jedi became poachers post order 66 just to make ends meet. Also if you are not into puzzles and traversal, perhaps avoid this one.\nsolid game however.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Overall, good game. However, few cons of the game are backtracking is extreme, map design looks pretty, but can be annoying to navigate, and some of the parkour such as jumps etc are bad. Pros of the game are that the combat feels fun, and cool, story is enjoyable, and getting this game on sale for cheap, is a cherry on top.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I'm not a fan of the Star Wars series, and I happened to play this game and I liked the atmosphere and style. This made me want to finish it. I can say that it was the best story-based game I've played in a while. The gameplay isn't perfect, it has problems, but overall it was great. It's strange that EA can make a good game out of this game and doesn't.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game, doesn't suffer from the many technical and performance issues that its sequel does.\n\nPros:\nLightsaber combat has a difficult learning curve, but feels rewarding.\nExcellent soundtrack and ambiance that give a true Star Wars feel.\nBeautiful worlds and vast areas to explore.\nStory, compelling survival arc.\nPuzzles are short and sweet.\n\nCons:\nSome minor bugs and crashes (nothing compared to the sequel).\nCombat/enemy variety can be a little low (especially during backtracking).\nMetroidvania-style backtracking (may be a positive depending on personal preference).",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Quickly became one of my most favorite games!\nGreat art, great story, worth to get.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's what Force Unleashed should have been.\n\nIf the sequels were just this game but a movie, they would have been better received.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "incredible game, a must have on steamdecks OLED perfect for parts of the game with contrast ,  like the deep black caverns , with your ultra bright saber, this should be the demo for the oled , for the game itself , its truly captivating , a must have in my opinion",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I think it’s a really good game. The story is solid, and while the main character can look a bit stiff when doing certain actions — like pulling out the lightsaber while running or jumping with it — overall, the graphics and animations are great. As a casual player, I played on Jedi Master difficulty and didn’t find it too hard. The main story isn’t very long, but if you want to go for 100% completion, the game definitely takes a lot more time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Do you like Dark Souls? Do you like quality Star Wars content?\n\nThen stop reading and buy the game. While I praise the devs for wanting to strictly adhere to canon and not makes waves with established lore...withholding that amazing Inquisitor cosmetic for as long as they did was silly.\n\nI will say that making certain lightsaber cosmetics paywalled was in poor taste, but there's no shortage of in-games cosmetics and there are always mods.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Its Uncharted meets Star Wars. Which isn't bad, just could be better. Got it on sale for $4.00, so it's a steal. Give it a solid 7/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Star Wars Jedi: Fallen Order is one of the few examples of Soulslike element integration done well - and, in general, manages a great blend of atmosphere and gameplay.\n\nThe skill/experience system works quite well and doesn't become too grind-heavy, even with the occasional death (it really helps that you can never lose gained skill points, only the progress to the next one). Combat flow works fine with just a few exceptions; plus, there's a difficulty selection! (The latter needs to be pointed out particularly in the Soulslike genre, after all most devs in there seem to not know how those work. So, if the game looks too intimidating, don't fret, you can set it to easy - and, at least in my experience, even hard [Jedi Master] isn't that bad in comparison to your usual Souls suspects.)\nOn the other hand, adding metroidvania elements on top of that wasn't exactly a good choice, backtracking becomes very tedious very quickly - while mostly avoidable unless you're gunning for full completion, an improved fast travel system (more landing points, or better interconnected areas) could've avoided that issue entirely.\n\nThe story and world building is, of course, very reference heavy (it's set in a well established universe after all), but it also fits well into established lore. (This isn't The Force Unleashed, where a ridiculous powerhouse had to be somehow shoehorned into the timeline without the latter falling completely apart. From that PoV, maybe it's a good thing that we're mostly past the era of PS2/PS3 action games.) And not only does the game impress with its graphical and audio design (which is, to be fair, to be expected from a AAA game because that's where most of the budget lands), but there's also lots of smaller details that make things fit together - from random storm trooper banter to the occasional rat scurrying into a concealed pathway to indicate the way forward (see, ledge painters? that's how you do it).\n\nParticularly as AAA games go, Fallen Order is extraordinary. (Even more so as the publisher is EA, though that is as to be expected not without its downsides: not only do you need its client in the background but you also have to fix a registry entry containing the wrong installation path in order to get the game to launch. Still, they've done much worse on other occasions.)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Poucos jogos decentes de Star Wars atualmente, Jedi Fallen Order continua sendo um dos decentes até hoje. História boa, gameplay ótima. Quem gosta de jogos com combate no estilo soulslike, Lies of P, com um nível bom de desafio, esse jogo vai te dar isso. E quem curte, assim como eu, jogos com cenários fechados que você abre conforme vai liberando habilidades, estilo metroidvania, esse jogo tem isso.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Map design is terrible, it's just moving back and forward 5 times in one area on every planet without any meaningful rewards, the characters are one dimensional, but the combat is actually pretty decent and probably the only strong part of the game. I would give it solid 6/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great gameplay but annoying puzzles , wouldn't recommend if you hate puzzles",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of my favorite Star Wars games to date. The story is really well done and does not rely on the Skywalker storyline. As a tip, when trying to fully 100% complete each planet, every nook and cranny needs to be explored.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a very clean and good star wars game , combat feels very cool and smooth.....storyline follows a padawan named cal kestis who learn various jedi arts throughout the game , graphics are cool.....the game is fun but there are few times where you will find yourself stuck at a stupid puzzle which has 0 relevence to story because no one wants to do shitons of puzzles in a soulslike , speaking of soulslike the difficulty is very easy atleast for me.....darth vader stole the show in endgame and easily most badass entry and power display of dark side was cool as well.....\r\noverall a 7/10 game , i haven't experienced any bugs or glitches but there were performance issues and stutters in between for a second....\r\nas a star wars fan iam satisfied with the content in game , if zeffo puzzles did not exist this game was easily 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best single player games ive ever played, up there with fallout and far cry, great graphics, good gameplay, 10/10 story telling, got it for $4 best money ive ever spent on a game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This was a pleasant adventure game. As a person who has not watched any of the STAR WARS movies and going in blindly into this universe, I enjoyed it. Lore was compelling, combat and different types of enemies were nice. I love BD-1 and all the crew, including that strange thing that is hiding in the vents. 10/10\r\n\r\nDefinitely checking out the next game of this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This could be the best thing, except for KOTOR. It feels great to play a modern Star Wars game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the funnest lightsaber experiences in almost a decade.\r\nIt doesn't have the physics level of Force Unleashed but still gives an enjoyable combat.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Star Wars Jedi: Fallen Order brought back the feeling of a real single-player Star Wars adventure — focused, story-driven, and without the usual modern live-service noise.\r\n\r\nIts mix of exploration, lightsaber combat, and quiet moments between battles made the world feel alive, not just cinematic. \r\n\r\nIt wasn’t perfect, but it delivered something rare: a Star Wars game that trusted the player to enjoy the journey, not just the spectacle.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An above average Star Wars game that has great lightsaber combat and great graphics and performance. The problem for me was the story seems weak and so do the Characters. Cal Kestis is your standard Disney Star Wars cookie cutter hero with nothing really interesting about him. Maybe he gets better in the next one but seems like a waste of a first game. I beat it in 17 hours and there is a new game plus but the dark soul style checkpoint system makes that a chore. There is also a lack of rewards for exploration other than light saber parts and ponchos and the same outfit that varies in color. Also the dismemberment mod on Nexus Mods makes this game much more fun. Not worth full price at all but on sale yes.\nOverall 6.8/10 (STARKILLER WAS COOLER)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, found a cheese loophole pretty soon. Cakewalk.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. The graphics are insane and it was on sale. I would say that this game was definitely worth its price. I love the gameplay and could get lost in it. All I would say is that it depends on if you like fighting, action, or star wars games. If you like those genres then this game is for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a legit 10/10 story. Yes, it sort of baby's first Soulslike/Uncharted clone. Yes the backtracking is a little annoying. But it's fun, gosh darn it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The beginning of this journey...\n...I want my lightsaber btw\nSHING SHING\nSHING",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great combat, good story. Took 15 hours to finish which is pretty perfect in my opinion. Would buy again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the gameplay is great and for me, after the intro, the game's story didn't quite pick up until the second half of the game and it got GOOD. 9/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well packed cinematic game. This is not an action nor a soulslike, it looks more like an Uncharted with lightsabers. The story (quite good) is the main focus here, while the platform and the puzzle sections (that occupy most of the playtime) represents the real challenge. Combat is a little too slow paced and under developed for my tastes, and you can also expect a lot of backtracking due to a level structure similar to a metroidvania. The Star Wars vibe is definitely here, so it is a no brainer for all the fans of the franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun .I usually do not like star wars games but this one was surprisingly good and replayable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game the first time 6 years ago and it's still fun in 2025. Graphics are great, combat is fun and exploration is rewarding. There's a good variety of enemies to fight and locations to immerse yourself in. The plot and narrative works quite well since this is the first entry in the series but I do dislike the cameo towards the end. It runs smoothly on my RTX 3080 at 1440p but it does stutter because it uses UE, but not quite as bad as Jedi Survivor. Since it's using UE, the visuals are beautiful. Some of the locations are breathtaking and I've found myself staring into the distance often. This is the kind of game I'd return to play again in another 6 years. 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bought this game a few years ago, finally gave it a try and was hooked. loved BD-1 and the plot. unlocking new abilities kept the game fresh. yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me it's a solid good game, smooth, no crashing, minor bug not a big deal\r\n- Story                10/10\r\n- Combat            8,5/10\r\n- Exploration       9//10\r\n- Customization  9/10\r\n- PONCHO           1.000.000/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Good graphics and combat was feeling good. Story was perfect and well made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mandatory EA login sucks, but the game itself is a solid action-Metroidvania. Still has some animation bugs / jitteriness unfortunately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It´s a fun game to play. In my Opinion the mix between Combat, Parcour running, puzzle solving and storytelling is great. Depending on the difficulty you play on the bossfights are either really challenging or pretty easy. \r\n\r\nThe Story ends pretty unsatisfying so there is the ned to buy the second part. \r\n\r\nGrafiks looked good, i play at a Ryzen 7 5700x with a RTX 4060ti in 4K Resolution with 165FPS locked. Performancewise there were no problems.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got to the end in 2022 and rage quit for nearly 3 years - but the fact it can just be picked up again speaks volume and with a little discipline around blocking enemy attacks it kind of is the crux of the game, so my rage was unjust...I was just poo.\r\nFinished it, doing new story+ and waiting for my new controller to play Jedi Survivor so recommend Fallen Order, I certainly do!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly one of the greatest pieces of fiction i've ever had the pleasure to play. i didn't find any problems with this game and i regret not giving it a chance earlier. if you're reading this WHAT ARE YOU DOING? BUY THE GAME ALREADY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this game so much, I bought it on sale for my PC and played through it again (first time on Xbox).  Was great to add variety with mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and surprisingly good game. The story is engaging, the worlds are exciting to explore, and the combat feels great once it clicks - even if it sometimes felt a bit laggy or slow. Overall, a really enjoyable ride from start to finish. If anything, I just wish it had not ended so soon, 7/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is decent, can be completed in less than 30 hours including all collectibles and achievements. Offers NG+ but no replayability value. The aspects that i liked about this game is the gameplay and combat, feels satisfying and cinematic. If you liked GoW 2018 gameplay you may like this game.\r\n\r\nBE WARNED: CONTAINS BACKTRACKING WITH NO FAST TRAVEL !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game demonstrates what great level design is! \n\nThe story is entertaining and the characters really shine. The combat is fun and the game allows for you to play your way and explore levels with different styles. The voice acting, sounds and music are are great. I cant wait to play the next one in the series and explore more of Cal's story and get even more powers!\n\n\nhttps://youtu.be/b4yH83FzUIE?si=KdzfHCyWE9squrpN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is how you do a Star Wars game! 👏🏻\n\nGorgeous graphics, fun gameplay, fun combat, fun parkour, and ADORABLE BD-1. I struggled with a lot of the puzzles at times but once you get the hang of it, it definitely gets easier. NPC's and characters can look a bit static/robotic at times, but nothing too crazy and there can be a few clunky movements here and there, but eh.\n\nAnd the best part? This game ACTUALLY RUNS SMOOTHLY! I was so excited to play Jedi: Survivor afterwards, but it's completely unoptimized and literally can't run it without stuttering/lagging/crashing.\n\nSo in short, absolutely recommend this game - but not Jedi: Survivor at this point in time. Hope they fix it. 🫤\n\nI loved it!\n\nGIVE ME A BD-1 IMMEDIATELY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyed this, only complaint is the amount of back tracking to unlock secrets and chests.  Game could really use a 'return to ship' option.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game just a little to short advise getting it on sale if can but overall amazing play would play again if possible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you are fan of SW,you should play it .Even in 2025.But the optimization of  this game didnt work very well,it dose not affect its status as a highly qualified fan -oriented game work.May the force be with you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have not played a star wars game in years like decades though this is pretty dope. Would be awesome if ypu could see the lightsaber cut through human emenies. There are some elements that remind me Halo and Tomb Raider. \r\nPlatforming and traversal are fluid and well-executed, with elements like wall-running, climbing, and rope swings comparable to games like Uncharted. \r\nAreas for improvement are minor technical issues, such as occasional frame rate drops or graphical glitches, though these are often minor and don't ruin the overall experience. Also found the need to backtrack through levels for missed collectibles to be tedious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Star Wars experiences outside of the original 6 movies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, although performance can be choppy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Immersive. Great game, great mechanics. Story was kinda meh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Çoğunlukla kombat sistemi ile öne çıkan bu oyun oldukça başarılı olmuş. Souls like ile hack and slash i nasıl birleştirebilirler ki diye düşünürken, ortaya harika bir görüntü çıkmış. Kombat ı çok tok ve oynaması da keyifli, gerçekten bir ışın kılıcı kullanıyormuş gibi hissediyorsunuz. Parry atma yeteneği oldukça harika tatmin ediyor. Oyunun gidişatını beğendim ve hikayesi de normal bir star wars hikayesi. Yavan söylediğime bakmayınız, ben star wars ı takip eden birisi değilim ve fazla da filmlerini izlemedim. Star wars ı seven kişiler veya sevmeyen kişiler bu oyunu büyük bir çoğunluk olarak sevecektir. Oldukça hoşuma giden Aksiyon sekansları heyecanlandırıyor üstelik hikayenin süreğenliği güzel oturtulmuş. Arada sırada da flash back ler ile desteklenmiş nitelikte. Gezegenden gezegene seyahat olayları güzel olmuş, fakat oyunun kısmi açık dünyası olan gezegenlerde, bir boşluk hissettim. Etraf bomboş gibi duruyor. Tabii bu her gezegen için söylenemez, bazı gezegenlerde bu boşluk hissi var. Boss savaşlarına bakacak olursak, çok tatmin edici bosslar da var, ortalama olan bosslar da var. Özellikle son boss u birazcık daha uzatabilirdiniz, fazla iyiydi ve son boss gerçekten şaşıracağınız cinsten. Tam bir jedi gibi hissediyorsunuz. Güzel bir deneyim. Gelelim eksilere... Oyunun optimizasyonu vasat arkadaşlar. Bir iyi oluyor bir kötü oluyor, ara sahnelerde bile bazen fps drop yiyoruz. Ki bu her ekran kartı için de geçerli. Çünkü adamlar ACELE İLE çıkarıyorlar bu oyunu. Fps droplar ve fps düşmelerinin yanı sıra, renk paletlerinde bir titreme meydana gelebiliyor. Zaman zaman buglar ve yapay zekanın sıkıntılarına da denk gelebiliyorsunuz.  En büyük eksiklikler bunlar olarak gördüm.  Oyuna puanım 7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR - Buy on sale if you want a fairly easy action soulslike.\n\nThe \"tutorial/introduction\" section really does this game a disservice it doesn't do a good job of accurately portraying the exploration or enemy placement you'll be doing later on. A solid game, worth getting on sale, but it is lacking. This game borrows quite a bit from Souls, which is a good thing but, they should've borrowed more. Having multiple usable items (not just your healing stims) or even having non-lightsaber weapons would add a lot.   Additional force powers unlocked from the get-go would be nice. The parrying is too strong in this game and it can turn into \"simon says\" between parrying or dodging when they're glowing red with their huge startup.\n\nThe current difficulties are too easy, easy and then hard because it's easy to die. I would've preferred harder enemies, perhaps a punishment for missing a parry, but give us more iframes for our dodge, give us better control over character (aka less startup frames), give us 3 stims to start and give us a little more health. There's an area on the first planet you visit where you do fine on the hardest difficulty until meet this enemy that's a harder version of a previous enemy you fought (same attacks and everything). Only difference is- it's got a lot of health and kills you in one hit. Presumably you're supposed to come back and fight this \"once you've leveled up\" but the leveling isn't like Souls where you can level a few times to grow your health and defense. You're given points to buy skills in a tree. There is one skill to upgrade your health... one time. Presumably in the future, only a few hours in, you'll get additional skills added to the skill tree but it ends up meaning if you wanna try to beat this guy before then it's gonna be a real pain- one mistake you're done. This wouldn't be so bad if it didn't feel like the controls fought against you. And again this isn't exactly a hard boss it's just easy to die versus it. Maybe they could've hidden this hard enemy behind a locked area you can only access once you unlock a force power later on?\n\nThe platforming and puzzles are so-so. I know they're there to \"mix it up\" which is fine. The item boxes you find a real let-down the majority of the time they're cosmetics. They should've contained useful items instead but the problem, as stated earlier, is that the only usable item you've got are your stims. No grenades, blasters, maybe a \"scent\" item that you could throw to distract creatures, a temporary stealth item, equippable armor, etc. nothing like this at all! \n\nA lot of effort was put into world-building with scanning environmental objects and creatures which frankly that time should have been spent adding more depth to the gameplay. It's nice to have but if I had to choose I'd rather have more items than be given a paragraph to read on why some pottery is relevant to the history of the place I'm in. Souls also did this better- they showed didn't tell a lot of the time giving the world a real mystery. Again it's fine if they keep in all this scanning crap but it feels like busy-work and it's not worth having at the detriment of more gameplay.\n\nThere is a lot to like and you do have to actually put some thought into the combat encounters which is a welcome change from many AAA games we see today (Callisto Protocol comes to mind where the combat is borderline mindless). I like the cramped, non-linear level design that helps make enemy combat encounters feel like you have to face them. Parts of the environments are destructible and you can cut creatures in half (a shame you can't slice stormtroopers in half but I get why). The world-building is well done; the story has been more engaging than even some of the films/tv shows that have come out in the past few years.\n\nWorth grabbing on sale but a real wasted opportunity to be something much more gameplay-wise. For a Star Wars game one of the best but still loses out to Dark Forces (and some would argue the Battlefront series but I haven't played much of that).\n\n(You do have to have the EA app to play this. Slightly annoying but meh.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty sure this would be Overwhelmingly Positive if not for forced EA app. This game is VERY good. Good story, fun exploration, good length, lots of collectables and customization, fantastic visuals (Cal's outfit is a literal work of art). The facial rigging is top notch which is something that tends to bug me in other games. The game plays like a souls-like but it's sorta laid out like Mass Effect. It also has a lot of challenging puzzles which remind me of Zelda at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pleasantly surprise. It was everything I hoped for and more. The combat was really fun. Can't wait till I get to play the sequel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big Star Wars fan would love it if the game were longer, like I got the double saber in the end and didn't even get to use it that much before the game ended :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great visuals, story and gameplay. Super fun, can't wait to play jedi survivor next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rating: 10/10\n\nAs a fan of the Star Wars universe, I couldn’t give Jedi: Fallen Order anything less than a perfect score. The game perfectly captures the essence of Star Wars and includes plenty of references to the movies, which is a real treat. It’s especially exciting to see iconic characters like Darth Vader make an appearance.\nI played the game on the highest difficulty, and it really pushed me to my limits. The final boss fight was a true challenge—it took me around two hours to defeat him, and every moment felt like a real struggle.\nOverall, the game is absolutely fantastic. I’m excited for the second installment and hope it builds on everything this one has accomplished.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best graphics, best story, best fighting mechanics, overall 10/10\r\nwould recommend buying it now on black friday",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One of the only good modern day star wars pieces of content released in years[/h1]\nSeeing the quality of this star wars game made me miss when George Lucas owned star wars and would consistently produce absolute banger after banger of great star wars content. Overall a pretty solid game but also very short. Get it on a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first, I was lost. The world felt confusing, the paths winding — it’s a 3D Metroidvania after all, full of backtracking and hidden routes. But once I understood the flow, exploration turned into adventure, and every return to an old area felt rewarding.\n\nIf there’s one thing I didn’t fully connect with, it’s the world design — but the story, the characters, and the atmosphere more than make up for it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is really fun once you finish the game and you are able to go back and collect everything that you missed and 100% the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game. I'd never played another game with this style of map (seemingly open-world, but guiding you along specific routes) and I love it. Keeps you on track while also planting secrets to find and figure a way to access. Good plot as well. Never knew I'd love alien cartel fight music so much lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story to the game is fantastic and love that you get to free roam!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, especially for it's price. Great graphics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game and the storyline but the difference between story mode and jedi knight is crazy they really need another option in between. also i dont like how few meditation points. there were times i would fight three different groups and then die on the fourth and have to go and fight all of them all over again. they also need to add more stim cans maybe some version that you can just pick up in random places",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hiii\nI'm new to the game, but I must say I got used to the controls really soon...\nThe only change I mage was changing the heal button to z and map to tab...\nThe graphics is pleasing, doesn't melt my laptop (yet), and overall had a very good pricing too...\nI was not sure if I shall try a star wars game, but mann I was right with the decision to buy it!\nNever thought a game I bought randomly would change my way of looking on story games...\nAnd now it's one of the most epic games I have played...\nI would love to have some recommendations from you all...\nWhich games shall I play...\nI want good stories which will make me feel the emotions...\nI need to play these masterpieces.\nPlease let me know your valuable recommendations...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“Jedi Fallen Order is a 10/10 game. It’s such a beautiful game, I can’t wait to play Survivor. The story is great.”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, it's really well made with good story telling and nice gameplay, the combat is ofc one of the most importent part of the game and it sometime's feel's a little janky but its still worth getting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really interesting as of the story of the game. Coming really close to whats the best in terms of combat . A lot of skill points and different abilities ,and the creatures are amaizing ! My favourite star wars game by far !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played through on Jedi Master difficulty.\n\nA very good game, with worlds that feel very fun to traverse (though not necessarily backtrack) through, combat that is very satisfying and feels fair [i]most[/i] of the time, and puzzles that do in fact engage the brain a little. \nI personally found the story very compelling, enough so that I completed it all over the span of a weekend so take that as you will. \n\nThere were however a non-insignificant amount of visual and gameplay bugs that occurred while I played, nothing major, but the odd 'Oh hey Cal is clipping into the floor' and 'Oh wow that guy just shot me through 50 feet of solid rock that's cool' tends to show up. \n\nAlso, fuck the Rabid Jotaz. Not because of it's moves, but for whoever decided to put it in such a terrible area to fight in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Similar game design ,graphic and story mode with the next game Star Wars Jedi : Survivor \r\nIt brings back the nostalgia of the old movies and games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak. ive only played 3 hours on max difficulty, and for people who hate soulslikes, dont play max difficulty play easy so your mushy baby brain can undertand the timings. anyways, game is peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got it back in 2019 on the Xbox One and its still a banger and worth your money especially when it goes on sale for $3.99.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Review:\r\n\r\n- Really cool Star Wars game\r\n- I like the combat mechanics\r\n- The new Jedi character development is interesting\r\n- The story is okay, though not outstanding\r\n- Overall, this feels like one of the best single player Star Wars games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphic : 9/10\nStory : 10/10\nGameplay/combat : 10/10\nExploration : 8/10\nSound : 8/10\nPerfomance/Optimization : 7/10\nDifficulty : 8/10\n\nOverall Experience : 10/10\nYou guys should try this game, Recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Stays true to what Star Wars is, yet also has fun mechanics and exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They call this a Souls-like but really I think it's more of a Zelda-like. Enemies cant kill you with attacks that didn't touch you, you venture into various temples, you get new abilities to play with from these temples, and there's a lot of puzzles to solve. Most of the bosses feel like dueling Ganon at the end of Twilight Princess and that's amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really fun game with great visuals, good story, and awesome characters!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game a lot but i must give some constructive criticism and ask for  this simple update could you please add a delete save game button as of currently its a very tedious process of going to my game files locating which saved game im trying to delete in my files",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good. The combat system is something I have never seen before and I liked it. The story for me is 10/10 and the fight with Dart Vejdar is 100/10 one of my favorite fights along with the fight against Malicos. If you ask me the game is worth trying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decently fun game, sort of like Soulslike Lite tm! Combat is fluid and fun and not too punishing and the save/ respawn/ heal points are well placed and ample so there isn't a lot of runback which Ive always hated in game design (looking at you Miziaki). The worlds are fun to explore and find all teh secrets but the cosmetic changes for the exploration are pretty unexciting in my opinion. I don't care that much to change my robot's colour.\n\nThe best part of the story and characters is the BD and the bond you forge with him as he goes everywhere. Every other character is mediocre in writing and backstory to be honest and well drawn. The story it is standard good vs bad guy with some Jedi monk dogma thrown in. It is fairly average.\n\nThe lack of a fast travel option is criminal though so if you want to find every chest and secret, I recommend using a mod to amend that.\n\nOh and the best dialogue comes from the Storm troopers banter, keep an eye out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty intuitive and well made, if not a little bit janky with cutscenes and the like. My main complaints are that the puzzles and level design can be poorly executed at certain times, and you have to bash your head against solutions because minor bugs or glitches have caused you to overlook a more obvious correct one.. As well as the fact that by the time you've unlocked all of the fun force powers and learned to defeat most enemies, you're already at the end of the game, and if you want to test your knew knowledge regarding the latter, you have to forfeit the former to restart and do it.\r\n\r\nAll the same, very solid Star Wars title that really helps certain planets live up to their identities. Don't regret a single moment I spent playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know that is series probably isn't everyone's favorite, but it's really good. I really like the ability to thoroughly gather resources and cosmetics throughout the many worlds that I visited in this game. I love Cal's character, and I love how down to earth he is. Cal wasn't the only one going on a journey, I felt like I was there too. There were some weird bugs, you guys know, this is EA we're talking about. However, I HIGHLY recommend playing this game. A friend bought this game for me and when I finally booted it up I was invested from the beginning till the end. The storyline and characters have rich and deep pasts. Everyone is haunted by something. It's not how you're knocked down that matters. It's how you pick yourself up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The care that went into level design and combat is much appreciated. The game is very cinematic and enjoyable for those who love the star wars universe. The plot line isn't that much but it certainly makes you feel like you're part of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% Achievement Completed on Hardest Difficulty. I do not believe I can do the Challenges if you know you Know, Tough with always going back after missing something, especially like three times, However the story and worlds are quite beautiful, quite different from Survivor but that's because this is the first one, Quite Enjoyed and think it's worth to get on a sale just like Survivor! Excited for third one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very annoying specially because I don't play these type of games but overall it's a decent time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like games with multiple game modes and cosmetics and are a Star Wars fan all I'm sayin' is, GET THE GAME IT'S A MUST PLAY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I for one really enjoyed this Star Wars game. It really isn't too often we can get a game like this that at least has a good touch on the Star Wars universe without it being a complete cash grab. It satisfies the itch but does not quell the need for more of games like this. It does have its downs but the ups far out way it.\r\nCharacters, Stages, items and lore all pull together nicely.  8/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Star Wars Jedi: Fallen Order delivers a highly satisfying third-person action-adventure experience that stands out as one of the most pleasant surprises in modern Star Wars gaming. The game demonstrates great respect for the iconic Star Wars lore, immersing players in a galaxy-spanning narrative that feels both authentic and engaging.\n\nYou play as an abandoned Padawan who must overcome his fears, hone his Force abilities, and master the lightsaber, all while evading the relentless pursuit of the Empire. The story is rich with familiar Star Wars themes and memorable moments, capturing the spirit of the saga beautifully.\n\nThe gameplay balances exploration, combat, and platforming, reminiscent of classics like Uncharted and Metroidvania titles but with its distinct Star Wars twist. Environments are atmospheric, enemies are challenging, and the soundtrack adds to the epic cinematic experience.\n\nFallen Order is a must-play for Star Wars fans. Whether you’re a die-hard devotee or simply enjoy a good action-adventure, this game offers both compelling storytelling and thrilling gameplay. While not without a few technical hitches, its positives far outweigh the negatives. An essential journey for anyone looking to experience the Force in a fresh, respectful way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely fun! A few stuttering issues, but it runs surprisingly well. Play it if you haven't, it's worth it. (Get it on sale if you can)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Metroidvania-style adventure game set during the time between Episodes III and IV, so it's got a classic Star Wars feel. Characters are motion captured, well acted, and full of personality. Lots of fun, though the combat can be quite challenging on higher difficulty levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's been quite some time since i enjoyed any kind of star wars content, so i was pleasantly surprised by this game. definitely gonna play the sequel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest story games for star wars fans, only if you can get through the obnoxious map, no fast travel and odd poncho choices",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hi, this game is very beautiful. It has beautiful cinematic scenes, and the  game play  is also great. The characters are lovely, even the villains have great performances. The game is short, and I recommend playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very fun and the graphics are just amazing!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent story good combat etc\n(completed game before)\n\nJust fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Melhor jogo de Star Wars ja feito, com elementos de metroidvania, soulslike e uma boa historia pra qualquer pessoa que goste de Star Wars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well worth a playthrough for any Star Wars fan.\nIs really cool to play with VR injection mod! (Ignore playtime, 100% on Gamepass Previously)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far the best Star Wars game I have played.  I'm glad I played outlaws before this as Outlaws would have seriously disappointed me!  Boss battles, level layout and story is done so well in thus game.  Now onto Jedi Survivor.  May the Force be with you ;)",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Wanted to go back to play this. But It won't let me unless I install the EA app. If I buy something on steam, I shouldn't have to install another game platform to play it. I shouldn't have to do some work-around that disables achievements and the steam overlay just to play a game I bought on steam.\n\nAny update that stops me from playing the single-player game I already bought is cause for a refund. I'll give it a bit to see if this gets pulled back. But If my game remains held hostage behind this blackmail then I'll just return it due to it no longer launching properly.",
      "voted_up": false,
      "votes_helpful": 239
    },
    {
      "review": "Great atmosphere, but not enough to make up for the lack of fast travel and tedious backtracking. I eventually lost interest! and quit.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The map system and trying to get around areas and quests is just pure ragebait. May as well just watch a playthrough with how much trouble it is to find where you're trying to go.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I started this game excited, thinking I was finally going to feel like a Jedi. Two hours in, and I am mostly annoyed. The parkour is boring and completely unnecessary. Climbing for 20 minutes at the start feels like punishment, not gameplay. Then came the train sequence, where the game froze because I went where I was supposed to too quickly. I killed myself 5 to 7 times trying to fix it, nearly resorted to YouTube, and then somehow it just worked, exactly the same way I had done six times before.\n\nThe first planet is a nightmare disguised as exploration. It claims to be open world, but there is really only one path. Everything else is just chests with cosmetics. Random scanning around the world is pointless. Enemies are dumb. They cannot see down, they stand alone 50 meters apart, and if you attack one right next to another, they will not react until you are practically on top of them. Random animals spawn from the ground to attack you for no reason. So far, the hardest thing in the game has been a goat and some puzzles.\n\nGraphically, it is nice, and the sound is okay, though some surround sound features do not work. Traveling between planets looks cool, but it takes forever. A four-minute conversation while taking off, then a long loading screen, is unnecessary.\n\nThis game promised the thrill of being a Jedi. Instead, it delivers tedious puzzles, annoying platforming, clueless enemies, random deaths, and pointless busywork. It is basically a bad Tomb Raider with a lightsaber, and not in a fun way.\n\nUpdate it's still terrible",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "beautiful environments, great animations and movement, but an absolute waste of time and a mcdonalds happy meal of a game. the marketing department did a great job, ticked all the right boxes and got a flashy star wars title worthy of selling millions while providing a soulless, shallow, boring gameplay. atrocious map design and slow, tedious back/re tracking are almost as unforgiveable as the EA app which is the cherry atop the shit cake: how does a game take literal 3 full minutes to launch?\n\nsuggested if you wish souls combat had an easy option but was terribly designed, or you always wanted to watch a 5/10 star wars movie while pressing buttons and collecting ponchos.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck EA launcher\ncrashes my pc in every single game\n\nimma pirate the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is challenging, fun and all round a good game. The major downfall is you have to have the EA Desktop App installed just to play it and because of this I can't recommend it. \n\nOh and the achievements are also bugged. I'm assuming this is because of the EA Desktop App.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is pure shit. Broken mechanics, wont let you progress. Physics are equally shit with capes and chairs glitching out every other cutscene, multiple puzzels are just rage inducing. DONT BUY THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As someone without a controller to play with on the PC, this game is clunky as hell and the combat is nearly unplayable. Game seemed interesting but when you don't like the core part of gameplay, there is no point of continuing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No... Just, no. \nI think any old-school Star Wars game is much better than this.\nThe gameplay is ridiculously easy, the enemies too, but come on... It's quite awkward when you look at the stupid map and realize that the game wants you to be in a certain place, even though what the game encourages is exploration...\n\nWhen you follow the colors of the attacks to dodge, freeze, and parry, and you still get hit by the blow they throw at you. Honestly, I prefer to keep playing my old Star Wars games on original discs (and if they ask me to delete them, I'll just say, \"Screw you, EA, I paid my damn money for my physical games back in the day\"). It's stupid that a Roblox experience does a better job than a company that supposedly makes AAA games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "took open world a bit too seriously i fear. if i gotta watch a yt video so frequently am i really even playing the game?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The systems for avoiding damage don't work like in any soulslike I've ever played. I seemingly perform them correctly but still take damage, sometimes because another enemy attacks during the animation, sometimes it just doesn't feel like working. The intro is a monotonous platforming section followed by a long combat section without heals, if you die during this then you are right back where you were with it proudly declared that you are respawning. Finally you get a bossfight where my attacks did no damage and dodging didn't work, its possible that boss fight was meant to be unwinnable but even fighting calo nord in a cantina felt fairer and better balanced. Ever faced ogres in ds2 with the default dodge speed and iframes. That is what this game is like, somehow the combat feels rougher and clunkier than in games where the clunkyness is intentional.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the very first things the game tells you is to use a controller. Game won't play nice with my standard Logitech (like the X button suddenly not working, or having to unplug/replug controller in multiple times). Do a little research and see this is an issue since release and never been fixed. Fix your ****ing game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been thinking about this and it's.. difficult to say whether I recommend this game or not. Went with \"no\", because ultimately, if someone came up to me and asked if they should buy this game my answer would be no. But there's so much to love in this game. \r\nThe characters are all great, Cal is one of my favourite game protagonists to date, and just anything with the story is.,, awesome. \r\nBut the gameplay is so unfun. I actively hated the combat, and I'm a dark souls player. The fact that I could only enjoy the game after setting the difficulty to Story Mode probably means you did something wrong. Annoying enemy placement, uninteresting combat and a moveset that sadly feels very lacklust.\r\nI wish I could love this game enough to 100% it, but I just don't feel the spark.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Absolute garbage; What is not scripted is full of player limited actions. A VERY poor story with the \"red headed Step-child\" of the SW universe as the limited playable character, boring and unlikable. The best thing that can be said is that the game is short (full of unreasonable and frustrating backtracking) so the suffering will at the least be limited.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gameplays alright but just watch the threat interactive videos on this. make titanfall 3.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is amazingly BEAUTIFUL: scenes, textures, whole materials. Has lots of cool variations of combat animations. But it comes as pure adventure/interactive movie. \n\nOn the other hand gameplay is very poor and blunt. Basically you are pressing same few buttons: dodge block scan hit1 hit2. Run and jump. Run and jump backwards. Customise with no point something. Watch cinematics. And that's it. \n\nIf it had RPG elements like gear level, more on level items/interactions it would have more explicit auditory.\n\nI like stories and every other comment in here says it has cool one. But at the same time I want just to play, To be more involved and interacted with the game. \n\nMaybe its just my feeling but expected it to be better.  Especially from Star Wars.\nUsed to be a fan of SW:KOTOR and expected atleast some minimal sort of that.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[b]I was fully expecting to love it...[/b]\n\n[b]As a life-long Star Wars fan and someone who grew up playing Jedi Academy and Force Unleashed for hours on end I for some reason half expected this game to have that feel... and it doesn't[/b]. I played for 3 hours and I feel like I had only 10 minutes of proper combat in total (random critters that pop out the ground are not what I count towards proper combat, they're just purely there to be annoying), which is the most fun part of this game. [b]The visuals are stunning, audio is nice too... but it all just feels... empty? Soulless?[/b] I didn't feel much in particular during those 3 hours. It kinda says a lot that the most excitement I felt was when I realised I can customize my lightsaber and outfit, cause it reminded my of Force Unleashed.\n\nThe puzzles felt crammed in half the time, [b]the maps felt claustrophobic [/b](especially dark areas you have to light up with your lightsaber that turns off everytime you have to do a jump, leaving you in darkness, that instead of building tension just makes you wanna move on to the next area as soon as possible) [b]despite being open-world in a sense[/b] and felt like what I can only describe is 'video-gamey' if that makes sense (the constant slopes to slide down into new areas got boring and on the nose real quick), and the pacing of exploring an area just felt a bit slow. The constant parkour gets annoying quickly as well, which would maybe be less of a nuisance if the movement was quicker and more fluid, but it just feels cumbersome sometimes. Maybe this is because of it trying to be a Souls-like and I'm just not the target audience (then again, reading opinions online from those who are into Souls-like games, not all found this game particularly interesting in that regard either).\n\n[b]Having to backtrack to the ship feels insulting sometimes.[/b]\n\nThe hidden boxes to find are fun... but it's all just cosmetics, nothing else, so the mystique wears off real quick.\n\nYou walk along the level, the music gets mysterious in an empty space with some boring puzzle... and it's just you and the droid. And [b]it feels lonely. It feels lifeless.[/b] Stormtroopers are spaced out so much you immediately forget you're supposed to be on a planet crawling with the Empire and [b]you just feel uncomfortable and alone[/b], and not in a tension building way, but in a disconcerting way.\n\nThe lightsaber combat feels clunkier than it should sometimes and robs you of the satisfaction of just slicing through stuff, instead making it feel like normal melee weapon with a slightly sharper edge than usual. Oh, and [b]in the 3 hours I've played, the number of times I have been pushed off the edge of the map by a random creature sprinting into me from outside of my field of view is frankly comical[/b] (in a way that doesn't feel like a skill issue on my part, but instead unsatisfying game design).\n\n[b]I just...\nI got bored 2 hours in, forcing myself to play for that next hour in which I did f***-all except for pushing some metal balls around with wind going through holes in the wall, forcing myself to continue playing instead of testing how well ALT+F4 works in this game, only to finally reach a story point that unlocked Force Push, which I realised would come in handy for all those passageways that I had to pass up because I couldn't force push them open quite yet... and then I realised that means I would have to backtrack the whole level to explore them... and then I also got my next objective... \"return to the ship\". Double backtrack. [i]Cool.[/i] I sighed, opened the pause menu and pressed Quit to Desktop.[/b]\n\nAs a random commenter on Reddit said: \"[i]I hated that 90% of the game is whacking spiders with a glowing foam bat, and I hated spending all this time on desolate, forgettable planets.[/i]\". Sums it up perfectly.\n\nMaybe I'll give it another shot down the road, but idk. I'm just glad I got this on a dumb-cheap black friday sale and not anywhere near full price. But I'm not so glad I bought the combo with Jedi Survivor fully expecting to enjoy these games enough to finish them back-to-back, because it seems I won't be doing that. Oh well. A bit of a [b]shame, cause it's not often you get to be a Jedi on your own little adventure... but somehow that wasn't enough for me to enjoy it, when in fact it should[/b]. Strange.\nGood looking UI though, very pleasant.\n\nIf you are the type of person to just play anything Souls-like, especially wrapped in a pretty Star Wars package, this game might be up your street. If you're not, consider the possibility you might just get bored and frustrated pretty quickly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just another dumb game where they hide everything and you have to follow a walk through guide to find everything.  So half the time you are reading about what to do next and where to go.  Then while playing the game, the other half of the time you are watching scenes and they won't let you skip them.  If you are some Star Wars super fan, then you probably are happy watching them.  If not, what a bore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Heavily overrated for what it is. This is just a puzzle game with mobspam and like even harder to get into then darksouls. Would not recommend eventhough it looks pretty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got softlocked on the mission where he goes to find the crystal, when he suddenly falls under the ice, you are supposed to swim down. My ginger fucker gets trapped above the invincible wall and won't swim further. Re-installed, same outcome. Fuck you if you read this, this game is trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't play the game without signing into ea and it won't send a code to my email. nothing about the game matters if I can't play it  Instant and permanent bad review. I hate that EA got even a fraction of the $3 I paid for this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like this game more but it has a identity crisis because it can't be Dark Souls, Uncharted, and Lego Star Wars at the same time.\r\n\r\nIt nails the Star Wars vibe and a lot of the cutscenes and scripted gameplay moments are great, especially the first hour. Unfortunately, this game wants you do a bunch of dumb stuff for every bit of fun it offers, and the combat is very sloppy compared to Dark Souls, which many of it's mechanics are taken from straight from, but not polished or committed to.\r\n\r\nWhat I want to do:\r\n- Use lightsaber and the force to kill bad guys and save the day\r\n- Go on a little adventure with my red-haired guy and his robot\r\n\r\nWhat this game wants me to do:\r\n- Use force powers to push boulders around and swing on ropes\r\n- Solve lame puzzles for children\r\n- Run around generic levels with the occasional star wars asset thrown in there\r\n- Platforming and climbing (don't remember that from the movies...)\r\n- Switch between frame-based and spatial-based mechanics when fighting enemies\r\n- Fight enemies that are too easy on their own but frustrating when in a group (ranged enemies sync their attacks)\r\n- Occasionally, some fun fights where you can feel like a badass (what the whole game should be)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very laggy. Even though I was playing on medium settings with lossless scaling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The best thing about  this game is the VERY innovative, luck-based combat system. See, the developers realized that the slow, cowardly and predictable enemies in this game were still too easy to beat. At first they tried designing Cal Kestis to be a goofy klutz who constantly trips over his own feet, then they gave him bizarrely slow attacks, as if he were fighting underwater. All of this helped, but the enemies were still just pitifully easy to dispatch, so slow and clumsy that they often just threw themselves off ledges without even having to fight them. THAT'S when the ultimate innovation came. One of the developers asked \"What if we only give it the APPEARANCE of being a slow-paced Team Ninja clone with clunkier controls, but we introduce a sort-of behind the scenes dice-roll mechanic EVERY SINGLE TIME the player pushes a button? Just think, a roughly 1 in 4 chance of the character jumping, blocking and attacking with each button push. Being a powerful young apprentice fighting storm troopers is boring, but the THRILL of barely being able to use your arms and legs is what will keep our customers coming back the years, nay months, during which we will continue to pretend to offer customers support!\"\r\n\r\nAnd so it was, with this BRILLIANT innovation, that Jedi: Fallen Order became the greatest Star Wars action game of all time, solidifying EA's reputation as the greatest game developer of all time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its ok, once i realized my character had rails and no depth and my lightsaber had no customization beyond cosmetic i instantly got turned off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I interest in story more than spend time for many Jump and trying to pass a way in map. It look like I played the Mario with Nintendo Famicom",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ea launchher is garbage\n\nIf you want it - pirate it. It  ill be much bbter exerieence.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☑ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☑ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10\n\nOverall the game was just okay not really worth the price tag imo way too short and the story was kind of dumb tbh. I'm not the biggest star wars fan especially since Disney took it over feels like there was a lot of woke Hollywood sh!t",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One word: Tedious. Absolutely not worth another second of my time. I wasted my money on this one. I miss the days of demos.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game have tag \"open world\" but its not open world game, its very linear game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "集合了所有我不喜欢的元素。。。地图全是野外且容易迷路，流程就是一直找路+解密，懒得退款了吃灰去吧",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "juego de mierda re mil tosco y buggeado. nunca me costo tanto terminar un juego. es MUY lineal y te hacen volver una y otra vez a los mismos planetas que ya visitaste 20 veces porque ahora podes hacer doble salto y lootear un COLOR NUEVO DE PONCHO. el combate es una verga, dodgear se siente muy contraintuitivo, bloquear no sirve si te estan pegando de a 2+, la camara es lentisima y no se puede cambiar la velocidad por algun motivo. \ny la historia, mamita, esta bien que star wars es una verga refrita y no tiene nada de profundidad, pero con esto se fueron al carajo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the worst game I have ever played second only to Lester the Unlikely on Super Nintendo. This isn't star wars. It's bad acting, bad storytelling, boring parkour, a tiny bit of combat here and there, horrible customization, and no soul.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Clearing a map takes about two hours. a lot of back tracking. It can be fun, but a lot of times you're met with frustration. Some of the checkpoints are plentiful, but sometimes you can be sent back pretty far. 3/5",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great short story bogged down by endless puzzles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "requires EA app and signing your name in EA blood to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Whomever designed Oggdo, HANG YOURSELF WITH YOUR FILTHY GUTS!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda fun but mostly sucked",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The EA app is terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls are the worst",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth the time or money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "POS crashes entire PC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck you ea fix your launcher",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "would not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "add sex",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA app.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wanted to go back to play this. But It won't let me unless I install the EA app. If I buy something on steam, I shouldn't have to install another game platform to play it. I shouldn't have to do some work-around that disables achievements and the steam overlay just to play a game I bought on steam.\n\nAny update that stops me from playing the single-player game I already bought is cause for a refund. I'll give it a bit to see if this gets pulled back. But If my game remains held hostage behind this blackmail then I'll just return it due to it no longer launching properly.",
      "voted_up": false,
      "votes_helpful": 287
    },
    {
      "review": "I've tried to get into this game on four different occasions. I'm not the type to quit on games very often but I've had enough. I'm sure the story is strong at times as the game progresses, but the gameplay is so clunky and annoying. The maps designs are unintuitive and at times frustrating to navigate. This game tries to be a soulslike but fails in so many ways. I won't even get into the performance issues/stuttering. I feel like the praise this game receives is almost entirely because it has Star Wars on it, and because there have been so few good Star Wars games in recent years. I do see the appeal, and if you can get that Star Wars magic feeling I could see it hook you despite its flaws, but it just did not work on me.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Great atmosphere, but not enough to make up for the lack of fast travel and tedious backtracking. I eventually lost interest! and quit.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "EA games ruins the experience of of being able to play this otherwise impressive game with their EA launcher, which can fail to launch for a variety of reasons. You cannot play this game on Steam without logging in to EA. Since their launcher is unreliable, I would not recommend buying any game on steam that EA requires you to also log into their servers to play.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The map system and trying to get around areas and quests is just pure ragebait. May as well just watch a playthrough with how much trouble it is to find where you're trying to go.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Beautiful environment and great graphics\nThe story was alright \nStupid boring puzzles\nMap system suck and no fast travel which made half the game repetitive and boring af",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Feels like a clunky Dark Souls game. Cool idea but I couldn't get into it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I started this game excited, thinking I was finally going to feel like a Jedi. Two hours in, and I am mostly annoyed. The parkour is boring and completely unnecessary. Climbing for 20 minutes at the start feels like punishment, not gameplay. Then came the train sequence, where the game froze because I went where I was supposed to too quickly. I killed myself 5 to 7 times trying to fix it, nearly resorted to YouTube, and then somehow it just worked, exactly the same way I had done six times before.\n\nThe first planet is a nightmare disguised as exploration. It claims to be open world, but there is really only one path. Everything else is just chests with cosmetics. Random scanning around the world is pointless. Enemies are dumb. They cannot see down, they stand alone 50 meters apart, and if you attack one right next to another, they will not react until you are practically on top of them. Random animals spawn from the ground to attack you for no reason. So far, the hardest thing in the game has been a goat and some puzzles.\n\nGraphically, it is nice, and the sound is okay, though some surround sound features do not work. Traveling between planets looks cool, but it takes forever. A four-minute conversation while taking off, then a long loading screen, is unnecessary.\n\nThis game promised the thrill of being a Jedi. Instead, it delivers tedious puzzles, annoying platforming, clueless enemies, random deaths, and pointless busywork. It is basically a bad Tomb Raider with a lightsaber, and not in a fun way.\n\nUpdate it's still terrible",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game crashes on the planet Dathomir every time at the same spot. No support response by the developer after several attempts and no refund through Steam. All community support ideas exhausted to my abilities and no one on Steam nor EA nor Respawn feels responsible to help. Nice game but shit if you cant play it nor get help to make it run. For sure not due to lack of hardware capabilities as it is not even close to exhausting any of it...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was waiting for that fight with the 2nd Sister, it was worth it. But again, this game have EA Launcher, which makes it impossible to play offline. Middle-finger to the management team",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a great game, but the EA app keeps making the game crash on linux. I can't recommend it until EA gives us other option.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is very aesthetically interesting. The story is serviceable and the environments are pretty and the platforming is okay. It has Disney-era hallmarks that harm the experience on a narrative and aesthetic level, but it doesn't feel contemptuous of the George Lucas era in the way most Disney products do, and even occasionally gives the impression that someone working on the game was, in fact, a Star Wars fan. \r\n\r\nThe main reason why I'm taking the time to leave a negative review is, largely, due to a persistent issue I've noticed in many modern games, that I severely dislike and causes constant problems to anyone who actually likes video games to be video games, as opposed to interactive movies. It's something I call \"animation-based movement\", as opposed to \"movement-based animation.\" What do I mean by that? I mean that in most games, or at least older games, the way you interacted with the world was that you would press a button to move, and that button would make your character move. This was predictable and constant; the moment you pressed, the character would begin accelerating in the direction you pressed, and the only thing that would alter your movement was any previous momentum you had, or the surface you were moving on. It was up to the animation system to try and play an animation that fit with what you were doing. Hence, movement-based animation.\r\n\r\nIn many modern, \"cinematic\", usually third person games, this is flipped on its head. Pressing the movement button does NOT make you move; instead, it plays a contextual animation, which has movement associated with it. So, say I'm playing an old platformer. My character is facing to the right, and I press \"forward\". I immediately move forward at a constant acceleration, and the character probably awkwardly flips facing and begins doing a running animation. However, in this game, my character will instead begin running right, do a shuffle to the left, hook around, and then begin moving forward. Because pressing the movement button doesn't make me move, not directly, it instead makes me play the contextual animation associated with moving forward from a right-facing position.\r\n\r\nThis makes everything feel sluggish and unresponsive, and most of all, inconsistent. This inconsistency underpins the gameplay of the entire game, and makes it unrewarding and uninteresting to try and master the platforming or combat system. Every button press has a significant delay, every combat suffers from significant action stacking, and every attempt to dodge or parry suffers from inconsistency due to the fact that the game is trying to figure out how to play its animations instead of actually following your commands.\r\n\r\nThis seems to be, to at least some degree, intended behavior. The devs appear to want you to play in a sort of detached state where you spend a good portion of time just waiting around for animations to be done, and enemies are programmed in such a way that if you have a relatively good reaction time, you will be punished, because your actions will lead to you getting stuck in animations. Instead, the intended combat is to stand in place and wait for enemies to begin doing a little dance, at which point you will slowly respond by either pressing the block button or the dodge button, which will automatically solve the problem and then you hit the attack button once, and wait around for this to repeat. Touching the movement controls is more often than not a mistake, because of action stacking and animation delays. This makes for an understandable system which one can master over time in order to achieve some sort of proficiency that will let you consistently take down enemies. It's also extremely fucking boring and unrewarding, and in the end, unimmersive.\r\n\r\nAnd it's all rather ironic, since the entire purpose of an animation-based movement system is supposed to be to cut out any animation jank and ensure the player stays immersed by making everything look choreographed. But the thing is, if I'm just looking at choreography, I'm not fucking involved in the game, now am I? It's hard to be immersed in a video game that is actively fighting me at the controls layer.\r\n\r\nCombine this with the fact that, despite using a lightsaber, enemies are basically just damage sponges you have to decapitate anywhere from 5 to 20 times in order to actually kill, and this leaves you with a profoundly unsatisfying combat system. And honestly, I can only even blame the devs halfway on this, because this has somehow become an industry standard. It's bewildering.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "beautiful environments, great animations and movement, but an absolute waste of time and a mcdonalds happy meal of a game. the marketing department did a great job, ticked all the right boxes and got a flashy star wars title worthy of selling millions while providing a soulless, shallow, boring gameplay. atrocious map design and slow, tedious back/re tracking are almost as unforgiveable as the EA app which is the cherry atop the shit cake: how does a game take literal 3 full minutes to launch?\n\nsuggested if you wish souls combat had an easy option but was terribly designed, or you always wanted to watch a 5/10 star wars movie while pressing buttons and collecting ponchos.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck EA launcher\ncrashes my pc in every single game\n\nimma pirate the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cant launch the game because of EA and their infamous impeccable top tier game launcher (sarcasm its a bane on the gaming industry) that they refuse to get rid of because of typical human stubborn delusion. people use steam because they like steam and want to use one launcher not one for ea aswell as steam. \r\n\r\ni have read hundreds of comments complaining about the EA launcher. And they refuse to remove it. All it causes is problems. Absolutely pathetic. keep failing and keep getting bad reviews EA will be a joyous occasion to see you have to sell the company to somebody who is competent.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dude this game crashes so much its insane. Rope Swing into the ice caves at zeffo... nah how about you crash everytime you land the jump 10/10 times no matter what settings you put on or suggested fixes. If i literally cant go to a part of the map a few hours into the game i can already tell what this piece of shit game is going to be like.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Huh I thought gaming studios in the 21st century would know that the keys I press while in game should be in-game, not controlling my desktop.\nIgnoring the stuttering for no reason on damn cutscenes, WASD opens stuff on my desktop without controlling the character. Everything else moves fine. I changed settings, windowed, full screen, etc. Nothing works.\nEven FromSoftware knows better and they didn't even put the correct key prompts in their tutorials.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Years later, still unable to beat the game due to crashes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Trilla Suduri Experience -- [i]for just when you think you've got a handle on the game![/i] \n\n[list]\n [*][i]\"Need a stim, BD-\"[/i] stun-locked mid animation, die.\n [*]Get blinded from a flash bang, die.\n [*]Sonic boom at point-blank range, die.\n [*]Unable to see attacks because of a poor camera angle? Die. \n [*]Seventeen move combo that ends in an unstoppable attack, die.\n [*]Throws lightsaber across the room at your skull, die.\n [*]Didn't evade from the surprise force grab + kick finisher that drains half a health bar? Die pathetically.\n[/list]\nListen to her say [i]\"Reel in agony\"[/i] 100 increasingly frustrating times while she Palpatine spin-rolls around the room? Priceless.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spoiler-Free Review\nThe game is good and enjoyable but definitely not on my top 10 list. Its main strength is exploration and combat, It is very polished in this aspect. The story is linear, but the exploration requires a lot of backtracking because most places are locked behind certain abilities. Exploration shouldn’t be a problem, but there is no fast travel system, no markings, and multilayered map that requires good sense of direction meaning if you forgot something at the furthest side of the map, you’re going to walk your way through it just to retrieve it. I guess the devs intended it that way to incentivize exploration. There is no skipping cutscenes — you’re going to watch them whether you like it or not. When you are on New Game+, not everything carries over. You keep previous cosmetics but not all abilities, which ruins the purpose of NG+, and you still can’t skip cutscenes, making the game very redundant to replay.\n\nThe game is not bad but it's much better if you get this game if the sale is above 50%",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the navigation system is so ridiculously trash, you have no idea where you are going, there is no compass to show you the direction, the hologram map given is of no use and doesn't help at all, i had to open a guide every 5 minutes just to figure out the path. Also many occasional fps stutters",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is challenging, fun and all round a good game. The major downfall is you have to have the EA Desktop App installed just to play it and because of this I can't recommend it. \n\nOh and the achievements are also bugged. I'm assuming this is because of the EA Desktop App.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is good, but PC optimization is very poor, therefore stuttering a lot, which is really annoying.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Need to install and login with EA launcher. This redundancy needs to stop",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its a big step back from what Star Wars games used to be, going back to KOTOR, KOTOR2 and even TOR with many choices and option to actualy follow the dark side, this feels very restricted, while the story is kind of nice I miss options for doing evil and even the combat that was supposed to be one of the main draws of this game is lacking for me (though it may be due to me enjoing force unleashed where the main hero was powerhouse how could at the end game fight even Vader)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "do not get this game on pc it will run like hot ass and crash every  3 seconds. i have never played a worse performing game and i played mk1 on the switch, i only hope the sequel works a little better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "When you make a PC game, make sure it is optimized to play using keyboard. This insistence for us to use controllers is annoying. We love our keyboards and mice, we want to use them.\r\nThe game, however, is most sit around and wait then jump climb and swing. Its not really for me. \r\n\r\n4.5/10.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game, I really do. It's really good and I do recommend it, but my experience with it has been less than ideal. The game is really buggy and janky. Puzzles are well designed but feel like a chore. Combat shifts from fun and engaging to unfair and frustrating. Weird dips in performance despite being able to otherwise run it well. This game is singlehandedly brought down by it's technical aspects and it saddens me to refund it, but I genuinley can't find it enjoyable with so many of these issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is pure shit. Broken mechanics, wont let you progress. Physics are equally shit with capes and chairs glitching out every other cutscene, multiple puzzels are just rage inducing. DONT BUY THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As someone without a controller to play with on the PC, this game is clunky as hell and the combat is nearly unplayable. Game seemed interesting but when you don't like the core part of gameplay, there is no point of continuing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No... Just, no. \nI think any old-school Star Wars game is much better than this.\nThe gameplay is ridiculously easy, the enemies too, but come on... It's quite awkward when you look at the stupid map and realize that the game wants you to be in a certain place, even though what the game encourages is exploration...\n\nWhen you follow the colors of the attacks to dodge, freeze, and parry, and you still get hit by the blow they throw at you. Honestly, I prefer to keep playing my old Star Wars games on original discs (and if they ask me to delete them, I'll just say, \"Screw you, EA, I paid my damn money for my physical games back in the day\"). It's stupid that a Roblox experience does a better job than a company that supposedly makes AAA games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "took open world a bit too seriously i fear. if i gotta watch a yt video so frequently am i really even playing the game?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The systems for avoiding damage don't work like in any soulslike I've ever played. I seemingly perform them correctly but still take damage, sometimes because another enemy attacks during the animation, sometimes it just doesn't feel like working. The intro is a monotonous platforming section followed by a long combat section without heals, if you die during this then you are right back where you were with it proudly declared that you are respawning. Finally you get a bossfight where my attacks did no damage and dodging didn't work, its possible that boss fight was meant to be unwinnable but even fighting calo nord in a cantina felt fairer and better balanced. Ever faced ogres in ds2 with the default dodge speed and iframes. That is what this game is like, somehow the combat feels rougher and clunkier than in games where the clunkyness is intentional.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the very first things the game tells you is to use a controller. Game won't play nice with my standard Logitech (like the X button suddenly not working, or having to unplug/replug controller in multiple times). Do a little research and see this is an issue since release and never been fixed. Fix your ****ing game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been thinking about this and it's.. difficult to say whether I recommend this game or not. Went with \"no\", because ultimately, if someone came up to me and asked if they should buy this game my answer would be no. But there's so much to love in this game. \r\nThe characters are all great, Cal is one of my favourite game protagonists to date, and just anything with the story is.,, awesome. \r\nBut the gameplay is so unfun. I actively hated the combat, and I'm a dark souls player. The fact that I could only enjoy the game after setting the difficulty to Story Mode probably means you did something wrong. Annoying enemy placement, uninteresting combat and a moveset that sadly feels very lacklust.\r\nI wish I could love this game enough to 100% it, but I just don't feel the spark.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Absolute garbage; What is not scripted is full of player limited actions. A VERY poor story with the \"red headed Step-child\" of the SW universe as the limited playable character, boring and unlikable. The best thing that can be said is that the game is short (full of unreasonable and frustrating backtracking) so the suffering will at the least be limited.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gameplays alright but just watch the threat interactive videos on this. make titanfall 3.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is amazingly BEAUTIFUL: scenes, textures, whole materials. Has lots of cool variations of combat animations. But it comes as pure adventure/interactive movie. \n\nOn the other hand gameplay is very poor and blunt. Basically you are pressing same few buttons: dodge block scan hit1 hit2. Run and jump. Run and jump backwards. Customise with no point something. Watch cinematics. And that's it. \n\nIf it had RPG elements like gear level, more on level items/interactions it would have more explicit auditory.\n\nI like stories and every other comment in here says it has cool one. But at the same time I want just to play, To be more involved and interacted with the game. \n\nMaybe its just my feeling but expected it to be better.  Especially from Star Wars.\nUsed to be a fan of SW:KOTOR and expected atleast some minimal sort of that.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[b]I was fully expecting to love it...[/b]\n\n[b]As a life-long Star Wars fan and someone who grew up playing Jedi Academy and Force Unleashed for hours on end I for some reason half expected this game to have that feel... and it doesn't[/b]. I played for 3 hours and I feel like I had only 10 minutes of proper combat in total (random critters that pop out the ground are not what I count towards proper combat, they're just purely there to be annoying), which is the most fun part of this game. [b]The visuals are stunning, audio is nice too... but it all just feels... empty? Soulless?[/b] I didn't feel much in particular during those 3 hours. It kinda says a lot that the most excitement I felt was when I realised I can customize my lightsaber and outfit, cause it reminded my of Force Unleashed.\n\nThe puzzles felt crammed in half the time, [b]the maps felt claustrophobic [/b](especially dark areas you have to light up with your lightsaber that turns off everytime you have to do a jump, leaving you in darkness, that instead of building tension just makes you wanna move on to the next area as soon as possible) [b]despite being open-world in a sense[/b] and felt like what I can only describe is 'video-gamey' if that makes sense (the constant slopes to slide down into new areas got boring and on the nose real quick), and the pacing of exploring an area just felt a bit slow. The constant parkour gets annoying quickly as well, which would maybe be less of a nuisance if the movement was quicker and more fluid, but it just feels cumbersome sometimes. Maybe this is because of it trying to be a Souls-like and I'm just not the target audience (then again, reading opinions online from those who are into Souls-like games, not all found this game particularly interesting in that regard either).\n\n[b]Having to backtrack to the ship feels insulting sometimes.[/b]\n\nThe hidden boxes to find are fun... but it's all just cosmetics, nothing else, so the mystique wears off real quick.\n\nYou walk along the level, the music gets mysterious in an empty space with some boring puzzle... and it's just you and the droid. And [b]it feels lonely. It feels lifeless.[/b] Stormtroopers are spaced out so much you immediately forget you're supposed to be on a planet crawling with the Empire and [b]you just feel uncomfortable and alone[/b], and not in a tension building way, but in a disconcerting way.\n\nThe lightsaber combat feels clunkier than it should sometimes and robs you of the satisfaction of just slicing through stuff, instead making it feel like normal melee weapon with a slightly sharper edge than usual. Oh, and [b]in the 3 hours I've played, the number of times I have been pushed off the edge of the map by a random creature sprinting into me from outside of my field of view is frankly comical[/b] (in a way that doesn't feel like a skill issue on my part, but instead unsatisfying game design).\n\n[b]I just...\nI got bored 2 hours in, forcing myself to play for that next hour in which I did f***-all except for pushing some metal balls around with wind going through holes in the wall, forcing myself to continue playing instead of testing how well ALT+F4 works in this game, only to finally reach a story point that unlocked Force Push, which I realised would come in handy for all those passageways that I had to pass up because I couldn't force push them open quite yet... and then I realised that means I would have to backtrack the whole level to explore them... and then I also got my next objective... \"return to the ship\". Double backtrack. [i]Cool.[/i] I sighed, opened the pause menu and pressed Quit to Desktop.[/b]\n\nAs a random commenter on Reddit said: \"[i]I hated that 90% of the game is whacking spiders with a glowing foam bat, and I hated spending all this time on desolate, forgettable planets.[/i]\". Sums it up perfectly.\n\nMaybe I'll give it another shot down the road, but idk. I'm just glad I got this on a dumb-cheap black friday sale and not anywhere near full price. But I'm not so glad I bought the combo with Jedi Survivor fully expecting to enjoy these games enough to finish them back-to-back, because it seems I won't be doing that. Oh well. A bit of a [b]shame, cause it's not often you get to be a Jedi on your own little adventure... but somehow that wasn't enough for me to enjoy it, when in fact it should[/b]. Strange.\nGood looking UI though, very pleasant.\n\nIf you are the type of person to just play anything Souls-like, especially wrapped in a pretty Star Wars package, this game might be up your street. If you're not, consider the possibility you might just get bored and frustrated pretty quickly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just another dumb game where they hide everything and you have to follow a walk through guide to find everything.  So half the time you are reading about what to do next and where to go.  Then while playing the game, the other half of the time you are watching scenes and they won't let you skip them.  If you are some Star Wars super fan, then you probably are happy watching them.  If not, what a bore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Heavily overrated for what it is. This is just a puzzle game with mobspam and like even harder to get into then darksouls. Would not recommend eventhough it looks pretty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got softlocked on the mission where he goes to find the crystal, when he suddenly falls under the ice, you are supposed to swim down. My ginger fucker gets trapped above the invincible wall and won't swim further. Re-installed, same outcome. Fuck you if you read this, this game is trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't play the game without signing into ea and it won't send a code to my email. nothing about the game matters if I can't play it  Instant and permanent bad review. I hate that EA got even a fraction of the $3 I paid for this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like this game more but it has a identity crisis because it can't be Dark Souls, Uncharted, and Lego Star Wars at the same time.\r\n\r\nIt nails the Star Wars vibe and a lot of the cutscenes and scripted gameplay moments are great, especially the first hour. Unfortunately, this game wants you do a bunch of dumb stuff for every bit of fun it offers, and the combat is very sloppy compared to Dark Souls, which many of it's mechanics are taken from straight from, but not polished or committed to.\r\n\r\nWhat I want to do:\r\n- Use lightsaber and the force to kill bad guys and save the day\r\n- Go on a little adventure with my red-haired guy and his robot\r\n\r\nWhat this game wants me to do:\r\n- Use force powers to push boulders around and swing on ropes\r\n- Solve lame puzzles for children\r\n- Run around generic levels with the occasional star wars asset thrown in there\r\n- Platforming and climbing (don't remember that from the movies...)\r\n- Switch between frame-based and spatial-based mechanics when fighting enemies\r\n- Fight enemies that are too easy on their own but frustrating when in a group (ranged enemies sync their attacks)\r\n- Occasionally, some fun fights where you can feel like a badass (what the whole game should be)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very laggy. Even though I was playing on medium settings with lossless scaling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The best thing about  this game is the VERY innovative, luck-based combat system. See, the developers realized that the slow, cowardly and predictable enemies in this game were still too easy to beat. At first they tried designing Cal Kestis to be a goofy klutz who constantly trips over his own feet, then they gave him bizarrely slow attacks, as if he were fighting underwater. All of this helped, but the enemies were still just pitifully easy to dispatch, so slow and clumsy that they often just threw themselves off ledges without even having to fight them. THAT'S when the ultimate innovation came. One of the developers asked \"What if we only give it the APPEARANCE of being a slow-paced Team Ninja clone with clunkier controls, but we introduce a sort-of behind the scenes dice-roll mechanic EVERY SINGLE TIME the player pushes a button? Just think, a roughly 1 in 4 chance of the character jumping, blocking and attacking with each button push. Being a powerful young apprentice fighting storm troopers is boring, but the THRILL of barely being able to use your arms and legs is what will keep our customers coming back the years, nay months, during which we will continue to pretend to offer customers support!\"\r\n\r\nAnd so it was, with this BRILLIANT innovation, that Jedi: Fallen Order became the greatest Star Wars action game of all time, solidifying EA's reputation as the greatest game developer of all time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its ok, once i realized my character had rails and no depth and my lightsaber had no customization beyond cosmetic i instantly got turned off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I interest in story more than spend time for many Jump and trying to pass a way in map. It look like I played the Mario with Nintendo Famicom",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ea launchher is garbage\n\nIf you want it - pirate it. It  ill be much bbter exerieence.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☑ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☑ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10\n\nOverall the game was just okay not really worth the price tag imo way too short and the story was kind of dumb tbh. I'm not the biggest star wars fan especially since Disney took it over feels like there was a lot of woke Hollywood sh!t",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One word: Tedious. Absolutely not worth another second of my time. I wasted my money on this one. I miss the days of demos.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game have tag \"open world\" but its not open world game, its very linear game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}