{
  "positive": [
    {
      "review": "I crashed into an island while i was vomiting from extreme drunkness, and my ship completly got broken, after that some 5 yr old came and blew me up. 10/10 recomended.",
      "voted_up": true,
      "votes_helpful": 42
    },
    {
      "review": "The original friendslop of gaming.\n\nSea of Thieves is a fantastic f̶r̶i̶e̶n̶d̶s̶l̶o̶p̶ game to play with friends and is pretty fun as well. It's an open world with many variety of adventures and possibilities you can do as well.\n\nHowever, if you want to be a masochist and want to make yourself miserable, then playing with randoms is the best option.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "Really good game, just wish that either the random skele ships cant enter outpost island zones or shoot into them, or there should be allied cannoneers at each outpost that shoots the skele ships.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Fun game to play with friends, but can get a quite \"sweaty\" and hard to play casually. They've added some cool stuff in recent updates. But why the fuck is it almost 130 fucking gigabytes?\n6/10 - buy on sale",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "If you’re feeling that pang of nostalgia “the old days with friends” this game really scratches that itch. The unplanned moments, the shared laughter when someone misreads a map, the scramble to plug holes mid-storm… these are the moments you remember, not the grind.\n\n\"10% of this game is sailing… the other 90% is screaming at skeletons.\" \n\n11/10  <3.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "[h3]Rating: 95/100[/h3]\n[h2]A Pirate Adventure I Never Expected to Love[/h2]\n\nI honestly never thought I’d enjoy Sea of Thieves this much. The visuals are absolutely stunning, and there are so many different ways to play the game.\n\nThere’s always something new to explore, whether you’re questing, PvPing, fishing, hunting for secrets, or just vibing on the ocean. I do wish they’d add a bit more quality-of-life—like better ship décor customization or easier barrel sorting—but those are tiny complaints in comparison to how much the game offers.\n\nIts replayability is insane. You can easily sink hundreds or even thousands of hours without running out of things to do. A truly amazing co-op experience.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "An utterly melancholy diversion full of scoundrells and black guards, but the pleasure and satisfaction of teaching them a lesson and dancing rigadoon steps on their quartedeck is unlike anything one can imagine.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "straight up the most beautiful game, everything just looks perfect and the sound design is crazy good, really fun to play with a group of friends, plundering ships n' all.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Le seul jeu de Pirate qui apporte un gameplay de ShipFight palpitant!\r\nJouable en Solo et jusqu'à 4 joueurs avec le choix de serveur PVE (restreint) ou en serveur PVE/PVP (full potentiel) vous pourrez y faire des world events, monter vos émissaires, vos factions, faire des fables ou des easter eggs, rencontrer des gens sympas qui intégreront votre guilde, tout comme vous rencontrerez souvent des golems sans cervelle qui tirent à vue sans comprendre xD\r\n\r\nMalheureusement, les devs sont plus préoccupés a pondre des skins dans l'emporium que de patch tous les bugs qui durent depuis des années...\r\nPour ne pas aider, le jeu est pollué par les cheaters qui soit disant se vengent que Rare ai stoppé le mode de jeux de l'arène (TDM)... Pathétique mais réel...\r\n\r\nLe jeu est as son prime et as encore tellement a donner (avec ses nouvelles saisons tous les 3-4 mois) mais il se meurt tout doucement...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☑ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☑ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☑ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☑ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very fun game, despite a few bugs, with enriching encounters, especially Soloup ;)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its little boring without your friends but this game is amazing at all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sea of Thieves: Sail to a Free Pirate Carnival, With Waves as Your Anthem\n\nIn an era flooded with open-world games, Sea of Thieves stands out as an irreplaceable multiplayer masterpiece, thanks to its unique \"pirate simulator\" identity. Rare Ltd. has polished this game for seven years, turning a vast, boundless ocean into a stage brimming with adventures and laughter—here, there are no constraints of linear storylines or mandatory KPIs, only sails, waves, and companions, allowing every player to live out an unshackled pirate dream.\n\nThe core charm of the game lies in its perfect blend of the romance and down-to-earth warmth of \"pirate life.\" You can team up with 1-3 friends, starting with a small, agile sloop and working your way up to commanding a majestic galleon. Every ship requires precise teamwork to sail: one person steers the helm to align the course, another climbs the masts to adjust the sails, someone guards the cannons against surprise attacks, and another manages supplies in the hold. Even working together to bail seawater out of the ship’s bottom is filled with immersive collaborative joy. The ocean itself is a vivid character—morning sun dyes the sea golden-red, evening glow casts sparkling ripples, sudden storms whip up towering waves that make the ship lurch dangerously, and lightning on rainy nights illuminates the outline of a mysterious island in the distance. The realistic sound of waves, the howl of sails, and the shouts of the crew blend together; closing your eyes and listening makes you feel as if you’re truly standing on the deck of a heaving pirate ship.\n\nThe freedom of exploration and adventure makes every voyage full of unexpected surprises. You can take on delivery quests from the Merchant Alliance, shuttling between islands for trade; follow clues on treasure maps to dig up long-buried chests with a shovel; or challenge the sea monster Kraken, fighting for survival amid its thrashing tentacles. The island designs are full of ingenuity: dense jungles hide abandoned pirate camps, deep caves have glowing springs flowing through them, and ancient temples are filled with traps—every landing might reveal a new secret. The game’s most touching aspect is undoubtedly \"aimless wandering\"—put aside quests, let the ship drift with the waves, land on an unnamed island, collect seashells, build sandcastles, or light a bonfire by the shore to share the \"spoils\" you’ve plundered. This slow-paced romance is why many players become obsessed with the game.\n\nMultiplayer is the soul of Sea of Thieves, as well as the source of both joy and controversy. Times spent teaming up with friends are always filled with laughter: accidentally firing a cannon and blowing a teammate into the sea, bickering while fighting over the ship’s wheel, panicking when chased by another pirate ship, and cheering wildly after successfully repelling enemies. These shared moments are the game’s most precious memories. However, the mandatory PVP mechanism once deterred many new players—just after collecting a full load of treasure chests, you might be ambushed by an experienced pirate crew, losing all the supplies you worked so hard to gather, or even encountering hostile taunters or cheaters, which seriously ruins the gaming experience. Fortunately, the developers have continued to optimize the game over time: they not only introduced a new player protection system but also plan to launch a PVE mode for players to transition smoothly, ensuring that players of all skill levels can find their own fun.\n\nSeven years of continuous updates have kept this ocean vibrant. From the original basic gameplay to later additions like the \"Pirate Legend\" career, large-scale expansions such as \"Forsaken Shores,\" and various holiday events and character customization systems, Rare Ltd. has constantly added new content, making the pirate world increasingly rich. The low-poly art style may seem simple, but it perfectly matches the relaxed tone of ocean adventures—bright, colorful visuals and cute character designs ensure that even intense sea battles never feel oppressive.\n\nSea of Thieves is never a perfect game; it has flaws like repetitive quests and somewhat thin endgame content. But the unique experience it offers is irreplaceable. It is more than just a game—it is a social stage. Here, what you gain is not just virtual treasure, but the friendship of fighting side-by-side with friends, the surprise of exploring the unknown, and the sense of freedom from breaking free of constraints. For players who love multiplayer games and yearn for a pirate’s life, this ocean is always open, waiting for you to hoist the sails and write your own pirate legend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a good game but you kind of have to play it with friends for it to be fun. This isn't a bad thing its just something to keep in mind if you buy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This might just be a game you either hate or love. I happen to fall on the side that Sea of Thieves is a great concept that gets a lot right. \nSea of Thieves isn’t for everyone. After all, neither was the life of a Pirate. But if you have the time and the heart to take it on, it can reward you not just with treasure and glory, but with memories that will stay with you, long after your Pirate Legend has faded into myth.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is SUPER good and you should buy it its so GOOD. ps you dont have to but you should",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I LOVE this game. Absolutely one of my favorite games of all time! They gave the players the freedom we craved. If you dont like PvP you can just play \"Safer Seas\" If you want all the chaos and randomness of World events and Player interactions, play \"High Seas\" \n\nThe Discord is still popping off. If your a new player there is hundreds of hours to enjoy. If you a long time player, there is still hundreds hours to enjoy. Sea of Thieves is one of the all time GOATS. I will always love this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game and it's great fun with friends, but the levels become repetitive after a while and it no longer has the same appeal as before.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game, full of story and adventure throughout the seven seas weather your looking for treasure in a puzzeling vault or hunting a skeleton king's bounty, deliving goods, fighting off against giant creatures, fishing. the games full of endless fun\n\ndeffidently give it a try if u havent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply astonishing. The feeling that you can simply destroy another person (aka Child) day just because you looted something that in the end is going to be a cosmetic stuff is amazing.\r\nDid not like the last update though, when they created a PVE server... the fun is the thrill of the chase + the risk & reward... anyways played more than 300 hrs in xbox + 100 here in Steam. The PC version is simply the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game! One of if not the best pirate games ever. definitely the best open world/exploration pirate games. I have countless hours on Sea of Thieves with more to come. The Pirates of the Caribbean content is awesome, the customizability is endless. Online pvp is challenging but can be fun. If you like pirates and/or pirate games, this is a must have and a must play. Easy top 10 of my favorite games lists.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For years, *Sea of Thieves* was more than just a game to me — it was a distant dream. I watched gameplay videos, trailers, and streamers sail the open seas, fight skeletons, and hunt for treasure, wishing I could experience it myself. I didn’t have the money to buy it back then, so all I could do was imagine what it would feel like to step onto a pirate ship and call it my own.\r\n\r\nThen one of my friends gifted it to me.\r\n\r\nThat moment meant more than just receiving a game — it was like being handed a key to a world I had been locked out of for years. Finally loading it up for the first time was honestly one of the best gaming moments I’ve ever had.\r\n\r\n**Sea of Thieves** isn’t just about pirates — it’s about freedom, adventure, chaos, teamwork, and those unexpected moments that turn into unforgettable stories. The ocean is beautiful and dangerous at the same time. One minute you’re calmly sailing under a golden sunset, and the next you’re fighting a kraken or trying to outmaneuver another crew hunting you down. No two sessions are ever the same.\r\n\r\nThe art style is unique and colorful, and the ocean physics are some of the best I’ve seen in any game. The way waves move, how storms feel real, and the sound of wooden planks creaking under a battle makes everything incredibly immersive. You don’t just *play* Sea of Thieves — you *live in it*.\r\n\r\nBut what truly makes the game special is the experience with friends (or even strangers). Whether we’re laughing while failing to park the ship properly or screaming as enemy cannons rain down on us, every moment becomes a story worth remembering. It taught me teamwork, patience, and how to stay calm in absolute chaos.\r\n\r\nNow that I can finally play it myself, I realize **Sea of Thieves was worth every second of waiting**. This isn’t just a game anymore — it’s a personal victory, a reminder that sometimes dreams do come true, even in the smallest form: a gifted copy of a pirate game.\r\n\r\nAnd honestly?\r\n\r\nIt’s one of the best gifts I’ve ever received. ⚓🏴☠️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have not played any better multiplayer pirate theme game than this. There are cons in this one too but still the best out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The people in this game will beat you down. DO NOT ATTEMPT THE HOURGLASS IF YOU ARE NEW. My first hourglass was tragedy and I couldnt even fight back. Overall pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looting and exploring with friends is really awesome. Some people on this game really need to go outside. I am one of them. Would recommend to a local pirate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got called multiple racial slurs, beaten really bad, drowned my new dog, started streaking around town, then went home and hopped on Sea of thieves, where i then cried because of how beautiful this game is, Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing, I would 100% recommend, you can play by yourself of course but the more people you play with the better. A crew of 5 is the best, especially if you're all close friends, join a discord call, or even better if you use proximity chat. It gets hectic when you cross other players, but trust when I say its fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game, fun solo and even better with a crew of guys looking to get into shenanigans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite a good Game. Despite popular sentiment solo can also be fun. \nThe most important thing is to meet other People. The Game thrives off of Interactions between players. If you still only want to play PvE you do have this option and if you want to focus only on PvP there is a option for that too.\nAlso dont mind the occasional Boat getting launched to the Moon.\n\n10/10 Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with friends and chill until you get put into a public lobby\n\nStill updated 5 years later and has some fun tales and voyages to do. Quest content does feel lackluster but actual sailing and combat makes up for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a really fun and cool game i got addicted just one thing is that a lot of the players are toxic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for a lot of seasons. Game has added lots of features in recent seasons. Sometimes you coast and make bank, other times you are engaged in PVP or skelly ship battle. Lots of events and quest types. Something for everyone and the Tall Tales are super fun as well.  10/10 reccomend!  :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is a lot to do and it is easy to dump a ton of time into this game. Best played with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sea of Thieves is a magical experience where you and your friends set out to become legendary pirates… and usually end up sinking yourselves before anyone else even shows up.\r\n\r\nThis game taught me:\r\nI can’t steer, My friends can’t read maps, and none of us should ever be trusted near gunpowder barrels.\r\n\r\nThe ocean is gorgeous—seriously, the waves look so good I’ve crashed into rocks just admiring them. Multiple times. Every session.\r\n\r\nPvP is pure chaos. One moment you’re singing shanties and raising sails, the next you’re being boarded by a sweaty 12-year-old who parkours onto your ship, steals your bananas, and sets everything on fire.\r\n\r\nThe treasure hunts? Amazing.\r\nFinding the treasure? Simple.\r\nGetting the treasure back to an outpost without Kraken attacks, mega-sharks, storms, or your own crewmate launching themselves out of a cannon “to scout ahead”? Impossible.\r\n\r\nThe perfect game for people who want to be pirates without any of the competence required to actually be pirates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sea of Thieves is a unique and high-quality game that offers a true pirate experience like no other. The game is constantly updated with new content, making the adventure even more exciting. After watching Caribbean pirate stories, you'll find yourself immersed in this world and living the pirate life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun Game overall, love the Multiplayer and you have to stay focused to not turn little mistakes into the ones you won't forget. Best to play with 2-3 Players, except you know how to act in a group of 4 without griefing eachother unintentionally",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful graphics, but if you get motion sickness beware. \nI was fine playing until I had to sail; physically got sick and threw up. \nI couldn't make it past the tutorial. \nIve seen my husband play though, and he enjoys it so I know its pretty good; but personally I cannot play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game and pvp if you can get over the learning curve. 10 outa 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game, it is fun and advenutres but it NEEDS to be played with another person",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After all this time this is still the best pirate game by far. Also it gets new content regularly so the gameplay never feels old. This is still a must buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unique theme game for sea exploration and quests. Graphics and physics are top notch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sea of Thieves is a super fun pirate adventure. It runs well on both low-end and high-end PCs, and the experience feels smooth and exciting. The world is beautiful, the teamwork is fun, and every session feels different. Great for anyone who loves exploration, battles, and unpredictable adventures on the open sea.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game very fun, but fuck the skeleton ships and fuck the player base. Other than that very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sea of Thieves is one of those rare games that feels more like an experience than a traditional title. A massive open world, beautiful visuals, and immersive sound design all work together to create the ultimate pirate adventure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played the game for over a year now and have enjoyed every minute of it. Long live the Pirate Life!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "solid coop game even in 2025.  get it bundled on sale if considering",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the game, when things are normal and within server appropriate rules. But when an aimbot exploiter appears and kills you 500 meters away with a sword or short-ranged Blunderbuss, and that bullet noclips the wall, things change. Although I've experienced this only once, it does ruin the experience. Enhance the anti-cheat or at least change it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game has great potential, But constant PVP\"makes it hard for new players to enjoy the\".content. fun with friends,stressful alone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing game for years but recently came back. If you want a fun pirate game with friends this is the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very grindy game, but none the less fun. I would greatly recommend to play it with friends.\n\nThe visuals and sound desing are truely stunning. \n\nThere are no pay to win aspects. Every shop item and every battlepass ist just for cosmetics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game creates a sense of wonder fro new players, but later on, it feels like the only fulfilling thing to do is PvP, as the content is kind of empty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's alright not the best game I've ever played. In terms of it gets boring after awhile. I mean its more fun when you start the game leading to pirate legend as well as the tall tales. Another thing it gets repeative as well too with the voyages. And don't get me started on the toxic stuff, there wasn't one time where I was offended in a good way or the other way. Other than that I still would gave sea of thieves a shot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game for going on 4 years now and it is still one of my all time favorites there's so much to do and no \"right\" way to play its literally so fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great experience for new players, the things you can do are basically endless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredibly unique multiplayer experience that does the live service thing well.\nMany players are very sweatty but losing is fun and forgiving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun pirate game, most players run from fights or grief the hell out of you, no in between.\r\n\r\nDoing world events is really fun, pvp can be fun if your not getting smoked, the art style of the game is AMAZING, prob by far my fav game in terms of looks, its so pretty and all the island are well made with all kinds of small and big things to find.\r\n\r\nTheres so many outfits and cosmetics to unlock JUST BY PLAYING, to the point it makes most games that have customization options look like a joke",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game to socialize with people! All the funny experiences with other people are a great addition to this masterpiece of a game. The voyages and adventures that take part in this game are perfect! I truly do love this game and would suggest it to other people!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played only about 22 hours of Sea of Thieves, and those hours were split into just a few sessions. Still, they were some of the best moments I’ve ever had in an online game. I played on a sloop with my friend, and I enjoyed everything: the music, the realistic waves, the fights, and the feeling of working together.\n\nYou sail across the sea, do quests, fight skeletons and even a kraken, and then try to get back to an outpost with shaking hands, hoping you won’t meet an enemy galleon on the way. The game is amazing.\n\nI recommend Sea of Thieves to everyone, but playing solo can change the experience a lot. The game feels much better with a friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just spent the better part of an hour raiding a skeletal fort and carrying the loot back to my ship solo, just for a Kraken and a skeletal ship to attack me at the same time and sink me in less than 3 minutes... 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pirates, gold and treasons, all you need for an amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man.....is a very...but VERY  good game. The waters graphics and the adrenaline.....but..... cause im scared of waters is hard to find a crew....sometimes....cause......i dont have friends that have this game. But overall is pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The devs are starting to lock in, which is what this game truly needs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play with friends on the sea and fight other people I enjoy it .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even after all these years they still keep adding new content and evolving the would. Whether you like PvP or PvE there is plent for you to get into. If you havent tried it by now I highly recomend you give it a shot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is lots of fun finding gold and goodies and blowing up ships",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be honest, this is a great game. Well rounded with lots to do.  Game play is amplified with friends or an active server",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2]⚓Summary⚓[/h2]\nSea of Thieves is a chaotic, freedom-filled pirate sandbox where every voyage becomes an unpredictable story. It thrives on cooperation, exploration and adventure quests but it isn’t always friendly to solo players or those who want structured content.\n\n[h2] Pros✅[/h2]\n🌊 Beautiful world with stunning oceans and vibrant islands.\n🏴☠️ Player-driven adventures every session feels unique.\n🤝 Great co-op experience especially with friends.\n🪙 Lots of cosmetics and progression without pay-to-win.\n🎵 Amazing soundtrack and fun pirate vibes.\n🧭 Guided quests for players.\n\n[h2] Cons❌[/h2]\n⚔️ Unpredictable PvP can ruin casual sessions.\n🚶 Solo play is tough especially against groups.\n\n[h2] Verdict [/h2]\nSea of Thieves shines when you play with a coordinated crew, turning chaos into memorable pirate stories. It’s not perfect but its charm, freedom and atmosphere make it a standout co-op adventure.\n\n[h2] Rating [/h2] 9.8 / 10\n\n[h2] Best For👥[/h2]\nPlayers who love open-world co-op adventures.\nGamers who enjoy sandbox games and creating their own fun.\nPeople who like PvP-optional exploration with friends.\nAnyone who wants to role-play as a pirate and cause trouble.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game - bought years ago but never really played it until I saw it on Youtube. Brilliant!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, the game is very fun and engaging, buttt..... after a while it gets kinda repetitive, the game needs more purpose, idk how the developers can make that but for me is too much the hustle to get back to square one after playing the other day 3-4 hours. Like you should have some sort of progress that remains saved, other than skins or boat cosmetics ofc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i highly recommend this game because it is really fun to go around doing sea forts and world event and battle players whats even funner is manipulating player into an alliance and then making them do all the work and steal it all for yourself at the end i highly recommend this game i have also been playing since 2021 but not on pc on xbox and both are great also hte cross platform is amazing as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun, with no two sessions being same. However there are a few things that you should know.\n1. You have to be ok with sinking. I know it sucks, but it will happen. At the end of day it is just virtual coin\n2. Dont set out with a plan in mind. Just set sail and see where the voyage takes you. odds are you will have more fun and get more gold\n3. some ppl will be toxic. Ignore them.\n4. playing with others is always more fun. If you have no one to play with join a Sea Thieves discord or another social platform. They have entire area dedicated to those looking for a crew. avoid open crew\n5. Do not fear pvp. Sometimes you should go into fights just for the practice. You wont get good if you dont try to\n6. play for fun, not to get gold\n7. when parking you want your sails and anchor up. this way if a crew pulls up you can quick drop sails and get moving\n8. people can and will betray alliances. you can still make them and have fun together, but keep and eye out\n9. not all pistol skins are accurate, you can go on yt to see which ones are, or use a crosshair overly app\n10.(optional) record your gameplay because random stuff happens a bunch and it is usaully funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "water look, and mechanics are amazing. I catch myself getting lost in the waves at times.\ncan be a chill game, or have you on edge all night depending on the servers you're in.\nno quest easy passes. you figure it out the hard way. \n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its just fun\r\nthe side stories are great along with the chaos of just roaming around",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game i have been playing it for forever and i cant wait for whats in store for this game next i love this game keep up the good work guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its still the best pirate game out there.Can be challenging and fun at the same times, Good luck and Fair seas",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is fun but they shoud add more stable survers towards india",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun,Really annoying and takes a lot of time, but its really fun even after losing 5 hours of progress",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Believe it or not, constantly updating your game is a net positive for your community.\nSinking 1000+ hours into that game is just a result of FOMO.\n\nAlso, 20 dollars for pay to win sound quality? What are you doing, Rare?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun experiencing being a pirate. Very fun with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sea of Thieves becomes a lot more fun because of the unexpected events that keep the game interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with amazing graphics. Devs continue to update the game to add new content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, but so many cheaters in Hourglass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun if you have a crew to play with. Or you can solo totally depends on you. I love just fishing around playing sea shanties drinking grog.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is full of cheaters and bugs \nbut at least you can get drunk.\n10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always something to do. Always open to teach you something interesting.\nAlways getting hunted by some random sweatlords. But still, a good game. Even with it's microtransactions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game regardless of whether you're playing solo or with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Join game during Gold And Glory, Sloop, just wanna grind money for pirate lord\nDo a long loot run over the top of the map getting around 400,000k\nGet greed cuz a red skelly fort spawns close to me, \nSpeedrun skelly Fort as fast as humanly possible and finish it getting chest of legend and athena\nLook upon the horizon to see a galleon is going at full speed with wind\nlook only the important stuff an skeddadle as fast as possible to my ship and use spare horn of winds to start up the boat\nRun\nSell athena and legend from a driveby at top left port\nsail across the map in a clockwise way all while backboarding the whole time.\nmanage to keg the galleon, giving me enough time to sell around 100,000k worth of stuff\nThe captained burning blade comes to my rescue after i run the bottom of the map sinking the galleon,\ni sell all my stuff and get hunted down by the galleon\nthey called me a runner\nim ~500,000k richer and they wasted 1 hour chasing me for nothing\nmy heartrate spiked to 200 i will never top that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like pirate game, very cool, but community toxic sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game can be great for situations where you want to play a new game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Listen I haven't played this game in a year or so but i have put over 2000 hours on this over pc and xbox, My review for this is its a very fun game and pretty easy to learn with all the new stuff they added. The pvp is fun with rewards to be earned and quest to be played so yes I recommend this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVER, I LOVE IT SO MUCH, it does get boring with no friends, and you don't do open crew",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good in atmosphere with a gorgeous and lively world but combat isnt great and game gets repetitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game to play with your homies and explore the sea of pirates! (a little bit of rage baiting in pvp, but still fun :))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i enjoyed this game a lot with my friends but the xbox account is a little trouble for us to login. full of story and adventures to play with friends and have fun. \nRECOMMENDED",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had it on PS5 and now again on PC. Graphically always looked good and smooth. Is fun on single but is such a laugh on MP its a real time killer game. On going support from the devs who obviously love their children. Grab in and enjoy 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first I thought a pirate game wasn't for me, but when I played this game that tought changed immediatly. I bought it at the same time as my friend, so we went trough al the stuff together. The tales are fun to play and its a nice openworld game to play.\nGraphically, Sea of Thieves is stunning. the fluid animations, and dynamic weather make the world feel alive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plz nominate it for Labour of Love; it's the spitting DEFINITION of steam's description: \n\n*\"This game has been out for a while. The team is well past the debut of their creative baby, but being the good parents they are, these devs continue to nurture and support their creation. This game, to this day, is still getting new content after all these years.\"*\n\nThere are very few games left that fits this category so perfectly. So please, follow Rare Ltd's lead and show some love to the best pirate game, OAT.  They deserve it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interactive, and open sea to explore and do anything, you can raid islands, attack others, get treasure. There are many ways to have fun in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chase after a boat for 1 hour straight in a game where ships are meant to fight and not run away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "~ DIFFICULTY ~\r\n🔲 My 90 year old grandma could play it\r\n🔲 Easy\r\n🔲 Normal\r\n✅ Hard\r\n🔲 Dark Souls\r\n\r\n~ GRAPHICS ~\r\n🔲 MS Paint\r\n🔲 Bad\r\n🔲 Meh\r\n🔲 Graphics dont matter in this game\r\n🔲 Good\r\n✅ Beautiful\r\n\r\n~ MUSIC ~\r\n🔲 Bad\r\n🔲 Not special\r\n🔲 Good\r\n✅ Eargasm\r\n\r\n~ STORY ~\r\n🔲 This game has no story\r\n🔲 Like playing Temple Runners for the story\r\n🔲 It's there for the people who want it\r\n🔲 Well written\r\n✅ Epic story\r\n\r\n~ PRICE ~\r\n🔲 Free\r\n🔲 Underpriced\r\n✅ Perfect Price\r\n🔲 Could be cheaper\r\n🔲 Overpriced\r\n🔲 Complete waste of money\r\n\r\n~ REQUIREMENTS ~\r\n🔲 You can run it on a microwave\r\n✅ Average\r\n🔲 High end\r\n🔲 NASA computer\r\n\r\n~ LENGTH ~\r\n🔲 Very Short (0 - 3 hours)\r\n🔲 Short (3 - 15 hours)\r\n🔲 Average (15-50 hours)\r\n🔲 Long (50-90 hours)\r\n🔲 Extremely long (90-110 hours)\r\n✅ No ending\r\n\r\n~ FUN ~\r\n🔲 I'd rather watch paint dry\r\n🔲 Hard to enjoy\r\n🔲 Repetitive\r\n✅ Actually pretty amusing\r\n🔲 Ride of your life\r\n\r\n~ REPLAYABILITY~\r\n🔲 It's a one-time experience\r\n🔲 Only for achievements\r\n🔲 If you wait a few months/years\r\n✅ Definitely\r\n🔲 Infinitely replayable\r\n\r\n~ WORTH BUYING ~\r\n🔲 No\r\n🔲 Wait for sale\r\n✅ Yes\r\n\r\n----------------\r\n\r\nSea of Thieves delivers a lively and adventurous voyage across a vibrant open ocean, offering an experience shaped by exploration and unpredictable encounters. The game immediately establishes a sense of freedom, inviting players to sail in any direction and discover hidden treasures or sudden dangers. Its world feels alive, with dynamic weather and emergent events ensuring no two sessions unfold the same. The overall tone celebrates shared adventure and spontaneous storytelling.\r\nThe narrative structure in Sea of Thieves remains intentionally loose, encouraging players to craft their own stories through the quests and world events encountered along the way. Tall Tales offer more directed, lore driven experiences, weaving charming pirate fantasy with light mystery and puzzle solving. Across these journeys, the sense of being part of a grand maritime legend never fades. This flexible approach to storytelling supports both casual exploration and deeper engagement.\r\nGameplay focuses heavily on co operation, rewarding crews that communicate and coordinate effectively. Sailing feels tactile and responsive, with every task from raising the anchor to trimming the sails demanding attention. Combat, whether against skeleton hordes or rival crews, brings exhilarating tension enhanced by the constant threat of losing hard earned loot. The blend of naval manoeuvring, exploration, and combat keeps the experience varied and engaging.\r\nVisually, Sea of Thieves impresses with its striking water simulation and expressive, colourful art style. The ocean serves as the star, capturing storms, sunsets, and reflections with remarkable beauty. Character and creature designs embrace a whimsical, cartoon inspired aesthetic that complements the adventurous tone. The world’s vibrant presentation enhances the sense of escapism and discovery.\r\nOverall, Sea of Thieves stands as an engaging and visually captivating pirate adventure that thrives on shared experiences and emergent storytelling. Its flexible narrative structure, polished sailing mechanics, and vibrant presentation create a compelling world to explore. While its open ended design may rely heavily on player driven moments, it consistently rewards curiosity and teamwork. The result is a memorable seafaring experience filled with charm and excitement.\r\nSea of Thieves gets a 7/10.\r\n\r\nFor more reviews check my Steam profile\r\nHope you enjoyed my review, god bless you",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "A phenomenal concept, executed almost right. If you seek exploration and adventure you've come to the right place. However, the game suffers from a glaring flaw: Trolling. \nRare is deadset on making sure all the content rewards PVP and discourages adventure.  Each update they push seems to ensure that try-hard players get rewarded and casual players get punished.\n\nPros:\nAdventure\nLoot\nBeautiful graphics\nAchievements for completionists\nMany locations to explore\nGreat with friends\nUpdates add new exciting content\n\nCons:\nRare is more concerned with retaining the more toxic playerbase demographic than it is with the more casual players.\nDiscouraged from playing the safer seas mode. \nUpdates hinder new/casual players and reward those who discourage others from playing at all.\n\nMost of these issues could be solved if Rare would;\n>Allow emissary in safer seas. Gold is for cosmetics, you dont need to discourage players from a mode they enjoy more.\n>Undo the recent weapon swap speed update, this was an abysmally bad idea.\n>Allow in-game reporting that auto-submits the previous 5-10 minutes of footage. Forcing players to screen record and go through your website makes it difficult to prove abuse, when it is not communicated to them how to report beforehand. (This one is GLARINGLY important.)",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Having to sign into a Microsoft account to play the game is upsetting enough. It then breaking and requiring some troubleshooting is worthy of a negative review in my opinion.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Charging 26 aud for a audio upgrade & a single coconut Headset cosmetic.. nothing like corporate greedy.\n\nEdit; just found out if wanna use the upgrade audio you MUST complete a FACIAL scan of your face & ear's in order to utilise.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The players make the difference. I've tried playing on Open Seas and have consistently ran into nothing but people who'll jump at the chance to ruin your day and take your loot. I'm sure the community was fun and welcoming at some point, but hearing a child yell slurs at you with a megaphone is not my idea of a fun game. Rare doesn't seem to care to do anything about it, because this is still a cash cow for Xbox, the publisher.\n\nPlaying on closed seas, even with a full crew feels....empty and lonely? I don't know, I see plenty on content creators showing off fantastic teamwork and wholesome player interactions. For me, in the 120 hours on Game Pass and 15 hours on Steam, I've had one awesome Portuguese crew that helped us hunt Megs and dozens of parasites who'd rather ruin your run then put in the work themselves.\n\nI wish I could leave a neutral review, but Steam demands a Yes or No.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "chargin 20 bucks for self-proclaimed improved audio is nasty\nedit: upon trying the free trial, it seems everything sounds muffled and i cant actually tell if any aspect of the sound is better. i believe we should blunderbomb someone",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the PvP sucks ass and isnt for new and returning players and it ruins the fun",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game play loop on this game is addictive but it has one of the most toxic communities out there. It's not even a gatekeeping thing or a proof of skill, they will hunt you down with the express purpose of ruining your time. I was playing solo and got jumped by a crew of 4 that spent 10 minutes killing me as I spawned. Not so they could do some PvP (which I hate anyway) or to steal my stuff. It was just to make me mad cause they were calling me slurs and spamming emotes at the same time. This is the best game you should never play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A genuine piece of shit. People can shoot me when they are reloading and seem to kill me if they double gun but when i do it, I'm fuck out of luck. Fucking french servers fuck me over and lag me off my ship",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is not bad just the people are, every ship wants to sink you no matter what and 90% of my teamates lack braincells. For 40 dollars its just not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They are ruining the game, First they remove Arena a pvp game mode with no issues and replace it with a worse and hell inducing game mode called Hour glass. Next is all the dam bugs in the game, There are bugs that have been in this game for years and Rare have not bothered to fix it, next is all the cheaters in the game and this \"anti cheat\" dosent do anything nor do the devs do anything to ban them.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "FIX YOUR SERVERS!!! how many times do i got to sign in just to play and exit and come back in. is their a refund if it's unplayable wtf?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not enough content to keep you occupied unless you like getting chased around for 2 hours by a ship of 6 people trying to take your level 3 Merchant flag.  If they released a pve option to play that doesn't stop your xp gains, this could be fun to play for casuals.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is fun but the community is filled to the brim with racism and homophobia and any interaction with the community just drains any form of fun you'll get from it",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Developers are hell bent on catering to a audience no one else wants to play with. Any type of push for a full PvE option is an insult to this \"community\" because they do not want PvP they want to harass people trying to have fun. Finally, when they seem to change course releasing a PvE mode, they spit in the face of everyone wanting it by releasing a crippled version for no reason other then to feed into another game mode those seeking PvE do not even want. Rather then printing money from a cosmetic shop backed by strong content like Grinding Gear Games, or a plethora of other competent companies they would rather die on their hill. Good news is, with the current consistent loss of players, next year they will have a PvE mode, because it will be a single player game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have well over 1500 hours on this game. I love the game its self but the toxic people that spawn camp constantly and yell constant slurs just ruin any fun you might have. The general over all toxic player base is why cannot recommend this game. I have met some awesome people but a good 90% of players i come across are just bad people. I even grew up in cod lobbies. its not just yelling to yell its its just bad people.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "In all honesty I love this game, I started playing this back in season 4. However, this game has been recently plagued by some pretty annoying issues. I was never one for pvp, anytime the devs try to make serious changes to pvp the loud minority of player wine until the meta is reestablished. The current issue with pvp in sea of thieves is not that it is hard but that it is boring, the tactics are flushed out and all battle basically devolve into get on their ship and drop the anchor. The second big issue is the player base in general, every time I play the game i either am fighting someone screaming racial slurs, a literal child, or someone with the pvp skins who have clearly played more hours then me. Now I know what your thinking just get gud, play more hours and pvp, well here's the thing I don't want to and apparently considering the dwindling player count no one else does either. Even if I did I pretty much run into cheaters every time I play. Alternatively rare has included a team sever mode, which is great but due to the how much your loot drops are nerfed combined with no multipliers that mode isn't very fulfiling. This caused the player spike when the mode was released to be very short lived. Not to mention the most recent tall tales sucked. \n\nTo summarize:\nCheaters, sweats, and murder hobos ruined pvp\nhour glass is full of cheaters\nPVP is to linear and always plays the same\nA team server that is less restrictive would actually sustain the player spike\nPVP players will argue that the game got worse when the solo mode was added, they are lying it is a disingenuous argument that suits their desire to fight someone who doesn't want to. There were large player spikes when the mode was added and the main complaint was it was to restrictive, the less restrictive form nerfed loot drops and did not allow for meaningful progression. \nWould I recommend this game, nope, games player count is on the decline and unlike in season 4 solo slooping no longer feels doable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could only play for about an hour. Due to it being first person view, and the nature of the game, made me extremely motion sick.\n\nReally there needs to be a neutral review option, I wouldn't recommend or not recommend this game. Just be ware that if you get motion sick, this game may not be for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the game but i cant really like it if i cant fucking play it\r\n\r\nplayed it for a good while, had a fun time, uninstalled for more storage space\r\ndecided to reinstall, (on a new pc) got stuck on the XBOX sign in menu, tried to ask for help, couldnt get any, tried to find a video on youtube to maybe help me fix it, couldnt find shit\r\n\r\nso im stuck with a game that eats up all my space, that i cant play because when it asks me to sign in i literally cant because of a stupid menu that says \"Lets get you signed in\" that wont change no matter what the fuck i do! I cannot resize the menu, i cannot interact with it, and if i close it i just get the Ashbeard error.\r\n\r\nif the game worked, i would be reccomending it, but the fact i need to sit and wait 3-4 hours for it to install and jump several hoops only for it to not work isnt very fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game has great potential, and yet fail to use it. obviously the dev have no idea about how to make and interesting gameplay loop, further more theire loop are frustrating and for the most part just waiting. \nAnd ffs, adding new game idea wont fix the bug in this game, in fact it will only add them up.\ni look forward to playing this game when the dev team will actualy do something.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Couldn't get past the main menu despite being able to link and sign in to my MS account just fine. Wasted too much of my time looking at \"lavenderbeard\" and I have had enough. I should have known better than to blindly purchase this not realizing that it's online only and that I won't even be able to access the content I paid for if the slightest thing goes wrong with any of the services that the game uses, especially MS's own \"service\" which has been terrible since 2013. Then I find out that MS is deciding to charge 25 dollars for spacial audio \"DLC\" which should just be a feature of the game. \n\nGetting a refund and spending it on indie games without BS drm instead. Shame on you Microsoft for not only this experience and all my other recent BS MS experiences, but also for what you did to Rareware. Shame on you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think this is one of my favorite games, but it lacks a lot of things and everything is done for donations and skins, and the content is less and less, as are the cheaters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is really really fun with friends. The games offer many things from PVP to grinding in many ways. But sometime the game just ignores you like gets you stuck in loading screen forever. In middle of an PvP it might be the thing that gets you sunk and lose. That thing disgusts me anytime it happens and reminds me Sea of Thieves has many bugs that make your life either harder or literally go f your self. If you ignore these flaws its fun. And if you have friends that are willing to suffer with you. Dont hesitate. Game offers many fun moments, and its perfect for 2 or more players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "see i enjoyed this game for a long time. hopping on to a silly pirate game with your friends. However after updates i have enjoyed this game less and less... playing online feels dead. offline is punishing and just not worth it. Its sad unloving something and that happend to me with this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "X box game Studios Ruined another Great game.\nSIghn in is trash. \nGame lags with many connection issues. \nRandomly gives my pc lags. Servers suck\nMIcrosoft deserves To go under",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A great game but its basically turned into a scam fest. All the items in the shop are insanely overpriced (i saw a bundle costing over 100 aus dollars for basically 2 weapons, a ship set and 3 outfits) and now they added an audio dlc, you did not misread that, they are selling a dlc for better audio at 20 aus dollars, oh and don't forget the coconut earphones, they are so worth the money. \nIf you haven't gotten this game yet, don't. Get it when rare gets their act together and stops overpricing everything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cheaters, they seem to get more support from Rare then the Average player. It's bad enough they ignore what is stated as their beliefs about pirate engagement. There is no incentive to not be totally engaged in griefing (cheating helps carry that out). Docked ships away from their ship seems to be the main aim of a ship battle. Playing with randoms and they bring the same toxic behaviour firendly killing on sight. What could be a really grand pirate game, is just a cheat machine full of griefers and Rare love it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "buggy game with mid pvp and people who take it too seriously\n#addgoodcosmetics #fixpvp #banretards #fixbugs\ngood naval combat tho",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT BUY IF YOU'RE IN INDONESIA!\nAlways get connection issue (Allmondbeard) even other games are fine\nSupport are not helpful, kept on saying the issue is on our side when we can play any game just fine.\nOut of 7 friends who played this only 1 weren't randomly disonnected",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Super glitchy, trying to play tutorial level and my character is constantly being teleported 15 ft away from where I was last standing, super disappointed as this game seemed fun but I can't even learn to play without it glitching out on me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Save your money. This game will nonstop spam you with asshole players constantly attacking you when they know for a fact that you are a new player since you start with a shit ship and wearing shit rags. This game will also nonstop spam you with a nonstop mob spawning that will not allow you turn in even your first ever fucking quest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Before you buy :)\n\nCan I play this while having a job\n\nYes. The game does not really keep long term progression. When you log out the only things that stay are your gold and the ship you purchased. All loot like cannonballs and food disappears. Good for players who cannot commit every day.\n\nAre you a PVP player\n\nIf you enjoy PVP this game is very fun. Everyone has the same gear so skill is what matters. No pay to win and no advantage for older players. Just get good.\n\nCan I play this every day\n\nYou can but expect the game to feel repetitive.\nAfter reaching Pirate Legend you have basically completed the main goal. Everything after that is for cosmetics titles and achievements. These do not help in combat. Flexing on hoes is what matter at this point.\n\nPVP Experience\n\nOutside Hourglass fights a normal ship battle can last 30 minutes to 1 hour depending on the players and the ship sizes. Sometimes you will fight two players or even four players while you are alone or with one friend. This can be exciting or frustrating. Just get good.\n\nPVE Experience\n\nMegalodon is scary the first time but after a few encounters it becomes simple. Just sail to the nearest island and it will disappear. Kraken is not really threatening. The water becomes dark you cant sail just fight not really hard. Skeleton ships and storms annoying you can sail around the storm just annoying since you delaying going to your destination for skeleton ship the loot is okay but not amazing. World events are a mix of PVP and PVE but nothing too special after a while.\n\nMy Thoughts\n\nSea of Thieves is very fun with friends but boring alone unless you want cosmetics or achievements.\n\nTraveling takes most of the play time. You will sail for around five minutes or more for every island. A single quest can take two to three hours and more than 60% of that is just sailing with nothing happening.\n\nCrew limit is four players. You can form alliances to make groups. I myself played with 8 people you can do this by sever hopping and spawning with a galleon until at least 2 play from your team find a match on the same server. This is fun when you are part of it but not fun for everyone else.\n\nPets\n\nPets look nice but they do nothing helpful.\nIt would be better if monkeys fed you or if dogs helped you find treasure faster. Right now pets are only for looks and nothing else.\n\nBattle Pass\n\nYou can earn Ancient Coins without buying the pass but it is very rare.\n\nFinal Verdict\n\nSea of Thieves is amazing with friends but becomes repetitive fast.\nGreat for players who enjoy PVP and want a relaxed sailing adventure.\nNot great for players who want strong progression or deep PVE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The requirement to have a microsoft account makes it unplayable to me.\n*Every time I make an account just for this game, I get banned after a while.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a good game in general, but the bugs rn are out of hand, the anticheat is not good and the skill based matchmaking doesn't exist",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly any game that has to have its files verified and the game basically redownloaded due to their anti-cheat engine breaking isnt worth much as far as playing. At least half my playtime is running the game for it to crash, not sign me in at all, or sitting in the menu trying to get the games audio to even come close to working. Beautiful game on the eyes and whatever optimization they did recently is great for the framerate and overall smoothness of the game itself, but between the horrid player base (weve all been chased down for a few cannonballs and bananas, havent we?) and the game itself not really working half the time, its not worth the price tag it comes with and its most certainly not worth the price tag of the trinkets and knicknacks and season passes. If you can get this game for 5 bucks thats great, but youll be pretty pissed once you keep having to take the time to verify, download, and install its game data 3 hours a month as well. Id say \"have fun\" but before the toxic player base makes you bitter the crashes will piss you off first.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "try to play and its always lavenderbeard error which is a xbox login error. you can delete your login stuff and it sometimes works after hours of messing with it....not worth honestly. DO NOT BUY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to be good. Not anymore. Full of FOMO events and meaningless, recycled content. They only add cosmetics to the paid Emporium these days.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could not get the game to respect my settings and not use hands free calling for my wireless Headset. \nFor those who don't know this results in horrible Audio quality since Bluethooth is not capable of handling high quality In and output at the same time. Just imaginge putting your phone in a tin can and put the volume to max. Then you know how this sounds. This is not an issue in any other game I own. Every game respects not using the Headset mic how its set up in windows.\n\nDeactivation all other devices besides my USB mic and Headphones did not work. \nChanging gamebar and xbox settings to use the Headphones for just output and the usb mic for input did not work. \nDeactiviating Hands Free mode via windows resulted in no audio at all. \n\nThe game always forced the hdeadphones to be used in hands free mode resulting in horrible audio quality for the whole system. \n\nAfter trying everything i could find online about fixing it and nothing working i just gave up and refunded without playing a single second.  I wasted over an hour researching and messing with settings without success. \n\nSad that a mircrosoft related company can not get their product to work properly with their own operating system.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The overall game is ok - Though I put a NO for not recommended due to, theres no way to know what you are doing or where you are going .\r\nThe tutorial is very basic.\r\nGame play is fine, though again, no way to know what you are generally doing if you are by yourself.\r\nSurely we arent expected to google every single thing we do or want to do, how boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you're looking for a game that plays like rust and want to be jumped everytime you do anything meaningful this is the game, max level sweats following you just outside of your render distance and then as soon as you pull into an outpost they jump you and take hours of grinding from you at the last second possible. 0 stars this game is awful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dying, devs focusing on mtx instead of the game. PVE suffers because of stubborn devs/feral players because PVP has already been fully figured out (including glitches and cheating) and Safer Seas, which would be a draw to many, is restricted to \"encourage\" players into high seas with players that will hunt on sight.\n\nI haven't ever seen a single real piratey action happen and I used to play before it was added to steam. It's Sea of Murder, because nobody ever actually steals or extorts anything. They just want to kill others, usually weaker players. If they actually wanted fair fights arena wouldn't have died.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Rare released a PAID DLC for better sound. Just greed nothing else",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "7 years later and you still can't hide/favorite weapons you own, should be a bare minimum feature.\nThe game is great otherwise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is diarrhoea dookie in just about every way\n\"It is only fun with friends\" is a great way of saying it sucks\nE v e r y  g a m e is fun with friends\nBut this is one that has nothing to do and the nothing you can do, does nothing anyway\n\nYarr be warned, there is no fun to be had here",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is only fun if you and your friends want to get drunk a play a pirate game other than that i don't recommend its only cosmetics",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The moment they remove the limits set on \"Safer Seas\" and allow the same experience as on \"HIgh Seas\" is the moment I'll switch this to a positive review. Until then 🖕.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "They just made a DLC to enhance audio. They are monetizing audio. Check it out and see for yourself, google \"Sea of Thieves' new Embody Audio Enhanced Headphone Mode\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "10min stuck in black screen in mid of a battle, 5 years with this issue, stop making small haha updates and fix what u already have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Langeweile das Spiel. Oder \"Verschwendetes Potenzial\" das Game. Ja, Piraten sein ist cool und es gibt kaum ein Spiel wo man das machen kann. und von denen noch weniger, die gut sind.  das problem ist, da rare und xbox hier stark auf kiddies als zielgruppe abgezielt haben ist das game fast ausschließlich kosmetisch.  Schiff kann man 2x (?) upgraden bzw ein größeres bekommen aber das wars dann auch.\nwillst du ne andere waffe? willst du deine waffe upgraden? irgendwas finden was nicht nur gold oder kosmetik ist, vllt eine coole waffe die selten ist und nur +1 damage mehr macht als die anderen waffen? nein. den spaß wird einem ncht gegönnt. nichtmal n eimer mit dem man schneller wasser scheppen kann.\nist extrem enttäuschend und wäre was das game von extrem langweilig, weil alles dasselbe ist, zu genial gebracht hätte. pve ist nämlich so scheiße, eintönig und wirklich nicht spannend so dass man sich auf pvp freut. aber da alle waffen gleich sind und selbst schiffkämpfe immer dasselbe sind da es keine varianz gibt, wird auch pvp schnell langweilig.\nim prinzip hat rare hier ein extraction game erschaffen, denn wenn das boot sink verlierst du dein ganzes loot aber das loot was du bekommst, ist sowieso egal, daher ist es so egal ob man stirbt oder nicht.\nund als pve game wäre es cool wenn es , progression geben würde, und ich rede wieder über waffen, rüstungen, MEHR schiffe ,kanonen, etc. die map ist so groß, und das spiel 150gb, aber zu unfähig progressions systeme einzubauen die das spiel DEUTLICH besser machen würden. pve und pvp design und generelles game design stehen sich hier im weg. definitiv eher für leute die mit gameplaytiefe einer pfütze zu frieden sind. wenn man sagt ja aber es geht um skill nicht um gear dann ist das eine extrem dumme meinung. beides kann zusammen funktionieren. man muss keine op waffen einbauen.  da geh ich lieber roblox spielen. 5/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Typical M$ shit as always. Lost 3 hours and the money I purchased this shit for. Played 3 hours, looted a lot of crap, went into some shitass sea treasure garbage puzzle, found 20 treasures, talked to the bitch statue, [E] Return to ship -> We and the ship spawn at the port/hub, all are shit is gone.\n\nAs fucking always, M$ trash does not work, never does, no exceptions, Fuck you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This studio had to ROLL BACK THE BANS on people in their game. You know a game is bad when you give BANNED PLAYERS a chance to play again. LMFAO",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuckheads are honestly selling an enhanced headphone mode FOR 20 US BUCKS HOLY HELL. What the actual fuck guys?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "complete a time wasting event\r\nharpoon treasure on board for 15 minutes\r\nboat despawns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got falesly kicked by anti cheat for no reason even tho I don't have any and I can't log back in",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Took longer to sign in and get past an error code than to hit pirate legend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game will no longer connect to my Xbox account through steam. DO NOT BUY THIS GAME.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Go to the Discussions and search for \"21 year old man sexually harass a 15 year old boy\".\r\n\r\nIf you are not a streamer the devs do not give a fuck about you or your kids.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constant greefing , can't even make it off the starting docks",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I liked the idea of exploring the seas cooperating as a crew. I imagined to find fellow buccaneers to show me the basics. \nThere is no communication to be expected from other players and all I found was teammembers shooting each other to gain some attention before they left the party. There is absolutely no sane crew to hope for unless you team up with your own friends. After 8 hours annoyed by some minors, I didn't manage to experience what I hoped for - and by then my chance for a refund was blown. Uninstalled.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dumb aahh game, I would rather play hand simulator,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cooked game, but fov update good",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Arena was prime SoT. Playing for points and boarding non-stop, making a sick chest steal play on middle map outpost, all-chatting some slurs and ragdolling some 8 y.o trash talker. playing with randoms and fooling around. 5 gally on 4 tile map in 2-5 minutes. Getting spawn camped. Spawn camping. IT WAS PEAK. RIP arena, you will remain in my memory, never forget.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i was trying to start this game for a week watched like 10 totorials but nothing worked i give up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck shit game always giving me fucking strawberry beard error",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Playing in closed lobbies is worthless, the connection is consistently abysmal. Not only that they don't let you get reputation with factions or even be emisarries. I used to love this game and I thought when they added private lobbies things would get better, they didn't they got worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unless you wanna waste 40 FUCKING DOLLARS dont buy this game,,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this piece of shit game might have had the fucking chance to be mid if the quests werent absolutely FUCKED. I have genuinely NEVER IN MY FUCKING LIFE seen a worse quest system than this shit. I DUG UP AN ENTIRE FUCKING ISLAND DYING MULTIPLE TIMES IN THE PROCESS DUE TO THE GAME SPAMMING EVERY FUCKINGE NEMY IN THE AGME AT YOU AND TEH TREASURE MARKED ON THE BUGGED OUT FUCKING MAP WASNT THERE! WHAT TEH FUCK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unless you have multiple people to play with, you should pass on this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I BOUGHT A CANNON AND IT TOOK MY GOLD AND I NEVER GOT THE SKIN! \n\nTHIS GAME SUCKS!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrid game corrupt company",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloody useless navigation.  Check the map and mark a island  to sea too and now when you are sailing you got no idea where you, the compress just tells what position you are, north or north east, are cause the map is down in the cabin. So you have to stop sailing and go down to the cabin. SO by the time you done that you can end up miles from the island.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "community on the same level as Overwatch",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "weapon swapping is killing all the fun in the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game has really gone downhill. its really a shame.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "yarr harr fiddle de dee, being a pirate is not really for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fortnite but for pirates.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes everywhere. Never got to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game does not work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game just not worth 40 euro",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i really like this game but i also hate it so much",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0/10 on the dopamine scale",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "support wont fix my issue",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kötü oyun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "never play open crew",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "stuiped game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tgis game stinks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cent get in the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เกมหมาๆเล่นไม่เห็นสนุกเลยบัคเยอะเจอเเต่ไอ่Panacotta1910ท้อคซิกมากครับ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got motion sick",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i think every single person at rare should cease to exist",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "ste kokoti neviete spravit tu hrzu",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "plauki ir kuva iskrenti is laivo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't play if you get motion sick easliy :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck you scammed me -20$",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not enough pvp",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate reapers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sea Of Cheats",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "abysmal dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}