{
  "positive": [
    {
      "review": "I've been playing casually, for fun, barely any competitive. - On and off since launch!\nTo me, Apex is still amazing, love the movement and game style. It's a free game and we get a lot for it honestly.\n\nBut I really cared for the lore and good cinematic trailers, which I want back!",
      "voted_up": true,
      "votes_helpful": 55
    },
    {
      "review": "Sigh. What to say about this game. I've been playing this game since season 4 and I used to be obsessed with it. and I mean that literally, I lived, breathed and slept Apex. I would play it for 8-9 hours every single day for multiple seasons because I was so obsessed with it. There is no other game you'll find that has the type of gameplay that apex does and that's what makes it so addicting despite it's plentiful issues, especially lately. Which brings me to it's issues. Once covid hit, EA decided to take the reins of apex more than it ever had before and they laid off a lot of the devs that actually put their heart into the game. Now the game is one massive cash grab. It's so obvious to anyone that's played this game for a long time that the game has lost its whimsy and is only here to garner as much money from people as possible. Regardless, I still love the game more than anything and I'll, unfortunately, always come back.",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "Good game, the one thing that i do not like is that the skill level difference is insane it might just be me but it feels like i'm getting destroyed every game and not having a chance, i would recommend this game but if its your first time playing an fps or your just bad in general you probably will not have fun.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "You have to bein smart to fit into it, cause of it's variety of strats & specific Legend's positioning\\Game plans.\nit's better than warzone / fortnite for sureee !",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Apex Legends was my main game for years, I’ve got over 1,000 hours across Xbox and Steam. I played it constantly, with friends and on my own, and it gave me some unforgettable moments. Apex at its best feels incredible: fast, fluid, and exciting. At its worst, it can be frustrating enough to make you uninstall.\r\nI haven’t played in about a year, but the memories are still great. Despite its ups and downs, Apex will always stand out as one of the most fun and unique shooters I’ve put serious time into.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you do not play ranked then play this game. The game it self is great but the matchmaking is god awful. For example I am currently in Silver as of right now and in ranked lobbies i will get put into lobbies with Ex Masters, Golds and Plats. Seriously a fun game but the matchmaking needs to be sorted",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its fun if u choose to enjoy it, dying and failing is just a way of learning things\r\njust don't try hard and chase wins, or youll never win and have fun",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you don't enjoy fast paced gaming, then this one is not for you. It is definitely skill based. You'll for sure have a rough time if you're not so good at quick thinking. There are a lot of moments where you must make a decision quickly in order to win. However, after playing for a while this game turns out to be very enjoyable. I would for sure recommend !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a part-time secret agent and full-time platypus, I don’t usually have time for battle royale games. But Apex Legends? Oh, that game hits harder than one of Dr. Doofenshmirtz’s backfiring inventions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Actually its still playable, i dont know why everyone complains",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "like a toxic ex i leave as quick as i come back. love hate relationship with this fun yet miserable game 😴",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Apex Legends is a fast-paced, visually impressive, and constantly evolving battle royale that stands out with its smooth movement system, diverse character abilities, and strong team-based gameplay; every match feels exciting, dynamic, and tactical, making it easy to keep coming back for more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Boundless fun once you catch up on the skill gap and learn which Legends work best for you. However be prepared for some next level opponents on occasion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is fun until you get to playing ranked.. most people just use a Cronus Zen or other ways of cheating. Nearly all Preds are cheaters. But just casually playing its really fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its fun to play and you can choose different character thumbs up for this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is a little bit faster than other BR games. Different levels of shields make this game challenging to kill a target. If you miss, you're dead. Initial challenges to unlock BR could take days to finish. The game is really fun, even getting chased or killed is exciting. Matchmaking is quick, that's what I really like about this game. Not a game for newbie, by the end of welcome challenge, you'll be a decent player.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "might be the best gam that i playef, this is so fite man its so fite. firsty off, i get to play as alter, diva. second, i can go thriufh walls and stuff man, bro thats so fite.\n\ni really wqant an hairyloom so bad, at least there is a gacha system tho",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As a competitive gamer with experience in various titles, I've found Apex Legends to be a highly engaging and enjoyable experience. The game's fast-paced, team-oriented gameplay is a major draw. The variety of Legends, each with unique abilities, adds strategic depth and allows for diverse team compositions.\r\n=======================================================\r\nThe movement mechanics are a standout feature. Sliding, climbing, and the overall fluidity of character movement contribute to dynamic and exciting encounters. Mastering these movements is key to outmaneuvering opponents and gaining a tactical advantag",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun game. Movement shooters are the best FPS sub genre. Whole lotta sweats tho.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "dying game full of smurfs, but still pretty fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has had a lot of ups and downs; the movement and ttk create opportunities for a skill gap. If you are a new player, you will face a lot of challenges. With hours of learning the characters, weapons, and maps you will face constant challenges but a great feeling game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game so painful to play that me and my friends set up a three strike system for when the game treats us poorly upon which we just stop playing for our own sanity if three strikes are hit\r\n\r\nLove it, very addicting game 👍",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Apex Legends stands out for its mix of strategic team play, smooth movement, and satisfying gunplay. Each Legend has unique abilities that encourage different playstyles and teamwork. The movement system — with sliding, climbing, and ziplines — keeps matches fast and dynamic, while the ping system makes communication easy even without voice chat. Beautifully designed maps, frequent updates, and balanced weapons keep the game fresh. With both casual and ranked modes one of the best engaging battle royales around.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Game has been amazing from day 1, yes with a few hiccups but the care and updates quality is like nothing I've ever seen. Kudos to the team and anyone still looking for reasons to complain about Apex needs to log off and touch grass. Maybe the sounds on some guns can be more satisfying and less painful to the ears and also separate volume sliders for different enemy sound effects but other than that amazing work.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite trying more or less every other \"Battle Royale\" on the market over the years, Apex always eluded me, there was always this soft sense of 'bitterness' over the fact that Titanfall 2 was launched in a horrible window and Titanfall 3 as a concept, was completely abandoned, all to pave way for a trend-chasing Battle Royale game instead.\n\n[b]Fast-forward to 2025 and that juvenile bitterness has subsided so, I figured I'd give it a go.[/b]\n\nWhat I found was no Titanfall 3, but still an incredibly competent and charming FPS, with a host of awesome looking and sounding characters, all diverse in their skill-sets and abilities, with great looking guns and satisfying gun-play. I don't have thousands of hours to fall back on or 'the good old days' glasses to wear. As a new player, I think this is a cracking game and I've enjoyed every match, win-or-lose, frustration or not.\n\nThe game is, as expected, heavily monetised and it's been out for quite some time. They also run loot-boxes in the form of Apex packs and have these absolutely ridiculous 'collection events' which could have you spending hundreds of pounds, dollars etc, just to have a chance of getting a unique 'heirloom' relevant to that event. I think it's ridiculous personally.\n\nI also think the experience is brought down by having only three-stacks at maximum. I think quads should definitely be a thing in all honesty, but I don't know how that'd effect team-fight balancing and I'm just a scrub at the end of the day.\n\nMost heroes are locked which, feels weird, but as a new player, that gives the 'spotlight passes' some value. Basically, they're tiny battle pass progression tracks for each character you can pay for. Buying them unlocks the character, a host of cosmetics for that character, a gun cosmetic, some other packs, crafting materials and, if you need help on the battle pass, around 5 or so levels worth of stars, I think. Good for someone new wanting to pad out their cosmetic locker AND unlock heroes, mid-bad value for long term players though I'd say.\n\nHonestly, I thoroughly enjoy this one, probably more so than any other Battle Royale I've played. I jumped into it late, but I'm glad I did, easily a steady game in my live-service rotation now and the only BR title I will play going forward, regardless of updates to other games, or new and shiny BR experiences that may or may not come out.\n\nTL:DR for people with a bit of brain-rot / short attention spans : Game good, not jaded by good ol' days or loads of hours played over the years. Having a good time with it, best BR I've played of the bunch.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "love the game, its like a balance of overwatch and cod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always have been my fav game , stopped playing for a long while in between but i still love it and have alot of fun while playing comp or casual .Apex>>>>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fast paced Games. Does have learning curve. Not a sit down and chill game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game sucks ngl, no heirloom yet and lvl 480 man",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apex Legends is still one of the smoothest, sharpest Battle Royales out there.\n\nThe thing that grabs you isn’t just the gunplay (which is brilliant), or the legends (who actually feel different), but the movement. Once you get used to sliding, wall-hopping, and zipping about like you’ve got rocket-powered knees, every other FPS starts to feel like it’s stuck in molasses. Even when you lose, the game has this cheeky way of making you think, “Alright, that one’s on me. One more.”\nAnd suddenly it’s 3 in the morning and you’re still queueing\n\nApex is dangerous like that. You tell yourself you’re just hopping in for a warm-up… then you get that one clutch moment, your heart’s racing, palms are sweaty, and you think, “Right, last one for real this time.”\nWe all know how that ends.\n\nIt’s not flawless — the third-parties are relentless, the audio sometimes vanishes like it’s nipped outside for a smoke, and matchmaking occasionally pairs you with people who seem allergic to staying alive. But when a fight feels clean, it’s honestly some of the best FPS adrenaline you can get without needing therapy after.\n\nIf you’ve been around shooters for a while, or you just want something with real pace and identity, Apex still wipes the floor with most of the other free-to-play titles claiming to compete.\n\nAnd if this little write-up nudged you one way or another… well, you know what to do.\nA bit of Steam reward never hurt anyone.... plus it feels almost as good as landing a Kraber headshot\n\n7.5/10 Cheers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thank You EA for banning my account. I have played this game since it came out on xbox and moved on to PC over the years. But on 02 Dec 2025 I  was banned after playing a match which states \"We observed Gameplay enhancement in Your EA Account\". Mind you i was also doing horrible during the match, we lost being the 7th squad eliminated during wildcard, which should explain that. \nI have never hacked in my life and this game like every other player would have me raging because of how some players are just blessed with godly aim or like previously mentioned i am subpar at this game.\nI've spent over a 1000+ hours on steam alone but to add in from my console account probably double that number. In total ive invested nearly $1000 on this game for the sweat skins and passes. But in the end i get a random ban? \nBut regardless of the fact, thank you for banning a random casual who's not a streamer or a content creator making sweat videos claiming this new legend is the current meta or this weapon is the season meta etc etc. just your average hobbyist who once enjoyed the game.\nHighly recommend the game, but just wait until you get permanently banned for doing absolutely nothing but playing.\n\nBuy the battle pass once and it will start to pay for itself once you complete the pass and use it to purchase the next season pass.\nSave up all your apex packs until you get a 100 and open them all at once, dont purchase packs like i did, play the game and earn them, its A WAY to get a higher RNG chance on getting an heirloom.\n\nThe game wont die, but with incidents like this happening it wont last. Good Luck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "apex legend was a tolerable fps game and then everyone got super sweaty at it so now its a tolerable shooter that you suck at",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have thousands of hours on ps4, I've been playing since release and I believe that the game has one of the best concepts. It has been in a terrible state the last few years and that's because of issues like cheaters and bugs and poor developing and a money hungry company, I really hope that devs actually start caring more about this awesome game. It's a really fun game though, you should play it with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast action, smooth movement, great gunplay. Always fun, always intense. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apex Legends is the only game where you sprint for five minutes straight, find absolutely no one, and then get instantly deleted by a squad that drops out of the sky like it’s their full-time job. Movement feels amazing, gunfights are smooth, and third parties appear with the reliability of taxes.\n\nYour teammates will either carry you like a newborn baby or disconnect the moment they get knocked. There is no in-between. But even after getting wiped by someone bunny-hopping at Mach 3, you’ll still queue again because the game is just that fun.\n\nFinal verdict: 9/10 — The ultimate battle royale if you enjoy heart attacks, running marathons, and being shot from a zipline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good to play with friends , I really love the gameplay and how much difference which fps it is .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play game, do well, win, become champion, next game, die first, feelsbadman.jpeg, 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me and the boys be playing this game, they've refined it a lot, and it is always fun to come back to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No game has ever caused me more pain than apex. But they planted a chip into my head to keep playing it. Please... someone... help me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun as hell doesnt get boring fast also thought it was trash until my friend convinced me to play it and its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is special in the way that you hate your teammates, but you are the same as them so I hate it and love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I see so many complaints, but as a new comer well into year 4 of this game I'm actually having loads of fun. ...and frustration, but that's part of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like a chemical burn: it makes you feel constant pain and discomfort, but you simply can't get rid of it and it wouldn't be a lie to say that feels AWESOME to scratch it sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game so much been playing since release date im glad i switched to pc apex cause its more things you can do i love apex so much never wanna get off the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a really fun game once you really get the chance to play alot of rounds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like this game so much since i played it on ps4 but the servers should be upgraded and fixed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a nice game, movement and shooting blend together perfectly. The only issue I really see is that respawn can't really balance the game. you have the typical meta for a few seasons but other legends or weapons will be completely forgotten. So it's kinda hard to play a character you like when you don't already have thousands of hours on him.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would have more fun cutting my foot off with a saw and eating it as my final meal before a death sentence than playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obscura does not like this game, Obscura has a skill issue. Dont be like Obscura, dont have a skill issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a fast paced and normal paced battle royale allowing quick players to experience a multitude of different gameplay. It is a lot of fun and is a strong game with different legends to play with, creating a way for players to choose the best player to help their team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game fun, Horizon is horrible, octane good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but sometimes the scaling is really dumb",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, no fall damage, Kraber has always been a Mythic weapon since February 2019.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apex nails movement and class identity; zip-lines and abilities keep matches dynamic. However, the learning curve is steep for newcomers, and the ranked system can be inconsistent. I wish there were more quality-of-life features for solo players. Still one of the best BRs out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game and pretty good movement mechanics, fast paced. \nBut the server is pretty bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun competetive game with good gun mechanics, skill based matchmaking is a bit wonky but otherwise its a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a very fun shooter game and your likely to get 1 on 1. Reguarly zero teaming in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good but theres too many smurfs and cheaters as well as boosting lobbies :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game that took a push from a friend to get into, im super happy he showed it to me. Solid battle royale, few cheaters in my experience, and a good balance between clicking heads and having cool abilities that complement the pew pew.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gets a lot of slack. It is deserved bc the EA genuinely didn't care for the future of the game. It doesn't change that the game is 100% the most fun shooter with the best gimmicks. Hopefully new ownership will lead this game in a better direction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game I ever played in my life. The designs are so good and the voice lines are crazy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really do love and hate this game. Like most days I love this game and just have fun but I do have days where it is just better to leave the game and play something else. This game was like my first game on new gen type games and I have loved the collectively about 2600 hours that I have played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I personally Like this game, yes it has alot of cool stuff that is sadly locked behind a pay wall but many games have cool stuff that u need to pay for but still overall this game is very fun and i pray they keep improving their matchmaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After almost 400 hours of gameplay, I can confidently say Apex Legends is still one of the most fun and polished battle royales out there. The movement is incredibly smooth, the gunplay feels great, and each Legend brings a unique playstyle that keeps the game fresh.\n\nThat said, the experience isn’t perfect. The matchmaking can be inconsistent, new seasons are hit-or-miss, and sometimes the balance changes don’t make sense. But when the game clicks, it really clicks, those clutch moments, intense team fights, and perfectly timed abilities are what keep me coming back.\n\nIf you enjoy fast-paced shooters with a high skill ceiling, Apex is absolutely worth trying. Just be ready for the occasional frustration… and to lose track of time like I did.\n\nVerdict: Still addictive, still frustrating, still one of the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“I’ve played Apex Legends for 750+ hours, which officially means I’ve spent more time sliding, bunny-hopping, and getting third-partied than actually living my real life. It’s the best fast-paced battle royale out there—smooth movement, crazy gunfights, and teammates who leave the game faster than my hopes and dreams.\r\n\r\nOnly complaint: no Indian server. I’m basically fighting both enemies and my ping. Still worth it. 10/10 would get knocked again.”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never got into it as Im used to those more contained FPS games. Overall Decent game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good. cross platform is fine. playing with controller users is competitive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda sad that I used to be able to say something positive about this game, but the longer it goes on its really starting to be harder to find anything positive to say. I love the characters, I miss the lore and I really miss when it tied into titanfall and it seemed like they cared, but between the awful community (besides some of the smaller groups that keep it positive), the relentless cheaters on all platforms, and how much consumerism has driven this game into oblivion I cant say I recommend this game but I cant discourage you from trying it or becoming toxic. I still keep playing for some reason so it cant be all bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look, I love this game so much. Does it have it's issues, yes... a lot of them. However it's beyond anything I've played. As someone who is obsessed with visuals, Apex is beautiful. This game has inspired so much art out of me and has helped me figure out what I dream to do for work one day. (To be a videogame character/environmental concept design artist for Respawn if possible) I am quite literally addicted to this game, with my hours on here and on Play Station equating to over 1.3k. I love the character design and stories, everything is so... fluid within the storyline it's beautiful. Yes this game has a lot of issues in regards to playing and whatnot whether it be cheaters, mistakes made in code, poor choices by the dev team and whatnot but, It's a good game. The movement is incredibly intuitive and it keeps me occupied and I never get bored. I love you Apex. (review subject to change)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the mechanics in game that allow you to do crazy things. i believe you should stop worrying about new skins or  store  items and put new content in game buff some characters perferably the ones that dont get picked alot i.e. octane , catalyst, blood hound. wild card was a win. finish the characters heirlooms before you add more universal heirlooms. really need better match making. solo mode or duos ranked. anyhow overall i would recommend this game to everyone i really do enjoy it. dont make the same mistake as call of duty where you get greedy and only care about money i would hate to see this game die",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After these new updates, buffing all characters. making all the character fun to play,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting Better every season but still cant attract new player anymore as it is getting difficult for beginner player to try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“I’m writing this because the cheating problem in Apex Legends, especially in the Singapore servers, is completely out of control. Every single day the lobby is filled with hackers using aimbot, wallhack, and XIM/ZEN devices. It’s getting to the point where normal players cannot even enjoy the game anymore. It honestly feels like Respawn isn’t doing anything about it. The anti-cheat doesn’t catch them, they keep coming back with new accounts, and they ruin every match.\r\n\r\nPlayers are openly streaming themselves cheating, bragging about it, and encouraging others to buy hacks. You can literally find aimbot and wallhack being sold on Shopee with zero effort. People use these devices for recoil control and aim assist abuse, and the system does nothing to stop them. The Singapore server is becoming known as a ‘cheater hotspot’ and this is not fair to the community who actually wants to play the game legitimately.\r\n\r\nThe amount of time normal players spend trying to improve their skills means nothing when every match has someone with perfect tracking, instant beams, or wall awareness that is obviously not legit. It’s frustrating, demoralizing, and completely kills the fun of the game. Many players are quitting because of this. Respawn needs to take this seriously—update the anti-cheat, increase detection for XIM/ZEN input spoofing, and stop letting these Shopee sellers profit from ruining Apex Legends.\r\n\r\nPlease do something. The game is great, but the cheating situation is pushing the community away. Singapore servers need urgent attention, stronger anti-cheat measures, and faster action against these hackers. Right now, it feels like we’re fighting cheaters more than playing Apex.”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love getting molested by a no life 100k kills wraith that smells like soggy blue cheese while im trying to teach my autistic teamate to shoot his gun and then guide him how to revive me. He jumps off the map great game would recomend to anyone wanting to lose your shit at the slightest inconvinece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apex Legends is just plain fun. The movement feels super smooth, the gunplay is satisfying, and each Legend has their own vibe that keeps matches interesting. The ping system is a lifesaver if you don’t feel like talking, and the maps are packed with spots that make fights exciting.\n\nIt can be rough starting out since a lot of players are really skilled, but once you get the hang of it, the game is addictive. Free-to-play, squad-based, and honestly one of the best battle royales out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been a fan of Apex since 2019 (?) S/O to my friends for getting me to play this game -- it was my first FPS! I used to be scared of PVPs, especially in shooting games, but playing this has definitely changed my views and FPS games are my absolute favorite to play now. I was obsessed with this game before and during the COVID lockdown, it was such a fun learning experience with movement and aim mechanics. It has changed a lot since it was first released, but never really gets old!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the first 20 hours was like dragging my balls across an endless trail of busted glass. Other than that pretty good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy to see this game still receiving update and lot of loves despite the declining player with each year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally passed 1,000 hours. I started playing casually in Season 8, then took a long break until Season 20, where I began playing seriously and have stuck with most seasons since. The game has rich lore and several incredible maps. It started out as a pure battle royale, but has evolved into more of a hybrid TDM/BR with a strong focus on movement. While Respawn develops the game, EA’s involvement as publisher shows in its heavy monetization. But if you can look past that, it’s absolutely worth playing.\n\nSince its inception in 2019, Apex has gone through major changes in how it’s played. In many ways it has improved, except for the developers’ love and dedication to making it the best version of itself—prioritizing monetization over expanding the lore, especially legend-specific lore, which was a big part of the charm that drew me in. Even though the game has seen a bit of a decline, the core gameplay remains solid and is still stronger than it was at its launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game really hurts me. mentally, im drained. physically, cutting myself. i need help, get me off this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, minimal money spend, people are horrible at this, so am I. Geniunely suck at this game 10/10 would rec",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its still a good game but newer characters are just too overloaded",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a person who has played this game since day 1, i am loving it but the only down side  of this game is the servers. if you agree or dont agree me as a middle eastern player can play only ranked game in me-south but if i want to chill and play pubs i have to switch my server to ap-southeast and these servers lag as shi. but regardless of the lag i am in love with this game and would recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For 3 years and around 1000+ hours played on all platforms I'm still not tired of Apex. Love the game - the mechanics and the overall experience. Yes, the game still have to improve in many aspects but for me Apex changed a lot in the recent years and it's getting better and better with each season. So, for me it's one of the best battle royale games and I recommend playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best fps I ever played, great game for a team of friends to play together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apex Legends is still one of the best battle royales out there. The movement feels smooth, the gunplay is tight, and every Legend has a unique playstyle that keeps the game fresh. Matches are fast-paced and rewarding, especially when playing with friends.\n\nThat said, the game isn’t perfect. Servers can be unstable at times, and certain seasons feel a bit unbalanced depending on weapon tuning or Legend buffs/nerfs. The grind for cosmetics can also feel heavy unless you’re willing to spend money.\n\nOverall, if you enjoy competitive shooters with slick movement and team-based gameplay, Apex is definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has one of the best peak dopamine rushes once you win a lost match or clutch alone agaisnt a trio. Fighting against controller is mostly unfair. I recommend playing with trio since it makes comms much easier and you dont need to learn enchanting table language to communicate with your team. Give it a try. The high elo matchmaking is not very fair, predators trios against diamonds for breakfast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is fun gunplay smooth movement extra smooth but I’ve played this game so much I’ve been burnt out (over 1000 hours on Nintendo switch don’t judge me) still recommend but can’t compare to tf2 not tf2 but tf2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game just people need to stop being so sweat  ass fucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With all my 670 hours i have played Apex I really enjoyed it. It could be very sweaty but the new wildcards game mode thats updates like every season and add Upgrades wich some could be new. They also add a special weponed and remove the last special wepond and makes it it uniqie so you dont have to have the same wepond when you play it again next season.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is so far addicted, the only biggest main issue is the matching quality. I just start the game for a few minutes and die.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have had a very mixed experience with this game. I've played since launch with a few large breaks, and this game never ceases to amaze me. It is a very good concept that struggles with a few major issues; balancing and stale content, to name a few. However, every time I open this game, it's just fun. Sure, it's frustrating, and there have been many times when I thought I would have retired for good, but I keep coming back. As of season 27, the game feels great. The perk system and its refinement have really brought new life into the game and have let them experiment with new types of balancing. Overall, this game, despite its flawed history, is certainly worth a download",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun I would highly reccomend it to all femboys and tomboys out there ! ! ! Not to fine shii tho they not ready for all this yeeeeet. Rick Grimes out pop!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Love PvP, and Apex Legends has one of the most intense PvP experiences you can find.\n\nSometimes I need to take breaks because, like any good competitive game, Apex is hard and can be stressful, but that just shows how good the PvP is.\n\nFor new players: Good Music + Good Coffee + Play the Wildcard mode, and don´t worry about your K/D ratio, it´s just numbers, and they will go up after you get better.\n\nIf you get used to the rhythm of this game, other PvP games will feel like a vacation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing since it came out, quite off and on since Fortnite was a huge competitor and truthfully won me over, but after Fortnite died down quite a bit, I moved to this game. Spent a bunch of money, tried to win every game in ranked and un-ranked. Although the one bad thing I will say is that the game seems to be not really worked on that much, sure we get new legends every now and then or new weapon re-workings but nothing really changes things I feel like. Over all I've seen this game grow over the years and have grown with it so no matter what will probably always love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't played the game for long, bit of a noob.\r\n\r\nbut yeh... gud game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apex is one of those games you come back once in a while because you've missed its unique features. Been 5 years since i first played and its still fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It became a much better game after the balancing updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game got banned by anti cheat because i was not using cheats",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a fun game to play casually, but I feel like it has gone downhill recently. Would still recommend for players who just want to have fun.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "despite having fantastic movement and gunplay, apex legends unfortunately cant change the fact that it's a battle royale. \r\n\r\nthis game feels like an arena shooter that got turbo juiced on movement mechanics and then crammed into a game mode ill suited to the amount of creativity and skill expression it allows for. on top of that it's owned by ea and has some of the most predatory practices around. so despite loving this game, and the fact that it will be in the rotation for me permanently (assuming they dont ruin the movement) I cannot recommend this game whatsoever.\r\n\r\nmovement mechanics 10/10\r\ngunplay mechanics 9/10\r\ncharacter design 6/10\r\ngamemode 3/10\r\nmicrotransactions 0/10",
      "voted_up": false,
      "votes_helpful": 71
    },
    {
      "review": "This game used to be really fun to play up to season maybe 8? Then it all went downhill, Apex tried so much to be \"fun\" for players from games perhaps like fortnite or idfk. But this game became a clusterfuck of abilities, colors and a lotta paid shit - idc about the payments, never really wanted their skins or would be willing to pay EA extra money for basically nothing. But they added so much stuff with I guess what were hopes for reviving the game that its actually killing the game. Like okay sure, lemme get hit by 20 diff colorful abilities + effects of randomass perks so I cant even see straight. \n\nIts really sad to see a game like this go to absolute shit. \n\n\n(wasterd 1,2k hrs (+hrs from when I used to play apex on origin back in the days).",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Played from season 17 to 23-25ish.\r\nWas fun during those seasons. The monetary greed got worse (duh its EA). Meh skins for ludicrous prices. Heirlooms completely lost the point of being unique to legends, being replaced by bland universal heirlooms.\r\n\r\nUnranked is nearly unplayable for returning players. For the current season (27), I had no idea that there was a new edge-grab-boost system thing since there was no pop up window until AFTER my first returning game.\r\n\r\nQueue times are horrendous. The loop of being one of the first squads to die (skill issue I know), then having to wait 3-5 minutes to be connected, then another minute to 2 minutes to finally drop, is a pain and is not enticing. If I die, I want to get back into a game to try again ASAP.\r\n\r\nThe alternate game modes have even longer wait times.\r\n\r\nThe skill ceiling of this game is high, with rewarding movement (previously anyway), and relatively fun legends. I never will reach that skill ceilings because I can't dedicate 8 hours a day to this game to master the techs and gunplay and learning niche interactions. I don't want to be seen from half-way across the map and be knocked two seconds later. \r\n\r\nIts a challenging game, and when you do win, it's rewarding. But this is not a \"casual\" game. You don't relax by playing this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it  was a good game gets worse with every update the devs dont give a sh#t about people hacking do not recommend playing",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve spent a lot of time with Apex Legends, and honestly, the game has become more frustrating than fun. The movement and core gunplay are still great, but everything around those basics feels bogged down by problems that just keep piling up. The biggest issue for me is the game’s stability and matchmaking. Constant server lag, random disconnects make fights feel unpredictable for all the wrong reasons. There’s nothing worse than losing a gunfight because the game stutters or your shots simply don’t register.\nOverall, even though Apex Legends still has flashes of what made it great, the technical issues and inconsistent balancing make it hard to enjoy. The potential is still there, but right now, the game just feels like it’s getting in its own way.\n\nDifficulty to 100% -\n(1/5)\nJust play the game and you'll get it all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Garbage money hungry game run by people who dont know what theyre doing. dont waste your time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".\r\n\r\nthis game is gustavo fring lospolloshermanos disapproved",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cheaters, bad servers and exploits. No thanks.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "repetitive and sweaty battle royale/multiplayer slop meant only to addict you and drain your wallet with cosmetics\n\nif you have some self respect inside of you, please. just don't touch this game.\ni've learnt the hard way and i regret it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ah yes apex Legends. I know i only have 70 hours on pc but on ps5 and xbox i have together 5k and maybe more hours on this game im a day one player at that too lol. Apex was and is (kinda) fun it depends on what you are looking for its not very new player friendly unless you played apex when it first came out. Movement wise is great best movement from a game. I think what makes this game not fun anymore is skill and PROS and twitch streamers i get everyone wants to be famous and stuff but god. So dont be surprise when you get killed by a TTV or KICK person. I say skill because you got to at least know how to wall jump or bunny hop and i barely know how to which is crazy. BALANCING in this game is just bad they really only listen to pro or base it off of ALGs there will be times when they do listen but thats if the normal people say it and the pros say it too sadly. So when it comes to who they will listen to keep a eye out. MONEY i know its like hitting a dead horse but skins is very expensive for one skin its at least 20 to 30 dollars you can have the skin or the gun they will discount for 5 dollars off lol. Heirlooms i feel like this is the only thing that keep this game alive (kinda) but its bad you have to spend 160 oh wait its 200 or 260 yeah dont get no event with a heirloom. I feel like they should give out at least one time a free heirloom just one just saying man it will bring back some people. i have retired from apex it brings a lot of stress after work and i just want to relax not rage plus my gf and family dont play this anymore btw soloing in this game SUCKS. Overall i give this game a 3 out 5.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So, after several hundred hours of this game, maybe its time for a review...\n\nLets start here, season 4ish, I started playing apex after hearing about it from a friend, back before it was on steam, so i downloaded it and gave it a try, It actually was such an awesome game, Fun characters, fun concept, cool abilities(bullshit ones too! but hey It was fun), really cool skins, concepts, Absolutely astonishing and engrossing lore, affordable and really good looking battle passes, gunplay, movement, everything you want in a first person shooter, and battle royal. then I rolled through the seasons, up till season 8, after that came the inevitable death of what once was, and it just kept getting worse...\n\nSmurfs, Tryhards, 4K damage players, Ranked players, Crashes, Lag, cheaters, aim botters, BS characters, stupid buffs, debuffs, weird additions to the armour system, changes to 80% of the original characters, ruined battlepass, all the problems that make a good game go down the drain... \n\nSo, to you dear reader,I leave you with (if you took the time to sit and actually read my review) a Thank you, but also a *STRONG* reccomendation to not get this game and do not waste your time or life, my 600 hours came before all these terrible updates, from there i haven't played much more, for obvious reasons.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After serveral requests EA still doesnt undo my false Bann. Like sure guys  i just went to f**ng india to cheat in a game...... i really hope this company gets what it deserves and all of bumms will sit on the street.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game doesn't work and has constant lags/freezes. Shit company",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Play Apex.\nEnjoy it.\nSeason 27 hits.\nTry to get on.\n\"You need EA account to play\"\nMake EA account with VPN because without it cant do anything that`s tied to EA.\n\"Steam ID missmatch\".\nTry without VPN,dont work.\nfuck you EA\nTried with 2 different internets and 3 different vpn`s",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "STOP RESETING RANKS EVERY SEASON. \nTHIS GAME TURNS INTO A TOXIC NIGHTMARE EVERY SEASON, PLUS IT HAS A LOT OF CHEATERS, EITHER AIMBOT OR CHRONUS ZEN PAD ATTACHMENT FOR YOUR CONTROLLER SO YOU CAN HAVE A BETTER AIM. This game DOESN'T even care about your competitive skills. It is just made to catch fanboys that would spend 200 dollars on skins while the servers are trash and the competitive system is a joke. There is no competitive improvements in this game, EVERY 4 MONTHS your rank gets reset, SO IF YOU BROKE YOUR BACK grinding from low ranks to high ranks (diamond-predator) be prepared because in the next few months you rank is gonna go down and you are gonna have to play with low ranks and toxic people that hates the matchmaking. THIS IS JUS AMAZING. AND LETS NOT TALK ABOUT THE QUALITY OF THE SERVERS, lets not talk about how you can easy get disconected in this game for no reason, you get kicked out of the server, EVERY TIME YOU PLAY you get teammates that have conection issues even with a high end pc and internet. This game is not worth your time. This game is just toxic and is an insult for the human common sense. Don't even waste your time playing ranked. THERE IS NO COMPETITIVITY IN THIS GREADY GAME",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Full of cheaters, the game doesn't support the competitivity at all, they reset the ranks every 4 months so all your progress is gone, every time they reset the ranks THIS GAME TURNS INTO A TOXIC NIGHTMARE WITH SO MANY UNBALANCED GAMES AND SHITTY MATCHMAKING, you either match with the player that just got his rank reset from diamond-predator with the guy that has been hard stuck his whole life on low ranks. This game is not worth your mental health, ITS  SO TOXIC AND RESPAWN DOESN'T EVEN CARE ABOUT IMPROVING THE RANK SYSTEM. All they do is bring expensive AF 200 dollar skins and heirlooms. But the servers are a joke. And lets not talk about the people with aimbot and attachments for their controllers the buy irl to get a better recoil. The game is literally not worth your patience. I am a Diamond player, I played this game since it came out but honestly, it has so many problems its a big dissapointment ,",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game is currently filled with cheaters and server lag, better off playing something else. after this much time on this game i have never felt like this game was bad or unplayable until this moment right now. 0 fun, 0 competitive integrity. no fun to be had here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has been deteriorating over time.\n\nI have spent over 2,000 hours on the console version, but only about 20 hours on the PC version, as the game has become unplayable.\n\nIt had some great ideas, but the developers have not put any effort into improving it.\nThe updates are just cosmetic, and the cosmetics are now so expensive that I won't buy them, even for fun or to look good. There is a high chance that a new skin is just a recolor of an old one.\n\nPlease don't touch this abandoned game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game's run its course.   After 5 years, hackers can be found in a startling percentage of games across all modes and if not hackers then you are subject to the games poor audio (which was never fixed), server lag, and other elements that break the games fun for all but the sweatiest of players.\n\nIts ironic given this is a \"movement shooter\" but mechanics not intended in the design play a major roll in breaking the game.  One either has to have exceptionally trained aim to match these movements in a split second or use them yourself to get the drop on an unsuspecting enemy.  As of yet, Apex does not offer any features to help one practice in such an environment. These same mechanics are brought into casual modes by sweaty players for the sake of domination.  It ends up creating a barrier to entry that is simply too high and players should move on.\n\nApex might save itself by following the likes of Fortnight by disabling these mechanics (and aim-assist) in their own version of \"no-build\" mode but I think most players would rather see a new Titan Fall instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lets talk about apex legends....  This game launched back in February of 2019, and man oh man it was a hit. That being said Respawn did everything in their power to destroy it so lets talk about it.\r\n\r\n1. The movement.....\r\nI'm not normally a huge fan of the extreme fast paced movement but Titanfall had it perfect and when Apex Legends came out they nailed perfectly. It felt fun and exciting but now, not so much chief.\r\nYou see I'm not sure why they did it but they went and made Apex Legends, Chunky Legends. I'm not sure if this was a community complaint or or a ranked complaint or even Respawn just sippin the juice too hard but this feels horrible now. It just kills the parkour and sprint feature, I shouldn't have to slide down a hill for a boost in speed. \r\n\r\n2. The guns.....\r\nRespawn did this really cool thing where they brought all the guns from Titanfall and just molested them.\r\nYou see they went and looked into the fan favorite weapons and nerfed the life out of them to switch up the meta, but the weapons were fine! Honestly this wouldn't be a bad thing if they buffed them after a while but that's just it, they never get buffed back! Every gun feels like a I'm hitting them with with pillows. You're forced to just puke all your ammo out on one guy because every time you do damage he just runs away and shields back up and rinse and repeat until one of you either runs out of shields or ammo. You make a competitive game and then try to hard to make it  \"player friendly\" and just turned it into a bullet hose arena\r\n\r\n3.The characters.\r\n(this one is my personal opinion so feel free to blow past this one) There are so many characters and they cost an arm and a leg to unlock. Half of them are absolutely useless and feel like gimics. The skins are kinda cringe too at times, not all of them but most of them.\r\n\r\n4.The Store...\r\nI know the game is free and the store is where they make money but the prices on the items, oh my god.\r\nlike 20+ dollars for a majority of the items in the store. It just feels scummy and it's giving wallet reaching big time. Respawn is just becoming activision 2.0.\r\n\r\nI think that wraps it up for me. This game used to be such a gem but like all things on earth, aging kills (unless your a lobster) It does feel sad though because this game really speed ran the whole \"killing my own community\" strat within a year I would say. They already announced that there wasn't gonna be a Titanfall 3 so this was the only brainchild in the works to my knowledge which just feels like the thing they care about is collecting card info now and not the Titanfall arena experience this game is built around. Stay away from this game and let it go peacefully into the night. Lest Respawn does anymore harm before it does.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is insanely dead on APAC servers meanwhile i can't move to other server when matchmaking was faster there (JP,CN,KR)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would love to recommend this game because i had a lot of fun! \nBut in the end they dropped Linux Support and that is something i dislike tbh. \n\nGood Thing that there are other games like this, i only miss the battlepass though",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Aw, look, still cheaters even after Linux customers were shafted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They made it so that tiktok short attention span players can play without getting bored. Time to kill is stupid low this is not Apex anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game used to be so good. One of the things that made this game so great and fun was the long TTK, if you got shot you could fall back and re-fight, there was strategy, to kill someone you had to actually outplay them. Now the TTK is basically COD, who ever sees the other person first wins. Its boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everything about this game suckkkssss, the problem is, it's probably made for 3 year olds not for grown ass men. I would rather play Titanfall 1&2 over hundreds of hours instead of this piece of garbage.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "just dont use steam this shit is terrible and the purchases error are terrible.....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "only when there is a event or something. with the usual looting system it takes 20 years to actually get a good weapon",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game has SO MANY BRAIN DEAD NO SHOWER NO HOES NO DAD SWEATS that it is basicly impossible to have a good time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "games unreal these days i just got on after a yr and already uninstalled it after my 3rd game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game used to be good back in the 1800's when it was still popular but they added to much crap and made the game less enjoyable. sorry apex",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't waste your time with this sh*t.  You'll sit in que for 20 minutes so might as well play another game where you can actually play. Then once you finally find a game, unless your faide or a top player you'll just get mowed down by movement sweats.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Integrity error 0x8000002\r\nApex exited due to an external tool that jeopardizes gameplay integrity.\r\nPlease exit any problematic software before running Apex. This may include scripting software, virtual controllers, debuggers, or reverse engineering tools.\r\n\r\nsuck my nuts",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm sure this game is great, but I've countless issues with shaders, graphics, network, and just overall lobby matching. got paired with a hacker for my first game. please don't waste your time with this or just have a really good computer if you're interested in the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "F this game. It was perfect. The best game for people who will struggle to learn something hard and hold on so to perfect something never ending. The idea that someone could cheat to feel strong is beyond me - it's self-evidence of weakness. This game is not that, but those left are fighting to see who is the best with their cheats, finding out who they become. Seems a whole different world that what I remember ~ Acue and the rest. It's a real grieving experience, though long overdue and long after most. A run though, it was guys. 4212 hours total, learned MnK on this (six months of back and forth at 35, now 40). The game will always be a part of me. So many nights, so many convos, so many mistakes, so engrossed in something so engrossing. Everyone else I loved here has moved on. I'm gonna go see if I can find them. \n\n............... Just did the math. 69 months, start to finish - 4212 Hours on Origin and Steam. Letttts Goooo \n(to the chiropractor). I regret nothing. I don't think I have another FPS in me guys. I love what we had, never turned to the dark side, became better than I imagined possible. GGs my true ones, no matter what input. I'm a demon on controller too, after all. Apex was my first lol.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to play this game a lot back in the day. then i remembered Titanfall exists. I realized what this game represented for respawn. this wasn't a extension for the Titanfall universe. this is a eldritch demon that respawn sold their souls to for a little bit more cash. There is no story to tell. The cutscenes are just there to show you what Titanfall could've been. this games very existence was a mistake. Because of this games existence, we will never receive another Titanfall game again. I was a fool for spending so much time playing this. Please don't download, don't play it, and only then will we finally have the chance to have another Titanfall game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Apex needs to fix their shit, theres constantly some sort of issue no matter the game or connectivty.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To download it  took 6 hours (speed suck) , but not a single match did i get to play . For like half hour or maybe more i was waiting but not  a single match in any mode did i get to play, my frustration level to high. Sucks this happen to one of my favourite game . i got a decent laptop which it can run but this sh*t didn't even find a single match .DISAPOINTED!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Games is fun as long as u play low-elo ranked or low elo casual. As soon as you get into the higher elo lobbies you almost always face some kind of cheater or people that you should never be queued with, e.g. as Diamond IV facing Pred #1.\n\nThe horrible matchmaking system and constant cheater problem basically forces you to quit at a certain point and start with new account so you can actually enjoy the game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spent almost 4 hours no kills and no way to really improve. Not a big fan of the over exaggerated gap in levels as it seems the new people have zero chances at doing anything else other than soaking up bullets. Will not waste anymore time on this one",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you havent play this game in a long time do NOT return to this game if your a casual player ITS NOT FOR US!!! Its for the sweats...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is made for pepole with short attention spam the emotions go from high to low so fast its insane when your playing ranked its all okay until when your fighting and a 3rdparty shows up and rolls you only to notice he is pred and your plat and he is running a 3 stack cheater squad don't play unless you have money!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has a hypersweat infestation. The skill gap between new players and seasoned ones is geniunely insane. \n\nNot recommended for casual gamers. Too sweaty.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "used to be a good game then they started to cater to individuals whom only play the game one hour every year. sad to see where this game is headed. + servers are doodoocaca. need to do some work and get off source engine. its 20 years old.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you wanna get ulcers and ass cancer this is the game for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kernel level anticheat makes this game unplayable on Linux. It's fun, but that's a hard \"f no\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My internet connection dropped, and the game kicked me out of the server.\nI can't log back in, but I've been banned. Please help me fix this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not my type of game to begin with (not a huge fan of Battle Royales), but the devs killed this game for me. Adding busted abilities to heroes that were already good was just not necessary.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA support sucks as*, if you strip EA it is a 10/10 game, as of now, they will get the thumb down, if there was something lower than that, i would press it at a heartbeat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible. Every round is either the easiest win ever or you play against someone so good it's basically or literally cheating. Total trash. Not worth the electricity cost to download this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was expecting good movement, feels as floaty as trying to jump and move in halo while having no other fluid way to move, gameplay went as this:\r\n\r\njoin game\r\n\r\nwait in queue for 3 trillion years\r\n\r\nget into game, instantly killed\r\n\r\ntry out bot lobbies, have the bots stare at eachother and do nothing\r\n\r\nuninstall apex, install titanfall 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DOGSHIT AHHH DIDDY BLUD GAME.... NO CALC INVOLVED.... i cant gamble on this game dog shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i quit the game when they changed revenant, i had both heirlooms i feel like ea shoulda just let us change those heirlooms when they completely change how qa character works, but its not even that the games just ass its been the same for years",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am almost certain that 90 percent of the people who play this, only have this game downloaded on their pc and or console and it is the only game they have because they are sweaty broke people who wanna talk smack. Get......A......Lifeee And get in the shower jesus.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Once a great shooter and battle royal holds a lot of memories and moments of my teenage era and covid but now a fallen son of the series ,titanfall 3 got sacrificed for it was it worth it?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "havent played the game in almost 2 years. decided to load it back up since the BR i play had a huge downtime. yeah was reminded instantly why i stopped playing. nothing like being forced into games with people who havent seen daylight since covid despite not playing for 2 years. gonna go ahead and unistall this trash from everything i have it on.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit server, shit connection to the game shit matchmaking overall shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "your matchmaking system is making my dirty clothes pregnant \r\nplease fix it \r\nim plat 2 \r\ni played more than 20 games today and yet not in 1 of them did i have a team with a brain \r\nhow are these people even plat?\r\n*taky* was here",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had really enjoyed playing this game, I used to play it almost everyday. I didn’t like the ea transactions, I think it was starting to fall off then, but I still played it. When they put out the anti-cheat I couldn’t play anymore. I used to play on the Steam deck, which I can’t anymore. Since I played on the steam deck, I had to play against pc players, so I was always at a disadvantage. \n\nI loved the game while I could play, would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is just trash, it was good I played since season 1 but after season 5 the game started to flop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing Apex Legends since day one back on console, and after all these years the experience has always been a mix of highs and lows. The movement and gunplay are great — that’s the one thing Apex consistently gets right. But everything around them makes the game frustrating.\n-\nEvents are extremely expensive, and the monetization keeps getting worse. Matchmaking is all over the place: if you try to play casually, expect to be thrown against players far stronger than you — probably because there just aren’t as many new or casual players as there used to be. Add the usual cheaters, lag, and server problems, and it becomes hard to enjoy the game the way it deserves.\n-\nI haven’t played since January, so maybe things have changed — but honestly, I doubt it. Apex had so much potential, but it’s been wasted over time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game was fun until they added more characters and it lost its vibe.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Random crashes, bad audio, weird balancing. gonna keep playing but what a bad game. will kick you out of a ranked match, refuse to let you back in, then hit you with an abandon penalty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit community. worst multiplayer experience ever. no solo option, que up solo to play with myself in ranked many times, try to leave and get banned. hope the people making decisions here all go broke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game nahui suka i don't win this game in my either life even the xbox I'm always losing. blyat this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After downing so much money and hours, ts lowkey buns!!!\n\nstill gonna play it though\nstill ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gameplay mechanics are great but everything else is ass, community is garbage, support is ass, EA should just not exist. team based game but lots of factors are in play that prevent us from play in a full squad. if this game was not under EA's belt the company would of not exist anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is full of wallers, soft and hard aim botting, servers for ranked are complete trash atp. prices for anything in game are completely outrageous. idk man such a great game for them to just not take care of it is such a shame. recommend looking for something else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the matchmaking is actually so awful that i cant play the game. fresh install getting into lobbies with the most sweaty mfs ive ever seen. how am i meant to learn the game when i just get dookied on every spawn\n\nskill issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game used to be so much fun.\r\nNow it's a sluggish snoozefest without soul.\r\nLet this shit die and create a new titanfall already.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but cheaters around (intentionally not being solved), ban hammer is just a joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dude this game is so horrible. Don't play unless u wanna die to a 13 year old off of percs. do not play. please.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash matchmaking system kills the fun of this game bruh, it is an amazing game and satisfying as well but the MATCHMAKING system is just soooo bad gosh. if you are a new player or you aint good at this game you are cooked, if you are lvl 1 guy your opponent might be at 300 level who spent their entire life at this game, if they FIX the matchmaking system and probably it will be in the top 3 battle royale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game. It constantly kicks normal players for “not having anti-cheat running,” even after updating, restarting, and doing everything right. Meanwhile, actual cheaters run around freely with zero consequences.\nthis trash game isn’t worth your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst game ever, if your ever good at playing. showing content of you destroying people in the game and get removed for clipping a admin is gonna be your downfall. if you see a Admin in the lobby, i recommend just leaving to give them the win because thats all they want. this is my fourth account and i'm alone getting a code anti-cheat authorizing error, while the games servers are still up. like wtf, EA if you ever get this. please have a heart and give everything i worked for back. I'm writing this to make the game safer because it already isn't for any gamers that have a chance for a sponsor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the cheating pandemic is crazy in this game now. trying to learn how to play mouse and its insane. dont play if you have sanity",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In apex legends, all they do is look the other way for cheaters and punish the normal players. Just because my pc bluescreened, I got a 10 minute penalty for 'abandoning the match' even though I rebooted my pc and opened the game back up in less than 5 minutes.  This game could be good but Respawn and EA are trying their best to mess it up further as always. I do not recommend this unfair game to anyone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Brain dead community full of toxic turds. Give them a taste of their own medicine and you get banned. Not worth spending time or better yet money on this god awful joke of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spent all my life saving gambling for heirlooms and i only have one DO NOT SPEND YOUR FAMILY SAVINGS ON THIS GAME (just dont play it at all)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A good but shitty fps\r\nSometimes it can be fun, other times you get beat up by sweats\r\n6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It would be a good game if I could hear when people are literally behind me!  Die to lack of footsteps constantly, it's been like 5 years and the game is still abysmal.  Too many cheaters too, too many zen controller players.  Forced cross platforming on PC but console players can turn off crossplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ХУ Е ТА, спасибо EA за их великолепное приложение и обязательный аккаунт EA из за которого я потерял аккаунт апекса с 1го сезона и 300+ лвл и донатом.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried to come back to the game to check it out after a few years away. Turns out I literally can't because my graphics card, which could run the game, is no longer supported.\n\nDo I think Respawn made a mistake abandoning DX11 support? Not really. Do I think they should suffer the very minor repercussion of a negative review? Yes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ban that f bird of prey this game has become doodoo, nerf mirage, fix not hearing footsteps\nFIX YOUR GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 person squads every other game. otherwise game is fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1600+ hours on console-haven't played in months. it's just as bad as i remember. i love it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Apex is the only game where:\n– You land on a blue armor and Mozambique\n– Enemy lands on a fully kitted R-301 with purple shield\n– They still apologize after deleting your entire squad\nBalanced.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game was awesome, stop playing almost a year ago, tons of hackers, they do not care, unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The hacking going on this game is completely out of control. It will eventually fall like warzone at this rate.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literally cant even get into a game. I dont know what they use for matchmaking but its trash or maybe that many people just dont play the game and the numbers are lies. its a waste though",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fix the matchmaking in this game, how do you expect someone to have fun and actually learn the game when at the start of it you're with level 400 and die every 2 sec. Seriously a minimum of matchmaking isn't so hard to do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I never seen more retarded and blind people like in this game its so annoying to play game for 800hrs and never play with someone normal, brainless toxic gays and bots with controllers with aim assist",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another game ruined by devs who thing removing linux support with fix their hacking problem,,,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is BS, im fighting one team and then suddenly 4 others come out of nowhere and make me look like prime lana rhoades taking it from every single human. \r\n\r\ndelete this dawg shit ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "get rid of the game it's completely dead, tried every game mode and can't find a single match and i have good internet. it's gone call it quits. remove it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing Apex for years, but the recent updates have honestly pushed my patience to the limit. The game feels less stable than ever — weird hit-reg moments, inconsistent servers, and audio bugs that somehow keep returning every season.\n\nThe new balancing changes didn’t help either. Some Legends feel completely overtuned while others are borderline unplayable. It’s hard to enjoy a match when every fight feels like a coin flip depending on which broken ability the enemy is abusing this week.\n\nWhat’s worse is the overall direction of the game. Instead of fixing long-standing issues or focusing on core gameplay, it feels like everything is built around monetization first and gameplay second.\n\nI still want to enjoy Apex. The movement and gunplay are unmatched. But right now, the frustration outweighs the fun, and unless the devs seriously address these problems, it’s hard to recommend the game to anyone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Respawn fell to the devil of live service, they started off so strong and only corrupted further. \r\n\r\nI Do love this game but it is beyond dead and killed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "overpriced heirlooms that arent worth nothing and you wont even get you money back the amount of cheaters and people using some macros or some shit is absolutely diabolical, maybe instead of adding more and more heirlooms and only farm money they should upgrade the anticheat just like Battlefield did, :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didnt even start. Kept giving the same bs \"Integrity Error\" ???\nI have verified the game files twice already, isnt that enough ??\nThis is a 3 month old laptop, ive barely got 10 games on it.\nAnd just a few apps like steam, discord, firefox, roblox player, etc.\nNothing shady at all. Believe what you will.\nAnd still why, why wont this stupid game run ?\nI feel like ive wasted all the time i spent away from the computer waiting for this thing to finish getting downloaded.\n\n\nOk. So, a friend told me to uninstall Daemon tools of all things, and that worked. Now i can play.....\nwhenever the servers are in a good mood. Would not recommend anyone to go through the hassle of installing this.....  disheartening piece of digital doggy doo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The flashback  and sounds breakdown keep not fix it, If you're a new player. Do not touch this game, because developer even don't care this game the problem.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}