{
  "positive": [
    {
      "review": "The first 100 hours of this game are awesome. The world is beautiful and immersive. The quests/missions are fun and engaging. The combat feels good and the skill progression is clean and intuitive. The class quests are fun and engaging.  I love the building mechanics and the freedom to build practically anywhere you want. For me after completing all the solo content in the game there just wasn't anything left to do except pvp. The pvp in my opinion is not enjoyable. I understand where they are going with it and the audience they are targeting but for me its where the game ends for now. I know they are working on more pve content and I can't wait to see what they are cooking up but until then I am exploring other games. I still log in every couple of weeks to refresh my base so I don't have to start completely over again when this new content finally makes it into the live game.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "Over 1k Hours played. This game is certainly relaxing if your just looking to chill and farm. The Deep Desert is a mixed experience though. At first, we had to creep around at 3:00 AM because literally 1 guild locked down every shipwreck and facility worth doing. It was not fun fighting outnumbered against players who were literally gatekeeping the best schematics. Even if you did manage to sneak some, you never had enough resources to build past 2 items-that same guild locked down both the large resource islands. Now, many months later, with the changes to the DD, and that guild long gone, I have been able to finally stockpile a massive amount of resources and schematics on my own. I do not really think the resource denial and gatekeeping creates any end game. Keeping gear out of players hands and limiting to a few elite players who are only here so as long that status quo stays just creates a negative play experience for most of the population.\n\nI enjoy pvp, but not when I am risking my equipment that was extremely difficult for me to get. Dying 4 or 5 times literally puts your equipment at 60% durability. There is not any gain to just fighting losing battles, as your the one taking the durability loss. So you create situations that guarantee victory, which creates more negative play experience for the ones losing. You literally get nothing for fighting other people, other than just the fight. Sure, you can loot them, but their loot is not anything you can't get on your own. There is no specific PvP resource anyone drops. no tokens to be exchanged at a pvp vendor for rare cosmetics or skins. There is not even a PvP objective to fight over in the DD.  FFA PvP is just filler content, you can't create a PvP endgame with only FFA PvP, with nothing to fight over. If fighting over denying resources and progression is intended, than that is a model that is terrible for the health of a game.\n\nI really enjoy this game, but I had to experience the worst form of it, and all while undergeared fighting uphill battles, while outnumbered, against superior geared groups. That is kind of a trash experience, that most players will not ride out. Now, that it is easier to get what you need to progress out in the DD, the game is fine.  I want to see big guild vs guild battles, but you need to give these people something that matters to fight over, not just randomly steamrolling solos to pass the time, or gatekeeping progression. Until there is actually an endgame, Dune Awakening remains a chill resourcing game that lets you chill out, and sometimes fight in the DD, if your server is more friendly.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I am 78 years old and play this game with my children.  I love to gather resources my daughters love to build so everyone does their thing until....    it is time to kill.  We all love to collect bodies and suck their blood for recycling.  Collecting spice is an adventure we all participate in.  Love the game and oh by the way thank you for making it easier to get from driving to the turret.  Oh and by the way, we love being able to label our vehicles and boxes,   keep up the good work.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Captures feel of the Dune universe well. Quite fun until late-game, when it becomes grindy and lacking in content. Base building is solid, but the tax system (for anything bigger than a modest box base) is a drag.\n\nAs single-player: pretty good, except story is unfinished and always online. Lots of pointless travel.\nAs MMO: lonely (no LFG/recruitement [outside Discord?], everyone spread out), lacking in shared events and no endgame (yet).\n\nShipped unfinished, *slowly* becoming a full product. There are so many possibilities, but they are still too busy putting out fires from experimental features and half-baked execution. So, like Conan Exiles, except fewer fatal errors and less general instability.\n\nBut I find it fun. It still has potential. Fingers crossed.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Perfectly replicates the hash nature of Arrakis. The idea of using the 2021 movie visuals with the books lore was a perfect match. Greatly expands on an already well established universe.\n\nThe endgame is lacking and repetitive but development is progressing and there were some welcomed additions, with more on the horizon. I expect it to evolve like their previous title Conan: Exiles.\n\nGreat potential and, as it currently stands, already worth the money for the single player story alone.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "[h1] A promising foundation with incredible potential [/h1]\n\nI really enjoy the worldbuilding aspect of Dune: Awakening. The atmosphere, sound design, and sense of scale capture Arrakis beautifully. This game has a lot of potential, and I truly hope the developers continue expanding it with new content and story updates in the coming years.\n\nI mainly play for PvE, and it would be great to see more vehicles, technologies, and unique building pieces as progression rewards. Another feature that would greatly enhance both solo and group play is an arsenal or gear loadout system. Being able to save and quickly switch between different builds, such as skills, weapons, and armor, would streamline gameplay and make experimentation much more enjoyable. It would help players adapt to different challenges without constantly reorganizing their inventories, and it would support more meaningful buildcrafting in the long term. In the far future, it would be amazing if we could eventually construct our own spacecraft and travel off-world to explore planets mentioned in the Dune universe. There’s so much rich lore to draw from, and I hope one day the game can take us beyond Arrakis.\n\nFor PvP, I think dedicated game modes could add variety beyond the Deep Desert sandbox. A team-based duel arena or a free-for-all (FFA) mode for competitive players, a large-scale “Big Team Battle” (BTB)” mode with vehicles and objective-based matches, or even vehicle racing across dunes and canyons could create exciting and focused experiences. It would also be great to have ranked matchmaking and proper scoreboards, so players can track performance, progression, and improvement over time. Bringing your character build into these modes would allow players to test themselves in a more structured and competitive environment. A loadout system would also support these PvP modes by allowing players to quickly switch between specialized builds before matches. Match rewards or cosmetic emblems could further enhance long-term progression. There are many exciting possibilities for additional game modes.\n\nThere are many community discussions about the game’s current state and its future, and I hope the developers continue listening and adjusting direction where needed. I understand that game development is complex and full of technical challenges, so I genuinely appreciate the consistent patches and the addition of community-requested features week after week. Progress is gradual, but it is clear that the game is improving, even though there is still a lot of work ahead.\n\nOne suggestion I’d like to offer is improving communication. While updates through social media and Discord are helpful, it would be fantastic to see monthly developer talks or livestreams, similar to what Digital Extremes does with Warframe. More open and transparent communication would help players feel involved and informed, and give us a clearer sense of the game’s direction. Even if it’s too early for full dev streams, beginning this kind of conversation would greatly strengthen trust between the developers and the community.\n\nDune is a very special IP, and Dune: Awakening already shows respect for its legacy. I’m excited to see where the game goes, and I hope the team continues building on this strong foundation to deliver the best version of this ambitious vision.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun overall — great visuals and smooth gameplay. The story drags on a bit, but still a solid experience.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I've played the game for quite a while now and I'm absolutely loving it. I don't agree with the negative reviews that this game has recently received; it's a fantastic rendition of the world of Dune with plenty of exploration, storyline and deep open-world gameplay. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As a gamer that doesn't really enjoy open-world survival games, I have to say that Dune: Awakening caught me by surprise. To get the dirty bit out of the way Dune: Awakening has had problems from day one. Frame rate problem, deep desert zone disconnects, horrendous graphical issues and the like. One of the worst being game crashes and general disconnects. Why you ask? Well that's because Dune: Awakening is a beautifully crafted world that will eat you whole at a moment's notice both from its denizens or from a ill timed game issues that can get you killed. Almost nothing is worse than losing everything on you and a vehicle to Shai-Hulud. There are definitely improvements to be made and Funcom has been making efforts to correct both player behaviour and quality of life in the game. The content that has released so far has been engaging though a bit sparse to keep some of my friends attention. \n\nThe big part of any survival game of this type is the time you invest in it. Things degrade if not properly shielded and this applies to your crafted vehicles but your very bases. While I'm waiting for the next bit of story I'm always gathering up fuel cells and other materials to keep my generators running to keep my items, vehicles and base kept up and my taxes paid for my land plot. Whether you put in few hours a day in upkeep or multiple hours a day farming for schematics, materials there is plenty to keep you busy all the while surviving the elements as you master your preferred class as well as others. What I will say as a fan of Dune in general Funcom nailed the atmosphere, storytelling, survival mechanics and music of the Dune universe and its been a enjoyable if not stressful ride on Arrakis.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game for survival and building fans of the Dune universe with a great story that can make the game friendly for solo players, with great progression. Very addictive!!\n\nonly negative is: the end game CAN be brutal, but just like with Arc Raiders; you'll find plenty of good people out there on the Dunes too, I know I have ;)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a huge Dune fan, I love this game. Gameplay and storyline is excellent - can't wait for more. I love that the dialogue is adequately dark as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dune: Awakening delivers a fresh and immersive survival MMO experience set in a stunning re-creation of Arrakis.\nThe dynamic systems like shifting weather, terrain changes, faction politics and player-driven stories keeps gameplay unpredictable and exciting. It makes the world feel alive in a way most survival games don’t.\n\nThe gameplay loop is super satisfying: gather resources, upgrade gear, build your base, and slowly carve out your place in the chaos. Combat feels smooth and weighty, and the spice abilities add a fun layer of strategy. Running into other players can lead to cooperation… or absolute mayhem, which is half the fun.\n\nWhat makes it even better: the developers clearly care. Regular updates bring new content, bug fixes, and improvements that keep the world evolving and fresh. It’s great to see the game grow over time with new features, balancing tweaks, and community feedback all seem to matter.\n\nIf you enjoy open-world survival, exploration, player-driven stories and you appreciate a dev team that sticks around and supports their game then this one is absolutely worth a shot.\nThe spice must flow!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a fun game. The end game grinding for resources can get pretty intense. You need to look up some guides to know youre collecting things correctly otherwise, you'll probably be doing things way harder than need be. Use the public maps to find resources too. Join a popular server and look it up, otherwise you might be playing alone, since the userbase is so small.\r\n\r\nI got partnered with the game but ive been playing it a long time beyond when I needed to stop.\r\nhttps://youtu.be/KXTxrYaaDrU",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, more to come.. just lagging behind but see what comes good life updates so far wonder what the redesign of skill tree will bring",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I only recently got into this. While the game appears quiet I wasn't looking for a multiplayer game as I prefer to play games solo. The solo experience has been fantastic so far and I still feel like I have far to go. Definitely getting my money's worth out of it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A delightful survival game that felt remarkably fresh, but not so fresh that i couldn't watch Breaking Bad in the background.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I never write reviews, but Dune: Awakening absolutely deserves one. This is the first game I’ve played that feels like it gets everything right! Based on initial impressions.\n\nImmersion & Visuals\nThe graphics are breathtaking — Arrakis comes alive with stunning landscapes and an atmosphere that pulls you in completely. Every detail, from the shifting sands to the looming threat of the sandworms (Shai-Hulud), makes the world feel both beautiful and dangerous.\n\nStorytelling & Progression\nThe narratives are rich and varied, weaving together lore in a way that feels authentic to the Dune universe. Despite the game’s depth, it never overwhelms. Instead, it guides you in the beginning step by step, making the learning curve smooth and rewarding. Dune: Awakening has solo gameplay, dungeons and raids both co-op and player-vs-player zones.\n\nGameplay & Systems\nIt captures the essence of an MMO with survival mechanics, researching, crafting, roleplaying, guilds, customization, skill trees and armor skins — all seamlessly integrated. Combat is intuitive, fun, and competitive, whether you’re teaming up in co-op or testing your skills in player-vs-player. Even with so many features, the menus remain clean, clear, and easy to navigate, which is a rare achievement. If you have the computer/system for it you get deep shadows, rich colouring, best anti-aliasing, great field of depth, view distance as far as the eye can reach, beautiful effects and post-processing. On top of that there is DLSS frame generation for smooth gameplay without the frame generation caveats you see in other games.\n\nFuture Potential\nCurrently, the adventure is set on Arrakis, but the lore (also in the books) hints at other planets like Caladan, Kaitain, and Giedi Prime etc. The thought of exploring these planets in future updates is thrilling — the possibilities truly feel endless!\n\nCommunity & Accessibility\nConcerns about server populations are addressed with planned server merges, ensuring a vibrant player base. Best of all, there’s no battle pass pressuring you to log in daily; you can enjoy the game at your own pace without fear of missing out.\n\nConcerns\nYes, will there be enough endgame content? However, I read that Funcom is addressing this. Actively thinking about improvements, keeping it fresh and challenging.\n\nDune: Awakening isn’t just another survival RPG — it’s a living, breathing universe that respects its players and its source material. If this is only the beginning, the future of the game looks extraordinary. It's a must play!\n\nI wish all players happy survivaling on Arrakis and don't forget to hydrate!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't really know what to say about Dune because it has everything to be one of the best games ever but... Funcom keeps dropping the ball which is a huge shame :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have over 900 hours in game and have has a blast.  I cannot wait to see more end game content.  If you buy this game you can play solo or in small groups.  It is really best played with a handful of friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First of all - if you’re a fan of Dune - book, movie or both - you’d most likely enjoy this game, unless there is strong aversion to gaming in general and light survival games in particular. In my opinion spirit of this universe was represented almost immaculately.\n\nNow as for various aspects of the game for those who are not fans yet - it’s quite decent game, not Game of The Year material, but definitely not a tie-in trash as many other games made during hype of many, many intellectual properties.\n\nAudio would be easiest to dissect - it’s not Hans Zimmer level, but fits into the atmosphere well, audio tracks don’t awaken an urge to turn them off and sound design is done well, without noticeable issues.\n\nGraphically speaking it’s a good looking game, considering that there was not much freedom in terms of colour and design depiction of Arrakis - desert planet, job was nicely done. World is not ugly and for the most part was made to not be that monotonous. Vehicles, people, weapons and ofc the Maker himself - Shai Hulud are mostly nailed and very impressive to see. In particular worms - giant forever threats are as majestic and dangerous as they should be, seeing humongous one swallowing big spice field is something else. Almost forgot about sandstorms - those are mostly less dangerous compared to worm, but a sight to behold too.\nBut.. nothing is ideal - there are things that could have been done a lot better - some designs are not impressive to say the least and developers slack off on adding new ones or increasing amount of already existing, since game is still in its first year of life after release there should be more stuff introduced variety-wise, but as recent dlc showed, they want to limit it to lowest possible minimum, only giving more after huge public outcry.\nAnd then there are bugs and glitches that you’d encounter a bit too often for my taste, graphical ones are mostly not dangerous, but few of them might kill you unfortunately and death in survival game is never easy to get over.\n\nPlot premise is given in intro cinematic so it’s not a spoiler - you are in one of endless possibilities seen by Muad’Dib, world where Lady Jessica did not go against her orders and gave birth to a girl, so there was no Paul Atreides, Harkonnen were not able to destroy Duke Leto and take over Dune, Sardaukar killed Fremen so general situation is still kinda cold warish. You could pick one of two sides - Harkonnen or Atreides, but don’t expect it to be like Horde and Alliance - there is very little impact on game depending on your choice - it’s pretty much just few quests and pricing of respective house flair. There are several main storylines, none of which are yet finished due to new episodes coming along game life cycle, before DLC there were only 2 parts out with a number of side stories, more are expected to come later too.\n\nGameplay-wise it’s multiplayer survival game that’s pvevp, most things could be kept strictly pve, but for some things, you;d have to venture into pvp areas. Before late game that should not be that big of an issue - pvp places would mostly be without conflict, thought it’d probably depend on particular server you play on. It’s a lot better to play with somebody, and a bunch of endgame things are pretty much impossible without friends or guild. \nSurvival stuff is mostly down to few dangers - thirst, cause it’s desert planet, duh. Sunstrike - same reason. Worms - extreme game of floor is lava, where lava is all the sand on this sand planet, also you lose everything on you or if he also ate vehicle - in your vehicle if worm gets you. Death of other causes lets you recover your corpse. Sand storms could be quite a pain if one is not careful, but are way easier to deal with compared to worm. And radiation that’s limited to few areas but would be very deadly without proper protection. Other stuff might increase your chance of dying, but will not kill you directly - like drum sand or quicksand.\nBesides that - game is third person adventure with light rpg elements. You’d be gathering resources, build bases, killing npcs and clearing enemy strongholds. Ofc since it’s Dune we are talking about spice is also among necessities and getting it is wrought with dangers and every endgame thing requires spice and not a small amount of it. So friend and guilds are essential to do big spice runs with harvesters, carriers and guard ornithopters.\nBut here lies biggest vice i have with the game atm - game breaking bugs that could push you way back in progress. Simplest one - dcs, you could be booted out of the game at any moment, but most of ones encountered were during zone change in deep desert or between deep desert and hagga basin, considering that if you leave game outside of safe zone, your character stays in game for several minutes, there is quite a good chance you might log in to corpse. Vehicle remains where you leave it unless destroyed too. Next on the list - everything is a rock - bug that could randomly happen anytime where you lose ability to interact with anything - your vehicle or base - nothing would appear functional, it’s also bug my first ornithopter loss was caused by, I had to way to get away from worm in the middle of sand plain. Getting same issue while at base it inconvenient, but shutting game completely and running it again should resolve it. Another great bug - being unable to move - only your movement abilities work - like dash or hook, walking, jumping or running is inaccessible - bug that took my most recent ornithopter full of spice and my gear. Getting stuck in textures also happen, which would make you easy worm meal if it happens in the open too - my second flyer was done in by that one. There are other less horrific ones that are quite specific and could be avoided if you’re lucky even when struck by them - like worm spawning directly under your spice gathering place that leaves you with smth like one second to get away from it or textures that failed to load and might cause you to fall through the world.\n\nSo there you have it - game is pretty good and I quite enjoyed it as evident from number of hours spent, but some bugs might throw you into despair after losing so much progress, that’d require sometimes tens of hours to recover.\n\nP.S. if you ever build base, you’d have to log in to keep it up, without paying taxes and refueling generators, power goes out, shield protecting base goes down and sand storms wipe everything in a bit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eh um jogo muito bom, vc se sente no mundo de Duna\r\nPena que a comunidade abandonou o jogo rapido",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An MMO with an enjoyable early and mid game, but dreadful endgame.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dune: Awakening manages to do what so many other survival games fail to do: genuinely surprise the player with fresh mechanics.\n\nI am a long-time player of survival games, and I was getting tired of the same repetitive loop: chop wood, mine stone, build a square base, repeat. Dune breaks free from this mold. The core ideas here—the combination of social conflict, exploration on Arrakis, the terrifying Sandworm threat, and the unique mobility tools (like the Suspensor Belt, which is awesome even if it breaks quickly!)—are all concepts I’ve been searching for in this genre for years.\n\nThe game is not just a coat of Dune paint on an old survival template; it introduces elements that make you rethink how you approach every moment:\n\nThe environment itself (the deep desert) is a constantly looming threat.\n\nThe progression systems feel well-designed and rewarding.\n\nThe blend of sci-fi building with survival strategy is executed brilliantly.\n\n⚠️ A Word of Warning (The Grind):\nYes, be warned: the game is extremely grind-heavy right now. Resources are constantly needed, and the crafting process can feel slow, which is definitely a point the developers need to address.\n\nHOWEVER: For me, this is a minor trade-off. The unique elements and the feeling of actual, consequential danger on Arrakis make the repetitive crafting and resource gathering feel meaningful—it’s worth the effort to unlock the next piece of unique tech.\n\nFinal Thoughts:\nIf you are a survival veteran tired of the same old formula and crave truly fresh ideas and mechanics—not just a new skin—Dune: Awakening is a must-buy. Dive in and feel the risk of walking on the sand again.\n\nShai-Hulud awaits!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "All the Hagga Basin part of the game was amazing, great progression, fun, enjoyable, worth it for this alone.\r\n\r\nI wish the Base Upkeep was a little less punishing, with power and taxes needing to be covered, it's super easy to keep on top of it when you're playing, but it sucks knowing the stuff I built will crumble.\r\n\r\nStill recommended though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At 423 hours played as of this review, I can say that I still enjoy the game, but I don't play nearly as often as the initial weeks of 'every possible waking hour'.  With that said, I didn't rush to end game.  I took my time, explored, progressed through the story carefully and deliberately.  I have completed every quest I can find to complete up until the deep desert and have only briefly explored there - because I don't enjoy PvP (especially broken PvP).  I am currently between duraluminum and plastanium, and probably will leave it there for now.\n\nIf you love Dune or survival games, you'll get many hours of entertainment from it if you're playing for the crafting/building/survival aspect or the story.  You will initially *feel* the relentless danger that is Arrakis, you will fight to survive.  I thoroughly enjoyed the beginnings of it, and I absolutely feel as though I've gotten my money's worth out of it.\n\nEnd game is... problematic.  I don't like PvP, and I don't like that much of the highest tier is locked behind it.  There should be some alternate path for PvE (and now, solo) players.  However, I don't begrudge those who enjoy PvP and I want those people to have that option.\n\nAlso problematic is the auction house / player run economy.  It's in shambles, with a dearth of offerings, and of those appearing many are ridiculously overpriced.  Thankfully the proffered items aren't really necessary for play.\n\nI say solo, above, because that's what it has become unfortunately.  I still maintain my base, as well as my guild base, and the base of a friend, all by myself.  It's been sad seeing all of the bases around mine crumbling to dust and I'm surprised (pleasantly) when I do run across someone else in the open world.  I miss those with whom I used to play.\n\nFinally, the story.  I have enjoyed it, most especially the initial chapter / Fremen storyline.  While I don't really like part of the revealed backstory as the playthrough continued (no spoilers), I can live with it.  What has infuriated me, however, are certain actions taken that are forced, especially one event in particular that I was hoping would be rectified in the most recent chapter but was seemingly reinforced.  I am still hoping for an eventual reunion, but realize it may never come.\n\nI *do* want more story though.  I want the next chapter.  For now, that is what will draw me back into the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you enjoy Conan Exiles you will enjoy Dune.  I played pve and there is a lot of things to do. I would recommend Dune Awakening to others.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Come for the Dune, the survival crafting and building, stay for the storyline, avoid the sandstorm.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An absolutely fantastic single player game up to the end game. Very immersive and fun.  400+ hours for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes, the game has its bugs, and the developers make questionable balance decisions — but it's a co-op survival game based on Dune, with aircraft!\nA game where you can see the worm up close — sometimes closer than you'd like.\nIf you're a fan of the survival genre, this is definitely the game for you.\nBut if gathering resources to build a base bores you, you're unlikely to be impressed by the depth of the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great for building and survival. End game, ends. there is no real loop once you get all the purple build stuff",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is an excellent game if you are playing solo/co-op and if you are into crafting, gathering, base building and survival.  If you are looking for an online experience with pvp...then this is not the game for you.  Take your time and enjoy the game...and probably wait for a sale.  I'm about half way through the game at 40 hours so I'm assuming I will get 80-100 hours for the $30ish dollars I spent on it, not a bad deal honestly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So... if you want a multiplayer game with some survival aspects, you've come to the wrong place.\n\nIf you enjoy a decent survival game with Dune-like aspects, you will probably enjoy this game.\n\nIf 200 hours of survival in a Dune world with a so-so story line sounds good to you, then this game is definitely worth it.\n\nOne major word of warning is that the end-game for this game is rather weak, extremely grind heavy, and full of griefers. But, that doesn't occur until around 200-300 hours in at a normal pace.\n\nIf I ignore the end-game completely this game is recommended. If you are looking for the full game experience, you may want to think about finding it elsewhere.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's so beautiful. It might lack some endgame content, but if you're the type of person who enjoys building bases and flying around a gorgeous map, you'll never be bored.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite a good take on the Dune universe, the core gameplay loop is very engaging until you get to the endgame at which point is a bit repetitive. Solo gameplay is kinda unbalanced, as playing as a group is a quick process of extermination in most cases while the solo experience is a somewhat harder struggle for survival.\n\nI really enjoyed the experience, but hope the devs put a bit ,ore time into making meaningful gameplay improvements and new content rather than just player skins. But they did recently change how you can save your entire base and resources, so you can pick up where you ;eft of after a long time away, so big W there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10: Finally, A Survival Game That Captures the Soul-Crushing Dread of a Broken-Down Prius.\n\nYou are now stranded—10 clicks from the nearest safe zone, with a leviathan circling and nothing but your survival knife, a canteen of water, and the bitter taste of failure.\n\nForget the epic grandeur of the films. Dune: Awakenings doesn't want you to conquer Arrakis; it wants you to understand the existential despair of a 9-to-5 worker whose car broke down ten miles from the office.\n\nThe game's \"beautiful, brutal difficulty\" doesn't kick in with a massive sandworm fight or an intense spice raid. No. The New Goal: A Long Walk Home.\n\nYour new mission isn't to build, or fly, or harvest—it's to survive the commute.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loved the game and ideas, but suddenly there was so many issues with alot of things in pve,pvp and performance of the servers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well worth playing lots to do in the game and the story is good too. The base building in the game is one of my favorite things in game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like Valheim or games like it, and you enjoy the Dune universe this game is right for you! Combat can be a little clunky, not enough of a problem to keep me from playing it. I've mostly played on a friends private server but I would like to see what the player community is like.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you are a fan of the Dune universe or just survival games this game is for you. Devs have made some good changes and updates with community feedback. Exploring the world and making sure you base can withstand the next sand storm is fun. Although as a solo player the end game aka the deep Desert is basically pointless unless you grind 24/7. The story is very barebones though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Brilliant game to play solo.  My first survival / building game but I love all the potential this game has.  600 hours in and still going strong.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wish there was a \"meh\" option between recommend the game and not. I do recommend the game for what it does well: the story is good, flying vehicles are great, graphics are very nice, and, broadly, the games mechanics are intuitive and enjoyable. I spent an insane amount of time base building, no regrets.\n\nThis really stops at the Deep Desert. Frankly, nothing pans out fully in the DD, grouped or solo. You can get your money's worth (especially on sale) playing the core story, building, etc. Once you hit that wall, then you decide if the endgame stuff is worth carrying on for, or not. \n\nFor me, after having done the main story and explored the hell out of Hagga Basin, it's not worth carrying on after. The Devs seem motivated to improve the DD, though, and I'm likely to get back into it later, but only if it does get better. If not, it wasn't bad while it lasted, but it lasted less long than I would have hoped.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has life and longevity, feels true to it's creation. I look forward to more of this world in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dune awakening is a survival PvE game that you can solo or play as a group. I enjoyed taking my time to build my base and work towards my tech upgrades. it was exhilarating unlocking each tech tier and transport as i traversed through the beautiful desert. Before i started this game i thought the environment would look boring and repetitive cos its all sand. but nope i have no idea how they could make environment look so realistic, every area looks different and yet alive. The sunsets are just... breathtaking. \n\nI dont often write reviews but this time i'm compelled to. This game unfortunately gets a vocal minority complaining about how the devs ruined the PvP aspect, and how punishing it is for being complacent or for not logging on frequently (as long as youre not planning to be mia for weeks!). People seem to forget this is a survival game and it's honestly not as punishing as other survival games like rust. They've recently implemented a way to recover your vehicle if it was eaten so at least you dont lose that. \n\nThere's more of us wanting to play PvE than PvP, so i appreciate that they did carve out zones without PvP. Sure the game isn't perfect i had some close encounters where i almost couldnt escape, but i havent found a game out there that is. The devs have been listening and adjusting so i appreciate that <3.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game. Hope the devs continue working hard on this game. The bugs and clunky parts are part of any game, and I believe in the vision that the team behind this game wants to put out. Hope the Dune fans and survival game fans continue supporting this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dune is a thrilling game to play. I love farming for unique schematics and assisting my guild with Landsraad quests each week. I have created two characters following different paths. One is sided with House Atreides while the other is pledged to House Harkonnen. The developers of this game listen to the testers, players, and critics of Dune:Awakening. They update often and work to bring in new features regularly. When I am not playing with friends, I tend to tune into the radio in-game and listen to the worker's station. It offers stories with a 50s style humor. I think it'd be fun to hear it on the radios throughout the Basin as you enter camps or caves because I think it is an underappreciated feature.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun solo or with a group. Has enough content for the price.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Though the end game petered off, I still find myself coming back to minecraft in the Dune universe. Theres something holding me to it, even after getting getting vehicles swallowed by shai-halud.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun and lots of side missions, A bit grindy but the payoff for the grind is worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "About 230 hours into this game.  I missed the first big wave of adoption 4 months ago, so a little late getting to it, but I found the content and role-playing aspects hugely entertaining.   If you are a Dune fan (I am) and you enjoy survival/crafting/base building/PVE and opt-in PVP, this is an incredibly detail-oriented experience.   All of the journeys, with their cut-scenes and narrative-driven advancement through the character growth and leveling up was done with great care and planning and leveling up just became secondary to enjoying the game.   \r\n\r\nI should say that I started playing AFTER the update that provided for a PVE experience in the Deep Desert, so I did not run into the \"Dune enjoyment wall\" that many PVE players reported months ago.  I am enjoying my early expansion to the Deep Desert as a PVE experience.   \r\n\r\nDefinitely recommend this game as a 10/10 for all-things survival/crafting/base building/PVE/PVP.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So many people say this is a bad game. I guess I should stop playing it then?\r\n\r\nReally honours the source material while providing a bunch of clever and thoughtful 'what ifs' in not only the story but with technology and environment.\r\n\r\nThe last couple of hours of the weekly Coriolis Storm is one of the most amazing visual experiences I have ever seen in a game. I would love to see the developers play around with how this rolls through as I feel as though the experience should be more drawn out and less hidden.\r\n\r\nYou'll see so many \"dead game\" reviews and comments all around the internet while ignoring that the average gamer doesn't sink hundreds of hours into most games. I am a hardcore gamer, I have comfortably averaged 30+ hours of this every week since launch... and I am still learning and finding new joy. But plenty will come and smash through a great story and campaign and shelve it for later and that's just fine. Play it how you want to, but don't yell for them to make a different game to what it is because you don't like it.\r\n\r\nYou'll often see bad reviews alongside more than a couple of hundred hours played - is that really a bad experience if you played that much? Most games target somewhere around 50-70 hours on a general 'play through' and this is very much the type of experience where you can go at your own pace.\r\n\r\nExpect a formidable player vs player experience in the Deep Desert and enjoy the challenge. The game has a remarkable balance for ground combat considering the mechanics have barely been touched in the first 5 months since release. There's plenty of improvements to be found but that is in the pursuit of one of the all time great gaming experiences in my view. As it is now it's a great game with sooooo much more potential and as someone who did not pre-order and waited to see if it was actually going to be a worth while purchase, I have since gone back and unlocked the Ultimate Edition as I firmly believe the developers have a long-term vision that will have people coming back year after year.\r\n\r\nI'm itching for more and have absolute confidence that Dune Awakening will live a long and fulfilling life well beyond my own personal 2025 game of the year view.\r\n\r\nSee you out there in the desert!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I still haven't made it to endgame content. In fact, I am still working on getting a thopter. Work life balance keeps we away from the game so that I lose my base and equipment rather often, and that is fine, really. I only recently figured out that I can store vehicle parts in the bank, so now I think I will not have to start over on those (which is a much bigger deal than your base as I see it).\n\n I've played mostly solo, and every time I come back to the game I find it very immersive with engaging combat, and a great story line. There are so many hidden places to explore that feel novel and unexpected. The quest line is great, and the skill progression is awesome. If you are a dad-gamer that just wants to enjoy a great survival game that will give you hundreds of hours of fun, then this game is for you—even if you play alone 90% of the time. \n\nGame inspired me to get back into the Dune saga, and I am on the 5th novel, Heretics of Dune. Herbet was well ahead of his time, and had a lot of wisdom about human shortcomings, patterns, myth making, corruption, learned helplessness, and a lot more. \n\nSo, yeah, maybe someday I will get to all the endgame PVP that everyone seems to be mixed on. I think with this dev team that it will be resolved and more content will keep piling on. Chapter 2 has some lore twists that are off the chain, and remind you of the 10k+ years plus of post ai humanity.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't listen to the negative reviews!  or read them and see that people played the game for 2 to 4 hundred hours!  Then got bored and gave a negative review...... wait what?  This game rocks, yes you get to a point were it stops getting exciting after 2 hundred hours.....  Totally worth the $50... oh wait its on sale now.... now your getting a deal...  Log in and have fun!  More will come!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game is fun and very addictive, For it just being a 50 dollar game and the quality of it almost at times feeling like a triple A game. npcs are brain dead tho and the soundtrack is great i just need more of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of players fled with the changes to encourage PVEers to stay. Houses are crumbling without people there to pay the upkeep.\r\nWe are still having a good time finishing all the quests and venturing out to mine spice, avoiding the worms (mostly - got chewed to bits one time when the cat jumped on my keyboard and stopped me from getting back into my ornithopter).\r\nGetting the ornithopter is a gamechanger - so fun to fly over the worms and see the sandstorms arriving at the horizon. \r\nGreat way to experience the Dune world. Attention to detail is amazing. \r\nRecommend playing with at least one friend - so much more enjoyable to have people to laugh with when the world eats you alive.\r\nEnd game is a bit grindy, but we always find things to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "That the game can be played solo with the advantage to share resources to friends.  That I am not forced into PVP like the game was originally planned.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great pve for a long time, the early game is great. Worth the price - I got 700 hours of play for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a fun game. Visuals are one of the major highlights of this game - between the realistic rock textures and the storm effects, it definitely has the look and feel of a giant desert. Lighting is not only convincing, but also part of the gameplay - don't get caught in direct sun for long periods of time.\n\nCombat is generally good, though sometimes sluggish to respond - specially with blades. You can usually overcome this, but there are times when your character is nearly unresponsive to block or dodge causing you to take damage that you otherwise shouldn't be. Firearms are a different story, they function pretty well. \n\nThe obvious that anyone familiar with Dune in any capacity is familiar with - water. You have to collect water to stay alive and there are multiple ways to do so, though early on you are mostly dependent on the blood of others. The scarcity dwindles once you progress to better equipment, which is a good thing because you can focus on other things to keep the game from becoming TOO monotonous (though these style of games always are in some capacity.)\n\nThe most irritating part of this game - TAXES! This part of the game is a problem. Unless you are playing frequently, you may find this to be enough of an issue to quit playing. You cannot take extended breaks without tearing down your base unless you want to either run out of money, or come back to no base. This is a major flaw in the game and should be changed. I cannot defend this aspect in any way. \n\nSomething else that may deter some players is many parts of this game are quite time consuming - not one where you can just pop in and play for an hour. If you have to travel to far(ish) locations, better have a couple of hours available.\n\nIf you like survival games and are a fan of Dune, you will likely enjoy this title. Beware that it is not exactly kind to players who don't or cannot play several hours per week. I would give it a 6.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far its a fun game but be warned that I have seen coments that say theres no endgame or limited. so far I do enjoy the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Many talk about that they don´t like this game because it is online in some server and may shut down in a distant future. My question is, how long do you want to play this game ? You have one life, don´t waste it on a one thing. I think in this game you start to think that achieving your goals does not mean anything if you don´t enjoy the journey. Same like in life, you never know when it can end.\r\nAbout negatives, I do agree that the tax system is too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game would be so much better if they got rid of like 90% of the unnecessary time sinks. Pointless overworld map travel, long travel times in places like the deep desert, high cost to use what few fast travel methods there are... hell not being able to pay your rent at your base console and instead having to spend 20 minutes running back and forth to a city. It serves no purpose.. its not fun, not immersive. Its just tedious. Like so many games its fun right up until end game and then it becomes a slog. Do I recommend it? When its on sale... yeah. At fill price... honestly... maybe... but it just feels like massive wasted potential and poor game design choices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tons of content to go through in this game.  Looks amazing, sounds are awesome, and it's really scary farming spice in the middle of a desert with a huge ass worm on the prowl looking for lunch ;).  Populations are down as devs work on some improvements and people got bored, but this is absolutely a game that you will get your money's worth and future updates will keep us playing for years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arrakis feels alive.  Survival mechanics are great and addicting.  The atmosphere is top notch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a HUGE Dune fan first of all and this game seems to have all of the elements from the series. I have been wanting a game that I can immerse myself into and this is the game! There are a few bugs that I have stumbled upon already. Like my character getting stuck but there is an option to reset character... so no biggie!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. I do think there needs to be more development around server stability when in the deep desert. Other, than that, It's a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story and combat at my stage of the game, having lots of fun, challenges, lots to do.  well recommended so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun open world play, constant challenges.... overall, very well done",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game would recomend but after my first play my pc had sand in it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good overall, im playing an under spec PC yet it's still running well. It is a bit grindy for new players however you can quickly overcome that, watch out for TAXES! they come up unexpectidly!\r\n\r\nHighly recomend you play with friends, playing this solo is extremely difficult and for the most part, very boring!\r\n\r\nOverall, great so far, keen to see what new DLCs come out, and would love to see more unique building shapes and designs as so far its extremely limited and dull looking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is not an empty au'hommage to Frank Herbert's world. It inhabits it effortlessly. The story is compelling and interesting. The survival system makes sense. You can play this game at a good pace without racing through content. It is my hope that Funcom does not treat this game the same way it treated The Secret World, which was compelling and interesting, but did not receive the love and support it needed. With an upcoming update sometime in December 2025, there will be more story for advanced players to play. Finally, the atmosphere feels very gritty like the novels. There are no heroes here, the protagonists in this universe are selfish and flawed, much like Herbert's novels (Both Father and son). Deserving of some award love. Congratulations to the design team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love DUNE series from the 2001 strategy game, and now a character living inside this excited world. Funcom carried the DUNE soul very best way to feel!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game, still sometimes bit buggy. end game content needs to be better. its work in progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with friends. I'm usually bored with survival-crafting games, but I enjoy this one. It could be because I'm a Dune fan.\n\nWith that said, I always seem to get the occasional lag spike, though. In addition, I wish they would add a bit more content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, it's good. Not perfect, but definitely good. I'm not a Dune fan, also I'm not a \"craft-your-stuff-from-sticks&stones-to-space-age-stuff\" fan, but somehow it all worked out pretty nice for me. Sometimes it's hard, but it's not hardcore. It might seem really slow-paced in the beginning, grinding resources at the start feels kinda slow and exhausting. also travelling is a pain in the ass, but it all speeds up pretty fast just a tiny bit later.\n\nGraphics.\nIt's beatufil. Not a masterpiece, but it's definitely fascinating. I like the tech design, the world itself. It looks really good. A separate \"thumbs up\" for the first Harkonnen character that I met (don't remember the name, but he's on the second trade post) - he looks almost identical to my city mayor Vitaliy Klitschko, which made me burst out laughing.\n\nBugs.\nSomehow friend I play with doesn't see any, but I encounter a plenty: going through textures, randomly bouncing off walls, stucking between stuff, etc. But nothing you won't see in any other online game, so it's not catastrophic. Got several \"Talk to X\" contracts, but those characters don't have any dialogue option except for \"goodbye\". 1 of those issues dissolved by just restarting the game, several are still there. Also can't complete \"buried treasure\" due to treasures spawning only in the middle of the flour sand, and my compactor can't retrieve anything except for that sand.\n\nStory.\nI feel like the story lacks depth a bit (so far), but it's an online multiplayer game, so it's fine. It's the usual \"fetch-kill\" formula with no forced stealth\\time garbage (so far, and I hope it's not there) under the sauce of simple lore-inspired dialogues to give you perspective on the Dune world. Nothing special, but it inspired me to rewatch the 2000's movie. Also it feels like choosing your background just adds some extra lines to dialogues which affect nothing, which is kinda disenchanting, \n\nBonus:\nI had an issue when after playing demo and purchasing the full version I couldn't find my char, and it took support like 15-20 minutes to answer. I repeat: not a week, not a day, not even an hour. 15-20 minutes. I'm still amazed tbh.\n\nWhat do I miss?\nSome explanations. \"Bring me 4 guns\" - ok, simple quest, but the same guns crafted in fabricator and by hand turn out to be different guns (although they are absolutely the same). Only hand-crafted are accepted (there weren't any warnings about that), so here I go back and forth several kilometers.\nSome directions to resources. You could have chosen to give some hints through notes, lore objects, dialogues, yet you've just chosen not to. I hate to Google stuff, but I have to - otherwise I risk ending up in the middle of nowhere, finding stuff i'm tens of hours away from farming due to my tools being lower-tier. \n\nOverall I'd say it's a solid 7\\10 experience for a reasonable price. It's good looking, it's quite entertaining, it performs ok most of the time, and the most important of all - it's fun. Will continue playing and totally recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has its issues but the exploration, survival aspects, and atmosphere are second to none. And the shared world/end-game PVP is innovative. Needs improvement but highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay loop. Unforgiving like the desert and loads of sandworms ready to eat you and your ornitopher whole. Better with friends, but fun solo as well, yet more punishing towards solo players. End game is pvp, sadly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed building!  I did not enjoy having to fight pvp for spice.  The stories are good :)  I love the different factions.\r\n\r\n I do recommend this game, for a time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lacking in terms of AI, they're really simple minded. Other than that though, good up until you have to go to Deep Desert. Once you reach Deep Desert in late game, the amount of materials you need is phenomenal to build anything, and unless you have lots of people to play with and fight against, then it's kinda boring. I recommend the game nonetheless. I HATE BLADE NPCS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the game (ended up playing as a solo player, but unfortunately never got to the late game game loop)\nThe story was quite good, and exploration was a lot of fun, just wish getting the rare schematics worked a bit different as by the time you complete a set, you've already level up beyond that level of gear. The skills are interesting and each class has its own playstyle, though this is circumvented by levelling high enough to unlock all the classes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't have any expectations and I've had a good time solo levelling and working through the quests. I don't like PVP in any game so I haven't even bothered to explore that side of things.\n\nIt's not perfect, but it's immersive and the soundtrack is spectacular.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Audio environment and storyline are awesome. it's been a while since I enjoyed a game this much. early and mid game very engaging although end game still needs definition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, still enjoy playing after 125 hours, especially the base building, just a shame the servers are so light on players, hopefully with the server migrations in the future updates will make the game feel more populated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game if you like The books and like building both bluildings and equipment.  Though I personaly use it as solo game and play it in a slow and chill maner which might not be how the developers intended but it is how I enjoy it ^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've played with friends in a long time. Mirrors the movies pretty well. Visuals and the gameplay are amazing. my new favorite game at the moment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it but it's only really great if you play with other people. Not much of a solo game, I mean you can play solo but after about 100 hrs you've pretty much done everything. I really, really love Dune though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good gameplay\ncool soundtrack\nnice visuals\nworth giving it a try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an amazing game with not only a great story that adheres to the lore but has great game mechanics that makes playing and traversing around fun. The only downside is that you can neither domesticate nor pet the worms but still a game worth buying.\n\nFriends to play with are not mandatory but are otherwise advised.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game the environment is awesome looking, and i like the resource gathering and tier system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Dune game, unfortunetly it's dead due to lack of content in the end game. Hopefully this will change in the future. I also recommend you to build a huge mega base just for the fun of it, The base building is awsome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Very redundant but still adictive, at least until you reach engame content. Best base building. Looking forward to the next big patch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice blend of open world RPG and survival game. Can't say alot about the pvp element, cause I've been playing it on a private server, but one still has alot to do between the survival grind and the rpg-like quests to keep you occupied for hours. The tech-leveling is mostly based on the exploration of the map, and not bound to the quest-system, so you can level quite a bit before tackling the quests, which makes them easier, but still interesting.\r\nThe only negative I have with this game is, that aside from fetch this/kill that npc type quests there are not  alot of riddle-type ones.\r\nStill the story quests are very athmospheric and the game manages to capture the Dune feeling!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly graphics are awesome, Game-play is survival action and crafting with tons of variation. Story so far is engrossing. If you like a good grind that makes sense within the story this game is perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the type of game that is very well suited for someone that wants a bit of a challenge while also relaxing. Some of the content can get a bit repetitive but with future updates and additional content it can be a game that everyone would like to play more. There is currently plenty of content to play but with all the bugs that are causing issues with gameplay the amount of players has decreased severely and has left a lot of servers empty and players so spread out that you don't see anyone to play with. I hope with future updates and content we can see a revival in the player base and the community will grow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "902 hrs at the time of post.  Story is amazing with more to come.  The endgame is sluggish and at times boring but if you are in a active guild then it can get fun doing the Landsraad and other things in the Deep Desert.  End game is more about PvP and resource gathering.  Though there is 1/2 the deep desert that is PvE with clearly marked PvP areas.  Really PvP is your choice and with choice comes the either reward or lack of highest tier loot.  Yes, there are trolls and chaos mongers but that is with online game.  The game is on the right track as far as content and making life easier as far as end game.  Only thing that concerns me is the ability to make money after.  There are no micro transactions which is nice but that means no money coming in after initial purchases.  There are things they could do that would truly be the players choice to buy or not.  House skins for fabricators and refiners would be nice to help your base come together would be awesome.  Overall it is a great game with signs of improving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is good but needs to expanse to other worlds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good survival if you like the Dune series. Great game to play with many friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was solid upon release, with the visuals and game play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Atmospheric one. Truly Arrakis vibe.\nThe sandstorms, the stillsuits, even the silence between dunes — it all captures that authentic Arrakis essence from Herbert's books. You can almost smell the spice in the air, with survival mechanics like dew-gathering pulled straight from the lore's details. As a longtime fan, it's thrilling to live those themes of ecology, power struggles, and desert peril without retreading the exact book plot. And greetings from \"Dead Orbit\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is amazing and fun with friends! However, once they started doing updates and completely changed the endgame it killed the momentum the game had. The hours put into the game before the initial updates and changes were full of love and fun. i have not played the game in 5 months as of this review time. Very innovated game and game play but unless they go back to what made the game fun in the beginning i don't care to play at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although this game has gotten a bad rep for PVP being somewhat killed off and killing the game a bit... I can for sure say i still love it either way. Everything from the visuals to the fighting is fantastic. P.S. this game is very grindy so i recommend you have a few friends or a really good grindy friend if you wanna get through the end game stuff with any kind of short time frame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game for fans of crafting and survival games as well as fans of Frank Herbert's Dune.  Multiplayer is amazing, the crafting and gathering system is great, combat is amazing.  A challenging achievement hunt as well as an overall great game experience.  Thumbs up high recommend.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Play Time: 475.3 hours\nThe theme of the game is fantastic.\nThe story is excellent.\nHowever, turning something so beautiful into this mess is a real skill in ruining things; it’s the answer to how you can take something that started well and make it terrible.\n\nAs a working adult, my most valuable asset is time. If a game can take away everything you’ve worked on for months in a single mistake, you cannot hide behind the excuse of “This is a Survival game”.\n\nWhat does this mean? You work, you get tired, then you log into the game to relax. With your already tired mind, you make a tiny mistake, and the game punishes you by taking away months of effort. No, no one has the right to punish a working player like this. I paid for the game; I didn’t pay to have all my work taken away because of a single mistake. My time is worth more than the $50 I spent on this game.\n\nWhen the game first launched, the player count was very high, even requiring long waits to enter servers. But the disappointment was so quick that within a month, the game lost approximately 90% of its players.\n\nStructural bugs, logical errors, in-game glitches, and exploits allowed some players to advance unfairly, causing this massive player loss.\n\nThe excuse the developers hide behind is: “This is an Open-World Survival RPC game.”\nYes, I love this genre. But taking away everything I built over months in a single mistake and calling it a “Survival game” is pure nonsense. I have been a gamer for 35 years, I am 52 years old, and I have played many games in this genre. None of them punished players this severely. No other game has ever wiped 475 hours and 4 months of work with one mistake.\n\nThe game’s actual type isn’t survival—it’s regain what you lost.\n\n95% of players play games to progress, to improve, and to test themselves at the highest levels. They want to develop strategies and diversify their skills. In this game, however: do your best → make a mistake → lose everything → rebuild if you still have the strength.\nSpend your hours, days, months; make one mistake, lose it all, start over. No, this is not survival; it’s punishing players because the developers cannot provide meaningful progression. This is for people who enjoy pain—if you are masochistic and enjoy self-inflicted challenges, this game is perfect for you.\n\nBut if you are a working adult, with limited free time, who comes home to enjoy the game, one small mistake wipes everything you’ve done, and you lose not just the game, but all your motivation and enthusiasm. And this is called “survival”? No, the developers misunderstand the concept entirely.\n\nPlayers who are lost this way cannot even be partially recovered. After this failure, the next release will be met with skepticism from players. I have added all FUNCOM games to my blacklist, and I will recommend all my gamer friends to avoid them. I recommend the same to you: do not play, do not let others play, do not recommend, and do not be complicit in harming others.\n\nUltimately, if you compare the number of players motivated to rebuild what they lost versus those who will simply quit, the majority will not be willing to redo everything. This means the game targets not the general or majority audience, but a small group that enjoys suffering, is masochistic, and has an abundance of cheap time.",
      "voted_up": false,
      "votes_helpful": 187
    },
    {
      "review": "PVP is janky, and you lose your entire base and all your stuff if you don't log in. No thanks; I'll just quit and never play again.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "In less than 5 weeks after launch the player base tanked hard many due to not doing their homework on how toxic pvp funcom games are.   Now 93% of the player base is gone and the players that are left are mostly the cheaters and major pve'ers.   The total lack of any kind or support across the board is not helpful either.  If this game makes it to consoled PLEASE do your homework on this game before more time and money is wasted by the community.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Do not buy this game. Funcom are incompetent and will blame you for performance issues cooked into their own game. \n1. Duping bugs on day 1 that made progression for normal players impossible\n2. Dont want to lose gear to PVP? Well how about you lose everything going across server boundaries instead!\n3. Oh our server crashed and you were midair? Hope you like being sandworm food when you log in and servers are still jittering.\n4. The entire design to keep players active by threatening to destroy their entire base and item investment. Artificually inflating player numbers \n5. Developers make fake posts acting like regular players trying to sway public oppinion- then get banned from the discussion board when you point out that person is a confirmed dev.\n\nFUCK FUNCOM.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "After being gone for a three week trip my whole base is gone, even thought I made sure to pay the taxes and refuel the shields. Not going to bother rebuilding everything up and finishing the game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I was super excited for this, ended up refunding it a whole back and have been keeping an eye on it ever since hope they create a single player mode. I was really hoping for a Conan exiles style game with online servers but the option to play solo and change setting accordingly. From what I've read it seems I was right to be worried, everyone seem to pretty universally hate the PvP. Personally I think the survival crafting genre just doesn't lend itself well to PvP generally speaking. You hear the same complaints in games like Rust and Ark where PvP is fun if you have a private server with friends or you just manage to find a open server that's well moderated, other wise it's just a greifing fest. Not to mention most of the game is created around pve except for the end game. It was a balancing nightmare from the start.\n\nIf they manage to fix this somehow I'll repurchase it, but in order to do that they need to awknowledge their mistake not try and fix a system that was never gonna work anyway.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "With the Steamawards i feel like it is time to write a review. This is not a bad game. I would say, at the time of this writing, it has about 100 to 150 hours worth of single player content. More, if you like base building or are a completionist.\r\n\r\nSo… why don’t I recommend the game?\r\n\r\nI don’t recommend the game because it doesn’t feel very “Dune”. The premise of the game is an alternate reality. Paul never was born, his mother gave birth to a girl as she was supposed to. This results in her Jessica getting more training by the BG and in the end able to discover the plot against the Artreides. This resulting in a new “war on arrakis” and the eradication of the Fremen. Why? Who the F knows. Centuries nobody cared about the Fremen being around, suddenly the Imperator decides to eradicate them and with them the very thing why I am coming to play this game.\r\n\r\nI didn’t come to ride around on a bike, drive a buggy, or float around the sky with my repulsor field. I came to wear a Stilsuit, survive the desert and go “native”. And… you can’t. The game virtually forces you to join a house and a guild. Sure, you can create a Guild of 1.. But you need to be in a guild to take part in the Landsraat and get its cosmetic and gear rewards. And the Guild you join needs to ally with either Artreides or Harkonnen. That is not what i came for. I didn’t come to play Dune to wear a heavy armor and run around with a shotgun, shooting at people ziplining through the air as if this was “Lawbreakers”. A game that failed for a reason.\r\n\r\nThe PvP in this game isn’t enjoyable and only compounded by the fact that the Talent Trees, despite having absolute freedom to build a build, has no variety. There are like one and a half viable builds. Maybe 4 abilities worth using in the end game.\r\n\r\nBut that isn’t an issue, because there is no end game. Everything you need to do Single Player you get in Hagga Basin. There is no need to go to the deep desert. You go to the deep desert to get the gear, tech and equipment to play PvP in the deep desert. But there is nothing permanent in the Deep Desert. Its an empty square in which spice fields spawn. Spice fields you only really need to get the gear to do PvP.\r\n\r\nProblem with PvP? I mean aside of the lack of variety and the boring combat system… Each tier is about 25% stronger than the previous Tier and “Uniques”, which you grind for, are somewhere between 0,5 to ,75 to the next tier. So a Tier 6 armor and weapon is 25% better than a Tier 5 one. And a Tier 6 Unique is 15-20% stronger than a Tier 6 common. This means, if you do not have the best of the best, you can be certain to fight with a disadvantage.\r\n\r\nSo, while the early hours of the game absolutely gave me what I came for… Desert Survival…it gradually stripped away everything that felt like Dune and gradually turned it into Generic Syfy shooter with a Dune veneer. An a thin one at that.\r\n\r\nThe fact that the story isn’t done isn’t helpful either. I can’t even recommend the game as a single player, because you barely have the Prologue to play. Maybe in 2 years this game will be worth recommending and unfortunately I am aware that a recommendation, or lack there of, like this is very much a risk that this game never gets the rest of the story.\r\n\r\nMaybe in 2 years we’ll actually get to go native. But for the moment? For the moment, it starts strong and then quickly turns into generic Syfy, where you ride around in your vehicle and the worm is more a tedious nuisance than atmospheric encounter.\r\n\r\nAs it stands, I can't recommend this game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Let me get this out of the way to start with: The game is seriously flawed and I do not recommend it at this time under the marketing description. \r\n\r\nThe pros: I enjoyed the hell out of this game--it's such a fantastic world to delve into. There is tremendous--and I mean TREMENDOUS potential here. I haven't experienced such awe since the first days of World of Warcraft. Base-building (as so many have pointed out) is amazing. The survival elements are fun. The combat is constantly tweaked, so sometimes it's amazing and... we'll leave that for the negatives. The vehicles are all interesting and (at different stages) all useful. There story is solid and interesting. There's a lurking mystery behind everything. Dune is such a rich world in which to develop a game.\r\n\r\nThe cons: end-game is lacking. That is a common complaint. Fixable. I hold out hope. Combat is tweaked without reflection (or perhaps without intent) such that, for example, melee combat has been nerfed into the dirt. This is a systemic failure. Along the same lines, patches are half-baked. A lot of good stuff is added with each major patch, but hot fixes are too common. That brings me to my main complaint: if you play at the wrong times of day, expect server shutdowns VERY frequently for hotfixes. I've found myself, lately, not being able to play the game because they are hotfixing every night, cutting 2-3 hours out of my available playtime. This is another systemic failure. Patches should be thoroughly tested for things like... resource nodes being totally screwed up. NPC combatants being vastly overpowered (relative to build) to the point where solo play in the late game is whittled down to a handful of very specific builds which are ever-changing because they're ever-screwing-up the balance in massive ways, etc.\r\n\r\nThere is a ton of potential here. A very good core game ruined by development SLOP. Get your **** together, Funcom. The recipe is there. JUST. FOLLOW. IT. You want money? You got it. JUST. DO. BETTER.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The long and short of it: This game needed another 2-3 years of dev time. You're paying full price to play an Early Access game. \n\nHagga Basin. The main PVE zone you start in is pretty decent, albeit the points of interests are too copy/pasted.\nThe story quests are incomplete. They just end abruptly. \n\nThe worms, while appropriate for the Lore, ultimately shrink Hagga Basin even smaller than it already is and forces everyone to build on hills, cliffs, pathways, and resource spawn points. \n\nThe crafting tech tree is very basic. Not even half as fleshed out as Conan Exiles. You're basically crafting the same stuff from tier 1 to 6 but with higher stats.\n\nThe way the tech tree and resource gathering works makes 2/3 of Hagga Basin obsolete. Which tends to herd the player base to build in the same general areas, Making Arrakis look more like a city rather than a harsh desert. \n\nMuch of the resource gathering requires engaging in combat. The combat in this game is simply terrible.\n\nThe Deep Desert. This game's alleged end game. It's pretty obvious they just duct tapped this into the game last minute. They did very little if any testing to make sure the systems worked as intended or if it was even fun to play. \n\nIts more of the same except now you're in an empty, featureless desert far bigger than it needs to be. So you end up flying around for 20 minutes hoping to find anything.\n\nThe real cherry on top is the DD was an entire pvp zone. So if you wanted to engage in \"end game\" content, you had to do it while under threat of being harassed by other players. A complete FFA zone. Including guild members and same faction players. They created the best ganking and griefing environment in any modern video game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Unfair and frustrating PvP completely ruins what could have been a great game. Here is why I strongly advise others to stay away:\n\n[b]Broken PvP system[/b]: Groups of T6 players hunt solos just for fun, not for loot or resources. It is neither competitive nor skill-based. Just organized bullying.\n\n[b]Severe death penalties[/b]: After investing hours to reach T5 and build an ornithopter, I was instantly killed and lost everything. The grind to recover is exhausting and discouraging.\n\n[b]No proper group support[/b]: Funcom claims players should group up, yet there is no group finder or matchmaking system. Solo players are left stranded and easy prey.\n\n[b]Toxic community behavior[/b]: Many players in DD chat brag about killing others simply to stop their progress. The game seems to encourage griefing rather than fair competition.\n\n[b]Unbalanced gameplay[/b]: There is no way for less experienced or solo players to stand a chance against geared, organized zergs.\n\nI truly enjoyed the first area in Haga Basin, but the experience in Deep Desert destroyed that feeling. It left me frustrated and disappointed, even resentful toward the developers. For your own sanity, avoid this game, especially if you value the Dune universe.\n\nUpdate based on recent news from devs:\nNow that most of the player base has left, the game has ironically become a bit more playable. With fewer zergs around, solo players can finally progress toward T6. But instead of learning from this, Funcom plans to merge servers, threatening to bring back the same chaos and toxicity that drove players away in the first place. [u] It is almost unbelievable: they are about to destroy the only small improvement the game has seen. [/u]",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The summary of my review would be that there are a ton of really good ideas here but the game is insanely buggy and laggy and a lot of the penalties are too high to make sense. I know I have a lot of time in the game, partially because it requires a lot of time and partially because I try to 100% every game I play, but I genuinely don't recommend that someone else spends their money on the game. There are plenty of other games more worth your hard earned money.\n\nA little more detail on those:\n[list]\n[*] Firstly, the game is set in the Dune universe. The Dune universe is amazing, so the game definately has that going for it.\n[*] Secondly, in some ways, the developer was pretty ambitious, for an MMO. The game has a very interesting story, it sports modular construction nearly anywhere, it allows a nearly full open world with very few load screen transitions, it has vehicle building and customization, including flying vehicles, and it includes a very skill-based melee combat system.\n[*] Unfortunately, these things are only ambitious for an MMO. If the game was a single player game, they would all be fairly standard.\n[*] And I am not sure why it is an MMO. I guess so that you can be surrounded by the ruins of buildings built by people who joined the game then left. Besides that, there is no need for any interaction with other players.\n[*] After several hundred hours, when you reach end-game the game randomly forces in a PvP element, which is very strange after playing the game PvE that entire time. I am sure some PvP fans are glad it is there, but most players obviously just felt it was unnecessary and didn't play it and left the game.\n[*] All that aside, the fact that the game is online kills it. Their servers are the worst I have ever seen in a AAA game. The server literally lags out, fully link-dead, every 20 mins or so, before recovering. It is genuinely an unacceptable issue, especially when deaths are so punishing.\n[*] Things like a skill-based melee combat system are a good idea, but when the game lags out or just bugs out constantly, it is extremely frustrating.\n[*] I am sure they will have another free weekend where the servers will be much better, but it is a bait and switch. If you pay for the game, when the weekend ends, they will go back to being garbage.\n[*] Besides just needing a patch, the game would hugely benefit from being converted to single player and giving us the option of private servers to play with our friends or public servers for PvP lovers, like every other survival crafter out there.\n[*] The next thing worth mentioning is the worm. This is the single worst mechanic I have ever seen in a game. I genuinely believe that the majority of players that left probably did it after a worm encounter. In a game with an insane amount of grinding (MMO mentality), if you get killed by the worm, you lose everything. Your loot, your gear, your vehicle, its insane and unnecessary. Also, the worm doesn't have consistent mechanics. It will teach you that there is a meter showing how interested and/or far away the worm is, but sometimes it will just pop up 5 meters away from you. Also the game is buggy and laggy, as mentioned. So you can genuinely lose everything and it isn't even your fault. Very bad design decision.\n[*] Last thing to mention is that you can't stop playing. The game is like a mobile game, if you take a single week off for real life stuff (family, friends, work), then they destroy your house and everything in it. I can't even fathom how dumb this decision was.\n[/list]\nNothing else worth saying. The player numbers speak for themselves. There is a reason they lost 85% of the playerbase in only a couple months.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Second time i lost all my work because i had to do real life stuff and forgot to fill it with fuel. \r\nI give up. If the game want to be work, then they should pay me to do it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Firstly, I have been playing this game for 1,000 hours. I have extensive gaming experience, and let me tell you, my opinion is that of a seasoned veteran.\r\n\r\nAfter months of waiting and engaging with the community — and the sad excuse for content the game now provides — my verdict, despite my best hopes for its survival and success, is that it is a CASH GRAB. Luring you in with the DUNE IP and promises not kept, only for it to grow worse with time as the creative direction and devs hack at it. AVOID AT ALL COSTS.\r\n\r\nThis game has gotten WORSE, not better, with every update. I am not talking about bugs, by the way. I am talking about game direction and design decisions made after release, which have turned this game into a bubble-wrapped farming simulator, devoid of players on even the most “populated” servers.\r\n\r\nIf you purchase the game, your experience will be: farm simulator > finally get to the deep desert > realize there are no people to fight or anything fun to do > realize it’s just a flight/farm simulator in the deep desert as well > get bored when you realize there is no endgame and leave, but be down the cost of the game.\r\n\r\nPersonally, I want an apology from those that ran this game from space right into the fucking sand hard enough to make Anakin Skywalker cringe. And I want to demand they give me a refund for the game + extra cash for wasting my precious time.\r\n\r\nMaking a product worse after release deserves a fucking trophy for “crash and burn achievement” that honestly is almost awe-inspiring.\r\n\r\nNow, for those of you pondering buying the game. My advice: DON’T. Stay away. You don’t need specifics.\r\n\r\nBut for those of you that need specifics to justify my review for whatever reason, very well — allow me to give you my justifications.\r\n\r\nFirstly, when this game was released, after grinding for a bit in a PvE environment (which was unique and fun but tedious and boring after a while), you would eventually get to the deep desert, which was supposed to be an endgame of sorts for everyone, but mostly for PvP players. And the population of the game mostly consisted of these players. \r\n\r\nThe deep desert consisted of amazingly fun ground-based melee and ranged PvP, as well as amazingly fun aerial combat and vehicle warfare. It was amazing.\r\n\r\nNow there was no real endgame aside from content the players would make themselves. But there were incentives that would lure players to certain areas and the gameplay was amazingly fun. With some help this game would have had an amazing endgame.\r\n\r\nBut everything changed when the 3-stooges game designers attacked.\r\n\r\n1) The game designers, in their infinite wisdom (or lack thereof), decided that in order to solve griefing, they would simply patch out of existence the viability of vehicle warfare — which hilariously did not solve griefing in any way, shape, or form. But it did essentially delete an enormously fun part of the game for a large portion of the player base. And well, those people who enjoyed ace-combat-style aerial PvP left. I personally saw entire guilds shrivel up and leave the game that were devoted to that content — some of which were people I played with. Genius game designers, patching their way through their game’s population.\r\n\r\nBut wait, there’s more.\r\n\r\n2) In the current PvP balance meta, ranged dominates to an absurd degree. However, melee combat was still barely viable for PvP in the past. But the game designers, again in their infinite wisdom, decided they would nerf the single skill that made melee viable (IN A FUCKING DUNE GAME — A UNIVERSE WHERE GUNS ARE CONSIDERED OBSOLETE!). This resulted in almost the entire melee PvP community, as well as most people faithful to the Dune lore who wanted to engage in PvP, vanishing over the course of a few weeks. Again, I knew some of those players. More population lost... amazing.\r\n\r\nThere were several other changes made — small nails in the coffin — that caused the game to bleed players more and more:\r\n\r\n3) Making the DD half-PvE. This watering down of the DD to cater to PvErs was not particularly bad. but increasing the flight time and the lack of danger of the DD robed that content of the thrill that it originally had. it also made it annoying having to fly for 5 minutes just to get to the place where you COULD find pvp. \r\n\r\n3) Making loot random so ground PvP players don’t have anything to fight over and no locations that would attract players into fights turning the DD into a flight simulator looking for players for pvp that became harder and harder to find until even the biggest servers such as harmony became ghost towns.\r\n\r\n4) Patching a repair glitch. To give context: the game has massive durability-loss penalties for dying. This is a disincentive to engage in PvP (THEIR CONTENT! FFS). The community has asked for the removal of death-based durability loss SINCE FOREVER, but the game designers are apparently deaf. So when they patched a repair glitch, a huge portion of the game’s PvP community left because no one wants to grind for hard-to-replace gear just so they can enjoy the content they enjoy.\r\nI think half the PvP community left because of this “fix.” Good job.\r\nIts hilarious to think how much the population of the game would still exist if they just deleted death based durability loss. baffling really.\r\n\r\nThe game designers are much like stooges trying to solve issues but only making the game massively worse in the process, without even fixing the problems they tried to fix! haha. What makes this even more hilarious is that there have been perfectly good solutions given to the game designers, but those solutions have been ignored and in some cases deleted from their discord and reddit for embarrassing the game designers\r\n\r\nThey do not listen to their community as they destroy their game, while deleting posts on their Discord and Reddit that criticize their game direction and give perfect solutions to solve the game’s problems and get the population to return.\r\n\r\nAnd when they do listen to their community, they only listen to their farming-simulator PvE community (which I suspect the game designers are largely part of) — just enough to destroy the endgame for everyone.\r\n\r\nAll the PvPers have left. All the PvErs that would support the PvPers have left.\r\n\r\nAll the PvErs that play for gear grind — the ones the developers dumbed the game down for so they could achieve the endgame loot without having to work for it — have now also left.\r\n\r\nThe fact that the very community the game designers catered to, at the expense of everyone else, has left the game is absolutely priceless.\r\n\r\nAll that remains are the few PvErs that enjoy their Dune-themed single-player creative Minecraft world. \r\n\r\nThere is no content for anyone else.\r\n\r\nThe game designers have deleted it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I was having SOOOO much fun with this game. I loved everything about it.\nIt scratched that Sci-Fi itch while also providing all of the survival fun I'd been missing from the old days of DayZ.\n(Not to mention its Dune!)\nSo you might be wondering then why I don't recommend it. It truly did provide many hours of fun for me.\n\nHere's the deal: \nI had to work a pretty gnarly stretch of overtime at work. I went from playing a little daily to having to adult consistently for a few weeks. As someone with a fairly full schedule I simply had to push it aside.\n\nWell..... you can't do that with Dune. All of my stuff, all of my time, all of my hours...... gone.\n\n I played solo. So that meant if I forgot to log on every few days, and toss some more fuel in my generator, then my base and everything in it would be deleted. Well, life doesn't always allow for the luxury of free time. \n\nLong story short:\nI lost everything and uninstalled the game. I just can't sink that amount of time in and be forced to start over. Rather, I should say, I won't do that. \n\nGoodbye Dune, it was fun while it lasted.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dont take any long period of time from this game otherwise everything will disappear and be lost forever this is the nature of the game but forcing players to log in every 20 days to fuel a gen and pay tax is an annoyance... this might be fine for some people but just thought it important to put this incase people forget (The Devs cant reimburse anything)",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Hours played: Enough to realize sand is the only thing that works properly.\n\nSo apparently the best way to “play” Dune: Awakening is… not to play it. Just open Twitch, watch a streamer who thinks “Arrakis” is a new energy drink, and collect skins like you’re farming spice. Meanwhile, the actual players — you know, the ones who understand mechanics beyond “press W to walk” — get rewarded with… more sandstorms.\n\nThe hype machine is glorious though. Streamers scream “THIS GAME IS THE FUTURE!” while fumbling through menus like they’re trying to decode the Bene Gesserit. And the devs? They nod, hand out exclusive cosmetics to viewers, and forget that the people actually grinding in‑game might want recognition too.\n\nGameplay itself? Somewhere between survival crafting and “how many times can you die of thirst before uninstalling.” The desert looks gorgeous, but beauty doesn’t stop the feeling that you’re beta‑testing a Twitch integration experiment instead of a game.\n\nPros:\n- Sand. Lots of sand. Very realistic.\n- Worms are majestic and terrifying.\n- You can roleplay as “Guy Who Watched 10 Hours of Streamer Confusion” and still get rewarded.\n\nCons:\n- Streamer hype > player effort.\n- Skins locked behind watching people who don’t know the controls.\n- Actual mechanics feel buried deeper than spice under dunes.\n\nFinal Verdict: Dune: Awakening isn’t a game, it’s a social experiment: “How long will players tolerate being second‑class citizens while stream viewers get showered in loot?” Spoiler: not long.\n\n⭐ Rating: 2/10 - one star for the worms, one star for the memes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Nothing more fun than your game crashing in the middle of moving bases, only to log back in butt-naked with a cute little \"Sandworm got all your stuff - ALL of it\" prompt. SO fun when days of progress evaporates because your game isn't stable. Definitely my fault.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really really fun game but God forbid you want to play anything else. You go a week without logging in and your base if falling apart. I'm a grown man with a life and responsibilities and a job and I don't need another job babysitting my base cause the developers want this survival game to feel like an MMO. The only ways it feels like an mmo are in the annoying nagging ways and that's not good. Unless you are fine never being allowed to take a break from this game then I recommend it highly. It's super fun. With the way the developers have the game now it's a chore plain and simple to make sure you log in and go pay your stupid damn taxes (what a shitty idea honestly).\n\nTL:DR This game has 0 respect for your time at all. A great game marred by a few REALLY bad ideas that honestly make the game impossible to recommend in the long term. If you like playing other games and go longer then a week without playing this game your base will be falling apart or gone along with all your vehicles. Unless you don't care about your base falling apart then I would stay away. If they ever fix that I would recommend this game in a heartbeat.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really wanted to like Dune: Awakening, but it’s been a disappointment. The world looks great and most of the mechanics are fine, but the overall gameplay and the survival mechanics feel clunky and unfinished. \nThe survival mechanics are tedious rather than engaging, and the whole game feels like a constant grind for resources just to unlock the next set of resources; if you grind copper, iron or aluminium, it is always the same and\n does not feel any different.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Extremely buggy.  Crashes mid combat lead to death. Game play loop is fun but the instability kills enjoyment.  Tried all suggested fixes such as updating bios, lowering settings, ect. Unplayable in its current state. My hardware is not the issue. My rig exceeds all recommended requirements.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So, I've put in a lot of time on this game, and while very good at what it does I would never recommend  a game where the developers HATE players and the game that they've made.  It's the only thing I can say when massive changes are deployed without any consideration to the players.  I would also say that the game itself doesn't react friendly with newer hardware.  The amount of tweaks I've had to make to my system to make it even playable is beyond what I would have done for any other game.  \r\n\r\nLook, make your own decision as to play or not, but seriously.....DON'T WASTE YOUR TIME HERE.  FunCRAP doesn't care if you play it or not.  Personally, I think they're tanking the game so they can write it off.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i was so addicted to this game. I had a beautiful base and a lot of vehicles. I put all my stuff in storage because i knew i needed to take a little hiatus from the game and didnt think all my stuff would disappear because when i was playing it i saw people abandon their bases and they would stand for weeks and could not be looted. Well I just logged in and everything is gone. F**k this game im out",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's not a bad game but it feels kike someone stuck a mmo onto a single playerbuilt game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "If you can't dedicate hours to this game every week just for upkeep, don't bother playing. You'll lose everything.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Getting into this game as a major Dune fan was incredibly fun. Exploring the world, building a base, doing the missions, all of it was a joy. Late game however is incredibly dull and repetitive; this repetitive gameplay loop keeps you sucked in and constantly grinding for useless things for the majority of your play time, and you keep doing it because you fear your base disappearing. If you are getting a little burnt out and tired, you can't take a break from the game unless you want your whole base to be wiped and a majority of your progress to be lost. Fun in the early game, awful late game that is repetitive and invokes a fear of FOMO in order to keep players coming back.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ll start by saying that I did enjoy the game. It captures a lot of the Dune atmosphere pretty well, and as someone who loves the Dune universe, it definitely scratched the itch to feel like I was part of it.\n\nHowever…\nI stopped playing for a few weeks and came back to find almost everything gone — 40+ hours of grinding down the drain. A game that punishes you for taking time away is not something I can recommend. I know they’ve somewhat addressed this now, but I still have other major gripes.\n\nThe main reason I keep returning to Conan Exiles, and why I won’t be coming back to this one anytime soon, is twofold:\n\n1. Exiles lets you host a co-op server, which is perfect for tuning the difficulty for one or two players — exactly how I like to play games in this genre.\n\n2. Because private servers exist, Exiles has a ton of fantastic mods. Mods keep games alive, and the decision not to support them for Awakening is, frankly, terrible.\n\nI think the choice to block proper private servers and modding is driven by greed — anything that could potentially undercut the publisher’s bottom line is off the table. In my opinion, that’s why this game’s concurrent player count has fallen off a cliff, dropping to the same levels as the now-ancient Exiles barely five months after release.\n\nGive players more freedom to enjoy your game and they’ll come back. But punish them for stepping away, or force them to pay for “private servers” with a fraction of the control games like this usually offer, and they simply won’t return.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Wasted potential. Story starts well but leads nowhere. End game is non existent. Multiplayer makes no sense since there's nothing to do in groups, except for useless unrewarding PvP. So it's basically a single player game with weak story.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Sold on false advertising. \nThe devs promised pvp would be \"optional\" and locked an entire tier of game's progression in pvp zones. PvP is optional as long you opt to give up on the game and leave. The pvp is also terrible, melee weapons are meaningless, ranged weapons reign supreme and the entire pvp gameplay is determined by how big is your group 90% of the time.\n\nOn progression (doing quests, crafting gear, building your base) the game is not bad, but your quests will end around the 50 hours mark and leave you with nothing to do.\n\nAs an always online game, with no option to play offline singleplayer, it brings numerous issues with it. If the server is down, which is common, you can't play. \nRubberbanding is so bad one moment you're walking fine on the rocks, the next moment you're in the open sand and a worm eats your character and you lose dozens of hours of progression as your entire gear is destroyed. \nLag is a constant, as the game will lag to receive your inputs, lag to open containers, lag to get in and out of vehicles, lag to hit enemies, lag to talk with npcs, etc.\nYour base after constructed needs to be babysat everyday. Add filters to the moister collectors, fuel the generators, pay your taxes, this last 2 itens being the most important, as if you don't fuel your generators the base and equipment in it will degrade with time and eventually be gone, and if you don't pay taxes the game will steal gear from your base to compensate for it. So not only you take dozens of hours to build your base and gear, the game will actively punish you taking away the gear you worked on. It's a big fuk you to every person that doesn't want to play the game as a second job. \nBecause it's always online, there's also no difficulty settings, so most of the game will be so easy as to be sleep inducing, and when it starts to get interesting the game forces you into pvp zones.\n\nThe DLC for the game is almost a scam, it costs 1/3 of the full game price and add a couple of hours of quests and one vehicle that does nothing interesting. In fact, the vehicle it adds is so poorly thought out it doesn't fit the garage door building piece that comes in its own DLC.\n\nKeep your distance.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Saddest game to see die. You fly around and you can literally see bases decay and the server slowly die.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "had everything to be a great game, but sadly it has one of the most incompetent devs i ever seen, its a shame",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Buyer beware, Funcom doesn't have infrastructure to support bugged content. Example to follow:\r\n\r\nPlayed for 27 hours, paid the in game currency to keep my base, went on vacation for a week. Came back and my base was just GONE...not shutdown, not in process of degradation, just GONE, including all machinery, storage, water, vehicles, everything. I e-mailed support specifically regarding this issue, support replied with the following:\r\n\r\n\"I understand how upsetting and frustrating it must feel to suddenly lose your entire base along with all the hard-earned resources and infrastructure, especially after the effort you and your guild have put into progressing.\r\n\r\nPlease note that our team is limited in what we can reimburse. Due to system constraints, we’re not able to verify or restore individual inventory losses, and therefore we’re unable to provide replacements in these cases.\r\n\r\nI’d also recommend submitting a bug report through the in-game menu so our team can investigate what caused this issue. The more details you can provide, the better it will help them track it down.\r\n\r\nWe truly appreciate your understanding and hope you’re able to continue your journey across Arrakis without further issues.\"\r\n\r\nI've requested an exemption from Steam to refund after the refund window, specifically because of this situation.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Do you hate yourself? Want to? Funcom has ways of making that happen. \r\n\r\nI'm only slightly joking. This game is fun for a while, maybe 40 hours, but then the grind comes in. Want to do one thing? Clear your schedule for the next week. If any of the dozens of major bugs that they refuse to fix happen, well, you just lose your progress. \r\n\r\n\"Sorry, lol :)\" - Funcom\r\n\r\nThis piece of entrapment/software does not respect your time in the slightest. Just keeping the possibility of returning to this game open has me spending 1-2 hours every other week on just maintenance for my stuff. Fly here, collect resources, refill these 3 machines, fly over here, get in buggy to collect resources for another set of machines, fly into the overworld and run a long distance through a thoughtlessly laid out city just to pay your taxes to avoid the games government from actively hurting you. Why are there multiple different systems making sure that you log on regularly just to keep any progress that you have made from being utterly erased? Again, if you want a reason to hate yourself Funcom has thought of and implemented plenty of ways to make that happen. They claim that they are working on making it less of a chore, but they also cannot fix game breaking bugs that have existed since day 1 and have laid off a huge amount of their workforce. I'm not going to believe it until at least a dozen people tell me that it works. \r\n\r\nThere's also the end game disproportionately rewarding toxic players. I had a decent group of friends playing this, but almost every one of them has left because of the constant one sides attacks. Literally 3-4 players can wreak so much havok that entire servers go empty. You cannot outsmart them, you cannot outpace them, you cannot outfight them, if they are there you just die, losing hours and hours of progress. This game has allowed these players to ruin so many peoples fun that there are now fewer players on average than Funcom's previous game from 2017. \r\n\r\nWhy? Because Funcom want's you to hate yourself. That's the only logical explanation.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Good game let down by having to play constantly or you lose your base and gear.\n\nNot for the casual player",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overall i like the game, The main issues i have is that you have to babysit your base, I spent hours on my base and collecting resources and enjoying the game. I made sure all my power was supplied. When i got hit with a busy work week i had little time to log on and because i wasn't able to babysit my base, my base was deleted in two days and i lost all my stuff. Forcing players to login in the game or lose every isn't really fun. I can not recommend this game if you have a work life or somewhat busy life.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a game that I wanted so badly to be amazing. Tons of source material: rich, well-developed world from the books and excellent visuals from the movie, popular brand name from recent franchise works. Everything it needed to succeed is already there and my hopes were pretty high.\r\n\r\nInstead, it is half-assed in almost every way. The main quest is boring and annoying, side quests are repetitive and sparse. The town/city areas have very few interactable NPCs and are comparatively small to other games. Material gathering is tedious at higher levels because you require an insane amount of everything. I have been playing with 1 friend and we are still constantly running out of everything, I couldn't imagine trying to progress playing solo. The servers already feel dead because most people have already stopped playing.\r\n\r\nThere are a couple positive things: The base-building is very fun, and deep desert exploration has been improved some with the removal of some of the PvP area. Unfortunately I feel like the negatives outweigh the positives and they will need to do a lot of improvements (for FREE, not in DLC packs), for this to be considered a good game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was fun, till it turned in to a \"second job\" and it wasn't fun anymore. \n\nI tried to play again after having lost everything, but just seeing that they are still collecting taxes and there is still no real solution to not lose everything, I decided not to continue.\n\nBTW most of the bases that were there when I played are no longer and there are still a few bases around, but all abandoned and falling apart showing hours of hours of games wasted.\n\nVery sad indeed",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I don't know where to begin tbh. I've played Conan Exiles since Early Access and I should've seen it coming. For years they tried to revolve the game around PVP, trying to balance everything and failed that so they stopped trying and went for Full RP focus. Then they started releasing cosmetic DLCs which was fine but I guess they didn't like the amount of money they made so they started doing Battle Passes and then they stopped doing it as well. Now there is a shitty in-game microtransaction store with weekly and daily items.\n\nI am writing this because I am seeing the same old shit happening in this game as well. Conan Exiles is now abandoned while they are focusing on DUNE and with every patch they will make the worst possible decisions with most aspects of the game. It's almost 6 months since the launch and they still don't know what the endgame is going to look like, PVP sucks ass, people are losing entire bases and hours of resources gathered because of some silly bug and I have no hope for the future of this game.\n\nMark my words, they will never fix PVP, Endgame (DD) will change completely with every update in the worst way possible and people will keep losing their vehicles to sandworms because of bugs. It's actually worse than Conan's development because now they have both Conan and DUNE and they laid off people so their team is now smaller.\n\nI hope to eat my words when I decide to try this game again in a year or two but until then It's gonna be a thumbs down for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Buh Bye Dune Awakening.  This game is not for the casual gamer.  Had to take a break for only about 6 days due to work/travel, logged in and all my stuff was gone, base destroyed.  While those who like the game will bash this and tell me I should have done X, Y, and Z before taking a break, but that's the most stupid design ever.  Any game that REQUIRES you to login just to save your stuff and your progress is stupid by design.  And from all the posts, PvP is just a bunch of bullies and griefers who hunt you down while you do what the game is designed to force you to do, which is mine spice in the deep desert (DD).  I just read an article where 80% of the player base has already quit.  DO NOT WASTE YOUR TIME ON THIS TITLE!!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "To be quick, the game is not finished and it shows. To be long, the combat mechanics are clunky and unreliable. The map is boring, repetitive and often feels unpolished. The story is not really interesting. The sandworms are scary and fun for the first hour then it becomes a task you need to manage. The mining process is so long and repetitive. You spend two hours filling up your buggy with resource and they get used so quickly, you need to restart the mining process all over again. The building mechanics are okay but very limited. For some actions their is just no animation what so ever. The enemy AI is so bad. There is absolutly no way to sneak up to an enemy, they can spot you from 500 feet away even when crouched. And even if you manage to get close to an enemy while avoiding detection, there is no stealth kill mechanics. So you would need to slash that enemy alerting every one around...\n\nAs a massive Dune fan, I am very disappointed. I do not recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]★★★☆☆ – Wide as an Ocean, Deep as a Puddle, If You're Into that Kinda Thing[/h1]\nI'll start with a little story then give some general and genuine criticisms as someone who knows dune lore extensively, has read all the books multiple times, and am not fond of the movies, for context on where I come from on all this.\n\nI want to start by saying: I loved the beginning. The lore, the atmosphere, the first time stepping onto Arrakis with my friends… it all felt incredible. We explored, scavenged, built our first bikes together, then our first group buggy. That was a complete frickin' game-changer for our little crew.\n\nWe eventually built our first actual base that wasn't just a box, and while it wasn’t much, we dreamed [i]bigger[/i]. We spent days collecting materials and drawing up plans for a grand Jedi-style temple near an outpost… a place our small Sietch community could visit. Doors unlocked, open to all. For a while, we had something special. 40–60 active total players on the server, chatting, trading, helping each other. Even had a little “cold war” with our neighbors after our base grew too big for their liking.\n\nBut as time passed, the community started thinning out... When we finally got our first ornithopter, it felt amazing. Then we needed more scout ornithopters, and eventually an assault one. But by then, the writing was already on the wall. After a specific deep desert excursion went wrong almost immediately after leaving the shieldwall and dwindling interest from friends, I was mostly playing solo.\n\nI still loved the world, so I stayed. Logged in to maintain the base, gather fuel, keep our turbines spinning… all while watching the world around me slowly quiet down. Then work got busy, and I couldn’t log in as often. When I finally returned, our once-great temple was crumbling. Shields down. Taxes owed in the hundreds of thousands, for no reason other than lore that isn't even canon. Sietch's do not pay a tithe on Arrakis across all the Dune books I've read. It is a game mechanic and nothing more.\n\nlast act ingame: I stored my valuables in the Arrakeen bank, looked around one last time at Arrakeen, and logged off. That was months ago.\n\nI’m not here to talk about the PvP vs PvE balance controversy or the economy. My disappointment comes from knowing this might be the best Dune game we’ll have for a while… and it could have been so much more.\n\nImagine sandworms that actually just roam, not just spawn when an invisible meter ticks up. Imagine choosing a true Fremen path, living nomadically, or going full Atreides or Harkonnen nobility. Imagine server-wide events where players band together to take down a rogue worm. The potential for something incredible is all there… it just never quite surfaces.\n\nHunter Seekers could've been used as a device for base infilitration against someone who is online at their base. Imagine sending in a seeker into an enemy's base, and they have to find you before you stab them in the back and take like 25% of their water or something (something fun and relevant to the lore)\n\nCould've had whole rituals revolving around the Waters of Life & Death respectively. 2 VERY POWERFUL tools in universe for multiple reasons.\n\nCould've made it so crafting spice foods and drinks of different kinds do different things, amplify certain abilities, etc etc. Missed opportunity imo. (anotha one)\n\nThen the quests are just literally Go to X, get Obj A, Travel to Y, Do Obj A, possible Obj B and C, go back to X with X possible moving to a new location just to be cheeky. (planetologist) iykyk\n\n[h3]TL;DR:[/h3]\nDune: Awakening starts strong, with beginnings of lore and atmosphere, but fades into grind-heavy shallows. It’s a decent sandworld that never quite finds its depth. \nIf you like base building, the atmosphere of Dune/Conan, or are just a masochist, play today!\n\nWide as an ocean, deep as a puddle.\nhttps://www.youtube.com/watch?v=nHL6uH3p4qU",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Funcom succeeded in creating a game which looks great, play great but is plagued by the most frustrating mechanics ever in a survival game.\n\n-While you don't need to eat, the water mechanic is more annoying than anything else.\n-You can have gallons upon gallons of water, you still don't feel like surviving becomes less frustrating.\n-You are limited with base building and need to progressively unlock bigger bases.\n-If activated on the server, you need to pay for your base.\n-PVP? PVE? Funcom can't seem to decide but the combat is too stiff to be a proper PVP IMO\n-Even when you pay for a custom server, you are linked to others who can invade you and you will still find other players in the deep desert\n-This server system prevent any kind of modding (at least nothing fun or significant)\n-The skill tree system is annoying AF, you're locked with your skills until you find your master\n-You can't equip a third ability immediately, you're locked again\n-You're constantly switching between \"exploration\" and \"combat\" skill tree loadout and there aren't any loadout option.\n-The blueprint unlock system is horrendous and you are very limited, careful if you choose the wrong upgrade or understand some mechanics only later on, you will need to farm to unlock the missing blueprint because you're so limited.\n-Building a base doesn't really work so well, the ghost doesn't stick where it should making base building frustrating.\n-The rare blueprints you find in dungeons are lost upon crafting\n-Equipment takes damage pretty quickly which wouldn't be such a problem if you didn't lose max durability each time you repair it.\n-The Bene Gesserit class has too many advantages compared to other classes.\n-You can't ride worms but griefers found a way to use them to destroy your base even when you're in a safe area it seems.\n-The map is great but it's clearly made for travelling in orni, each time you try to travel to another region, it becomes a pain in the !@# to come back to repair your vehicle, store your loot, etc.\n-And you don't get your orni until you've spent many hours in the game.\n-Inventory is way too small and you're quickly encumbered.\n-...\n\nDo I really need to go on?  The game is really well made but I keep being reminded by it's frustrating mechanics why I hate it so much each time I launch it.\nThe map is pretty and they succeeded to modify the frank herbert universe quite enough to make it fun.\nThe music, the atmosphere... Gosh, if funcom stopped trying to force frustrating mechanics on us to make it more MMO, the game would be amazing.  (seriously, Conan Exile was amazing, this here, is a mess... look at steamcharts.com and you'll see that there are about the same number of players on Conan and Dune when Dune all time peak is three times higher: 53k for Conan 189k for Dune which shows how much Funcom botched this title )\n\nIn the end, avoid at all cost unless you have a guild of players with you who are ready to go through all those issues (and probably love PVP) but if you're alone or with a single friend, you're quickly going to be frustrated. (a bit like Ark Survival Evolved but you can't modify any parameters for XP and whatnot)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is littered with bugs. Some game breaking, some very minor. Support has been able to provide zero assistance with any issues, including a character issue that has persisted since late August 2025. Game would be incredible if not for the sheer amount of bugs present in the game and customer supports complete unwillingness to provide any assistance whatsoever.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As much as i would like to give this game a thumbs up, i just don't think it is worth it in the long run. It was fun to play with friends for the first few days, but after that it became a single player grind unless you and your buddies wanted to log on for a few weeks straight. The campaign is fun but not worth the full game price and the deep desert is a grind. sure the DD is fun for the first 5-10 hours while you are learning how it works, but after that, you realize that it lacks depth to be a true end game and overall it feels lacking. At the end of the day, i enjoyed playing for the time that i did, but don't want to give anyone false hope...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really enjoyed playing this game for the first 40-50 hours.\nThere is no end game.\nDeep desert is empty.\nForced PVP sucks.\nMandatory base maintenance sucks.\nPaying in game taxes to keep my base sucks.\nToo many experimental game elements that just fall flat on their face once the story missions are over.\n\nThe Dune lore is all incredibly well done but this game is very shallow.\nThere just isn't enough meat on the bones.\nI love Dune but I can't recommend this game in good conscious unless it's on sale.\nCertainly wouldn't pay full retail, you won't get your money's worth.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "As a public service annoucement - I would stay clear of buying this game. What was fun on release was destroyed by poor development choices. Should I have known post Conan management, yes. I was fooled by the quality and the lore but if you like pvp steer clear. If you like pve, there are better games. To be more specific, end game is non-exitent and the story line while fun at first from a design perspective, after a few hours, is rinse and repeat.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After spending a good chunk of time in Dune: Awakening, I can say it’s a great game but I hate the endgame and how it constantly forces you to come back and if you don't, you lose everything. When it works, it really works. The sense of intensity is unmatched, the sudden sandworm encounters, scrambling for cover during a storm, or getting jumped by NPC factions. \r\n\r\nExploration is hands-down one of the strongest parts of the game. Arrakis feels huge, harsh, but incredibly rewarding to learn. The world isn’t just big for the sake of being big; it’s dense with little pockets of lore, resources, and random encounters that make every trip out feel like an adventure. \r\n\r\nThat said… like most survival/MMO hybrids, the grind exists. It’s not unbearable, but after a while you definitely feel that familiar loop of gathering → crafting → upgrading → repeat. I didn’t mind it most of the time, but it’s something players should know going in.\r\n\r\nMy biggest complaint is the endgame base maintenance.\r\nHaving to return every two weeks just to refuel your base so it doesn’t get eaten alive by the sandstorms is honestly exhausting. If you want to take a break from the game, your entire setup gets broken down and you lose everything, months of effort gone. Although you can throw your resources in a bank, i find it too tiresome. It’s also pretty depressing to watch a server slowly die off; after a few months, most people stop maintaining their bases, and whole areas become abandoned wastelands. It fits the theme of Arrakis, sure, but gameplay-wise it feels like a flaw.\r\n\r\nAside from that, though? The game is genuinely cool. The atmosphere, the tension, the freedom to explore, and the overall Dune vibe make it something special. If the devs tweak the long-term base upkeep system, I think it could go from “great” to “top tier.”",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I lost so much progress in this game because of a damn glitch that should have been taken care of after this game has been released all this time.  I lost everything because the \"E\" button didn't work trying to get into my vehicle which would have saved me from a worm that takes all of your hard earned things you busted your ass to get.  I work a 9 to 5 every day and I don't have all day to grind for this stuff and to lose my stuff over a lame technicality and to report this issue and their team say, \"oh I'm sorry this happened but just report it to a bug report and oh we can't give you your stuff back or some form of compensation\" is ludicrous.  I am sick of laziness.  You know full well they can compensate you when something devastating like this happens to someone over a technicality.  I do not recommend this game.  I have lost way too much time as it is and it is better spent playing another game where you don't lose your hard earned work and effort.  There is nothing worse than just chasing your tail.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a fun game and the graphics are amazing but it turns into a stale resource grind quite quickly. If you don't log in for a few days your base starts decaying. I have just played for the first time in a few weeks and my base and everything I owned has completely disappeared except the land claim machine.\n\nTime to uninstall and I'll probably never play again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Zero \"customer\" support for this game in any meaningful method. \r\n\r\nBuggy launching issues keep you out of the game and do not allow you to access anything IN game to even try a fix, these controls should be in the launcher out of the game like you find with EVE online or Warframe. \r\n\r\nOh and if you can't get in game in time, the servers degrade everything you own until it is gone. Months of game play can be thrown out the window. Others I know have had these issues as well, they recur again and again one thing or another keeping a player out of the game entirely. Entire bases have been lost, players have quit, and funcom just keeps on making these issue happen. \r\n\r\nMy current issue has help articles (that did nothing) from 6 months ago that it references. No fix? Still happening to folks out of the blue? \r\n\r\nAvoid this game at all costs! Everything done in game can be lost and the devs don't care to fix the issues at all, not even a workaround despite 6 months of the issue.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is good right up to the point where you start the multi player action then the whole concept of how you enter join and participate like going to the world map deep desert etc is confusing clunky and stupid and the way you control the different areas by delivering goods grinding why not just go team on team and recieve the rewards for the winners anyways i wont be buying any dlc or next chapter untill the put a broom thru the multiplayer",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I loved the base-building and the open world.\r\n\r\nBut the game becomes a chore when you're forced to login every second week just to refresh energy and pay taxes, so the base won't get destroyed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dead game. No end game loop. First 100 hours was great. Solid story, quests, etc. Building is amazing!\r\nToo little too late on the Tier 6 PvE access and PvP was one-sided to the ambusher.\r\nGot my money's worth, but last several months have been \"log in every 15 days, do fuel run, pay taxes, log out\" RIP Dune~",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've played this game far longer than I should. Once you've done everything in Hagga Basin, you're pretty much done. Life in the Deep Desert is unrewarding and dull. I think it's worth the price for the experience, so don't rush your way through Hagga. Might get 30-50 hours in the game. I wouldn't recommend this game to anyone wanting to spend more time in it due to all the game breaking bugs. In the span of 2 hours I lost my gear and items 3 separate time to different bugs. That's when I called it quits. I'll probably come back to it in a couple of years and see if they fixed the bugs by then. Everyone else I played with has long since left and don't plan to return.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As of 12/2/2025, this game is like 4/10 scale wise. The bugs. The lag. The latency issues. Low population servers. No updates flowing. No bug fixes flowing. They released this lovely game in June? 2025, posted ONE update (which didn't fix anything) in November, and are refusing to touch or fix anything until next year 2026. Until they fix it, do not waste your time or money. Game of the year? No more like fail of the year.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I got it to play with friends but the wait time to enter the server was SO long that I had already passed my 2 hour mark for refunding the game...yep.  oh not to mention the 200-600+ ping spikes that glitch me through the map...\n\nSoon after, it was only me and a partner, so with 2 people its arduous to base build and mine spice and fend off a massive gang of blood thirsty sweats in the PVP zone.  \n\nThere was a large number of players exploiting left and right, I even had  a case myself where some fruitcake was offering to give me some gear to help me out, and then proceeded to lock me inside their base demanding ransom like the pulp fiction pawn shop sodomy situation, unfortunately for them I just exited out of the server and respawned in a different location, so I am glad the devs thought of that.   Now? the devs have put the ban hammer to a lot of people and are cracking down on a lot of grey areas.  They are doing a great job at it. \n\nBut shame on them for advertising the game as Single Player and Online Co-Op because its not, its no single player at all because you join a server with many other people and the endgame deep desert is massively PVP MMO with only some zones being PVE. Shame on the developer because they made conan exiles and you had true PVE and PVP servers, it was not meshed together like Dune is.  If a game says SINGLE PLAYER / ONLINE CO-OP/ ONLINE PVP, it is very much the norm that those are distinct, switchable play modes.  Like COD, you can do single player campaign or switch to multiplayer pvp.\n\nIt just is not a fun game because a large amount of people that play this game are garbage human beings, and after dealing with the harsh realities of adult life, I just want to relax but noOOoOOOOooOOo I need to suffer more apparently.\nAnd in case one of you mentally challenged warehouse workers wants to say something, just dont, just stfu please.  I see people commenting on other peoples heartfelt posts like you know what you're saying, you dont.  \n\nYou just enjoy aggravating people ipso facto you did not get enough attention at home or on reddit, but I will indulge you: \"WoW BrO yoU DonT LiKe PVP but PLaY CSGO?!?!\"    Yes I also play CSGO, its a pure PVP game for smack talk and strats, but people with IQ above room temperature can also enjoy other games and playstyles as well, like relaxed base building and survival without the stress of organized groups bullying solo players for sport.  Does that make sense to you salvaged title owning G35 driving flat footed orangutangs?  \n\nIn closing, this game is more work than its worth if you are playing solo or co-op, like I have said, it is very difficult to go in the deep dessert and harvest resources with roving gangs out numbering us, but the devs have did an nice job of putting spice in the Hagga Bassin where its PVE only, you cant harvest much spice but its still a more enjoyable experience for solo players.   \n\nThere are bugs, mission icons dont show up when tracking and items disappearing with new updates. Next time, I wont make the mistake of buying a new game, wait a year or two, dont buy the hype.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The story was fun, the world is cool and the building mechanic is decent but this game has nothing but grind at the end. The worst part is the lack of single player. Having to log in every 2 weeks to grind materials to keep the power on and pay taxes sucked so all your stuff doesn't get deleted and killed any enjoyment. If the game ever gets a single player/co-op mode like the devs last game Conan Exiles I'll come back but until then I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Base game is decent enough to keep playing up to mid way. its obvious devs were rushed. no sneak or stealth mechanics, game base building is incomplete. There's only 1 meta build since gear was a second thought. Nearly every single armor has the same stats just more armor when you move up a teir. Like why??!! Dev do not understand how to make this game fun. its just labor. you always have to log in to upkeep your base because of taxes. yes that's right. a video game where you have to pay taxes ...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The initial start of the game was really novel and got me excited. It’s a beautiful game with so much potential, I really did enjoy a lot of the mechanics and the skill tree was cool. But as I continued to play it felt emptier and even the promise of co-op felt just it was just forgotten. I thought I’d be able to do more with my friends. \nI didn’t have a lot of time to play and it just was not very forgiving about that. All of my buildings deteriorated and I just felt so demoralized returning to the game. \nI wish I could refund it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately, I will never return to this game unless they fix the stupid system that destroys your stuff after a certain amount of time. I worked for countless hours to build the base i had, the vehicles, weapons, armor, etc. only for it to be all gone once i got back from a vacation. There was nothing i could do about that either. This game is not designed for solo play unfortunately, and none of my friends wanted to play it.\n\nNot only that, but the pvp in end game was the biggest turn off. I really expected this game to have some solid PVE content like big raids, as it SHOULD have. But it didn't. You're basically forced to do PVP. Until they fix this game, i won't be returning.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The recent patch broke the \"Lost Harvest\" paid DLC for me.  Two hotfixes later, I am still unable to make any progress.\r\n\r\nThe support folks you can reach out to for in-game issues were of no help, just pointing me toward the discord and closing my ticket.\r\n\r\nI love the theme of the game, and it has a lot of fun features, but the lack of quality control and lack of support are pushing even the remaining fans into a corner.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "missed logging in for a week, base lost power, lost my t6 ornithopter and my carryall. cant be bothered to go through the slog of farming all the materials again...\r\n\r\nShame.. I love Dune, but this game does not reward you for the time invested. :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I find my self thinking about this game every other week. Though I haven't put much time into it. I constantly want to but feel like it doesn't value my time because you have to play this every day to make sure you keep the things you've worked for. I wish so much that they'd implement a single player offline mode and online co-op. Running into people is cool but constantly keeping up with my base was a hassle and made me not want to continue. If you enjoy these kinds of persistent online games then you'll love it. It's like rust but more forgiving. Praying to come back to this game when or if they add a single player/online co-op.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Developers have intentionally created a toxic endgame by forcing PVP on the endgame content, even early content and some class story missions are in forced PVP.  With no actual PVE servers or options there's no wonder why so many people have quit playing because of the toxic environment created by the developers and why the developers are now merging servers since no one is playing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i really wanted to like this game. longtime Dune fan so the setting and narrative shifts are interesting. it looks great. however, i think this game is trying to be too many different games at once. i felt better about the overall experience after learning about combat. i never found it satisfying or deep in a meaningful way. i have limited time to play and i hit a stalemate in the game where every time i'd log in i'd have to spend all my game time grinding out fuel cells to keep my shields up until i could log in again in a few days and/or pay taxes. i never felt i had the ability to advance the narrative because of that resource grind. after getting caught by surprise at night 3 times while trying to grind like that and losing all my good gear, i uninstalled. close, but not quite there",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "lost all my items in storage at base for no reason base randomly started disappearing even though taxes were paid and energy was set for 20 plus days everything was within boundaries. not worth the hours just to lose it all with no possibility of recovery and no way to prevent it from happening again. loved the game until the bugs and glitches started and every single item i had stored up and worked towards disappeared because my foundations under them disappeared including all work stations and refiners",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Devs really killed there own game removed being able to earn credits from normal gameplay used to be able 100k in an hour from just farming \"dungeons\" barely get 1000 now then you have the silly ah where basic stuff is sold for 50k horrible interface as well.\nWhats the point farming for weapons and armor blueprints only for them to have the same stats like this entire system can be better with added perks and stats.\nHow the h ell do they go from making conan to this game..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game had all the potential. When you first start out it gives you this sense that it isn't just another material farming grind, survival game. But, in reality that's all it is. The bland story line does nothing to draw the player in. \"End game\" is just a PvP dick swinging contest for all the biggest clans. Good luck being a casual solo in this hellscape. Overall, I would say this game is only worth it if you are a huge Dune fan, or have connections to a large clan.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This might be one of the most solid survival games out there; the environment is great, base building is simple but fun and the tone of the game makes you feel like you're really focused on survival. I feel like if they had just focused on that, and rounding out the experience in Hagga Basin, this would be an incredible game.\n\nThat all being said, the combat is seriously lackluster. The RPG system is small, and almost entirely irrelevant to late-game play in the Deep Desert. There is no in-game feature for finding other players or guilds, and servers are so small as to be impractical for building large groups.\n\nI could put all of that aside, if the game respected my time. Don't login often enough to farm resources and power generators endlessly? Enjoy restarting the entire game. After pouring 270 hours into a run, to lose all of that progress and need to begin from scratch is beyond disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I made a pretty big dent in the game so far even at 13 hours. Right off, let's start with combat, which is a big deal here. First, melee could be better with the timing considering it is a MMO that is completely reliant on your connection to the servers. If there is any lag, you will often miss the extremely tight timing for parries. If you miss those, the souls level NPC difficulty will overwhelm. Like a lot of MMORPG games, You have to run back to your corpse to recover lost money and roughly half your inventory in materials. If you get killed by the worms, you lose everything with no corpse. Those last bits are fine to me as we need incentive to get better. The issue I've had is no matter how long I play, I cannot seem to master the melee combat, and the only way to fight shielded enemies at 13 hours in is the \"slow blade\" and mastering parries, dodges, and everything else that's highly dependent on timing in a system that should forgive you with a margin of error for lag spikes. This is also further exacerbated by a very short stamina bar. I suppose Funcom assumed we would be raiding PvE in larger groups, but as we all know, PvE is better done solo or with maybe one other friend.\r\n\r\nWith all of that out of the way, there is no real base insurance. You can copy your base layout, but any items locked in storage at the time of the copy/paste get deleted forever. So, if you had 20 days worth of battery life in the generators, guess what -- you're going farming again. You will have to repeat all of the grinding to rebuild your base despite them flat out telling you that it's a type of base insurance to copy/paste your base. Never mind the tax in Solari every week to the CHOAM. It's really a game for people who have friends. But, like many of us who are too old to care, don't typically have work friends that play games, or are just loners, I found the difficulty curve just a little on the harsh side. All of the senseless life simulation is basically just too much tedium for anyone who has a real life to be fair.\r\n\r\nOn PvP: I did not encounter anyone real players wishing me harm because I stayed out of the well marked zones for PvP. As far as I could tell, the second zone has a fair number of PvP zones, but nothing a solo player can't avoid. It might take you longer to find what you're looking for, but you can play it safe. Again though, you're faced with a lot of unnecessary tedium.\r\n\r\nOver all, the game absolutely needs private servers where we can control difficulty curves and most importantly QoL features that are prevalent in nearly all survival games. The way they did private servers is a nightmare of money grubbing and laughable ego. You can check it out for yourself on Funcoom's website. Since I doubt very much they will change things for the better -- because looking at the developer's track record since Anarchy Online -- I would say stay well away from this game. Honestly, the Dune franchise could have done with a single player story mode with optional multiplayer combined with battlefield simulation rather than what Funcom is trying and failing to do well. In short, this game is annoying.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve played Dune: Awakening for over 100+ hours with my friends on a private server that we pay for monthly. It’s just us on the server, which is exactly how we like it.\r\nWe finished all the quests (most of them are fairly generic fedex quests, although the paid DLC quests were cool) and we were working toward the last end-game vehicles, which require a crazy amount of end-game resources. One of my friends spent an enormous number of hours designing and building an amazing base (no joke, it was marvelous).\r\n\r\nWe lost **everything** because we didn’t log into the server for three weeks, while the shield only had enough power for two. On a private “solo” server. Now we would have to start again from scratch, and we even lost uniquely named gear.\r\n\r\nI don’t think I’ll ever come back to the game after that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is pretty fun, the exploration is a high point and traversal alone provides lots of challenging and fun opportunities. Combat is pretty neat as well, though it can be overwhelming at times when you need to fight large groups alone.\r\n\r\nThe reason I don't recommend it is that it's severely punishing if you don't/can't play regularly. I lost any desire to continue when I had a busy month with my work and came back to find my entire base destroyed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dev's dropped the ball on this game.  They wanted it to be pvp, but had no idea how to make a pvp game.  They did a pretty good job on the PVE side. Up until you hit the Deep, it's all gravy with immersion and gameplay.  But the deep.. gank squads, defenseless farmers.. and there's no point to any of it except to disrupt someone else's game.  There's no gain, and very little loss, once you have \"stuff\".  But then again there's no penalty for attacking someone, either.  The only repercussions are social.  The game is riddled with cheats, the netcode is garbage.. plus you can't tell who the hell is who, even when you're in a 4-person squad.  It's not that we don't want PVP, risk vs reward... the PVP SUCKS..  and that's fixable, right?  except that Funcom removed a majority of the team that was working on the game.. before it was \"complete\".. now it's on life support.  So yea, people got to end-game.. got tired of getting ganked, got tired of making 30 trips out and back in around the big storm, got tired of losing rare parts on vehicles that Customer Service won't replace (I don't need a stripped T6 buggy, I need the 2 rare parts that I can't replace myself).. also Customer Service is absolute garbage.  They don't read anything until the 5th response, it's all AI and English as a second language.. and when they do, they literally can't do anything useful.  Case in point, I have a buggy that fell under the map.  It's safe and sound at the bottom of the world, won't decay..  they offer me the useless parts of the buggy...  don't need those.. I need the buggy either moved to above ground, or destroyed.. I don't care which, but it's taking up a precious vehicle slot!  After 2 tickets and 12 emails, they finally understood, and told me they can't do anything about it, submit a bug report.  I've admin'd and ran servers, even done a little dev... destroy, delete, teleport (me or the buggy) are all really simple solutions.. that they cannot do.  Hell let me disown the vehicle remotely, the way we can do bases.. nope.  Oh, also there is ZERO functionality for reporting a cheater.\r\n\r\nGreat game.. but wait for 50% off (which it should have already hit with this pathetic population), and stay in Hagga Basin.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is super fun from Tier 1 to 4 after that you can delete the game and go play something else. Servers are dead, players have absolutely nothing to do. Devs gives no fucks about their own game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game can't get the fuck out of it's own way. I enjoy the game, a lot of time in it. Yet between the At least one large latency spike per loggin that I get, aka. Screen freezes for 10 to 20 seconds, better hope your vehicle you're in doesn't find a quicksand spot. My character climbing off to oblivion at random time, legit climbing air. Getting stuck in a vehicle after exit it, like between the tread and body of a crawler or the wings of a thopter. Another issue, my thopter, scout, assault, whatever, overheating from doing nothing, over and over, and the only fix is to land, exit, re enter, and try again. Or the rocket pods consuming ammo and not actually firing. Gotta exit to main menu for that fix. And god forbid you exit the game to reset the possible memory leak? For it has to check shaders EVER GOD DAMN TIME. Not sure when shader compiling became such a damn thing.  Opening storage units, exit the unit, and have your character re equip your previous weapon. The loss of thopters from loading screens to the deep desert. The horrendous frame drop at random cut scenes.  The only reason why I've stuck with this game this long is 60% Dune, 40% Base building. If this was anything else, I'd not have stuck around, and Funcom has no excuses. So again, this game cannot get out of it's own way. It just stumbles, again and again and again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "My money just disappeared. If the game isn't consistent, it only causes frustration. It seems like it's in beta.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was PEAK in August. I thought this was my \"forever game\" like WoW was up until MoP was released. I was in the top Atreides guild on Arrakis and we were allied with the top Harko guild and would call on each other if we got into some PvP fun. The game was amazing back then. The PvP back then was sooooo good fighting for blueprints. Almost everyone was mainly melee but we all had a gun or two on us. Staying up until server reset on a new deep desert rotation rushing to get an amazing spot on the edge of the PvP zone near a testing station, large spice blow, or Titanium island right after the servers came up... trying to be the first one to get the first regis pistol on the daily reset, seeing 30+ people fighting outside a testing station or ambushing others while they're mid wave in a testing station and watching the giant sh!t show unfold because we're all in groups of 4. Hosting massive 1v1 tournaments and death races in the open DD, fighting for spice blows and hiding in the plume of a nearly emerged spice field waiting for others to show up, watching people get eaten by the worm fighting on open sand and knowing they lost everything.... good times...\r\n\r\nHowever, due to one of the recent patches that changed the distribution of gear and nerfs to melee has literally killed this game. There are no chase items anymore and people can still log out in the loot rooms. Most testing stations have glitched walls you can walk through, shigawire around to the loot room, and then exit up through the deep desert sand floor.  There is no end game except farming spice, but what for? Farming hundreds-thousands of blueprints, but what for? The majority of the players don't want to PvP therefore their gear won't break so they're just pointlessly amassing blueprints and materials.... but for what reason? There isn't one. The endgame loop is nonexistent since they killed PvP. Melee doesn't stand a chance now against a ranged player with a lukewarm IQ.\r\n\r\nAnd lastly, Funcom fired most of their devs months ago as a \"long term restructure\" and now their nearly 9 year old game Conan Exiles has more concurrent players than Dune. Funcom doesn't test their own game, the release patches and fixes way too slowly, makes changes based on a minority of casual players with less than 100 hrs played complaining about a lack of loot, having to encounter PvP in a PvP game, and losing their thopters so Funcom created a way for them to get them back? pathetic..... and I'm beginning to believe Funcom is killing off the rest of their playerbase purposely as they've already made the majority of the income they ever will off this game.\r\n\r\nThese upcoming patches, changes, glitch fixes, etc, are too little too late which is extremely unfortunate because my group of friends and I spent hundreds-thousands of hours playing this once great game.\r\n\r\nA few of us are holding out for the next big release in January. Those of us left have put our bases to sleep on the least amount of power required and only log in every 3-4 weeks to load more fuel cells into our generators just to log out for another 3-4 weeks... if January is a flop then this game is officially dead. If January is a banger then I'll delete this negative review but I'm not holding my breath. None of us are.\r\n\r\n-Brink",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If I could give a 0 star review I would. Played the Free weekend and bought the game. Found out over a 100 hours in the game that I was down an aspect of the game (a Fief)... because I left a Fief on the free server. I don't have access to the free server. I opened a ticket and they DID NOTHING AND TOLD ME TO FILE A BUG REPORT... AFTER SEVERAL REQUESTS FOR HELP. It took nearly 6 communications before they just told me what they should have said in the first. They are useless. I filed a bug report and still don't have access to delete the fief. \nThis game is fun. \nThis game is not worth it's flaws or the lack of support. Do not buy. Spend your money anywhere else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like this game. It's a good game, the mechanics work well, vehicle use is good, and it feels like the Dune universe. I've put a fair bit of time in to this, and still play, but am doing so less and less now. Why? Well, there's not much left to do once you reach the end game. There's hardly anyone on the servers to play with or against, and once the story is finished, you're pretty much on your own. Sure, I could make a character on a more populated server, but that means grinding it out again, and I really can't be bothered with that. Maybe when server moves come in then I'll go for it. In the mean time, I'm just making sure I have fuel cells to keep my base ticking over, and then I'll pack it up when the base backup tool is launched, and take a break.\nIt's a shame, with another year or two of development, this could be a really good game, the release was rushed, and the playerbase has voted with their feet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is like a hurricane, exciting at first but ends in a disaster.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why would base decay even be a thing? it just destroys everything i worked hard to collect and build",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fine except for vanishing items.  150 Melange vanished from storage - this was the last straw.\r\n\r\nIt seems vanishing items has been a known issue for a long time.  Terrible waste of time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So much wasted potential. They designed a system that made it really impossible to take a break from the game without losing an incredible amount of progress, I havent even gotten to the horrible PvP endgame that other people are talking about. The developers really just let the player base bleed out without listening or addressing important issues for longevity- now the game is empty and they have NOT yet managed proper server transfers. Don't rec",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played this game for 57 hours and loved it. So why the thumbs down?\r\nThe Dune feeling in the world is excellent, crafting loop is pretty fun up to alluminum. \r\nIf you want to briefly play this game, please do its fun.. If you want to invest time in it however..\r\n\r\nThe devs are too slow with updating the game, most servers are dead. I haven't even reached endgame yet, but i've heard little good.\r\nBeing forced to login to save your progress is not fun. I just lost my buggy-which I worked hard for- after some time away, and it was a 100% in a sheltered position when i took a break from the game.\r\n\r\nThe risks in the world -the Sandworm and Sandstorms- are fun and make the world feel alive. But you should never be punished for taking a break from a game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game had potential but seriously flawed development decisions and the sheer lack of clarity on the ongoing bugs and exploits hamper it. The vibe of this game is more a \"We got your money now p*** off\" than \"We are listening and looking to improve.\"",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to love this game, but I just don’t. The mechanics are pretty good and the game stays fairly true to the original feel of the books (which I do love and have re-read many times), but it’s hard to play as a single player and the consequences are too harsh. I sometimes take breaks from playing and hate being punished for it. I have a family and can’t always take 20+ minutes to get to a point where I can safely log out. As a result, I found it increasingly difficult and even sometimes stressful to find a time to play, which just exacerbated the issue of being punished for gaps in playing. All together, that sucked the fun out of it for me, sadly. I might circle back one day if this all gets ironed out somehow, I’d love to love this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game i feel has good bones and is entertaining. However I feel  that the consequence of death is to severe witch would not be and issue if it wasn't for server lag and glitches that can actually claim your characters life causing you to loos all your inventory and warren gear things that are not easy to build up as a solo player. So in all I would say playing with friends and or group of players is what I would advise for playing this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dedicated Servers so we can play with friends only and PvE and not lose our bases and pay taxes like RL. The base tool is fine and dandy, but the game is so not fun on a schedule.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Dune universe just doesn't work in a game format, this was a good attempt but it's missing alot that makes dune so unique. What is from Dune itself ranges from good to underwhelming if you are looking for a dune experience this game ain't for you. \r\n\r\nAs a game itself it has loads of issues:\r\n- late game is insanely grindy and kills the pace of the game\r\n- movement feels floaty\r\n- lag on the level of a 2000s call of duty game\r\n- next to no quality of life that have been around for years\r\n- no private servers or single player playthroughs\r\n\r\nIf you can get past all of that it's gonna be a mid experience at that. Play an different survival game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I tried the demo. The thing that keeps from buying this game is the fact you have to log in basically monthly to maintain your base. Otherwise it's a fun game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't be bothered logging in to farm the fuel for the base between trying to play other games. In the 40hrs played I never saw another player apart from my party. Just abandoned bases for miles around. Could do with the ability to dip in and out of to play a lot easier.\n\nEdit: Logged in after the devs reply, could not find or work out how to access the base reconstruction tool. Already lost half of the base though so for me this update is too little too late.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoy these types of games, I like Dune for the survival and building mechanics. I just can't beat the lag the servers keeping throwing my way.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Recommended: No (for now)\nPlaytime: 31.6 hours\n\nThe desert takes, but it should also teach.\n\nI came into Dune: Awakening as someone who loves both the books and the design of games. I wanted to see how a studio would turn Herbert’s world of discipline, scarcity, and survival into a living MMO. After playing, I think they built something that looks like Dune but does not think like Dune.\n\nWater drains too fast, sunstroke comes in seconds, and the “Fremen Stillsuit” – named exactly that – recovers maybe a quarter of a bar when empty. Lore tells us this suit keeps 98 percent of body moisture through movement. In the game, it barely functions at all. It is not about difficulty; it is about coherence. When a system called a “Stillsuit” fails to still anything, the world stops making sense. Instead of feeling like a careful survivor, you feel like you are babysitting a broken meter.\n\nDuring the alpha I asked why we could not walk the desert like the Fremen do. The answer was, “We tested it. It was boring.” But the Fremen never walked to be entertained – they walked to live. Without desert walking, there is no rhythm, no contrast between calm and danger. Thumpers arrive only mid-to-late game, used purely as distractions instead of deliberate calls to the Maker. Vehicles appear early instead – loud tracked tricycles that pound the sand and summon worms faster. Once a worm notices you, you cannot lose it. Speed is your only defense, and speed makes more noise. That is not game balance. That is the ecosystem of Arrakis turned upside down.\n\nEverything works in isolation: hydration meters, worms, thumpers, vehicles. But nothing supports anything else. You can feel the effort – the art direction is gorgeous, storms look alive, flight feels good – but the systems do not share a common idea. They took the nouns of Dune (Stillsuit, Thumper, Shai-Hulud) and forgot the verbs that give them meaning (preserve, walk, respect). The result is a game that constantly breaks its own mythology. It punishes patience, rewards noise, and confuses endurance with annoyance.\n\nSlow the cadence. Let the Stillsuit work. Make the desert something to learn, not something to escape. Give the worm back its mystery and the player a reason to tread lightly. Funcom clearly has the tools to fix this. Under the current systems is a game that could teach patience instead of reflex, humility instead of hurry.\n\nDune: Awakening is visually stunning and mechanically ambitious, but it misunderstands the lesson of its own world. The desert should not be loud. The desert should not be fast. The desert should not be easy. The desert should be sacred.\n\nUntil it remembers that, I cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have almost 600 hours played on this game as a strictly solo player. And I was in the deep desert by week 2 of launch. \n\nHagga Basin while you're leveling is fantastic 10/10 PVE experience. The deep desert PVE is and always has been a solid 3/10. The same exact enemies that you fight from level 1. Somehow ZERO bosses and mostly empty desert.\n\nThe PvP and player interaction however was a 9/10. Really large amount of alliances and plots. It WAS very fun until the PVE-only playerbase completely ruined this game by constantly crying all day every day in discord and reddit. This game has less players than AOC now because they've done nothing but listen to the PVE playerbase and the devs for whatever reason continue to listen to them because they're so loud in discord and reddit, insane.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After so many hours I can say Funcom has no idea what they are doing. Every week they break the game. This game has turned into a safe haven for farmers and flight simulator veterans. All combat is trash pve and pvp.  The fact that I can't chase after a assault with booster on, hop out I can not put my scout away and or even ancient way the guy before he is out of range. The only way to even fight someone is waste time camping a control point all day in hope someone whos up so you can get one fucking rocket off. Melee fucking sucks and range makes no sense in this universe unless you are rocking 100mk6 heals. Just had the worst time do 3 pvp labs with 2 others, And range doesnt even make sense in the labs since everything is shooting right back at you. Done burnt me out. I waited a long time before doinfg this review in hope it would be good but I can't. Do not buy and do not play on the free weekend, the game sucks. It should not have been released. We beta tested for them for a year.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Can't recommend this without self hosted servers or local single-player/coop. Would be a good game, i enjoyed the story and beginning but it turns into an annoying chore with nothing enjoyable about it.\nNever had a game where my experience was like day and night then they force you into PvP in the game too without being able to choose PvE",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you like a game where you can NOT take off more than a month, NO easy chats, a weakening community, no common objectives, if it glitches or you get stuck be prepare to die and never know why. \n\nI spent 237 hours playing an perfecting my home base only to lose it while in the hospital for over a month. RL happens and your game should not punish in the PVE area.\n\nBased on the above I would say great game, horrible support.\n\nIf you don't like the idea of unresolved issues, even if you are or are not a Dune fan, than this game is NOT for you!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really enjoyed this game, at first. I do still enjoy it, but let me just say:\n\nIt should have been a single player game with optional coop servers and deep desert pvp. Not a thousand different servers with a (fairly small) player group on each server. Now we have deserted servers with one or two players on them, and most people aren't coming back. \n\nHonestly Funcom, just switch it to an offline type game where the deep desert still connects to the pvp world. There isn't a point in having all these barren servers sitting around that will never be used again because you dropped the ball so hard.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game was not designed for players or customers.\nIt was designed to appease investors.\n\nCurrent state of the game's updates post launch:\nToo little too late sums it up.\nFewer concurrent players left than in Conan Exiles which launched almost a decade ago also sums it up.\n\nBut hey, you can now have a silly lore-unfriendly totally superfluous wheelie thingie vehicle I can't even remember the name of (Possibly because it doesn't belong in DuneVerse?) and can get a dragonhead flamethrower that fits in as well as purple dildo melee weapon would in this game.\n\nThis was Funcom's last strike.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My main complaint about this game was deletion of my base. Not saying the concept is not necessary for a survival game, but its probably one of the harshest I've seen. Where you are at, you pretty much start over from scrap. Despite the major complaints of this game, this was the one that made me leave.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Make no mistake - this should absolutely be called an early access title. I feel like I kept pushing through some unrewarding and disrespectful grind to get to.. An endgame that is an entire ocean of about 2 inches deep.\n\nWhats even more confusing is what the dev team focuses on. The community is begging for literally just finishing the fucking game. Instead, here's some lame-ass paid DLCs.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}