{
  "positive": [
    {
      "review": "---{ Graphics }---\n☑ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☑ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☑ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10\ndef get this game on sale cuz the game is not worth 100€ even if it's life changing",
      "voted_up": true,
      "votes_helpful": 178
    },
    {
      "review": "[h1] 10/10 [/h1]\nWOW, what an amazing game. This is by far the best story driven game i've ever played. it took me around 90-100 hours to complete with most of the side quests done. Highly recommended to everyone. It is worth getting even at full price with the experience it leaves behind.",
      "voted_up": true,
      "votes_helpful": 108
    },
    {
      "review": "I just got 1000 hours in this game, and not only can I confirm it was the best game of 2018, it is also just the best game of all time, the graphics are supreme and the story is GOATED, a must play",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "Red Dead Redemption 2 is an experience that unfolds naturally, never feeling forced or rushed. The story draws you in deeper with every chapter, and the world feels alive, as if it continues to breathe whether you are there or not.\n\nWhat truly sets RDR2 apart is how organically it develops its characters and its narrative. Arthur Morgan’s journey is one of the most compelling arcs I have seen in any medium, grounded, emotional, and full of introspection. Apart from RDR2, I have only found this kind of storytelling depth in The Witcher 3 and Cyberpunk 2077, each in very different ways. It is a world that invites you to take your time, not because it demands patience, but because every corner, conversation, and horizon feels worth exploring. The gunplay is rather rudimentary at best, but the world and its characters make every moment unforgettable.\n\nTake your time with it. Do not rush. Let it pull you in, and be prepared for tears. Few games remind you this powerfully why stories matter.\n\n- Blessed are those who hunger and thirst for righteousness.",
      "voted_up": true,
      "votes_helpful": 39
    },
    {
      "review": "There was never any doubt that Red Dead Redemption 2 was going to be good, but this is something special. A masterpiece that many will be talking about for decades to come.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "beautiful history, characters and universe",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "“I have a plan.” \nOf course I do. I always have a plan. \n\nBut this game? It’s the plan in motion. A tale of freedom, loyalty, and occasionally running from the law because things got a little bit complicated.\n\nSo just play the game. \nAnd remember: we just need one more score.\n\nFor TAHITI 😂",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "[h3]Masterpiece[/h3]\n\nOf all the gaming companies today, Rockstar is the only one that can achieve such a high level of elaboration in absolutely everything present in their games. The open world, graphics, atmosphere, story, gameplay, little details – all of these are executed at the highest level. And Red Dead Redemption 2 is no exception.\n\nWhen you start up RDR 2, the game greets the player with a lengthy prologue. It immediately shows the player the pace at which most of the game will unfold. A deliberate and meditative pace is the hallmark of Red Dead Redemption 2. All animations in the game are meticulously crafted; Arthur slowly opens cabinets, slowly picks up items, etc. All of this allows you to savor every moment in the game.\n\nTo date, this is the most atmospheric and authentic game I have ever played. Besides the animations, the following elements greatly contribute to the immersion:\n\n1. Graphics. The game is already 7 years old, and it still looks better than many modern AAA titles. Countless times I've stopped at the edge of a mountain or a hill to take in the picturesque views of this game's world. Indescribable beauty!\n2. Sound Design. The clopping of horse hooves, the singing of birds, the sounds of towns, etc. All the sounds are executed at the highest level.\n\nAnd I'd like to separately highlight another point. I've never seen such a living, breathing open world anywhere else. The immense diversity of the animal kingdom (so alive that rabbits run right under your horse xD), the NPCs have their own daily schedules. They can be building a house, which, after some in-game time, will actually be completed. The world lives on without the player's involvement, and you can feel it.\n\nBut the most prominent feature of the game's world is the random events. The small quests you stumble upon while riding to some mission. The game naturally presents this content to you. You're just trotting along the road and see a column of smoke from a campfire in the distance. It might be an enemy gang, or it could be two guys distilling moonshine, and there are tons of different situations like that. Because of this, I only started using fast travel around the 80-hour mark (and even then, only for long distances), because I didn't want to miss this content.\n\nI won't talk much about the story, as it's straightforward. It's ABSOLUTE CINEMA. The direction, acting, staging, story development, characters, dialogues – everything is executed at an incredible level. The story of Arthur Morgan and the Van der Linde gang will leave no one indifferent. And through the side quests, you become even more attached to Arthur and his story. In general, Arthur is one of the best protagonists in the gaming industry.\n\nWhen you fully settle into the game's rhythm, immerse yourself in its atmosphere, and get into the flow, you're no longer playing a game; you're living the life of Arthur Morgan.\n\nI understand that RDR 2 isn't for everyone. This kind of meditative gameplay might be tedious or boring for some. Nevertheless, I highly recommend giving this game a try, absolutely to everyone.\n\nRed Dead Redemption 2 offers a unique experience that no other game can provide.\n\nYou Are A Good Man, Arthur Morgan….",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Honestly wish I had played this masterpiece years ago. Red Dead Redemption 2 is absolutely fantastic — the world, the characters, the emotions… everything hits perfectly. One of the best gaming experiences I’ve ever had.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Boy oh boy, where do I even start?\r\n\r\nI'm 7 years late to the party but I finally made it, and all I have to say is what a masterpiece this game is. The only thing I dislike about this game is that I finished it, shows how much I want more from this. There will be no other game that will resemble the atmosphere and livelihood of Red Dead, and that is just the saddest part about it. The average releasing game will not reach the standards of a game released in 2018.\r\n\r\nArthur Morgan I think is one of the greatest characters of videogame history. He is the perfect example of how a man can change and there is always a second chance. If anyone ever gets into videogames I think this should be played at least once in their entire lifetime. The journey I had with the gang was worth it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Red Dead Redemption 2 isn’t just a game, it’s an experience. From the very first mission to the final credits, everything feels handcrafted with insane attention to detail.\r\nThe story is easily one of the best I’ve ever played in any game — emotional, deep, and filled with characters you actually care about. Arthur Morgan’s journey is something that sticks with you long after you finish.\r\n\r\nGameplay-wise, it’s top tier. The world feels alive in a way no other open world does. Every random encounter, every hunt, every robbery, every ride across the map feels meaningful. The gunplay is satisfying, the animations are beautiful, and the environment is simply breathtaking.\r\n\r\nThe graphics? Stunning. The atmosphere? Perfect. The soundtrack? Emotional and powerful.\r\nEverything here works together like a masterpiece.\r\n\r\nIf you’ve never played RDR2, don’t hesitate. It’s a 10/10 game in every way — story, gameplay, world, characters, and immersion. One of the rare games that genuinely feels like art.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After playing RDR2, I lost interest in playing any other game.\r\nNo game can top this.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't usually write reviews for games I've finished, but Red Dead Redemption 2 is different—and this is technically my second playthrough.\r\n\r\nMy initial run was a mistake. Like a fool, I blasted through the main story, desperate to see the next big set-piece, driven by narrative anxiety, and I paid the price: I missed the entire point of the game. I treated this vast, rich, painstakingly detailed 19th-century world like an open-world checklist, constantly riding the fastest route between mission markers.\r\n\r\nThis time, I'm taking off the blinders.\r\n\r\nThis is not a game you rush; it’s a world you inhabit. I'm spending hours hunting for perfect pelts, fishing in quiet streams, stopping to read every newspaper, and genuinely interacting with every single random encounter I come across. I'm letting Arthur Morgan breathe. The game truly shines when you abandon the main questline for a few real-world days and just exist in the environment.\r\n\r\nIf you've played it before and rushed, come back. If you're starting fresh, slow down. Don't let FOMO ruin the experience.\r\n\r\nWe all know what's coming next from Rockstar (GTA VI), but do yourself a favor: immerse yourself in this incredible, poignant, and beautifully detailed world now. There may never be another experience this quiet and meaningful again. It deserves every minute of your time.\r\n\r\nPlay it. Slowly.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a very good game with a very very gud story and i recommend playing thru it. atmosphere and graphics are amazing and gunplay feels very satisfying when you hit your single shots. hunting and skinning feels good and the game has so many interesting mechanics and things to do\r\n\r\nonline is dog and abandoned. its somehow worse than fallout 76. the online has so much potential to be a cowboy rogue like online game where you get to use your own character to progress through a story with friends and chill in a very cool setting, or just go hunting for fun. but its just not. not to mention most lobbies are filled with cheaters, literally the first ever lobby i was in had someone with a colored name (which isn't possible in these kinds of games)\r\n\r\nmovement leaves a lot to be desired. 90% of the time i am not in control of my horse or character. they just goes wherever they want to, or i am forced into an animation i dont want to be in.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Im dying sister, Ive got TB. This might be one of the best games ive ever played, played it multiple times on pc and console, fuck you dutch and micah",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After about 4 hours in Red Dead Redemption 2, I can say that this game is more immersive than almost anything else I've played. The soundtrack, dialogues and all the details make it really hard to stop playing, and if this is only the beginning, I am genuinely excited to see what's coming next. Definitely recommend it, this is one of those games you just have to experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "10/10 game, had such an emotional impact on me, amazing voice acting, characters and the map is beautiful in itself. beats every story game.Arthur Morgans journey throughout the game gives a true perspective on life and is truly a beautiful story. Best character by far and such a perfect game. would recommend to anyone who hasn't played this yet.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the greatest game I have ever played. I own it across two different platforms and have approximately 3,000 hours in it between them all. The story is incredible, the characters are well-developed, and the graphics are stunning. Everyone should play this game at least once in their life!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Play the game. Words cannot describe this master piece of a game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Greatest immersive world which i've ever seen.\r\nNPCs are live, encounters are interesting and nearly every aspect of the game is deeper than the RDR1.\r\nGreat story, RG was able to combine it and mount it to the already existing story from RDR1.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So this game is an absolute techical marvel. It pushes the boundaries of what a video game is. So much so that it feels more like a simulator than a video game. It's heavily based in realism and it can be off putting for some players like myself.\n\nI liked it, but I didn't love it, and it hasn't stuck with me the way I expected. I think the issue is pacing. Much of the game is a slow burn—long stretches of riding, traveling from point A to point B, conversations—and when the epic moments finally hit, they're over before you can fully appreciate them.\n\nDo I recommend it? Yes, but like I said I don't think it's going to click for everyone. If you're unsure, buy it on a sale and you won't regret it either way.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game, but fuck Rockstar. \n\nHsvring to update and launch though thier launcher is bs, takes ages.\n\nI just wanna play the fucking game I bought",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "everything the game its self is a good way to just relax espesicy if your like me with mum and dad fighting all the time it really helped me through my darkest time and it still is",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game! Please Rockstar, bring Raytracing to the game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "absolutely phenomenal game 10/10\n\nsaddest ending in any game i have ever played",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely gorgeous. The atmosphere of the Wild West is a straight 10/10, exactly the way I imagined it back when I read The Headless Horseman.\n\nI wasn’t a huge fan of the main story or most of the quests, and the push for “super realism” doesn’t always work in the game’s favor. But damn, the slow pacing and riding a horse between locations really pulled me in. With views like these, you honestly forget fast travel even exists. For me RDR2 feels more like a Wild West simulator where you just soak in the world and enjoy how insanely detailed everything is.\n\nSunbeams or moonlight that pierces through tree leaves in combination with the fog, the sunrises and sunsets… absolute masterpiece. There’s so many views that you can screenshot and instantly set as your wallpaper.\nThe main storyline didn’t hit me that hard, but the epilogue caught me off guard and I ended up liking it more than the main plot itself.\n\nSolid 8.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the best story cinematic game of all time ever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute cinema of a game, life changer, honestly. For me it's not just a game, it's an experience, i feel like i'm actually in the game. The characters are well written, most people said the story felt slow, but i actually enjoyed it like that. Remember you DO NOT want to rush this game! Get immersed with the world, every seconds feel cinematic, whether you're inside a cutscene or not.\n\nI actually played this game a while back through not-so-legal method, but my love for this game had me buying this game and feeling the experience once again. The fun, the thrill, the pain. I absolutely love this game with all my heart.\n\nI would recommend this game to people who are at least capable of not skipping a single line of dialogue.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Red Dead Redemption 2 is often considered one of the best games ever made because it delivers an experience that very few games can match.\nRockstar built an incredibly detailed open world that feels alive animals behave realistically, towns change over time, and every random encounter feels meaningful. The game’s story is also exceptional: Arthur Morgan is one of the most complex, well-written characters in modern gaming, and the narrative is emotional, mature, and memorable.\n\nVisually, the game is stunning. From cinematic lighting to breathtaking landscapes, RDR2 constantly feels like a playable movie. Its soundtrack, voice acting, and animation quality elevate the immersion even further. The amount of care put into tiny details  your horse bonding with you, footprints in the snow, dynamic weather, NPC routines sets a new standard for realism.\n\nGameplay is deep and varied too: hunting, gunfights, exploration, side quests, camp management, and an online mode that adds even more to do. Whether you prefer story-driven gameplay or open-world freedom, there’s something for everyone.\n\nSo if you love rich storytelling, immersive worlds, and cinematic adventures, RDR2 is absolutely worth buying. It’s not just a game it’s an experience that sticks with you long after the credits roll.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "To be completely honest, whenever we see Rockstar release a new game, we immediately expect something surreal. And with Red Dead Redemption 2, I don’t even know how to describe it. We forget our own reality the moment we enter that world. Everything in the game is carefully crafted, and everything has an impact , not only the beautiful and almost surreal story behind it, but also the horseback journeys, the gang duels, and the emotions each moment delivers. Everything fits together perfectly.\n\nFun fact: my dad doesn’t really like video games, but this one managed to get him to sit next to me and appreciate the beauty and impact that Red Dead Redemption 2 offers.\n\nThis game is, without a doubt, an example of how Rockstar, even already considered one of the top game development companies , at least by most of the community who truly understands what makes a great game still manages to outdo themselves and create something better than anything they’ve made before.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "when i initially installed conan the mighty big I really thought it would be a cash grab the same as bird game 5. But i was so supprised because this is an absolute masterpiece of the mighty pig genre of gaming. This game had all the amazing tropes of a action, physcological horror, hentai romance. The real sexual tension i felt between conan cannot be described. Conan took my kids and murded my wife but dispite this i still hold this game a special place in my conan the mighty pig heart.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ok now listen this game is the best story game i have ever played. I highly suggest this game to everyone!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it took me over 120 hours to finish my first run (main story + epilogue) and i still wish this game was longer. instant favourite, i absolutely do not regret buying the ultimate version. the characters, the story, the mechanics, the graphics; everything was attractive to me and i always had a blast even doing simple stuff like hunting or fishing. absolutely recommend, probably the best game i've ever played in my entire life!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Greatest game ever made. Made my cry, hit me in the head so I can forget everything and play this for the first time again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is honestly one of the best games I’ve ever played. I even tried avoiding reels and shorts just to dodge spoilers, and it was worth it. The world feels alive, the characters are unforgettable, and the story hits different. The attention to detail is insane, even the little moments and random encounters pull you in. It’s slow at first, but once it grabs you, it becomes an experience, not just a game. Easily a masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best game ever, the scenery is amazing, the game play is so much fun if you like outlaw stuff and getting into shootings with the enemies. I give this a 10 out of 10 with no doubts. I have no complaints about this game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Was blessed to finally be able to play this game after 7 years of its release. One of if not the greatest single player experiences I've ever had. The story, the atmosphere, the characters was nothing short of a masterpiece with how well written each and every details are in this game. The world is so alive and it makes you feel as if you are Arthur Morgan himself. It is immersive as it gets. \n\nStory: 100/10\nGraphics: 100/10\nGameplay 9/10\nAudio: 10/10. \n\nI hope everyone gets to experience a game like this at least once in their lifetime. Truly a phenomenal experience. Thank you, Arthur Morgan and My Arabian Horse.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "RATING: 10/10 (For Single Player) | 5/10 (For Online)\r\n\r\nDo you enjoy emotional masterpieces that make you question the meaning of life?\r\nYes? Then buy this game. The single-player story is a tragic, beautiful, and unparalleled achievement in interactive storytelling. You will feel the wind, you will love Arthur Morgan, and you will understand why people call this one of the greatest games ever made. It makes you feel genuinely alive.\r\n\r\nDo you enjoy fighting flying alien spacecraft and teleporting griefers?\r\nYes? Then play the online mode.\r\n\r\nSeriously, the contrast is absurd. The story mode is a perfectly crafted diamond; Red Dead Online is a broken clown car filled with bugs and cheaters. It is the digital equivalent of finding a week-old hot dog on the floor of a bus station after leaving the finest restaurant in the world.\r\n\r\nPlay the story. Ignore the rest. Or not! Try the online mode, you'll quickly get fed up with griefers and bugs. But not with the gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like it because the sunset and sunrise\nAnd Arthurs redemption",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My all time favourite game!! The storyline, the characters, the graphics everything is so absolutely perfect. I cannot recall a single time where I haven't enjoyed the playthrough :) Highly recommend!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i can't believe i could experience something THAT good to be as a game, this is just the best thing i ever had to witness, and I'm so grateful for me n' my own decision on buying that game, cuz i felt a lot of emotions that i couldn't reach for with any other game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This might be one of the best games I have ever played (and I have played A LOT of games). The story, the characters, the environment - they are all amazing. I felt so immersed in this world. I think it is safe to say that although Rockstar takes a lot of time to make these games, they NEVER fail to disappoint. I will miss playing this game for the first time. If I ever lose my memory, remind me to load up red dead redemption 2 again. Thank you Arthur. Thank you Van Der Linde gang. Thank you Rockstar Games. I've had a blast.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Red Dead Redemption 2... Took me 7 years to finally get around to playing this. And I can say with confidence, I waited way too long.\r\n\r\nRed Dead Redemption 2 is an accurate title for what the game is about. Blood, death and redemption. It's a game that comes with depth. A story about a man who realizes that loyalty isn't worth it, if it's for a man blinded by greed. From characters that have a world of history to them, to the environment that takes place 30 years after the American civil war. The story makes the characters feel real and with that realness, it makes the player care about them. A rare thing to be able to pull off with a game, from my experience. Happy little moments, twists and turns and soul crushing conclusions. This game has it all.\r\n\r\nThe gameplay comes down to riding horses, doing a bit of gunslinging and making choices that shape out  who you are and how the game will eventually conclude. Though that's only the main part. The game is an open world one, meaning there's a lot of ground to explore, animals to hunt, people to run into and random oddities to find. You're free to explore the world without time limits, which is big bonus, due to the unhurried feel it brings to the game. Just remember to bring the right kind of equipment for the different environments. Wouldn't want to freeze to death after all.\r\n\r\nAlong with the characters and the world, the music also grows with you (Or it did for me anyways). I started off not really liking it and not really listening to it. Towards the end of the game however, I started listening to both the lyrics and the music itself. Turns out, Rockstar knew what they were doing. Most of the time, if not always, the music in the game fits what's happening in the story at each moment. Powerful vocal, distorted guitar riffs and American Venom. They cooked. Most likely another reason why so many people got hit so hard by the conclusion at the end.\r\n\r\nNow this being a Rockstar game, it doesn't come without its issues. The main one on pc being the memory leak issues. The longer you play the game, the more dedicated GPU memory it uses. If it uses all of it, the game crashes. Thankfully it goes up relatively slowly, but regardless, it limits the playtime according to the player's GPU. The only fix being to close the game and restart it. Other than the memory leak issues, I had trouble with the horses not going where I wanted them to, even when there was plenty of space in a gap between trees or rocks. Some other small glitches included characters not really sitting in the right spots (Uncle partly inside a box), the usual clipping and the player character falling over, when hitching the horse at Blackwater. Some black screen flashing does also happen, but more in borderless windowed mode, than in fullscreen mode.\r\n\r\nOverall, this game is really fucking good. It's long, but there's zero reason to hurry with it. If you want to just spend days hunting, go for it. If you want to explore the world, you're free to do so, though make sure you aren't wanted by the law. If you want to just do the story, that also works, but you'll miss quite a few interesting characters. It took me 65 hours to finish the main story, but if I tried to do everything else, it would be closer 120 hours. I liked the characters, the story, the environment, the attention to detail, the gameplay and the music.\r\n\r\nSo with that and the bugs in mind, this game is a strong 9/10 for me. I absolutely recommend this to anyone who wants experience the wild west along with a very impactful story and one of the best main characters I've ever had the pleasure of playing as. \r\n\r\nThank you Rockstar, for this incredible experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best stories ever told in gaming.\nBeautiful world, unforgettable characters, and an ending that hits harder than a train in Valentine.\nIf you haven’t played it yet… partner, you’re missing out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Slow but rich, authentic, detailed, captivating. Environment and story are great. Good job Rockstar.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game. Possibly the best I have ever played. \r\n\r\n100% worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing rdr2 for the first time unspoiled is the best thing that can happen to a person.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is fun for people who like story mode and also online. The horseback riding is enjoyable, and the details are very good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my favorite game of all time, I love the story of the Van der Linde gang, especially with Arthur's Redemption. This game has so much content that you can play through it 5 times and still not discover it all. This in my opinion, is the Gold Standard for not just Rockstar Games, but Open World ones as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 132 hours in Red Dead Redemption 2, I can confidently say this game is an absolute masterpiece.\n\nThe world is unbelievably detailed—every town, forest, and muddy trail feels alive. NPCs react, talk, and remember you. Even after hundreds of hours, you’ll still discover new random events.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’m currently on my third playthrough of Red Dead Redemption 2, first two plaaythroughs done on console and honestly, the fact that I’m still discovering new moments says everything \r\n\r\nPlus the jump from console to PC is so good, currently playing in 4k 240fps, WOLED monitor.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "insanely great pace story wise\r\ngreat storytelling\r\ncried & smiled multiple times throughout the main and side quests\r\nso much detail in every thing, the stories, people, scenery, literally everything\r\nfantastic game, 10000/10, i highly recommend to everyone ever :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best videogame of all time. Period. You can like others but this is the closest we are at achieving a real world simulator.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The controls are clunky as hell for a game that came out in 2018, but despite that, I think the story is pretty good, and the gameplay is alright.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hands down the best game ever created. The story mode is very entertaining and you will find yourself playing it over and over. Online is also a great time!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful story, scenery and ambiance. Wonderful details and even if some don't like the Gameplay, it's fine imo. \r\nI knew the story from watching Let's Plays etc. but it hits different when you play it yourself. \r\nOnly bad thing, u can't pet cats. Let me see Arthur being chosen by the cat distribution system :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought this back in 2020. Have almost 100 hours so far into the game. It's a very slow pace. Too slow for me personally to play a few hours at a time. I do enjoy the game however. There's a lot to do and i'm still only 24 percent into the story as of current(previous save was lost at 30+ percent and maybe 30 hours).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, Unique western game, epic one, nothing more nothing less you gotta try it <3 cant wait for the  3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "having somehow avoided spoilers for years since release, i have just completed this MASTERPIECE for the first time. one of the greatest pieces of art i've ever experienced. Arthur Morgan you're a good man <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It truly is a masterpiece I have always been interested in cowboys ever since i was young and this really hits the spot. I never got to any of the side missions til the epilogue but now its like the beginning again. Its just insane much content this \"game\" has i have over 100hrs and i still am getting new story features and experiencing things that I thought i wouldn't after the story \"ended\" + having played the first one after this really helps the red dead redemption story shine. It is time consuming but please buy it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Simply the best i ever played, without mentioning the high level of details and the great graphics. The story simply take your breath away and move your feelings and not many games can do that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game will change something about you, Hands down the best game OAT. It's insane that a video game can hold this much emotion that get's you so invested that you just want more and more. Once again another BANGER from Rockstar, I pray we get a RDR3 that follows the ending of RDR1.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Truly a masterpiece - 10 out of 10. \nThe graphics are like a painting, the music feels like a movie, and the horse - like a family member. \nAfter a dozen hours, I still return to the story just to go fishing, get lost enjoying the sunset and watch Arthur cook beans by the campfire.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Top tier production values. Great visuals and atmospheres. Very good writting and engaging gameplay. Pretty good all around. The only problem is the annoying rockstar account requirment and launcher pop-up everytime you want to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "masterpiece",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game that will set your bar for how games should be. Incredible story, incredible graphics, incredible game play.  Top notch in every way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the most well realized open worlds in a video game ever, combined with a beautiful and poignant story, makes this game well worth the time of anyone who picks it up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Red Dead Redemption 2 is a masterpiece from the basics of the gameplay all the way to the story and characters. I initially played the game on PlayStation and then recently have decided on a new playthrough on PC and it holds up tremendously well. Rockstar has created a vibrant, alive open world to explore full of surprising story moments to detailed in-world events.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the greatest game rockstar ever made , \r\nstory 10/10\r\ndialogue 10/10\r\ncharacter development 10/10\r\nall 10/10 , still in chapter 4 but i think something bad gonna happen with van der lindde gang soon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good game. Single player is great but the online is a mess. Still enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the greatest games of all time the voice acting, world, graphics, writing just get this do not skip this game it should be experienced by everyone fantastic job Rockstar!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The fact that this game released in 2018 is crazy. The amount of details in the open world is insane as well as the graphics especially the sunlight effects, it made me not use fast travel at all with all the random events you can encounter. Probably my favorite story in a Rockstar game since GTA 4, all the characters are perfectly written, even the secondary missions are worth doing and the evolution of Arthur Morgan throughout the game is perfectly executed. Probably my fav video game protagonist so far. Don't hesitate to play this gem you won't regret it. Now I have complete confidence that Rockstar will top themself with GTA 6.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is a beauty. Best visuals I've ever seen even though the game first dropped in 2018. And the story is the best I've seen in any game. The game is simple and fun if you only play the main story, and at the same time filled with interesting and fun secrets and side missions. The attention to detail unreal. The fishing and hunting are a full game on their own. Highly recommend if you love story games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Im new to gaming, but this game might be the best story i have every played. It just blows my mind on how good it is. Like the characters, there stories and everything is just chef's kiss. I love story games, and i do play this game even if the story ends cuz its just that great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Knowing the ending in advance makes it less enjoyable to continue playing. However, this is indeed a great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best game I've ever played. There is no game with a better story than this, plus this game has online so you can play with friends and have fun with them.\nI'll mention again, this is the best game EVER. Every character is amazing, every character has crazy voice acting, music fits every mission and background very well, this game has crazy ending, very fun missions, the game's graphics are among the most beautiful I've seen, and a lot more.\nI recommend buying the game to everyone, and yes, the game is 12/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 Game. Online is unplayable from cheaters/losers. Story mode remains the best thing Dan Houser ever touched.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got the game back when it first came out its still one of the best games ever made.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What can I say ... great game. Only playable on PC, in my opinion. Saying that, this game is incredibly buggy and likes to crash on a very new £2000, custom built gaming PC that has literally 0 issues.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After having over 600 hours on Rockstar Launcher, I decided to buy the game here as well and replay it.\r\n\r\nIt's always a blast, one of the best games of all time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Category,Highlight to Use,Why it's a 10/10 Feature\r\nStory,Arthur Morgan's Saga,\"A complex, emotional, and unforgettable journey of redemption.\"\r\nWorld,Unparalleled Realism,\"Every detail, from gun cleaning to beard growth, makes the world feel real and alive.\"\r\nAtmosphere,Visual and Sound Design,\"The graphics, dynamic lighting, and incredible soundtrack create a truly cinematic experience.\"\r\nValue,Sheer Amount of Content,\"Hundreds of hours of main story, side quests, hunting, gambling, and simple exploration.\"\r\nVerdict,A Masterpiece/Experience,More than a game—it's one of the greatest stories and open-worlds in video game history.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think the character of Arthur Morgan from Red Dead Redemption 2 has transformed my life. Ever since I first embarked on his journey in the game, I was captivated by his rugged nature, his sense of honor, and most importantly, his wisdom.\r\nIt was during the scene where he pulls off a daring train heist while humming a catchy tune that I realized I didn't just admire Arthur, I wanted to embrace my inner rogue. So from then on, not only did I start perfecting my poker face and speaking in sly one-liners, but I also dabbled in a bit of safe-cracking, horse rustling, and, well, liberating the occasional shiny object from unsuspecting folks. I began adopting a more stoic and thoughtful demeanor, speaking in measured words and showing kindness only to those closest to me. I also started honing my combat skills, learning survival techniques, and preparing my own meals – undoubtedly including campfire stew. I embraced a more practical style of dressing, donning weathered coats and relying on a pocket watch like Arthur's.\r\n\r\nI even began sporting a hat as worn and battered as Arthur's, wearing it low to hide my mischievous grin. I've taken to cooking my meals over an open fire, just like he would during those campfire moments. And let's not forget the wardrobe – I've embraced a more rugged style, with worn-out coats and boots that have seen their fair share of trouble. So people know not to get too close to me.\r\n\r\nAdditionally, I found solace in indulging in the simple pleasures of life, just as Arthur did by enjoying the beauty of the wilderness. Arthur Morgan taught me that true contentment comes from within, and I no longer feel the need for a romantic partner to find comfort. Since I started living like Arthur, I've become more purposeful, self-assured, and resilient.\r\n\r\nI encourage you to embark on your own journey inspired by Arthur Morgan. It may just transform your life as it did mine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still the best open world game to this day, period. A masterpiece in storytelling and character development with one of the best video game protagonist ever written.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Before playing it I thought this game was over-hyped. It is not over-hyped. \r\n\r\nThere's a feeling of guilt stemming from my buying this when it was on sale.\r\n\r\nVery good video game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a journey I've had with this game. It's probably one of the best, most polished games I've ever played. The attention to detail is second to none and still looks better than the majority of games coming out today.\n\nSome of the highlights:\n- Amazing story\n- Interesting characters and dialogue with excellent voicework\n- Immersive & beautiful open world that feels lived in\n- Easy and simple game mechanics\n- Endless things to do in the world\n\nNegative aspects:\n- Too many modders in Red Dead Online that it can sometimes be a frustrating experience",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "From a non-gamer, who just decided to try it because literally everybody in the media is recommending it, this game is just incredible, this is art, mastery in gaming industry. So much, so dense, so meticulous, deep, layered, emotional, slow, it has a lot. I can hardly recall a better way to tell a story in recent times. It is hard not to root for the guys who created this. This is art.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Red Dead Redemption 2 is a unique game that stands out in many ways, from its story to the most minute details that Rockstar incorporated into its development.\r\nBut I think where it really shines is in its protagonist, Arthur Morgan: what begins as a simple outlaw with an odd yet straightforward way of seeing the world ruthless, grumpy, and dangerous, yet loyal to those who share his lifestyle will ultimately become one of the most moving and profound stories I’ve ever seen in a video game, or even, I dare say, in the Western genre, not just in video games but in any other medium.\r\n\r\nThe Old West is a genre that has been explored even outside of video games, and in doing so we’ve come to know various characters shaped by the stories told. Among them, Arthur Morgan stands out because, despite starting out as just another simple character, he makes us reflect on the problems of the past and the present. The virtue of his character lies in his development: he goes from being a flat, one-dimensional outlaw with only a few significant personality traits to an Arthur who is finally able to think for himself and try to atone for the mistakes his past forced him to commit. As a result, even when we’re no longer playing, memories of the magnificent adventure we shared with him come flooding back.\r\n\r\nThe game was released at one of the best possible moments to highlight its story, values, and lessons; after several years of series and films that told the stories of notorious criminals pragmatizing their actions and leading consumers to glorify them, a phenomenon that occurs across all cultural media and even in society what stood out was the history of great criminals of the past. What was intended as an effort to show viewers their most atrocious acts and their evil instead became, for most, a tribute and glorification of their figures.\r\n\r\nAt the start of the game, it seemed like it was making the same mistake as that supposed golden age of the Wild West, showcasing its complicated exploits and how impressive and dangerous they were, but in the end it turns out to be a critique of the lifestyle of those outlaws and, above all, of the glorification of that era by American society and the best way to see this is thru Arthur Morgan.\r\n\r\nArthur is the kind of protagonist who’s hard to see as the sidekick to the plan’s mastermind or as the one around whom the plot revolves, because he’s the perfect helper you’d want as a follower cruel, ruthless, and efficient, yet still loyal to the gang and to his family. Despite all those threats, Arthur doesn’t do it out of personal pleasure or because he’s a sadist who enjoys pain; he does it to help those he considers his family, more specifically the Van der Linde gang.\r\n\r\nI recommend the game not just because I like it. I recommend it because, the entire plot, its Historical accuracy is one of the things the game can be praised for, not only showing us how most old western movies glorify that era, but also showing us parts that are not usually explored in depth in these reproductions, showing us not just one side or the other but showing its nuances and the historical temporal context.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Red Dead Redemption 2 is one of those rare games that doesn’t just entertain you — it absorbs you, pulls you into its world, and makes you feel like you’re genuinely living someone else’s life. A lot of games try to balance great gameplay with a meaningful story, but RDR2 is the only one I’ve played where both come together so naturally that you almost forget where the gameplay ends and the storytelling begins. And honestly, it’s the only game that has ever made me emotional in a real, unexpected way.\r\n\r\nRight from the start, the game proves it’s built differently. The world doesn’t beg for your attention or force non-stop action on you. Instead, it invites you to settle into its rhythm — a slower, more grounded pace that fits the late 1800s perfectly. Riding through snowy mountains, dense forests, open plains, or muddy towns feels like an experience on its own. The gameplay doesn’t rush you, and that’s part of its magic. You’re given room to breathe, to explore, and to connect with the world at your own speed.\r\n\r\nThe mechanics themselves feel deliberately designed to match the setting. Gunfights are weighty and intense, horses actually feel like living animals instead of vehicles, and simple actions like looting or cooking take a moment. Some players might call these little things “slow,” but honestly, they’re tiny complaints compared to what they add to the experience. These slower details ground the game and make it feel real — not just another fast-paced action title. You’re not supposed to fly through the world; you’re supposed to live in it.\r\n\r\nWhat separates Red Dead Redemption 2 from most games is the way it builds your connection to the character you play. Instead of dumping exposition on you, it lets you learn about him through the way he interacts with the world. The honor system, the conversations, the choices you make on the road, and even the quiet moments when you’re doing absolutely nothing — they all paint a picture of who he is and who he might become. You start to understand him on a level that’s incredibly rare in video games.\r\n\r\nAnd then there’s the cast around you. RDR2 has some of the most believable, well-written characters I’ve ever seen in a game. These aren’t just NPCs who exist to give you missions; they feel like an actual group of people with their own personalities, priorities, and histories. You’ll hear them chatting around campfires, arguing about something that happened earlier, or just joking around as you walk by. Little details like that make them feel real, and before you even realize it, you start caring about them.\r\n\r\nThat’s where the emotional side of the game hits hardest — not in one dramatic moment, but in the gradual, natural way you become attached to the people and world around you. It sneaks up on you. One hour you’re hunting or playing poker or getting into trouble in town, and the next you’re suddenly hit with a feeling you weren’t expecting. For me, it was the first game that genuinely made me emotional. Not because of some forced tearjerker moment, but because I truly felt connected to the character I was playing and the life he was living.\r\n\r\nThe world itself deserves just as much praise as the story. This isn’t an open world full of empty space or repetitive tasks. Every area feels handcrafted, full of things to discover. You can spend hours hunting legendary animals, fishing in a quiet lake, stumbling into strange encounters on the trail, or just riding across fields as the sun sets. Even when you’re doing “nothing,” it feels meaningful. The world feels alive in a way that almost no other game has pulled off.\r\n\r\nIf I had to point out flaws, they’re honestly tiny compared to what the game achieves. The movement can feel a bit heavy at times, and fast travel isn’t instantly available everywhere. But in a weird way, even those minor inconveniences add to the authenticity. RDR2 is a game that wants you to slow down and experience its world the way it was meant to be experienced. And once you embrace that, it’s hard to imagine it working any other way.\r\n\r\nWhat makes Red Dead Redemption 2 the best story-driven game ever made is how everything works together — the gameplay, the world, the pacing, the characters, the writing — all of it. Nothing feels out of place or forced. You’re not just watching a story unfold; you’re shaping it. You’re living it. And by the time the credits roll, you realize you’ve gone through something bigger than a typical video game.\r\n\r\nFor me, that’s why RDR2 stands above everything else: it’s the only game that’s ever made me feel something that lingered long after I put the controller down. It’s more than just a story, more than just gameplay. It’s an experience that stays with you, one that’s almost impossible to forget\r\n\r\n\r\n\r\n(i have 1000 hours on console)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I 100% recommend this game for the single player mode. The story is wonderful, the combat is snappy and rewarding, and the world is vast and beautiful. It's one of the greatest game stories ever told.\n\nHowever... the online is... a problem. The online is a buggy mess filled with hackers and Rockstar does absolutely nothing about it. The multiplayer has been completely abandoned and is just as unpoliced as the real wild west. Things break constantly. People will grab you and force you to open chests for hacked money and gold or kill you  repeatedly. I've had at least one person try and get me to give them my discord information through the social club too. Yikes. When you aren't getting hacked, you're probably being hunted by someone with hamster wheel internet that teleports around and won't let you get anything done. When you CAN get stuff done though, there's clear progression and a lot of fun to be had, you just have to be a little lucky, or log in in weird hours. \n\nYou might think I'm exaggerating with the amount of hackers in the online I'm talking about, but I'm not - I've been playing about 10 days now and I've had people strike me with lightning, blow me up with an explosive sawed off shotgun that set everything on fire. I've been captured by a black and white clown and a flaming man wearing a wolf head and dragged into the woods. I've had a woman with modded-ly large chest spawn legendary alligators in my trader camp and people shoot at me with cannonballs that spawn infinite money and gold chests. I've had someone make my horse have exploding squirrels come out of it's rear end. I've had someone freeze my trader cart in place then hogtie me in the woods and surround me with chests. I don't want to cheat in this game, but hackers harass you and then force feed you chests to try and make it seem alright. I just wanna be a humble hunter and trader! lol. I can't log in and do anything without someone grabbing my character and doing -something- to them. Is it because I have a female character? Maybe? But it's almost always me. I can be in a lobby with 3 other friends and I'M THE ONE THAT'S GRABBED!\n\nAll in all, buy this game for the single player mode, and only do online if you have a group of friends that are as patient as you are to deal with no-lives breaking the game to mess with you. If you're looking for a multiplayer sandbox where you can hang out in western times, unfortunately it's the ol' saying  of \"hell is  other people.\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I mean, this game is awesome, if you haven´t played this yet, you´ll enjoy the story mode, the gang and Arthur, you´ll love all the details that the game includes with the jungle, forest and a lot of stuff more",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Video Games have been a form of art and medium of entertainment for different generations in the past few decades, constantly growing and expanding on different forms of game mechanics, graphical design, audio visual experiences, and much more. Red Dead Redemption 2 is a successor in all of these categories and more providing a profound experience that doesn't feel like normal gameplay. This game delivers on a story that, through your own morality and ethics, questions not just your choices as Arthur the protagonist, but also as yourself.\n\nRDR2 does an excellent job at placing you in Arthur's perspective as you are left wondering what had happened to the gang to end up in the following chapters as well as the true nature of these characters as their past actions catch up to them. You are left in control of a character struggling with coming to terms with his actions both in past and present while actively not fully being able to control them, as if even though you play this character he is still his own man and you are just the controller.\n\nWhat RDR2 excels at the most is creating a compelling story that will leave you wondering, for better or for worse, what redemption really means. Is redemption and all that ensues a salvation from a previous violent past? Or is redemption a change of character in it's own right? Maybe all or none, but most certainly it is what you make of it. RDR2 is exactly that as well, a work of art where best commonly said \"beauty is in the eye of the beholder\". Maybe Arthur is capable of redeeming his past with the time spent in these chapters. Then again maybe not, but at the end of the day, you feel compelled to do everything you can to change the past for better or for worse. \n\nThis game delivers excellently on challenging the player's own emotions on empathy, and the perspective of violence, life, and death shifting violently and rapidly as the story progresses. RDR2 is not just a game that you play, it is a story that you experience and with experiences like this it's hard to not take some of it with you for the rest of your life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy anything for full price on Steam! I purchased the deluxe for EUR100 and a few days later it's on sale for EUR20.\n\nIs the game good - sure - it's a blast. Do I recommend that game, sure! I'm just pissed at paying more than I could have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "RDR 2 это одна из самых иммерсивных игр, в которые я играл, своего рода «Война и мир» от мира игр. История Артура Моргана своей глубиной не уступает произведениям классической литературы, и основная тема сюжета довольно необычная для игр в целом. Пожалуй, единственный недостаток это не очень отзывчивое управление, но на это можно закрыть глаза, потому что все остальные аспекты RDR 2 выполнены на высоте. Моя оценка - 10/10, ничего лучше Рокстар уже никогда не сделают.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Well, for such a rare type of legendary game, instead of reading the reviews, you should just grab it and start playing its campaign. I believe it's one of a kind, a game that offers a full immersion in the protagonist's story. The lore, atmosphere, graphics, mechanics, animation - everything is done perfectly. I strongly recommend completing all the main and side quests, and be ready to spend 50+ hours of your life, just like when you're reading an exciting book or watching a great series.\n\nI envy those who are about to discover this masterpiece for the first time!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best experiences I’ve ever had in gaming.\nArthur Morgan’s journey hit me harder than I expected, and I still think about his lines and choices long after finishing.\nIf you haven’t played this yet, you’re missing something special.\n\nSolid 10/10 – A masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "To reverse your horse in red dead redemption 2 you need to double tap r1 ps4 or rb xbox, and then pull the same button. In red dead redemption 2 horses play a vital role in exploration, transportation and gameplay, they offer a variety of breeds okay? With stats influencing their suitability for different tasks. Horse jockey. I am from cowboy times. Check out rope.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I finally played Red Dead Redemption 2 and I owe Arthur Morgan a personal apology.\n\nAfter years of ignoring everyone telling me this game was a masterpiece, I saddled up way too late. Now I’m sitting here wondering how I robbed myself of one of the greatest stories ever told for so long.  \n\nThe world is so immersive it feels illegal. If procrastination were a crime, I’d be doing hard time at Sisika. 10/10, wish I could wipe my memory and play it for the first time again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In my opinion, the greatest game ever made.\n\nImmersion on a level, unmatched even to this day, though almost 8 years have passed since its release. The graphics are absolutely stunning, the music is too and the story... I don't even need to say anything about it. The man story, the side missions, the honor system, the gunplay, the deadeye mechanics and all the plot twists, different gangs and so many other aspects make it stand out from other games.\n\nPlaying RDR2 was simultaneously the best and worst decision of my life... Best because it was the best game I've ever played, worst because I don't think any game will ever manage to match up to it.\n\nFor everyone who hasn't played this game yet: Please do it. You will not regret it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is an absolute masterpice 10-10! \r\ni really recommend this to anyone who looks for a game with an immersive story and excelent graphics/\r\nit may be a bit slow compared to newer games, but its definitly worth it!\r\npls try this game its so good!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautifully designed game, amazing story, lovable characters. I've played this game through many times and I will keep playing it until the next one comes out.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Because of Rockstar launcher failing to log in or connect to network I am unable to play currently.\r\nAll Rockstars games would be ten times better if I could just play it without having to install another launcher.",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "They can't remove my old deleted email from Rockstar Social Vista Club so I cannot play this game anymore. Steam can't help me either, resolution is to CREATE a new Steam accountand BUY the game again. \n\nGood stuff Rockstar.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Rockstar Games Launcher is the real pain. The game itself is superb, but to start the game needs luck most of the time fail to connect to Rockstar Games Library Service and it sometime crashes when playing, seems like the session expired or something because after it crashed I cannot run it anymore, best option for me is to keep restarting the windows and retry",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "I'm sure the game is great, but the Rockstar launcher is a joke. If you don't have access to the email account that was registered to the launcher and synced to your Steam account, you cannot play the game at all. Rockstar's support is equivalent to a wet sock and unless you have the exact dates when you registered your account and MFA, they will not reset the account sync, even if you provide proof of purchase and whatnot. Forcing game launchers for single-player games should be illegal. Shame on you, Rockstar.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "FIX YOUR LAUNCHER JESUS I CANT EVEN PLAY. IVE BEEN STUCK FOR 30 MINUTES TRYING TO CREATE A NEW ACCOUNT  IT DOESNT WORK I TRIED EVERYTHING. ROCKSTAR YOU ARE A$$",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "see this is a good game but rockstar launcher just doesnt launch it anymore and the launcher is completely broken which is needed for the game so i cannot in good conscience reccomend it",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Rockstar permanently removed access from playing this game (even offline) because I lost the email connected to the Rockstar account I had linked with this steam account and rockstar support, after numerous attempts to find a way to recover or unlink that account is refusing to help.\r\n\r\nSo yeah, if you buy this game and for whatever reason have issues with the launcher (which is forced upon you even if you only want to play offline) Rockstar will literally steal your money.\r\n\r\nWhich is kinda fitting in a poetic way.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Rockstar Game Launcher wont work, can't connect to services. I've done troubleshooting, nothing worked. so I can't even make it to the game itself. waited 3 or 4 days, no patch. not super happy",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So I was able to play the game once for about 45 minutes. I quit for the day and the next day I tried to load the game and can't get passed the rockstar loader. It keeps telling me it can't verify I own the game. I have tried everything in the support section and have tried to contact rockstar, but can't. I tried the discussion section and found out that once this happens it's a permanent problem that rockstar games won't help you with.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What the hell \"activation error this account is not entitled to red dead 2\" I bought the game. I am not going to spend time on support trying to deal with you activate a $15 game!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I tried unsuccessfully for six hours to get the Rockstar launcher to launch the game. I never got to play the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Multiplayer doesn't support crossplay, so I can't play with my Xbox friends. What a shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can never launch the game because of the Rockstar launcher not working. Why do I need an external launcher when I bought the game on steam. This is one of my favorite games of all time but having to launch it over and over until it works is ridiculous. Sometimes it just never launches. All because of Rockstars garbage launcher.\n\nNow anytime I want to launch the game I have to uninstall the launcher, launch the game to download it, it fails to connect again, restart my pc, launch the game and it will finally load. Rockstar get your shit together.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Rockstar fired 34 employees. the only thing they did: talk about their union and their work environment with each other. \nthis is classic union busting in the games industry. Shame on Rockstar for trying to do union busting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "great game until it randomly deletes all 20 hours of your progress and kills any enthusiasm you had left",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Before starting to play: this game *requires* the Rockstar launcher. And one Rockstar account can only ever be linked to one Steam account. If you played a Rockstar game bought from Steam in the past, you will need to use the same Rockstar account you used at the time. If you lost access to the email address linked to the Rockstar account and can't log at all, you'll need to create a new Rockstar account and contact Rockstar support from there to ask them to unlink your Steam account from the old unaccessible Rockstar account. Support came back to me after a week, but from there it was pretty fast to get the unlink.\n\nThen I hit an issue where the game started launching but failed before actually opening, without an error message. I couldn't find the solution by searching for it in the Steam Discussions, and instead found it randomly through Youtube, but here it is: https://steamcommunity.com/app/1174180/discussions/0/3714937078839799348/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Won't recommend on PC and for 2025. The game is slooow, and the commands are just horrible. The character feels stiff and frankly, nothing is clear. Okay it's looking good and everything but it's just getting me pissed off everytime I'm playing. It's a grind all along. No fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you already have a rockstar account fine i've heard it's fun, i wouldn't know, i bought this game cause i'd heard good things about it, but when i launch the game it launches the rockstar launcher instead, it says if i want to play the game i need to create an account, i tried to create an account, and it says \"sorry we are unable to handle your request right now\" i go to the rock star website and try to submit a support ticket, they say sorry if you want to submit a support ticket you need to create an account, i try to create an account on the rockstar website, it says \"sorry we are unable to handle your request right now\" after about 40 minutes of attempts i give up, im going for a refund now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Avoid buying any Rockstar games because if you run in to a technical issue, you are basically on your own.  I managed to play this game for 3.6 hours before the Rockstar Games Launcher started to give me an unable to connect to the library service error message.  It tried just about every fix I could find online but nothing worked.  The Rockstar support is absolutely non existant.  All you get are automated generic responses that offer no solution and they close the ticket as being resolved.  When it not.  Because I played this for more than 2 hours, I can't get a refund.  So now I'm stuck with a game I paid for that I can't play.  I have read in many sites how non-existant Rockstar Games support is.  In my opnion, Steam should remove all Rockstar games from their online store.  It's only making Steam look bad being associated with a company who isn't interested in supporting their product.  I'd give this game 1 star out of 5.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I barely even started but I have already met major pain points that make it harder for me to enjoy my game time.\r\nThe game forces you to walk VERY slowly in towns and camps, it really doesnt feel good to wander so slowly when you have to walk around and talk to NPCs for objectives.\r\nThe auto save rarely kicks in and most of the time the save button is locked because you have a quest in progress (so i had to sit there and play for another 30 minutes when i wanted to take a break just to save since the last auto save was 3 hours ago)\r\nThe save button is hidden so well i had to google it, and i sure as hell wasnt the only one given the amount of views on that youtube video\r\nthe UI is generally not so intutive i had to watch a youtube guide to get started with the game\r\n\r\ni'll give it another go and my review might change if the good outweighs the bad, but so far i didn't get that awesome game everyone was talking about",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The world design, characters, music and campaign story are some of the best experiences in gaming. \r\n\r\nWhoever came up with the idea of a Rockstar launcher needs to be fired and blacklisted.  The developer of that system also needs to be banned from game development.  The quest challenges also seem like they were written by an intern with a learning disabilty.  It is a shame because these flaws noticeably impact what would be one of the greatest games ever developed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game may be good, but their crappy account requirement policy that doesn't work and the whole \"I need to be online to play\" it's ruining the whole experience. \nI already have a steam account, they should integrate it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's something about how rockstar handles this game that really makes me upset. It is required to play the game almost exactly how they want. And I run into this almost every time I play the game, and it makes me so resistant to playing. If any future titles continue along this line, it will be a huge disappointment. \r\n\r\nThe scripting should be a little more forgiving and open ended. The world is beautiful, but how the player interacts with the story, is a far cry from prior titles. I hope it proves me wrong soon, but it feels like as soon as I have my own idea on how to handle a situation, the script tells me I'm doing it wrong. \r\n\r\nI had this complaint on launch after \"sneaking\" into a compound and failing because i didn't sneak where it was scripted. And I somehow run into this, every time I try to enjoy the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great Game, but......\nRockstar launcher is a dumpster fire.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Escape menu doesn't come with options and apparently it's because my CPU is too powerful and I need to disable E cores. No thanks, how about you fix your game. Lets hope I can get a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rockstar launcher stopped working and that means you cant play any R* game. tried all fixes and support is of no help.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't play it since it wants me to login with an email that I don't use for 10 years now. And there is no way to login with a separate account. This is dumb af",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the fxxking god damn Rockstar Game Launcher like piece of shit,do you know when you are playing the game offline sudenly you kick off by the Launcher.Are you kidding me? OFFLINE NEED WIFI    (╬▔皿▔)╯",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whatever you do, DONT play online. exploiters everywhere. Got my Honor to max and then some exploiter made me lose all of it in matter of seconds. and then i changed lobbies and get insta exploded. and this happened multiple times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "got stuck just trying to login to the rockstar account just to play the game. the 2sv process is paradoxical. to log in you need the 2sv. to get the 2sv you need to log in",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely phenomenal addition to the Cabellas franchise. Breathtaking scenery teaming with all of the beauty of nature sick of life and waiting for their place on the mantle. You just have to play some strange tutorial area where you go camping with the least charismatic man on earth before getting to it but hey-ho.\n\nIn all seriousness, I loved what I played, that being the hunting, exploring and all the fantastic side missions and treasure hunts along the way. As soon as I got freedom I couldn't help myself and just left whatever the main story was behind, only advancing it to unlock weapons necessary for taking down bigger game cleanly; a very annoying gameplay contrivance as you can only buy a gun when you get a mission where you may steal it or otherwise acquire it.\nAll the different challenges are a great adventure in themselves and setting out on a quest to hunt for the pelts needed to complete a costume set I wanted kept me engaged for hours, I didn't even realise there was a fast travel for a long time, the manual travelling was so pleasant; bonding with your horse, interacting with passers by, discovering new areas and enjoying the scenery and soundscape.\n\nSo after becoming a rich man, spending hours hunting, fishing and helping out all the people across the map, it's extremely jarring to then try and continue the main story where you are simply a bad person around a bunch of bad people. Everyone is full of excuses why they have to be extortioning, thieving, murderers and yet the game makes it no trouble at all to trip over success everywhere you look. \"Oh but you don't understand! It's the SYSTEM making them massacre a train full of fathers and husbands so they can loot the safe!\" Apparently there is some beautiful story about the eponymous redemption that also explains the downfall of your ex-gang members for the previous game, but I made it about three acts in, or whenever it is you move to the second camp, and couldn't stand another moment pretending this cut-throat scum was some wholesome alternative community just trying to get along in the face of some invisible oppression.\nThen there are the characters, Arthur Morgan goes from whily hardcase to imbecile toady to crying to a whore about his conflicts in killing small animals (while wearing said animals in a very fetching hat In my case). \"wutever you say Dutch\" \"I don't know Dutch\" \"Gee baws you so smert Dutch\".\nDutch is the aforementioned least charismatic man in the world. He always has the worst ideas, sounds like he's on the verge of tears, interjects loudly as if he's some inspiring leader despite his horrendous shrill quavering voice and yet inexplicably has the loyalty of the whole gang. The man is painful to listen to, what direction was the voice actor given?! The fishing trip in the boat was my personal hell. None of the relationships shown are organic and the backstory for why they are so attached to each other seems more and more implausible unless you conclude that these are just very bad people exploiting each other for a payout while sometimes deluding themselves otherwise.\nI could go on but it's not like there aren't likeable characters all around the game world, there are plenty of bad characters who are likeable even! it's just non of the main ones are (except maybe the cook), and you're expected to invest time in building their camp for them, doing all the jobs for them, risking your life for them and looking in the accounts book and seeing you're quite literally making 99% of all intake into the gang, only to go back to being a simpering henchman to awful people.\nI don't know how I'm expected to suffer hours of dialogue and Micky Mouse BS with these characters.\n\nI could honestly say, from what I've seen, the game would be much improved simply without any main story. The world is much better explored solo, it's people are interesting, it's scenery breath-taking, it's side missions and mini-games entertaining and the feel of the living world is something else; I must have had a dozen \"crossing into mexico\" moments like from the first game.\nThere seems to be a lot of people who really like the story and characters, they're wrong and must be masochists or morally reprehensible. There, I said it. Whatever tragedy befalls these people to turn them into the mass murdering psychopaths in the previous game is exactly what they deserved and I can only say Marston's character is degraded if this is his backstory.\n\nCan't say anything for the online side, maybe it's worth it, don't know.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT BUY ANY ROCKSTAR GAME!\r\n\r\nI cannot play a game I paid full price for. I open this game, I get a lovely little screen saying \"please log in to your Rockstar account\". I have never had one before, so I click \"Create Account\", enter in my info, and then get \"Error 1.500\" - which I have found no solution to online. I tried making an account on my web browser, and even on my phone - no luck. \r\n\r\nDon't buy this game if you want to actually play it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Rockstar launcher make it impossible to launch this game and loves to sell your data to others(it is in the disclaimer). I refuse to install another launcher just so my data can be sold to whomever it might be, luckely there are people with eyepatches and peg-legs who found a solution to this problem. F Rockstar",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst Multiplayer system I've ever had the displeasure to use. I'm sure the single player experience is great, but why do I need to go to a browser to accept friend requests? I'm going to wedgie rockstar",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great story, terrible gameplay.\ncan't play offline for some reason. I'll be sure to get a cracked version of Rockstar next game, not paying for that bs anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Among the most infuriating games I've ever played. The story is fantastic, as are the graphics. Thats it. That's all it does. It's a glorified visual novel and it would be better if it was just a visual novel. The movement feels like you're trying to control someone who is controlling someone else who is controlling your character, the gun play is lacklustre, running is tapping A simulator. Riding your horse is even worse tapping A simulator. You have limited control of time so waiting for the correct time of day for things to happen, if it isnt morning, is awful. The horse trips over anything slightly larger than a pebble, and takes 5 years to respond to your whistles. If someone shoots at you in a town, you have to handle it peacefully, or else you get a bounty. and if you do get a bounty you're on foot because your horse takes 5 years to respond to your calls and the lawmen are infinite so get stepping. I cannot put into words how much I despise this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wanted to try the game after hearing so much good about it, but I can't get past the Social Club activation error and none of the solutions posted by others fixed it for me so I've asked for refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wouldn't launch. I tried for days to fix it but it won't let me play, so yeah. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has been, and always will be a masterclass in game development and storytelling, I love it to bits...\n\nNow, I'm not recommending it because of the launcher,\n\nRockstar's launcher crashes every time I try to use it, which means I cannot play this game, because there is no way to not launch it through the launcher\n\nThis game is perfect, but the launcher is half-measure garbage",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have played this game before and have enjoyed it. Just recently purchased it on steam to play on my PC, but the rockstar launcher (that it required) doesn't work, I'm stuck on the loading screen for the launcher before I get an error that says failed to connect to gamer services. So I can't even play the game because it won't launch, I tried multiple work arounds and nothing was working. Sad because I did enjoy this game on my xbox when it first came out. Now if you can get the launcher to work then this game is great to play otherwise right now not worth it to buy an unplayable game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible rockstar games launcher account requirement to play. Service is always down and never lets you connect. If you buy this game, you will not be able to play it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game doesn't run. rockstar launcher riddled with issue and submitted tickets were marked as resolved when it wasn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game but the launcher is so problematic, so many people having issues with it including me. Amazing rockstar dont deal with this better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The thing is, RDR2 isn't a bad game by any means. It's a fun open-world title, with solid production values and a well-written story. Plus you've got to appreciate any game that makes racists look as utterly boneheaded as this one does.\n\nBut Steam reviews don't ask if the game is good. They ask if you recommend the game. And I can't do that. Not with the way Rockstar treats their employees. Not with the excessive crunch and the union-busting. Not with them behaving like the villains of their own titles.\n\nAnd there's the rub. It's a good game, a great game. A game that deserved every award it got. But it's a game that I can't recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I can't even really speak about the game as I can't play it. If the rockstar games launcher has to be troubleshooted every time I want to play the game then the game isn't worth it. They either need to get rid of  the requirement or fix their launcher.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When i launch this game it always gets me stuck on rockstar launcher , i don't reccomend it but i play it on my play station 4 and i wanted to dowlond it on steam also on pc to have mods.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game would be a 10/10 - IF Rockstar Games bothered to patch and address the traversal stutter - which is annoying even on high end hardware, which I have. Clearly there's a memory leak, something wrong with the async settings in the .ini file. Short of downloading the 'Stutterfix' from nexus, except tiny hitches when traversing the map from time to time. They are noticeable, and more common on horseback and in large, populated areas like Saint Dennis. The game needs to be patched and I can't recommend it at this time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an amazing game but its so fucking annoying that you need the rockstar launcher to play it. do not buy this on steam. get it on console and plug in a fucking keyboard.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rockstar & TakeTwo have officially started their union busting era. They no longer deserve financial support.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Now that you have seen my negative review, please allow me to explain why it receives this review. \r\n\r\nThe game is an amazing game, there is nothing wrong with it except for ONE thing.\r\n\r\nThe studio that made it.\r\n\r\nRockstar is literally the worst game studio to ever exist in human history, they are greedy, entitled and do nothing but spit on their consumers constantly. I never got to experience this games glory days because Rockstar decided to pull the plug on it while it was still young, and I mean...why wouldn't they? It's what they're good at. Making sure they do nothing but take and take and take from their consumers without ever giving anything back. I'll never get to experience outlaw pass, I'll never get to experience any of the perks this game formerly had, because Rockstar doesn't like their own consumers. \r\n\r\nThey genuinely hate us, all of us. \r\n\r\nIF you buy this game, buy it for the story, but don't even waste your time with RDR Online, there's nothing there anymore, thank Rockstar for that. \r\n\r\nOh and did I mention that most of Rockstars games are plagued with modders that Rockstar will NEVER do a damn thing about?\r\n\r\nModders are the worst kind of people, they do nothing but make everyone else suffer for their own amusement. But maybe they wouldn't have to do that if there was more to do in the online world.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you’re thinking about buying Red Dead Redemption for the online mode, don’t. Red Dead Online is a broken, neglected mess that never lived up to its potential. The servers are unstable, disconnections are common, and updates are practically nonexistent. Rockstar completely abandoned the game, leaving players stuck with endless bugs, griefers, and repetitive missions.\r\n\r\nProgression is painfully slow, with expensive items and unfair payouts that push you toward microtransactions. The world looks amazing, but there’s nothing new or exciting to do in it. Most of the community has already left because Rockstar focuses all its attention on GTA Online instead.\r\n\r\nIf you wanted to live the cowboy life with your friends online, you’ll be disappointed. It’s empty, unbalanced, and frustratingly broken.\r\nRating: 3/10 — Beautiful world, wasted potential. If you’re buying it for the online experience — don’t.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "All the cutscenes and walking around are tedious.  It's like 5 minutes of cutscene and 5 minutes of following some character around and then 15 seconds of gunfire.  Boooorrriiiinnnnggg...\r\n\r\nAnd I was really annoyed by this \"rockstar games\" app I was forced to install on my system.  It's pollution on my computer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game\nBut Fuck rockstar\nThey just left this game with so many bugs where I can't even launch it and when I do I get stuck on loading screens or error fffffff it's so stupid Fuck rockstar LIKE REALLY FUCK YOU ROCKSTAR AND FUCK GTA 6 I DONT WANT IT YOU KEEP DELAYING IT you know FUCK EVERYTHING\nEVERYTHING SUCKS \nI just wanted to play the cowboy game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DON'T BUY IF YOU HAVE INTEL 13th CPU.\nAs it hurts to give this game a negative review, i can't ignore issues with this version of this title.\ni bought this game (i even checked) on 20th december 2019 - it was the first time this game went on sale after releasing on steam. Back then i had a pc that was capable of running this game, but i wasn't satisfied with the experience i was getting, so besides me having over 50 hours at this game - i've newer finished it.\nNow that i got a better machine - I can't even run it - I get an \"Activation Error\" and game tells me that \"my account isn't suitable to play red dead redemption 2\" or something like that. Total bullshit and unacepptable state of the game.\n\nI researched this problem for more than a year now (yes i was trying to fix it for over a fuckin year) and what i learned is:\n\n1.Rockstar support is useless and is just copy pasting random fixes that will almost never work. I even had a feeling that they didn't read what i said and just shoved me another thing to try to tire me up.\n\n2.People on reddit are telling(one guy confirmed that with rockstar support) that it's a problem whith never cpu's and apparently what's happening is that \"the overspecced machines (all hardware newer + faster than when game came out on PC) do not have a high enough CPU usage at game launch. Why this causes an Activation Error is ridiculous but it can\" For this person what helped is running other game in the background and then launching rdr2. This issue is seen usually on intel 11th 12th and 13th gen (my current cpu is i5 13500h)\n\n3. I found other post (i think it was on a steam community ) and apparently cleaning rockstar social club cache fixes it - BUT you have to clean every time you want to run the game. This worked for me for quite a while but today even that don't help anymore \n\n4. According to PcGamingWiki reinstalling rockstar social club fixes it BUT you will lose your saves. I don't know if it helps i didn't try it because I literally replayed the first act over and over again that i think i rememver every scene and voice line and i don't wanna start over again (yes my 30-40 hours at this game are from playing 1st act, dropping the game bacause for example i failed to hunt legendary bear and starting over a couple months later)\n5. I had no issues on my old pc (amd cpu and  gpu) and on my steam deck game runs fine, so i'm willing to believe that new intel cpu's are affected by this shitty bug. \n\nIf you read this far, thank you and if you have new intel cpu, then i hope you won't have to go through what i had to.I think i'll stick to ps4 version (yes i bought an inferior version of this game again on a different platform just to finish it im that desperate)\n\nI'm leaving this review with allowed comments which is usually a bad idea, but if you had this issue and you're able to play the game, please let me know",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game, but Rockstar has to change it's completely bullshit, retard attitude about kernel level DRM. I will never buy another game made by these people until they make small changes that an intern could probably do, at a minimum, to make their games playable on Linux. Every other company in the world is getting on board with this. I can even play Halo with zero issues on any distro. Despite the setting of the game, it's not 1890 anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unable to play the game because it won't connect to rockstar's online service. I don't play any type of online mode.  insane that I need to even go through this process!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So many bugs and control glitches for AAA game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "rockstar game launcher punishing players who bough the game, because the game has already been cracked and cracked players dont have to deal with half the BS people who bough the game have to",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have a love/hate relationship with Red Dead 2. The single player campaign is awesome. Easily top 5 ever for me. As typical for Rockstar, the online could be the best ever but is far from it for many reasons. First and foremost, Rockstar treats gamers very badly. They do everything they can to make the game unplayable. They make success on basic tasks nearly impossible. They try to make it extremely frustrating to do the most basic things. I do not recommend even starting red dead 2 online unless you're the type of person that likes to shove ice picks in your ears or rusty forks in your eyes. That's a fail on you, Rockstar. Take a suck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overrated POS company that treats their employees like slaves and cracks down on unions illegally. Hard pass and should be avoided like the plague.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I got to play this game for about half an hour, but really only about 5 minutes of actual interaction. After killing the wolves and getting back to camp, I did a manual save and closed out for a bit. Now I can't get back into the game at all due to \"Social Club Error 1005\"\r\n\r\nI've been looking at many potential solutions out there, but none have worked for me yet. I remember having similar problems with GTA V. At least I bought it on sale...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game itself is great fun, but requires you to connect to Rockstar every time you want to play. Thus, 80-90% of the time, I get an error and can't play unless I spend half an hour restarting.\n\nMade a ticket with their tech support and they marked it as resolved without saying anything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorite Rockstar games to-date (next to Max Payne).\r\n\r\nThe negative review is for the awful DRM they've implemented, where you can't play SINGLE player if the Rockstar Launcher servers are offline.\r\n\r\nThe fact that there are people who pirated this game who can play it forever, while the people who payed for it are at the mercy of Rockstar and their DRM servers being online (for an offline game) is a joke.\r\n\r\nBuyer beware.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Forced to use to completely unnecessary and broken Rockstar Launcher. Doesn't work, tried everything, RS support useless. Refunding, might play by \"other means\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've learned not to trust people when they talk about \"good games\". \r\n\r\nThis may just be the worst gaming experience I've had in 30 years. \r\n\r\nHorrible game. \r\n\r\nIt doesn't want to be played. \r\nDesigned to annoy. Clunky. \r\nAudio issues that haven't been patched in 5 years. \r\nSo slow, so boring, so unappealing, \r\n\r\nI regret spending money on this sh**.\r\n\r\nI don't understand people who think this is a good game, including people very close to me, I don't understand what they think the idea of \"fun\" is, because it sure as sh** isn't slowly walking through snow, holding a bow for 2.3 seconds and immediately getting tired from it to a point of utter misery. \r\nWhat. The. Fu**.\r\n\r\nI quit the game 3 times during prologue alone, that's 3 chances I've given it. \r\nBut it's irredeemably bad. I don't give a fu*? about what other people say, I'm gonna be honest and keep things real, with no holding back.\r\n\r\nKeep your $8, I don't even wanna communicate the fu**king refund process with you, that's how bad this is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't start the game, No steam support available, Rockstar support was an AI that didn't even understand the ticket I sent in. 0/5 would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "OK so I BUY the game only for the convenience of not having to pirate it, but turns out YOU CAN'T PLAY, rockstar says I don't own the game so I cant even get to the main menu, and now I have to look for a tutorial on how to open the damn thing????? I paid for the game it should be instant, F this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nice game, but Rockstar will not help me get access back to my account after multiple attempts. Paid for something I can't use so...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "incredibly shallow and hollow game. sure the story is great then its over and your left with a half filled sandbox with a bunch of broken toys that arent even fun to pretend to play with. like sure i could go hunting, scout out a bear, track it down, use the right gun and ammo type, line up my shot and get a nice bear pelt to sell for 5 bucks. or i can loot like 2 bodys and make the same amount and what do i even need money for? half way though chapter 2 i got about 3k and upgraded everything at the camp to max and bought the best guns and never needed to use another penny again. why is it like this?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game itself is amazing. But when playing the game, you have to pray to God, so it doesnt just bug out. When it goes in the bugged state, the game loads and you can move the character, but thats the only thing you can do. Only way to fix it is to verify game files, which wouldnt be problem if it happened once, yet i have had to verify files 7 times in 25 hours of play time. Its so annoying, because the story and the gameplay are top notch, that i wished to experience without having the game bug out every few hours for no reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is a tripple AAA title that has a shitty story, frustrating game mechanics, and eventually just wears down any good will it built up with me. It bogs you down with \"realism\" designed to pull you into the world but immediatelly discards them for narrative convenience. \r\n\r\nTowards the end the story just meanders. I just can't anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't play the came because rockstar can't send a account reset email.\nhorrible forced game launcher",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, terrible company,\n\nIf you lose your email - don't count on support helping.  I will not (and can not) ever buy a *ockstar game again - because if i do - I can't use the linked account.  Absolute rubbish.  Was a decades long supporter, but now no interest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Third party software required. Idc how good the game is, if I have to install your software to play your one game, I'm downvoting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is not good. I can't even start story mode without it freezing. My pc specs are enough alright but the game just flips me off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While I have no doubts that RDR2 is a phenomenal game, both story-wise and graphically, there is a singular deal-breaker bug in which any event that causes the active window to switch critically breaks keyboard inputs when RDR2 is running, both within the game and in Windows. \n\nI've consulted with Rockstar Support, and I was immediately met upon a response from a Rockstar Support agent that was ENTIRELY AI-generated ( see image at https://only-exists.online/5pdbyprt.png ). Unfortunately, all further attempts to troubleshoot were ineffective. A request to unlink my Steam account from my Rockstar account was created, and I am currently in the middle of processing a refund.\n\nT.L.;D.R.: I have no doubts that the game is great, but the bugs are dealbreakers from the start and the support from Rockstar is far from optimal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sinceramente, é frustrante ter que fazer login obrigatório no Rockstar Launcher, não faz nem sentido, os caras têm quatro jogos, e cinco deles são o GTA V não justifica eles manterem esse sistema podre e tosco. Demorei uma cota pra conseguir jogar porque tive que recuperar um e-mail da época do Max Payne 3.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game legally on steam and can't even play it. Keep getting a activation error saying my social account is not entitled to play Red Dead Redemption 2. I have logged in to the website, Rockstar Launcher, and Steam. I have left all of them open and still can't get the game past this screen. At this point i have tried a few tutorials and even the support info on rockstars site. If the game starts working randomly I will still be annoyed about how terrible this process was to play a game I legally bought.......",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game worked fine for my 12 hours of play time, now I get an \"activation error\" that won't let me play.  The rockstar launcher has been broken since I first installed it with its inability to connect to the internet, but it still allowed me to play story mode. Now I cannot even get past the activation error to get into the SINGLE PLAYER story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: The game gave me freedom everywhere except where it mattered most — the story — and the cinematic tropes (especially standoffs) made the narrative feel artificial instead of meaningful. No wonder it is 50% cheaper on a discount than its predecessor! If you really want this title, buy it on a discount, it happens relatively often.\r\n\r\nNOTE: Played on Linux Mint with RTX 3070 and runs flawlessly.\r\n\r\nThis review includes SPOILERS!\r\n\r\nI went into this game blind, not knowing anything about the Red Dead series and only being influenced by the fame, how well received the game is and how many copies have sold. People are praising left and right how amazing RPG this is and I realize that this is not an RPG but an action adventure on rails since the player has no agency at all. But it gets worse: this game which is sold as a sequel to the Red Dead Redemption 1(RDR1) is actually a prequel to RDR1 with the main goal to portray the downfall of Van Der Linde’s gang. For this purpose, game introduces a disposable character Arthur Morgan who can’t do anything about it because the script says so and then to make it worse, game makes Arthur’s death meaningless by introducing not one but 2 (two) epilogues in which player plays as John who is a protagonist of the RDR1. These 2 epilogues are actually a prologue for RDR1. Who thought that this is a good idea? But it gets worse! The game has 6 acts in which the player plays as Arthur but 5 acts are artificially stretched and repeatable ongoing motifs, while the actual story of RDR2 happens in act 6! And that is also not enough but the technical brilliance of the game kills off the story. The game has all the tools implemented for extended cowboy fantasy where the player could have had his own gang, or build a ranch, farming/ranching, crafting, missions - all irrelevant because these things don’t change anything in the game. Later I found out that John is conditioned by the law in RDR1 to hunt down Dutch Van Der Linde, which he manages yet John is being tricked and his son Jack decides to go on a revenge hunt. So… why doesn't RDR2 follow the story of Jack instead of creating this prequel with disposable characters? Because, I must say, someone in Rock Star is rather incompetent to think how an amazing foundation can be used for a good story. So to sum up, Arthur as a character for 6 acts is a disposable irrelevant character. The game revolves around Dutch and his idiotic decisions, showing off how fake his “care about the people is” when several gang members die and Dutch himself leaves some gang members hanging when he could clearly help. To make it even more shallow, some gang members were killed and their corpse presented in a trope dramatic way yet it makes no impact as I don’t have any appreciation for those characters - one was killed offscreen delivered as a mounted corpse on a horse and everyone in the gang were shocked and distressed for losing a gang member, while I am like “Who?”. Even now I can’t remember the name of that character. And Dutch, always saying the same story like a broken record “We just need more money” and then proceeds to do the most idiotic thing that puts the whole gang in greater danger in each act. And then he talks about sailing to faraway places not knowing how far these places might be. Micah Bell is the main antagonist of the game and as soon as the player finds him, it is clear as day that he is trouble and very soon, again, it is clear as day that he is a psychopath. And even Arthur sees that he is both trouble and a psychopath and there is no option to address that. \r\n\r\nThe epilogues are something else. First of all I was just confused: why am I playing as John now? It makes no impact at all since Arthur didn’t have that many interactions through 5 long acts with him that makes it important to the player. This is when I looked up for answers online and realised that this game is a prequel and not a sequel. This was supposed to be some story for the fans of RDR1 I guess but it makes no sense since this is a sequel. Then the story sort of starts anew and then I have realized just how wrong this all was! This could have been Arthur! The mechanics are there already! Arthur could have splitted from the gang and fighting Dutch for independence. Or helping the local community (as clearly it is demonstrated by this mechanic when John works on a farm for David Geddes)! And then some sources on the internet point out that this was supposed to be possible but it is cut! This was supposed to be done by Arthur! And instead - we have an overextended repetitive story (Dutch needs more money and has a plan) that can not be changed because in their “infinitive wisdom” this is a prequel and in RDR1 and Arthur is never mentioned by anyone in RDR1 so it had to be on rails. And then there are these standoffs, I believe they are called Mexican Standoffs where everyone points a gun at everyone and waits for someone to blink. A Holywood invention that is so fake and does not make dramatic tension in games at all. The worst one is the one at the end when Sadie Adler gets John and Charles to hunt Micah. First of all John feels changed by then and it is out of character for him to go on a hunt. Then in the final confrontation, while Micah has John under fire, Sadie who came to kill Micah, points a gun at him and doesn’t shoot. Instant barf. This is so out of her character at that time. So Micah uses the situation in his favour, keeps her at the gunpoint and threatens John and out of nowhere Dutch appears and we have this standoff. And Dutch kills Micah! So not even that satisfaction is given to the player! Dutch could have killed John and then Micah and still he would have had an upper hand! This is so out of character. And then he leaves literally and leaves gold and money behind for John to take! Dutch… leaves money… the only thing he ever wanted and valued. These characters are so one dimensional and shallow.\r\n\r\nThis could have been an amazing game. Players could have had choices, technology and mechanics are there but it only hurts the game. Why not Jack’s story arch with all this tech and possibilities? This story of RDR2 should never have been a game! This should be a bit shorter as a movie or a TV show since everything is on rails.\r\n\r\n\r\nAnd then a lot of players tell me a story about how amazing this game is, how the story is and so on. It doesn’t give freedom as some point out, but restriction unless they never wanted to play the quests, which might be. Well, according to Achievements on Steam, at the time of writing of this review, only 20% of players finished Epilogue part 2. In fact, completion of chapters falls off as many RPGs so it is not special in that regard. It is not a big percentage of those who play online either, it’s around 30%. It is a waste of potential and a waste of time as the game doesn’t revolve around the player at all. It could have been an unprecedented cowboy experience, instead it tries to be a tragic drama with no impact infested with repetitive motifs and tediousness. \r\n\r\nTechnically it is extremely well optimized - something that most modern game studios don’t do. Because of it, it looks really well even on older hardware. I just had very few visual glitches, none of them were game breaking (i.e. light sphere displayed in a cutscene instead of being rendered as an actual light). Also, controller support is ok. It's just weird when the context menu does not appear when it should cause frustration in certain moments. Game menus are horrible! Organization and unnecessary sub - menus are such a drag - I hate it. And then, some features are not displayed in the player stats (like how positive or negative a player's character is, instead it is briefly visible when a player does a good or bad deed). Also, the fact that the player can not save the game once the quest starts and it is quite frustrating especially during the epilogues.\r\n\r\nWhat a shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like EA or GTA V online if you lose your email to your linked social club, you just cant play! \n\nNot without support emails etc, and I like playing on steam. I'm sure the game would be fun, great discount Rn.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have wanted to play this game for so long, and finally bought it on sale - but it turns out the Rockstar Launcher is a real pain. It gave error messages for every action: logging into my existing Rockstar account, linked account, password recovery, and new account creation. Fortunately, Steam was cool and refunded my purchase.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever made but I cant recommend it because you cant kill micah until the end of the game. So shit tier game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has beautiful graphics, realism and that's about it...\n\nI tried to play the game but the unskippable scenes and boring story makes it feel like i am watching a movie instead of playing a game. The developer seems to only be focused on realism and does not seem to care about gameplay at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rockstar make it almost impossible to login. It had an old email I used over 10 years ago and don't have access to. There is no simple system to tell the launcher 'this is not my email' but instead you need to go ask for a load of support online and just wait for them to bother helping...  Even when I asked for support on their site I got 3 errors before getting through only for the ticket to instantly 'resolve' ofsetting blame to google authenticator... \r\nNo human read that and they clearly don't care. last time I but from any company which require a login for a game I literally paid for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game however the online is very buggy. I've had mutiple times where i start a mission in a posse and it disconnects me from the server along with my friends and the mission is failed. moonshine missions twice in a row now the wagon wont let me operate it nor will it let me use my weapon. There's also an issue with hackers blowing you up randomly. This type of stuff is game breaking and needs to be addressed. the story itself is amazing but the online needs some work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "playing offline is great but there are way to many bugs, glitches and hackers online. youre lucky if you get 20 minutes of gameplay without someone or something ruining your experience. oh and dont expect these issues to be fixed as rockstar has totally abandoned the game. 10/10 offline, 0/10 online.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story gets really repetitive a third of the way through and the story feels incredibly linear not letting you make your own or even smart decisions.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, but game will NOT Launch.  I keep getting a Rockstar Library Services \"Launcher\" error.  Would not have purchased, but it was on sale for $15.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's hard to start. I got to the point where a black screen would flash and I would crash. I couldn't play it for a minute. I tried everything but nothing helped. This game is a crappy one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not recommend this game.  At least not if you plan to use a Linux laptop to play it.  Nothing but headaches in attempting to get this game to run. My frustration has peaked and I am now uninstalling.  Makes ZERO sense as I can run Cyberpunk 2077 and Baldur's Gate 3 with no issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculous how they cannot fix a simple issue with their launcher.\r\n\r\nGame is unplayable due to their incompetence. Great job, Rockstar. \r\n\r\nTo the \"no-buy\" list.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a great game but i cant even get the rockstar launcher to work. I tried uninstalling and got it to work one time but the next time i tried it wasn't working again. i go to the support page and all of the links just take me to a white screen no matter how many times i refresh. I've checked reddit and alot of people have been having the same problem for almost a year. Rockstar, please fix this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh 4.4 hours of gameplay, i've done 2 missions. This game is trash and the user interface is completly retarded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot play the game because I don't have an account in Rockstar. And I cannot create an account because it fails when I try to do it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fucking stupid system. i just want to play offline mode but i cant because apparently rockstar thinks im not allowed to play the game i bought",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is far too clunky and far too slow to be worth the time. Maybe it's better on console, but it really isn't fun. It can take several tries to move the right direction, like the game doesn't understand the inputs. Your character basically crawls unless you sprint. The control symbols that appear on the screen are not intuitive at all, so I had to repeat missions because I didn't know how to hit the button in the manner they wanted. You tap shift to speed up so it activates the sticky keys prompt on desktop. And in case you're thinking of trying it out, the wasteful bog of an intro will burn through your refund time long before you get through it. I sat through this because I knew the intro was the worst part, and the concept seems awesome, but it's just not fun. I am done with Rock Star after this one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Having an issue where actions lag out all to hell. The only thing that fixes it is changing any setting in the game to force the action queue again. It kept getting worse and worse until I can't even get through a conversation let alone a quest. I can't get on my horse, the menu bugs out entirely. If I'm really unlucky I'm stuck crafting or doing something I can't use the menu at all for. Then I have to wait several minutes for the action to work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Online is absolutely garbage. There is a someone modding in every single server. Animals will not load making the game unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the story, but the gameplay choices are frustrating. I do however love the game with mods. Can't stand Red Dead Online though.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}