{
  "positive": [
    {
      "review": "This game makes my autism sing. My grandpa had model trains, I have Terra Invicta.",
      "voted_up": true,
      "votes_helpful": 53
    },
    {
      "review": "This is intended to be a neutral review. \nAfter my third or fourth restart I have finally played a campaign all the way to the end!\n\nTo start with, this game tries to be a lot of different things, in a way that is very unique. It's a geopolitical sim, two different map painting games in one, space combat sim, logistics game, among others. While this is great, I feel that certain aspects of the game need a LOT of work. \n\nThe good:\n- Strangely addicting even in aspects that feel repetitive, like the early-mid earth management.\n- You feel a real sense of accomplishment as you progress.\n- The early and mid game are both fantastic and feel completely different to each other.\n- The simulation of earth alone is ridiculously complex in a fun way, it doesn't get boring. Even after finishing the game I wanted to reload just to fiddle with it more.\n- Absurd level of detail in the solar system, virtually every object in the solar system is available.\n- The alien hate/retaliation system is actually very well thought out, though it could be better explained through hints in game (Since it's metagame info). I think the devs did a good job of making it relatively hard to lock yourself out from progress due to aggression.\n- Despite the tech tree flaws, it creates a sense that there is a massive alien tech difference at the start by by the end you are out-competing them.\n\nThe neutral:\n- Climate change exists, it is more of a debuff than a problem. You can effectively slow it down but not feasibly reverse it for most playthroughs.\n\nThe bad:\n- Virtually zero automation, beyond just councillors. At the very least I think there needs to be a way to set up automated fleets that rally at a given point, merge, refuel etc. The tasks themselves do not need automating IMO as 90% of the clicking was just telling new ships to merge at their location individually, without merging to say \"the defence fleet\". Having templates for fleet names by ship class and grouping these would be great.\n- Very poor UI/UX. You cannot even do things like select multiple armies, which is one of the most annoying things in the entire game. If selecting multiple entities is not possible, simply having a button to move ALL armies of ONE nation to a given point would be great. The only possibility for this currently is moving all from one tile home/somewhere else. You can also right click tabs in the ship designer to see charts of parts that you can sort by attributes, I found this by ACCIDENT.\n- The tech tree is bloated beyond belief and pacing makes for poor gameplay. Unfortunately or more likely by design, most of the early to mid space tech is completely useless. You can make initial suicide vessels easily, then later make a viable defence fleet for the body it's manufactured at (earth, mars). After this point, there is about 10-15 in game years of useless technology before you actually reach drives and weapons that make attack fleets viable.\n- Sieging titan was so difficult that I was almost considering it a bug. 40+ ships with siege coils did nothing while 10 ships with marines destroy the base in 5 days.\n- Enemy councilors continue to be annoying long beyond the point where that faction is irrelevant on the global stage.\n\nSuggestions:\n- Add another game mode or option when starting that compresses the tech tree instead of speed up research. Organise drives into type (i.e. Chemical, Ion + Mass Driver, fission, fusion/hydrogen). Select 4-5 of each type and lock that down. It does not even have to be a strict progression, just having 20 rather than 70+ would help a lot. Throughout my playthrough I think used 5 different drives in total. I personally don't feel like the game needs tooltips with suggestions for drive use-cases, but that could also be nice. \n- Rebalance the end-game drives. The Pion Torch and Protium Converter Torch have similar applications but both take very long to research. The Pion has a ridiculous install cost but low mass (open cycle), while PCT effectively makes refueling free but by that point the Helion drive is good enough for general attack use anyway.\n- Ship templates to show new players example designs would be nice.\n- In terms of tedium, the only part of the game I hated was actually the end game. Once you clear jupiter, the rest of the game feels like a slog as you are mostly just waiting for your ships to move around the outer solar system, or mass producing attack fleets. I think if there was a way to better \"compress\" the experience this would go away. I could have played more aggressively, but it feels like there's just a lot of waiting the closer you get to the end of the game.",
      "voted_up": true,
      "votes_helpful": 46
    },
    {
      "review": "Terra Invicta is one of those unique strong games that make you ask, \"Why isn't this idea more common?\" Imagine if a UFO crash landed in an undeniably well documented area of the planet today. How would the world react? What would you do? What kinds of factions, organizations, and treaties would form? There's a lot to the imagination there, but this game does its best to give you an inkling of what that might look like!\nI may not have a lot of hours on it, thats mostly because the game is such a densely packed experience, but I've seen plenty of campaigns by other people going well into the 2100s. Its amazing how the planet changes in just a few years let alone decades. \n\nWhat do I think needs improvement?\n- The international diplomacy mechanics. This game is set up around the capabilities of certain private organizations that push their interests on the world to respond to the alien threat as they see fit. Fine. But I think it would be better if the game acknowledged that some long standing things are not going to just change over a few turns or even (at least) a decade into the game. Take NATO for example. In a hypothetical scenario where the USA somehow adopted an authoritarian government led by the Initiative (an unrealistic scenario I'm sure, but bear with me), it is in the interest of the initiative to break their alliance (IRL that would be NATO) with the rest of their non-initiative controlled allies. So if Canada, France, Spain, and Turkey were randomly controlled by the Resistance in this hypothetical scenario? They'd randomly break their alliance with those while keeping the rest of their allied network with the rest of NATO. You see the problem? We've managed to somehow side skirt 70+ years of diplomacy and hegemonic millitary alliance because a game mechanic encourages you with little to no modifiers that discourage that act. This game doesn't need to be HOI4 or some other paradox game, it does a great job of forging its own identity, but this is one glaring issue I would call to improve on in the future. \n\nWhat do I love about Terra Invicta?\n- Without posting the copy pasta that got me into this game, I would invite you to think about the year 2100. In one game, that might be one where the world is dominated by three major great nations, who have become entrenched in a long war against the aliens. Climate change has wreaked havoc, Florida has sunken (the game has beautiful graphics that change as climate change inevitably swallows the Earth. A coalition of Academy led nations have set out to improve the quality of life in regions that were 'left behind' on Earth, using their political leverage to slowly fold those impoverished lands into their hold. South America, long ago unified by Colonel Hanse Castillo has gone on an ecological crusade to burn the surrounding regions of the Amazon to prevent the Alien flora from choking out the last native stronghold of terrestrial plantlife. In this world, humanity is winning, but it will never be the same again. \nIn another game, the year 2100 is a dark age where light of humanity has been quenched by nuclear fire. The literacy rate has plummeted because no nation thought it useful to put stock into welfare and education. What little polities remain that hasn't been gobbled up by an alien directorate are a few space stations floating around Mars and one interestingly bright star flying away from the solar system. In this world, humanity is losing, and it will never be the same again.\nThere is so much variety to this game, such a simple question it asks: \"What if aliens landed tomorrow?\" and what complex answers it offers. I can't recommend it enough, its my favorite game to think about and I only wish I had more time to play all the beautiful stories it offers.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Terra Invicta is a hard sci-fi, grand strategy game set in an alien invasion of modern day Earth.  At a high level, the game is split between a map of the solar system where you build and direct space stations, mines, and fleets of of ships and a geoscape where you gain control of and direct the resources of nations on Earth.  \n\nThis game is hard.  There is no learning curve but several learning cliffs that you smash into and climb over as you hit walls with the different mechanics.  It throws you into the deep end and you stay there.  The aliens will throw you curve balls as they escalate their invasion that initially you won't have any idea how to deal with and be left scrambling.  You will be punished for mistakes that you made in game years and real life hours ago and your best laid plans will turn to ash in front of you in an instant.  But little by little you figure it out until your wins start to out number your losses and you reach the victory screen. If that sounds like your brain damage then I highly recommend this game.\n\nTerra Invicta is a niche game for a niche audience and it does it very well.  You'll either love it or hate it and props to the publisher Hooded Horse for letting the developers cook without dialing it back, watering it down, or chopping the game up into dozens of packs of DLC.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I have played this game intermittently since early release. It has everything I love. Grand strategy, tactics, and politics to a T down. I have thoroughly enjoyed my 240 hours of play time and plan to add more. I truly appreciate these devs who put their heart into this game and made an incredibly unique and great experience within the grand strategy gaming world.\n\nThank you!!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "very solid core, a bit rough around the edges.\r\nUI could use some work",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For most people It's a very hard game to get into, because it requires to read a lot and think. they are a lot of techs that are completelly bad, if you take those roads like developping some drives that are bad thinking they might get better later it's just tech investment that you have thrown out of the window because some drives are completelly obsolete from the start even some you can get after 20h of gameplay which is really cool for the first few times you play the game but once you know you know.\nthere is a crazy amount of technologie and different drives energy sources weapons... I mean it's crazy\n\nEven the game plays out is kinda hard as you don't really know what to expect from the aliens, as the times advances they make more and more moves towards earth and usually the first few times you play they just crush you and once you get into space it gets even more complicated specially since the AI was improved and now they crush you there also.\n\nit's a very unique game, I love evey minute I put into it, it's already a finished game now they mostly polish and balance things.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Excellent grand strategy game in space. It's the space / sci-fi Europa Universalis 5.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is one of, if not the best 4x space game out there. It does take hours to learn the basics and get good at the game, but once you learn it you'll loose yourself in the game. It starts on Earth with an alien crash. You take control of nations and defend your interests from the ai or attack their interests instead. You will make your way to orbit and then to the moon, mars, and beyond. The faction you choose will heavily impact your win condition, and thus playstyle. A normal playthrough can take up to 30-60 hours, but there are plenty of settings to speed things along, such as the accelerated start and a 2077 scenario where humans already started space mining.\r\n\r\nThis review barely scratches the surface, but if you want a space 4x game then this is it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game has some obtuse tech tree nodes, some do really little and you need to come with an already planned roue to get what you want. The UI is filled to the brimm with so much info that might confuse at times, or overwhelm at the beggining, and over all the difficulty curve is more like a polished ice wall, where you are going to need external tools or wikis to help at times.\n\nBut it is really good as a strategy game, and once you have an idea on what you need to do, you might be able to enjoy it as much as others have already done.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First off, this game is big, long and wonderfully complicated, though still clear in the designs. Love the UI and its getting clear and clearer, however would love a better idea of how \"good\" different engines and weapons on ships are compared to each other as I can't really tell without going to an outside page.\n\nWith that its very enjoyable, have done hundreds of hours and only had my first space battle (which I lost badly) my last play \"through\". I have way too many games to remember where I am every time so restart with what I've learnt.\n\nThis is a great game, worth getting if you love strategy and slowly creating a new world order where people don't fight other against the bad guys I love :P",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is the ultimate \"defend the earth from an unknown alien invasion\" for me. While it has elements of XCOM (the devs are the team behind the long war mod for XCOM), it has elements of CK3/EU4 (nation-building), the true stand out part of this is the pure depth, and the attention to realism while still remembering its a video game that is being played for fun. Its difficult, and even unfair at first (ofc the aliens have an initial huge tech and economy advantage) but it is never unwinnable. If you have the space flavour of autism like me you'll love this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The major problem for this game is that it great but it can be the greatest game of all time!\nThe story and the prespective are captivating ( 3 body problem similar story ) You are not the good guys vs the alieans or the United Earth vs the alliens. \nYou are the hidden fractions of humanity. How cool is that ?! \n\nI have played a lot of strategy games, city/colony builders, 4X, space games (EVE etc)\nSo I enjoy depth in games with mechanics that you want to explore and you need to make perfect. \nIf you like researching on guides after guide on optimal ways of doing things and builds, setups ,ship and navy compositions then this is a playground for you! \n\nIt is not for everybody. But for the ones it is , it is the best expirience there. \nIf the dev teams spend some (more) time on making tutorials , update theis guides and making QOL imporvements then the barrier that keeps a lot of players away will be lifted. \n\nOne Requests that I have is to add a ship designer that can visualise ( with X-Y axis) how a ship behaves/move. How fast can accelerate and how far it can move. Then add in the same graph an allien fleet so I can know at the time of design if I can intercept it or not! \nIt is heart breaking on spending 3 afternoons gathering resources, technology and then wait for the fleet to be build just to learn that my ship is good for nothing! \n\nI can feel that the team is a passionate engineers that love what they are doing ( and I am envy on that ) but I can also feel that as most engineers they add a lot of depth and mechanisms and do not like to document them :-) \n\nThank you and keep up the good job.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game three weeks ago. Look at my current playtime :)\n\nGame good, do recommend if you enjoy complex games with a lot to learn!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "By far the best civ style game I have played. The Earth stage is great, but I would prefer if there were less negatives for consolidating nations into mega nations. I would also like it if there were some way to better defend interest larger nations.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Look, is this an easy game? No. Is it simple to learn? No. Is it quick? Friend, you better believe: also no. However, there is no other game that provides what this game provides. From a cold war-esque start to a space race middle, to a fleet action late game, you can live your dreams of a future you want to make.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "a hard and time consuming game i reccomend the mod on workshop that doubles how fast the game goes along with the fast campaign setting just search time on the workshop \r\n\r\nmy only conplant ither then the slowness is earth wars beign hell to micro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely steep learning curve aside, this is one of the best games I have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a slow burn game. Be prepared to spend hours o ftime creating a grand stategy to conquestion the solar system,a and fight aliens along the way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent game, its like the other side of xcom.\n\nReally reminds me of an obscure game back in the day called Aurora 4X... except the aliens are already here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I  do not exactly recommend this game as its not for everyone. Play the tutorial or watch Perun gaming's videos. Good game but complicated, hope they continue to add features/content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, extremely time consuming and requires many restarts and playthroughs to really understand a lot of what's going on. But man, when things click and your harebrained schemes actually pull off or your councilor gets that much needed crit roll on the 1% purge mission. It's magic.\n\nThere's a lot to critique still, the tech tree is a little absurd from the standpoint that there's like 50 drives that are basically useless. Combat is quite literally impossible to figure out, I basically just auto resolve. \n\nThat all being said, I can't stop playing. So take from that what you will. Numbers go up gets me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't a game that doesn't respect your time, as a lot of people seem to be saying, instead it is a game that respects the breadth of the systems that it has employed without skimping much on each part. I will admit that the early game can seem kind of tedious until you start to unlock space colonization and you struggle to know what is in store for you, but this game has incredible depth. \n\nEach turn I'm simultaneously managing my efforts on Earth to unify Africa and maintain my political and military foothold on other parts of the world as the Aliens slowly start to take over entire countries, while also managing a wide colony of habs and space fleets to defend my important points. \n\nThere are a lot of fair criticisms though, such as convoluted UI that doesn't seem to have been put together with a lot of thought or cohesiveness, while also not giving as much information about certain mechanics as I would have wished. Along the same lines, the tech tree and the whole tech tab is just wildly unintuitive. For some reason I can't choose to research items from the tree itself which is super annoying. Maybe I'm just missing something there. \n\nThat all being said, I was able to play and learn this game with no youtube tutorials, which is kind of unheard of for me cause I'm kind of an idiot, because the tutorial does a really good job of guiding you through what your next goals should be. \n\nAll in all this game isn't really for someone who doesn't have a lot of time. I found it while looking for wargames that specifically require a lot of time and dedication, with campaigns that I could play over the span of months, and this game delivers. Also there really isn't anything like this game at all, it really is the only one of it's kind so it's hard to compare to other games, so if you are looking for a game that is like that one game you really love, this isn't really that but I'm willing to bet that if you gave this game enough commitment, that it'll reward you back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most complicated strategy games I've played. It's so addictive. Run away while you still can! ;-)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're fine playing 20+ hours of world conquering diplomacy before you get to your first space battle, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Terra Invicta is a great mix of large strategic picture and intense space combat. I bought it when it first went early access and have loved ever second. the learning curve is real, but give it a try and stick with it. its worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but needs to be more optimized for performance and the tech tree needs to be cleaned up a bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story and very different ways to play with each faction combined with interesting mechanics combine into the currently best scifi strategy game imho.\n\nSure it still has edges and the complexity is very high, but is it also very rewarding when you play it. Just beware that the game even warns you a full normal campaign can take more than 100 hours to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The depth of this game is actually insane. It's a strategy sim, a space 4x, and an espionage thriller all in one. The tutorials are pretty good, considering the number of mechanics. If you want to play a shadow organization that's saving the world from aliens, this is your opportunity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just release candidate 1, so this is just a preliminary review, but the game is truly excellent so far. I've been learning the Earth-based part of the game, which is deeper and more complex than I expected. It strongly reminds me of Paradox games, only a bit less complex so far, and much more polished. I didn't notice a single bug! The interface felt awkward at times, but I that may just come down to a learning curve. Although some things like nation management can come down to nothing more than doing a bit of math and making adjustments as I go, there's always a trade-off, for instance between choosing whether and how to keep control of the world-wide research to guide it down favored avenues, as opposed to just sticking to myself and researching whatever specific, ground-level techs the larger research give me access to. The AI seems to do well enough with the present systems to pounce if I leave something neglected or unattended. After 51 hours I still haven't really left the Earth-Luna system yet, and the only competition so far has been the other six unruly factions, so there's another huge part of the game waiting once I head off into deep space. I'll write another review to cover those systems later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game for anyone that loves 4X and science/space.\n\nThe best about the game is that it sets a very science based setting which borders scifi, but never reaches there - everything feel grounded but at the same time grand and fascinating. It abstracts a lot of common 4X and grand strategy pain points and micromanaging leaving for you the most interesting geek stuff to play with.\n\nI have been playing it since around 2022 and have seen developers doing great improvements and listen to the community. There is still roughness on the edges, but in general game came a long way during alpha and I am sure will get into 1.0.0 much more polished than many AAA nowadays.\n\nps\njust updating this for awards badge xD game is -35% right now btw - total steal, grab asap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, a little slow for sure, but the lore is awesome and the ways that it interacts with the game are great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was always one of those odd balls that considers the original XCOM UFO defense to be one of my favorite games of all time. The atmosphere alone had me hooked-- aliens are coming, we don't know why, all we know is that they don't wish us well. Pitting you against the aliens like David vs a cyborg Goliath on steroids. That game made you use every little scrap of cunning, knowledge and a healthy heap of determination to win. It felt like a legitimate achievement to score a win against the aliens.\n\nSo, when it came out that the people behind XCOM long war- one of the most challenging mods for the XCOM remake-- were making a game of their own, and a hard sci-fi (I adore hard SF) one at that, I was over the moon and probably all the way out past the orbit of Pluto! I do think they delivered here, but not without some caveats that I will get into.\n\nLets start with the good:\n- The atmosphere is immaculate, and exactly what I'd expect from a 7 flavors of illuminati vs Aliens-- backstabbing, betrayal, engineered wars, it's great! How it all plays out in game though, is another matter that we'll get to.\n- The science makes my inner nerd jump for joy, It's one thing to stomp an incoming alien raid, it's quite another to know exactly what tools you're doing it with. Also, the pencil of death space ship design is just fantastic.\n- Quite a bit of difficulty to be found here, it's not an easy game, which is great! The reward wouldn't taste as sweet otherwise.\n- Complexity to lose yourself in for hours on end, an excellent time killer. There's so many systems here to mess around with, each rewarding in some way\n\nMoving on to the bad:\n-Unintuitive UI, and not enough management help tools. Turns could take as much as an hour depending on how much stuff you're managing. It got to the point where I kept a journal on my desk for noting down all the alien fleets I had to intercept alone, and another sheet just for my territorial management/agent action plan\n\n-Split between ground game and space game, it really does feel like you're playing 2 different games once you get to space. Bar stuff like money and research, Earth has very little impact on things in space\n\n- Could use a bit more teaching resources for newer players to consult. This game's learning curve feels less like a curve and more like a mountain.\n\nAll these things can definitely be fixed though. Even as it stands, it's a great game that challenges you to learn and adapt. I highly recommend it for anyone who loves Sci-Fi and has the patience for it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's confusing and idiosyncratic. Things are poorly explained and after nearly 200 hours of gametime while also watching other people's walkthroughs I am still discovering new mechanics and have yet to actually finish a game. So take all that into account, it has the complexity and learning curve of a paradox game but without the polish and millions of tutorials made by tens of thousands of players. There are times you will be frustrated and occasionally blindsided by what's happening and sometimes the external guides are also super confusing so you just have to take a guess and see what happens. It's particularly bad for shipbuilding and drive technology and if you happen to pick shit research paths you'll get kicked in the dick come the mid-late game.\r\n\r\nWith all that said though this game is grand unlike anything I've played. It's the kind of game I dreamed about while playing xcom and reading through the expanse books and underneath the confusion and a bit of jank there is a true gem. If you watch some playthroughs of it I think you'll  know immediately if this game is for you or not. It won't win over anyone who isn't pre disposed to like this particular niche. It leans really hard into it but if you've been looking for a hard scifi grand strategy game (you know who you are) this is it. Nothing else comes close. It isn't perfect but it is something special.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Ive owned it since release and seen it evolve into 1.0 and its a game I keep coming back to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fresh look on gaming against aliens. UI could be more user friendly and have some more utility. But overall great game that I like to return to whenever new update comes out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My most favorite grand strategy game. \nThe developer actrively develops it for years and will finish it. \nThe updates are good and they listen to the community and the updates tackle points which needs improvement successfully.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've enjoyed this game for a long time in Early Access and it was already a gem. Doing what Paradox can't seem to do - make grand strategy a strategy.\n\nTheming is on point, seemingly unstoppable alien horror. While the aliens work from the shadow, you are the one trying not to be noticed by them, it's so very very good.\n\nThe stories the different factions bring are varied and valid, making multiple playthroughs an easy sell.\n\nJust a wonderful game, if you enjoy any of the genra here, I recommend giving this a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the game, It has great lore and atmosphere and visuals. If you want a game that feels like a realistic space invasion sim this def fits the bill. Be aware that It is very long and can be unforgiving. I would not play it if you are not willing to lose and have that be a part of your learning experience. I believe over all it is a worthwhile experience if you are willing to learn its mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Instead of describing the game I'm going to try and summarize my learning curve since this game has a reputation for being difficult. Now I'm not an experienced 4x or RTS player at all but I think that reputation is overblown. In my current save I made at least 2 big mistakes that cost me a few years in-game but it turns out...that doesn't matter much. Aliens don't start treating you like a threat until you are one so if your research is lower than it should be or it took you an extra year to get control of the country you want (USA/China/EU in most cases) that's alright. In my case I completely forgot that taking control of a country is easier when you first control their smaller neighbors so I needed to get Canada and Mexico before the US.  That cost me at least a year.\r\n\r\nBeing late meant there I couldn't colonize the moon or Mars at the same time as the other factions, I ended up with a couple measly bases on Mars and that was it for awhile. I was looking at the intel screen which shows resource income for all the various factions and most of them were light years ahead of me. Quitting seemed like the logical thing to do.\r\n\r\nBut I wanted to keep learning the game before I reset so I continued. A couple years go by and I notice I've ended up with a lot of tech for these interesting fellows called \"space marines\" and just enough engine tech to manufacture a spaceship in orbit and then send down to planets...where all those juicy Mars bases are.\r\n\r\nOne space dock and a couple marine transport ships later and what do you know. I own Mars!\r\n\r\nSome time has gone by since then and the aliens are more active now. I still can barely scratch them so I'm accepting my losses and trying to seed more bases where I can. It's starting to feel like I might lose again. But I'll keep going. I learned my lesson the first time, if the ayys want my planet they better eradicate every last one of my assets or I'll find a way back. \r\n\r\nSo if the difficulty is the only thing holding you back then I recommend diving in. The systems are fairly complicated but the game itself is very forgiving. Keep that wiki open and be prepared for some reading and you'll be building a palace on Mars in no time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game. Games can take 10 hours or more, I find the space stuff to be the most enjoyable, also you can build some empires to clean things up on earth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a long review! I really enjoyed the one game I played (~125 of the 133 hours on record after ending a short campaign after I got the hand of things). This game is gonna be a powerhouse at launch.\n\nThe bad: Honestly the 'worst' part of it was lategame, which I found very tedious - the aliens had a bunch of <100 value fleets that would constantly donk any station I tried to build unless I had a fleet babysitting it for its entire construction, and it was just a lot of tedium to clean everything up after I had already functionally won. I had some frustration with alien admin and nukes, but I've heard that's fixed on experimental. There's also a lot of UI work to be done (again I've heard experimental is working on this), but controlling armies and fleets was a chore lategame. There's work to be done as well on clarifying how some of the mechanics work in game, from how farms actually work, to the fact that spoils income isn't shown in your income estimate. Also, and I don't know a good fix to this - the priority system needs work.  When the 'correct' way to play (25% min investment to make an impact) is wildly different from what you expect/what the AI does (many categories with 6-20% investment), it indicates an issue. Part of it is UI, because \"0.0000793\" is not a value that should be used to tell a player anything ever, but part of it is just that the magnitudes aren't intuitive. Also, magnitude wise, don't even get me started on antimatter. Oh, worth mentioning performance degrades lategame.\n\nThe fine, could be improved: Space resources were very disconnected from earth, and while it was interesting that different resources 'peak' at different points in the game, it was weird to have boost be nearly useless at some point. Depending on your system roll you might not notice some resources existed. It would be cool to be able to sell resources to pay for events as they were happening, for example, or to let you substitute resources for direct investments. \nI also got the feeling like some factions cared more about some resources than others, if that's actually the case I'd love to be able to see those differences. Diplomacy between human factions was OK, but I'd love more depth there - the ability to make alliances, or make peace with a faction (where lore relevant).\n\nThe particularly good: I really enjoyed how every strategic layer had an entire game's worth of depth involved. Every time some new section of the game opened I was very impressed that it wasn't just a shallow addition, but an entire new Thing to Do. I loved seeing Jupiter and sending probes but discovering how the aliens reacted to settlement. I think the timescales in the game (even if they're silly for IRL development) felt very impactful - the changing council cycle, or the pace of events in general. The international diplomacy was good and interesting. I also liked the idea of the priority system, even with the issues listed above. Ship design was fun, and the autodesigner was good enough to start from. The entire early-midgame alien investigation portion was a highlight, I wish it didn't disappear at a certain point (when it became pointless to interact with them at all). I also liked the flow of human factions starting as major opponents before the danger of the aliens increases. The game also did a great job of allowing player comebacks from dramatic losses if played smartly.\n\nOverall a game I'm going to happily play again in the future after some more time in the oven. It feels like an Aurora4x made by people who actually wanted to make a game that was fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am not entirely sure where to begin. \r\nThe game is rather deep, but not, overly complex. There's a lot to do, but, it never really overwhelms you.\r\n\r\nThe AI is, a bastard. I do not think it cheats overly much, even if I have often found myself cursing at the Aliens for being \"FRIGGING AY's!\". Their job is to screw your plans up. They often manage. Oh and ofcourse the oddball faction that decides. \"HAHA, HAVE NUKE\". \r\n\r\nIts a good fun game, even if its one of those best played with a documentary or a podcast. There can be lots of downtime early game. But it is incredibly satisfying when you get to slap an AY.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the coolest and one of the most difficult Grand strategy games ever made. Deep lore, crazy strategies, a massive solar system to play with. If you enjoy alien invasion scenarios, grand strategy games, space simulations, intricate lore or complex game systems, this game is for you. There is a lot to love here, but also a lot to learn. Don't expect to take this one easy, even on easy mode. They keep making the game better, and still have more planned for the future. Man I am really looking forward to the \"future\" cold war and far future invasion scenario starts, that will only make this experience even better. Try it out people, the developer's have cooked, and are still cooking!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best grand strategy games out there, love the combination between earthbound and space development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Terra Invicta is a game with incredible depth and breadth. There is really nothing else like it. If you enjoy strategy games, space games, political simulations, tactical space battles, building games, The Expanse, etc, you will probably enjoy Terra Invicta. It is a complex game and it will take dozens upon dozens of hours to play through a scenario, but in the end it's that complexity that makes this game special. That might mean it's not for everyone, but if you've dreamed of a detailed strategy game set in a near future solar system that truly simulates the whole solar system, this game is a must.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best way to spend hundreds of hours getting ready to purge the solar system of insidious aliens (or insidious people who hate aliens if you'd rather). Bonus points for real solar system scale and all the challenges that this creates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most intricate, deepest, most complex strategy games I have ever played. A highly engaging world map, thoughtful mechanics, wildly deep space layer, all supported by a group of incredible developers. The world map layer alone is so detailed and complex, you could disable the aliens and rip out 99% of the space layer, and still have an incredibly enjoyable grand strategy title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A difficulty curve like a brick wall but well worth it once it all clicks.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "devs please add more custom campaign options. i am too retarded to mess with game files",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hanse is Hot and wants to recreate super earth. Glory to humanity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In depth and complex geopolitical and space colonisation simulator. Would recommend all day to anyone interested in grand strategy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strong Recommend, dont let them aliens have all the good stuff, anyone who can mod a non painful UI should be president 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "allows me to bully humans and get bullied by aliens \n10/10 Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The earth defense fleet I drove several countries into the ground building got wiped out by a single alien scouting party. Mankind's century of humiliation begins.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't get overwhelmed with all the decisions and mechanics the game throws at you. Just make decisions and try to figure out what the impacts of those decisions are as time passes. Once you get a handle on the ground-game (there are quite a few aspects to it), count on having to restart to learn how to do the space-game, because you'll likely be behind.\r\n\r\nThere are no consistent strategies to the game, strategy is entirely based on what faction you are playing. Most of the decisions you make will be about whether to capitalize on your investment or reinvest, while avoiding getting into prolonged engagements (vietnam) for low reward.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you like stupid levels of complexity?   This game maybe for you.\r\n\r\nHOI?  Trivial.  \r\nWITE? Child's play.  \r\nDCS Modules without tutorials and in aircraft outside of your native language?   Pfft, come at me bro.\r\n\r\nPlay Terra Invicta and have no idea what you are doing. Just like the rest of us.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely unparalleled sci-fi grand strategy.\nIt's Europa Universalis meets Xcom meets The Expanse; insanely complicated and utterly glorious.\nPut in a few hundred hours during early access, and now not so patiently waiting for the upcoming 1.0 release before sinking a few thousand hours more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one heck of a large learning curve but the more I learn the more fun it seems to get. also runs well and is very playable on the steam deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun and unique game, but it has its issues. The system for designing ships is by far the game's best feature. \r\nNow on to specific issues:\r\n1- Balancing. The Aliens are simply too strong, on Earth but especially in space. Playing as the servants, the only real challenge was abandoning nations fast enough to not completely overload control point capacity! In order to build up a fleet that can stand against the Aliens, you really need several sites on the Jovian and Saturnian moons. But the aliens absolutely refuse to let this happen, even when avoiding direct conflict with them, having a small space presence, and researching all the misdirection techs. You kinda just gotta keep throwing colony/assault ships at the wall until you get lucky and one gets through. Until the very late game, you're also pretty much entirely at the alien's mercy in space. Their ships are far more powerful, and also far more mobile so hit and run tactics are a no-go.\r\n2- Space combat. It's pretty hard to control the ships in 3d during combat. Essentially the only options are to hold position or let AI control (and the AI can be pretty dumb)\r\n3- AI factions don't seem to do much. They'll have enourmous resource stockpiles, but engage minimally in building fleets and fighting other factions (which can be particularly annoying when the Servants are rapidly closing on victory and no AI seems to be doing anything about it). And they'll have like 50k of a resource and maybe be willing to trade you a few hundred if you're lucky. \r\n4- The research tree is massive, and it's not very intuitive what to research next. I like the amount of research available but until several playthroughs it's almost impossible to know how to get to cruical tech (such as point-defense arrays). \r\n5- Lack of scenarios. Hopefully the 2070 mode will be a great improvement but I want to be able to start with some technological parity with the aliens and fight them off rather than spending 50 hours wrangling control of the Earth first. \r\n6- If you crackdown on a point you should be given priority to taking it back. It's extremely annoying to have a point lost, and you immediately react to take it back, only for a faction that you're at peace with to take it first (in the same mission phase) and now you can't take back your country without breaking that truce.\r\nNow that seems like a lot but I will still say overall a good game and I look forward to how it will continue to improve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had the game since early access release and put over 100 hours within the first month of release, this game scratched an itch I didn't know I had and is currently one of my favorite games and am looking forwards to the full release. Kudos to the devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "favorite strategy game ever, occasionally frustrating but incredibly addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Complex, confusing, opaque, and overall excellent. Fantasically fun game that does not hold your hand.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a super deep game with tons of mechanics to explore. The campaigns are long and gameplay and priorities change from early game to the late game. You'll start out scrapping for territory and building a decent economy or military early on, then you're focusing on developing space assets, and finally fighting the aliens across the solar system. Terra Invicta is a really unique game and they are doing a great job!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A sprawling hard scifi grand strategy game dripping with that Long War grit. \n\nBonus: You get the best \"Expanse\" 4x on the market by accident.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I suggest you play this game, truly. If you are interested in 4X games, and have an inkling of interest in astronomy -- I recommend this game wholeheartedly! \r\n\r\nA great game as is, with updates to come. The game is mechanically rich. Many different ways to play in terms of strategies in the micro and macro venues (e.g., taking over the world via espionage or warfare, choice of fleet loadout). I can easily see the game being adapted with total conversions (e.g., Halo) that use these great mechanics. \r\n\r\nInteresting story with some twists along the way. Some creative factions in there such as Initiative, Academy and Protectorate along with the more conventional factions. Though, the Protectorate's goal is not especially compelling and so I cannot see myself connecting with them.\r\n\r\nBuilding up your fiefdom on Earth and in space is good fun. Combat is interesting and offers many options. Allowing the AI to control your ships is also welcome for those of us that are not great at micro or are playing on slow hardware.\r\n\r\nThe modelling of the solar system is also fantastic -- if you are interested in astronomy you will dig it, and, it is an impressive mechanic for gameplay that further serves to offer you choice on how you build your solar empire. There are many different stellar bodies with modelling based on reality. Kuiper Belt objects are also modelled with some creative liberty -- because in the real world we don't know what their surface looks like -- but the devs have created a diverse set of appearances for them regardless!\r\n\r\nThe inclusion of lesser-known political ideas such as the United Arab League, East Africa Federation and Westralia also are engaging as speculative fiction that is tied to our real world.\r\n\r\nImprovements to be made in a few area. UI/UX needs work. It is often a bit clunky in key elements (e.g., cannot auto-organise Habs/Army/Fleet list nor can you organise it by dragging, menus such as the Habs/Intel don't remember where you were if you close them). Story voice acting and events also seem to die off once you unlock your victory condition, those were a fun part of the early game so it is a shame they vanish in the latter stretch. Enemy overworld AI can be funky in that they engage in endless pointless wars, and Humanity First especially really seems to struggle at establishing any firm foundation on Earth and instead end up limited to poor peripheral countries. Also, being able to change over an outpost from manned to automated would be a convenient addition, instead of having to dismantle it and then find the relevant asteroid, then resettling it. More explanation in-game of certain mechanics would be useful as well (e.g., the speed of a councillor mission being related to success chance, thrust vs delta, how control points are allocated after a coup).\r\n\r\nOverall, a great game that kicked off Hooded Horse! Thanks for the hours of fun!\r\n\r\n(Note: experienced on normal difficulty, as Resistance)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Im not into RTS games, but THIS GAME has taken over 120 hours of my free time away from me from just how ENJOYABLE the gameplay is. The game looks difficult but you'll pick up the gameplay loop very quickly though!\r\n\r\nYou play as one out of 7 playable factions to fight, exterminate, exploit, befriend, appease, or submit to a technologically superior extra-solar threat that intends to take over the solar system as well as the little rocky planet we call home. Gather your allies and resources and build up the growingly contested resources of earth and the solar system to fight back against the alien scum that intend to take control of planet earth!\r\n\r\nGrow the economy and latent potential of earth's nations under a unifying cause as you attempt to control the competition. It's not going to be easy... easily several thousand hours worth of gameplay and interesting scientifically accurate future-tech to explore... do expect to restart a couple of times at the beginning.\r\n\r\n4.5/5 crunchy crystals",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The aliens and space combat is cool. But really the best part is making your illuminati organisation conquer earth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely daunting to learn. you will never feel like you know what you are doing. i love it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is by far my FAVORITE game i have ever played.   SOOO Complicated... SOOO Deep... SOOO Good!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 would dominate the solar system as extremists again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good me refund and stupid for it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If I could nominate this game for \"Best Game You Suck At\" every year, I would.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and I havent even played the space part yet",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Finally have the time to put into this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "prepare for a 100+hr ride. U like Geostrategic decisionmaking , now on a System wide scale, then this is what u need!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dude, yeah, buy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Complexity that tickles my brain",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The tism go crazy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best strategy experiences",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "epic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5X strategy here",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply a fantastic game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Heroin Victa.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bomboclat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I LOVE KISSING XENOS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a level of mechanical complexity and emergent strategy that I have not seen rivaled by any other game. It is essentially an illuminati 4x, space colonization, and space combat sim stapled together.\n\nThis game's learning curve is incredibly steep, and a playthrough can run up to 100 hours to completion.\n\nThat kind of commitment isn't for everyone, but if you're on board for that it is an incredible experience.\n\nMy one critique: Devs, you have got to drop the war with minmaxxers. When you nerf techs and councilor actions in response to the most fine-tuned, 1000+ hour player time players, you are simply gimping the experience for everyone else.\n\nDon't be like EU4 where entire mechanics are simply not worth engaging with because they have less than 5-10% chance to do anything. \n\nMinmaxxers will ALWAYS find a new cheese, the only thing you are NERFING long term is the FLAVOR of the game.",
      "voted_up": true,
      "votes_helpful": 123
    }
  ],
  "negative": [
    {
      "review": "I really want to like this game, but the intentionally obscured mechanics lead to way too many 'screw you, that's why' moments. If you look up a recent(!) meta guide on how exactly you are supposed to win, you can play, as the older 'tricks' are patched out. If not, you will struggle, lose, and rage quit.\nThe worst part is that your mistake was a few hours ago, so you basically have to play the last 4-6 hours again. \n\nNot to mention the other factions feel like helpless idiots, so you spend the game 1v2 with the servants and aliens (as any faction basically), and the others are there as filler, or to troll you on a purge. \n\nCredit where credit is due, the two tier research system is interesting, the ship design properly follows hard sci-fi. There are flashes of brilliance, buried under a lot of problems.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "I wanted to love Terra Invicta, but I can't in good faith recommend the game. Over successive rebalances, patches, and new versions as they work towards release (now at Release Candidate 1 at the time of writing), it honestly feels like the Developers are playing [b]against[/b] the players more than anything.\n\nThis is supposed to be hard. That makes sense. A technologically superior enemy of this kind should absolutely wipe the floor with you for a long time, and you should need to be very smart in order to survive to the point you can start to contend even your own orbits... but the constant frustration I have is that [b]nothing works anymore[/b] and if it does, it will get patched out soon. \n\nAny time the players find a decent strategy (not too overpowered, not too gamey), it gets nerfed. This is due to the back and forth between a diehard minority of experienced gamers with thousands of hours in TI trying to find \"the way\" to win, which the developers then nerf and patch out... again and again. That is [b]not the spirit of the game[/b] - if after 1000 hours, you find a way to min max and win, congrats! You get a medal. \n\nPavonis, you need to remember you're making a game for the wider \"hardcore strategy\" audience who don't have 1000 hours - the approach to this game should not be so narrow and continuously narrower because a tiny minority have found that next new min/max approach to win. I come back periodically and every time the player base finds an approach that may work, the developers nerf it and buff the aliens. [b]Are you making a game for your players, or making a game against your players[/b]? It feels like the latter.\n\nAs an example, even with the max in Targeting Computers, the Alien ECM has become so strong that your ships will just float there useless and get blown up, even when you're floating by each other, as your missiles [b]and shipboard weapons[/b] will be disabled. Additionally, it used to be that with the right tech level, well armoured defense arrays with mid-tier weapons tech (green arc laser and coilgun) could at least contend against a small handful of alien ships, but it's like they're only for show with no actual power. You might as well not build them, were it not for the harassing human AI factions.\n\nThe UI is clunky sometimes, but that can be overlooked, because honestly this is a very unique concept for a game... but the \"no fun allowed, suffer instead\" again and again with the rebalances and the nerfs is maddening. You have to relearn the game every time you come back because if something works, the devs will get rid of it.\n\nSave the hundreds of hours you'd need to try and find the [b]only acceptable[/b] 0.1% min max approach to \"win\" and go play something else that gives you fun instead of frustration.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I really want to like this game and it fits into a particular niche I've wanted, but the developers have the same \"no fun allowed\" and the nerf everything useful to the player mentality that the Helldivers 2 devs have.  \n\nThere are 7 human factions, 4 of which are ultimately anti-alien, 1 seeking to escape Earth, 2 pro-alien.  However they are completely useless in actually fighting the aliens and act more against the player than anything, EXCEPT if you are playing the Servants in which case the other factions are completely irrelevant and an easy win for the aliens is guaranteed.  Even by RC 1 they still don't build any decent stations or colonies, still don't prioritize mining and space resources and in previous versions would eventually just stop building anything in space even with 60K (600 kilotons) of each resource in storage.  In RC 1 they do build ships but I've seen autoresolves on fleets of 20 ships from corvettes up to destropyers with artemis torpedos, UV arc lasers, MK 3 railguns lose to a single alien destroyer and two gunships.  I have never seen any computer-controlled human faction win any fights vs aliens.  Also, computer-controlled human factions still have far too low research value to do much of anything past 2030.  \n\nAlien surveillance/abductions were always a threat, but now they are so accelerated even on normal campaign difficulty that no amount of defenses against alien influence research can protect your nations from simply being stolen with no effort by the aliens in 2033.  Oh, and they no longer use destroyers, but cruisers for surveillance missions, with multiple laser/PD escorts making the suicide torpedo ship runs unusable.  Also, aliens in the RC1 version on normal build far more ships, far more quickly than they did in my previous brutal campaigns, while space mining sites AND space mining orgs have been HEAVILY nerfed to where you're barely able to do anything in space at all.  This is total bs.  \n\nThe devs are only listening to the few elite players who keep screaming about how so many things are too good for the player and should be nerfed.  Oh, and they are using the Helldivers dev playbook of using \"realism\" against the player in game balance, but somehow never allowing \"realism\" in favor of the player, as a cheap excuse for artificial difficulty.\n\nAlso, in the research tree you'll find research for all sorts of ship parts, weapons, reactor cores and drives.  Nearly all of these are noob traps to \"gotcha\" new players.  Sure the tungsten resistojet is cheap, but on the lightest ship it is still completely useless - you won't be able to go anywhere or even move with any sort of speed if somehow you could.  And the dusty plasma drive is a complete joke - a drive that only uses fissiles as fuel, with an acceleration so low it would take months to get a stipped down gunship out of Earth orbit, never mind getting to anywhere else.  The fissiles nerf is such a huge hit that I have a hard time justifying drives which use fissiles even as 1% of their fuel now.  This hits hard with fusion drives in particular, where for some inexplicable reason, human FUSION drives were nerfed to require up to 10% of the fuel load to be FISSIONABLE material.  Oh, but of course the alien fusion drives magically only need water still.\n\nA lot of the early non-fission drives are just there to waste your research points.  Missiles are only there to waste your research points.  Hypergolic torpedoes are only there to waste your research points.  First-generation lasers are only there to waste your research points.  Oh, and in late-game, the plasma weapons are only there to waste your research points.  You think that you're getting an advanced end-game weapon?  Think again!  It got nerfed into being so completely useless, even MK 1 railguns are better - they'll at least be absorbed by a laser instead of your ship taking that laser hit.  Supposedly they stip armor off alien hulls but I never saw that actually happen - you're better off overwhelming them with kinetics or your own lasers instead.  As part of the so-called armor sttripping that doesn't actually work, they only deal 20% of the listedbase damage as actual damage... which is absorbed by the armor that isn't actually being stripped by the other 80%.  But of course the alien plasma never got nerfed.\n\nI can keep going on but why bother.  If somehow you find something that works, DO NOT tell the devs, they will patch it out or nerf it so hard you can't use it anymore.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I do not recommend this game. The level of micromanagement is completely insane, and you end up dependent on RNG to get traits that are required to play the game. Expect RSI to be a significant concern because there is very little automation. Furthermore the wall of text required to navigate the tech-tree is daunting at best. I dont mind a game that gives you informed choices, but 30 different types of engines is a bit much. It feels like this system needs significant improvement!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Great concept, extremely steep learning curve so it's very hard to pick up and enjoy. You can play for a few hours before realizing you messed up on something and need to restart. The fun started to drain away by the third restart so I probably wouldn't recommend this game overall.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "2000+ hours and you change the UI so much it feels frustrating just trying to select a new counselor. I dont know why massive UI changes at the end of EA is considered ok by devs. But hey, you already got my money so who cares if I never play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The best I will say about this game is 'It's fine', and that is in the absolute kindest, most charitable context I can give it. It looks really cool and has great theming, but in some ways it doesn't match up well against idle games. I tried really hard to be interested and excited by the game but it never actually did any work to meet me there, so after I gave it 35 hours I turned it off and didn't feel *anything* but relief. Games should be fun. This is not, this is work that tells you its fun, but is actually just work. The graphics are functional and serve the purpose they need to. The interface is mostly numbers that does a terrible job why any of them might matter, how any could be helpful, etc.\n\nIf you want an extremely (and I cannot emphasize this enough) slow game, this is one for you. The closest comparison I have in my entire gaming experience would be like, an idle game like cookie clicker, or one of those Starcraft custom maps where you don't move or explore, but you just stand in a single spot and watch a number change while zerglings run single file at a marine who kills them faster than they spawn, with the idea being \"Hey look you're making progress because number go up, ignore that you haven't actually done anything\". There is not a word in English that does a good job communicating exactly how plodding, meandering, and without passion this game feels, and how boring it is for it. I honestly don't know if I've made any real progress in my game. I don't know if I've made good decisions, l have *no feedback* whatsoever and I have played for a decent amount of time. I have no idea if the choices I've made are good or bad, I have no idea if I should be doing other things, and I played the game for nearly THREE DOZEN HOURS. I have restarted twice in that time, the first after about two hours, the second after maybe ten? That is not a plot that moves at 'a measured pace' or 'a slow burn' that is \"A plot that does not respect your time\". \n\nThe game does an awful, awful, awful job providing any feedback to the player beyond telling you your faction goal right away, with some sort of assumption that that's all people need? I get it, some people are going to love the idea of an incredibly slow game with zero help, zero feedback, and a goal you will never see any actual progress towards until you've already spent two to three dozen hours in the game doing 'stuff'. I am not that person, and I was recommended this game because I like strategy games. This is not a strategy game like Europa universalis. In EU if you make a decision, you can make major, immediate changes to your game state in seconds, and you will know if you fucked up or succeeded within minutes. In this game, you will not find out if those decisions mattered *maybe ever*.\n\nI have no emotional attachment to any of the decisions I've made in the game, and I think the only reason I would is because the game takes so long that its trying to force you to by exposure instead of any of the other reasons you might like a game. \n\nDon't buy this. Or at least, only buy it on sale. It's just not fun to play. It might be fun to win, but if I can't even see a flicker of that light after 35 hours why would I stick around to find out?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really, really wanted to like this game. But it's just fundamentally not good. I almost feel bad for not liking it, because it's sort of a monkey's paw for me. It has all the influences I want and almost all of the design goals I would find very intriguing, and caused me to buy it in the first place. But it has other design goals too, and those goals simply lead to bad places. I do not believe the game can be made better through updates or that it even had a chance to be good in the first place, because if you perfectly executed the core design philosophy of this game, it would still be unfun on a mechanical level. But we're not even there, because they didn't execute the rest of it particularly well either.\r\n\r\nIt's primarily a waiting simulator where you roll dice and get shit results constantly while watching the AI theoretically do the same thing, but actually it's quite apparent that it's both cheating and handicapped in order to respond to how well or poorly you're rolling. It is very obvious that XCOM modders worked on this game and it does not reflect well on it. There is very little in the way of strategy and very much in the way of performing the same, incredibly basic, obviously optimized tasks repeatedly for hours and seeing if the gambling machine allows them to work or not. You are not rewarded for clever thinking, you are simply existing and seeing what happens.\r\n\r\nThe writing is just not up to par. I appreciate the influences it takes and the ambition it had, and there are interesting ideas, but the characters are not interesting, and it does not really delve deeply into the concepts it brings up. The aliens are uninteresting and there is not a hint of intriguing mystery to be found. If there is some sort of twist that I've thusfar missed, I do not really care, because I've gotten no reason to be that invested in the first place.\r\n\r\nThe aesthetics are honestly poor. The music is forgettable, the 3D models are laughable, the voice acting ranges from endearingly amateur to gratingly bad. The globes are not fun to look at, and the mapmodes are downright terrible. This is a game you would want to play on your second monitor, not just because of the repetitive and disengaging gameplay, but because it physically hurts to look at.\r\n\r\nAgain, I almost feel bad for being so harsh on the game. I appreciate that it was made by a small, passionate, and talented team. But really I don't feel the need to pull any punches, because I don't feel like any of this is the result of a botched execution. I think this game IS, more or less, what they wanted it to be. Obviously they would've paid for better art if they could, but I think the art DIRECTION is poor, and I think they wanted the direction that way. I think the writing is poor, and I think they like it that way. I think the gameplay is abysmal, and I think that it's exactly what they wanted. I think this is a rare case of an early access game ready to go 1.0 as a complete product. But its complete form does not impress.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I tried to like this game but the gameplay moves between, confusing, boring and tedious. the premise is great, and I'd love to love this game however the tedious game of whack-a-mole you have to play to maintain control of countries really ruins it for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Recent update added a mechanic that seriously damaged gameplay for seemingly no reason. It messes up the late game which makes it all the more annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As others who have said; this is just needlessly complex.\n\nTo the people saying this is like XCOM; are you on fucking meth? XCOM is a whole different genre than this, this is NOTHING like XCOM at ALL.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I expected a more complex and layered X-Com, while this is, in fact, Europa Universalis. Probably not terrible for those who like the genre, but not my cup of tea.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Didn't know that this was essentially turn based.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to love Terra Invicta, but I can't in good faith recommend the game. Over successive rebalances, patches, and new versions as they work towards release (now at Release Candidate 1 at the time of writing), it honestly feels like the Developers are playing [b]against[/b] the players more than anything.\n\nThis is supposed to be hard. That makes sense. A technologically superior enemy of this kind should absolutely wipe the floor with you for a long time, and you should need to be very smart in order to survive to the point you can start to contend even your own orbits... but the constant frustration I have is that [b]nothing works anymore[/b] and if it does, it will get patched out soon. \n\nAny time the players find a decent strategy (not too overpowered, not too gamey), it gets nerfed. This is due to the back and forth between a diehard minority of experienced gamers with thousands of hours in TI trying to find \"the way\" to win, which the developers then nerf and patch out... again and again. That is [b]not the spirit of the game[/b] - if after 1000 hours, you find a way to min max and win, congrats! You get a medal. \n\nPavonis, you need to remember you're making a game for the wider \"hardcore strategy\" audience who don't have 1000 hours - the approach to this game should not be so narrow and continuously narrower because a tiny minority have found that next new min/max approach to win. I come back periodically and every time the player base finds an approach that may work, the developers nerf it and buff the aliens. [b]Are you making a game for your players, or making a game against your players[/b]? It feels like the latter.\n\nAs an example, even with the max in Targeting Computers, the Alien ECM has become so strong that your ships will just float there useless and get blown up, even when you're floating by each other, as your missiles [b]and shipboard weapons[/b] will be disabled. Additionally, it used to be that with the right tech level, well armoured defense arrays with mid-tier weapons tech (green arc laser and coilgun) could at least contend against a small handful of alien ships, but it's like they're only for show with no actual power. You might as well not build them, were it not for the harassing human AI factions.\n\nThe UI is clunky sometimes, but that can be overlooked, because honestly this is a very unique concept for a game... but the \"no fun allowed, suffer instead\" again and again with the rebalances and the nerfs is maddening. You have to relearn the game every time you come back because if something works, the devs will get rid of it.\n\nSave the hundreds of hours you'd need to try and find the [b]only acceptable[/b] 0.1% min max approach to \"win\" and go play something else that gives you fun instead of frustration.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I really want to like this game, but the intentionally obscured mechanics lead to way too many 'screw you, that's why' moments. If you look up a recent(!) meta guide on how exactly you are supposed to win, you can play, as the older 'tricks' are patched out. If not, you will struggle, lose, and rage quit.\nThe worst part is that your mistake was a few hours ago, so you basically have to play the last 4-6 hours again. \n\nNot to mention the other factions feel like helpless idiots, so you spend the game 1v2 with the servants and aliens (as any faction basically), and the others are there as filler, or to troll you on a purge. \n\nCredit where credit is due, the two tier research system is interesting, the ship design properly follows hard sci-fi. There are flashes of brilliance, buried under a lot of problems.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "Currently I cannot recommend this game as it is only for the most die-hard fans of Mount&Blade in space.\r\n\r\nThere are many hidden rules which you discover only after tens of hours into the game. These rules can wipe your position. I don't mind wiping, playing Rimworld on 'Losing is fun' is fun. But when it's due to far-fetched rules you didn't get a hint about, it's not. E.g. settling a comet near Earth will put the aliens to full aggro, this is only noticed after the first building is finished which takes a few hours of playing.\r\n\r\nResearch is a mess, especially the batshit crazy engine options. That needs some serious streamlining. To manage research the best option is using external tools: search the web for 'Terra Invicta interactive tech tree'.\r\n\r\nThis game needs many sessions to complete, unfortunately loading the game is extremely slow. Maybe this game needs better presets for an 8Gb RAM PC (I guess that is the problem)? \r\n\r\nThere are too many points where the game is a grind, even when playing 'Accelerated'. Especially once victory is clear.\r\n\r\nWorking with the other factions, even when the goals are not in conflict, only works for a limited time. No matter how hard you support, donate, fight wars for that faction, a lasting cooperation is not possible. E.g. 'The Exodus' goals conflict with none.\r\n\r\nThis game needs more time in beta, it is being updated regularly. I already like&hate it in its current form.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "This ones a tough call. I tried giving this game several chances and waiting for its development to progress further, but unfortunately, I cant recommend it.\nThe game is built on a solid premise  the idea is good  but it suffers from excessive ambition. It tries to be good at many things and ends up being excellent at few, if any.\nA good example is the tech tree: its an absolute mess. There are millions of technologies, many of them useless or extremely niche, piling up endlessly. The game really needed to generalize and simplify more.\nThe campaigns are incredibly long  you can spend hours just watching changes in control points without really knowing whether youre doing well or not.\nIts strongest points are the factions, which try to capture some of Alpha Centauris spirit, the story that maintains the mystery and mystique of the aliens, the inclusion of real space physics concepts, and the overall completeness of the solar system.\n\nIn the end, Terra Invicta feels like a fascinating experiment that never quite comes together. Its ambitious, detailed, and full of potential, but it ultimately collapses under its own complexity. With tighter design and better pacing, it could have been something truly great  for now, it remains a game easier to watch than to actually enjoy.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "I hate (love) this game. I play 4x/strategy games almost exclusively this game is so insanely hard & tedious on CINEMATIC difficulty that I just refuse to play another game. The whole earth political/economic management system is very intricate but after the first time playing it gets SO old so fast. Everyone else gets to space faster, destroys all my bases before I get any resources to build my own ships. Somehow the AI effortlessly captures large empires like China & the USA early on. like how??? Even setting aliens to 10% progression doesnt seem to make any difference in how fast they in fact progress. Im so frustrated because I do like this game but I refuse to play again. every time i feel like i take a step forward the ai takes 7 steps forward. its ridiculous. i dont care what anyone else says\nwaste of $40.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "I wanted to like this game, I really did. The game is a really cool idea, the lore and atmosphere is very nice. But it's just such a slog. The game has no respect for your time at all, it's just not worth playing. I'll admit though, they did succeed in making this game realistic; I enjoy it about as much as I would enjoy an actual alien invasion.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "I really want to like this game and it fits into a particular niche I've wanted, but the developers have the same \"no fun allowed\" and the nerf everything useful to the player mentality that the Helldivers 2 devs have.  \n\nThere are 7 human factions, 4 of which are ultimately anti-alien, 1 seeking to escape Earth, 2 pro-alien.  However they are completely useless in actually fighting the aliens and act more against the player than anything, EXCEPT if you are playing the Servants in which case the other factions are completely irrelevant and an easy win for the aliens is guaranteed.  Even by RC 1 they still don't build any decent stations or colonies, still don't prioritize mining and space resources and in previous versions would eventually just stop building anything in space even with 60K (600 kilotons) of each resource in storage.  In RC 1 they do build ships but I've seen autoresolves on fleets of 20 ships from corvettes up to destropyers with artemis torpedos, UV arc lasers, MK 3 railguns lose to a single alien destroyer and two gunships.  I have never seen any computer-controlled human faction win any fights vs aliens.  Also, computer-controlled human factions still have far too low research value to do much of anything past 2030.  \n\nAlien surveillance/abductions were always a threat, but now they are so accelerated even on normal campaign difficulty that no amount of defenses against alien influence research can protect your nations from simply being stolen with no effort by the aliens in 2033.  Oh, and they no longer use destroyers, but cruisers for surveillance missions, with multiple laser/PD escorts making the suicide torpedo ship runs unusable.  Also, aliens in the RC1 version on normal build far more ships, far more quickly than they did in my previous brutal campaigns, while space mining sites AND space mining orgs have been HEAVILY nerfed to where you're barely able to do anything in space at all.  This is total bs.  \n\nThe devs are only listening to the few elite players who keep screaming about how so many things are too good for the player and should be nerfed.  Oh, and they are using the Helldivers dev playbook of using \"realism\" against the player in game balance, but somehow never allowing \"realism\" in favor of the player, as a cheap excuse for artificial difficulty.\n\nAlso, in the research tree you'll find research for all sorts of ship parts, weapons, reactor cores and drives.  Nearly all of these are noob traps to \"gotcha\" new players.  Sure the tungsten resistojet is cheap, but on the lightest ship it is still completely useless - you won't be able to go anywhere or even move with any sort of speed if somehow you could.  And the dusty plasma drive is a complete joke - a drive that only uses fissiles as fuel, with an acceleration so low it would take months to get a stipped down gunship out of Earth orbit, never mind getting to anywhere else.  The fissiles nerf is such a huge hit that I have a hard time justifying drives which use fissiles even as 1% of their fuel now.  This hits hard with fusion drives in particular, where for some inexplicable reason, human FUSION drives were nerfed to require up to 10% of the fuel load to be FISSIONABLE material.  Oh, but of course the alien fusion drives magically only need water still.\n\nA lot of the early non-fission drives are just there to waste your research points.  Missiles are only there to waste your research points.  Hypergolic torpedoes are only there to waste your research points.  First-generation lasers are only there to waste your research points.  Oh, and in late-game, the plasma weapons are only there to waste your research points.  You think that you're getting an advanced end-game weapon?  Think again!  It got nerfed into being so completely useless, even MK 1 railguns are better - they'll at least be absorbed by a laser instead of your ship taking that laser hit.  Supposedly they stip armor off alien hulls but I never saw that actually happen - you're better off overwhelming them with kinetics or your own lasers instead.  As part of the so-called armor sttripping that doesn't actually work, they only deal 20% of the listedbase damage as actual damage... which is absorbed by the armor that isn't actually being stripped by the other 80%.  But of course the alien plasma never got nerfed.\n\nI can keep going on but why bother.  If somehow you find something that works, DO NOT tell the devs, they will patch it out or nerf it so hard you can't use it anymore.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I do not recommend this game. The level of micromanagement is completely insane, and you end up dependent on RNG to get traits that are required to play the game. Expect RSI to be a significant concern because there is very little automation. Furthermore the wall of text required to navigate the tech-tree is daunting at best. I dont mind a game that gives you informed choices, but 30 different types of engines is a bit much. It feels like this system needs significant improvement!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Very interesting but I would recommend people hold off until the full release. The opening 10 years where you are focusing on fighting the other human factions and taking control of different countries is great. I really like the story of the different factions and how their different research trees shape the game.\n\nUnfortunately, once you start to transition into the direct combat and space economy portion of the game, it completely loses me. The RTS phases are bad, the controls are wonky, slow, and I'd rather just auto-resolve every combat encounter in the game. Many others must feel the same, as the Steam achievement stats show that barely anyone has finished a single playthrough, or even gotten very far into the space stage.\n\nUntil that gap between the grand strategy and tactical sections of the game are smoothed out, I don't think this game is worth picking up.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I tried, but this game is simply to tedious to be enjoyable. Worst UI lag I have ever seen in a real game. If you miss judge how to defend your bases its a dozen hours down the drain and you get to spend another dozen hours waiting just getting back to where you were.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Great concept, extremely steep learning curve so it's very hard to pick up and enjoy. You can play for a few hours before realizing you messed up on something and need to restart. The fun started to drain away by the third restart so I probably wouldn't recommend this game overall.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "2000+ hours and you change the UI so much it feels frustrating just trying to select a new counselor. I dont know why massive UI changes at the end of EA is considered ok by devs. But hey, you already got my money so who cares if I never play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is complicated.\nIts rewarding\nIt is not something you just sit down and play. Sadly it takes too long to yield those rewards.\n\nI wont lie, after finishing it once. I wish it had console commands to build fleets automatically and you to mess around.\n\nGet it on a very very large sale.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Please stop the turnbased not turnbased mode, please let me have auto end turn\nDoing anything past the 10 year mark is so boring and frustrating\nI come back to this game every 8 months or so and every time i want to shoot myself when i spam click end turn until something interesting happens\nPlease stop the turn basedness",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never ending battle bug makes me want to never play again ffs.\n\nI've played off and on for years now and it still exists.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "RNGesus at the game start determines who gets to snowball and who doesn't. There's a Jump Order of Things to Do and that basically means grabbing all the places that your faction has high public opinion in. Oh, your faction randomly got to have a high public opinion in Japan, France and Germany? Great! Oh, you randomly got to have a high public opinion in Sierra-Leone, Somalia and Haiti? Sucks to be you!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "painful to play and take hours even with accelerated campaign and game sometimes crashes for no reason",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awkward UI with a fairly poor UX\n\nA needy 'geo-politics' layer that never steps aside when the game transitions into space\n\nA tech tree that's festooned with newbie traps for no good reason\n\nNumerous techs that do nothing other than act as stepping-stones to others \n\nYou can be 20+ hours into a game before you have any indication that your run is doomed, without redemption\n\nOften complex for the sake of complexity, adding nothing to the experience overall\n\n\nDon't let people tell you that if you don't like this game then you're not a 'true fan' of strategy games\nIt's an ambitious title that falls down in several key areas",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I tried to like this game but the gameplay moves between, confusing, boring and tedious. the premise is great, and I'd love to love this game however the tedious game of whack-a-mole you have to play to maintain control of countries really ruins it for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is \"verified\" as compatible with Steam Deck. It specifically says the UI is \"clearly legible\". It is absolutely not.\n\nAlthough it runs fine on Steam Deck, the text is ridiculously small and hard to read. There is a \"large UI\" option in the settings which does almost nothing.\n\nIt is unfathomable how anyone could mark the UI as \"clearly legible\". I will have to play on PC which is fine but I was grossly misled into a purchase.\n\nPlease, just make the text have a larger option. Stop putting miniscule text into tiny boxes when you have the entire screen available.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The best I will say about this game is 'It's fine', and that is in the absolute kindest, most charitable context I can give it. It looks really cool and has great theming, but in some ways it doesn't match up well against idle games. I tried really hard to be interested and excited by the game but it never actually did any work to meet me there, so after I gave it 35 hours I turned it off and didn't feel *anything* but relief. Games should be fun. This is not, this is work that tells you its fun, but is actually just work. The graphics are functional and serve the purpose they need to. The interface is mostly numbers that does a terrible job why any of them might matter, how any could be helpful, etc.\n\nIf you want an extremely (and I cannot emphasize this enough) slow game, this is one for you. The closest comparison I have in my entire gaming experience would be like, an idle game like cookie clicker, or one of those Starcraft custom maps where you don't move or explore, but you just stand in a single spot and watch a number change while zerglings run single file at a marine who kills them faster than they spawn, with the idea being \"Hey look you're making progress because number go up, ignore that you haven't actually done anything\". There is not a word in English that does a good job communicating exactly how plodding, meandering, and without passion this game feels, and how boring it is for it. I honestly don't know if I've made any real progress in my game. I don't know if I've made good decisions, l have *no feedback* whatsoever and I have played for a decent amount of time. I have no idea if the choices I've made are good or bad, I have no idea if I should be doing other things, and I played the game for nearly THREE DOZEN HOURS. I have restarted twice in that time, the first after about two hours, the second after maybe ten? That is not a plot that moves at 'a measured pace' or 'a slow burn' that is \"A plot that does not respect your time\". \n\nThe game does an awful, awful, awful job providing any feedback to the player beyond telling you your faction goal right away, with some sort of assumption that that's all people need? I get it, some people are going to love the idea of an incredibly slow game with zero help, zero feedback, and a goal you will never see any actual progress towards until you've already spent two to three dozen hours in the game doing 'stuff'. I am not that person, and I was recommended this game because I like strategy games. This is not a strategy game like Europa universalis. In EU if you make a decision, you can make major, immediate changes to your game state in seconds, and you will know if you fucked up or succeeded within minutes. In this game, you will not find out if those decisions mattered *maybe ever*.\n\nI have no emotional attachment to any of the decisions I've made in the game, and I think the only reason I would is because the game takes so long that its trying to force you to by exposure instead of any of the other reasons you might like a game. \n\nDon't buy this. Or at least, only buy it on sale. It's just not fun to play. It might be fun to win, but if I can't even see a flicker of that light after 35 hours why would I stick around to find out?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is simultaneously the coolest and most frustrating game I think I have ever played, and couldn't recommend it in it's current state. \n\nThere are a lot of \"player traps\" that you have no real way of knowing about or even figuring out (if you do figure out what you did) your mistake for hours and hours after you've done it. There are mechanics that just seem to be pushing the player in two directions at once and that's before talking about the issues with clarity in equipment descriptions. The sheer number of engines, generators, weapons etc to try and research is gargantuan and the design decision to have 80% be flat useless unless they're a pre-requisite to something else is... a choice. \n\nBeyond the balance problems, are issues just with the way the game is designed as turn based but not turn based. Time pauses when you are planning your councilors next move, or when you get a notification like one of your stations being destroyed, and then it resumes and you can move armies and ships around which have travel time etc. There have been QOL improvements I can see from old builds to be sure, but why you can't cancel a fleet  transfer order even just in orbit around earth is wild, and the fact there isn't a \"rebuild hab\" option when one of your stations inevitably gets blown up is *baffling*. Clicking through remaking stations or having a thousand templates to search through is not my idea of fun. As the game progresses it starts feeling like I'm just left clicking continue on notifications over and over until something meaningful happens.\n\nIt feels like you have to read the latest forums or watch youtube to get a feel for how the current branch of the game plays before you even start a save, and the advise those forums give you will be outdated with the next update. I hope it improves by \"1.0\", I really want to love this game, and will probably keep trying to figure it out for a while longer, but to everyone else, unless you enjoy pain and frustration, maybe look elsewhere. - edit, did try for probably too much longer, and there is no shot I could come close to finishing the game in another 30-40 hours most likely. Putting this down, maybe permanently until there are some big changes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really, really wanted to like this game. But it's just fundamentally not good. I almost feel bad for not liking it, because it's sort of a monkey's paw for me. It has all the influences I want and almost all of the design goals I would find very intriguing, and caused me to buy it in the first place. But it has other design goals too, and those goals simply lead to bad places. I do not believe the game can be made better through updates or that it even had a chance to be good in the first place, because if you perfectly executed the core design philosophy of this game, it would still be unfun on a mechanical level. But we're not even there, because they didn't execute the rest of it particularly well either.\r\n\r\nIt's primarily a waiting simulator where you roll dice and get shit results constantly while watching the AI theoretically do the same thing, but actually it's quite apparent that it's both cheating and handicapped in order to respond to how well or poorly you're rolling. It is very obvious that XCOM modders worked on this game and it does not reflect well on it. There is very little in the way of strategy and very much in the way of performing the same, incredibly basic, obviously optimized tasks repeatedly for hours and seeing if the gambling machine allows them to work or not. You are not rewarded for clever thinking, you are simply existing and seeing what happens.\r\n\r\nThe writing is just not up to par. I appreciate the influences it takes and the ambition it had, and there are interesting ideas, but the characters are not interesting, and it does not really delve deeply into the concepts it brings up. The aliens are uninteresting and there is not a hint of intriguing mystery to be found. If there is some sort of twist that I've thusfar missed, I do not really care, because I've gotten no reason to be that invested in the first place.\r\n\r\nThe aesthetics are honestly poor. The music is forgettable, the 3D models are laughable, the voice acting ranges from endearingly amateur to gratingly bad. The globes are not fun to look at, and the mapmodes are downright terrible. This is a game you would want to play on your second monitor, not just because of the repetitive and disengaging gameplay, but because it physically hurts to look at.\r\n\r\nAgain, I almost feel bad for being so harsh on the game. I appreciate that it was made by a small, passionate, and talented team. But really I don't feel the need to pull any punches, because I don't feel like any of this is the result of a botched execution. I think this game IS, more or less, what they wanted it to be. Obviously they would've paid for better art if they could, but I think the art DIRECTION is poor, and I think they wanted the direction that way. I think the writing is poor, and I think they like it that way. I think the gameplay is abysmal, and I think that it's exactly what they wanted. I think this is a rare case of an early access game ready to go 1.0 as a complete product. But its complete form does not impress.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was so excited for this game. It seemed right up my alley but the total lack of any kind of tutorial at all is absolutely ridiculous. Having to google every objective I get, or watching long, long youtube videos to get even 30 minutes into the game not okay. \n\nThen you go to the subreddit and you see people asking very beginning questions and then people being rude to them. \n\nTo put this in perspective, it's like playing factorio and not knowing how conveyor belts work because nothing tells you.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "If you like getting f*cked by RNG, this is the game for you. I know conformation bias exists, but in this game I really dont believe it's just that. It feels like X-Com all over again, losing one 80%+ chance roll after another, with an AI that just cheats and gets everything they want. \n\nLooks like a great game but it just feels frustrating, getting stomped by RNG. Also the tutorial is kinda lackluster (just the same text you'll get in the tooltips). And you really need a 2nd monitor or you won't be able to google for answers.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A great strategy game marred by an absolutely god-awful ship design/combat simulation. You can maximize resources and political maneuvering as much as you want, but if you do not use the correct meta for that 20 parameter/1bn combination design game, earth is doomed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Recent update added a mechanic that seriously damaged gameplay for seemingly no reason. It messes up the late game which makes it all the more annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As others who have said; this is just needlessly complex.\n\nTo the people saying this is like XCOM; are you on fucking meth? XCOM is a whole different genre than this, this is NOTHING like XCOM at ALL.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I expected a more complex and layered X-Com, while this is, in fact, Europa Universalis. Probably not terrible for those who like the genre, but not my cup of tea.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Didn't know that this was essentially turn based.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to love Terra Invicta, but I can't in good faith recommend the game. Over successive rebalances, patches, and new versions as they work towards release (now at Release Candidate 1 at the time of writing), it honestly feels like the Developers are playing [b]against[/b] the players more than anything.\n\nThis is supposed to be hard. That makes sense. A technologically superior enemy of this kind should absolutely wipe the floor with you for a long time, and you should need to be very smart in order to survive to the point you can start to contend even your own orbits... but the constant frustration I have is that [b]nothing works anymore[/b] and if it does, it will get patched out soon. \n\nAny time the players find a decent strategy (not too overpowered, not too gamey), it gets nerfed. This is due to the back and forth between a diehard minority of experienced gamers with thousands of hours in TI trying to find \"the way\" to win, which the developers then nerf and patch out... again and again. That is [b]not the spirit of the game[/b] - if after 1000 hours, you find a way to min max and win, congrats! You get a medal. \n\nPavonis, you need to remember you're making a game for the wider \"hardcore strategy\" audience who don't have 1000 hours - the approach to this game should not be so narrow and continuously narrower because a tiny minority have found that next new min/max approach to win. I come back periodically and every time the player base finds an approach that may work, the developers nerf it and buff the aliens. [b]Are you making a game for your players, or making a game against your players[/b]? It feels like the latter.\n\nAs an example, even with the max in Targeting Computers, the Alien ECM has become so strong that your ships will just float there useless and get blown up, even when you're floating by each other, as your missiles [b]and shipboard weapons[/b] will be disabled. Additionally, it used to be that with the right tech level, well armoured defense arrays with mid-tier weapons tech (green arc laser and coilgun) could at least contend against a small handful of alien ships, but it's like they're only for show with no actual power. You might as well not build them, were it not for the harassing human AI factions.\n\nThe UI is clunky sometimes, but that can be overlooked, because honestly this is a very unique concept for a game... but the \"no fun allowed, suffer instead\" again and again with the rebalances and the nerfs is maddening. You have to relearn the game every time you come back because if something works, the devs will get rid of it.\n\nSave the hundreds of hours you'd need to try and find the [b]only acceptable[/b] 0.1% min max approach to \"win\" and go play something else that gives you fun instead of frustration.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I really want to like this game, but the intentionally obscured mechanics lead to way too many 'screw you, that's why' moments. If you look up a recent(!) meta guide on how exactly you are supposed to win, you can play, as the older 'tricks' are patched out. If not, you will struggle, lose, and rage quit.\nThe worst part is that your mistake was a few hours ago, so you basically have to play the last 4-6 hours again. \n\nNot to mention the other factions feel like helpless idiots, so you spend the game 1v2 with the servants and aliens (as any faction basically), and the others are there as filler, or to troll you on a purge. \n\nCredit where credit is due, the two tier research system is interesting, the ship design properly follows hard sci-fi. There are flashes of brilliance, buried under a lot of problems.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "Currently I cannot recommend this game as it is only for the most die-hard fans of Mount&Blade in space.\r\n\r\nThere are many hidden rules which you discover only after tens of hours into the game. These rules can wipe your position. I don't mind wiping, playing Rimworld on 'Losing is fun' is fun. But when it's due to far-fetched rules you didn't get a hint about, it's not. E.g. settling a comet near Earth will put the aliens to full aggro, this is only noticed after the first building is finished which takes a few hours of playing.\r\n\r\nResearch is a mess, especially the batshit crazy engine options. That needs some serious streamlining. To manage research the best option is using external tools: search the web for 'Terra Invicta interactive tech tree'.\r\n\r\nThis game needs many sessions to complete, unfortunately loading the game is extremely slow. Maybe this game needs better presets for an 8Gb RAM PC (I guess that is the problem)? \r\n\r\nThere are too many points where the game is a grind, even when playing 'Accelerated'. Especially once victory is clear.\r\n\r\nWorking with the other factions, even when the goals are not in conflict, only works for a limited time. No matter how hard you support, donate, fight wars for that faction, a lasting cooperation is not possible. E.g. 'The Exodus' goals conflict with none.\r\n\r\nThis game needs more time in beta, it is being updated regularly. I already like&hate it in its current form.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "This ones a tough call. I tried giving this game several chances and waiting for its development to progress further, but unfortunately, I cant recommend it.\nThe game is built on a solid premise  the idea is good  but it suffers from excessive ambition. It tries to be good at many things and ends up being excellent at few, if any.\nA good example is the tech tree: its an absolute mess. There are millions of technologies, many of them useless or extremely niche, piling up endlessly. The game really needed to generalize and simplify more.\nThe campaigns are incredibly long  you can spend hours just watching changes in control points without really knowing whether youre doing well or not.\nIts strongest points are the factions, which try to capture some of Alpha Centauris spirit, the story that maintains the mystery and mystique of the aliens, the inclusion of real space physics concepts, and the overall completeness of the solar system.\n\nIn the end, Terra Invicta feels like a fascinating experiment that never quite comes together. Its ambitious, detailed, and full of potential, but it ultimately collapses under its own complexity. With tighter design and better pacing, it could have been something truly great  for now, it remains a game easier to watch than to actually enjoy.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "I hate (love) this game. I play 4x/strategy games almost exclusively this game is so insanely hard & tedious on CINEMATIC difficulty that I just refuse to play another game. The whole earth political/economic management system is very intricate but after the first time playing it gets SO old so fast. Everyone else gets to space faster, destroys all my bases before I get any resources to build my own ships. Somehow the AI effortlessly captures large empires like China & the USA early on. like how??? Even setting aliens to 10% progression doesnt seem to make any difference in how fast they in fact progress. Im so frustrated because I do like this game but I refuse to play again. every time i feel like i take a step forward the ai takes 7 steps forward. its ridiculous. i dont care what anyone else says\nwaste of $40.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "I wanted to like this game, I really did. The game is a really cool idea, the lore and atmosphere is very nice. But it's just such a slog. The game has no respect for your time at all, it's just not worth playing. I'll admit though, they did succeed in making this game realistic; I enjoy it about as much as I would enjoy an actual alien invasion.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "I really want to like this game and it fits into a particular niche I've wanted, but the developers have the same \"no fun allowed\" and the nerf everything useful to the player mentality that the Helldivers 2 devs have.  \n\nThere are 7 human factions, 4 of which are ultimately anti-alien, 1 seeking to escape Earth, 2 pro-alien.  However they are completely useless in actually fighting the aliens and act more against the player than anything, EXCEPT if you are playing the Servants in which case the other factions are completely irrelevant and an easy win for the aliens is guaranteed.  Even by RC 1 they still don't build any decent stations or colonies, still don't prioritize mining and space resources and in previous versions would eventually just stop building anything in space even with 60K (600 kilotons) of each resource in storage.  In RC 1 they do build ships but I've seen autoresolves on fleets of 20 ships from corvettes up to destropyers with artemis torpedos, UV arc lasers, MK 3 railguns lose to a single alien destroyer and two gunships.  I have never seen any computer-controlled human faction win any fights vs aliens.  Also, computer-controlled human factions still have far too low research value to do much of anything past 2030.  \n\nAlien surveillance/abductions were always a threat, but now they are so accelerated even on normal campaign difficulty that no amount of defenses against alien influence research can protect your nations from simply being stolen with no effort by the aliens in 2033.  Oh, and they no longer use destroyers, but cruisers for surveillance missions, with multiple laser/PD escorts making the suicide torpedo ship runs unusable.  Also, aliens in the RC1 version on normal build far more ships, far more quickly than they did in my previous brutal campaigns, while space mining sites AND space mining orgs have been HEAVILY nerfed to where you're barely able to do anything in space at all.  This is total bs.  \n\nThe devs are only listening to the few elite players who keep screaming about how so many things are too good for the player and should be nerfed.  Oh, and they are using the Helldivers dev playbook of using \"realism\" against the player in game balance, but somehow never allowing \"realism\" in favor of the player, as a cheap excuse for artificial difficulty.\n\nAlso, in the research tree you'll find research for all sorts of ship parts, weapons, reactor cores and drives.  Nearly all of these are noob traps to \"gotcha\" new players.  Sure the tungsten resistojet is cheap, but on the lightest ship it is still completely useless - you won't be able to go anywhere or even move with any sort of speed if somehow you could.  And the dusty plasma drive is a complete joke - a drive that only uses fissiles as fuel, with an acceleration so low it would take months to get a stipped down gunship out of Earth orbit, never mind getting to anywhere else.  The fissiles nerf is such a huge hit that I have a hard time justifying drives which use fissiles even as 1% of their fuel now.  This hits hard with fusion drives in particular, where for some inexplicable reason, human FUSION drives were nerfed to require up to 10% of the fuel load to be FISSIONABLE material.  Oh, but of course the alien fusion drives magically only need water still.\n\nA lot of the early non-fission drives are just there to waste your research points.  Missiles are only there to waste your research points.  Hypergolic torpedoes are only there to waste your research points.  First-generation lasers are only there to waste your research points.  Oh, and in late-game, the plasma weapons are only there to waste your research points.  You think that you're getting an advanced end-game weapon?  Think again!  It got nerfed into being so completely useless, even MK 1 railguns are better - they'll at least be absorbed by a laser instead of your ship taking that laser hit.  Supposedly they stip armor off alien hulls but I never saw that actually happen - you're better off overwhelming them with kinetics or your own lasers instead.  As part of the so-called armor sttripping that doesn't actually work, they only deal 20% of the listedbase damage as actual damage... which is absorbed by the armor that isn't actually being stripped by the other 80%.  But of course the alien plasma never got nerfed.\n\nI can keep going on but why bother.  If somehow you find something that works, DO NOT tell the devs, they will patch it out or nerf it so hard you can't use it anymore.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I do not recommend this game. The level of micromanagement is completely insane, and you end up dependent on RNG to get traits that are required to play the game. Expect RSI to be a significant concern because there is very little automation. Furthermore the wall of text required to navigate the tech-tree is daunting at best. I dont mind a game that gives you informed choices, but 30 different types of engines is a bit much. It feels like this system needs significant improvement!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Very interesting but I would recommend people hold off until the full release. The opening 10 years where you are focusing on fighting the other human factions and taking control of different countries is great. I really like the story of the different factions and how their different research trees shape the game.\n\nUnfortunately, once you start to transition into the direct combat and space economy portion of the game, it completely loses me. The RTS phases are bad, the controls are wonky, slow, and I'd rather just auto-resolve every combat encounter in the game. Many others must feel the same, as the Steam achievement stats show that barely anyone has finished a single playthrough, or even gotten very far into the space stage.\n\nUntil that gap between the grand strategy and tactical sections of the game are smoothed out, I don't think this game is worth picking up.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I tried, but this game is simply to tedious to be enjoyable. Worst UI lag I have ever seen in a real game. If you miss judge how to defend your bases its a dozen hours down the drain and you get to spend another dozen hours waiting just getting back to where you were.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Great concept, extremely steep learning curve so it's very hard to pick up and enjoy. You can play for a few hours before realizing you messed up on something and need to restart. The fun started to drain away by the third restart so I probably wouldn't recommend this game overall.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "2000+ hours and you change the UI so much it feels frustrating just trying to select a new counselor. I dont know why massive UI changes at the end of EA is considered ok by devs. But hey, you already got my money so who cares if I never play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is complicated.\nIts rewarding\nIt is not something you just sit down and play. Sadly it takes too long to yield those rewards.\n\nI wont lie, after finishing it once. I wish it had console commands to build fleets automatically and you to mess around.\n\nGet it on a very very large sale.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Please stop the turnbased not turnbased mode, please let me have auto end turn\nDoing anything past the 10 year mark is so boring and frustrating\nI come back to this game every 8 months or so and every time i want to shoot myself when i spam click end turn until something interesting happens\nPlease stop the turn basedness",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never ending battle bug makes me want to never play again ffs.\n\nI've played off and on for years now and it still exists.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "RNGesus at the game start determines who gets to snowball and who doesn't. There's a Jump Order of Things to Do and that basically means grabbing all the places that your faction has high public opinion in. Oh, your faction randomly got to have a high public opinion in Japan, France and Germany? Great! Oh, you randomly got to have a high public opinion in Sierra-Leone, Somalia and Haiti? Sucks to be you!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "painful to play and take hours even with accelerated campaign and game sometimes crashes for no reason",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awkward UI with a fairly poor UX\n\nA needy 'geo-politics' layer that never steps aside when the game transitions into space\n\nA tech tree that's festooned with newbie traps for no good reason\n\nNumerous techs that do nothing other than act as stepping-stones to others \n\nYou can be 20+ hours into a game before you have any indication that your run is doomed, without redemption\n\nOften complex for the sake of complexity, adding nothing to the experience overall\n\n\nDon't let people tell you that if you don't like this game then you're not a 'true fan' of strategy games\nIt's an ambitious title that falls down in several key areas",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I tried to like this game but the gameplay moves between, confusing, boring and tedious. the premise is great, and I'd love to love this game however the tedious game of whack-a-mole you have to play to maintain control of countries really ruins it for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is \"verified\" as compatible with Steam Deck. It specifically says the UI is \"clearly legible\". It is absolutely not.\n\nAlthough it runs fine on Steam Deck, the text is ridiculously small and hard to read. There is a \"large UI\" option in the settings which does almost nothing.\n\nIt is unfathomable how anyone could mark the UI as \"clearly legible\". I will have to play on PC which is fine but I was grossly misled into a purchase.\n\nPlease, just make the text have a larger option. Stop putting miniscule text into tiny boxes when you have the entire screen available.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The best I will say about this game is 'It's fine', and that is in the absolute kindest, most charitable context I can give it. It looks really cool and has great theming, but in some ways it doesn't match up well against idle games. I tried really hard to be interested and excited by the game but it never actually did any work to meet me there, so after I gave it 35 hours I turned it off and didn't feel *anything* but relief. Games should be fun. This is not, this is work that tells you its fun, but is actually just work. The graphics are functional and serve the purpose they need to. The interface is mostly numbers that does a terrible job why any of them might matter, how any could be helpful, etc.\n\nIf you want an extremely (and I cannot emphasize this enough) slow game, this is one for you. The closest comparison I have in my entire gaming experience would be like, an idle game like cookie clicker, or one of those Starcraft custom maps where you don't move or explore, but you just stand in a single spot and watch a number change while zerglings run single file at a marine who kills them faster than they spawn, with the idea being \"Hey look you're making progress because number go up, ignore that you haven't actually done anything\". There is not a word in English that does a good job communicating exactly how plodding, meandering, and without passion this game feels, and how boring it is for it. I honestly don't know if I've made any real progress in my game. I don't know if I've made good decisions, l have *no feedback* whatsoever and I have played for a decent amount of time. I have no idea if the choices I've made are good or bad, I have no idea if I should be doing other things, and I played the game for nearly THREE DOZEN HOURS. I have restarted twice in that time, the first after about two hours, the second after maybe ten? That is not a plot that moves at 'a measured pace' or 'a slow burn' that is \"A plot that does not respect your time\". \n\nThe game does an awful, awful, awful job providing any feedback to the player beyond telling you your faction goal right away, with some sort of assumption that that's all people need? I get it, some people are going to love the idea of an incredibly slow game with zero help, zero feedback, and a goal you will never see any actual progress towards until you've already spent two to three dozen hours in the game doing 'stuff'. I am not that person, and I was recommended this game because I like strategy games. This is not a strategy game like Europa universalis. In EU if you make a decision, you can make major, immediate changes to your game state in seconds, and you will know if you fucked up or succeeded within minutes. In this game, you will not find out if those decisions mattered *maybe ever*.\n\nI have no emotional attachment to any of the decisions I've made in the game, and I think the only reason I would is because the game takes so long that its trying to force you to by exposure instead of any of the other reasons you might like a game. \n\nDon't buy this. Or at least, only buy it on sale. It's just not fun to play. It might be fun to win, but if I can't even see a flicker of that light after 35 hours why would I stick around to find out?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is simultaneously the coolest and most frustrating game I think I have ever played, and couldn't recommend it in it's current state. \n\nThere are a lot of \"player traps\" that you have no real way of knowing about or even figuring out (if you do figure out what you did) your mistake for hours and hours after you've done it. There are mechanics that just seem to be pushing the player in two directions at once and that's before talking about the issues with clarity in equipment descriptions. The sheer number of engines, generators, weapons etc to try and research is gargantuan and the design decision to have 80% be flat useless unless they're a pre-requisite to something else is... a choice. \n\nBeyond the balance problems, are issues just with the way the game is designed as turn based but not turn based. Time pauses when you are planning your councilors next move, or when you get a notification like one of your stations being destroyed, and then it resumes and you can move armies and ships around which have travel time etc. There have been QOL improvements I can see from old builds to be sure, but why you can't cancel a fleet  transfer order even just in orbit around earth is wild, and the fact there isn't a \"rebuild hab\" option when one of your stations inevitably gets blown up is *baffling*. Clicking through remaking stations or having a thousand templates to search through is not my idea of fun. As the game progresses it starts feeling like I'm just left clicking continue on notifications over and over until something meaningful happens.\n\nIt feels like you have to read the latest forums or watch youtube to get a feel for how the current branch of the game plays before you even start a save, and the advise those forums give you will be outdated with the next update. I hope it improves by \"1.0\", I really want to love this game, and will probably keep trying to figure it out for a while longer, but to everyone else, unless you enjoy pain and frustration, maybe look elsewhere. - edit, did try for probably too much longer, and there is no shot I could come close to finishing the game in another 30-40 hours most likely. Putting this down, maybe permanently until there are some big changes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really, really wanted to like this game. But it's just fundamentally not good. I almost feel bad for not liking it, because it's sort of a monkey's paw for me. It has all the influences I want and almost all of the design goals I would find very intriguing, and caused me to buy it in the first place. But it has other design goals too, and those goals simply lead to bad places. I do not believe the game can be made better through updates or that it even had a chance to be good in the first place, because if you perfectly executed the core design philosophy of this game, it would still be unfun on a mechanical level. But we're not even there, because they didn't execute the rest of it particularly well either.\r\n\r\nIt's primarily a waiting simulator where you roll dice and get shit results constantly while watching the AI theoretically do the same thing, but actually it's quite apparent that it's both cheating and handicapped in order to respond to how well or poorly you're rolling. It is very obvious that XCOM modders worked on this game and it does not reflect well on it. There is very little in the way of strategy and very much in the way of performing the same, incredibly basic, obviously optimized tasks repeatedly for hours and seeing if the gambling machine allows them to work or not. You are not rewarded for clever thinking, you are simply existing and seeing what happens.\r\n\r\nThe writing is just not up to par. I appreciate the influences it takes and the ambition it had, and there are interesting ideas, but the characters are not interesting, and it does not really delve deeply into the concepts it brings up. The aliens are uninteresting and there is not a hint of intriguing mystery to be found. If there is some sort of twist that I've thusfar missed, I do not really care, because I've gotten no reason to be that invested in the first place.\r\n\r\nThe aesthetics are honestly poor. The music is forgettable, the 3D models are laughable, the voice acting ranges from endearingly amateur to gratingly bad. The globes are not fun to look at, and the mapmodes are downright terrible. This is a game you would want to play on your second monitor, not just because of the repetitive and disengaging gameplay, but because it physically hurts to look at.\r\n\r\nAgain, I almost feel bad for being so harsh on the game. I appreciate that it was made by a small, passionate, and talented team. But really I don't feel the need to pull any punches, because I don't feel like any of this is the result of a botched execution. I think this game IS, more or less, what they wanted it to be. Obviously they would've paid for better art if they could, but I think the art DIRECTION is poor, and I think they wanted the direction that way. I think the writing is poor, and I think they like it that way. I think the gameplay is abysmal, and I think that it's exactly what they wanted. I think this is a rare case of an early access game ready to go 1.0 as a complete product. But its complete form does not impress.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was so excited for this game. It seemed right up my alley but the total lack of any kind of tutorial at all is absolutely ridiculous. Having to google every objective I get, or watching long, long youtube videos to get even 30 minutes into the game not okay. \n\nThen you go to the subreddit and you see people asking very beginning questions and then people being rude to them. \n\nTo put this in perspective, it's like playing factorio and not knowing how conveyor belts work because nothing tells you.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "If you like getting f*cked by RNG, this is the game for you. I know conformation bias exists, but in this game I really dont believe it's just that. It feels like X-Com all over again, losing one 80%+ chance roll after another, with an AI that just cheats and gets everything they want. \n\nLooks like a great game but it just feels frustrating, getting stomped by RNG. Also the tutorial is kinda lackluster (just the same text you'll get in the tooltips). And you really need a 2nd monitor or you won't be able to google for answers.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A great strategy game marred by an absolutely god-awful ship design/combat simulation. You can maximize resources and political maneuvering as much as you want, but if you do not use the correct meta for that 20 parameter/1bn combination design game, earth is doomed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Recent update added a mechanic that seriously damaged gameplay for seemingly no reason. It messes up the late game which makes it all the more annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As others who have said; this is just needlessly complex.\n\nTo the people saying this is like XCOM; are you on fucking meth? XCOM is a whole different genre than this, this is NOTHING like XCOM at ALL.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I expected a more complex and layered X-Com, while this is, in fact, Europa Universalis. Probably not terrible for those who like the genre, but not my cup of tea.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Didn't know that this was essentially turn based.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to love Terra Invicta, but I can't in good faith recommend the game. Over successive rebalances, patches, and new versions as they work towards release (now at Release Candidate 1 at the time of writing), it honestly feels like the Developers are playing [b]against[/b] the players more than anything.\n\nThis is supposed to be hard. That makes sense. A technologically superior enemy of this kind should absolutely wipe the floor with you for a long time, and you should need to be very smart in order to survive to the point you can start to contend even your own orbits... but the constant frustration I have is that [b]nothing works anymore[/b] and if it does, it will get patched out soon. \n\nAny time the players find a decent strategy (not too overpowered, not too gamey), it gets nerfed. This is due to the back and forth between a diehard minority of experienced gamers with thousands of hours in TI trying to find \"the way\" to win, which the developers then nerf and patch out... again and again. That is [b]not the spirit of the game[/b] - if after 1000 hours, you find a way to min max and win, congrats! You get a medal. \n\nPavonis, you need to remember you're making a game for the wider \"hardcore strategy\" audience who don't have 1000 hours - the approach to this game should not be so narrow and continuously narrower because a tiny minority have found that next new min/max approach to win. I come back periodically and every time the player base finds an approach that may work, the developers nerf it and buff the aliens. [b]Are you making a game for your players, or making a game against your players[/b]? It feels like the latter.\n\nAs an example, even with the max in Targeting Computers, the Alien ECM has become so strong that your ships will just float there useless and get blown up, even when you're floating by each other, as your missiles [b]and shipboard weapons[/b] will be disabled. Additionally, it used to be that with the right tech level, well armoured defense arrays with mid-tier weapons tech (green arc laser and coilgun) could at least contend against a small handful of alien ships, but it's like they're only for show with no actual power. You might as well not build them, were it not for the harassing human AI factions.\n\nThe UI is clunky sometimes, but that can be overlooked, because honestly this is a very unique concept for a game... but the \"no fun allowed, suffer instead\" again and again with the rebalances and the nerfs is maddening. You have to relearn the game every time you come back because if something works, the devs will get rid of it.\n\nSave the hundreds of hours you'd need to try and find the [b]only acceptable[/b] 0.1% min max approach to \"win\" and go play something else that gives you fun instead of frustration.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I really want to like this game, but the intentionally obscured mechanics lead to way too many 'screw you, that's why' moments. If you look up a recent(!) meta guide on how exactly you are supposed to win, you can play, as the older 'tricks' are patched out. If not, you will struggle, lose, and rage quit.\nThe worst part is that your mistake was a few hours ago, so you basically have to play the last 4-6 hours again. \n\nNot to mention the other factions feel like helpless idiots, so you spend the game 1v2 with the servants and aliens (as any faction basically), and the others are there as filler, or to troll you on a purge. \n\nCredit where credit is due, the two tier research system is interesting, the ship design properly follows hard sci-fi. There are flashes of brilliance, buried under a lot of problems.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "Currently I cannot recommend this game as it is only for the most die-hard fans of Mount&Blade in space.\r\n\r\nThere are many hidden rules which you discover only after tens of hours into the game. These rules can wipe your position. I don't mind wiping, playing Rimworld on 'Losing is fun' is fun. But when it's due to far-fetched rules you didn't get a hint about, it's not. E.g. settling a comet near Earth will put the aliens to full aggro, this is only noticed after the first building is finished which takes a few hours of playing.\r\n\r\nResearch is a mess, especially the batshit crazy engine options. That needs some serious streamlining. To manage research the best option is using external tools: search the web for 'Terra Invicta interactive tech tree'.\r\n\r\nThis game needs many sessions to complete, unfortunately loading the game is extremely slow. Maybe this game needs better presets for an 8Gb RAM PC (I guess that is the problem)? \r\n\r\nThere are too many points where the game is a grind, even when playing 'Accelerated'. Especially once victory is clear.\r\n\r\nWorking with the other factions, even when the goals are not in conflict, only works for a limited time. No matter how hard you support, donate, fight wars for that faction, a lasting cooperation is not possible. E.g. 'The Exodus' goals conflict with none.\r\n\r\nThis game needs more time in beta, it is being updated regularly. I already like&hate it in its current form.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "This ones a tough call. I tried giving this game several chances and waiting for its development to progress further, but unfortunately, I cant recommend it.\nThe game is built on a solid premise  the idea is good  but it suffers from excessive ambition. It tries to be good at many things and ends up being excellent at few, if any.\nA good example is the tech tree: its an absolute mess. There are millions of technologies, many of them useless or extremely niche, piling up endlessly. The game really needed to generalize and simplify more.\nThe campaigns are incredibly long  you can spend hours just watching changes in control points without really knowing whether youre doing well or not.\nIts strongest points are the factions, which try to capture some of Alpha Centauris spirit, the story that maintains the mystery and mystique of the aliens, the inclusion of real space physics concepts, and the overall completeness of the solar system.\n\nIn the end, Terra Invicta feels like a fascinating experiment that never quite comes together. Its ambitious, detailed, and full of potential, but it ultimately collapses under its own complexity. With tighter design and better pacing, it could have been something truly great  for now, it remains a game easier to watch than to actually enjoy.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "I hate (love) this game. I play 4x/strategy games almost exclusively this game is so insanely hard & tedious on CINEMATIC difficulty that I just refuse to play another game. The whole earth political/economic management system is very intricate but after the first time playing it gets SO old so fast. Everyone else gets to space faster, destroys all my bases before I get any resources to build my own ships. Somehow the AI effortlessly captures large empires like China & the USA early on. like how??? Even setting aliens to 10% progression doesnt seem to make any difference in how fast they in fact progress. Im so frustrated because I do like this game but I refuse to play again. every time i feel like i take a step forward the ai takes 7 steps forward. its ridiculous. i dont care what anyone else says\nwaste of $40.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "I wanted to like this game, I really did. The game is a really cool idea, the lore and atmosphere is very nice. But it's just such a slog. The game has no respect for your time at all, it's just not worth playing. I'll admit though, they did succeed in making this game realistic; I enjoy it about as much as I would enjoy an actual alien invasion.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "I really want to like this game and it fits into a particular niche I've wanted, but the developers have the same \"no fun allowed\" and the nerf everything useful to the player mentality that the Helldivers 2 devs have.  \n\nThere are 7 human factions, 4 of which are ultimately anti-alien, 1 seeking to escape Earth, 2 pro-alien.  However they are completely useless in actually fighting the aliens and act more against the player than anything, EXCEPT if you are playing the Servants in which case the other factions are completely irrelevant and an easy win for the aliens is guaranteed.  Even by RC 1 they still don't build any decent stations or colonies, still don't prioritize mining and space resources and in previous versions would eventually just stop building anything in space even with 60K (600 kilotons) of each resource in storage.  In RC 1 they do build ships but I've seen autoresolves on fleets of 20 ships from corvettes up to destropyers with artemis torpedos, UV arc lasers, MK 3 railguns lose to a single alien destroyer and two gunships.  I have never seen any computer-controlled human faction win any fights vs aliens.  Also, computer-controlled human factions still have far too low research value to do much of anything past 2030.  \n\nAlien surveillance/abductions were always a threat, but now they are so accelerated even on normal campaign difficulty that no amount of defenses against alien influence research can protect your nations from simply being stolen with no effort by the aliens in 2033.  Oh, and they no longer use destroyers, but cruisers for surveillance missions, with multiple laser/PD escorts making the suicide torpedo ship runs unusable.  Also, aliens in the RC1 version on normal build far more ships, far more quickly than they did in my previous brutal campaigns, while space mining sites AND space mining orgs have been HEAVILY nerfed to where you're barely able to do anything in space at all.  This is total bs.  \n\nThe devs are only listening to the few elite players who keep screaming about how so many things are too good for the player and should be nerfed.  Oh, and they are using the Helldivers dev playbook of using \"realism\" against the player in game balance, but somehow never allowing \"realism\" in favor of the player, as a cheap excuse for artificial difficulty.\n\nAlso, in the research tree you'll find research for all sorts of ship parts, weapons, reactor cores and drives.  Nearly all of these are noob traps to \"gotcha\" new players.  Sure the tungsten resistojet is cheap, but on the lightest ship it is still completely useless - you won't be able to go anywhere or even move with any sort of speed if somehow you could.  And the dusty plasma drive is a complete joke - a drive that only uses fissiles as fuel, with an acceleration so low it would take months to get a stipped down gunship out of Earth orbit, never mind getting to anywhere else.  The fissiles nerf is such a huge hit that I have a hard time justifying drives which use fissiles even as 1% of their fuel now.  This hits hard with fusion drives in particular, where for some inexplicable reason, human FUSION drives were nerfed to require up to 10% of the fuel load to be FISSIONABLE material.  Oh, but of course the alien fusion drives magically only need water still.\n\nA lot of the early non-fission drives are just there to waste your research points.  Missiles are only there to waste your research points.  Hypergolic torpedoes are only there to waste your research points.  First-generation lasers are only there to waste your research points.  Oh, and in late-game, the plasma weapons are only there to waste your research points.  You think that you're getting an advanced end-game weapon?  Think again!  It got nerfed into being so completely useless, even MK 1 railguns are better - they'll at least be absorbed by a laser instead of your ship taking that laser hit.  Supposedly they stip armor off alien hulls but I never saw that actually happen - you're better off overwhelming them with kinetics or your own lasers instead.  As part of the so-called armor sttripping that doesn't actually work, they only deal 20% of the listedbase damage as actual damage... which is absorbed by the armor that isn't actually being stripped by the other 80%.  But of course the alien plasma never got nerfed.\n\nI can keep going on but why bother.  If somehow you find something that works, DO NOT tell the devs, they will patch it out or nerf it so hard you can't use it anymore.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I do not recommend this game. The level of micromanagement is completely insane, and you end up dependent on RNG to get traits that are required to play the game. Expect RSI to be a significant concern because there is very little automation. Furthermore the wall of text required to navigate the tech-tree is daunting at best. I dont mind a game that gives you informed choices, but 30 different types of engines is a bit much. It feels like this system needs significant improvement!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Very interesting but I would recommend people hold off until the full release. The opening 10 years where you are focusing on fighting the other human factions and taking control of different countries is great. I really like the story of the different factions and how their different research trees shape the game.\n\nUnfortunately, once you start to transition into the direct combat and space economy portion of the game, it completely loses me. The RTS phases are bad, the controls are wonky, slow, and I'd rather just auto-resolve every combat encounter in the game. Many others must feel the same, as the Steam achievement stats show that barely anyone has finished a single playthrough, or even gotten very far into the space stage.\n\nUntil that gap between the grand strategy and tactical sections of the game are smoothed out, I don't think this game is worth picking up.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I tried, but this game is simply to tedious to be enjoyable. Worst UI lag I have ever seen in a real game. If you miss judge how to defend your bases its a dozen hours down the drain and you get to spend another dozen hours waiting just getting back to where you were.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Great concept, extremely steep learning curve so it's very hard to pick up and enjoy. You can play for a few hours before realizing you messed up on something and need to restart. The fun started to drain away by the third restart so I probably wouldn't recommend this game overall.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "2000+ hours and you change the UI so much it feels frustrating just trying to select a new counselor. I dont know why massive UI changes at the end of EA is considered ok by devs. But hey, you already got my money so who cares if I never play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is complicated.\nIts rewarding\nIt is not something you just sit down and play. Sadly it takes too long to yield those rewards.\n\nI wont lie, after finishing it once. I wish it had console commands to build fleets automatically and you to mess around.\n\nGet it on a very very large sale.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Please stop the turnbased not turnbased mode, please let me have auto end turn\nDoing anything past the 10 year mark is so boring and frustrating\nI come back to this game every 8 months or so and every time i want to shoot myself when i spam click end turn until something interesting happens\nPlease stop the turn basedness",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never ending battle bug makes me want to never play again ffs.\n\nI've played off and on for years now and it still exists.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "RNGesus at the game start determines who gets to snowball and who doesn't. There's a Jump Order of Things to Do and that basically means grabbing all the places that your faction has high public opinion in. Oh, your faction randomly got to have a high public opinion in Japan, France and Germany? Great! Oh, you randomly got to have a high public opinion in Sierra-Leone, Somalia and Haiti? Sucks to be you!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "painful to play and take hours even with accelerated campaign and game sometimes crashes for no reason",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awkward UI with a fairly poor UX\n\nA needy 'geo-politics' layer that never steps aside when the game transitions into space\n\nA tech tree that's festooned with newbie traps for no good reason\n\nNumerous techs that do nothing other than act as stepping-stones to others \n\nYou can be 20+ hours into a game before you have any indication that your run is doomed, without redemption\n\nOften complex for the sake of complexity, adding nothing to the experience overall\n\n\nDon't let people tell you that if you don't like this game then you're not a 'true fan' of strategy games\nIt's an ambitious title that falls down in several key areas",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I tried to like this game but the gameplay moves between, confusing, boring and tedious. the premise is great, and I'd love to love this game however the tedious game of whack-a-mole you have to play to maintain control of countries really ruins it for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is \"verified\" as compatible with Steam Deck. It specifically says the UI is \"clearly legible\". It is absolutely not.\n\nAlthough it runs fine on Steam Deck, the text is ridiculously small and hard to read. There is a \"large UI\" option in the settings which does almost nothing.\n\nIt is unfathomable how anyone could mark the UI as \"clearly legible\". I will have to play on PC which is fine but I was grossly misled into a purchase.\n\nPlease, just make the text have a larger option. Stop putting miniscule text into tiny boxes when you have the entire screen available.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The best I will say about this game is 'It's fine', and that is in the absolute kindest, most charitable context I can give it. It looks really cool and has great theming, but in some ways it doesn't match up well against idle games. I tried really hard to be interested and excited by the game but it never actually did any work to meet me there, so after I gave it 35 hours I turned it off and didn't feel *anything* but relief. Games should be fun. This is not, this is work that tells you its fun, but is actually just work. The graphics are functional and serve the purpose they need to. The interface is mostly numbers that does a terrible job why any of them might matter, how any could be helpful, etc.\n\nIf you want an extremely (and I cannot emphasize this enough) slow game, this is one for you. The closest comparison I have in my entire gaming experience would be like, an idle game like cookie clicker, or one of those Starcraft custom maps where you don't move or explore, but you just stand in a single spot and watch a number change while zerglings run single file at a marine who kills them faster than they spawn, with the idea being \"Hey look you're making progress because number go up, ignore that you haven't actually done anything\". There is not a word in English that does a good job communicating exactly how plodding, meandering, and without passion this game feels, and how boring it is for it. I honestly don't know if I've made any real progress in my game. I don't know if I've made good decisions, l have *no feedback* whatsoever and I have played for a decent amount of time. I have no idea if the choices I've made are good or bad, I have no idea if I should be doing other things, and I played the game for nearly THREE DOZEN HOURS. I have restarted twice in that time, the first after about two hours, the second after maybe ten? That is not a plot that moves at 'a measured pace' or 'a slow burn' that is \"A plot that does not respect your time\". \n\nThe game does an awful, awful, awful job providing any feedback to the player beyond telling you your faction goal right away, with some sort of assumption that that's all people need? I get it, some people are going to love the idea of an incredibly slow game with zero help, zero feedback, and a goal you will never see any actual progress towards until you've already spent two to three dozen hours in the game doing 'stuff'. I am not that person, and I was recommended this game because I like strategy games. This is not a strategy game like Europa universalis. In EU if you make a decision, you can make major, immediate changes to your game state in seconds, and you will know if you fucked up or succeeded within minutes. In this game, you will not find out if those decisions mattered *maybe ever*.\n\nI have no emotional attachment to any of the decisions I've made in the game, and I think the only reason I would is because the game takes so long that its trying to force you to by exposure instead of any of the other reasons you might like a game. \n\nDon't buy this. Or at least, only buy it on sale. It's just not fun to play. It might be fun to win, but if I can't even see a flicker of that light after 35 hours why would I stick around to find out?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is simultaneously the coolest and most frustrating game I think I have ever played, and couldn't recommend it in it's current state. \n\nThere are a lot of \"player traps\" that you have no real way of knowing about or even figuring out (if you do figure out what you did) your mistake for hours and hours after you've done it. There are mechanics that just seem to be pushing the player in two directions at once and that's before talking about the issues with clarity in equipment descriptions. The sheer number of engines, generators, weapons etc to try and research is gargantuan and the design decision to have 80% be flat useless unless they're a pre-requisite to something else is... a choice. \n\nBeyond the balance problems, are issues just with the way the game is designed as turn based but not turn based. Time pauses when you are planning your councilors next move, or when you get a notification like one of your stations being destroyed, and then it resumes and you can move armies and ships around which have travel time etc. There have been QOL improvements I can see from old builds to be sure, but why you can't cancel a fleet  transfer order even just in orbit around earth is wild, and the fact there isn't a \"rebuild hab\" option when one of your stations inevitably gets blown up is *baffling*. Clicking through remaking stations or having a thousand templates to search through is not my idea of fun. As the game progresses it starts feeling like I'm just left clicking continue on notifications over and over until something meaningful happens.\n\nIt feels like you have to read the latest forums or watch youtube to get a feel for how the current branch of the game plays before you even start a save, and the advise those forums give you will be outdated with the next update. I hope it improves by \"1.0\", I really want to love this game, and will probably keep trying to figure it out for a while longer, but to everyone else, unless you enjoy pain and frustration, maybe look elsewhere. - edit, did try for probably too much longer, and there is no shot I could come close to finishing the game in another 30-40 hours most likely. Putting this down, maybe permanently until there are some big changes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really, really wanted to like this game. But it's just fundamentally not good. I almost feel bad for not liking it, because it's sort of a monkey's paw for me. It has all the influences I want and almost all of the design goals I would find very intriguing, and caused me to buy it in the first place. But it has other design goals too, and those goals simply lead to bad places. I do not believe the game can be made better through updates or that it even had a chance to be good in the first place, because if you perfectly executed the core design philosophy of this game, it would still be unfun on a mechanical level. But we're not even there, because they didn't execute the rest of it particularly well either.\r\n\r\nIt's primarily a waiting simulator where you roll dice and get shit results constantly while watching the AI theoretically do the same thing, but actually it's quite apparent that it's both cheating and handicapped in order to respond to how well or poorly you're rolling. It is very obvious that XCOM modders worked on this game and it does not reflect well on it. There is very little in the way of strategy and very much in the way of performing the same, incredibly basic, obviously optimized tasks repeatedly for hours and seeing if the gambling machine allows them to work or not. You are not rewarded for clever thinking, you are simply existing and seeing what happens.\r\n\r\nThe writing is just not up to par. I appreciate the influences it takes and the ambition it had, and there are interesting ideas, but the characters are not interesting, and it does not really delve deeply into the concepts it brings up. The aliens are uninteresting and there is not a hint of intriguing mystery to be found. If there is some sort of twist that I've thusfar missed, I do not really care, because I've gotten no reason to be that invested in the first place.\r\n\r\nThe aesthetics are honestly poor. The music is forgettable, the 3D models are laughable, the voice acting ranges from endearingly amateur to gratingly bad. The globes are not fun to look at, and the mapmodes are downright terrible. This is a game you would want to play on your second monitor, not just because of the repetitive and disengaging gameplay, but because it physically hurts to look at.\r\n\r\nAgain, I almost feel bad for being so harsh on the game. I appreciate that it was made by a small, passionate, and talented team. But really I don't feel the need to pull any punches, because I don't feel like any of this is the result of a botched execution. I think this game IS, more or less, what they wanted it to be. Obviously they would've paid for better art if they could, but I think the art DIRECTION is poor, and I think they wanted the direction that way. I think the writing is poor, and I think they like it that way. I think the gameplay is abysmal, and I think that it's exactly what they wanted. I think this is a rare case of an early access game ready to go 1.0 as a complete product. But its complete form does not impress.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was so excited for this game. It seemed right up my alley but the total lack of any kind of tutorial at all is absolutely ridiculous. Having to google every objective I get, or watching long, long youtube videos to get even 30 minutes into the game not okay. \n\nThen you go to the subreddit and you see people asking very beginning questions and then people being rude to them. \n\nTo put this in perspective, it's like playing factorio and not knowing how conveyor belts work because nothing tells you.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "If you like getting f*cked by RNG, this is the game for you. I know conformation bias exists, but in this game I really dont believe it's just that. It feels like X-Com all over again, losing one 80%+ chance roll after another, with an AI that just cheats and gets everything they want. \n\nLooks like a great game but it just feels frustrating, getting stomped by RNG. Also the tutorial is kinda lackluster (just the same text you'll get in the tooltips). And you really need a 2nd monitor or you won't be able to google for answers.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A great strategy game marred by an absolutely god-awful ship design/combat simulation. You can maximize resources and political maneuvering as much as you want, but if you do not use the correct meta for that 20 parameter/1bn combination design game, earth is doomed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Recent update added a mechanic that seriously damaged gameplay for seemingly no reason. It messes up the late game which makes it all the more annoying.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}