{
  "positive": [
    {
      "review": "This game is unabashedly tabletop, clearly made by developers who love everything about pen & paper Pathfinder and old CRPGs. I've never played an RPG [i]this[/i] ambitious with its character building, or choices in dialogue and plot progression, but any buyer should be warned, this level of ambitiousness also means it's very possible this game is not for you. There's a particular type of player this game is made for, and the game doesn't bother appealing to anyone who doesn't fit in that group—if you're not a fan of walls of text coming at you from every box, just skip this.\n\nWOTR ruined my ability to look back on other RPGs regarding character choice, it blows almost all of them out of the water, and without even showing you everything it has to offer. A criticism I can levy against the game is that this makes it all the more apparent when the developers do make a mistake and forget about something (typically in companion quests), but if something like this stands out like a massive issue in a particular quest rather than a commonly accepted fact of the game, then you know WOTR did it right. If you're a player like me, who enjoys \"pushing the envelope\" on what society considers \"morally acceptable\" in these games, and often gets assigned a red alignment card, WOTR has you covered in just about every way you can think of. Are you John Paladin the Bethesda Good Guy? Are you a brutal tyrant, lavishly treating yourself despite having no humanity to spare? Are you a walking embodiment of freedom and chaos, in fact, what does freedom and chaos even look like to you? Do you enjoy the dilemma of what responsibility regarding power actually means, when you're afforded power over time itself? All of these are afforded to you, down to the developers even catering to the type of player who just wants to kill everyone, and creating an interesting scenario around that rather than letting the game just fall apart because all of the characters are dead. That's not even close to the options afforded to you in the smaller scale quests, or just regular dialogue. The game also offers a good set of companions, though they take a backseat to you in the story. If you're expecting character-driven soap opera dialogue from them, you're not going to get it. This game is about you, not them.\n\nThe part of this game that will dissuade you most easily will be the actual gameplay part of it. For those who are unaware, the [i]Pathfinder[/i] system could more or less be described as \"D&D 3.5 for Powergamers,\" and this game absolutely expects you to understand its systems going in, to the point of disabling the ability to respec on higher difficulties—which you might notice are actually the game's NORMAL difficulties, and the game's \"Normal\" mode is in fact easy mode. Combat itself is designed around quick encounters playing against resource drain much like a common random encounter in a tabletop game, and because of this, [b]this game should be played on RTWP, NOT turn-based.[/b] Turn-based exists for you to slow down combat in tense moments, but it should absolutely not be the primary way you play. Encounters take too long and there are too many of them. Additionally, if you don't plan on min-maxing, you should stay on the lower difficulties lest you face a miss-a-thon, and you'll likely have plenty of those early game regardless if you don't know what you're doing or decided to play a spellcaster.\n\nAs a side note, whoever designed encounters in this game should be burned at the stake. Despite being committed to offering you a tabletop experience, Owlcat is quite familiar with the Quicksave function, and when they discovered they could make a bunch of brutal, sudden encounters and get away with it because players could just reload their save, ideas began to come about in their head. Come the game's release, I have no doubt they were laughing, so hard they couldn't breathe. For a game as big as WOTR, it's to be expected there are many points without polish, and it suffers from the classic CRPG issue of running out of budget and having a lame final chapter, but there are many points in the game which are less \"not very thought out\" or \"not very interesting\" and instead that battle designer deciding he wanted to remind you who was the top bunk. This type of behavior would have players pouring cold soda down your shirt in an actual tabletop campaign, and as such, all players are encouraged to shun the battle designer of this game and speak of him only in whispers, lest he decide to drop more 900 AC instant kill enemies who resist all status effects and can only be killed by permanent attribute damage.\n\nWOTR very quickly became one of my favorite games. I've replayed it multiple times, and consistently been impressed at how well made it is, and what the developers thought of as I played through it. Even as I played it, I kept wondering what my next playthrough would look like. I love the Lich, and I love the Swarm. Maybe a Hellknight Aeon playthrough next time...",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "The game is fun and has a great deal of replayability as there are different classes and mythic paths.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you, like me, care mostly about how the RPG is written then this is the BEST RPG (and the best game overall) you can play... Yes, better than BG3, DOS2, Witcher 1/2/3, Cyberpunk, DA Origins, Mass Effect trilogy, ...\n\nI have played all of those and I proudly say Pathfinder WOTR is MY Favorite game of all time. \n\nMusic 10/10",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "good:\r\n- I really liked the story and all the variation in the story due to your decisions and chosen mythic path. \r\n- The gameplay was overall enjoyable being either turn based combat or real time with pause.\r\n- I thought the writing was good with characters that felt like they had real and believable motivations.\r\n- There are a huge amount of classes to pick from and a decent amount of variation in builds for each class\r\n\r\nBad: \r\n- a significant amount of bugs and stability issues. (I was constantly having the game freeze for a moment when I would open containers or save. there was looots of stuttering and jerky camera movement. sometimes in the turnbased combat mode my characters would just not do the actions that I told them to and instead do absolutely nothing)\r\n- The crusade management minigame got to be pretty annoying and tedious after the 100th hour of doing it.\r\n- please for the love of god just get rid of random encounters when traveling on the worldmap\r\n- The secret ending is borderline impossible to do without looking up a guide\r\n- it is really easy to build a terrible character if you don't have much knowledge of the pathfinder system\r\n- the combat balancing of the enemies stats are insane sometimes\r\n\r\nOverall: This may look like alot more negative than positive but I value the positive things I mentioned far more than the negative so I will give it a solid 8/10.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's hard to explain how much I enjoyed this game. I came from Baldur's Gate 3 and was looking for more of that roleplay/buildcrafting goodness. Wotr did not let down in either department. If you're playing for the first time, I recommend playing as a good character first, then trying the lich on your second run. It really changes the game in a lot of interesting ways. It's very rules heavy at first, but do your best and don't be afraid to look up some guides. I very much look forward to playing the other Owlcat games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Wow... what an adventure this game was. Well built world and story... the depth of this game is just insane! pretty big learning curve in getting the ins and outs but the journey itself was very pleasant. So much content and so much hour spent... I might do a re-run with a different path at one point. Amazing game, must play if you are into CRPG!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After a 120hr campaign I have completed my Commander's journey. A truly wild ride. [spoiler] Wenduag and my Commander live happily ever after hunting in the cosmos, the wedding already having took place over Savamelekh's corpse. The rest of the Commander's companions seem to enjoy divinity! (Well, Camellia is the exception) [/spoiler] This is a game that devours you. Truly amazing story with fun gameplay (excluding certain puzzle quests). Crusade mode was not my favorite, but once you get the hang of it you can easily handle it. \n\nHighly recommend one gives it a try. The start can be very overwhelming with the variety of choices. I recommend looking for a build you find interesting and then follow a guide, for the people that are here for the story (this is me). All in all, a journey I will not forget and one I am happy to have experienced.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "rich in content, can easily play for hundred of hours exploring all the mythics and moral choices. 20 euro is a killer, if you can also find the dlcs at a nice discount it's even better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, Wrath of the Righteous (WotR) may have its issues, but the writing and gameplay really are spectacular. The story is massive in scale and touches on a variety of important history in the setting (i.e. Pathfinder tabletop / the world of Golarion).\n\nThe build options for your character are MASSIVE; I've spent dozens of hours just respeccing and trying out new builds for the heck of it (especially fun at later levels). The 10 Mythic Paths add an additional layer of power, flavour, and story; not only do they give you new abilities to help allies and harm enemies, they add story interactions with unique endings as well as a variety of mechanics. For example, you can take Angelic powers to heal your allies and smite the evil, Demonic powers to feed your inner hatred for mortals, become a Trickster that pranks people, or an Azata (think 'fae') that extols freedom for all. There are also lots of companions with interesting backstories that you can engage with (or ignore as you see fit) - they're not as fleshed-out as Baldur's Gate 3 (few things are), but they are fun, interesting, infuriating, great, evil, etc.\n\nOn the flip side, the game is mechanically complex and this can make things frustrating, especially early when you're trying to learn how the system works. Where Baldur's Gate 3 took the D&D 5e system and faithfully rebuilt it in videogame form (with some features trimmed to keep things stable), Wrath of the Righteous goes a step further to map the Pathfinder 1e (PF1e) systems almost one-to-one in WotR. PF1e is VERY complex, full of little mechanics behind the scenes that affect how combat works which can make it very difficult to understand why your attacks aren't hitting consistently, or doing less damage than you thought. This also swings in the other direction, where sometimes you'll hit harder / more often; 'Touch AC', for example, is the AC (Armor Class) of a creature when attacked with a Touch Attack. It tends to be much lower for larger creatures, so when a creature has a typical AC of 20, its Touch AC might be 10, making it much easier to hit (and crit) with Touch attacks.\n\nThe mechanically dense combat makes things even harder in later chapters, where enemies will have MASSIVE saves and AC; these are easy problems to solve if you know how to make good use of spells and abilities to reduce/bypass these issues, but it still makes combat drag a bit unless you've managed to build something truly overpowered (which is not only possible, but quite easy if you know what you're doing, or copy someone else's broken build).\n\nWith the above said, I really do think Wrath of the Righteous is a spectacular game, and if you can play long enough to reach the end of the first chapter, you'll probably be hooked! The story itself is very well-written, and there are lots of fun and interesting side quests, as well as a the Crusader army game once you reach chapter 2 (which you can choose to let the AI do for you, if you have no interest in managing it).\n\nOne last thing - in terms of DLC, you can just get Season Pass 2 - it has the best DLCs that add companions and classes to the main story in addition to some small but fun side areas. The rest aren't worth getting, in my opinion.\n\nGive it a try, Knight Commander!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not as good as Rogue Trader. but if you finished RT and want another story driven, tactical RPG that you can put over 100 hours into, this is the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Deep game mechanics, good story so far, nice artwork.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enormous step up from the previous game. Insanely fun to play, immense character customization, and quality story/companions. If you like rpgs this is a must play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’m currently neck-deep in Pathfinder: Wrath of the Righteous and absolutely loving it. I came straight from Baldur’s Gate 3 looking for another massive, choice-driven RPG and wow, this game delivers.\n\nThe story is epic from the very start, and the Mythic Paths are wild. Becoming an Angel, a Lich, a Trickster, each path completely changes the gameplay and narrative in ways BG3 never quite went this far with. The combat is super satisfying too, with the option to swap between turn-based and real-time whenever I want, which feels great during big fights.\n\nI’m genuinely impressed by how much freedom and customization there is. Every decision feels like it matters, the companions are memorable, and the world is huge. The Enhanced Edition also runs smoothly and looks great, with way better UI and fewer bugs than older reviews warned about.\n\nThe game is complex and the crusade management takes a moment to warm up to, but once it clicks, it adds a cool strategic layer to the whole crusade theme.\n\nIf you loved Baldur’s Gate 3 and want something even bigger in scope and build variety, play this.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is one of my favourite games of all time. Truly incredible! It easily stands beside the other great CRPGs like Baldur's gate saga as the best RPGs ever made. WotR is also even more replayable than most games in the genre thanks to the mythic path system, which dramatically changes the game in act 3 and onwards.\r\n\r\nThe story takes place in the same setting as Owlcat's previous game, Kingmaker, a little after the events of that game, but you absolutely don't need to play Kingmaker first. Wrath of the Righteous has, in my opinion, a better story, gameplay, and QoL. However, it does make it harder to go back and play Kingmaker, so if you want to play both, I'd recommend going Kingmaker first. \r\n\r\nIf you enjoy CRPGs, then you owe it to yourself to experience this game!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I bought this game with the intention of playing a CRPG but instead I got a dissertation on mechanics and rules.\n\nStill worth it for Camellia.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Crpg with solid story and engaging interactions. Feels just like playing a Tabletop campaign. Good times.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An incredibly ambitious game that mostly succeeds in what it sets out to do. The caveat is that it took many years of patches to reach this result. Its narrative conveys the desolation and horror of a demonic invasion. The depictions and descriptions of what that entails is impresses upon the player the stakes involved: nothing less than the fate of Golarion itself.\n\nUnfortunately, there are many areas that lack polish, such as the Crusade mode, and many sections where Owlcat phoned in their encounter design. Stat-bloated enemies with abilities that they should not have are common. Obscure and seemingly unimportant decisions made earlier in the game can have profound consequences a hundred hours or more later, adding to hidden counters that the player cannot see, and locking them into results they could not have foreseen. Not necessarily a bad thing, provided it all makes sense. The amount of reactivity in this game is truly impressive, even if it sometimes doesn't land. Despite the game being billed as a power-fantasy, there are many times it insists that the player needs help when you really don't. I suppose that's the difficulty of having to account for the new CRPG players as well as the experienced. Not all mythic paths are made equally well, either. The quality differences between those that were added later compared to those that first shipped with the game are stark.\n\nThe core problem I have with this game is its encounter design. Owlcat can clearly program encounters capable of showcasing more complex tactics but usually opt for throwing masses of increasingly higher level enemies at the player, often with some kind of cheesy catch involved. They populate the map and wait for you to trip over them as discrete encounters that don't interact with each other in any way. You do see novel encounters, don't get me wrong, but there's a lot of filler. Some of the best moments are desperate fights against waves of demons teleporting or flying in to wreak havoc; demonic teleportation is one of their most deadly abilities but you rarely see it used well, which is a shame. \n\nRather than stat-bloated encounters, I would have appreciated weaker enemies supporting stronger enemies by interfering with the player's attempts to counter them, and with fights being less frequent but involving at least one or two waves of reinforcements as the player's actions raise the alarm, and higher level demons call on their lackeys to delay you. Higher level demons teleporting around the battlefield would have also added to the chaos. Backtracking should also involve the risk that demons have teleported in to block your movement or even laid a trap in an area you think is safe. Especially in the later levels, high level demons would not hesitate to sacrifice their lesser peers as pawns in some tactical ploy. The player should feel harried and vulnerable, on edge against an attack that may come from any direction at any time. Alas, it's formulaic and ultimately predictable. You kill what's in front of you and what's behind you is always safe. Demons wait politely as you slaughter their fellows in the next room, and so on. There are a lot of different types of demons but you don't always see them working together effectively. Again, a shame. The measure of difficulty is generally Armor Class and Difficulty Class increases, and not much else.\n\nI haven't spoken about the companions; all I'll say is that some are more entertaining than others. The puzzles in this game, involving a certain companion, were not to my taste. Neither was the decision to lock a large dungeon behind their personal quest, but honestly, it's just more puzzles, so I hardly feel like I missed anything. Except their personal quest is significant for the \"secret\" ending. Oh well.\n\nDespite these complaints, the game is thoroughly entertaining, enough so to overcome its inevitable frustrations. A must-play for any CRPG fan. Please note, however, that most of the DLC is yet more filler content and much of it has poor reviews. The Last Sarkorian DLC is the only one I picked up and I don't regret it, though if you truly love the characters A Dance of Masks is apparently worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is possible the greatest game ever made... Even if you'll need to watch 2-4 hours of youtube videos explaining all the mechanics to you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is great! Really good versatility on character and party playstyles, great storylines, interesting characters, all in a well polished product.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I love the complexity of the turn based combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game. The Crusade meta level isn't as interesting as the Kingdom meta in Kingmaker but otherwise, an engrossing RPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall an enjoyable experience, though not without its many, many holes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really enjoyed this game the game mechanics and the story and the charactor are all sooooo good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm 230+ hours in and still in Act 3 — and I already feel like I’ve been through several campaigns’ worth of adventures. Completed the rather awesome \"Through the Ashes\" DLC, got hooked on \"Treasures of the Midnight Isles\", and somewhere along the way forgot what the outside world looks like.\n\nPerformance-wise, it actually runs better than Kingmaker on my system, despite being more polished and visually detailed, at least to my eyes.\n\nThe music swings wildly between ‘slay demons like a legend’ and ‘something Regill would enthusiastically eat his oatmeal to.’ That contrast somehow fits the game’s chaotic-and-then-cozy pacing.\n\nSo if you enjoy deep CRPGs with likable characters, compulsive buildcrafting, and stories that happily absorb months of your free time, you’ll probably end up as lost in this game as I am, and probably still will be for a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I keep coming back to this CRPG. I have 3 playthroughs so far that totaled just over 600 hours. I still have several different character types and ways I want to role play. If you like D&D style games, you should check this one out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful and funny story, incredibly extensive leveling options and so much more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, looks good so far.. \nThough the gamepad (dual sense) does not work at all... so not sure why it is set as supported",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game and the branching storylines, there is so much that you can do. I am literally 87 hours in to the game and only have 5 achievements out of the hundred or so. The only thing I really don't like is the crusade mode, I feel like it totally bogs down the game and I really just wanted a CRPG to play, not a war simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm far to stupid to understand builds or any of the deeper mechanics beyond hitting something with a big stick but it's fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game for Elves. My first finished game had ~122 hours on the save file, not including reloaded saves.\n\nThis is a great, long-lasting RPG with ten different main pathways through the game. However this game is not for everyone. The DM is a jackass, Core difficulty will test your min-maxing abilities and force you to understand why (at the time of writing) only 2% of players have beat the game on that difficulty. Choice mistakes you made sixty hours ago WILL come up later on.\n\nIf all of these sound like positives and you want a merciless and long lasting story, then this is absolutely going to be pure gold for you. I had an absolute blast and cannot recommend this game enough for CRPG veterans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I find it more fun as a turn based game instead of the action combat the default is, once i switched it, it was great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well-written story with choices that actually matter and well-designed mechanics. Definitely one of the best modern CRPGs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has an incredible story, great lore, a super deep character customization system, and just plain fun.  One of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although I would recommend this game, I do so while advising that it is not for the faint of heart (You can make this game almost as difficult or as easy as you want to with custom settings).  I would give it an 8 out of 10.  If you want complete flexibility as far as character creation is concerned, this is a great choice.  If you like puzzles, this game has them... and too many of them in my opinion.   Don't expect to have your hand held throughout this game because there is nothing to really tell you where to go and what to do... there's a lot of trial and error involved.   Unfortunately, a person will spend a significant amount of time running around in this game as there is no fast travel on the main map.  The companions you can recruit are decent for the most part.  The voice acting, in most cases, is some of the worst but there are a few characters where the voice acting is top-notch.   Ulbrig, Regill and a couple of the demons come to mind.  Side quests are relatively meaningful and do contribute to the main story.  Graphics for this type of game are acceptable.   The music is good, but can definitely get old after awhile.  Fortunately, there is an option to turn it way down in the sound menu.  The enemies become very repetitious after a while, but the boss fights are typically unique and challenging.   Most of the loot is beneficial and it is easy to find some great powerful items to use... especially as one progresses.   Unfortunately, the game was designed in a way where speaking with random NPCs is somewhat important at times.   There is no way to place a personal map marker on any of the maps either... which is unfortunate.   (There are probably some mods out there though).  All in all, I thought this game was good, and I finally finished after almost 200 hours.  Granted, at least 20 or more of those hours were spent returning to areas I had missed, solving ridiculous puzzles, etc.  If a person wanted to manage the entire crusade and do the main story and the DLC, you could easily spend way more than 200 hours playing.  Speaking of the DLC... meh... if I had to do it over again, I would not have purchased it.   In summary, WoTR was a great followup to Kingmaker and I don't regret buying it.   There is  great replay value after putting it away for a year or two as well.   If you can snag this game on sale, go for it.  Especially if you are a fan of CRPGs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\nA lot of classes\nA lot of spells\nGood story\nbeautiful environment\nBeautiful music\nRuns well (very few crashes or bugs so far)\nReasonable Price point\nGoes on sale for a good price too\nFor the lack of customization of appearance, putting in custom portraits makes up for it.\n\nCons:\nLack of character customization appearance choices (handful of hairstyles. Most the varied choices are more in colours)\nVery small modding community\nVoice acting can be a bit rough compared to other games under owlcat\n\nOverall I say go for it honestly I actually really really enjoy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3]I blinked and am 56 hours in.[/h3]\n\nIt's a good game. It's got a classic old-school feel, but with a modern polish. If you've never played Pathfinder but have played/loved D&D 3.5, you'll feel right at home here. It's like if Baldur's Gate II and Neverwinter Nights 1 had a gaming baby that needed its own non-D&D identity.\n\nDid you absolutely love D&D 3.5 (NWN1/2) but always wanted SO MUCH more of it? This game is here for you! There are more customizations, classes, feats, abilities, powers, and builds than you'll ever play through in your lifetime here. I'd call it something like D&D 3.9. Lots of ways to deal with situations. And! You can play it real time with pause, OR turn based. And you can toggle this option on and off at your whim with a button on the quick-bar! Brilliant!\n\nAlso, get the Toy Box and Camera mods for massive customization and accessibility if you're into that sort of thing.\n\nIf you're on the fence, buy it on sale--it's a steal at the 50%+ off price point (how I got it).\n\nEDIT: There's an entire Birthright-style war campaign in the game, too! Birthright is/was a 2e Campaign that harkened back to the original concept of Dungeons and Dragons, which was a ruleset for a war game called Chainmail.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In comparison to Pathfinder: Kingmaker, this one feels a lot like Divinity: Original Sin 2 felt in comparison to the first game in its own series. They're basically \"the same game\" in the sense that the game mechanics, visuals, etc, are almost identical, but at the same time it's an improved experience that does a better job of telling its own story, has more interesting characters and side quests, either simplifies needlessly complex systems or further details the ones that could benefit from more complexity as well as adding some much needed QoL features, etc. \n\nEven the visual presentation is at first glance exactly the same as in Kingmaker, but once you start playing you notice that it's actually more detailed and an improvement. The story is also more epic, since the first one revolves around building a country and this one is about fighting off extra-planar demon hordes while wielding powers beyond what normal mortals usually can muster. \n\nI had a lot of fun with it, and I didn't encountered any of the glaring flaws the first game had, such as unwinnable random encounters or timed quests that cause an automatic and unavoidable game over if you don't happen to read every entry in your journal in detail and get too caught up on doing side quests or managing you country/army. \n\nThe only downsides I found were some bugs that prevented me from finishing some side quests or main story missions and, except for the DLC about a party in your characters' honor where the next prompt to advance the story simply never appeared, all of them were fixed by simply reloading the most recent save file. I also dislike the fact that there's way too many loading screens that take way too much time and it gets annoying, but that's a staple of all the games I've played made by this studio.\n\nI enjoyed the story, especially how it kind of does a similar thing as Planescape: Torment by trying to address the nature of good and evil and whether it's something that's part of a being's nature or it can be changed, and how most of your companions are written in a way that try to do something different or at least interesting with their archetype, such as having an asshole hedonistic aasimar or a demon who sincerely wants to repent and renounce evil. I also dug the free mini side quest featuring some characters from the game Children of Morta than find themselves being briefly transported to this world and meet your characters, since I played that one a few years ago.\n\nJust like in Kingmaker, there's a lot of decisions you can make that change the direction the story will go, such as which characters to recruit, how to lead your armies, which companion to romance, what Mythic Path to follow, which enemy to kill or spare, and so on. It was a great experience and an improvement on the previous game in many ways, while telling a story that is different enough that the first game still holds up as its own thing instead of a lesser version of this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredible improvement over kingmaker, a monumental and impossibly vast cRPG, and without question one of the best cRPGs on steam. It's not an easy RPG, mind- making a character is an ordeal in and of itself, and you'll probably your ass kicked through the first couple acts without really knowing why. There are a few dungeons that feel more like pranks from the dev, but the beauty of the game is that you have such a wide toolkit that you truly can handle anything once you begin to understand it. And that's before mentioning the incredible replayability brought by the mythic paths and the insane number of classes.\r\n\r\nIf there was only one RPG left in my library, I would probably want it to be this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Huge game, it may not have BG3 level of production but it feels like it. First things first, this is videogame (alongside the Kingmaker) based of the TTRPG system of Pathfinder 1st Edition. As Kingmaker, both games are inspired (but not 1 to 1 recreations) of their respective campaigns of the same name.\nThe word is crunch, it is a crunchy RPG system, both on table and in videogame format, for the good and the bad. If you are the kind of people that enjoys to minmax character builds, party compositions, the value of this game is practically infinite for you. You are in for a very complex system that really rewards good planing and execution, and if your neuron activates something within you each time you level up and get to choose from of a very long list of diferent powers and builds, you are at home.\nIf you don't, you have ona of two chances:\nFirst, you enjoy the story, characters, artistic design and all that is around the game while you play at an adecuate dificulty.\nSecond, bounce of as you get sleepy each time you have to re-read every feat, spell and option you unlock for every time one of your 6 party members level up.\n\nYou know you better than I do, so I'll leave the final veredict to you. But as is, this game is very very good value for the right kind of people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "307 hours. One playthrough.\n\nI started this up off the back of Owlcat's excellent Rogue Trader, but with the distant bitter taste of my awful experience playing Kingmaker which I won't bore you with here. This game's depth and consistency of content is frankly staggering. A mass of character classes with six sub-types on average. A story that just gets bigger, and bigger, and bigger. An entire strategic army movement simulator \"minigame\" that links in to your roleplay and decisions made during the main quest. HUNDREDS of weapons and other items, most unique and interesting in their specific mechanics. This is one of the most indulgent experiences I've ever had playing a game, like eating my favourite dessert again and again until I barf.\n\nIt is not perfect. Depending on your tactical ability, you absolutely need to pay close attention to the difficulty options in WOTR, as this game has a lot of mechanics that I consider to be bullshit time-wasting grindy non-gameplay (no I'm not mucking around trying to find a resurrection scroll, thanks, everyone get up once the fight's over, chop chop). And unfortunately this is one of those games that STARTS really hard, with enemies that one-shot your tank, and then FINALLY gives you some decent tools and skills to actually deal with the challenges you face. And to be honest.......the game is just too freaking long. By the time I finished this I was exhausted and senseless. I barely read any of my epilogue because I just wanted to go to bed.\n\nBut who cares? 307 hours. What an experience. Well, guess I'd better start an evil playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Narratively massive sandbox RPG. I love that a player isn't forced into tactical combat but it is given as an option. Great storytelling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just like Kingmaker it's got some wonky-ass encounter balancing and overtuned enemies, but the sheer variety of builds and gear you can play with is great, and the crusade system is more engaging (to me, anyway) than the kingdom management was in Kingmaker.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a brilliant story with amazing characters. I just wish it didn't take about 16 hours to get started properly on a new playthrough...\n\nthis game is proof that you don't need the insane budget/graphics of games like BG3 to tell a beautiful and engaging story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of, if not the most, epic of epic fantasy games. Great CRPG, great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "High quality CRPG with a wealth of customisation and replayability. I've never seen so many classes and subclasses in a game before.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me sinto obrigado a deixar essa review positiva como uma forma de agradecimento por esse jogo incrível. A curva de aprendizado pode ser difícil no começo, mas é recompensadora, com uma história engajante, personagens divertidos, música excelente e mais builds que eu tenho tempo pra testar. wotr se tornou um dos meus jogos favoritos.\r\nNão posso recomendar o suficiente, o jogo é bom, as DLCs são adições ótimas ao jogo sem serem indispensáveis. \r\nOWLCATS! MAKE A NEW PATHFINDER GAME AND MY WALLET IS YOURS!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have incredible mixed feelings about Owlcat in general...\nDo I love their games? yes... do I think they should have been the ones to make them? no...\nI am unsure if Owlcat is a good studio, their have been some insanely questionable decisions...\nOutside that, Pathfinder: WoR is an okay game, its not great, its absolutely flawed, and some of the missions create an absurd action economy where you need to be incredible selective, and scarcely use your tools and resources lest you soft-lock your game.\n\nI wish I could give a \"mixed\" review, cus I am very mixed, I don't dislike the game, but I don't exactly think its good.\nIf you really like the top-down, pause/play tactical combat, and class building of pathfinder, than you should like this game, but do not expect a perfect, ideal game, both pathfinders are far from. for now I will give is a \"YES\" review because I do still play it now and then.\n\nI've yet to vest ANY time or $ into the Dlcs, Owlcat taught me with the first pathfinder that Dlcs are a punishment, not a treat, so I can't say much on those.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are some minor glitches in spells, and not all of the archetype options that you have for greatness are comparable. Having said that, it is still one of the best games I've ever played, which is saying a lot. I have a lot of experience with RPGs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic! I prefer it over Baldur's Gate 3, in the same way I prefer Pathfinder over D&D. So much customization is available for your characters and play style, really great story / plots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely one of the best CRPGs ever made and by far the best one to deliver a \"power fantasy\" kind of adventure. Not even Throne of Bhaal, back in BG2, comes even close to how powerful you feel and become in this game.\r\n\r\nThe game is really challenging, though, and it will have to understand the basics of the ruleset in order to beat some of the hardest fights. So be ready to read a lot of stuff!\r\n\r\nLastly, the dungeon at the end of act 2 is the best dungeon ever made on any CRPG. Long, but amazing from start to finish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not a real Owlcat game if you don't notice 100 hours into your gamethrough that you missed one (1) singular item in a chest at the start of the game which would have changed a companion ending. Yay \n\nIt really is a fun game for those who love a bit of everything, both strategy and roleplay with many different systems to manage, but can feel overwhelming at the start. Strongly recommend looking up builds and tips online for your first playthrough. This complexity is also what makes it replayable, there are so many variations of choices and builds and cumulative effects to explore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very much an enjoyable CRPG and a massive improvement on many of the issues in the previous game (Though I still recommend that as well). It can become a little sluggish from too many effects stacking (both in the background effects and effects cast on the characters) but that may be something overcome by hardware rather than a game issue. More specific to the game is that there's a few times where the storytelling and dialogue ended up feeling restrictive or unpleasant (Still frustrated by some of the dialogue options with Wendaug), but that's the price of the game format.\r\n\r\nStill a fun game and with a worthwhile story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Super crunchy. A bit weak in the writing department, but its probably the most hardcore D&D experience available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for those of us who remember the old DnD games like Icewind Dale, Baldurs Gate and Neverwinter Nights. System requirements aren't too high or anything. Pathfinder system is...overcomplicated but once you figure it out you'll see the almost unlimited amount of class customizations. The world is well detailed, the colors and art really pop, the music is decent, the controls aren't complicated and the difficulty settings allow for more than enough tweaking so that noobs or veterans can enjoy the game.\n\nThe downside I would say is the companion characters, it's like the developers screwed them up intentionally. They all have to be quirky or scarred or jerks.\n\nedit: After playing awhile longer the companions are the low point of this game, also no quest markers so alt-tabbing to Google for guides will be your friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is slowly growing into one of my favorites. So many classes, so many awesome abilities. I love tinkering with my build frequently. I definitely recommend getting two specific mods to deal with any bugs and a Quality of Life addition that makes the pre-buffing tolerable: Toy Box and Bubble Buffs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is to date my favorite Owlcat game and truly a fan. You probably don't need my review to know what this game is or why it's good. I'm just preaching to the choir at this point. I hope one day I can get a fully voiced Wrath of the Righteous remake one day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of my Favorite games of all time, the game offers so much replayability it's insane, between different stories, a roguelike mode, mods and just the possibilities for character and party builds and the choices you can make in the story make this game well worth it + the dlc, Owlcat won my with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm having fun.\r\nIt took about 30 hours to get into it though - very intimidating dialogs full of skills.\r\nAnd real-time with pause mode is still too chaotic for me, so sticking to turn based.\r\nBut it's genuinely very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, great characters, but the ruleset is a pain to learn. Hopefully Owlcat does a game for 2nd Edition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has a lot of entertaining and detailed content, many sidequests, a lot of choices you can make that have consequences and even some amount of freedom. Overall it felt like an interesting journey and I really liked the music. The story fit other aspects of the game and its world, and personally I often found my \"enemies\" more interesting than my allies or companions. Oh and the enemy variety was nice. Most of the time what I was doing didnt feel like complete filler or complete waste of time like in many other games that are vast which I find incredible.\r\n\r\nIf you are not interested in the micromanagement of the armies and stuff you can turn it off and if you are not interested in studying the builds and skills you can change the difficulty (or check nexus for mods). Might even be able to use AI for companions but this one Im not sure of.\r\n\r\nI went in with very low expectations but was very positively surprised by almost everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Table top RPG as a video game, and completely moddable...buy it...play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Briefly, this game has a lot to like AND dislike.\n\nMythic Path reactivity is cool, the huge number of classes can be fun (and overwhelming), this is one of the few RPGs where I feel like I might want to do multiple plays.\n\nI'd hate to play this game without mods though, just because of the scaling respec costs if nothing else. Trying to optimize your party and you picked a poorly explained feat or teamwork ability on multiple party members? Cough up way too much gold to fix that. The crusade mode is arguably more annoying than immersive (thank goodness \"Let them flee\" actually means auto-victory). There are too many load screens (made worse by things like random encounters, which you can guarantee bypassing in Toybox.)\n\nIt's a thumbs up, but with a ton of caveats. If you want to find an RPG that you could sink 1000 hours into, though, this is it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game on and off and got 100% through speedruns. I find the game to have decent things and nice innovations over Kingmaker. The problem for me is just for some reason I just don't feel as absorbed in this game as I was in Kingmaker, it might just be me but I feel the characters in Kingmaker were more engrossing. That said what is in this game and its DLCs are fun and worth your time if you want.\n\nJust be aware that Owlcat is still technically a Russian company.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game to sink hundreds of hours into, even if you're not familiar with the setting. \r\n\r\n...But god damn do I hate the crusade mode.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely massive CRPG based on one of the most robust table top RPGs ever made. The character building in this game and roleplaying opportunities that emerge from it are both some of the best you will see. The simple text boxes and not quite as modern graphics make the overall presentation feel more dated in a post Badlur's Gate 3 world, but there is an excellent CRPG to be had here if you can get past that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Learning curve is daunting but eventually it gets easier and it's fun. The level of detail in all areas of the game are impressive. I would call this game a labor of love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Good Alternative to BG3 , spend 5 hours with the steep learning curve and you wont be sorry.\r\nOnly thing is not everything is voice acted but a lot of it is.\r\nAlso the musical score is better than BG3 in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WoTR takes some serious dedication when it comes to time, reading and figuring out the game system. If you don't mind all of that, this is one of the best CRPGs out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still have a lot of game to play as you can see, but still I do recommend this game SO much. As a beginner on these games, I gotta say there is a lot to learn, and there are so many options that at the beginning it can feel overwhelming but just play it on easy and enjoy the story, dialogues etc, you'll learn it with time, no need to learn it all in one minute! (the combat is kinda like bg games and dos2 just to give you an idea). Anyway so far this is a 10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game that translates tabletop gameplay of dnd 3.5 to a digital video game format effortlessly highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will absolutely make you appreciate how good we have it these days with D&D 5th Edition and Baldur's Gate 3 lol but still a very fun and epic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great game, rly good story telling and characters, an amazing amount of choices and you can be PROPERLY evil, which is how i prefer to play in crpgs, that being said i had to take a break from this game multiple times due to 2 reasons, 1 THE PUZZLES! OMG THEY SUCK, so many of them r so hard, especially the pyramid in nenios quest line, i legit quit the game for MONTHS due to that area, some of the puzzles r interesting dont get me wrong, but when i play a crpg i dont want to have to be either incredibly confused and stumble my way through it, or use a guide. the other issue i had was the balancing, it is ok in most areas, i struggled a bit but thats probably due to the fact this was my introduction to pathfinder so i probs didnt have the strongest characters, HOWEVER there is one area where just wtf were the devs thinking, the final stretch of the game, the enemies to get to areelu r so strong its insane, i had to lower my difficulty to get to her, only after quitting the game again for another few months, once i had done that i could finally beat the game, the ending felt a little lackluster but it was still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good! In my opinion the story beats both Divinity: Original Sin 2 and Baldur's Gate 3. The graphics should be better than they are, but they're not bad. However the voice-over is abysmal. It's so fake that even food from the US looks nutritious in comparison!\n\nGiven better graphics, smoother controls and the dice mechanic from BG3, this game would blow any other RPG out of the water! 9/10!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Huge, immersive length\nFantastic mythic paths / power fantasy\nAmazing soundtrack\nDeep class building\nSatisfying, crunchy combat\nGreat storytelling and character\nExcellent villains\nEpic overall feel when everything clicks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming to this gem after 300 hours in BG3. I am surprisingly pleased, and I have no idea what I'm doing build wise. Arueshalae ftw 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent isometric cRPG in the best traditions of original Baldur's Gate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pathfinder as usual. Party in a D&D-like world with it's own flavours. I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a little worried it would be too complex, but 3 hours in I am having a blast. If you have ever played this type of game before you will have no problems. Totally worth what I paid for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this interface where i can point and click very easy for keyboard and mouse interfacing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a lot of mixed feelings about WOTR. There is so much good in this game , but a ton of bad that comes along with it .\r\n\r\nIf you are considering playing this , make sure that you are comfortable with 150 hours to get through it.\r\nIt is a marathon, the longest of any CRPG that I've ever played.\r\n\r\nI'd also encourage you to watch some reviews before you start. This is about 10 layers deeper than something like BG3 , you will need to live and breathe this modified version of PF 1e to play on Core difficulty or higher . \r\n\r\nThat having been said , it has some of the coolest choices and most interesting paths I've ever seen in a game like this. You will be rewarded if you can roll with the ups and downs of the game's design. I'm very happy with the money spent on this. \r\n\r\nI hope that Owlcat keeps making games this ambitious , I also hope they learn from the things that worked here as much as the things that didn't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Modern king of CRPGs, less accessible but much deeper than BG3(also awesome)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Power fantasy, amazing soundtrack, complex class building.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "200+ hours and havent finished a single game yet. Awesome in scope and depth!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good and big. too big me can't complete. but like hitting things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exceptional game. A great improvement from kingmaker",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The secret ending was pretty satisfying after 421 hours playing towards it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak rpg, bg3 but pathfinder with way way more depth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I did not expect to get sucked in to this game as much as I did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and addictingly complex game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absoletutely amazing. One of the best games ever made.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Huge, immersive length\nFantastic mythic paths / power fantasy\nAmazing soundtrack\nDeep class building\nSatisfying, crunchy combat\nGreat storytelling and character\nExcellent villains\nEpic overall feel when everything clicks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, amazing story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good stuff, Owlcat knows whats up",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very in depth CRPG. I have no idea what I'm doing. Would not recommend to beginners.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 I still can't decide on what class to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bugfree, more polished kingmaker\n\n\n\n\nI still like Kingmaker more",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of my favorites. please never make puzzles again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a psycho bitch I love her",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun and its pathfinder",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pure unadulterated power fantasy.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "TLDR\nPathfinder: Wrath of the Righteous is honestly a good game if you like stupidly indepth character building and being able to roleplay a character pick it up it'll scratch that itch regardless of it's problems. However do prepare yourself for some really shitty RTS gameplay if you want to experience the game\n\nLong Review\nThis game took me a couple attempts to get into, the combat was the main problem. Turn Based Mode is ungodly slow to the point of being a genuine bore during some bigger battles and this is coming from someone who likes Turn Based RPGs. The Real time with Pause is awkward in a different way nearly 70 hours in it's incredibly hard to control, every half second you need to pause and reissue orders cause one of your characters obliterated the enemy you targeted and now everyone is defaulting to their AI auto commands which is usually just run at the nearest enemy or shoot arrows. Wish I could customise how my companions act in combat but ultimately it's fine just takes some getting used too \n\nThe character building is amazing so many different classes to choose from on top of mythic paths plus weapon specializations just all around 10/10 character building this will keep my attention for a long time to come and I don't even have the DLC yet which some of them apparently add more archetypes.\n\nI'm gonna talk about the other aspects of the game now and I'm gonna be honest kind of hate them as mechanics. The Crusade mode is an ungodly abomination and should've been cut from the game I'm a huge fan of grand strategy games playing games from Total War and Civilization to even dipping into HOI4 and Stellaris. The Crusade Mode which is basically a grand strategy gamemode is without a doubt the worst in the genre I've played for one it actively messes with your ability to just play the RPG aspects I literally got softlocked in Act 2 on the final fort to Dresen because my morale broke and I couldn't recruit new units and my army got obliterated by a spell caster general and I basically had to save load cheese until I got lucky and won. The morale is probably the biggest deal breaker, in the playthrough I got softlocked I managed to kill every enemy fort and every single enemy army except for one on the road to Dresen without losing a single unit and I went through Leper's Smile only stopping to help the Traveller and nothing else. According to this game's lore I'm cannonically the best leader of the crusades ever managing to do in 2 weeks what other commanders couldn't do in 70 years. Yet my morale broke because I let me army sit in camp for too long while I went and played the normal RPG section and it was only like a week of in game time not sure if the devs know this but real life armies wait around for months if not years, a week is not gonna matter at all. When your morale breaks you can't recruit your units skip their turns it's a pain in the ass.\n\nAnyway my personal experience with the Crusade mode aside lets talk about it's balancing. It's also terrible Individual units amount to nothing they do pretty much no actual damage to enemy units compared to generals. Some basic enemy units are just infinitely stronger than the strongest infantry you can recruit (I absolutely despise ghouls). The balance around generals is also insane not sure how this made it in. You can recruit individual generals to each army which is cool however if you pick anything other than a Spell Caster as a general you are just shooting yourself in the foot. Spell Caster generals can one shot pretty much anything in the mode even massive 300 unit stacks, it'll either half health it or just outright obliterate it. The mode becomes stupid easy because of it however the enemy can also have spell caster generals which becomes a problem for the same reason, they one shot an entire unit each turn and your armies can only have a handful of units. Meaning if you're up against a spell caster general that has more units then you you're gonna lose just on the base line of he has more meat to sacrifice\n\nAs a slight upside you can just disable the mode and focus on the RPG however this apparently locks out content and I don't care how small the content is that is still stupid optional game modes become less optional the moment you lock shit behind it\n\nThere's also a city builder aspect which honestly I don't think I can give a fair criticism of it looks like it would be fun to manage however it's mainly tied to the Crusade Mode which just rots everything it touches it becomes a chore and has a lot of events you need to solve and they can lock stuff away permanently if you pick wrong. \n\nI wish most of this review wasn't about the Crusade Mode and I could just gush about the RPG side however the Crusade Mode and City Builder actively clash with the RPG side and force you to leave it and manage the whiny diaper shitting armies constantly and I wish nothing was locked behind the Crusade Mode cause then I wouldn't need to talk about it I could just say it sucks don't play it and move on but you can't there's difficulty options for the Crusade Mode that make it better but it's still tedious and annoying plus I honestly hate that excuse labelling something as \"Optional\" should not just be a catch all for criticism it's genuinely terrible and came close to making me quit the game entirely when I got softlocked for essentially waiting too long it frustrated me so much I wish it wasn't cause I love those types of games and honestly a game that mashes City Builders, Grand Strategy, and RPG would be my dream game\n\nThis is still a good game but you kind of have to bend over backwards to see it shine turn the crusade mode to Story difficulty just so you can not miss anything and if you're not worried about missing anything just turn it off",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Enjoyed the gameplay up until the tavern defense mission at about 5 hours in. I've spent the last hour in this ridiculous fight. If I quit now I lose all progress so far, but based on other reviews the fight can go up to round 40 or 50 before the final bosses spawn, and I'm only on 15. It is just a seemingly endless wave after wave of fighting. Repeatedly spawning the same few enemies over and over and over again while you're at a low level with limited number of AOE attacks meaning it's just a boring slog of slinging low level hits back and forth at each other.\r\n\r\nI really wanted to enjoy this game but this has ruined it for me. I don't have the attention span to sit through hours of endless stupid fighting like this. It's incredibly boring. Reddit has plenty of advice for how to extend your timer before this fight so you can go up levels to make it easier, but if you're like me with a smaller attention span and prefer fights to be done within 10 rounds, then this probably isn't the game for you either.\r\n\r\nAdditionally the character creation for someone unfamiliar with Pathfinder rules is a bit complicated. Too many options with limited explanations that don't fully explain how things work, or give literal essays worth of explanation that nobody has time or interest to read. It's not necessarily a bad game, but it's definitely not for people with small attention spans and more interest in exploring. Overall, would not recommend this game and wish I hadn't wasted my money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I will preface this review by saying that I do NOT care if a game is too long. I absolutely do not care if your RPG takes 10 hours of 100.\nI played Persona 5 for over 100 hours, and I played Royal for 120. I've played JRPGs since the 90s and have no problems whatsoever 100% them, and single play throughs taking  triple digit hours.\nI'll sit down and play a full BG1 -> BG2 -> ToB campaign and love every second of it. \nLength of a game is not a problem for me - I will happily sit down and go through the expansive world, lore, character building, and the raw hours it takes to get through the campaign is a non-issue.\n\nThat being said, this game's campaign is too fucking long.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Miss\r\nMiss\r\nMiss\r\nMiss\r\nHit (resisted)\r\nMiss\r\nMiss\r\n\r\nThat's pretty much the entire game, very poorly designed encounters. I liked it for a while, but the deeper you get into the game the worse it gets. You can install something like the toybox mod to try and bypass the worst parts of the game, but eventually you'll just be bypassing every other encounter. The encounters are designed around save scumming and having a very specific party with very specific skills that happen to be available, and that just isn't very well thought out or fun to play. Even encounters you win can take 20+ minutes of just you and the enemy missing each other nonstop. \r\n\r\nAttribute/level drain in particular is one of the worst thought out systems I've ever seen in a game. A common scenario is you have an encounter where you have maybe a 20% chance to hit anything, but then you are hit with something that drains points out of a given stat, or entire character levels, and so now you have a 5% chance to hit. You can use certain spells to reverse this (again, if you happen to have that character in the party, and they haven't used their spells already), but it'll just be reapplied in an AOE immediately after. And this isn't something reserved for a specific boss fight, half way through the game this is every other encounter.\r\n\r\nThe story is okay, not great, if you're not already familiar with Pathfinder lore then it feels like you're reading book three of a five part series and you didn't read the first two, just a constant barrage of wiki article info dumps. People complain about voice acting constricting what writers can do, and there is some truth to that, but this game made me realize that forcing some brevity on them isn't the worst thing in the world.\r\n\r\nNavigating the map is a pain. You're moving the party as a game piece on a paper map, from one point of interest to the next, but you have to discover the 'trail' between two points as you go, and it's often unintuitive, you'll spend a lot of time just trying to find a connection between two points. While you're doing this, it's constant random encounters that start another long cycle of miss-miss-miss combat, or your party gets fatigued and needs to rest. Once you've conquered most of the map via the crusade system and you have teleports set up at each fort, it gets a little more bearable, but is never really good. I don't think anybody is looking forward to another 10+ half hour long random encounters and fifteen rest stops on their road trip to the next quest objective.\r\n\r\nThe game does offer a RTWP and turn-based system that you can swap between seamlessly, but even there it needs a lot of work, the NPCs in RTWP mode are braindead, basically never using abilities or spells. Turn based meanwhile just takes an eternity. \r\n\r\nAll in all very disappointing. I'm shocked that they had an early access playtesting period and still shipped it like this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really want to like this game.\n\nIt bait and switched me.  \n\nI casually went into a build i like, not sweating my decisions too much, because you can freely respec.  Went to respec and i can not freely respec.  Some mythic path choices can not be undone and hard lock your alignment without a warning that it will permanently lock you not just out of certain alignment based classes but prohibit you from respecing.  This in combination with a mess of an ACT 3 and implementation of certain things that make no sense and/or are unclear I am disappointed to realize I don't like the game and do not recommend you spend your money on it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "TL;DR: \nfinished the game because I simp for hot demon goat lady\n\nActual Review:\nAlthough it's a pretty decent game, WotR is NOT an easy recommend.\n\nI love both D&D and Pathfinder lore, and this game will do an amazing job at immersing you with its story and cast of characters. Roleplaying as a commander crusading against hordes of demons felt great as the game provides you with a number of Mythic Paths that give you unique powers (i.e you can lead the army as an Angel, a Dragon, or even an evil Lich). I can see a lot of replayability, but as I'm almost done with the game, I'm not sure if another playthrough is worth it.\n\nThat's because WotR is unfortunately BLOATED to the point of being grindy, tedious, and at times just plain boring. The game likes throwing trash mobs at you which makes most of the combat encounters repetitive (just like what MMOs do to drag things out). I also understand that Pathfinder is a complex system, but the designers could've picked the most impactful or fun mechanics from the tabletop ruleset to streamline your experience and make things more intuitive. I don't like how I COULDN'T enjoy this game without looking through other guides online. Also, Crusade Mode feels like a watered-down tactics game.\n\nTo wrap things up, WotR has its pros, but the cons are enough to hurt your experience. Some games just do it better imo. If you're looking for old-school D&D/RPG combat, Neverwinter Nights 1 does it way better. Dragon Age: Inquisition offers a similar experience with much more intensity and action (but focusing more on the personal rather than armies). And if you somehow enjoyed crusader mode army-management, the Heroes of Might and Magic series won't disappoint.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's strange how much older games of this style gives the AI enough intelligence to do their own attacks when it suits the situations. In this, you can give an AI 1 ability to always use whenever possible, but that's sorta it. And they will consume them very fast.\r\nI wouldn't mind having to control all characters if there were fewer but more dangerous fights - but when you have large amounts of it, it just gets tedious.\r\n\r\nThere are a few other issues but this is the most annoying one. Could be a fun game but, not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky, ugly, generally quite awful-feeling. I don't even know why I can't tolerate this game, but it's just something about the whole package. Somehow even much older CRPGs like Baldur's Gate 1 and 2 feel much less \"heavy\" to play than this game. \n\nHere you have tiny maps that still feel awful to traverse, with your characters moving slowly and the camera being way too zoomed in. Just feels underwhelming as a whole from a basic mechanical standpoint. Feels like a low quality product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I can’t recommend this game to anyone who isn’t already a diehard CRPG fan, and even then, it’s a rough ride. Wrath of the Righteous is an ambitious mess: a strange mix of brilliance and frustration, filled with bugs, balance issues, and baffling design choices.\n\nI went into this mostly for one reason: to recruit Arueshalae as a companion and build my party around her. What I didn’t realize was that forty hours in, I still wouldn’t be able to recruit her, and that’s taking the fastest route possible. Realistically, it’s closer to sixty or even eighty hours before you reach that point. The pacing is glacial, and every chapter feels stretched for length rather than depth.\n\nThe core combat loop is less strategy and more rock-paper-scissors. You either happen to prepare the perfect spells and break the encounter wide open, or your entire party gets annihilated because you didn’t guess right.\n\nIn the first act alone, demons spam *Stinking Cloud* endlessly. Without a specific immunity spell, your party is paralyzed and doomed. Cast the counter, and the fight becomes trivial. This pattern repeats across the entire game: enemies are either absurdly immune or easily broken.\n\nResting, a basic mechanic in most CRPGs, is turned into a punishment. The corruption system forces you to constantly backtrack to safe zones just to recover, dragging out the experience. Every major encounter becomes a tedious loop of trial, error, and re-preparation.\n\nThen there’s the tavern battle: a notorious low point that plays like a game of chess in hell. Dozens of NPCs wander aimlessly, wasting turn after turn, while you sit through the chaos waiting for the boss to appear. Strategy doesn’t matter, only patience does. The optimal play is literally to do nothing until the end so your party is fresh enough to win. Later fights continue this pattern with wave after wave of ineffective NPCs and bloated enemy groups.\n\nIf the gameplay is uneven, the story doesn’t save it. The writing is painfully generic: demons are evil because they’re demons, angels are good because they’re angels, and nuance barely exists. The companions join your crusade mostly out of convenience, not conviction.\n\nTo make matters worse, the game drowns you in walls of unvoiced text. Maybe 15% of the dialogue has voice acting which unacceptable for a game released in the 2020s. For a story that’s supposed to be epic and emotional, it rarely feels alive.\n\nVisually, the game is serviceable. The environments are fine but uninspired, and the level design feels simplistic, sometimes almost mobile-game-tier. Once combat begins, the world itself might as well be static: no usable terrain, no line-of-sight tactics, no real environmental interaction.\n\nThere *are* glimpses of good design. The skill system is thoughtful, and the overland travel and army management could’ve been fascinating if they weren’t so underdeveloped.\n\nBut the class system is pure excess. Pathfinder drowns you in redundant archetypes: oracle, witch, mystic, magus, sorcerer, wizard, shaman, arcanist... the list goes on. Where D&D streamlines these into a few clear archetypes, Pathfinder feels bloated for the sake of complexity. The lines blur until nothing feels distinct.\n\nBuilds are broken beyond belief. Players routinely post characters with 50+ in key stats, making it clear the game was neither balanced nor properly tested. It feels like there was no real playtesting at all, just a sandbox of unchecked systems piled on top of each other.\n\nWrath of the Righteous could have been great. There are flashes of brilliance buried under its mountain of imbalance, tedium, and excess. But as it stands, it’s a game that demands masochistic patience rather than skill or curiosity. Unless you’re a hardcore CRPG purist with infinite time and tolerance, it’s hard to call this anything but a missed opportunity.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It started out better and stronger then Kingmaker, but when i reached Drezen and the fighting had stopped. \nI was in for a nightmare again like in Kingmaker, same micro-management of Events/Army/Outposts..\n\nOwlcat really cannot make a RPG, without f**king it up..\n- First parts of this game is a nice RPG.\n- Mid part becomes a micro-management nightmare where you end up using more time on Events in town, speaking with people that before you & army's then going around exploring or doing actual RPG stuff..\n\nWho though it was a good idea to make an \"RPG\" where you move 3 days away from Town, \"Hey Event in Town someone want's to speak to you\".. Go back.. Someone on the road...repeat..repeat..repeat...\nAt this point its not even RPG & Roleplaying it's just annoying..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was having a lot of fun w/this game until it turned into spend all your cash on recruiting random guys that you toss at enemies that are too tough for you to ever beat. I got to a place in the game where I spent almost all my money trying to boost my army & couldn't beat the encampment of demons so there was zero way for the game to progress! What's the point of my playing on story mode if I can't play the game because it's somehow too hard even on easy?!?! I've never run into this with a game before where you could NOT progress in the game because of a lame strategy mechanic the developers built in making the whole process way harder than it needs to be. DON'T spend your money on this game VERY disappointed!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really, truly loved the Pathfinder: Kingmaker, and I've made multiple attempts at this one but I can't do it. I'm sure mechanically things stay as solid as they were in the previous game but I can't tolerate the voice acting in this game. I don't believe any individual voice artist does a particularly bad job, it is 100% directorial. So many characters feel as if lines were given to the artists without context as few characters really feel like they are responding to the stakes in any given scene making the characters feel incredibly flat. So I place blame firmly in the hands of the vocal directors. \r\n\r\nI'll have to try again and maybe just turn off the voices entirely, which is a big disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game would be fun if it didn't constantly crash. Do not buy this game for Mac. Certain sections are basically unplayable even with the graphics cranked down lower than an NES game. No amount of fixing, reinstalling, troubleshooting has been able to make this game reliably playable. I've managed to get a decent ways into the game by avoiding the missions and areas that constantly crash, but I'm disappointed to say I'm going to have to quit since it is crashing every few minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is as wide as an ocean with the depth of an evaporated puddle, the combat (which is 90% of the game) is just atrocious has completely killed my interest. It's just a slog of constant encounters with no intelligent design other than wail on each other until something dies, while usually being out of range to hit anything so you have to waste time walking over to them just for them to hit you because now you're close enough to them. \r\nThis is further compounded by the enemies being resistant to basically everything, having AC in the 20's, multiple attacks at low levels, pages of abilities and passives (And this is the TRASH mobs) meanwhile I'm playing as a Cavalier and I'm STILL waiting to be allowed to mount and actually do what my class is meant to while only attacking (missing) once. And if someone does FINALLY hit, it's 1-8 damage at best and remember the enemies are hitting equal to or greater than that with multiple attacks.\r\n\r\nWhile a few (most are irritating and a couple I never reached) of the characters and story was just about good enough to keep me invested it's just not worth it now; I'm not having fun, I'm not engaged, I'm dreading actually having to go and interact with the gameplay because it's so dull and the enemies are uncreative and oppressive.\r\n\r\nTypical combat encounter on NORMAL difficulty and auto levelling on companions (because there's way too many useless options):\r\n\r\nPlayer's 6 (7 in my case) characters: \r\nMiss\r\nMiss \r\nMiss\r\nMiss\r\nMiss\r\nMiss\r\n\r\nA single enemy:\r\nHit 19 damage\r\nHit 12 damage\r\nHit 11 damage\r\n\r\n*Repeat for 3-5 other enemies*\r\n\r\nPlayer:\r\nDowned character\r\nDowned character\r\nHalf dead character\r\n\r\nRound 2 starts\r\n\r\nThe crusade strategy minigame would be interesting but it uses basically the same combat system as the rest of the game, so again, you lose dozens of soldiers, just to kill like... 3 of theirs. While also having to deal with a morale system that caps at 20, but can go all the way down to -100(???) and a resource management game that you don't really earn anything toward unless you buy them.\r\n\r\nJust play Larian, their games are better designed for the same story and character investment.\r\n\r\n\"It gets better late-\" Oh piss off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The moment crusader mode came up, I deleted this game immediately. \nUntil then I was having a blast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid writing, walls of text, overly complicated mechanisms (but I suppose this is pathfinder so to be expected)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Character creation requires several PhDs in D&D. Tons of bloated text on everything but no concise information, on what your choices actually do and what matters most. It becomes so complex that identifying with your character becomes increasingly difficult the further the creation process goes. Here already, the player is confronted with massive chunks of lore. A plethora of terms and names you won't ever hear from or read again but are seemingly important. My appreciation for this design is fairly low. In fact, I think it is bad design to hammer the player with irrelevant information to that ludicrous extent, when you just want to start playing. After character creation the game picks up quite nicely and the pacing feels right. You get hooked and the main objectives are clear. Once you escape the prologue into Act I, it goes completely downhill.\n\nA lot of reading. Plenty of inconsequential, tedious and boring dialogue. Yes, the lore is deep and if you love to immerse yourself in story-driven book reading simulations, have the required attention span and the commitment, then this may be the right game for you. To me it is really difficult having to deal with fomo and accept filtering through walls of text all day and skipping potentially interesting exchanges. But you don't get to play if you don't become selective about what to read and what better to fly through.\n\nThe voices are really well done. Unfortunately, most of the dialogue is not voiced and it seems arbitrary what they decided to dub. Still irritates me every single time I get to hear a character speak.\n\nImo, the game does a bad job at telling you, what objectives should be pursued first and which are optional side activities. Points of no return are not communicated/indicated at all, which makes thorough exploration impossible with external guidance.\n\nIt is hard to recommend but I know there is a market for these games. If you don't mind reading through this review, you certainly won't mind my thumbs down. Because chances are my main issues with this game won't apply to you and you may actually genuinely enjoy it a lot. I will give it some more time but this is certainly no Deadfire which was on point in terms of pacing throughout.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring game. Can't get immersed when the voice acting is this terrible. This game tries to be Baldurs Gate 3 but fails in every aspect.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What in the bloody hell is this dialogue and these voice overs?! Am I playing a fantasy setting or GTA?!\n\n(obviously requested a refund, but since it's retail I don't know if I will get it. worst case scenario: lesson learned and developer blacklisted)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I thought this is more of a \"freeroam\" rather than go from point to point and multiple other points.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad writing, Very unlikeable NPCs and party members.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's honestly a pretty great game EXCEPT for the fact that it's so unfathomably poorly balanced that I gotta give it a not recommend.\nIt's so bad that it's impossible take the world seriously. Usually, game developers have the brain power to understand that how an enemy looks should somewhat translate to how dangerous they are, but somehow for some reason, 2+2 is something Owlcat struggles with. This is the kind of game where Altharez demon of hatred and destroyer of worlds or some shit is piece of cake and a zombie dog will molest your entire team. You'll think the game has been too easy for the last couple of hours and then all of a sudden you're gonna be focusing like you're on adderall to cheese a fight for 5+ tries.\nIt's a troll right? It's a meme right? Yeah well, I'm not one for lame jokes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Divinity: Original Sin 2, released 4 years ago, is much better...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "250 hours and I'm not even halfway. \nThat's too fuckin much.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Season Pass Things..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BAD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unnecessarily high level of entry for new players, way to many options to get lost, many of which are just trap feats or won't work for you. This game requires you to know so much in advance that you just cannot expect from someone just picking up the game. The amount of classes and subclasses the game offer might seam nice, but try to figure out what works and what's actually not worth your time. If you are a pathfinder veteran, I'm sure you're having a ton of fun, but as a newbie this game is pure pain. I cannot for the life of me understand the game design decisions made for this game. Throwing enemies with high resistances, damage reductions and immunities at the player starting at low levels is unreasonable. Unless you have a good grasp on this system, you are not going to have a good time. Sure you can watch hours of youtube videos discussing what's the optimal, but at that point you lost me. I can see this game was made by people who love the Pathfinder system for people who love it just the same, but doing so you forgot to ask the question? Is this fun for anyone who is not a die hard fan?",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "I feel like this game is amazing for people who adore deep lore and mechanics that are thought through to the most minute detail. I, unfortunately, am not that type of person, so all the reading and complex mechanics are overwhelming rather than enjoyable to me :( but I sure hope the people who do like that type of gaming have an amazing time with it!! <3",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "TLDR\nPathfinder: Wrath of the Righteous is honestly a good game if you like stupidly indepth character building and being able to roleplay a character pick it up it'll scratch that itch regardless of it's problems. However do prepare yourself for some really shitty RTS gameplay if you want to experience the game\n\nLong Review\nThis game took me a couple attempts to get into, the combat was the main problem. Turn Based Mode is ungodly slow to the point of being a genuine bore during some bigger battles and this is coming from someone who likes Turn Based RPGs. The Real time with Pause is awkward in a different way nearly 70 hours in it's incredibly hard to control, every half second you need to pause and reissue orders cause one of your characters obliterated the enemy you targeted and now everyone is defaulting to their AI auto commands which is usually just run at the nearest enemy or shoot arrows. Wish I could customise how my companions act in combat but ultimately it's fine just takes some getting used too \n\nThe character building is amazing so many different classes to choose from on top of mythic paths plus weapon specializations just all around 10/10 character building this will keep my attention for a long time to come and I don't even have the DLC yet which some of them apparently add more archetypes.\n\nI'm gonna talk about the other aspects of the game now and I'm gonna be honest kind of hate them as mechanics. The Crusade mode is an ungodly abomination and should've been cut from the game I'm a huge fan of grand strategy games playing games from Total War and Civilization to even dipping into HOI4 and Stellaris. The Crusade Mode which is basically a grand strategy gamemode is without a doubt the worst in the genre I've played for one it actively messes with your ability to just play the RPG aspects I literally got softlocked in Act 2 on the final fort to Dresen because my morale broke and I couldn't recruit new units and my army got obliterated by a spell caster general and I basically had to save load cheese until I got lucky and won. The morale is probably the biggest deal breaker, in the playthrough I got softlocked I managed to kill every enemy fort and every single enemy army except for one on the road to Dresen without losing a single unit and I went through Leper's Smile only stopping to help the Traveller and nothing else. According to this game's lore I'm cannonically the best leader of the crusades ever managing to do in 2 weeks what other commanders couldn't do in 70 years. Yet my morale broke because I let me army sit in camp for too long while I went and played the normal RPG section and it was only like a week of in game time not sure if the devs know this but real life armies wait around for months if not years, a week is not gonna matter at all. When your morale breaks you can't recruit your units skip their turns it's a pain in the ass.\n\nAnyway my personal experience with the Crusade mode aside lets talk about it's balancing. It's also terrible Individual units amount to nothing they do pretty much no actual damage to enemy units compared to generals. Some basic enemy units are just infinitely stronger than the strongest infantry you can recruit (I absolutely despise ghouls). The balance around generals is also insane not sure how this made it in. You can recruit individual generals to each army which is cool however if you pick anything other than a Spell Caster as a general you are just shooting yourself in the foot. Spell Caster generals can one shot pretty much anything in the mode even massive 300 unit stacks, it'll either half health it or just outright obliterate it. The mode becomes stupid easy because of it however the enemy can also have spell caster generals which becomes a problem for the same reason, they one shot an entire unit each turn and your armies can only have a handful of units. Meaning if you're up against a spell caster general that has more units then you you're gonna lose just on the base line of he has more meat to sacrifice\n\nAs a slight upside you can just disable the mode and focus on the RPG however this apparently locks out content and I don't care how small the content is that is still stupid optional game modes become less optional the moment you lock shit behind it\n\nThere's also a city builder aspect which honestly I don't think I can give a fair criticism of it looks like it would be fun to manage however it's mainly tied to the Crusade Mode which just rots everything it touches it becomes a chore and has a lot of events you need to solve and they can lock stuff away permanently if you pick wrong. \n\nI wish most of this review wasn't about the Crusade Mode and I could just gush about the RPG side however the Crusade Mode and City Builder actively clash with the RPG side and force you to leave it and manage the whiny diaper shitting armies constantly and I wish nothing was locked behind the Crusade Mode cause then I wouldn't need to talk about it I could just say it sucks don't play it and move on but you can't there's difficulty options for the Crusade Mode that make it better but it's still tedious and annoying plus I honestly hate that excuse labelling something as \"Optional\" should not just be a catch all for criticism it's genuinely terrible and came close to making me quit the game entirely when I got softlocked for essentially waiting too long it frustrated me so much I wish it wasn't cause I love those types of games and honestly a game that mashes City Builders, Grand Strategy, and RPG would be my dream game\n\nThis is still a good game but you kind of have to bend over backwards to see it shine turn the crusade mode to Story difficulty just so you can not miss anything and if you're not worried about missing anything just turn it off",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I think I gave this one a fair shake. Over Kingmaker, which had made a surprisingly late entry into my top 10 favorite games, I appreciated some of the technical improvements, new music, and so on; I really wanted to like it. Unlike many people who complained about the ridiculous numbers game, I was actually up for that now that I had gotten a slight taste of the Pathfinder 1e system and how to munchkin it a little,. I even bumped up my difficulty setting to Core.\n\nUnfortunately, it lacks the degree of layered, networked storytelling that had me falling in love with the River Kingdoms and their peoples in Owlcat’s previous Pathfinder title, and so ultimately failed to hold my continued interest in a game of this length. That’s pretty difficult to elaborate on. How about this: I’ll take a couple stabs at it, and perhaps you can decide to give yourself the green light to play the game because you just plumb feel differently about these issues.\n\nAttempt #1: It’s the difference between things happening and powers being gained because of chains of causality bouncing and tangenting off each other such that your character appears to have built something important, versus the same as a reward for beating stages in a video game. I understand that many players, perhaps a majority, are more attracted to WotR’s storytelling style (compared to KM’s) in the first place—like woo superpowers here we go, woohoo new teammate they get superpowers too as long as they’re technically in my party (even if I didn’t put them there)—but it puts me off because I neither feel like it’s been earned through narrative weight nor like I should be in some way grateful that it was predestined.\n\nAttempt #2: CRPG companions are annoying weirdos as a rule, but this litter doesn’t enthuse me nor grow on me like the previous crop did. They’re a little flatter, which is not the worst thing necessarily, but I would prefer CRPG companions that are more than just a meme. For the most part, they also don’t seem to have credible motivations for standing by your side through thick and thin in spite of possibly huge disagreements; this is the baseline character depth for RPG party members, isn’t it?\n\nTruth is, I still feel like I might revisit WotR one day and perhaps even change my mind, but I haven’t been back after two years despite thinking it was a better game on paper, and I didn’t even reach the part where most of the story’s detractors tap out. At least I got 126 hours out of it, you know? But it’s a sour taste for now.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Ugggghhhh I want to say buy this because it really is an amazing game. And upfront I will say my class and subclass seemed to play a large part in the issue, I assume other classes work better (my party members didn't seem quite as broken as I was), but I felt like I was banging my head against a wall the entire time I played this game, just waiting for things to finally start working the way they should.\r\n\r\nI came into this with a background playing and DMing DnD 5e and (foolishly) assumed this would be an good basis for getting to grips with this game. It was not. The problem is that everything in this game is stupidly complicated, doesn't really work properly, or is broken. For example:\r\n\r\nBroken:\r\nI played a mounted fighter. The entire point of my class was to fight while on a mount. However if I were in combat and mounted, any time I wasn't immediately adjacent to the enemy, my mount would wander over to the enemy, stop beside them, pause for five seconds, then my turn would end. No attack for me. No attack for my mount. Just turn finished. Every. Single. Time. I literally could not attack while mounted unless I was on top of the enemy already. If only I could charge toward them! (see below)\r\n\r\n\"Touch\" spell attacks on allies DO NOT WORK. These are the spells that I was predominantly (trying) to heal my party with. What happens is you select the spell. select your ally, then the caster walks towards the target, speaks some mumbo jumbo, burns a spell slot... and does not heal you.\r\n\r\nStupidly complicated:\r\nIn DnD you have an attack bonus for melee or ranged attacks. You use skills/spells/equipment to increase this. In this game you have an attack bonus which changes *every time you make an attack*. You can increase this through skills/equipment/spells except only some bonuses will stack but others won't and you have to try and piece together how to actually make this number go up without doubling/tripling/quadrupling on useless bonuses.\r\nIn DnD you have a saving throw for the spells you cast. This determines how difficult it is for an enemy to resist your spells. In this game you have a different saving throw for *every single spell in your spellbook*. Don't even get me started on spell resistance.\r\nI could go on about this for hours, and I assume this is faithful to the Pathfinder ruleset, but if you don't know these rules beforehand the game is waaaaaaaaay too complicated and messy and confusing.\r\n\r\nDoesn't really work:\r\nMy class mechanic revolved entirely around being able to charge into combat. The idea is I get on my mount, launch myself at an enemy, do a heap of damage upfront and then I either accept a decrease in damage output or run away and charge again. The problem is, actually charging an enemy almost never works. There is always an obstacle, often something completely arbitrary which looks like it should not be a problem, which prevented me from charging.\r\n\r\nSo I had a class which could rarely use the core mechanic (charging), and which didn't attack if I wasn't right next to the enemy, and which my healer would not heal even thought they cast a spell and burned through a spell slot.\r\n\r\nI got about halfway through the game, it is absolutely massive. The story is amazing. The choices are endless, the companions are great. This is what kept me trying and trying to get into the groove for the ridiculous amount of time I spent playing this game. This should be the best RPG ever made. Sadly, it isn't.\r\n\r\nIf all you want is value for money and if you have a spare week to read and understand the rules behind the scenes, go for it. It really has some amazing stuff going on. If you think this is a pick up and play game that you can come to grips with pretty easily (*cough* BG3 *cough*) then turn around and walk away.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Either turn down the difficulty or pull up the wiki if you want this game to be playable. Wrath of the Righteous is certainly ambitious, and its main saving grace is that it works for the story. There is an impressive variety when it comes to how your character adventures through this world — colourful locations, weaving pathways, distinct endings — and these differences work well most of the time.\nIf only the complexity had any sense of intuitiveness when it came to general gameplay. \n\nEncounters are speedbumps: most of the combat is already decided by items and stacked buffs — lore-accurate Witcher level prep is the only way to track through the sludge. Build variety is extremely convoluted: you likely can get the game to work how you want, when you want, all it takes is a hundred hours of practice and half your sanity. My character unwillingly collected spell after spell, I was drowning in a paralytic abundance of choice: Netflix Browsing gamified. \n\nI burnt out multiple times through my hundred hour playthrough, the only remedy was forcing myself into catatonic drooling sessions as I loaded my way in and out of undercooked army management and awkward puzzle menus. The crusade/main-crew split admittedly provide a decent pace throughout — I rarely felt bottlenecked — but it’s so tedious to actually play. I wouldn’t be surprised if 10% of my playtime is loading, be it save-scumming (entirely necessary) or traversing across zones. Even with an SSD your immersion will take beating after beating, momentum frequently assailed by a purple bar and handy tooltips. \nI get it though. If you love the number crunch, the aura farming, the apotheosis before taking on a gang of spiders, well then you’ve found the one. This is it, build-a-bear (for adults) with an epic fantasy skin. It’s just not engaging for me, when it comes to CRPGs I’m looking for a great story.\n\nAnd there are some genuinely interesting narrative threads, if you can stand the 10 hour wait in between the kernels. Characters do have layers (like ogres), and while companion quest content was unbalanced, I quite liked most of the gang.\nThere was rarely an obviously “wrong” choice presented. Good, lawful and evil seem to be equal in the game’s eyes — awesome. I was full on lawful neutral, my save-file ‘I AM THE LAW’ a warning to any rulebreakers or miscreants under my watchful Aeon eyes. I appreciated that the game takes you on a sojourn where the law is warped, and doesn’t purport what’s right or wrong. Good thing I'm infallible. \nThe ending I got was rather neat as well. I just wish the game was way shorter so I can experience the others myself. What’s the point of all this variety in the narrative if barely a tenth of players finish the game in the first place?\n\nThis is a game designed to sap your time. It’s begging for polish; its presentation awkward, tactics shallow, builds bursting at the seams. I wish priorities were altered, only a little bit of tinkering and Wrath of the Righteous could be an absolute blast. \nThere’s a possibility I return to the game, to do the Lich playthrough that’s been recommended to me, but you bet your ass I’ll be going in with wiki builds and a wooden stick between my teeth.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I'd play something else.  This game has gotten to the point I don't know what to do without looking online for clues.  It has become boring and I simply lost interest about 1/2 way through.  Great concept, boring story.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "The 'creative direction' in this game breaks immersion constantly, if more of it had been revealed in the first 2 hours I would have refunded",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I do not really see the point of this game, it's just boring. Npc are bad and (borderline?) cringe; you get into the same fight with the same enemies 4 billion times; and you basically spend all your early-mid game auto-attacking. \n\nI really like the amount of classes and archetypes you get to choose from tho, but that's about it. Once you are out of the character creation screen, the game is a hard 5.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game has a extreme learning curve, even on \"Normal\" difficultly isn't balanced well, and that's toned down enemies and damage from core system rules. Puzzles are often nonsensical, or key clues are locked behind perception rolls you might flub and never realize it. Or it's one of hundreds of books or notes you'll find in a single playthru. In terms of combat real time is not really usable unless you are on story mode. And animations in turn based are painfully slow. the hardest fights are behind non skippable cut scenes. \n\n\nThe only positives I can give is it is a good story with interesting NPCs.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I backed this game on kickstarter. This is because Pathfinder Kingmaker is one of my favorite games of all time and this games announcement is one of only two games I have ever been hyped for. \nThe game being extremely buggy at launch, having worse UI and other baffling facts about this game I could get into honestly don;t matter to me much.\nI quit early on for one reason, the writing. It feels so off. Like someone injected it with marvel writing, far too lighthearted even when the most extreme things are happening. It feels like every character is someones smug OC just mocking or making light of everything.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Finding out there were time limits in Act 1 basically killed any sense of adventure or discovery for me. I enjoy RPG games because I can explore the game world, meet and interact with different characters. When they become locked behind a stupid arbitrary time limit, which is only discovered after about 10+ hours of gameplay, nahh... I just feel as though I've wasted my precious time because of a pathetic gameplay mechanic, especially when it isn't made entirely clear which are \"priority\" quest lines.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Miss\r\nMiss\r\nMiss\r\nMiss\r\nHit (resisted)\r\nMiss\r\nMiss\r\n\r\nThat's pretty much the entire game, very poorly designed encounters. I liked it for a while, but the deeper you get into the game the worse it gets. You can install something like the toybox mod to try and bypass the worst parts of the game, but eventually you'll just be bypassing every other encounter. The encounters are designed around save scumming and having a very specific party with very specific skills that happen to be available, and that just isn't very well thought out or fun to play. Even encounters you win can take 20+ minutes of just you and the enemy missing each other nonstop. \r\n\r\nAttribute/level drain in particular is one of the worst thought out systems I've ever seen in a game. A common scenario is you have an encounter where you have maybe a 20% chance to hit anything, but then you are hit with something that drains points out of a given stat, or entire character levels, and so now you have a 5% chance to hit. You can use certain spells to reverse this (again, if you happen to have that character in the party, and they haven't used their spells already), but it'll just be reapplied in an AOE immediately after. And this isn't something reserved for a specific boss fight, half way through the game this is every other encounter.\r\n\r\nThe story is okay, not great, if you're not already familiar with Pathfinder lore then it feels like you're reading book three of a five part series and you didn't read the first two, just a constant barrage of wiki article info dumps. People complain about voice acting constricting what writers can do, and there is some truth to that, but this game made me realize that forcing some brevity on them isn't the worst thing in the world.\r\n\r\nNavigating the map is a pain. You're moving the party as a game piece on a paper map, from one point of interest to the next, but you have to discover the 'trail' between two points as you go, and it's often unintuitive, you'll spend a lot of time just trying to find a connection between two points. While you're doing this, it's constant random encounters that start another long cycle of miss-miss-miss combat, or your party gets fatigued and needs to rest. Once you've conquered most of the map via the crusade system and you have teleports set up at each fort, it gets a little more bearable, but is never really good. I don't think anybody is looking forward to another 10+ half hour long random encounters and fifteen rest stops on their road trip to the next quest objective.\r\n\r\nThe game does offer a RTWP and turn-based system that you can swap between seamlessly, but even there it needs a lot of work, the NPCs in RTWP mode are braindead, basically never using abilities or spells. Turn based meanwhile just takes an eternity. \r\n\r\nAll in all very disappointing. I'm shocked that they had an early access playtesting period and still shipped it like this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I avoided turn-based RPGs for a long time, and yes thus game allows you to toggle out of turn-based mode, but that's not exactly a positive.   I played Divinity II with friends and it got me thinking that maybe I was wrong about RPGs.  Then I played Baldur's Gate III and really enjoyed that.  So I got Pathfinder, looking to continue enjoying RPGs... but this seems to be a mistake.   \r\n\r\nYou can not play this game without a guide.  There is no kind of path to make sure you do things in the right order.  Unless you are a huge D&D nerd, you can't create a character or improve your companions in an effective way without a character creation guide.  \r\n\r\nIts been really annoying to spend more time researching the game than playing it.  I've gotten to a point where it seems I should have done certain tasks already, but didn't and the game is forcing me to engage in a massive battle that I am not prepared for.  I lost the battle once, re-loaded, and got crushed again.  SO I went back to an earlier save, tried to do somethings I missed, only to have the game force me back to the battle again before I should.... \r\n\r\nA lot of other negatives to this game.  My teams hits at about 20%, wasted turn after wasted turn.  And the companions die a lot.  If I had played this game before Divinity or BAldur's Gate, I never would have played them... glad I played them in the order that I did.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "There's a good concept here, but the execution of this game feels like a miss. There are a lot of \"trash\" fights, with many copy pasted enemies. The story can be interesting, but it is paced between many very long periods of traversing a very overly complicated world map. Navigating around the world and battlemaps is very boring and takes far too long. You must play this game either in story mode or with toybox, or else it feels like you are wasting huge amounts of time. The crusade mechanics are very bad, even if you turn them off they get in the way by timegating areas you can visit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Enjoyed the gameplay up until the tavern defense mission at about 5 hours in. I've spent the last hour in this ridiculous fight. If I quit now I lose all progress so far, but based on other reviews the fight can go up to round 40 or 50 before the final bosses spawn, and I'm only on 15. It is just a seemingly endless wave after wave of fighting. Repeatedly spawning the same few enemies over and over and over again while you're at a low level with limited number of AOE attacks meaning it's just a boring slog of slinging low level hits back and forth at each other.\r\n\r\nI really wanted to enjoy this game but this has ruined it for me. I don't have the attention span to sit through hours of endless stupid fighting like this. It's incredibly boring. Reddit has plenty of advice for how to extend your timer before this fight so you can go up levels to make it easier, but if you're like me with a smaller attention span and prefer fights to be done within 10 rounds, then this probably isn't the game for you either.\r\n\r\nAdditionally the character creation for someone unfamiliar with Pathfinder rules is a bit complicated. Too many options with limited explanations that don't fully explain how things work, or give literal essays worth of explanation that nobody has time or interest to read. It's not necessarily a bad game, but it's definitely not for people with small attention spans and more interest in exploring. Overall, would not recommend this game and wish I hadn't wasted my money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "WotR is tedious, poorly optimized and very, very dry. \r\n\r\nA single gameplay loop makes you jump through 18 loading screens (and I'm being very generous with the number here). Out of the 107 hours on record, around 60 hours were wasted on endless loading screens and crusade micro-management. \r\n\r\nIf you want to finish this game, prepare to sit through at least 2000 loading screens.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I will preface this review by saying that I do NOT care if a game is too long. I absolutely do not care if your RPG takes 10 hours of 100.\nI played Persona 5 for over 100 hours, and I played Royal for 120. I've played JRPGs since the 90s and have no problems whatsoever 100% them, and single play throughs taking  triple digit hours.\nI'll sit down and play a full BG1 -> BG2 -> ToB campaign and love every second of it. \nLength of a game is not a problem for me - I will happily sit down and go through the expansive world, lore, character building, and the raw hours it takes to get through the campaign is a non-issue.\n\nThat being said, this game's campaign is too fucking long.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bought this game a while ago, enjoyed Kingmaker and heard how much better this game is and snatched it up on sale.  I currently have some nerve damage in my arms so I can only playing things with a controller for now.  This game says it supports controller play but that's not entirely true.  I have an 8BitDo that I use, love it, just finished Rogue Trader with it, but this game won't recognize it.  However, when I play it on the Steam Deck it recognizes those controls and defaults to an Xbox setup.  Not sure why this hasn't been fixed.  I also haven't seen it addressed anywhere by anyone at owlcat.  If it gets fixed in the future (and I sure hope it does, really would love to play this) or if I find a work-around I'll change my review.\n\nEdit: I've had a couple people recommend a few fixes but nothing so far has seemed to work.  Using an emulator, disabling/enabling steam inputs, reinstalling drivers, updating firmware, even hooking up my old Xbox one controller that still works in every other game (stick drift aside).  Very appreciative of the help and suggestions, though, thank you guys!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spending minutes to buff your entire party for a single combat with unbalanced and overleveled enemies again and again is not really that fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game crashes frequently.  I don't spend money to dig through my computer to address issues the game programers should have fixed before launching the product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TL;DR: \nfinished the game because I simp for hot demon goat lady\n\nActual Review:\nAlthough it's a pretty decent game, WotR is NOT an easy recommend.\n\nI love both D&D and Pathfinder lore, and this game will do an amazing job at immersing you with its story and cast of characters. Roleplaying as a commander crusading against hordes of demons felt great as the game provides you with a number of Mythic Paths that give you unique powers (i.e you can lead the army as an Angel, a Dragon, or even an evil Lich). I can see a lot of replayability, but as I'm almost done with the game, I'm not sure if another playthrough is worth it.\n\nThat's because WotR is unfortunately BLOATED to the point of being grindy, tedious, and at times just plain boring. The game likes throwing trash mobs at you which makes most of the combat encounters repetitive (just like what MMOs do to drag things out). I also understand that Pathfinder is a complex system, but the designers could've picked the most impactful or fun mechanics from the tabletop ruleset to streamline your experience and make things more intuitive. I don't like how I COULDN'T enjoy this game without looking through other guides online. Also, Crusade Mode feels like a watered-down tactics game.\n\nTo wrap things up, WotR has its pros, but the cons are enough to hurt your experience. Some games just do it better imo. If you're looking for old-school D&D/RPG combat, Neverwinter Nights 1 does it way better. Dragon Age: Inquisition offers a similar experience with much more intensity and action (but focusing more on the personal rather than armies). And if you somehow enjoyed crusader mode army-management, the Heroes of Might and Magic series won't disappoint.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's strange how much older games of this style gives the AI enough intelligence to do their own attacks when it suits the situations. In this, you can give an AI 1 ability to always use whenever possible, but that's sorta it. And they will consume them very fast.\r\nI wouldn't mind having to control all characters if there were fewer but more dangerous fights - but when you have large amounts of it, it just gets tedious.\r\n\r\nThere are a few other issues but this is the most annoying one. Could be a fun game but, not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky, ugly, generally quite awful-feeling. I don't even know why I can't tolerate this game, but it's just something about the whole package. Somehow even much older CRPGs like Baldur's Gate 1 and 2 feel much less \"heavy\" to play than this game. \n\nHere you have tiny maps that still feel awful to traverse, with your characters moving slowly and the camera being way too zoomed in. Just feels underwhelming as a whole from a basic mechanical standpoint. Feels like a low quality product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It started out better and stronger then Kingmaker, but when i reached Drezen and the fighting had stopped. \nI was in for a nightmare again like in Kingmaker, same micro-management of Events/Army/Outposts..\n\nOwlcat really cannot make a RPG, without f**king it up..\n- First parts of this game is a nice RPG.\n- Mid part becomes a micro-management nightmare where you end up using more time on Events in town, speaking with people that before you & army's then going around exploring or doing actual RPG stuff..\n\nWho though it was a good idea to make an \"RPG\" where you move 3 days away from Town, \"Hey Event in Town someone want's to speak to you\".. Go back.. Someone on the road...repeat..repeat..repeat...\nAt this point its not even RPG & Roleplaying it's just annoying..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game would be fun if it didn't constantly crash. Do not buy this game for Mac. Certain sections are basically unplayable even with the graphics cranked down lower than an NES game. No amount of fixing, reinstalling, troubleshooting has been able to make this game reliably playable. I've managed to get a decent ways into the game by avoiding the missions and areas that constantly crash, but I'm disappointed to say I'm going to have to quit since it is crashing every few minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was having a lot of fun w/this game until it turned into spend all your cash on recruiting random guys that you toss at enemies that are too tough for you to ever beat. I got to a place in the game where I spent almost all my money trying to boost my army & couldn't beat the encampment of demons so there was zero way for the game to progress! What's the point of my playing on story mode if I can't play the game because it's somehow too hard even on easy?!?! I've never run into this with a game before where you could NOT progress in the game because of a lame strategy mechanic the developers built in making the whole process way harder than it needs to be. DON'T spend your money on this game VERY disappointed!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really, truly loved the Pathfinder: Kingmaker, and I've made multiple attempts at this one but I can't do it. I'm sure mechanically things stay as solid as they were in the previous game but I can't tolerate the voice acting in this game. I don't believe any individual voice artist does a particularly bad job, it is 100% directorial. So many characters feel as if lines were given to the artists without context as few characters really feel like they are responding to the stakes in any given scene making the characters feel incredibly flat. So I place blame firmly in the hands of the vocal directors. \r\n\r\nI'll have to try again and maybe just turn off the voices entirely, which is a big disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crusade mode kills any type of fun I have with this game. Combine that with terrible balancing of enemies that make so many builds a waste of time if you want to play the game on a normal difficulty and the high frequency of combat with trash mobs. Go play something from Larian if you want fun gameplay in a modern crpg.\n\nP.S. If I have to download mods to fix the problems with the game, do you really think that is ok? LMAO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is as wide as an ocean with the depth of an evaporated puddle, the combat (which is 90% of the game) is just atrocious has completely killed my interest. It's just a slog of constant encounters with no intelligent design other than wail on each other until something dies, while usually being out of range to hit anything so you have to waste time walking over to them just for them to hit you because now you're close enough to them. \r\nThis is further compounded by the enemies being resistant to basically everything, having AC in the 20's, multiple attacks at low levels, pages of abilities and passives (And this is the TRASH mobs) meanwhile I'm playing as a Cavalier and I'm STILL waiting to be allowed to mount and actually do what my class is meant to while only attacking (missing) once. And if someone does FINALLY hit, it's 1-8 damage at best and remember the enemies are hitting equal to or greater than that with multiple attacks.\r\n\r\nWhile a few (most are irritating and a couple I never reached) of the characters and story was just about good enough to keep me invested it's just not worth it now; I'm not having fun, I'm not engaged, I'm dreading actually having to go and interact with the gameplay because it's so dull and the enemies are uncreative and oppressive.\r\n\r\nTypical combat encounter on NORMAL difficulty and auto levelling on companions (because there's way too many useless options):\r\n\r\nPlayer's 6 (7 in my case) characters: \r\nMiss\r\nMiss \r\nMiss\r\nMiss\r\nMiss\r\nMiss\r\n\r\nA single enemy:\r\nHit 19 damage\r\nHit 12 damage\r\nHit 11 damage\r\n\r\n*Repeat for 3-5 other enemies*\r\n\r\nPlayer:\r\nDowned character\r\nDowned character\r\nHalf dead character\r\n\r\nRound 2 starts\r\n\r\nThe crusade strategy minigame would be interesting but it uses basically the same combat system as the rest of the game, so again, you lose dozens of soldiers, just to kill like... 3 of theirs. While also having to deal with a morale system that caps at 20, but can go all the way down to -100(???) and a resource management game that you don't really earn anything toward unless you buy them.\r\n\r\nJust play Larian, their games are better designed for the same story and character investment.\r\n\r\n\"It gets better late-\" Oh piss off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The moment crusader mode came up, I deleted this game immediately. \nUntil then I was having a blast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid writing, walls of text, overly complicated mechanisms (but I suppose this is pathfinder so to be expected)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Character creation requires several PhDs in D&D. Tons of bloated text on everything but no concise information, on what your choices actually do and what matters most. It becomes so complex that identifying with your character becomes increasingly difficult the further the creation process goes. Here already, the player is confronted with massive chunks of lore. A plethora of terms and names you won't ever hear from or read again but are seemingly important. My appreciation for this design is fairly low. In fact, I think it is bad design to hammer the player with irrelevant information to that ludicrous extent, when you just want to start playing. After character creation the game picks up quite nicely and the pacing feels right. You get hooked and the main objectives are clear. Once you escape the prologue into Act I, it goes completely downhill.\n\nA lot of reading. Plenty of inconsequential, tedious and boring dialogue. Yes, the lore is deep and if you love to immerse yourself in story-driven book reading simulations, have the required attention span and the commitment, then this may be the right game for you. To me it is really difficult having to deal with fomo and accept filtering through walls of text all day and skipping potentially interesting exchanges. But you don't get to play if you don't become selective about what to read and what better to fly through.\n\nThe voices are really well done. Unfortunately, most of the dialogue is not voiced and it seems arbitrary what they decided to dub. Still irritates me every single time I get to hear a character speak.\n\nImo, the game does a bad job at telling you, what objectives should be pursued first and which are optional side activities. Points of no return are not communicated/indicated at all, which makes thorough exploration impossible with external guidance.\n\nIt is hard to recommend but I know there is a market for these games. If you don't mind reading through this review, you certainly won't mind my thumbs down. Because chances are my main issues with this game won't apply to you and you may actually genuinely enjoy it a lot. I will give it some more time but this is certainly no Deadfire which was on point in terms of pacing throughout.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute garbage, the UI makes it hard to focus on whats happening in-game, extremely slow with movement, combat, looting, Apperantly you´re supposed to look at all the little clutter to find a requierd key to a quest, First 20 minutes has voice acting but it seems that the devs just gave up after that, i feel scamed and i bought this game on Eneba for 2$",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Janky encounter design, a design philosophy prioritizing suffering over all else, and a general disdain for their players. What's not to love?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring game. Can't get immersed when the voice acting is this terrible. This game tries to be Baldurs Gate 3 but fails in every aspect.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What in the bloody hell is this dialogue and these voice overs?! Am I playing a fantasy setting or GTA?!\n\n(obviously requested a refund, but since it's retail I don't know if I will get it. worst case scenario: lesson learned and developer blacklisted)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I thought this is more of a \"freeroam\" rather than go from point to point and multiple other points.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad writing, Very unlikeable NPCs and party members.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's honestly a pretty great game EXCEPT for the fact that it's so unfathomably poorly balanced that I gotta give it a not recommend.\nIt's so bad that it's impossible take the world seriously. Usually, game developers have the brain power to understand that how an enemy looks should somewhat translate to how dangerous they are, but somehow for some reason, 2+2 is something Owlcat struggles with. This is the kind of game where Altharez demon of hatred and destroyer of worlds or some shit is piece of cake and a zombie dog will molest your entire team. You'll think the game has been too easy for the last couple of hours and then all of a sudden you're gonna be focusing like you're on adderall to cheese a fight for 5+ tries.\nIt's a troll right? It's a meme right? Yeah well, I'm not one for lame jokes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Divinity: Original Sin 2, released 4 years ago, is much better...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "250 hours and I'm not even halfway. \nThat's too fuckin much.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Season Pass Things..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BAD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unnecessarily high level of entry for new players, way to many options to get lost, many of which are just trap feats or won't work for you. This game requires you to know so much in advance that you just cannot expect from someone just picking up the game. The amount of classes and subclasses the game offer might seam nice, but try to figure out what works and what's actually not worth your time. If you are a pathfinder veteran, I'm sure you're having a ton of fun, but as a newbie this game is pure pain. I cannot for the life of me understand the game design decisions made for this game. Throwing enemies with high resistances, damage reductions and immunities at the player starting at low levels is unreasonable. Unless you have a good grasp on this system, you are not going to have a good time. Sure you can watch hours of youtube videos discussing what's the optimal, but at that point you lost me. I can see this game was made by people who love the Pathfinder system for people who love it just the same, but doing so you forgot to ask the question? Is this fun for anyone who is not a die hard fan?",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "I feel like this game is amazing for people who adore deep lore and mechanics that are thought through to the most minute detail. I, unfortunately, am not that type of person, so all the reading and complex mechanics are overwhelming rather than enjoyable to me :( but I sure hope the people who do like that type of gaming have an amazing time with it!! <3",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "TLDR\nPathfinder: Wrath of the Righteous is honestly a good game if you like stupidly indepth character building and being able to roleplay a character pick it up it'll scratch that itch regardless of it's problems. However do prepare yourself for some really shitty RTS gameplay if you want to experience the game\n\nLong Review\nThis game took me a couple attempts to get into, the combat was the main problem. Turn Based Mode is ungodly slow to the point of being a genuine bore during some bigger battles and this is coming from someone who likes Turn Based RPGs. The Real time with Pause is awkward in a different way nearly 70 hours in it's incredibly hard to control, every half second you need to pause and reissue orders cause one of your characters obliterated the enemy you targeted and now everyone is defaulting to their AI auto commands which is usually just run at the nearest enemy or shoot arrows. Wish I could customise how my companions act in combat but ultimately it's fine just takes some getting used too \n\nThe character building is amazing so many different classes to choose from on top of mythic paths plus weapon specializations just all around 10/10 character building this will keep my attention for a long time to come and I don't even have the DLC yet which some of them apparently add more archetypes.\n\nI'm gonna talk about the other aspects of the game now and I'm gonna be honest kind of hate them as mechanics. The Crusade mode is an ungodly abomination and should've been cut from the game I'm a huge fan of grand strategy games playing games from Total War and Civilization to even dipping into HOI4 and Stellaris. The Crusade Mode which is basically a grand strategy gamemode is without a doubt the worst in the genre I've played for one it actively messes with your ability to just play the RPG aspects I literally got softlocked in Act 2 on the final fort to Dresen because my morale broke and I couldn't recruit new units and my army got obliterated by a spell caster general and I basically had to save load cheese until I got lucky and won. The morale is probably the biggest deal breaker, in the playthrough I got softlocked I managed to kill every enemy fort and every single enemy army except for one on the road to Dresen without losing a single unit and I went through Leper's Smile only stopping to help the Traveller and nothing else. According to this game's lore I'm cannonically the best leader of the crusades ever managing to do in 2 weeks what other commanders couldn't do in 70 years. Yet my morale broke because I let me army sit in camp for too long while I went and played the normal RPG section and it was only like a week of in game time not sure if the devs know this but real life armies wait around for months if not years, a week is not gonna matter at all. When your morale breaks you can't recruit your units skip their turns it's a pain in the ass.\n\nAnyway my personal experience with the Crusade mode aside lets talk about it's balancing. It's also terrible Individual units amount to nothing they do pretty much no actual damage to enemy units compared to generals. Some basic enemy units are just infinitely stronger than the strongest infantry you can recruit (I absolutely despise ghouls). The balance around generals is also insane not sure how this made it in. You can recruit individual generals to each army which is cool however if you pick anything other than a Spell Caster as a general you are just shooting yourself in the foot. Spell Caster generals can one shot pretty much anything in the mode even massive 300 unit stacks, it'll either half health it or just outright obliterate it. The mode becomes stupid easy because of it however the enemy can also have spell caster generals which becomes a problem for the same reason, they one shot an entire unit each turn and your armies can only have a handful of units. Meaning if you're up against a spell caster general that has more units then you you're gonna lose just on the base line of he has more meat to sacrifice\n\nAs a slight upside you can just disable the mode and focus on the RPG however this apparently locks out content and I don't care how small the content is that is still stupid optional game modes become less optional the moment you lock shit behind it\n\nThere's also a city builder aspect which honestly I don't think I can give a fair criticism of it looks like it would be fun to manage however it's mainly tied to the Crusade Mode which just rots everything it touches it becomes a chore and has a lot of events you need to solve and they can lock stuff away permanently if you pick wrong. \n\nI wish most of this review wasn't about the Crusade Mode and I could just gush about the RPG side however the Crusade Mode and City Builder actively clash with the RPG side and force you to leave it and manage the whiny diaper shitting armies constantly and I wish nothing was locked behind the Crusade Mode cause then I wouldn't need to talk about it I could just say it sucks don't play it and move on but you can't there's difficulty options for the Crusade Mode that make it better but it's still tedious and annoying plus I honestly hate that excuse labelling something as \"Optional\" should not just be a catch all for criticism it's genuinely terrible and came close to making me quit the game entirely when I got softlocked for essentially waiting too long it frustrated me so much I wish it wasn't cause I love those types of games and honestly a game that mashes City Builders, Grand Strategy, and RPG would be my dream game\n\nThis is still a good game but you kind of have to bend over backwards to see it shine turn the crusade mode to Story difficulty just so you can not miss anything and if you're not worried about missing anything just turn it off",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I think I gave this one a fair shake. Over Kingmaker, which had made a surprisingly late entry into my top 10 favorite games, I appreciated some of the technical improvements, new music, and so on; I really wanted to like it. Unlike many people who complained about the ridiculous numbers game, I was actually up for that now that I had gotten a slight taste of the Pathfinder 1e system and how to munchkin it a little,. I even bumped up my difficulty setting to Core.\n\nUnfortunately, it lacks the degree of layered, networked storytelling that had me falling in love with the River Kingdoms and their peoples in Owlcat’s previous Pathfinder title, and so ultimately failed to hold my continued interest in a game of this length. That’s pretty difficult to elaborate on. How about this: I’ll take a couple stabs at it, and perhaps you can decide to give yourself the green light to play the game because you just plumb feel differently about these issues.\n\nAttempt #1: It’s the difference between things happening and powers being gained because of chains of causality bouncing and tangenting off each other such that your character appears to have built something important, versus the same as a reward for beating stages in a video game. I understand that many players, perhaps a majority, are more attracted to WotR’s storytelling style (compared to KM’s) in the first place—like woo superpowers here we go, woohoo new teammate they get superpowers too as long as they’re technically in my party (even if I didn’t put them there)—but it puts me off because I neither feel like it’s been earned through narrative weight nor like I should be in some way grateful that it was predestined.\n\nAttempt #2: CRPG companions are annoying weirdos as a rule, but this litter doesn’t enthuse me nor grow on me like the previous crop did. They’re a little flatter, which is not the worst thing necessarily, but I would prefer CRPG companions that are more than just a meme. For the most part, they also don’t seem to have credible motivations for standing by your side through thick and thin in spite of possibly huge disagreements; this is the baseline character depth for RPG party members, isn’t it?\n\nTruth is, I still feel like I might revisit WotR one day and perhaps even change my mind, but I haven’t been back after two years despite thinking it was a better game on paper, and I didn’t even reach the part where most of the story’s detractors tap out. At least I got 126 hours out of it, you know? But it’s a sour taste for now.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Ugggghhhh I want to say buy this because it really is an amazing game. And upfront I will say my class and subclass seemed to play a large part in the issue, I assume other classes work better (my party members didn't seem quite as broken as I was), but I felt like I was banging my head against a wall the entire time I played this game, just waiting for things to finally start working the way they should.\r\n\r\nI came into this with a background playing and DMing DnD 5e and (foolishly) assumed this would be an good basis for getting to grips with this game. It was not. The problem is that everything in this game is stupidly complicated, doesn't really work properly, or is broken. For example:\r\n\r\nBroken:\r\nI played a mounted fighter. The entire point of my class was to fight while on a mount. However if I were in combat and mounted, any time I wasn't immediately adjacent to the enemy, my mount would wander over to the enemy, stop beside them, pause for five seconds, then my turn would end. No attack for me. No attack for my mount. Just turn finished. Every. Single. Time. I literally could not attack while mounted unless I was on top of the enemy already. If only I could charge toward them! (see below)\r\n\r\n\"Touch\" spell attacks on allies DO NOT WORK. These are the spells that I was predominantly (trying) to heal my party with. What happens is you select the spell. select your ally, then the caster walks towards the target, speaks some mumbo jumbo, burns a spell slot... and does not heal you.\r\n\r\nStupidly complicated:\r\nIn DnD you have an attack bonus for melee or ranged attacks. You use skills/spells/equipment to increase this. In this game you have an attack bonus which changes *every time you make an attack*. You can increase this through skills/equipment/spells except only some bonuses will stack but others won't and you have to try and piece together how to actually make this number go up without doubling/tripling/quadrupling on useless bonuses.\r\nIn DnD you have a saving throw for the spells you cast. This determines how difficult it is for an enemy to resist your spells. In this game you have a different saving throw for *every single spell in your spellbook*. Don't even get me started on spell resistance.\r\nI could go on about this for hours, and I assume this is faithful to the Pathfinder ruleset, but if you don't know these rules beforehand the game is waaaaaaaaay too complicated and messy and confusing.\r\n\r\nDoesn't really work:\r\nMy class mechanic revolved entirely around being able to charge into combat. The idea is I get on my mount, launch myself at an enemy, do a heap of damage upfront and then I either accept a decrease in damage output or run away and charge again. The problem is, actually charging an enemy almost never works. There is always an obstacle, often something completely arbitrary which looks like it should not be a problem, which prevented me from charging.\r\n\r\nSo I had a class which could rarely use the core mechanic (charging), and which didn't attack if I wasn't right next to the enemy, and which my healer would not heal even thought they cast a spell and burned through a spell slot.\r\n\r\nI got about halfway through the game, it is absolutely massive. The story is amazing. The choices are endless, the companions are great. This is what kept me trying and trying to get into the groove for the ridiculous amount of time I spent playing this game. This should be the best RPG ever made. Sadly, it isn't.\r\n\r\nIf all you want is value for money and if you have a spare week to read and understand the rules behind the scenes, go for it. It really has some amazing stuff going on. If you think this is a pick up and play game that you can come to grips with pretty easily (*cough* BG3 *cough*) then turn around and walk away.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Either turn down the difficulty or pull up the wiki if you want this game to be playable. Wrath of the Righteous is certainly ambitious, and its main saving grace is that it works for the story. There is an impressive variety when it comes to how your character adventures through this world — colourful locations, weaving pathways, distinct endings — and these differences work well most of the time.\nIf only the complexity had any sense of intuitiveness when it came to general gameplay. \n\nEncounters are speedbumps: most of the combat is already decided by items and stacked buffs — lore-accurate Witcher level prep is the only way to track through the sludge. Build variety is extremely convoluted: you likely can get the game to work how you want, when you want, all it takes is a hundred hours of practice and half your sanity. My character unwillingly collected spell after spell, I was drowning in a paralytic abundance of choice: Netflix Browsing gamified. \n\nI burnt out multiple times through my hundred hour playthrough, the only remedy was forcing myself into catatonic drooling sessions as I loaded my way in and out of undercooked army management and awkward puzzle menus. The crusade/main-crew split admittedly provide a decent pace throughout — I rarely felt bottlenecked — but it’s so tedious to actually play. I wouldn’t be surprised if 10% of my playtime is loading, be it save-scumming (entirely necessary) or traversing across zones. Even with an SSD your immersion will take beating after beating, momentum frequently assailed by a purple bar and handy tooltips. \nI get it though. If you love the number crunch, the aura farming, the apotheosis before taking on a gang of spiders, well then you’ve found the one. This is it, build-a-bear (for adults) with an epic fantasy skin. It’s just not engaging for me, when it comes to CRPGs I’m looking for a great story.\n\nAnd there are some genuinely interesting narrative threads, if you can stand the 10 hour wait in between the kernels. Characters do have layers (like ogres), and while companion quest content was unbalanced, I quite liked most of the gang.\nThere was rarely an obviously “wrong” choice presented. Good, lawful and evil seem to be equal in the game’s eyes — awesome. I was full on lawful neutral, my save-file ‘I AM THE LAW’ a warning to any rulebreakers or miscreants under my watchful Aeon eyes. I appreciated that the game takes you on a sojourn where the law is warped, and doesn’t purport what’s right or wrong. Good thing I'm infallible. \nThe ending I got was rather neat as well. I just wish the game was way shorter so I can experience the others myself. What’s the point of all this variety in the narrative if barely a tenth of players finish the game in the first place?\n\nThis is a game designed to sap your time. It’s begging for polish; its presentation awkward, tactics shallow, builds bursting at the seams. I wish priorities were altered, only a little bit of tinkering and Wrath of the Righteous could be an absolute blast. \nThere’s a possibility I return to the game, to do the Lich playthrough that’s been recommended to me, but you bet your ass I’ll be going in with wiki builds and a wooden stick between my teeth.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I'd play something else.  This game has gotten to the point I don't know what to do without looking online for clues.  It has become boring and I simply lost interest about 1/2 way through.  Great concept, boring story.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "The 'creative direction' in this game breaks immersion constantly, if more of it had been revealed in the first 2 hours I would have refunded",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I do not really see the point of this game, it's just boring. Npc are bad and (borderline?) cringe; you get into the same fight with the same enemies 4 billion times; and you basically spend all your early-mid game auto-attacking. \n\nI really like the amount of classes and archetypes you get to choose from tho, but that's about it. Once you are out of the character creation screen, the game is a hard 5.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game has a extreme learning curve, even on \"Normal\" difficultly isn't balanced well, and that's toned down enemies and damage from core system rules. Puzzles are often nonsensical, or key clues are locked behind perception rolls you might flub and never realize it. Or it's one of hundreds of books or notes you'll find in a single playthru. In terms of combat real time is not really usable unless you are on story mode. And animations in turn based are painfully slow. the hardest fights are behind non skippable cut scenes. \n\n\nThe only positives I can give is it is a good story with interesting NPCs.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I backed this game on kickstarter. This is because Pathfinder Kingmaker is one of my favorite games of all time and this games announcement is one of only two games I have ever been hyped for. \nThe game being extremely buggy at launch, having worse UI and other baffling facts about this game I could get into honestly don;t matter to me much.\nI quit early on for one reason, the writing. It feels so off. Like someone injected it with marvel writing, far too lighthearted even when the most extreme things are happening. It feels like every character is someones smug OC just mocking or making light of everything.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Finding out there were time limits in Act 1 basically killed any sense of adventure or discovery for me. I enjoy RPG games because I can explore the game world, meet and interact with different characters. When they become locked behind a stupid arbitrary time limit, which is only discovered after about 10+ hours of gameplay, nahh... I just feel as though I've wasted my precious time because of a pathetic gameplay mechanic, especially when it isn't made entirely clear which are \"priority\" quest lines.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Miss\r\nMiss\r\nMiss\r\nMiss\r\nHit (resisted)\r\nMiss\r\nMiss\r\n\r\nThat's pretty much the entire game, very poorly designed encounters. I liked it for a while, but the deeper you get into the game the worse it gets. You can install something like the toybox mod to try and bypass the worst parts of the game, but eventually you'll just be bypassing every other encounter. The encounters are designed around save scumming and having a very specific party with very specific skills that happen to be available, and that just isn't very well thought out or fun to play. Even encounters you win can take 20+ minutes of just you and the enemy missing each other nonstop. \r\n\r\nAttribute/level drain in particular is one of the worst thought out systems I've ever seen in a game. A common scenario is you have an encounter where you have maybe a 20% chance to hit anything, but then you are hit with something that drains points out of a given stat, or entire character levels, and so now you have a 5% chance to hit. You can use certain spells to reverse this (again, if you happen to have that character in the party, and they haven't used their spells already), but it'll just be reapplied in an AOE immediately after. And this isn't something reserved for a specific boss fight, half way through the game this is every other encounter.\r\n\r\nThe story is okay, not great, if you're not already familiar with Pathfinder lore then it feels like you're reading book three of a five part series and you didn't read the first two, just a constant barrage of wiki article info dumps. People complain about voice acting constricting what writers can do, and there is some truth to that, but this game made me realize that forcing some brevity on them isn't the worst thing in the world.\r\n\r\nNavigating the map is a pain. You're moving the party as a game piece on a paper map, from one point of interest to the next, but you have to discover the 'trail' between two points as you go, and it's often unintuitive, you'll spend a lot of time just trying to find a connection between two points. While you're doing this, it's constant random encounters that start another long cycle of miss-miss-miss combat, or your party gets fatigued and needs to rest. Once you've conquered most of the map via the crusade system and you have teleports set up at each fort, it gets a little more bearable, but is never really good. I don't think anybody is looking forward to another 10+ half hour long random encounters and fifteen rest stops on their road trip to the next quest objective.\r\n\r\nThe game does offer a RTWP and turn-based system that you can swap between seamlessly, but even there it needs a lot of work, the NPCs in RTWP mode are braindead, basically never using abilities or spells. Turn based meanwhile just takes an eternity. \r\n\r\nAll in all very disappointing. I'm shocked that they had an early access playtesting period and still shipped it like this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I avoided turn-based RPGs for a long time, and yes thus game allows you to toggle out of turn-based mode, but that's not exactly a positive.   I played Divinity II with friends and it got me thinking that maybe I was wrong about RPGs.  Then I played Baldur's Gate III and really enjoyed that.  So I got Pathfinder, looking to continue enjoying RPGs... but this seems to be a mistake.   \r\n\r\nYou can not play this game without a guide.  There is no kind of path to make sure you do things in the right order.  Unless you are a huge D&D nerd, you can't create a character or improve your companions in an effective way without a character creation guide.  \r\n\r\nIts been really annoying to spend more time researching the game than playing it.  I've gotten to a point where it seems I should have done certain tasks already, but didn't and the game is forcing me to engage in a massive battle that I am not prepared for.  I lost the battle once, re-loaded, and got crushed again.  SO I went back to an earlier save, tried to do somethings I missed, only to have the game force me back to the battle again before I should.... \r\n\r\nA lot of other negatives to this game.  My teams hits at about 20%, wasted turn after wasted turn.  And the companions die a lot.  If I had played this game before Divinity or BAldur's Gate, I never would have played them... glad I played them in the order that I did.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "There's a good concept here, but the execution of this game feels like a miss. There are a lot of \"trash\" fights, with many copy pasted enemies. The story can be interesting, but it is paced between many very long periods of traversing a very overly complicated world map. Navigating around the world and battlemaps is very boring and takes far too long. You must play this game either in story mode or with toybox, or else it feels like you are wasting huge amounts of time. The crusade mechanics are very bad, even if you turn them off they get in the way by timegating areas you can visit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Enjoyed the gameplay up until the tavern defense mission at about 5 hours in. I've spent the last hour in this ridiculous fight. If I quit now I lose all progress so far, but based on other reviews the fight can go up to round 40 or 50 before the final bosses spawn, and I'm only on 15. It is just a seemingly endless wave after wave of fighting. Repeatedly spawning the same few enemies over and over and over again while you're at a low level with limited number of AOE attacks meaning it's just a boring slog of slinging low level hits back and forth at each other.\r\n\r\nI really wanted to enjoy this game but this has ruined it for me. I don't have the attention span to sit through hours of endless stupid fighting like this. It's incredibly boring. Reddit has plenty of advice for how to extend your timer before this fight so you can go up levels to make it easier, but if you're like me with a smaller attention span and prefer fights to be done within 10 rounds, then this probably isn't the game for you either.\r\n\r\nAdditionally the character creation for someone unfamiliar with Pathfinder rules is a bit complicated. Too many options with limited explanations that don't fully explain how things work, or give literal essays worth of explanation that nobody has time or interest to read. It's not necessarily a bad game, but it's definitely not for people with small attention spans and more interest in exploring. Overall, would not recommend this game and wish I hadn't wasted my money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "WotR is tedious, poorly optimized and very, very dry. \r\n\r\nA single gameplay loop makes you jump through 18 loading screens (and I'm being very generous with the number here). Out of the 107 hours on record, around 60 hours were wasted on endless loading screens and crusade micro-management. \r\n\r\nIf you want to finish this game, prepare to sit through at least 2000 loading screens.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I will preface this review by saying that I do NOT care if a game is too long. I absolutely do not care if your RPG takes 10 hours of 100.\nI played Persona 5 for over 100 hours, and I played Royal for 120. I've played JRPGs since the 90s and have no problems whatsoever 100% them, and single play throughs taking  triple digit hours.\nI'll sit down and play a full BG1 -> BG2 -> ToB campaign and love every second of it. \nLength of a game is not a problem for me - I will happily sit down and go through the expansive world, lore, character building, and the raw hours it takes to get through the campaign is a non-issue.\n\nThat being said, this game's campaign is too fucking long.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bought this game a while ago, enjoyed Kingmaker and heard how much better this game is and snatched it up on sale.  I currently have some nerve damage in my arms so I can only playing things with a controller for now.  This game says it supports controller play but that's not entirely true.  I have an 8BitDo that I use, love it, just finished Rogue Trader with it, but this game won't recognize it.  However, when I play it on the Steam Deck it recognizes those controls and defaults to an Xbox setup.  Not sure why this hasn't been fixed.  I also haven't seen it addressed anywhere by anyone at owlcat.  If it gets fixed in the future (and I sure hope it does, really would love to play this) or if I find a work-around I'll change my review.\n\nEdit: I've had a couple people recommend a few fixes but nothing so far has seemed to work.  Using an emulator, disabling/enabling steam inputs, reinstalling drivers, updating firmware, even hooking up my old Xbox one controller that still works in every other game (stick drift aside).  Very appreciative of the help and suggestions, though, thank you guys!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spending minutes to buff your entire party for a single combat with unbalanced and overleveled enemies again and again is not really that fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game crashes frequently.  I don't spend money to dig through my computer to address issues the game programers should have fixed before launching the product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TL;DR: \nfinished the game because I simp for hot demon goat lady\n\nActual Review:\nAlthough it's a pretty decent game, WotR is NOT an easy recommend.\n\nI love both D&D and Pathfinder lore, and this game will do an amazing job at immersing you with its story and cast of characters. Roleplaying as a commander crusading against hordes of demons felt great as the game provides you with a number of Mythic Paths that give you unique powers (i.e you can lead the army as an Angel, a Dragon, or even an evil Lich). I can see a lot of replayability, but as I'm almost done with the game, I'm not sure if another playthrough is worth it.\n\nThat's because WotR is unfortunately BLOATED to the point of being grindy, tedious, and at times just plain boring. The game likes throwing trash mobs at you which makes most of the combat encounters repetitive (just like what MMOs do to drag things out). I also understand that Pathfinder is a complex system, but the designers could've picked the most impactful or fun mechanics from the tabletop ruleset to streamline your experience and make things more intuitive. I don't like how I COULDN'T enjoy this game without looking through other guides online. Also, Crusade Mode feels like a watered-down tactics game.\n\nTo wrap things up, WotR has its pros, but the cons are enough to hurt your experience. Some games just do it better imo. If you're looking for old-school D&D/RPG combat, Neverwinter Nights 1 does it way better. Dragon Age: Inquisition offers a similar experience with much more intensity and action (but focusing more on the personal rather than armies). And if you somehow enjoyed crusader mode army-management, the Heroes of Might and Magic series won't disappoint.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's strange how much older games of this style gives the AI enough intelligence to do their own attacks when it suits the situations. In this, you can give an AI 1 ability to always use whenever possible, but that's sorta it. And they will consume them very fast.\r\nI wouldn't mind having to control all characters if there were fewer but more dangerous fights - but when you have large amounts of it, it just gets tedious.\r\n\r\nThere are a few other issues but this is the most annoying one. Could be a fun game but, not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky, ugly, generally quite awful-feeling. I don't even know why I can't tolerate this game, but it's just something about the whole package. Somehow even much older CRPGs like Baldur's Gate 1 and 2 feel much less \"heavy\" to play than this game. \n\nHere you have tiny maps that still feel awful to traverse, with your characters moving slowly and the camera being way too zoomed in. Just feels underwhelming as a whole from a basic mechanical standpoint. Feels like a low quality product.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It started out better and stronger then Kingmaker, but when i reached Drezen and the fighting had stopped. \nI was in for a nightmare again like in Kingmaker, same micro-management of Events/Army/Outposts..\n\nOwlcat really cannot make a RPG, without f**king it up..\n- First parts of this game is a nice RPG.\n- Mid part becomes a micro-management nightmare where you end up using more time on Events in town, speaking with people that before you & army's then going around exploring or doing actual RPG stuff..\n\nWho though it was a good idea to make an \"RPG\" where you move 3 days away from Town, \"Hey Event in Town someone want's to speak to you\".. Go back.. Someone on the road...repeat..repeat..repeat...\nAt this point its not even RPG & Roleplaying it's just annoying..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game would be fun if it didn't constantly crash. Do not buy this game for Mac. Certain sections are basically unplayable even with the graphics cranked down lower than an NES game. No amount of fixing, reinstalling, troubleshooting has been able to make this game reliably playable. I've managed to get a decent ways into the game by avoiding the missions and areas that constantly crash, but I'm disappointed to say I'm going to have to quit since it is crashing every few minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was having a lot of fun w/this game until it turned into spend all your cash on recruiting random guys that you toss at enemies that are too tough for you to ever beat. I got to a place in the game where I spent almost all my money trying to boost my army & couldn't beat the encampment of demons so there was zero way for the game to progress! What's the point of my playing on story mode if I can't play the game because it's somehow too hard even on easy?!?! I've never run into this with a game before where you could NOT progress in the game because of a lame strategy mechanic the developers built in making the whole process way harder than it needs to be. DON'T spend your money on this game VERY disappointed!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really, truly loved the Pathfinder: Kingmaker, and I've made multiple attempts at this one but I can't do it. I'm sure mechanically things stay as solid as they were in the previous game but I can't tolerate the voice acting in this game. I don't believe any individual voice artist does a particularly bad job, it is 100% directorial. So many characters feel as if lines were given to the artists without context as few characters really feel like they are responding to the stakes in any given scene making the characters feel incredibly flat. So I place blame firmly in the hands of the vocal directors. \r\n\r\nI'll have to try again and maybe just turn off the voices entirely, which is a big disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}