{
  "positive": [
    {
      "review": "Relaxing and fun, the perfect sequel to the first game. My only gripe is that I miss the workshop feature, I used it a lot in the first game. I even made a school that was fully stocked with products and toys as my final project in a child development class. But it's not the end of the world that it's absent as the quality of life improvements more than make up for it. Wonderful game, I recommend it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "House Flipper is a title that, probably, by surprise came to be a simulation title that is major and has a wide recognition. I have been waiting for House Flipper 2 for a long time. The last installment of the game offered me lots of fun hours, and I hoped for the sequel to do the same. House Flipper 2 is a flipping simulator created by a Polish company, Frozen District.\n\n🧠We have to start somewhere, so at the beginning of the game we have to clean or repaint very neglected houses. This introduces a new element: unpacking clients boxes. This allows us to do our first decorating and learn how to arrange items, for example, on shelves, which can sometimes be problematic. We also get the chance to learn basic game functions thanks to instruction books left in various places in the clients' houses.\n\nOriginally simple tasks gradually evolve into increasingly complex and better paying ones. Through them, we build our reputation and can see how much work the developers put into the details. I'm most captivated by the stains left after a raccoon's visit, and then we complete the task by washing off its paw prints.\n\nTasks are rated on a scale of 1 to 3 stars. A big plus is that just one star is enough to complete the task, and that you don't need to complete the task 100% to earn all the stars. Perfectionists will appreciate the device that allows you to find every dirt and the smallest debris.\n\nA major change and surprise are the phone calls we receive from customers during house inspections. We learn the caller's backstory and personality, which allows us to experience a modest plot that, in my opinion, changes the nature of this game. We no longer have impersonal orders; we clean the house of a celebrating band or an absent-minded artist. Of course, we don't have to answer the phone, which would be worthwhile sometimes.\n\nAdditional activities like window washing and appliance assembly add a bit of variety to the gameplay, but they could be a bit more elaborate. Self assembly is limited to a few clicks and possibly moving pipes. The store offers us some discounts in return, but I'm uncertain if it is worth it. The games per se are not so interesting and I experienced minigame loading times that were as long or longer than the whole game itself even though I had a good configuration. Fortunately, they can be skipped, which I often used.\n\nHouse Flipper 2 changes the gameplay experience somewhat, after we've explored our capabilities and begun renovating on our own, enabled by the funds we've acquired. We purchase our first house and refine it to our tastes you can get a bit of a Sims vibe. For those who, like me, played the first version of the game, a major change is the decoration database and interior design options. Various architectural styles are now available, which in the original version were really limited to the most basic ones.\n\nWhen we finish, we go back to our home, the house, which we got as an inheritance from our parents and which also needs a repainting. We can also here, let the fantasy take us and make it the house of our minds. Naturally, just like in the first simulation, we can sell the house and buy a different one.\n\nFor architecture fans, a completely new feature is available - sandbox mode. Thanks to it, we construct buildings from scratch, having the ability to fly and use all the game's tools. This is where the opportunity to share our projects with others comes in. We can boast about our building skills and create challenges similar to those in the game, involving cleaning up stains and clearing up trash.\n\n✅Pros.\n- The ability to build your own house\n- A wide variety of architectural styles\n- Freedom in choosing colors, patterns, and object placement\n- Distinctive details\n- Various orders\n\n❌Cons.\n- The need to throw garbage bags into trash cans is annoying, artificially lengthening the gameplay\n- Minigames are not entirely successful and quickly become boring.\n- The smaller the space you're working in, the more problems and bugs you encounter with movement and basic game functions.\n\n🧾In Conclusion.\nIs House Flipper 2 a copy of the first game? Yes and no. I must admit that the second installment has brought a lot of variety and innovation, making it a truly enjoyable experience thanks in part to the flipping and new decorations. The game constantly calls for a bit more variety in the minigames and assembly elements, and for not artificially lengthening the gameplay we get a fun game that can last dozens of hours.\n8/10🔚",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I've mostly played at launch but there's been tons of free content updates and patches and of course i bought the scooby doo dlc, and now there's co-op too?? Super relaxing and fun game, if you like decorating you'll enjoy this as well. Feels a lot more intuitive with the controls, although I wish it was easier to deal with patterns etc. Still a 10/10 and my vote for labor of love 2025 <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "after playing both games, this should be number 1 and house flipper number 2... HF1is way better with paint options, lights, furniture etc.. IMHO this isn't as good as the first one at all.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Love it, one of my favorite games. Lots of people will tell you HF1 is better, I disagree. Everyone's entitled to their own opinions of course, but this game features far superior functions to the first, such as the ability to copy objects and find them in the catalog from a single click, plus there's so much more continuity between objects and materials. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love the control of the wall and floor decor, allowing creative tiling. I just miss some of the fun dlc from the first game - pets, yardwork, gardening and the lack of new jobs/emails after a while. I even miss renovating old furniture.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game! Just as much fun as the last one, but with even more cool features. The only downside is that it seems you need a higher quailty computer to play & crashes alot on mine that worked fine with House Flipper 1. It is still a pretty new game, so could just be some bugs that need fixed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is very addicting! Enjoy cleaning, decorating, and even building and assembling in this game! Teaches you how to use every tool and makes it feel easy! Tons of jobs to pick up and even the ability to buy and flip your own houses without those limitations! A bit of something for almost everyone and multiplayer just makes the fun greater!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, relaxing and satisfying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had over 600 hours in the first House Flipper game so when this got released I was really excited. At first, it was a little underwhelming, but that's probably because I was so used to all the content in HF1. HF2 has grown on me though, and as they start bringing it new DLC it's getting better. There's still a couple of areas in which I prefer the first game, notably the cleaning mechanic which was so much better in the first, but overall it's a solid game. The building mechanic and sandbox are amazing and the level of customisation especially with the custom paints make it a very satisfying game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly pretty amazing!  I was worried with all the odd ball reviews.  Do not listen to them.  It is an amazing game.  My wife and I love the CO-OP and play every chance we get!  By far our favorite game out there right now and hope they continue to add more content!  I don't ever leave comment's for games.  Maybe twice in my life I've left a review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and the mechanics are much easier than House flipper 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "House Flipper 2 has completely stolen my heart. It takes everything I loved about the first game and makes it smoother, prettier, and even more satisfying. The building and renovation tools feel so intuitive and creative, and placing every tile or piece of furniture is genuinely relaxing. I find myself sinking hours into designing the perfect spaces and never getting tired of it.\n\nThe visuals are gorgeous and the world feels cozy and full of personality. I really love how flexible the game is. You can follow jobs if you want some structure, or just dive into full creative mode and build something from the ground up. It is the perfect game to unwind with, and it scratches that creative itch like nothing else.\n\nIf you enjoy renovation, designing interiors, or just zoning out with a calm and rewarding game, this is absolutely worth it. Easily one of my favorite games ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really nice game a major improvement over House Flipper 1 cant wait for the Remaster of HF1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very chill and nice game its worth the money!\nI like it more than house flipper 1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have tried the game when it went for free. It is good. There are lots of activities and also freedom when it comes to renovating your own house. You've got missions/contracts in which you will need to follow certain guidelines but it is very good and well made. There are improvements from the previous game as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Building a house from scratch would be difficult, but remodeling the houses is fun. I also love the scooby doo update and I hope they make more content for this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is cozy and filled with creativity and inspirations for decor design. The sandbox box and community creations will make the game live for a long time to come, not to mention the new and upcoming DLCs. Definitely recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very relaxing game espically when i need a break from societial issues",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "House Flipper 2 is a fantastically fun game, and a worthwhile upgrade to its predecessor.\r\n\r\nIt makes me feel better in allowing me to pretend to care, when much like the houses I clean, I am simply dead inside and trying to decorate that void with shiny objects.\r\n\r\n5 Stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game but lately when i do paid jobs in sandbox mode the money dose not show up even after days of waiting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game. It has so many options to explore. I love all the jobs. I love deciphering the mysteries of Pinnacove. My only complaint is that I wish there was more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for passing quality time. it is for those who dont want to take stress for playing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the game a lot. played through the whole story by now and i still enjoy replaying the missions. genuinely such a good game to just chill and relax after a long day of work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is amazing. They took everything good from the first House Flipper and added even more features.\r\nNow you can break and build any wall, inside or outside, which gives you a lot more freedom to create your own designs. They keep adding new items and furniture too, so the only limit is your imagination.\r\nHouse Flipper games are always going to be one of my favorites. I’ll always recommend them to anyone who likes using their brain and being creative.\r\n\r\nI will admit, you may get stuck from time to time. Some builds are missing the items you need. For example, I started making a gym in “The Old Market” house, but the game doesn’t have proper gym equipment yet (at least at the time I’m writing this), so I had to pause that build. You can suggest new ideas in the Discord, but it might take time before they add them — if they even do.\r\nStill, you can always find a workaround. Use items that are not rated for that room, or change the design a little to make it work.\r\n\r\nConclusion:\r\nI really recommend this game. If you’re thinking about buying it — go for it. Try it for 2 hours, and I’m sure you’ll fall in love with it like I did. And if not? Just refund it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played my handful of hours of House Flipper, and now this one. I got to say this one is far better than the first. The visuals are a bit more interesting, the customizations, the multiplayer. There's a lot to love, like the sandbox where you can make builds of your own for you or share them for other people to check out. There is a lot of creative freedom in sandbox. I adore this game a lot and I enjoy sitting back and playing this game. It may not be everyone's taste of cleaning and then decorating, but if it is, you'd like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "House Flipper 2 is the part two to House Flipper 1. (Duh) But 2 brings more stuff to do and even some more lore, this game is good for people who like interior design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of fun and stuff to do sandbox community made makes it to where you don't run out of stuff to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome wholesome game. Really enjoy this game while I listen to my audiobooks. Definitely recommend to those who want a creative decorative game that keeps you busy but also satisfied w/ your creations or creating what others put out there in the community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great relaxing game, lots of realistic actions. Educational. Perfect for someone seeking relaxation and time for meditation. Useful to turn off the music and turn your own music on. Has many languages which is helpful. Great pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never stops being fun. Way better mechanics than in HF1. Keeps getting more updates. Nothing that i dont like so would definitely recommend it to everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to have fun chillin and going insane with detail and building how you want things to go. Money is easy to get and depending on the job it is easy money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm absolutely IN LOVE with HF2! <3\n\nI liked HF1 but I didn't like the stiffness of the movement in the first game. This game feels faster and I enjoy the trash pick-up and the spray and wipe functions. However, I'm personally not a fan of the new painting function but that's just me. I've only played 7 hours of this game but I'm enjoying it so far. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game basically on launch at $60 AUD, I got barely any hours out of it and at the time would say that it really was not worth it all. however today there is so much more added content with dlcs expanded free story, i would definitely recommend this game for just a chill game to relax in, the puzzles in some of the different houses like the scooby doo dlcs are pretty fun aswell. Overall very good game would recommend buying especially on a sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really loved the first House Flipper and I feel like this one expands on the previous one quite well. I love how much the creative tools open up new possibilities that the previous game didn't have. I do wish there was as much furniture as the last game, or even just more furniture in general, but given what we have I think it's a great selection.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game takes over my life for weeks at a time, I loved the original and this game just improves upon an already great concept. One of my favourite games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game series!! If you rmjoy decorating and creating, then this game is for you! I get lost in time when playing this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a fun and addicting decorating and furniture placing simulator heartily recommend for anyone looking for a good relaxing game to add to there steam library",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I adore this game! I own both games and while i have had upsetting errors they often get very overshadowed by more important and enjoyable aspects of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Inovation-relaxing-fun\nThis game comes up with new things and keeps giving, its fun and relaxing all at the same time. \nNot all new things are dlc and it does show that they care about the community! \n\nAlso the co-op is great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "House Flipper 2 takes everything fans loved about the original game and pushes it to a new level of detail, creativity, and comfort. It manages to be both relaxing and surprisingly addictive, offering a perfect blend of renovation, design, and storytelling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wonderful for those who love interior and exterior design in terms of requested design or just mucking around. I love this game and love building and design. \n\nOnly downside i could see is no diagonal walls but that is honestly a nonissue to me personally.\n\noverall 5/5 game for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the customization in this game so much. I thought House Flipper was good but this truly is even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As it has grown and been expanded on, House Flipper 2 has easily improved on all that made the original an amazing game. A relaxing, fulfulling experience, and now with a lot more control for original ideas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, House Flipper 1 has a rich workshop filled with many items, but the custom building in this game exceeds what HF1 was capable of and for that reason I prefer HF2 over HF1. If they bring the workshop into HF2, it'll be even better!. Would definitely recommend this game for those that love to construct homes and just enjoy a cozy title after a long day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Eng/PT-BR)\r\nSuch a nice game! It's chill, fun, but still has goals to achieve. And I love how dedicated the dev seems to be! / Aaaaamo esse jogo! Gostosinho e de boa de jogar, passa bem o tempo, divertido pra c******.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it’s a delightful, stress-free game perfect for anyone who enjoys designing, decorating, and bringing spaces back to life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so fun I love the new tools  it is different from the first but in a really good way once you get used to it. I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game.  The graphics are wonderful and you can be super creative!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely suggest this game because it is one of the most relaxing games and the UI is imo well done to get the job done. However, I would love to see the steam workshop again like HF1 has in the future, I know they are in the works of something but I don't believe it will be any time soon. It does feel like it lacks jobs as well but able to obtain more jobs by other players but it has to be played in sandbox. That is my main turn off, having to switch to sandbox mode instead of staying in my main campaign. I hope future mods will allow into main campaign for objects, etc.\r\n\r\nDevelopers are consistently working on updates and have been extremely communicative which they are quite pretty good with since the start. \r\n\r\nNow, the best part I have experienced was Co-Op mode and it can be played in both sandbox and main campaign. It really does bring in extra fun to see what your friend does on a job in a different room and how they would decorate meanwhile I would decorate my room. The best part is laughing when the snapshots of completed works only showcase mine and sometimes their work is glitched so you just see a wall or only the object blocking \"camera\". I do wish the snapshots actually did every single section where we had completed though.\r\n\r\nOther than that, I highly recommend this game if you want to wind down for the day and just relax with or without your friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who's played HF1 and HF2 I'd recommend HF2 as there are much better customisation options and QOL improvements. Its a better experience that lets you create all kinds of house types from top to bottom. I've never been happier to place a bathroom, placing tiles and plumbing in HF1 used to take 10 years. Guys complaining that there's less furniture and jobs than HF1 forget that game had a lot of free updates and DLC over the years its been out. HF2 has been having consistent updates with more furniture and amenities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game to let your imagination run wild building and renovating houses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love LOVE LOVE THIS GAME! I own both houseflippers and its just so calming after a stressful day!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've gotten to play. Had the first one for a long time so I was definitely looking forward to this one too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun casual game to waste a lot of time in. Sometimes I find it a little bit tedious and some of the mechanics clunky but the game makes up for it in having a solid foundation, variety, and a killer customization model.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy simulation games where you build I highly recommend this game. It gives you scenarios but also creative freedom when buying and flipping houses along with a sandbox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how I can organize everything, buy houses to fix and sell, no to mention the DLC's I can buy, which makes it more fun. The only thing I don't like is how sensitive the graphics are, it was so glitchy when I first downloaded the game, but after some adjusting of the settings, I was able to get rid of most of the glitches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really great game. If I was twelve I would've pissed myself out of happiness. \n\nThat said, this game is 10x better than the first one. Has better furniture detailing, more maps, more furniture, a new cool \"Assembly\" game mode, where you build a furniture from scratch in a limited amount of time, more tools and better controls. You can paint walls by just moving your mouse around, which is better than holding LMB for a minute or more.\n\nLocations are really diverse and detailed. They utilize game's full potential of decorating, and it's visible that developers putted a lot of effort into location designs.\n\nI was a big fan of the first game, and this one is better in every way. I don't have any complaints whatsoever. It's just perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love House Flipper 2... when I can play it. I've had the game for well over a year and it's always been a bit buggy but it's never been like this. Constant crashes. It's surprising when I can make it an hour without the game freezing up on me. I've done all of the trouble shooting recommend online but it hasn't helped much if at all. This could just be a me problem but seeing as the game worked fine when I first got it I am a little lost. \r\nWhen the game is performing well it is genuinely a blast. It scratches the same itch as building in the sims 4 does. The interactions with clients are also pretty funny and heartwarming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played house flipper 1 for over 1.2 days in one go so I love these games, I finally got house flipper 2 and I fell in love, the only thing I hate is the painting, the painting makes me want to rip my hair out, but other than that I 100% love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good time to relax and enjoy the before and after pics. Still wish they would add more cyberpunk or spoof maps like in the first one but the added campaign really makes it worthwhile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved the first game on Xbox and, while still getting used to playing on PC, this game feels more comprehensive and detailed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I truly enjoy this game! I enjoyed the first one, but them adding coop truly bumped up the experience. Would I recommend yes yes I would.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "House Flipper 1 but modern, visually is a lot prettier, decorating and flipping the houses is really fun, there's a lot of customization and set colours that make everything easier, I'm really looking forward for the dlc's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When the main content stops, the integrated modding community keeps this game alive by making super creative custom jobs. Highly recommended for a day of chill flipping and a massive step up from hf1!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a wonderful game that has me completely in love. It’s fantastic everything I can do, but I’d love to have more houses to renovate. One thing I wish the game had is the option to create my own wallpapers—or at least offer more variety, especially for children’s rooms, since there isn’t much. I’d also like to have more variety for duvets and sofa upholstery. But overall, it’s one of the best games I’ve ever played!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i lost my wife, kids, and job because i've spent all of my time playing this game. send help. i'm buried in garbage bags.\r\n\r\ndespite that, i'm not a large fan of the new way to paint nor destroy/rebuild compared to the last game. the upgrades do help make everything easier but they feel too lack luster as of now and as though some upgrades (i.e vacuuming a larger area, vacuuming faster, etc) are just entirely missing from the game itself. multiplayer has had a few small issues with disconnecting but game play overall is still so smooth and doesn't interact with the story in a negative way. :=)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice game! I have a bad laptop and mainly use house flipper one because I'm less laggy but this is a HUGE upgrade from the first game! I really love how interactive it is, the only thing Id add is more decor and better scanning because the things that light up are hard to spot sometimes!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love house flipper very much. I wish they would add more jobs or any DLC in the future. Thanks for all the features. It truly helps a lot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If I have to renovate an entire mansion... GIVE ME MORE PHOTOS! We love this game but we spend hours to see a transformation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addition of player-made stages put the icing on this cake, but it could do with a bit more data efficiency- I've had the game crash countless times when switching out flipping tools, and yes, even on official stages. Make sure your PC's hard drive as well as memory storage are more than good enough prior- just enough might be not enough.\n\nOther than that, the game itself flows well and looks nice to clean up with the lowest quality possible. \nMaybe if the devs added a tag for player-made stages to the lines of \"Multiplayer recommended\", so normal players don't start off their experience by having to solo 100mb levels?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some things are still quite buggy (especially the recent Scooby Doo DLC- falling through the floor, windows not fitting etc.) and I'm missing some features from HF1 (no buyer feedback when flipping houses, no minimap, mowing is just terrible), but ultimately, HF2 is good fun. Can't wait to see more content!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started this out as a casual game and quickly found it addictive in the best way. I was surprised at how engaging it is, and how much fun the developer team had creating the characters and dialogue. I've completed all the main game content now and am getting through the new Scooby Doo DLC. Looking forward to more DLC down the road!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not only is this the greatest and most relaxing game of all times, but it also comes with a great community and great support team. Suggestions are always heard and sharing feedback is easy.  \nA challenging game, enhancing your creativity and pushing all the buttons.  It is incredible what you can do with a simple toaster :D \nThe co op mode has increased the fun for me. i can now share the enthusiasm with my friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much like the first House Flipper game, this is a wonderful experience that engages one's creativity, allows them to work through rewarding projects and even create spaces to their ideal preference. Since it's still in the early stages there's definitely a few more furniture and style options that could be added, and perhaps the option of angled or curved walls, but there's plenty to get started with. I definitely think it's loads better than the Sims for creating and getting a visual layout of rooms and buildings inspired from fiction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly was a little hesitant to buy this. But I'm really glad I did. I've been going through some bad times and the game is already helping me stay calm. It's great for anxiety and helps me focus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "y'all, pardon my fucking French, but i FUCK W/ THIS GODDAMN GAME SO HARD.  No game should deadass BE this fucking lit.. and yet, here we are.\nand don't even get me fucking started on the goddamn Scooby-Doo DLC. AGHH.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is way better and longer version than House Flipper 1. I enjoyed (and still enjoying cause haven't finished yet) the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun, I love playing it's very relaxing seeing the houses go from crazy dirty to clean, or ugly colored walls and floors to pretty colored walls and floors! The quests are also very easy to follow which is good because it can be confusing what you need to do. Also is co-op so you can play with friends or you can play by yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love building houses from scratch and decorating them.  Much better than the sims as you are inside the building.  Jobs are great too just wish there were more of them in the game.  I would highly recommend this game.  Well done Frozen District",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Want to build your dream home? Like messing with house layouts or interior decorating? This game allows you to do that and more! And unlike the previous game which gave you set boundaries for the exterior walls, nothing is off-limits in this game! You can build an entire home from scratch, being as meticulous or as simple as you desire, or you can relax and do the story mode jobs where the houses and design choices are already made for you. The controls are intuitive and the customize options are insane. I spend most of my time in sandbox mode building castles and the like. This game is so relaxing and is a great way to get your creative juices flowing. The fact that the game occasionally updates and adds more furniture and designs is just icing to the cake.\r\n\r\nIf I had critique anything about this game, it's that all of the NPC's you get jobs from talk in way too many emojis. I can't imagine a single person who would be so unprofessional as to litter their contracting requests with smiley faces and yet every job in this game is like that. It's a minor gripe, but it does bother me. Everything else about the game is great. I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR House Flipper 2 is a fun evolution on the original house flipper, with the introduction of co-op and the improvement of core systems adding to the original game's appeal. \r\n\r\nGameplay: Similar to the first house flipper, the core loop for the early game is to take clearly defined jobs for customers. These usually demonstrate the mechanics of the game, and provide the player with the funds needed for the late game loop. This late game consists of buying wrecked houses, and flipping them for a profit. Similar to the first game, the player has a variety of tools, some focused on cleaning, others renovation, and still more on landscaping. These have been improved from the base game, especially the demo tool, which now feels a bit less tedious. Other features have remained mostly the same, with the window-cleaning and vacuuming both changing little. Overall, it works for the game, and provides an enjoyable experience. \r\n\r\nGraphics: The look of the game has improved markedly from House Flipper 1, but still has that distinct simulation game look. The lighting is now vastly improved, as are the textures, but in a muted way. The game looks conventionally good, but doesn't have much interesting in the way of an art style or standout graphics. However, it still looks pleasant. \r\n\r\nStory: The game has a small story to work on through assigned tasks and jobs. Each job will usually contain a phone call, which will demonstrate a fragment of the story, which largely concerns the town's discontent towards a large company renovating a historically significant building. It's interesting enough, and it does lead to a nice conclusion, but overall, it's a relatively minor part of the game. \r\n\r\nBugs/Performance: Thankfully, House Flipper 2 both runs quite well, and is relatively free from bugs. At nearly 16 hours of playtime, I've encountered a bit of stuttering with the graphics maxed, and no bugs to speak of. Overall, quite well done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun to play and passes time as well! its a really cozy game to play at night.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game with great gameplay and wonderful sandbox that really encourages my imagination",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is everything I wanted Sims to be without the annoying sims part. Super relaxing, no pressure game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obsessed with this game. If you are the type of sims 4 gamer who only likes to build, this is the game for you. Cleaning up houses, repairing walls, and decorating is so satisfying. There is so much content, with the added bonus of creator content! Players make their own house jobs so that you can keep on playing after you catch up to the game's current levels. Love this game, can't recommend it enough!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if your looking for a fun relaxing game not stressful this is the game to go to very happy with game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot less jank than the first game. They really polished a lot of the game mechanics for this one. I want to see what the dlc in the future is going to add and I'm hoping they will add workshop functionality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{Gameplay}---\r\n☑️ Try not to get addicted\r\n☐ Very good\r\n☐ Good\r\n☐ Nothing special\r\n☐ Ehh\r\n☐ Bad\r\n☐ Just dont\r\n\r\n---{ Grind }---\r\n☑️ Nothing\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ Insanity\r\n\r\n---{Graphics}---\r\n☐ You forget reality\r\n☐ Masterpiece\r\n☑️ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Will do\r\n☐ Bad\r\n☐ Awful\r\n☐ Pixel art\r\n\r\n---{Audio}---\r\n☐ Eargasm\r\n☑️ Very good\r\n☐ Good\r\n☐ Decent\r\n☐ Not too bad\r\n☐ Bad\r\n☐ Earrape\r\n\r\n---{Audience}---\r\n☐ Kids\r\n☐ Teens\r\n☐ Adults\r\n☑️ Everyone\r\n\r\n---{PC Requirements}---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑️ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{Difficulity}---\r\n☐ Just press a bunch of buttons\r\n☑️ Easy\r\n☐ Significant brain usage\r\n☐ Easy to learn / Hard to master\r\n☐ Not so easy\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{Game Time}---\r\n☐ Long enough for a cup of tea\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑️ Depends on you\r\n☐ Endless\r\n\r\n---{Price}---\r\n☑️  Just buy it\r\n☐ Worth the price\r\n☐ Wait for sale\r\n☐ Maybe if you have some spare money left\r\n☐ Not recommended\r\n☐ Dont throw money into a rubbish bin\r\n\r\n---{Bugs}---\r\n☐ Never had any\r\n☑️ Minor bugs\r\n☐ Few bugs\r\n☐ Can get annoying\r\n☐ Ruining the game\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑️ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a calm and satisfying game, I like home renovation games but usually they make it so hard to earn coins for when you want to buy things for your own house, but this game doesn't do that. I have already been able to redo my whole living room and part of my kitchen and I still have coins left over. it makes playing the game so much more fun compared to other home renovation games I have played. And the background music is perfect, not too relaxing that I feel like falling asleep but the perfect vibing music.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game for whenever I'm trying to relax! It's super soothing and I don't mind leaving in the middle of a job because I can come right back to it at the exact same spot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is everything I've ever wanted in a game. Every new update is an improvement. P.S. thank you for making the Scooby-Doo DLC actually worth the money and not just giving us a couple new items.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like games where you build and decorate houses this one is great and a lot of fun. I love the level of detail you can add to buildings. I made my apartment in it. So much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even better than House Flipper 1! \nAll the little cleaning tasks and mowing the lawn are so much more efficient and no longer tedious. The jobs are enjoyable, and are slowly becoming my favorite part. I highly recommend you get the Scooby Doo DLC as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's great! It's a little evil of the game to start you in a home that has a good looking Victorian-like interior but you cant place diagonal or curved walls ;-;\nI'm down diabolically bad for diagonal and curved walls...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun but I don't think it's better than the og House Flipper. I like a couple of the new features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fund game to play especially when you are avoiding cleaning your own home.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I already enjoyed House Flipper, so I had high expectations for House Flipper 2. It's fun, there's story to it. I really enjoy that the story they make up with it is really funny and interesting making this a lot more special.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My only complaint is that I miss knowing exactly which rooms were left to finish. Floating Quest Markers don't help when the last room is a windowless closet, y'know?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The new abilities take awhile to get use to but it's certainly an upgrade from the previous House Flipper.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "If you’re thinking about buying House Flipper 2 and haven’t played the first game yet, I’d honestly recommend starting with the original. While HF2 looks nice and adds some new building tools, it’s missing a lot of the depth, content, and features that made the first game so enjoyable. The item variety is smaller, some mechanics feel stripped back, and overall it comes across as a step down rather than an upgrade.\n\nIt’s not a bad game, it’s relaxing and has potential — but if you're expecting a richer, more polished version of House Flipper 1, you’ll probably be disappointed. The original still offers the fuller experience.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "If you're new to the series and are looking for a game, GET THE FIRST ONE! As someone who has 150+ hours on the first House Flipper, I'm sorry to say I cannot recommend this game. I can appreciate that they didn't want to make it an exact replica and with that they tried to update and change core features of the first game that just aren't good. While some are a personal preference, other are just plain unenjoyable. Buying and customizing the color of furniture is just so unnecessarily complicated. Wish I could say it's worth the money but I'd unfortunately pass. Hopefully the game devs are open to feedback and making improvements!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When playing in sandbox, house data disappears when switching from Play mode (where you build the house and place objects) to Edit Property (terraforming) mode. There seems to be no reliable way to go between Play and Edit Property without messing up your save. I even tried the community-suggested methods like using the force-save-as command in the console, but it didn't help. Save/load functionality should be the most bulletproof part of your codebase, especially in a game like this. I wish the developer would focus more on bugfixes and less on promoting Scooby Doo.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is such a disappointment. I really loved the first one, but this one feels wrong. it just feels generic and boring, on top of having motion sickening movement (but that's a me issue i guess) meanwhile the first game felt original, great, and perfect (until the broke performance but it's still the better one). Came back to this game multiple times, and can't get into it, would rather play the first one anyday.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I personally enjoy House Flipper 1 much more than the second game. The first game simply offered a richer and more complete experience overall. It had a wider variety of houses to flip, more furniture and style options, and a lot more DLC content to explore. The gardening aspect in House Flipper 1 was also much better, with more plants, tools, and customization options that made creating outdoor spaces just as fun as decorating the interiors. The mechanics in the original game felt smoother and more natural, especially the rooming system that allowed me to create and define specific rooms. That feature gave me full control over the design and made every project feel unique and personal.\r\n\r\nIn House Flipper 2, I really dislike how the assembly mechanic was separated into its own game mode instead of being integrated into regular gameplay. It breaks immersion and takes away from the flow of renovating houses. However, one thing House Flipper 2 does better is the addition of co-op mode, which allows me to play with my wife. Working together on projects is a lot of fun, even if the rest of the game feels like a step backward compared to the first one.\r\n\r\nFor now I will not be recommending this game, but maybe things will change in the future.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is nothing like House Flipper (1), there's zero similarity. It's buggy, complicated and poorly made. It's sad because instead of updating a great base game, they went for the money grab. Believe me, if you liked House flipper (1), you won't like this guaranteed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am using an AMD Radeon RX 7900 XT, an AMD Ryzen 5 5600X 6-Core Processor, and 32 GB of RAM\n\nYet, the game runs like absolute shit on the lowest settings, even the lowest Dynamic Resolution possible\n\nThis is completely insane",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sure u could call it a decent second game with all the QoL updates it got, but is pretty much soulles and wayyy more limited especially in terms of furnitures etc. Has a looong loong way to go",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is extremely buggy and has flashing during multiplayer that can trigger epilepsy during the game summary. Had to stop playing entirely because I was feeling sick.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disgusting developers.\nThey release a game, but block DLC for Russian users. It's disgusting. Games are not about politics, and restricting a large portion of players based on their country of birth and their lack of responsibility for their government is like shooting yourself in the knee and hitting yourself in the head with a hammer. I am disappointed.\nWhat was the point of leaving Russian users access to purchase the game if you blocked them from purchasing DLCs???\nIt's a shame that I can't get my money back now. If I had known that the developers would do something so disgusting, I wouldn't have accepted the game as a gift.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0 STAR! Literal garbage. I loved the first one but this one is just an extreme let down. This isn't a sequel\n this is a whole different game.Plays like slop. looks like slop and just feels too cartoony. they abandoned the identity that got them sought after in the first place",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0 star i was going to play until it said it cant be shared and i need to a wait a month and 25 or 31 days",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am using an AMD Radeon RX 7900 XT, an AMD Ryzen 5 5600X 6-Core Processor, and 32 GB of RAM\n\nYet, the game runs like absolute shit on the lowest settings, even the lowest Dynamic Resolution possible\n\nThis is completely insane",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "first game is better, this just feels like slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "everytime we play it kicks us out on coop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS DOOKIE SQUAD DONT PLAY EXCEPT IF UR A GIRL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm gonna be brutally honest here, the game is just a downgraded version of the first. I'm severely disappointed with how money hungry this company has become. House Flipper 2 might as well be considered a remaster since the graphics are a little better than original house flipper and they're introducing the exact same DLCs into it that were in house flipper to begin with despite that though this company has decided to also create a remaster of House Flipper that is acting as a separate game when House Flipper isn't even that old to begin with to warrant one. In today's economy it's actions like this that ruin companies, there is no need to release 3 games about the exact same thing continuously with minor improvements or new features that easily could've just been added in.\n\nTLDR: This company just wants your money, it doesn't care about the game it's releasing just the profits that can be made from it. DO BETTER",
      "voted_up": false,
      "votes_helpful": 245
    },
    {
      "review": "Even though it has been out for a while now, the controls are not as smooth as the first game. The overall game mechanics are clunky and difficult to use. It is slightly less intuitive than the original. The amount of time it takes me just to find what I want in the store is off-putting and I find myself not bothering on any form of customization because of this. I can't spend more than 20 minutes at a time in game without getting frustrated.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "If you’re thinking about buying House Flipper 2 and haven’t played the first game yet, I’d honestly recommend starting with the original. While HF2 looks nice and adds some new building tools, it’s missing a lot of the depth, content, and features that made the first game so enjoyable. The item variety is smaller, some mechanics feel stripped back, and overall it comes across as a step down rather than an upgrade.\n\nIt’s not a bad game, it’s relaxing and has potential — but if you're expecting a richer, more polished version of House Flipper 1, you’ll probably be disappointed. The original still offers the fuller experience.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "This is so sad. I loved the first game. I wanted to love this game and I did at first. Now that the game is out of early access, the price tag is $40 and they put ADS in the game. It's so gross. I'm never touching this game again.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Pretty lazily made sequel. All the houses are on the same lot for some reason and even some items, from a very small pool of items, are a copy paste job straight from House Flipper. Doesn't come close to the greatness of the original.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "The game itself is good, but Devs are not, thus im giving negative to motivate them.\n\nHouse Flipper 2 is basically HF1 Remastered... but issue is.... THE DEVS ARE LITERALLY IN PROCESS OF MAKING HOUSE FLIPPER REMASTER!\n\nAt this point Frozen District are following Call of Duty strategy. DONT support them",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I used to love this game at first, but every single iteration they kept updating it has just gotten less and less optimized now I can’t even start up the game. It just crashes every single time.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Honestly I played the first game and I somehow racked up 193 hours on it and I was super excited for this game to come out. When I first launched it it seemed promising but when you really start playing it it kind of gives the vibe of a children's game. The colours are vibrant, there is too many help tools, random pop ups all the time and just kind of bland and boring. Really don't recommend it if you're not into that kind of vibe.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game has advertisement in the pause menu, with no option to hide them. Pressing Y on the controller immediately opens the ad.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "If you're new to the series and are looking for a game, GET THE FIRST ONE! As someone who has 150+ hours on the first House Flipper, I'm sorry to say I cannot recommend this game. I can appreciate that they didn't want to make it an exact replica and with that they tried to update and change core features of the first game that just aren't good. While some are a personal preference, other are just plain unenjoyable. Buying and customizing the color of furniture is just so unnecessarily complicated. Wish I could say it's worth the money but I'd unfortunately pass. Hopefully the game devs are open to feedback and making improvements!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ok look I really enjoy this game, very fun very relaxing great expansion on the original. But OH MY GOD it constantly crashed and no matter what settings I try, if I make sure that nothing is running on the background, all the different Proton versions, it crashes at a random moment. This mainly happens when loading a new area. I don't know what I can do to fix this. Please Frozen District fix this bug I'm begging I really wanna play your game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to give this game a good review so badly, as the first HF was a favorite of mine for a long time, and I was extremely excited for the second. Unfortunately, so far it seems all of the fears I had came true. The game doesn't feel complete, there's far less variety in the way of actual furniture or decor. Most of the features beloved from the first are only now being added in. It also seems as though it is going to have all the same DLCs, and likely more. \nI'm, personally, against the EA-style of putting out the same game, without making sure the add-ons from the previous version are in the base version. I do not want to have to buy another Halloween pack, a farming pack, a pet pack, a gardening pack, a luxury items pack, and so on. I already did with the previous game. I would absolutely jump at *actual* new DLCs, but knowing it's most likely going the route of \"it's the same game but with better graphics so you have to buy every single thing all over again\" makes me weary. As of right now, I can't recommend it over the first. Better visuals just isn't worth it to me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When playing in sandbox, house data disappears when switching from Play mode (where you build the house and place objects) to Edit Property (terraforming) mode. There seems to be no reliable way to go between Play and Edit Property without messing up your save. I even tried the community-suggested methods like using the force-save-as command in the console, but it didn't help. Save/load functionality should be the most bulletproof part of your codebase, especially in a game like this. I wish the developer would focus more on bugfixes and less on promoting Scooby Doo.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is such a disappointment. I really loved the first one, but this one feels wrong. it just feels generic and boring, on top of having motion sickening movement (but that's a me issue i guess) meanwhile the first game felt original, great, and perfect (until the broke performance but it's still the better one). Came back to this game multiple times, and can't get into it, would rather play the first one anyday.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I personally enjoy House Flipper 1 much more than the second game. The first game simply offered a richer and more complete experience overall. It had a wider variety of houses to flip, more furniture and style options, and a lot more DLC content to explore. The gardening aspect in House Flipper 1 was also much better, with more plants, tools, and customization options that made creating outdoor spaces just as fun as decorating the interiors. The mechanics in the original game felt smoother and more natural, especially the rooming system that allowed me to create and define specific rooms. That feature gave me full control over the design and made every project feel unique and personal.\r\n\r\nIn House Flipper 2, I really dislike how the assembly mechanic was separated into its own game mode instead of being integrated into regular gameplay. It breaks immersion and takes away from the flow of renovating houses. However, one thing House Flipper 2 does better is the addition of co-op mode, which allows me to play with my wife. Working together on projects is a lot of fun, even if the rest of the game feels like a step backward compared to the first one.\r\n\r\nFor now I will not be recommending this game, but maybe things will change in the future.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wanted to play with friends, can’t play with friends, simple as that. Stuck on loading screen every damn time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love this game and looking forward to future updates and DLC. I have over 100 hours in the first game, so I really like this sequel.\nHOWEVER. When buying and selling houses, theres no before and after pictures...i dont know if its due to a glitch or an issue with the game, because I have watched tutorials and they all show a little slideshow after they sell a house. but i dont get them and it makes me really sad. I pour HOURS into some of these houses and i dont even get the satisfaction of looking at the before and afters. If anyone knows how to fix this issue PLEASE let me know because i dont even want to buy or sell houses anymore. will change my rating when this is resolved.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you're going to get it, get it on sale. It crashes frequently, despite the fact that I keep all the graphics settings on low. Overall it's...fine? It's definitely not any major improvement over the first game, and I actually find many of the mechanics of this one more frustrating than the first one. It scratches that itch of checking off little tasks and redecorating, so if you've done everything there is to do in the first one, just wait to get this when it's on sale. If you haven't played the first one, just go play that.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i really wanted to like this game as i loved the original, and the prospect of coop interested me, but it just feels so much more corporate than the original. i would never call a game \"woke\" because im not an idiot but the entire game feels like the \"solo polyamorous hijabi amputee\" meme for some reason???? it just feels tacky and like those corporate memphis ads. also every building in the game looks like it's from hello neighbor with it's color scheme. idk im gonna refund i just wanted to say how disappointed i am because i was really excited to play this with my girlfriend thinking it would be like the original with better graphics.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "the game would be good if you changed how you build A house like how its done in HF1 but i find its stupid you carnt scale it that great i mean you build 1 side of house but you carnt see where the wall ends on the other side for it to matche up, you end up quitting the game as you start to get peed off with it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Kinda boring tbh, i spent half an hour finding one piece of trash, only recommend if you enjoy games like this but if you've never played a game like this I wouldn't really recommend it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is nothing like House Flipper (1), there's zero similarity. It's buggy, complicated and poorly made. It's sad because instead of updating a great base game, they went for the money grab. Believe me, if you liked House flipper (1), you won't like this guaranteed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "here we go with the dlc spam... should of seen this coming. hf2 has way less content base game compared to hf1 base game, and yet they are gonna go full swing pushing dlc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sure u could call it a decent second game with all the QoL updates it got, but is pretty much soulles and wayyy more limited especially in terms of furnitures etc. Has a looong loong way to go",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is extremely buggy and has flashing during multiplayer that can trigger epilepsy during the game summary. Had to stop playing entirely because I was feeling sick.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disgusting developers.\nThey release a game, but block DLC for Russian users. It's disgusting. Games are not about politics, and restricting a large portion of players based on their country of birth and their lack of responsibility for their government is like shooting yourself in the knee and hitting yourself in the head with a hammer. I am disappointed.\nWhat was the point of leaving Russian users access to purchase the game if you blocked them from purchasing DLCs???\nIt's a shame that I can't get my money back now. If I had known that the developers would do something so disgusting, I wouldn't have accepted the game as a gift.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0 STAR! Literal garbage. I loved the first one but this one is just an extreme let down. This isn't a sequel\n this is a whole different game.Plays like slop. looks like slop and just feels too cartoony. they abandoned the identity that got them sought after in the first place",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0 star i was going to play until it said it cant be shared and i need to a wait a month and 25 or 31 days",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am using an AMD Radeon RX 7900 XT, an AMD Ryzen 5 5600X 6-Core Processor, and 32 GB of RAM\n\nYet, the game runs like absolute shit on the lowest settings, even the lowest Dynamic Resolution possible\n\nThis is completely insane",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "first game is better, this just feels like slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "everytime we play it kicks us out on coop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS DOOKIE SQUAD DONT PLAY EXCEPT IF UR A GIRL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm gonna be brutally honest here, the game is just a downgraded version of the first. I'm severely disappointed with how money hungry this company has become. House Flipper 2 might as well be considered a remaster since the graphics are a little better than original house flipper and they're introducing the exact same DLCs into it that were in house flipper to begin with despite that though this company has decided to also create a remaster of House Flipper that is acting as a separate game when House Flipper isn't even that old to begin with to warrant one. In today's economy it's actions like this that ruin companies, there is no need to release 3 games about the exact same thing continuously with minor improvements or new features that easily could've just been added in.\n\nTLDR: This company just wants your money, it doesn't care about the game it's releasing just the profits that can be made from it. DO BETTER",
      "voted_up": false,
      "votes_helpful": 245
    },
    {
      "review": "Even though it has been out for a while now, the controls are not as smooth as the first game. The overall game mechanics are clunky and difficult to use. It is slightly less intuitive than the original. The amount of time it takes me just to find what I want in the store is off-putting and I find myself not bothering on any form of customization because of this. I can't spend more than 20 minutes at a time in game without getting frustrated.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "If you’re thinking about buying House Flipper 2 and haven’t played the first game yet, I’d honestly recommend starting with the original. While HF2 looks nice and adds some new building tools, it’s missing a lot of the depth, content, and features that made the first game so enjoyable. The item variety is smaller, some mechanics feel stripped back, and overall it comes across as a step down rather than an upgrade.\n\nIt’s not a bad game, it’s relaxing and has potential — but if you're expecting a richer, more polished version of House Flipper 1, you’ll probably be disappointed. The original still offers the fuller experience.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "This is so sad. I loved the first game. I wanted to love this game and I did at first. Now that the game is out of early access, the price tag is $40 and they put ADS in the game. It's so gross. I'm never touching this game again.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Pretty lazily made sequel. All the houses are on the same lot for some reason and even some items, from a very small pool of items, are a copy paste job straight from House Flipper. Doesn't come close to the greatness of the original.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "The game itself is good, but Devs are not, thus im giving negative to motivate them.\n\nHouse Flipper 2 is basically HF1 Remastered... but issue is.... THE DEVS ARE LITERALLY IN PROCESS OF MAKING HOUSE FLIPPER REMASTER!\n\nAt this point Frozen District are following Call of Duty strategy. DONT support them",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I used to love this game at first, but every single iteration they kept updating it has just gotten less and less optimized now I can’t even start up the game. It just crashes every single time.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Honestly I played the first game and I somehow racked up 193 hours on it and I was super excited for this game to come out. When I first launched it it seemed promising but when you really start playing it it kind of gives the vibe of a children's game. The colours are vibrant, there is too many help tools, random pop ups all the time and just kind of bland and boring. Really don't recommend it if you're not into that kind of vibe.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game has advertisement in the pause menu, with no option to hide them. Pressing Y on the controller immediately opens the ad.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "If you're new to the series and are looking for a game, GET THE FIRST ONE! As someone who has 150+ hours on the first House Flipper, I'm sorry to say I cannot recommend this game. I can appreciate that they didn't want to make it an exact replica and with that they tried to update and change core features of the first game that just aren't good. While some are a personal preference, other are just plain unenjoyable. Buying and customizing the color of furniture is just so unnecessarily complicated. Wish I could say it's worth the money but I'd unfortunately pass. Hopefully the game devs are open to feedback and making improvements!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ok look I really enjoy this game, very fun very relaxing great expansion on the original. But OH MY GOD it constantly crashed and no matter what settings I try, if I make sure that nothing is running on the background, all the different Proton versions, it crashes at a random moment. This mainly happens when loading a new area. I don't know what I can do to fix this. Please Frozen District fix this bug I'm begging I really wanna play your game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to give this game a good review so badly, as the first HF was a favorite of mine for a long time, and I was extremely excited for the second. Unfortunately, so far it seems all of the fears I had came true. The game doesn't feel complete, there's far less variety in the way of actual furniture or decor. Most of the features beloved from the first are only now being added in. It also seems as though it is going to have all the same DLCs, and likely more. \nI'm, personally, against the EA-style of putting out the same game, without making sure the add-ons from the previous version are in the base version. I do not want to have to buy another Halloween pack, a farming pack, a pet pack, a gardening pack, a luxury items pack, and so on. I already did with the previous game. I would absolutely jump at *actual* new DLCs, but knowing it's most likely going the route of \"it's the same game but with better graphics so you have to buy every single thing all over again\" makes me weary. As of right now, I can't recommend it over the first. Better visuals just isn't worth it to me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When playing in sandbox, house data disappears when switching from Play mode (where you build the house and place objects) to Edit Property (terraforming) mode. There seems to be no reliable way to go between Play and Edit Property without messing up your save. I even tried the community-suggested methods like using the force-save-as command in the console, but it didn't help. Save/load functionality should be the most bulletproof part of your codebase, especially in a game like this. I wish the developer would focus more on bugfixes and less on promoting Scooby Doo.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is such a disappointment. I really loved the first one, but this one feels wrong. it just feels generic and boring, on top of having motion sickening movement (but that's a me issue i guess) meanwhile the first game felt original, great, and perfect (until the broke performance but it's still the better one). Came back to this game multiple times, and can't get into it, would rather play the first one anyday.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I personally enjoy House Flipper 1 much more than the second game. The first game simply offered a richer and more complete experience overall. It had a wider variety of houses to flip, more furniture and style options, and a lot more DLC content to explore. The gardening aspect in House Flipper 1 was also much better, with more plants, tools, and customization options that made creating outdoor spaces just as fun as decorating the interiors. The mechanics in the original game felt smoother and more natural, especially the rooming system that allowed me to create and define specific rooms. That feature gave me full control over the design and made every project feel unique and personal.\r\n\r\nIn House Flipper 2, I really dislike how the assembly mechanic was separated into its own game mode instead of being integrated into regular gameplay. It breaks immersion and takes away from the flow of renovating houses. However, one thing House Flipper 2 does better is the addition of co-op mode, which allows me to play with my wife. Working together on projects is a lot of fun, even if the rest of the game feels like a step backward compared to the first one.\r\n\r\nFor now I will not be recommending this game, but maybe things will change in the future.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wanted to play with friends, can’t play with friends, simple as that. Stuck on loading screen every damn time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love this game and looking forward to future updates and DLC. I have over 100 hours in the first game, so I really like this sequel.\nHOWEVER. When buying and selling houses, theres no before and after pictures...i dont know if its due to a glitch or an issue with the game, because I have watched tutorials and they all show a little slideshow after they sell a house. but i dont get them and it makes me really sad. I pour HOURS into some of these houses and i dont even get the satisfaction of looking at the before and afters. If anyone knows how to fix this issue PLEASE let me know because i dont even want to buy or sell houses anymore. will change my rating when this is resolved.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you're going to get it, get it on sale. It crashes frequently, despite the fact that I keep all the graphics settings on low. Overall it's...fine? It's definitely not any major improvement over the first game, and I actually find many of the mechanics of this one more frustrating than the first one. It scratches that itch of checking off little tasks and redecorating, so if you've done everything there is to do in the first one, just wait to get this when it's on sale. If you haven't played the first one, just go play that.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i really wanted to like this game as i loved the original, and the prospect of coop interested me, but it just feels so much more corporate than the original. i would never call a game \"woke\" because im not an idiot but the entire game feels like the \"solo polyamorous hijabi amputee\" meme for some reason???? it just feels tacky and like those corporate memphis ads. also every building in the game looks like it's from hello neighbor with it's color scheme. idk im gonna refund i just wanted to say how disappointed i am because i was really excited to play this with my girlfriend thinking it would be like the original with better graphics.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "the game would be good if you changed how you build A house like how its done in HF1 but i find its stupid you carnt scale it that great i mean you build 1 side of house but you carnt see where the wall ends on the other side for it to matche up, you end up quitting the game as you start to get peed off with it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Kinda boring tbh, i spent half an hour finding one piece of trash, only recommend if you enjoy games like this but if you've never played a game like this I wouldn't really recommend it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is nothing like House Flipper (1), there's zero similarity. It's buggy, complicated and poorly made. It's sad because instead of updating a great base game, they went for the money grab. Believe me, if you liked House flipper (1), you won't like this guaranteed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "here we go with the dlc spam... should of seen this coming. hf2 has way less content base game compared to hf1 base game, and yet they are gonna go full swing pushing dlc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sure u could call it a decent second game with all the QoL updates it got, but is pretty much soulles and wayyy more limited especially in terms of furnitures etc. Has a looong loong way to go",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is extremely buggy and has flashing during multiplayer that can trigger epilepsy during the game summary. Had to stop playing entirely because I was feeling sick.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disgusting developers.\nThey release a game, but block DLC for Russian users. It's disgusting. Games are not about politics, and restricting a large portion of players based on their country of birth and their lack of responsibility for their government is like shooting yourself in the knee and hitting yourself in the head with a hammer. I am disappointed.\nWhat was the point of leaving Russian users access to purchase the game if you blocked them from purchasing DLCs???\nIt's a shame that I can't get my money back now. If I had known that the developers would do something so disgusting, I wouldn't have accepted the game as a gift.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0 STAR! Literal garbage. I loved the first one but this one is just an extreme let down. This isn't a sequel\n this is a whole different game.Plays like slop. looks like slop and just feels too cartoony. they abandoned the identity that got them sought after in the first place",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0 star i was going to play until it said it cant be shared and i need to a wait a month and 25 or 31 days",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am using an AMD Radeon RX 7900 XT, an AMD Ryzen 5 5600X 6-Core Processor, and 32 GB of RAM\n\nYet, the game runs like absolute shit on the lowest settings, even the lowest Dynamic Resolution possible\n\nThis is completely insane",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "first game is better, this just feels like slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "everytime we play it kicks us out on coop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS DOOKIE SQUAD DONT PLAY EXCEPT IF UR A GIRL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm gonna be brutally honest here, the game is just a downgraded version of the first. I'm severely disappointed with how money hungry this company has become. House Flipper 2 might as well be considered a remaster since the graphics are a little better than original house flipper and they're introducing the exact same DLCs into it that were in house flipper to begin with despite that though this company has decided to also create a remaster of House Flipper that is acting as a separate game when House Flipper isn't even that old to begin with to warrant one. In today's economy it's actions like this that ruin companies, there is no need to release 3 games about the exact same thing continuously with minor improvements or new features that easily could've just been added in.\n\nTLDR: This company just wants your money, it doesn't care about the game it's releasing just the profits that can be made from it. DO BETTER",
      "voted_up": false,
      "votes_helpful": 245
    },
    {
      "review": "Even though it has been out for a while now, the controls are not as smooth as the first game. The overall game mechanics are clunky and difficult to use. It is slightly less intuitive than the original. The amount of time it takes me just to find what I want in the store is off-putting and I find myself not bothering on any form of customization because of this. I can't spend more than 20 minutes at a time in game without getting frustrated.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "If you’re thinking about buying House Flipper 2 and haven’t played the first game yet, I’d honestly recommend starting with the original. While HF2 looks nice and adds some new building tools, it’s missing a lot of the depth, content, and features that made the first game so enjoyable. The item variety is smaller, some mechanics feel stripped back, and overall it comes across as a step down rather than an upgrade.\n\nIt’s not a bad game, it’s relaxing and has potential — but if you're expecting a richer, more polished version of House Flipper 1, you’ll probably be disappointed. The original still offers the fuller experience.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "This is so sad. I loved the first game. I wanted to love this game and I did at first. Now that the game is out of early access, the price tag is $40 and they put ADS in the game. It's so gross. I'm never touching this game again.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Pretty lazily made sequel. All the houses are on the same lot for some reason and even some items, from a very small pool of items, are a copy paste job straight from House Flipper. Doesn't come close to the greatness of the original.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "The game itself is good, but Devs are not, thus im giving negative to motivate them.\n\nHouse Flipper 2 is basically HF1 Remastered... but issue is.... THE DEVS ARE LITERALLY IN PROCESS OF MAKING HOUSE FLIPPER REMASTER!\n\nAt this point Frozen District are following Call of Duty strategy. DONT support them",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I used to love this game at first, but every single iteration they kept updating it has just gotten less and less optimized now I can’t even start up the game. It just crashes every single time.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Honestly I played the first game and I somehow racked up 193 hours on it and I was super excited for this game to come out. When I first launched it it seemed promising but when you really start playing it it kind of gives the vibe of a children's game. The colours are vibrant, there is too many help tools, random pop ups all the time and just kind of bland and boring. Really don't recommend it if you're not into that kind of vibe.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game has advertisement in the pause menu, with no option to hide them. Pressing Y on the controller immediately opens the ad.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "If you're new to the series and are looking for a game, GET THE FIRST ONE! As someone who has 150+ hours on the first House Flipper, I'm sorry to say I cannot recommend this game. I can appreciate that they didn't want to make it an exact replica and with that they tried to update and change core features of the first game that just aren't good. While some are a personal preference, other are just plain unenjoyable. Buying and customizing the color of furniture is just so unnecessarily complicated. Wish I could say it's worth the money but I'd unfortunately pass. Hopefully the game devs are open to feedback and making improvements!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ok look I really enjoy this game, very fun very relaxing great expansion on the original. But OH MY GOD it constantly crashed and no matter what settings I try, if I make sure that nothing is running on the background, all the different Proton versions, it crashes at a random moment. This mainly happens when loading a new area. I don't know what I can do to fix this. Please Frozen District fix this bug I'm begging I really wanna play your game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to give this game a good review so badly, as the first HF was a favorite of mine for a long time, and I was extremely excited for the second. Unfortunately, so far it seems all of the fears I had came true. The game doesn't feel complete, there's far less variety in the way of actual furniture or decor. Most of the features beloved from the first are only now being added in. It also seems as though it is going to have all the same DLCs, and likely more. \nI'm, personally, against the EA-style of putting out the same game, without making sure the add-ons from the previous version are in the base version. I do not want to have to buy another Halloween pack, a farming pack, a pet pack, a gardening pack, a luxury items pack, and so on. I already did with the previous game. I would absolutely jump at *actual* new DLCs, but knowing it's most likely going the route of \"it's the same game but with better graphics so you have to buy every single thing all over again\" makes me weary. As of right now, I can't recommend it over the first. Better visuals just isn't worth it to me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When playing in sandbox, house data disappears when switching from Play mode (where you build the house and place objects) to Edit Property (terraforming) mode. There seems to be no reliable way to go between Play and Edit Property without messing up your save. I even tried the community-suggested methods like using the force-save-as command in the console, but it didn't help. Save/load functionality should be the most bulletproof part of your codebase, especially in a game like this. I wish the developer would focus more on bugfixes and less on promoting Scooby Doo.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is such a disappointment. I really loved the first one, but this one feels wrong. it just feels generic and boring, on top of having motion sickening movement (but that's a me issue i guess) meanwhile the first game felt original, great, and perfect (until the broke performance but it's still the better one). Came back to this game multiple times, and can't get into it, would rather play the first one anyday.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I personally enjoy House Flipper 1 much more than the second game. The first game simply offered a richer and more complete experience overall. It had a wider variety of houses to flip, more furniture and style options, and a lot more DLC content to explore. The gardening aspect in House Flipper 1 was also much better, with more plants, tools, and customization options that made creating outdoor spaces just as fun as decorating the interiors. The mechanics in the original game felt smoother and more natural, especially the rooming system that allowed me to create and define specific rooms. That feature gave me full control over the design and made every project feel unique and personal.\r\n\r\nIn House Flipper 2, I really dislike how the assembly mechanic was separated into its own game mode instead of being integrated into regular gameplay. It breaks immersion and takes away from the flow of renovating houses. However, one thing House Flipper 2 does better is the addition of co-op mode, which allows me to play with my wife. Working together on projects is a lot of fun, even if the rest of the game feels like a step backward compared to the first one.\r\n\r\nFor now I will not be recommending this game, but maybe things will change in the future.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wanted to play with friends, can’t play with friends, simple as that. Stuck on loading screen every damn time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love this game and looking forward to future updates and DLC. I have over 100 hours in the first game, so I really like this sequel.\nHOWEVER. When buying and selling houses, theres no before and after pictures...i dont know if its due to a glitch or an issue with the game, because I have watched tutorials and they all show a little slideshow after they sell a house. but i dont get them and it makes me really sad. I pour HOURS into some of these houses and i dont even get the satisfaction of looking at the before and afters. If anyone knows how to fix this issue PLEASE let me know because i dont even want to buy or sell houses anymore. will change my rating when this is resolved.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}