{
  "positive": [
    {
      "review": "⏱️ Hours Played:~42\r\n🎫 Battle Pass Level: 16\r\n🧬 Account Level: 12\r\n\r\n ✔️ Positive\r\n\r\n✔️ Fun superhero abilities and enjoyable combat\r\n✔️ Fast-paced, competitive matches\r\n✔️ Battle Pass is paid, but thanks to strong rewards you can unlock it by day 5–6 for **300💎** without spending real money\r\n✔️ Good 7-day login rewards\r\n✔️ Incredible map design — every district is unique, detailed and alive\r\n✔️ Crafting becomes enjoyable once you learn materials\r\n✔️ Quick matchmaking thanks to mix of players and bots\r\n ➖ Mixed\r\n\r\n➖ Tons of upgrades can feel overwhelming at first\r\n➖ Progression slows down very early\r\n➖ **ONLY Solo and Duo modes — NO Trios, NO 4-man squads!!!**\r\n  – Big limitation for friends who want to play together\r\n\r\n❌ Negative\r\n\r\n❌ Leveling is extremely slow even at low levels\r\n  – ~10 matches per level after lvl 10\r\n  – Ranked unlocks at lvl 20, but the game pushes 💎 level skips → feels pay-to-rush\r\n\r\n❌ Battle Pass XP is overtuned\r\n  – 42 hours played → only BP lvl 16\r\n\r\n❌ Shield hero is unbalanced\r\n  – Jump-spam, slide knockbacks, camping\r\n  – Unfair endgame 1v1 fights\r\n\r\n❌ Teaming happens in final circles with no proper reporting\r\n❌ Weak BP rewards after lvl 60 (mostly basic clothing)\r\n\r\n🎯 Overall\r\n\r\nSuperhuman has huge potential with amazing map design and fun hero combat, but slow progression, limited party modes, and balance issues hold it back. Needs polishing, but still enjoyable.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Game runs great, plays great and feels great but it seems dead to me as servers are filled with bots and didn't encounter a single real player!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game gives me an anerusim, the graphics of a patato and still lags my pc. the combat is even more annoying because right close apparently doesnt scope in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i enjoyed every second of this game through out the years going up and down. This game deserves it. But sadly we live in an era where marketing and it's where we lost boys. Feeling so bad hope someday this game gets what its deserves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last time I played this game. It was unbalanced. They did too much damage. It doesn't matter what type of army you had on. You can have the best top tier armor you can get. All it takes is a couple shots in your back and your dad. I hope they fix that. OK. That's reason why I stopped playing since 2024.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Super People brings a fresh twist to the battle royale genre with unique class abilities and fast-paced action. The graphics are impressive, gunplay feels smooth, and the class system adds depth. However, balance issues and optimization problems hold it back a bit. Overall, it’s an exciting and promising game for players who love tactical shooting with a touch of superpowers.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game and hope there is some more players finding this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very similar to pubg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "дифыпифо9хпфшгпиыоифпиышпдггфцрапшфгцуиазфщраИПАШЫФУ РЩШАРЗшагпврауоыаоцукенгшщзхдыовипжфшлпловиж",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am an old player of the game, and according to your announcement, old players were not supposed to make a purchase. However, I was still required to buy the package in order to continue. After completing the purchase, I did not receive any diamonds in my account.",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "⏱️ Hours Played:~42\r\n🎫 Battle Pass Level: 16\r\n🧬 Account Level: 12\r\n\r\n ✔️ Positive\r\n\r\n✔️ Fun superhero abilities and enjoyable combat\r\n✔️ Fast-paced, competitive matches\r\n✔️ Battle Pass is paid, but thanks to strong rewards you can unlock it by day 5–6 for **300💎** without spending real money\r\n✔️ Good 7-day login rewards\r\n✔️ Incredible map design — every district is unique, detailed and alive\r\n✔️ Crafting becomes enjoyable once you learn materials\r\n✔️ Quick matchmaking thanks to mix of players and bots\r\n ➖ Mixed\r\n\r\n➖ Tons of upgrades can feel overwhelming at first\r\n➖ Progression slows down very early\r\n➖ **ONLY Solo and Duo modes — NO Trios, NO 4-man squads!!!**\r\n  – Big limitation for friends who want to play together\r\n\r\n❌ Negative\r\n\r\n❌ Leveling is extremely slow even at low levels\r\n  – ~10 matches per level after lvl 10\r\n  – Ranked unlocks at lvl 20, but the game pushes 💎 level skips → feels pay-to-rush\r\n\r\n❌ Battle Pass XP is overtuned\r\n  – 42 hours played → only BP lvl 16\r\n\r\n❌ Shield hero is unbalanced\r\n  – Jump-spam, slide knockbacks, camping\r\n  – Unfair endgame 1v1 fights\r\n\r\n❌ Teaming happens in final circles with no proper reporting\r\n❌ Weak BP rewards after lvl 60 (mostly basic clothing)\r\n\r\n🎯 Overall\r\n\r\nSuperhuman has huge potential with amazing map design and fun hero combat, but slow progression, limited party modes, and balance issues hold it back. Needs polishing, but still enjoyable.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Spiritual successor to PUBG, everything you like about that game but just better.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "this game is supposedly free for returning users but i only get an option to buy smh",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is my first ever game review after being on steam for 10+ years. Hopefully that carries some weight to what I say.\r\n\r\nLobbies are small, but that's just because people haven't figured out how fun this game actually is. The best BR out there. I hope more people are willing to try the game so the player base can grow. I personally do not have an issue with the smaller lobbies. I played when lobbies were full at 60 players as well as when lobbies were no more than 3 people. Both situations are fun, just different vibes. Less people means for free looting in the early mid game and usually leads to more explosive final circles with 2-3 max geared players duking it out. I think its very fun.\r\n\r\nIMO the game is worth $15, but for the vast majority of people this will probably prevent them from trying the game which is super unfortunate because this is actually a very, very fun BR.\r\n\r\nI received the game for free since I have been playing in every beta / early access that has been released, but I think the game is so worth it I willingly buy it for my friends so they can try it too and help grow the player base.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "best battle royale game ever created, and to see its return delights me",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Short version:\nincredible game i love it. Yes it has issues and this and that but the devs compared to last time actually listen this time.\n\nLong version:\nas stated the game has ups and downs but the devs ACTUALLY listen this time sure no one asked for PvE or zombies, they tried it and removed it fair enough. Would love to see Duo's and for people who play it TPP although i only play FPP, but the current problem is the player count, now with the f2p announcement hopefully more are to come.\nWonder people can't just push 4 different modes (solos - duo - trios - squads) or 3 of them for the sake of it there will not be enough people for each lobby.\nthe game in general is a lovely game with some flaws that hopefully will be fixed soon but i will recommend the living shite out of it. the game is unique with the Battle royale mode - crafting - and having characters with abilities, i have not loved or enjoyed a game this much since LoL season 3.\nI have faith and believe in Wonder people with a little patience it will be playable for everyone.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Have been waiting for this for so LONG!! Great game with the friends and a great twist to battle royale.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "fun game died before has its issues hope they fix feels like they have but who knows how people feel about it giving it a thumbs up because i do like the game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Game runs great, plays great and feels great but it seems dead to me as servers are filled with bots and didn't encounter a single real player!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game with lots of potential\nReally fun to play, but has some bugs and sometimes a lack of players in the evenings\nHopefully these issues will be fixed soon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve spent quite a few hours playing through all the stages this game has had, and I can honestly say I had a blast — and I’ll keep playing. Since the early access release, I haven’t run into any cheaters, found only a few minor bugs, and the gameplay feels smooth. The only thing I don’t understand is why there aren’t more players. The game can feel a bit boring if you don’t have friends to play with, but that’s what the Discord server is for. All things considered, I’d give this game a solid 9/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love this game so much! I honestly want it to succeed. This game has me playing it nonstop. All I want to do is get into another game. I definitely recommend this to anyone who wants a fun battle royale. It’s a perfect mix of fun and sweaty. The in game shop is a great feature! It helps people who didn’t have good RNG not get completely wiped by a team in full legendary gear. I hope more people find this game and enjoy it. Totally worth the 15 dollars!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I’ll keep this simple - it’s a good game, and very fun; though there are a bunch of issues. \nThe does enjoyment outweigh issues!\n\nTPP DUOS and OCE Servers ASAP pls",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "SP1 was great, random weapon bonuses give you a reason to use different loadouts and not spam the same class+same weapon everytime, which gives that extra edge in replayability",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "So close, but how are the owners so ignorant?  As it stands now, this isn't the Super People we fell in love with.  The DID finally remove the zombies after intense backlash.  But instead of giving the people what they've been requesting for YEARS, they just can't get out of their own way.  When the good (OG) Super People closed, they apologized and said they couldn't keep it open because it wasn't financially viable (fair).  So instead of trying again with the popular version, they keep giving us not what was asked for.  You literally had a golden goose, but because you couldn't figure out how to feed it, it died.  Now that you're trying again, you're just using a regular goose.  I know they're never going to read this review, but seriously, look at how many reviews over the years are literally shouting at you to return the game to a specific version.  Stop trying to reinvent the wheel and start from the good place and then try to improve from there (i.e. not like you tried to improve the game the first...second...third...or current time).  If they'd put duos and TPP back in, I'd play a lot more.  But as it stands, it's either play solo or play at a severe disadvantage if you don't have 4 people.  I hope they actually listen or we're going to have to wait another few years for them to try again.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Gun play is good. Graphics were a little un-smooth",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "thius game is the best game ive ever played. You will never play a smooth battle royale like it. And it brings enough of a twist to differentiate itself from all other battle royals. $15 well spent",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "there seems to be a nice balance right now, not a crazy amount of crafting materials but crafting is there\r\nyou can pick your class at the start\r\nthe classes aren't tied to a weapon from the start of the match\r\nEveryone gets at least 1 revive\r\nthere's no bots \r\nyou can buy stuff from the in game store during the game and not run 300 meters to get the box\r\n\r\na-lot of things going on right off the bat",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Somehow this game became dear to me. A good change for PUBG with it's dynamics and different classes gameplay styles.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game gives me an anerusim, the graphics of a patato and still lags my pc. the combat is even more annoying because right close apparently doesnt scope in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i enjoyed every second of this game through out the years going up and down. This game deserves it. But sadly we live in an era where marketing and it's where we lost boys. Feeling so bad hope someday this game gets what its deserves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Devs finally starting listening to the players and there are some Improvements made to the game. Now its more entertaining. Would be nice it the Devs included actually good skins so there is somethin worth to get in the shop and not some imature skin designers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a pretty good game. Just needs more advertising so the lobbys can be populated. I love the crafting system, how there is different que modes of play for ranked and 3rd person, I love all the classes (except Nuclear. F#^k you and that class).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is good but team and loot icons are 20 fps it feels like crap needs to be fixed or give us an option to disable at least",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They need to make the game f2p, numbers are already dropping after 1 week lmao\n\nEDIT: Changing the review to positive since they seem to be listening to feedback and is going f2p in a week. We'll see how many players that brings in. And will change the review from there if its a shitshow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just remove the zombie and boss fight, i dont really care",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is cool, finally they removed the zombies and monsters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me game feel so nice but ttk is kinda to long 1 magazine in guy and he is still alive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly tons of fun i can see myself getting addicted asf to this, pretty unique as well, smooth graphics, love the cosmetics and pass, cant wait for a ranked system to drop! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last time I played this game. It was unbalanced. They did too much damage. It doesn't matter what type of army you had on. You can have the best top tier armor you can get. All it takes is a couple shots in your back and your dad. I hope they fix that. OK. That's reason why I stopped playing since 2024.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Super People brings a fresh twist to the battle royale genre with unique class abilities and fast-paced action. The graphics are impressive, gunplay feels smooth, and the class system adds depth. However, balance issues and optimization problems hold it back a bit. Overall, it’s an exciting and promising game for players who love tactical shooting with a touch of superpowers.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game and hope there is some more players finding this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very similar to pubg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "дифыпифо9хпфшгпиыоифпиышпдггфцрапшфгцуиазфщраИПАШЫФУ РЩШАРЗшагпврауоыаоцукенгшщзхдыовипжфшлпловиж",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am an old player of the game, and according to your announcement, old players were not supposed to make a purchase. However, I was still required to buy the package in order to continue. After completing the purchase, I did not receive any diamonds in my account.",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "⏱️ Hours Played:~42\r\n🎫 Battle Pass Level: 16\r\n🧬 Account Level: 12\r\n\r\n ✔️ Positive\r\n\r\n✔️ Fun superhero abilities and enjoyable combat\r\n✔️ Fast-paced, competitive matches\r\n✔️ Battle Pass is paid, but thanks to strong rewards you can unlock it by day 5–6 for **300💎** without spending real money\r\n✔️ Good 7-day login rewards\r\n✔️ Incredible map design — every district is unique, detailed and alive\r\n✔️ Crafting becomes enjoyable once you learn materials\r\n✔️ Quick matchmaking thanks to mix of players and bots\r\n ➖ Mixed\r\n\r\n➖ Tons of upgrades can feel overwhelming at first\r\n➖ Progression slows down very early\r\n➖ **ONLY Solo and Duo modes — NO Trios, NO 4-man squads!!!**\r\n  – Big limitation for friends who want to play together\r\n\r\n❌ Negative\r\n\r\n❌ Leveling is extremely slow even at low levels\r\n  – ~10 matches per level after lvl 10\r\n  – Ranked unlocks at lvl 20, but the game pushes 💎 level skips → feels pay-to-rush\r\n\r\n❌ Battle Pass XP is overtuned\r\n  – 42 hours played → only BP lvl 16\r\n\r\n❌ Shield hero is unbalanced\r\n  – Jump-spam, slide knockbacks, camping\r\n  – Unfair endgame 1v1 fights\r\n\r\n❌ Teaming happens in final circles with no proper reporting\r\n❌ Weak BP rewards after lvl 60 (mostly basic clothing)\r\n\r\n🎯 Overall\r\n\r\nSuperhuman has huge potential with amazing map design and fun hero combat, but slow progression, limited party modes, and balance issues hold it back. Needs polishing, but still enjoyable.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Spiritual successor to PUBG, everything you like about that game but just better.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "this game is supposedly free for returning users but i only get an option to buy smh",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is my first ever game review after being on steam for 10+ years. Hopefully that carries some weight to what I say.\r\n\r\nLobbies are small, but that's just because people haven't figured out how fun this game actually is. The best BR out there. I hope more people are willing to try the game so the player base can grow. I personally do not have an issue with the smaller lobbies. I played when lobbies were full at 60 players as well as when lobbies were no more than 3 people. Both situations are fun, just different vibes. Less people means for free looting in the early mid game and usually leads to more explosive final circles with 2-3 max geared players duking it out. I think its very fun.\r\n\r\nIMO the game is worth $15, but for the vast majority of people this will probably prevent them from trying the game which is super unfortunate because this is actually a very, very fun BR.\r\n\r\nI received the game for free since I have been playing in every beta / early access that has been released, but I think the game is so worth it I willingly buy it for my friends so they can try it too and help grow the player base.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "best battle royale game ever created, and to see its return delights me",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Short version:\nincredible game i love it. Yes it has issues and this and that but the devs compared to last time actually listen this time.\n\nLong version:\nas stated the game has ups and downs but the devs ACTUALLY listen this time sure no one asked for PvE or zombies, they tried it and removed it fair enough. Would love to see Duo's and for people who play it TPP although i only play FPP, but the current problem is the player count, now with the f2p announcement hopefully more are to come.\nWonder people can't just push 4 different modes (solos - duo - trios - squads) or 3 of them for the sake of it there will not be enough people for each lobby.\nthe game in general is a lovely game with some flaws that hopefully will be fixed soon but i will recommend the living shite out of it. the game is unique with the Battle royale mode - crafting - and having characters with abilities, i have not loved or enjoyed a game this much since LoL season 3.\nI have faith and believe in Wonder people with a little patience it will be playable for everyone.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Have been waiting for this for so LONG!! Great game with the friends and a great twist to battle royale.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "fun game died before has its issues hope they fix feels like they have but who knows how people feel about it giving it a thumbs up because i do like the game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Game runs great, plays great and feels great but it seems dead to me as servers are filled with bots and didn't encounter a single real player!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game with lots of potential\nReally fun to play, but has some bugs and sometimes a lack of players in the evenings\nHopefully these issues will be fixed soon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve spent quite a few hours playing through all the stages this game has had, and I can honestly say I had a blast — and I’ll keep playing. Since the early access release, I haven’t run into any cheaters, found only a few minor bugs, and the gameplay feels smooth. The only thing I don’t understand is why there aren’t more players. The game can feel a bit boring if you don’t have friends to play with, but that’s what the Discord server is for. All things considered, I’d give this game a solid 9/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love this game so much! I honestly want it to succeed. This game has me playing it nonstop. All I want to do is get into another game. I definitely recommend this to anyone who wants a fun battle royale. It’s a perfect mix of fun and sweaty. The in game shop is a great feature! It helps people who didn’t have good RNG not get completely wiped by a team in full legendary gear. I hope more people find this game and enjoy it. Totally worth the 15 dollars!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I’ll keep this simple - it’s a good game, and very fun; though there are a bunch of issues. \nThe does enjoyment outweigh issues!\n\nTPP DUOS and OCE Servers ASAP pls",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "SP1 was great, random weapon bonuses give you a reason to use different loadouts and not spam the same class+same weapon everytime, which gives that extra edge in replayability",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "So close, but how are the owners so ignorant?  As it stands now, this isn't the Super People we fell in love with.  The DID finally remove the zombies after intense backlash.  But instead of giving the people what they've been requesting for YEARS, they just can't get out of their own way.  When the good (OG) Super People closed, they apologized and said they couldn't keep it open because it wasn't financially viable (fair).  So instead of trying again with the popular version, they keep giving us not what was asked for.  You literally had a golden goose, but because you couldn't figure out how to feed it, it died.  Now that you're trying again, you're just using a regular goose.  I know they're never going to read this review, but seriously, look at how many reviews over the years are literally shouting at you to return the game to a specific version.  Stop trying to reinvent the wheel and start from the good place and then try to improve from there (i.e. not like you tried to improve the game the first...second...third...or current time).  If they'd put duos and TPP back in, I'd play a lot more.  But as it stands, it's either play solo or play at a severe disadvantage if you don't have 4 people.  I hope they actually listen or we're going to have to wait another few years for them to try again.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Gun play is good. Graphics were a little un-smooth",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "thius game is the best game ive ever played. You will never play a smooth battle royale like it. And it brings enough of a twist to differentiate itself from all other battle royals. $15 well spent",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "there seems to be a nice balance right now, not a crazy amount of crafting materials but crafting is there\r\nyou can pick your class at the start\r\nthe classes aren't tied to a weapon from the start of the match\r\nEveryone gets at least 1 revive\r\nthere's no bots \r\nyou can buy stuff from the in game store during the game and not run 300 meters to get the box\r\n\r\na-lot of things going on right off the bat",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Somehow this game became dear to me. A good change for PUBG with it's dynamics and different classes gameplay styles.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game gives me an anerusim, the graphics of a patato and still lags my pc. the combat is even more annoying because right close apparently doesnt scope in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i enjoyed every second of this game through out the years going up and down. This game deserves it. But sadly we live in an era where marketing and it's where we lost boys. Feeling so bad hope someday this game gets what its deserves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Devs finally starting listening to the players and there are some Improvements made to the game. Now its more entertaining. Would be nice it the Devs included actually good skins so there is somethin worth to get in the shop and not some imature skin designers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a pretty good game. Just needs more advertising so the lobbys can be populated. I love the crafting system, how there is different que modes of play for ranked and 3rd person, I love all the classes (except Nuclear. F#^k you and that class).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is good but team and loot icons are 20 fps it feels like crap needs to be fixed or give us an option to disable at least",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They need to make the game f2p, numbers are already dropping after 1 week lmao\n\nEDIT: Changing the review to positive since they seem to be listening to feedback and is going f2p in a week. We'll see how many players that brings in. And will change the review from there if its a shitshow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just remove the zombie and boss fight, i dont really care",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is cool, finally they removed the zombies and monsters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me game feel so nice but ttk is kinda to long 1 magazine in guy and he is still alive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly tons of fun i can see myself getting addicted asf to this, pretty unique as well, smooth graphics, love the cosmetics and pass, cant wait for a ranked system to drop! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last time I played this game. It was unbalanced. They did too much damage. It doesn't matter what type of army you had on. You can have the best top tier armor you can get. All it takes is a couple shots in your back and your dad. I hope they fix that. OK. That's reason why I stopped playing since 2024.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Super People brings a fresh twist to the battle royale genre with unique class abilities and fast-paced action. The graphics are impressive, gunplay feels smooth, and the class system adds depth. However, balance issues and optimization problems hold it back a bit. Overall, it’s an exciting and promising game for players who love tactical shooting with a touch of superpowers.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game and hope there is some more players finding this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended pvp mp ol game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very similar to pubg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "дифыпифо9хпфшгпиыоифпиышпдггфцрапшфгцуиазфщраИПАШЫФУ РЩШАРЗшагпврауоыаоцукенгшщзхдыовипжфшлпловиж",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am an old player of the game, and according to your announcement, old players were not supposed to make a purchase. However, I was still required to buy the package in order to continue. After completing the purchase, I did not receive any diamonds in my account.",
      "voted_up": true,
      "votes_helpful": 41
    }
  ],
  "negative": [
    {
      "review": "SUPER PEOPLE is a great game in terms of concept, visuals, and character variety. The gameplay is fun, intense, and has the potential to stand alongside the biggest battle royale titles.\nHowever, there’s a major issue that heavily affects the experience, especially for players in Europe and the Middle East.\nThe servers are too far away, causing \"high ping\" and \"noticeable input delay\", which gives opponents a huge advantage. Sometimes it even feels like the enemy is hacking, but in reality, it’s just the lag caused by the distant servers.\n\nI sincerely hope the developers can add servers closer to these regions or improve connection performance, because the game truly deserves a larger, fairer player base.\n\nFor now, I don’t recommend players from Europe or the Middle East to play until the server issue is addressed, as the experience can be very frustrating despite how good the game itself is.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "PUBG + Eternal Return + Apex Legends.\n\nPros: Game anti-cheat works like a charm, 10 people kicked out from the server by the anti-cheat on my first game, a good variety of of classes to choose from and graphics are great, game runs smoothly\n\nCons: There's nothing really new, the game is like any other battle royale out there, maps are a bunch of open spaces, nothing new, nothing to interact with. \n\nFor me it was a boring experience, run, grab guns, Level up like crazy by doing absolutely nothing, craft craft craft, reach end game, whoevcer got the nuclear airstrike class hide themselves wait till you appear, bombs you, win the game. On my 2 round i did that strategy, worked like a charm.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Two advices for the game devs. Make the game on steam deck controller friendly! AND BRING IT TO ALL CONSOLES ! like whatare yo guys doing smhg",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is awful, all the skins are in betting mode, it's totally disgusting, pure gambling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "devs make weird choices, the game is great, good structure, good gameplay, but the devs decisions are pretty weird.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another round of the devs not listening to feed back, cutting their player base in half in just 10 days, do a rather quick but inevitable downfall. I don't see this game making any progression under the current team. If its bought out by someone else and they listen to the community instead of adding zombies to a br, or restricting play to TPP or FPP instead of both it could do better. Poor balancing in terms of classes class identity not to mention mythics just being absolutely broken, but hey we got more skins and a pass for a game that's gonna die before the seasons change. \n\nPerformance on server needs to be looked at. Bugs and game breaking issues have been a problem since the before the Devs announced the game is coming back. The fact that the Devs opened a discussion and feedback page on the discord but haven't listen or even shown any kind of communication that the issues that are a constant issue from the community for months and months on end. Then when they are finally listening to the community and performing updates the Devs less than 2 weeks later state the game support is ending and closing down the game\n\nI can't speak for everyone but I know a lot of people will agree. Super People has the potential to be one of the biggest BR's out there. Especially in the current state of gaming. Everyone is trying to make extraction shooter or looter shooter or something else other than BR's. Super People is different and thats what gamers want to see. But the issues at hand with the game and the lack of communication or lack of prioritizing is what killed the game twice now. A game doesn't need UwU anime skins to make a game playable or invite new people in.\n\nDon't get me wrong i loved the game and played the heck out of it when you could actually get into a lobby of over 5 people. If the game somehow miraculously comes back after another 2-3 years ill give it a try. You'll find my expectations at the bottom of the Marianas trench.\n\ngg maybe re in the distant future..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stupid ass glitch that keep happening where you cannot equip a weapon. This game gonna die again. Don't bother re-releasing it if you won't even fix the damn glitches in the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The same as before relaunching same cheats same bugs nothing improved just more paying for low chance of skins . like 200-300 $ for a sking gets even covered by armor dysnc and lobbys with 90% asians with no recoil and silince aimbots , even server crash option is available idont know why i even paid in this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So High Ping in north Africa playing in Europ server 200 - 300 ping",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Filled with hackers and bots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game, BAD developers",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "devs fucked this game in the ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "would have recommended it before but... nah they goofed... hard.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pangit abangers kalaban",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dead game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself deserves an **8–9/10**, but the **developers’ decisions are a -99/10**.\n\nI honestly can’t understand why the devs keep sabotaging their own game.\n\n1. They **killed the original version** by shutting it down for months! What did they expect? That players would just wait around? People move on.\n2. Then they **came back branding it as SP2**. Seriously? SP1 wasn’t even properly launched yet, and now it’s already “2”?\n3. Now they’re **relaunching it as the “original” again**, but making **new players pay for it** — what a genius move for a game that *relies on having more players*!\n4. Oh and ofcourse! The region lock TPP and FPP mode! Another way to lessen the players... GENIUS!\n\nHonestly, to fix things, **whoever is making these decisions needs to be removed from that role** — or from the team entirely. I don’t know if it’s one person or a few, but whoever they are, they’re dragging this project down.\n\nBring in a **strong marketing or sales strategist**, or better yet, **sell the game to someone capable of turning it around**.\n\nBut yeah I will recommend it because I want it to be successful!",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "[b]Super People is the ultimate case study in how to speedrun the death of your own game.[/b]\n\nThe core? Genuinely fun. The map is great, classes are unique, and the gunplay isn’t half bad. For a fleeting moment you’ll think [i]“wow, this could actually be good.”[/i] Then the developers step in and remind you that no good thing is allowed to live.  \n\nThey split the playerbase like it’s their religion: ranked vs casual, FPP vs TPP, solo vs squads — anything to make sure you never find a healthy lobby.\n \nThey slapped a [b]$22AUD paywall[/b] on a game that already failed for free. Bold strategy, Cotton.\n\nThey promised to “bring back the original game”… then wasted time shoving in [b]zombies and monsters[/b] that nobody wanted. Sure, they’re gone now — but all it did was waste dev time and probably scramble the codebase into the bug-ridden mess we have today.\n\nServers? Hope you enjoy desync so bad you’ll swear you hit every shot — until the post-match screen tells you none landed. But what do you expect when the only available server is in Korea.\n\nBugs? Every update is like opening a Kinder Surprise — except the surprise is that they haven’t fixed a single one.\n\nThey’re desperately throwing in [b]events and grindy item unlocks[/b] to keep the last few players engaged, like bailing water out of a sinking ship with a teaspoon.\n\nThey just rolled out Ranked mode before even the sweatiest players could reach level 20 to play it. Genius.\n\nAnd of course, the store is back, stuffed with [b]loot boxes and gacha[/b] like it’s a mobile casino.  \n\nThis game could be great, it's so close, but the developers seem to lack the ability to make obvious decisions. Its genuinely a mystery that they were able to make a game this good after seeing how its been handled once given to players. Super People is the only game where you can actually feel the developers’ obsession with self-destruction. It’s not just mismanagement — it’s a full-blown fetish for killing their own game.\n\nUPDATE: Make sure to nominate Super People for the 'Labor of Love Award' in this years Steam Awards",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Could be better than PUBG but... Cheaters, D-sync mid game and questionable actions from Devs are killing it",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "The developers will do anything so this game to fail so the developers can file for bankruptcy. Let it die already",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Game has shutdown twice. Devs don't listen to players. All skins purchased in original game have been removed from everyones accounts. Now during the relaunch today on 9.18.25, Theyve also removed TPP from NA and FPP from Asia. LOTS OF BOTS. As an H1Z1 enjoyer I wanted this game to succeed so badly...",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Its the same shit all over again. The devs or whoever is in charge these days is absolutely clueless and disconnected from the playerbase. They keep pumping ugly ass skins in an unfinished game. Its already dead once again and this time it will be forever.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game died twice, third time they didn't even care to make it worth playing.\nOn top of it, they put a paywall on the game of $15 USD when it was supposed to be free.\n\nThey split the lobbies up like they're separate rooms in an already-empty house. You want solo play you're stuck with FPP. You want TPP you have to squad. And you wait 5 minutes for a lobby of 6 people or less either way. Then there's the horrible desync even with a 6 player lobby where everyone is stuttering around.\n\nWhen the lobby has about 20 people in it, it is mildly fun. But you spend most of your time puttering around like it's a solo shooter just looting. The attempt to go back to Super People 1 is about the only smart thing they did. The annoying Super People 2 and that weird zombie mode went away. The mechanics are where they were but that's barely good enough to warrant anyone coming back. Also any skins and other things you may have earned from previous version are all wiped; not that those matter to everyone but it's a nice kick in the shins.\n\nAdd on top of it the fact they still look like a bargain basement version of PUBG instead of trying to make it look like a unique game and you got a middling BR. But the game the way it is right now feels like a case of strike three.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "[h1] IN ALL HONESTY: [/h1] \n[b]I Love Super People![/b] From the looting, to the guns, gun-play, engagements are so top tier. That being said, the management of wonder people/wonder games are so incompetent. Super People 1 huge, peaked at [b]47k players.[/b] The developers did their own thing, ignoring the player base resulting in a decline in their game. Very little advertising done with Super People 1, then they drop a bombshell and [b]\"RE BRAND\"[/b] Super People 1 into Super People 2 removing core aspects of the game (skills, crafting). The Re brand was a utter mess, and honestly didn't last long. [b]GAME SHUTS DOWN.[/b]\n\n[h1]-FAST FORWARD TO 2025-[/h1]\nWonder People announces Super People coming back, we wait. no advertising is done in the mean time, they go silent much like they did the first two times. CBT for this Super People drops [b]-WITH ZOMBIES & BOSSES-[/b] Never have i seen such rushed pushed trash in my life. zombies made no sense in the world, animations were so generic and gross, the whole monster idea messed up the fundamentals of Super People. CBT closes and they announce they will be removing the monsters and \"returning\" to OG Super People 1. Left us again in the dark for weeks/months no announcements, no advertising AGAIN. They Announce OG Super People will be coming September 18th, 2025. \n\nThat Day comes, The Core of Super People is there. The looting, the awesome and exciting gun battles, But things are still missing, the amount of skills is still lowered, no energy bars, no duos, no third person perspective. [b]NOW[/b] locked behind a [b]14.99$[/b] paywall. Time and Time again they failed us, and really need to sell off the Super People IP to a studio with more understanding and love for making a game that its players want to play!\n\n[b]I LOVE SUPER PEOPLE,[/b] but Wonder People is really making their name make us [b]WONDER, PEOPLE!!![/b]",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "SUPER PEOPLE is a great game in terms of concept, visuals, and character variety. The gameplay is fun, intense, and has the potential to stand alongside the biggest battle royale titles.\nHowever, there’s a major issue that heavily affects the experience, especially for players in Europe and the Middle East.\nThe servers are too far away, causing \"high ping\" and \"noticeable input delay\", which gives opponents a huge advantage. Sometimes it even feels like the enemy is hacking, but in reality, it’s just the lag caused by the distant servers.\n\nI sincerely hope the developers can add servers closer to these regions or improve connection performance, because the game truly deserves a larger, fairer player base.\n\nFor now, I don’t recommend players from Europe or the Middle East to play until the server issue is addressed, as the experience can be very frustrating despite how good the game itself is.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is just getting worse and worse each time they try to resurrect it.\r\nDon't waste your money. Let it finally die.\r\n\r\nTTK - trash.\r\nBalance - trash. \r\nServers - sh*t.\r\nOnline - zero.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "So its 3 days after re-release and i have ran into hackers again, combine this with a player count that cant actually fill lobbies and its just a poor experience (again). \n\nJust gotta let this one die",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really enjoy this game but this game gonna be shut down for 3rd times for sure. Game of Super (aimbot) people",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "First game after relaunch had a cheater in it. Thanks but no thanks, not bothering with that again.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "no tps. gets only 5 max players in lobby. walking around for 20 mis just to get killed. almost just walking and looting simulator. i guess the game will shut down again soon.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bullshit for being paid to play game like wasted my whole year waiting for you to comeback and now your not free to play anymore ps been a player since day one yeah vault it on your pockets.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game had potential and this is not the original.  Fix the game or it very well deserves to die.  Listen to your community, and stop being dense..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Everything i want is the actual O.G version of Super People <3 pretty please and thank you. Cant REALLY recommend before that happens, not to new new players at least.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Edits: \n\nWeek 1:\nThey have changed aspects of the game since we began playing it last week (e.g., removal of different types of armor and gun modifiers that added some strategic thinking to your choices) - this now makes me wary of the stability of the experience. It also is now corrupted by cheaters. \n\nWeek 2: \nI also suspect that there is server latency issues since the gunfights I experience do not match what is described in the post-encounter combat logs. As much as I want to love and continue playing this game, the creators seem to botch it up every time and are silent.\n\nLast update: \nUninstalled - loved the game since the start, but it is now corrupted by cheaters and really bad developers.\n\nI love the game but the studio that makes it has this tendency to make so many head-scratching changes that make the game worse and not listen to rational criticism. It feels like their decision-makers have Attention Deficit Disorder. My review has now changed to Not Recommended even though it is fun to play.\n\n-----Original Review-----\n\nA significant improvement from the previous SP2 and early/beta releases. I have played since initial launch a few years ago and suffered during the PvE/Zombie fiasco.\n\nNow, it maintains the spirit and tactical dynamics of the original version with the addition of a few new twists: altars with buffs, removal of candy bars, addition of in-game gear & skill purchases.\n\nThe SP community, to be frank, is filled with too many knee-jerk complainers/rage baiters - it is a very good game. Cut through the cacophony and give it a chance.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game released as F2P in 2023, they closed servers after 7 months.\n\nNow they re-release at 15$ pricepoint, game is filled with even more mtx.\n\nIt's obvious cashgrab that will close servers in max. 5 months.\n\nDon't waste your money on this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Came out the 18th, Dead by the 20th.... You'll get a game with 5 people and they will act like they're playing for 10 million dollars. The sweatiest 5 players i have ever met. GG super people, was fun while it lasted",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the devs are ruining the game and they refuse to do anything that the fans want, like TPP the game is trash and broken.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I suggest changing the name of the game to Super cheater .\ncharacter control is excellent / the shooting is stupid / the skills are unbalanced / the vehicle control is stupid / the fee rating is relatively acceptable /the sound system is bad/ The progression system in the battle pass is very stupid and slow./the prevalence of cheaters\nThe company deleted all collectibles, skins and cash from my old account and started from scratch even though I bought more than one battle card . Does it make sense ? / Does the player Bear corporate decisions ?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Reset twice because devs consistently don't listen to player feedback.\n\nLost all my skins from resets :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "every iteration has been ftp NOW they want $22 AUD to play what is basically the og super people that we all asked for from the second they messed the game up in \"super people 2\", yeah this is definitely  an exit scam for when  the game inevitably shuts down again in max 6 months",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "going from bots to cheaters. what a garbage game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's the 3rd time, maybe 4th, they launch the same shit game, and now they are charging for it.\nflabergasted",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When Super People first launched, it was a surprisingly solid alternative to PUBG. It ran well, looked great, and the core gunplay felt satisfying. For a brief moment, it really seemed like it could carve out its own place in whatever is left of the BR genre.\n\nBut, as often happens with free-to-play models, the influx of cheaters quickly overwhelmed the experience for me. The developers’ balance changes were lackluster, progression lost any meaningful weight, and the renaming to Super People 2 felt like the beginning of the end. Sure enough, by 2023 the game was officially terminated.\n\nNow two years later: I played the Closed Beta Test after the game was renamed back to Super People. The promises were familiar—better anti-cheat (BattleEye lmao), improved balance, and new ways to attract players to what was already a dead-on-arrival relaunch. And now, they’ve announced a move to a paid model, with legacy players exempt.\n\nDo I think anything will actually change? Absolutely not. If they had simply made a clean PUBG-style clone; without the unnecessary classes and other frivolous mechanics - the game \"could\" thrive. It looks good, it plays well, but it’s weighed down by design decisions that nobody really asked for; if you're looking for that og BR itch then play PUBG, if you're wanting classes and abilities - play Apex.\n\nUnfortunately, I cannot recommend this game at this moment with everything that I've experienced thus far. I truly wish this game the best. As i wish there was truly an alternative to PUBG; as its really no better.\n\n------------------------------------------------------------------------------------------------------------------------------------\n\nКоли Super People вперше вийшла, це була напрочуд вдала альтернатива PUBG. Гра працювала стабільно, виглядала чудово, а стрілянина відчувалася дійсно задовільною. На короткий час здавалося, що вона може вибороти власне місце в тому, що залишилося від жанру battle royale.\n\nАле, як це часто буває з free-to-play проєктами, наплив читерів дуже швидко зіпсував увесь досвід. Балансні зміни від розробників були слабкими, прогресія втратила будь-який сенс, а перейменування на Super People 2 виглядало початком кінця. І справді — у 2023 році гру офіційно закрили.\n\nМинуло два роки: я грав у закритий бета-тест після того, як гру знову перейменували на Super People. Обіцянки були знайомі — кращий античіт (BattleEye, лол), поліпшений баланс та нові способи залучення гравців у реланч, який був приречений із самого старту. І тепер вони оголосили перехід на платну модель, залишивши “ветеранів” безкоштовними.\n\nЧи вірю я, що щось зміниться? Абсолютно ні. Якби вони просто зробили чистий клон PUBG — без зайвих класів і непотрібних механік — гра могла б жити. Вона виглядає добре, грається теж непогано, але її тягнуть на дно дизайнерські рішення, яких ніхто не просив. Якщо вам хочеться класичного BR — грайте в PUBG. Якщо хочеться класів та здібностей — грайте в Apex.\n\nНа жаль, я не можу рекомендувати цю гру зараз, виходячи з усього мого досвіду. Я щиро бажаю їй успіху. Як і бажаю, щоб з’явилася справжня альтернатива PUBG — бо наразі нічого кращого так і немає.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Outdated, unbalanced, messy, clunky. It looks cheap and feels unrefined. Which is actually a shame, because there are some decent ideas here. Crafting to upgrade your gear makes good sense - drives moving around and lets you upgrade the gear you actually want. Classes isn't a bad idea either, but they are currently unbalanced.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "PUBG + Eternal Return + Apex Legends.\n\nPros: Game anti-cheat works like a charm, 10 people kicked out from the server by the anti-cheat on my first game, a good variety of of classes to choose from and graphics are great, game runs smoothly\n\nCons: There's nothing really new, the game is like any other battle royale out there, maps are a bunch of open spaces, nothing new, nothing to interact with. \n\nFor me it was a boring experience, run, grab guns, Level up like crazy by doing absolutely nothing, craft craft craft, reach end game, whoevcer got the nuclear airstrike class hide themselves wait till you appear, bombs you, win the game. On my 2 round i did that strategy, worked like a charm.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Two advices for the game devs. Make the game on steam deck controller friendly! AND BRING IT TO ALL CONSOLES ! like whatare yo guys doing smhg",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is awful, all the skins are in betting mode, it's totally disgusting, pure gambling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "devs make weird choices, the game is great, good structure, good gameplay, but the devs decisions are pretty weird.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another round of the devs not listening to feed back, cutting their player base in half in just 10 days, do a rather quick but inevitable downfall. I don't see this game making any progression under the current team. If its bought out by someone else and they listen to the community instead of adding zombies to a br, or restricting play to TPP or FPP instead of both it could do better. Poor balancing in terms of classes class identity not to mention mythics just being absolutely broken, but hey we got more skins and a pass for a game that's gonna die before the seasons change. \n\nPerformance on server needs to be looked at. Bugs and game breaking issues have been a problem since the before the Devs announced the game is coming back. The fact that the Devs opened a discussion and feedback page on the discord but haven't listen or even shown any kind of communication that the issues that are a constant issue from the community for months and months on end. Then when they are finally listening to the community and performing updates the Devs less than 2 weeks later state the game support is ending and closing down the game\n\nI can't speak for everyone but I know a lot of people will agree. Super People has the potential to be one of the biggest BR's out there. Especially in the current state of gaming. Everyone is trying to make extraction shooter or looter shooter or something else other than BR's. Super People is different and thats what gamers want to see. But the issues at hand with the game and the lack of communication or lack of prioritizing is what killed the game twice now. A game doesn't need UwU anime skins to make a game playable or invite new people in.\n\nDon't get me wrong i loved the game and played the heck out of it when you could actually get into a lobby of over 5 people. If the game somehow miraculously comes back after another 2-3 years ill give it a try. You'll find my expectations at the bottom of the Marianas trench.\n\ngg maybe re in the distant future..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ignoring the other issues related to design and income choices frequently mentioned in the reviews here, the unpolished core gameplay, blooming visual clutter and poor viewport support makes this unplayable. It´s not even remotely close to playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Man this game sucks :D It was great back in 2022... Super People 2 have such improvements as -\r\n * Worse graphics - Experience battle as if you have soap in your eyes!\r\n * Advanced combat strategies - first to see enemy wins the fights since you will never hear any footsteps or any indication as to where are you being shot from\r\n * Bunch of game modes - solo sweat and 4v4! Have less people to play with - good luck winning any PVP\r\n\r\nAnd many more! Loved every second of it :D",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Would love to Play this game Only Prob;em is it doesnt support Remote controller GamePlay ??\r\nWitch sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sorry but I'll be completely frank, this game is not worth your time. Player base has dropped significantly, and it seems like the game should've been free to play in the first place for the people who played before but didn't. So now that it's free to play people already stopped caring about the game. Same game as before, same mistakes repeatedly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Super People has a very low player base, and the main reason is its shift to a paid model after its return. For a battle royale game, that decision killed the hype. Another major mistake is the inclusion of too many modes and game types, which splits the player base and makes matchmaking frustrating and inefficient",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "there is now tpp and duo, and must delete money on the game,and there is cheaters on the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unable to even get through the tutorial. froze when asked to press I to buy a gun. as asked couldn't even select the free gun the press I to open menu just stayed on screen don't bother just another piece of crap doing the same thing trying to grab our hard earned cash A R Is coming so there's that to hope for.......................",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Edit 10/11/25 Super People is going free-to-play on OCT 16th 2025, DO NOT BUY. [/h1]  \n\n[strike]I'm only playing it because my refund was denied so, you know...[/strike]\n\nYou start to realize that everything that you could've thought of with the BR formula, has been thought of.  Why did I spend money to buy this, when other BR games are F2P? I will never know.\n\nMap design, gunplay, perks, ults, and supply drop- just, \"okay\"\n\nIf you're from west coast NA, game is populated in the morning, a ghost town into the afternoon. \n\nDespite having a populated game in the morning, there's not enough of players to form squads and usually opponents leave at the start. I shouldn't be surprised, considering the fact that the devs are from South Korea, but I am. \n\nThe only good thing is that the game runs fine. [strike]I will continue to play because I am both hopeful and stupid.[/strike]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this game when it's beta first came out back in 2022 but still paid for it again because it's a Solid game. However I can't recommend because it constantly crashes before you even start a match. It even crashes in lobby. Had 4 crashes in a row. I'm running an RTX 3080TI with Ryzen 3600x so it's not a requirement issue.\n\nFix the crashes and I'll change my review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is completely destroyed, bugs, crashes, you can't report teammates killing you, chatters, waste of time and money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "COMING FROM A DAY 1 OG PLAYER!.  Super people.. ahh where do i even explain? basically its if pubg and apex had a kid. its pubg with apex ability's. it wasn't bad when it first ever released. then it closed. remade super people 2? then closed again... and now its back? welp basically it's how did we get here? first off. Gun play isn't bad it feels like pubg almost, accept you have ability's. AKA legends from apex that you get too choose off and what too have during the game. what sets it mostly different is the crafting aspect of it. you can find ground loot aka crafting materials and craft weapons and gear into higher rarities for more defense movement speed, ect. and that's about all about it. from myself to the devs.. if the game died twice.. why try a 3rd time? if you could you should re-design the WHOLE game into a PVE Game instead. something with zombies or bugs. like that one game Cycle frontier that sadly sunset. i have a feeling that with marketing and re-branding you could attract a whole lot of people back too the game. also.. why make the game paid? it was originally free and i'm pretty sure it killed you're player-count HORRIBLY. IMO make the game free again and focus on in game shop cosmetics and items. something that would fit a PVE theme. but yeah. as someone like me who's seen the game die 3 times. i think its time you guy's try something different with it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This version is better it went from REALLY BAD where you had to kill zombeez for the loot omg that was cheeks.  MY ISSUE  that is a game breaker is that its just another FPS Competitive Shooter w/ a backdoor that is going to thrive on the cancer in the game industry these game influencers the greediest one is going to be their poster boy willing to do anything for the right price. DEFINITELY DO NOT RECOMMEND THIS GAME.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pls full release and bloody game thats not broken with shit loads of bugs like this holy shit,.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is full of bugs like before network latency issue 52 to 60 players all of them are bots took more than 2 years and giving us same bugs old profile and rank is gone old attire shirt jacket shoes all gone have to pay diamond money which is bad  so deleting the game wastage of time sorry to say this game cant be fixed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk I returned the game after a hour. The UI is really janky combat felt ok but its hard to find players. I played plenty of free to play games that were better than this game. 15 dollars didnt seem worth it. Seems like a pub g knock off. You cant play third person im guessing cause of a low player base. Make the game free to play and I see potential but right now theres too many other games out here doing it better. Also only server I could connect to is asia im in chicago so yea it sucked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First of all, I want to make it clear that I’ve been playing Super People since the very first alpha and then the first CBT… and yet I had to buy the game (which supposedly was going to be free if you had already tested all the Super People releases like CBT 1 and 2, SP2, SP with zombies, and now this one). I ended up paying 8 dollars for it.\n\nThat being said, let’s continue: I don’t know what went through the developers’ heads to turn a free game into a paid one without even fixing the most common issues (actually, I do know — the devs are incompetent and money laundering, which is why we have this mess now).\n\nI’m from Argentina, so logically I should be playing on a Brazil or Chile server, right? Well, wrong. I have to play in North America because the geniuses behind the game decided to only add 3 servers (NA, EU, and Asia). That means I’m forced to play with 140 ping, which is EXTREMELY UNPLEASANT.\n\nAnd while we’re at it, the servers are horrible and a disaster. Every single error you can imagine in a battle royale/FPS is here. Bad connection? Yes. Poor hit registration? Yes. Items not spawning on the ground after parachuting because the server is overloaded and can’t generate them? Yes. “Network latency detected” messages every 20 seconds as if that’s normal? Yes. Teammates unable to enter the lobby because of a server connection issue? Yes. Seriously, search for 5 minutes and you’ll find all of these bugs.\n\nThen the gameplay is AWFUL. This is nothing like the original CBT. They removed weapon specializations, removed character perks, and now you have to buy them in a shop (and by the way, everything is obtained in that shop with the gold you farm — but not attachments, of course). The weapons are unbalanced, causing either one-shots or turning into laser beams. Now everyone gets their ultimate in less than 30 seconds, which makes fights completely unbalanced and survival impossible. They removed the power bars and added altars that are even worse, with bugged effects. Character abilities don’t even work properly.\n\nIn summary, people, don’t buy this game. Let it die and don’t give money to a company that only wants to drain our wallets and treat us like idiots. I did it, I was an idiot — but I’m saving you from making the same mistake. Go buy another game you’ll actually enjoy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love making the tragic mistake of ADSing and then only being able to move backwards or to the left/right.  It's not like theyve had multiple attempts to get it right and not have stupid ass bugs like the daily log in not ticking up or any audio bugs.  I want this game to be good so bad and yet here we are, a time filler until BF6 drops.  And that's a shame because if done right this game could have absolutely killed PUBG and pulled a huge crowd from COD/Apex/Fortnite.  I don't hate this game by any means.  I'm just sad at how they did it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very saddening to see the state that this game is in, struggling to stay over 1k players after this highly anticipated \"3rd\" release. The fact they went from super people 1 to 2 and then completely took the game away was already pretty bad. The game itself is very fun, guns and powers/graphics... but the way the store and game is ran, from the moment you open up the game and hit the menus, they throw diamonds in your face. The fact that existing players get absolutely no items/outfits, and the first \"free\" outfit is not even for male characters. a stupid looking shirt and a skirt?! mind blowing. I had alot of gear in my 80 hours playing previously. Utterly let down, but not really surprised. Didn't expect much to begin with. Just wish the right company would've got a hold of this game and did something better with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your money on this game right now. What started out as a fantastic spin on the BR genre (the OG game) quickly turned into several messy iterations of shit that the playerbase never asked for. Wonder People have done a great job tanking this thing. At this point I'm convinced that this has to just be a big joke on their end. \n\nEven if you ignore the blatant problems (player count...hello?) even something as little as the main lobby screen looks rushed. No life in the background whatsoever and the menu options don't even match up. You have some options all lowercase, some all uppercase, and some that are cut off even though theres more room on the screen to expand it. It's just awful and screams \"this is a money grab\"\n\nI'd love to talk about the gameplay but literally after my very first game on this most recent release (a lobby with 50 people) I was getting solo lobbies with 8-12 people. After the first day I'm lucky to get 3-4 people. \n\nWishful thinking this company would get out of their own way to release a game that thousands of people thoroughly loved at one point. Unfortunately even if they were to reverse all of this and release the OGOG game i think it's too little too late. The trust is gone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is an utter shell of its former shelf. Lobbies are practically dead, FPP mode only, players being false banned left and right.\r\n\r\nThe gem reimbursement from previous purchases is nice and all but by all that is holy release the full game and stop this region lock bs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please just keep the game the way it is now. Growing the player base and the trust of the player base should be the next steps. This game has been given tons of good chances, this will probably be the last one. WE WANT TO SUPPORT THIS GAME!! Just be a company we can feel good supporting :) EDIT : After the company refusing to take away the price tag and doing nothing to support there game I now would not recommend this to anybody. Or the company ever again. Lobbies are dead until 2am when the Asian community is on. They buried this game as a way to go bankrupt and not lose as much as they can say they have the game up which helps immensely with bankruptcy for a video game company. Scammy shady developers ruined the game. But I genuinely think it lies with the president of the company allowing such terrible things to happen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even play the game, crashes on launch since Super People 2. Disgusting that this is still an issue, not even worth trying to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "More depth than most BR's today. Not balanced but there is depth.\nChanged my mind, wow this is unbalanced and dead. Dev team displays a clear lack of understanding of balance changes and gameplay. Wonky as hell movement and the camera is so zoomed in. -1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, a good game riddled with cheaters. Cheats are free online, and people on your team will not try to hide cheats while you spectate them. Running into a cheater is obvious too as you can spectate them when you die.\n\nVery unfortunate, had high hopes for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is extremely disappointing. The graphics and optimization are terrible, the sound design is inconsistent, and even the most basic features like footsteps are poorly made. This isn’t their original game version, they used to get something as simple as footsteps right. The interface looks like a PowerPoint presentation, and I honestly can’t believe this level of production was released to the public.\n\nThe game badly needs third-person view and duo queue options. Please, do more thorough testing before releasing. We waited so long for this, only to end up with a broken mess. I genuinely loved the original version of this game, but what is this supposed to be now? Can you please focus on getting the core functions  right—like sound feedback, stability, and proper mechanics—before adding flashy but meaningless features?\n\nMeanwhile, they are selling too many paid skins and cosmetics in the in-game store. it seem like making money was the priority over fixing the game itself. If you can’t even get the basic functions right, why rush to push skins and accessories?\n\nI’m leaving this review because I had high expectations and I still want to believe in this game. But right now, it feels like a huge letdown. Please take player feedback seriously and improve the fundamentals before trying to sell us extras.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't bother paying for this game. It's clearly a cash grab using a game build from 4 years ago without addressing any of the issues (Edit: They've since made this free to play). It's a terrible example of a battle royale. If you played this around 4 years ago, it's the exact same game, complete with the same old bugs.\n\n* No OCE servers still (years after they promised they would). Instead we are forced to play on Korean servers where the ping is 150 and feels like 600, resulting in being shot around cover over and over.\n* The same bugs from 4 years ago are still ruining the game (can't cancel actions, can't loot a box, can't complete an armour upgrade)\n* Too many classes just cover the features of cheating - fast running, see through walls, go invisible. Easy to prevent cheats when you incorporate it into the game itself. \n* The promise of being able to play for free if you've played before was rubbish. Their support page is highly confusing and you get no response. \n* The audio is AWFUL. Worst i've experienced in years of gaming. Too often you just don't hear footsteps, even for classes without the perk.\n* When you can hear footsteps or a loot box that pings, you can't tell if it's above or below you. The directional audio (up and down) is non-existent.\n* The game is horribly unbalanced. Some max level guns do far less damage than a basic ground gun.\n* The classes make things so much worse. There's way too many of them and a handful are STILL way overpowered, all this time later. They didn't bother to review their data to see if the game is balanced. It's not. You go into a game where 12+ players (so every squad) have selected the same 3 classes because they're so OP.\n\nI could go on, but I think you get the idea. This could be a great game if they took the time to address the issues. The fact they've asked for money for a game that hasn't been touched shows they're grabbing cash (edit: It's now FTP). Don't expect it to be live for much longer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Are The developers special or something no one going to pay almost $15 for a game that use to be free\n\nalso game is dead as hell I have yet to see a full game this game is 100% going to shutdown again if they don't do something about it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completely ruined by the huge influx of cheaters. Over 20 years of playing FPS games it's obvious when your outplayed and outgunned... it is also very obvious when you come across cheaters... Even spectating team-mates and watching them wallhack. Such a shame, but until the Chinese & Russians are region locked/blocked again this game will never work.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I also have over 170 hours played on the testing ground, so with almost 250 hours played total throughout the life of this game, this might be the worst version of the game that exists (even the zombies version). Everybody runs insanely fast, class identity is gone with the ability to purchase extra perks from other classes, weapon diversity is gone without the weapon specializations that would randomize based on the class youre playing, dying at all is no longer impactful because you just respawn for free when your team gets wiped, the purchasing menu is the least intuitive menu in existence (including the menus in this game that are in a different language), every single class has insanely low CDs so it is just an ability spam fest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used a purple m416 against an enemy in purple. hit him with 11 shots and he didnt die. The games a loot simulator with bad gunplay. I played the original super people and remembered it being fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game would be great again if they removed the store. Until then the game is garbage. Please just go back to OG Super people and get rid of it. Oh and add duos back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Put duo mode fpp, FIX SOUND!!!! and other bugs... PRETTY PLEASE! otherwise this game will be dead until the end of October",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seems the 3rd person isn’t working on it. Game feels a bit clunky and outdated. The bullet reg doesn’t feel too good. I’m pretty sure they advertised it as free to play. The game isn’t worth 15 dollars at all. Graphics looks decently good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "갤에 알바풀 돈으로 서버 개선이랑 최적화좀 해라\n차라리 이 에셋으로 야겜만들었으면 대박났을듯",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Best potential of any BR ever. Ruined by hackers and bad decisions by the developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT BUY THIS GAME. The developer team is literally stupid and doesn't care about the game at all, they constantly make changes against community feedback despite that they acknowledge the feedback. They had to shutdown the first game because they lost all their players after reworking the Firearms Expert class to become overpowered making every fight unengaging, and instead of reverting or addressing the class issue they reworked the entire game multiple time to the point it's nothing like and not even remotely close to being as good as the first game. The game can be really fun but that fun is constantly ruined by so many game breaking mechanics that never existed in the original game when it was most popular. Every class in this game removes your ability to fight back it's a joke of a game.\n\nUpdate: They made one good minor change in the new patch but it needs a lot more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "R.I.P 2025/10/30 The game died again Bad developers don't listen to the community They shut down the Eu servers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stupid ass glitch that keep happening where you cannot equip a weapon. This game gonna die again. Don't bother re-releasing it if you won't even fix the damn glitches in the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The same as before relaunching same cheats same bugs nothing improved just more paying for low chance of skins . like 200-300 $ for a sking gets even covered by armor dysnc and lobbys with 90% asians with no recoil and silince aimbots , even server crash option is available idont know why i even paid in this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So High Ping in north Africa playing in Europ server 200 - 300 ping",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Filled with hackers and bots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game, BAD developers",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "devs fucked this game in the ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "would have recommended it before but... nah they goofed... hard.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pangit abangers kalaban",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dead game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself deserves an **8–9/10**, but the **developers’ decisions are a -99/10**.\n\nI honestly can’t understand why the devs keep sabotaging their own game.\n\n1. They **killed the original version** by shutting it down for months! What did they expect? That players would just wait around? People move on.\n2. Then they **came back branding it as SP2**. Seriously? SP1 wasn’t even properly launched yet, and now it’s already “2”?\n3. Now they’re **relaunching it as the “original” again**, but making **new players pay for it** — what a genius move for a game that *relies on having more players*!\n4. Oh and ofcourse! The region lock TPP and FPP mode! Another way to lessen the players... GENIUS!\n\nHonestly, to fix things, **whoever is making these decisions needs to be removed from that role** — or from the team entirely. I don’t know if it’s one person or a few, but whoever they are, they’re dragging this project down.\n\nBring in a **strong marketing or sales strategist**, or better yet, **sell the game to someone capable of turning it around**.\n\nBut yeah I will recommend it because I want it to be successful!",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "[b]Super People is the ultimate case study in how to speedrun the death of your own game.[/b]\n\nThe core? Genuinely fun. The map is great, classes are unique, and the gunplay isn’t half bad. For a fleeting moment you’ll think [i]“wow, this could actually be good.”[/i] Then the developers step in and remind you that no good thing is allowed to live.  \n\nThey split the playerbase like it’s their religion: ranked vs casual, FPP vs TPP, solo vs squads — anything to make sure you never find a healthy lobby.\n \nThey slapped a [b]$22AUD paywall[/b] on a game that already failed for free. Bold strategy, Cotton.\n\nThey promised to “bring back the original game”… then wasted time shoving in [b]zombies and monsters[/b] that nobody wanted. Sure, they’re gone now — but all it did was waste dev time and probably scramble the codebase into the bug-ridden mess we have today.\n\nServers? Hope you enjoy desync so bad you’ll swear you hit every shot — until the post-match screen tells you none landed. But what do you expect when the only available server is in Korea.\n\nBugs? Every update is like opening a Kinder Surprise — except the surprise is that they haven’t fixed a single one.\n\nThey’re desperately throwing in [b]events and grindy item unlocks[/b] to keep the last few players engaged, like bailing water out of a sinking ship with a teaspoon.\n\nThey just rolled out Ranked mode before even the sweatiest players could reach level 20 to play it. Genius.\n\nAnd of course, the store is back, stuffed with [b]loot boxes and gacha[/b] like it’s a mobile casino.  \n\nThis game could be great, it's so close, but the developers seem to lack the ability to make obvious decisions. Its genuinely a mystery that they were able to make a game this good after seeing how its been handled once given to players. Super People is the only game where you can actually feel the developers’ obsession with self-destruction. It’s not just mismanagement — it’s a full-blown fetish for killing their own game.\n\nUPDATE: Make sure to nominate Super People for the 'Labor of Love Award' in this years Steam Awards",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Could be better than PUBG but... Cheaters, D-sync mid game and questionable actions from Devs are killing it",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "The developers will do anything so this game to fail so the developers can file for bankruptcy. Let it die already",
      "voted_up": false,
      "votes_helpful": 18
    }
  ]
}