{
  "positive": [
    {
      "review": "RE8 is the last stop in the chronological story in Resident Evil saga so far and caps off my month of re-playing the modern RE games.  This was my second playthrough and I found this to be an incredibly strong RE game but a weak sequel to RE7 that actually, in my opinion, undermines a lot of the gut punch in the Louisiana narrative.  RE8 has a stellar stage set in yet another undisclosed village in Europe.  The comparisons to RE4 are inevitable and RE8 is overall a fantastic package that addresses almost every complaint I have with RE7.\n\n(+)  RE8 is arguably the best designed game in the series.  I found the entire game lovingly constructed with some areas being the most well-realised and executed you can find in the horror genre.  The castle of Lady Dimitrescu with its rotten dungeons and the waterfall Beneviento manor with it's accompanying graveyard are the stand-outs for me.  I was swallowed in the exploration side of RE8 and engrossed in the gameplay as it only gently guides you through giving you the agency of being stuck with Ethan and having to map out your plan and adapt when it all inevitably goes wrong.  The fidelity of display is a real punch up from RE7 and the character design is stunning, Mia has thankfully lost her spaghetti hair!  The creatures that overwhelmed the village and that spill out of the dungeons are incredible and the variety of enemy design has seen the most love and care.  The gameplay is a lot more responsive and even though we've tipped into action there's still a lot of surprises, twists and turns waiting for you.  Creatures can literally rise from their graves, fall out of trees and smash through walls and it always kept my eyes on the spectacular world design which was a nice way of keeping you in Ethan's shoes.  There's a lot lifted from RE4 but I personally think this is what RE should be shooting for when going for an action game so I loved how exploration led to upgrading weapons, how killing enemies fuelled the gameplay loop and how you've always got control in the action, you're rarely in cutscenes for anything other than story.  The gameplay is a lot more energetic and I was never sure headshots were the way to go, the Lycan's literally gyrate like they're in the Thriller music video and they pushed pressure onto me which always kept me on the backfoot.  The sound design has also seen some bulking and it's some of the best in the series.  Wind can whip around buildings and through the castle, snow is constantly crunching underfoot and footsteps echo off stone floors.\n\n(-)  I don't have much to gripe about other than the game pulling the emotional rug out from under RE7 and, at least in my opinion, completely muddying the fresh take on RE by sloppily tipping the old lore into the story and undoing a lot of the delicate emotional crafting done in RE7.  The twist with Ethan left me salty when I first played the game four years ago and I haven't replayed RE8 until now.  I still hate the twist and think it really takes away from the Winter's story as well as partially ruining my favourite moment in the entire series with Ethan emotionally connecting with Jack in RE7.  I've mellowed out on it now but I really think they should have hesitated in tying this to the old games, especially as RE7 was the breath of fresh air that saved the series.  The game also cheekily locks areas off behind you and is obviously baiting a new game plus playthrough which was infuriating to my beaver-ish OCD as I like to collect everything in each area before moving on and I didn't finish upgrading anything despite ticking all but a few areas off being fully searched.\n\nOverall, I was with the game through giant Vampires, through werewolves, through giant fish and through talking dolls but it lost me right at the narrative's crescendo.  The gameplay is engaging and the atmosphere is electrifying so I would absolutely recommend this game.  I was finished in 11 hours but that was me completing the game as thoroughly as I could with a lot of backtracking.  I had zero technical problems with it and is yet another example of the fantastic RE Engine.  It worked perfectly with my X1X controller I would recommend this game to all horror fans.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I feel Capcom went all in with this one. They saw what worked in previous installments and added them. Although similar to RE7, RE8 does much more and instead of being great at any one particular area, it tries to be good at mutiple aspects. It has been one of the most enjoyable titles I have played in a while. \r\n\r\nThe game is mostly action-packed but has its own creepy and terrifying moments. Its not as scary as RE7, also the villains could have been a bit more developed. But it definitely expands the lore and makes the events of the previous game much more disturbing. Just 2 guys going through insurmountable odds, so you move from being helpless, emotional, scared and downright badass when needed.\r\n\r\nBeen playing Capcom games for a decade, and I am confident they can't write a coherent and plothole-free story, but they respect their OG characters and when it comes to fan service, they always deliver.\r\n\r\nThis game is shorter and easier to 100% compared to RE7. Mercenaries was fun, but could have been better. Shadows of Rose DLC was a nice way to introduce a new character with new gameplay mechanics.\r\n\r\nA must play if you played RE7 or other RE games, but its better not to make this your first game into the franchise.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Resident Evil Village is a first-person survival horror game that continues the story of Ethan Winters. The plot centers on the search for his kidnapped daughter in a remote European village. The narrative mixes gothic themes with modern bioweapon lore, creating a structured progression through distinct regions.\n\nExploration balances linear paths with optional rooms. Players collect keys, solve simple puzzles, and unlock shortcuts. Resource scarcity shapes decision-making. Ammunition and healing items are limited, pushing cautious aim and route planning.\n\nCombat emphasizes weapon upgrades and enemy crowd control. Ethan can block attacks to reduce damage. Enemy types vary in speed and pressure. Boss encounters are scripted set pieces with clear weak points. Progression through the merchant system improves firepower and inventory.\n\nAtmosphere relies on lighting, sound design, and environmental detail. The village hub changes over time as threats increase. Audio cues warn of danger. Level themes range from classic horror to action-focused segments, maintaining pacing variety.\n\nCharacter upgrades use currency gained from exploration and combat. Inventory management returns as grid-based organization. Crafting supplements supplies but cannot replace poor aim. Weapon attachments alter recoil, reload, and spread.\n\nStory delivery uses cutscenes and collectible files. Dialogue remains concise. Familiar franchise characters appear briefly. Plot twists escalate toward a high-intensity finale. Emotional tone is present, but delivery remains functional for pacing.\n\nResident Evil Village targets players who want hybrid horror and action. It may feel less tense than earlier entries but offers strong atmosphere and progression. Replay value comes from higher difficulties, new game+ upgrades, and extra challenges.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I don't understand how people did not find this game scary because I was genuinely stressed the entire time and my heart rate was skyrocketing. It has become my third favorite Resident Evil game right below RE4 on 1 and RE3 on 2nd.\nEverything from the atmosphere to the story (especially the story) is crafted with so much care and it shows. RE could've been a yearly slop franchise and lost all it's potential *cough* Assassin's Creed *cough* but they stuck to giving fans a top tier experience (now if only they released DMC6 that'd be great).\nThis game was so good that after finishing it 3 days ago, then a second time for the 3 hour speed run Im currently finishing a 3rd playthrough at the Village of Shadows difficulty and there is 0 signs of boredom. Never forgetting this game and overwhelming amount of emotions I felt.\n\nP.S. For the first playthrough I would definitely recommend the \"Hardcore\" difficulty.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Easily in my top 10 favorite games of all time! To be fair, it suffers a bit of an identity crisis when trying to figure out how the game feels throughout the entire story, and I personally dislike the very last section of the game-but it only lasts fora bout 15-20 mins. I LOVEEEEEE the entire rest of the game :) I HIGHLY recommend it. There is ALOT of content for completionists too.\r\n\r\nMy only warning is DO NOT BUY THE DLC. IT's HORRIBLE. Both of the DLC are really bad. The extra story is unbelievably horrible to play and the mechanics suck. The story itself is meh. The dlc for the added items and charms is 100% not worth it. Without spoiling mechanics,  trust me its just not worth it.\r\n\r\nI would recommend always buying base game, though if you like the added survival mode and want extra characters to play as then go ahead and get the dlc.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A first person survival horror game that puts you in Ethan Winters' shoes once again, now more battle hardened than before and better equipped to take down all the evil residents. This time around you have a more open map (or maybe just larger than usual) set in a rural European village with much to admire in terms of scenery, and as these things go you get to explore an absolutely gorgeous gothic castle as well. The design of it all is just superb and the level of graphical fidelity also plays a big part in bringing it out and the atmosphere is often excellent as well.\r\n\r\nIn terms of gameplay, you have exploration, inventory puzzles and combat. The puzzles are as you would expect and engaging if that is your sort of thing. The combat is a usually tense affair that will need you to both act quickly and aim carefully to take down enemies without letting your limited resources run dry. The sound design and the way enemies react to being shot in different body parts does a lot to make the gunplay feel satisfying. You also have an upgrade system for weapons based on getting money from enemies or optional puzzles, sort of like Resident Evil 4. This game's flavour of zombies make for intimidating adversaries, and when it comes to some of the major antagonists they are stylish, terrifying and highly entertaining villians. As far as the story goes it is pretty standard for the series but still engaging and a good reason to partake in all the sci-fi survival horror shenanigans the series is known for.\r\n\r\nOverall I can strongly recommend it to fans of first person shooters and survival horror games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Ethan Is The Most Traumatized Character In Resident Evil[/h1]\n\nThis game is phenomenal. I remember when it released in 2021 and it was big. I played it 2 times at this point and I can say that I am not disappointed by what CAPCOM has done. Resident Evil Village is a huge improvement from Resident Evil 7 Biohazard. This game’s atmosphere was amazing along with the characters and the locations. The boss fights were good but in the Village of Shadows difficulty, its really a hassle getting it done. The 4 lords were great and had amazing character to represent in the game. The Castle Dimitrescu was my favorite location out of the entire game. The details in this game is mind blowing, each level is made with such detail its really great to see it all together. The Donna Beneviento house was so terrifying that I was scared when I took each step in escaping the baby. The doll was creepy and it matched accordingly to the atmosphere and the story. Miranda’s Boss fight was tough but I was able to get it done in my 2nd try on my Village of Shadows difficulty. The music suits accordingly to the game and I love how after each boss is defeated in the game, the game’s menu screen’s background changes to it, a really good detail. The ending was actually sad, but can’t wait to play the DLC of the game. I really liked this game, \nOverall Rating – ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️☆ (9/10)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "After almost 3 years in my library, I finally played it. I didn’t like RE7 at all, but Village was the exact opposite, everything was fixed for me and playing it was a delight. Environments are stunning, loved exploring every corner and it never felt dragged out. Story was nice, though it could’ve been a bit more dense, at least with more notes. So far, this is my Top 2 RE game after RE4R. RE2R is Top 3, because I hated the sewers level a lot.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a careful recommendation, and the main reason is... I can't choose what sort of person to recommend this to. There's such a variety of you, I can't quite pick one.\n\nAs an RE game, it has some of the mechanical hallmarks that you're likely familiar with. Smart ammo preservation, finding key items to progress, combining treasures. It's all there, but the campiness... I can't tell whether it's campy in a new but similar flavor, or not at all.\n\nEthan's such a weird protagonist, being the wimpiest or at least physically weakest protagonist the series has seen, while overcoming some of the worst odds any RE protag has been in. I'd almost call him John McCoolGuyAmerican as a joke, but I have a hard time being really reductive about him. The most precise thing I can say though, is that Ethan's never having a good time, not even when he's just at home being a Daddy. Dude's gonna join Guts in the Can't-Catch-A-Fuckin'-Break club.\n\nAs an FPS, I feel like I am fighting the controls most of the time. I wouldn't say that's a failing on the design, as it seems intentional, meant to ramp up the tension. Ethan's just a civilian using guns well past his competency (even though he's had military training between 7 and 8? or did I just imagine that?), so he's got that awkward ol' weapon sway and imprecision past the first shot. It's annoying, it throws me off and I don't like it, but having tight shooting controls would undermine the atmosphere the game's working so hard to set up. I'm not conflicted on the matter, it should be this way, even if I don't like it.\n\nIt was rather recent (let's say Months) since I finished RE7. As a new experience, I respect its chops but felt some fun was lacking. Turning RE into a straight-played horror was an interesting choice, just too bad I don't care at all for swamp environments in videogames. Personal aesthetic preference notwithstanding, RE8 across the board felt like an improvement on it. RE feels at its best when it throws the surreal at your normal mug, and forces you to deal with it spectacularly. Or as the old adage says: \"When in doubt, C4\". RE8 feels like it's all about that. It's not your 'human gumption' that overcomes these supernatural threats, it's that your contemporary means (ramped up to 11) were enough to deal with the situation. Except for that poison dagger, that just felt a little too convenient if you ask me.\n\nSo I guess I need to review this based on the conclusion of its merit as an RE game, and as a horror fps shooter.\n\nAs a horror shooter, it doesn't keep as organically tense as 7, I feel. Duke's Emporium game-ifies your resource management enough that any time I felt worried was back at the start, when I had little to trade, and the second major section where it was all scares and no combat. After that, tougher enemies are less frightening as more annoying, or a 'problem' for you to either navigate around or deal with directly. They become combat challenges instead, which makes Ethan's poor gun handling stand out more as a sore point then.\n\nAs an RE game? Yeah, RE7 didn't feel like much of an RE game mechanically, and RE8 completely addressed that through all of its improvements. Upgrading guns, unlocking unlimited ammo, simple crafting. Really, it felt as though RE4 had been given the horror treatment and toned down the campiness. Is it bad? Better? It's different, that's what it is.\n\nIs this a good game you should play? That's going to depend what you want out of it, and hopefully the above review helps a little with that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "finished both my all collectibles playthrough and the knife only in 3 hours or less. and this game is stll just straight peak\r\nworth the money (play 7 first of course)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Wary of Capcom finding a winning formula for the series again with 7 and then immediately thinking, \"Let's add a ton of big action setpieces to it so it's like 4,\" but they've done a pretty good job balancing things here.  It's not as fun to replay as the remakes of 2-4, but it's a good time, even if the copy-pasted RE4 inventory management basically requires no input from the player, unless you avoid buying the case upgrades.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Vampire mommy + three hot goth daughters fuck the gameplay this shit is already peak. Far more polished fps aspects compared to 7 and great boss designs. Ethan the goat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a game! This is the perfect title to get your blood rushing, and it also has an engaging story that, no matter how scared you are, will make you come back to it.\n\nThis Resident Evil game is a direct sequel to RE7, so even though you get a little refresher at the beginning, it’s best to have played the previous game for a more immersive experience.\n\nEthan, Mia, and their newborn baby are now living in Romania, and as a Romanian, I loved the little nods to our culture scattered throughout the game; from the design of the houses and the names of foods to the famous Castle Dimitrescu, which seems like a mix of several iconic Romanian castles.\n\nThe action kicks off when Mia is shot, and Chris Redfield and his team show up to take Rose and Ethan away. On the way, the vehicle transporting them crashes, killing everyone except Ethan. Now it’s his duty to find Rose, save her, and get the hell out.\n\nThe game is filled with mystical creatures, from lycans to vampires, ghouls, and all kinds of horrifying mutations. The roster of villains is amazing. Lady Dimitrescu will send shivers down your spine, and after you manage to deal with her, the rest of the family feels like a breeze. It might be because you spend so much time in her castle, and the developers likely shortened the others’ stories in her favour, which I honestly don’t mind. The second scariest villain, after her, is the puppet. Puppets are already creepy, but that chapter of the game will give you nightmares.\n\nThe art is stunning, from the intricate details in the houses to the fluid character animations and breathtaking landscapes, it all feels like a true labour of love. The soundtrack and voice acting are equally spectacular.\n\nIf I compare my experience with RE7, I enjoyed Village more. It felt more forgiving than the previous game, and as someone more invested in story than survival horror mechanics, it was satisfying knowing I had a higher chance of making it through.\n\nIs Resident Evil Village a perfect game? I don’t know. But it’s definitely up there among the best I’ve ever played. Give it a go, it’s an awesome experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's tip top. \n\nThere are precisely two bad moments - the very beginning, during the \"survive waves of lycans for as couple of minutes with limited resources\" bit, and the final boss fight which I do hate. \n\nCastle Dimitrescu? Based.\nBeneviento basement? Based - surprisingly as this was a replay, I was still scared by the sequence even though I knew what was coming.\nThe fishman bit is good. Heisenberg's factory is excellent, including the mech battle that finishes it off. \n\nIt's an incredibly fun game from top to bottom, and even its low points don't detract from it. \n\nThe worst thing about it is that Lady Dimitrescu isn't real, and I'm not acting as her footstool right this moment. \n\nOh also if Chris explained what he was doing at the beginning all the bad stuff wouldn't happen, but that's neither here nor there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you want to say beautiful without saying it,it would be Resident evil Village!\nRecommend!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game. Sometimes repetitive, but the fantastic story and gameplay made this a great RE game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Something about this game that hits a bit more than the other RE's. Perfect balance of combat and storytelling. Twist was insane towards the 3rd act of the game. Ethan Winter's remains as the best protagonist of RE. Horror elements weren't as great as RE2 and 7 but environment creeps kept me engaged enough to enjoy this creation. \n\nRan incredibly well except 1 or 2 glitches (which I usually dont get for RE games) but beyond that, this game gets a 9/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Big giant lady simulator With Kurt Cobain And Ozzy osbourne For fun. Good game if you wanna go ham and go gungho on some annoying old homeless men, And old homeless bald cancer patients. Also Fun to constantly replay Cannot wait for requiem. Thanks capcom",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"This is truly a fantastic game that stands out for its immersive design and captivating gameplay. From the very first moment, it manages to pull you in with its engaging challenges, smooth mechanics, and creative storytelling. Every level feels fresh and exciting, keeping you hooked and eager to explore what comes next. It’s not just entertaining—it’s an experience that keeps your mind active and your curiosity alive. Whether you’re playing casually or diving deep into its world, the game offers something for everyone. A must-try for anyone looking for hours of fun, excitement, and pure engagement.\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Juego de \"Re\" miércoles. La jugábilidad hizo que muchas veces quisiera arrancarme la cabeza, no puede ser que una animación que se repite constantemente dure tanto. Los personajes tienen comportamientos muy predecibles y sin sentido de principio a final, siendo Chris el peor de todos. Y simplemente para rematar, los jefes no son un desafío sin importar la dificultad que seleccionemos, siendo el último menos de lo que se esperaba.\n Es un juego hermoso que claramente toma mucha inspiración de Resident evil \"4\" y \"7\" Tomando la jugábilidad del 7 pero bajando mucho el nivel de los puzzles y haciendo que el avanzar en la historia fuera mucho más fluido como en el 4, incluyendo un mercader, un sistema de tesoros, y una gestión de inventario que resulta muy divertida. Ojalá la saga siga por este camino, porque es un juego que realmente resulta muy interesante, entretenido, y no pega ningún tipo de bajón en cuanto a calidad desde el comienzo. Lo único en lo que no supera a su predecesor \"Resident evil 7\" es en el inicio, pero no porque fuera malo, simplemente la introducción con los Bakers en el 7 es perfecta.\n Uno de mis aspectos favoritos es el tema de los personajes, salvo algunos pocos que no me terminan de encantar. Pero por lo general son buenos, desde los villanos, el mercader, hasta el increíble protagonista que es \"Ethan Winters\" con su personalidad propia y el desarrollo que vemos desde el juego anterior a este, fácilmente uno de mis favoritos. \n Lo unico que puedo agregar es que recomiendo jugarlo en primera persona, porque a pesar de que está la opción de hacerlo en 3ra, se siente como si no estuviera hecho para esto.Lo recomiendo completamente.\n :v",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So I’ve finished this game like three times already, and of course i prefer this game over RE7. Mainly because there’s way more action here. And man, being chased by those three sexy goth girl? that’s just perfect (u know what I mean).\nBut there’s one part that really got under my skin. The Beneviento house, that baby part it was just way too much. Every time I start a new playthrough I just wish I could skip it.\nOther than that though, everything else was great. I mean, come on, it’s Re Series, of course it’s good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its good but the ending is ass and not hyped on rewriting the series",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very story rich, great for pc but I believe a lot of people would prefer playing this game on controle. One of the best, if not the best Resident Evil games out there that I've played so far. Lots of fun achievements to go for. 5/5 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice and beautiful game. Story is interesting. making you want to keep on playing it. Some of the gameplay \r\n interaction and movement is not realistic, but who cares, just want to finish the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I kindly ask you to consider adding Ukrainian language support (at least a text localization). The Ukrainian gaming community is large, passionate, and growing every year. Having our native language available in Resident Evil would significantly enhance immersion and comfort, and it would mean a lot to the thousands of Ukrainian players who appreciate your work.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Insanely good Re, not sure if I like it more or less then the RE2 remake. The game is basically split in different party, and altough I did not enjoy every one to the same amount the game overall is still really fun. A lot of polished content. \nReally recommending the gold edition, ading some really fun new gamemodes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil Village — Fear, Action, and Relentless Suspense\n\nResident Evil Village plunges you into a dark, chilling world where danger lurks around every corner. From fog-covered villages to towering castles, the game keeps players constantly on edge with a mix of terrifying creatures, environmental hazards, and tense encounters.\n\nCombat is precise, engaging, and thrilling. Each weapon and melee attack requires careful aim, timing, and strategy, while challenging enemies and formidable bosses force you to think quickly and manage your resources wisely. Every encounter feels intense, rewarding skill and attention to detail.\n\nExploration is immersive and satisfying. Hidden rooms, collectibles, and environmental storytelling encourage curiosity, while puzzles and traps create moments of tension and reward careful observation. Upgrading weapons and discovering new tools gives a tangible sense of progression and empowerment.\n\nThe story is gripping, dark, and cinematic. Resident Evil Village delivers memorable characters, shocking twists, and a narrative that keeps players invested from start to finish, blending horror and action seamlessly.\n\nVisually, the game is stunning. Detailed environments, realistic lighting, and eerie creature design create a sense of dread and immersion. Combined with a haunting soundtrack, every chase, fight, and moment of quiet tension feels unforgettable.\n\n[h3]Final Verdict:[/h3]\nResident Evil Village is a thrilling survival horror experience that balances combat, exploration, and narrative tension. Intense, immersive, and terrifyingly memorable, it’s a must-play for fans of horror and action.\n\n“A gripping, cinematic journey where every shadow hides danger and every fight tests your skill.”\n\nOverall Rating: ⭐⭐⭐⭐⭐⭐⭐⭐⭐☆ 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil Village is a masterful blend of survival horror, action, and atmospheric storytelling that cements its place as one of the standout entries in the Resident Evil franchise. From the very first moments, the game immerses players in a chillingly detailed village filled with secrets, tension, and unforgettable characters.\r\n\r\nThe graphics are stunning, with meticulously designed environments that range from eerie castles to creepy rural landscapes, each contributing to an oppressive and immersive atmosphere. The attention to detail is remarkable, making every corner of the village feel alive—and potentially deadly.\r\n\r\nGameplay strikes a perfect balance between horror and action. The combat is satisfying, especially with the array of weapons and upgrades available, while resource management keeps the tension high. Puzzles and exploration feel rewarding without ever slowing down the pacing.\r\n\r\nThe villains are memorable, particularly Lady Dimitrescu and her daughters, who provide genuinely terrifying encounters that showcase the game’s ability to mix horror with cinematic flair. Combined with a haunting soundtrack and expertly timed audio cues, the game consistently keeps players on edge.\r\n\r\nNarratively, Resident Evil Village continues the story of Ethan Winters in a way that’s both compelling and emotionally resonant. It ties together elements from previous entries while delivering fresh twists that keep longtime fans invested.\r\n\r\nOverall, Resident Evil Village is a triumph in modern survival horror. It delivers suspense, thrills, and a visually breathtaking world that players won’t soon forget. Whether you’re a veteran of the series or a newcomer, it’s an experience that’s impossible to put down.\r\n\r\nRating: 9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Second favorite Resident Evil game behind RE4. Loved playing through the game will have to go through it again here at some point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game i love it so much i love ethan winters best dad ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is how a Resident Evil game should be.\nLove how the game unlocks as a puzzle and lets you do more and more.\nStoryline is interested and it was well worth my time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "RE Village is quite a bit different from RE 7, being more action-oriented, but it succeeds in what it sets out to do very well. It's not as frightening or menacing as RE 7 overall (except for this one part - which, if you don't know, try not to spoil it for yourself - it's legitimately the scariest part of any game I've ever played), and its setting isn't quite as memorable, there's some great world design, enemy design, and visual design here. There's quite a bit more combat than 7, with a great variety of enemies to fight, and there's some excellent bosses to fight - each of the four lords is very memorable in their own way. I thought the story was good overall, albeit less \"grounded\" than 7 (if the story to 7 could be considered grounded). The final large explorable area was the most memorable for me as the game ramped up the ridiculousness factor with certain enemy types and a very hammy villain - and I personally loved it. Overall, a very enjoyable survival horror game that has me pumped for RE9.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone sensitive to jumpscares, I tested my limits going into this game (I know its the RE with least jumpscares, but still enough to test my limits)\r\nAnd MAN WAS IT WORTH IT. Ive heard so much about this game, and so much about Resident Evil, which I thought wouldnt be for me because I dont dig the classic zombie shooting and not much else.\r\nBut then I saw yet another mention of how this one is the best of the franchise, and decided to dig into the lore, knowing RE7 would be too big of a bite for me (and I was rlly mostly lured by how much more dark fantasy-ish this game is unlike the others)\r\nNeedless to say I LOVED it. Each of the four lords were so complex and different, with a whole vibe of their own, and each respective section of the game was done beautifully. Lady Dimitrescus gothic castle, Donna Benevientos creepy doll house, Moreaus disgusting fishing village, and Heisenbergs steampunk-y factory, all tied together by the haunting village in the foggy mountains... an absolute masterpiece :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark jumpscary great voice acting great looking game. i have finished the first house of the game the castle great enviremont not as detailed like resident evil 2 but great enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "capcom hits again. what can i say. amazing graphics. good combat although they really improved it in the 4 remake. but man where this game shines is its story. although it starts off hot they build it up. its super emotional and cathartic ending for ethan. man ethan. the fucking goat man. all he ever did was put himself on the line for the people he cared about. then in the really well done dlc he just gives some more. a goats work is never done. speaking of the dlc its really good. re7s dlc was more diverse and i think daughters hits something different but between ethans entries and separate ways the dlcs are just as good as the base game since 2017. im REALLY excited for re9. only game imma preorder in years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Resident Evil Village[/b] is the eighth main entry in the franchise and once again delivers top-tier survival horror in first person.\nThe story picks up right after RE7, so it’s highly recommended to play that one first. This time, Ethan finds himself stranded in a remote Eastern European village while trying to save his daughter.\n\nThe gameplay closely follows the foundations of RE7: you manage a small inventory, craft supplies, solve light puzzles and fight your way through a world filled with monstrous creatures and wonderfully unhinged boss encounters. Overall, RE8 is less terrifying than RE7, but it still offers several truly unsettling moments.\n\nThe story is fantastic in my opinion. Sure, there are a few cheesy lines in classic RE fashion, but the emotional payoff they were aiming for works surprisingly well. The ending also delivers a couple of intriguing hints at what future titles might explore.\n\nThe DLC [b]Shadows of Rose[/b] stood out to me the most and even made me tear up, something I never expected from a Resident Evil game. It tries out a few new gameplay ideas that are both bold and satisfying.\n[u]8,5/10[/u]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the best games to have fun with. Amazing sequel story, nice puzzles and exploration. The horror part maybe is a bit less than RE 7. But let's be honest. Ethan WInters is one of the best RE series characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked RE7 you will like RE8. My only complaint is no built in FOV slider. Otherwise, great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game, but a disappointing sequel with mediocre gameplay. It tries to blend survival horror with a horde shooter style but fails to meaningfully combine and execute the aspects that make either genre great, resulting in combat that often feels like it doesn't want you to fully enjoy the game's mechanics beyond the standard enemy manipulation. The horror isn't the focus this time around, but is implemented well, even if it is overall less scary than most RE games. And as far as RE games go, the story is good, the characters are interesting and entertaining, the unlockables are fun, the story dlc is solid, and the Mercenaries mode is action packed as ever. Being a sequel to RE7 that takes heavy inspiration from RE4 and European folklore, it doesn't do justice to any prior material, but does at least have better weapon and enemy variety than RE7, and it never ceases bore the player. If you're interested in RE Village or the Ethan duology, this game is definitely worth buying bundled with RE7 (on at least a 75% sale). Also, hot vampires (extra enjoyable for masochists).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can see classics RE fans not liking this game as much as the early ones but I started out with the original RE4 and RE8 is definitely my favorite of the series. I like the atmosphere and villains of the game. The 2nd boss' area (no spoilers) is by far my favorie and I hope they explore that type of horror more in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game. Good gameplay loop, fantastic art direction, and memorable set pieces. \r\n\r\nThe story is lacking though, so don't expect airtight writing. Also be prepared for some stilted or awkward dialogue here and there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Completed on Xbox Series X.\n\nPlaytime: 8h 35m for base game, 2h 30m for Shadow of Rose DLC.\n\nVillage looks great, plays smoothly, and offers a bigger world with more enemies and weapons, but it loses the grounded, intense horror that made RE7 memorable. The early hours build tension well, yet the game eventually slips into a repetitive loop of “new area → boss → repeat” with dull puzzles and tiring resource management.\n\nIt still has standout moments, strong characters, and excellent technical quality, but the tone is uneven and leans more into RE4-style chaos than RE7’s focused horror.\n\nA stylish, fun sequel but just not as cohesive or impactful as RE7, which remains the stronger game for me.\n\nShadow of Rose has a few cool moments, but it never feels important or fresh. Most areas are reused, the story adds almost nothing, and the shift toward magic powers doesn’t fit Resident Evil’s tone. The gameplay is linear, the writing is weak, and some sections are more frustrating than fun. Rose’s freeze ability is the highlight, but the rest feels like a leftover side chapter. Overall, short and mostly forgettable.\n\nBase Game: https://howlongtobeat.com/user/mentalmynx/reviews/u-80038/1\n\nDLC: https://howlongtobeat.com/user/mentalmynx/reviews/u-114920/1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In another life Ethan and his family are together and living happily. This game ruined me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ethan's whole story arc was perfectly written and it culminated here in the most beautiful way, My favorite game in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a really fun time. Less of a horror experience than 7, but a very fun horror action shooter. Highly recommend. Do everything, you'll have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, I enjoyed so much playing it. I do thank Capcom and all the developers for putting out such precious material, told in an immersive bundle and discover a hole new dept of the story. Especially the part before with the bakers and the follow up developement. Even old chars from RE7 are involved (Evelin) in some kind of the DLC-Story. Which is pretty nice. I did not like the control and settings as often in RE-Games, because it's always the bloody header. I have had it. It's like the developers are undermining my accuracy to aim while they need to switch the camra always on the gore part. But I'm the player, I have a need to survive this mess you left behind to play through. Yes, I don't like rotten teeth in my flesh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]What do you expect from a survival-horror shooter game? [/i] Village manages to do everything in a certain style and quality. Great thrilling moments, lots of action with a wide variety of monsters and many different locations to explore in just 7-8 hours of playtime. But most importantly, this game connects the dots of the series' story and makes a fine conclusion to Biohazard.\n\n[h3] Best One in the Franchise [/h3] \nVillage may not be the one with strongest atmosphere, but it certainly has the best action mechanics and the scariest, PT style horror section. While Biohazard achieves the right dose of thriller, can't maintain it for the rest of the game. But pacing is never the problem with Village. It makes you feel like prey, then hunter, then prey, then hunter... Until a certain point in game where the story began to reveal and it's all you care.\n\n[h3] Apart from RE, what makes RE: Village one of the best in Survival-horror genre?[/h3] \nThis game never bore me, and I think it's very hard for someone who's into this genre to get bored. Simply because, Village never lets you stay too long in the same place, you'll constantly experience new places, enemies, bosses and plots for the story. There are [spoiler]4 lords[/spoiler] before the main enemy in this game, which you see very early, and they have totally different and appropriate places for their personalities. Basically, you'll meet someone new, begin to understand your enemy and its territory while investigating the main plot, along with nicely designed action sequences. And when you finish that part, totally different experience awaits. Sometimes it will be scary, sometimes disgusting, sometimes thrilling, sometimes fun and intriguing, but it will never be the same.\n\n[h3] What About Cons? [/h3] \nThis game doesn't have any major flaws as I see it. It doesn't have constant horror scenes and you probably won't run out of ammo in standard difficulty, but these are personal preferences. I agree that this game could be longer, at least 10-12 hours would really be great. But Village already does a great job and offers variety in weapons, places, bosses, enemies and concludes story in a nice way. There are no meaningless time-spending sections nor rushed plots, so the length is just how it should be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "def not as scary as 7 but still very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit scary, but graphics are amazing, story is enticing, action is plenty !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is awesome, well detailed and I really enjoy playing it. I would totally recommend for the people who like a little horror from time to time and that love wandering around and exploring, basically enjoying the beauty of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never gotten this many shivers playing an ending sequence of a game. Atmosphere and immersion are perfect, and I absolutely love the ending. Best story out of any resident evil game by far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, I like it, but as a RE game... I don't know, I ended the game wishing to play an actual RE game.\nFor me, it's not a good RE experience. Yes, there is evil, yes, there are bioweapons (not zombies this time... kinda), but the game feels a bit like a fantasy, not grounded in reality. Yes, they explain everything in order to feel real, but the explanations are ridiculous.\nI mean, flying dolls, telekinesis, mind control, the \"POWER.\" I don't know, man, it kinda feels like I'm playing a fantasy horror.\nAs I said, it's a good game, I had a great time; it's just very below average as an RE game for me.\nI do recommend it, though, but don't expect to play a classic RE game. I think RE7, from the most recent games, is better than 8 as an RE game, personally.\nAlso, yellow tape/paint is SO FREQUENT here I had to use a mod to remove it, as it was getting ridiculous how many OBVIOUS clues they placed here. They are literally immersion-breaking, making me wonder who the heck put this here of all places. RE8 treats you like a toddler in that regard visually and very obviously, telling you where to go even in the most obvious places. In places where there is no other way and the ladder is clearly visible, they placed neon bright yellow paint on the ladder, in case you're not sure what to do. It's just ridiculous!!! That's not bad game design; it's just bad implementation of a game design—very, very bad.\nIn my opinion, Capcom should put that in accessibility options AS AN OPTION. But it's not; it's the default way to play, with no way to change it other than using a third-party mod.\n\nBut yeah, fun game. Really fun. Welp...im gonna play RE0 now thank you very much.\nAnd im hoping for RE Code Veronica remake soon. Hopefully.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I might be a little emotional with the ending T.T One of those games that you wont any of the story. Should be played alone in the dark room with full blast headphone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story line is just purely amazing, the characters got great lore to them. The scenery is one of the most prettiest I've ever seen. I went through so many emotions while playing it, especially towards the end. I recommend it to anyone who wants to get it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked Resident Evil: Village (RE8). It’s a solid continuation of the Ethan Winters storyline, and what really carries it is the plot, characters, and level design. During my playthrough, I kept getting Resident Evil 4 vibes from the merchant and inventory setup, and heavy House of the Dead energy in Castle Dimitrescu and especially House Beneviento. That scratched a very specific itch for me.\n\nI loved how each major area felt like its own “level” with a distinct tone and playstyle. Finally getting to play the Fetus Monster segment after seeing it a dozen times on YouTube was wild. That motherfucker still got me twice: once right after the first encounter, and again because I didn’t shut the elevator door in time. What an odd way to be surprised by an enemy you already “knew.”\n\nLike RE7, the final stretch felt a bit rushed, but definitely more fleshed out than the previous title. Overall, this game is more accessible and more fun than RE7.\n\nI fully recommend it. Village never pretends to be something it’s not. It’s a fun, polished, spooky-ass ride with over-the-top moments and a pace that never lets you drift. It’s a modern House of the Dead wearing Resident Evil’s skin. If you want a horror game that rewards just showing up, this one fits the bill.\n\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good gunplay, very nice graphics, cool sexy stalker enemy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very iffy thumbs up. A weak title in the series that feels like a slog. Locations feel recycled, from the Village to the Factory (the worst section)\r\n\r\nIt's still Resident Evil, so there's a quality there that is good. But there's much better Resident Evil games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oh village, the 2nd coming of resident evil 4.\nits a great game, but the horror feels like it takes a backseat for a good chunk of the game. Glad to see the heroic culmination of the best dad in resident evil, and how one white IT dude could fight and win against the romanian plauge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not bad. I think I have done most of the stuff you can do in my first run and I have some mixed feelings. It was ups and downs in like no other game and its for sure better than RE7. I gotta say it kinda reminded me of RE4 a bit.\nIm not gonna list pros and cons like i usually do and rather im going topic by topic.\n\n- the graphics of the landscape and buildings looks brilliant and not just because its the most recent RE title but cause it just has these points in your view which i only know from Souls like games. For example the castle always in the background or also the factory has amazing views (idk if i overreacted but the last cutscene looked so weird and bad)\n-puzzle wise it is mostly rlly funny. the marble runs are so cool, the piano playing, the 5 bell room, the numbers through the window, the fire bowl stuff. the doll house thing was a bit too much for me. it doesnt have to be that many different items in a single puzzle\n-the story is in the end a bit weird in my opinion. what we discover about ethan. Just too far fetched. I didnt need that.\n-now i wanna complain about the factory part. it is just not really easy to navigate, the monsters are so annoying to kill and no fun puzzles. the region is a bit unnecessary to me.\n-the bosses are also mixed (not ranked and only the main bosses):\n\n1. The 3 sisters: are a bit weird and were ok but i expected more from that. it is always the same technique to fight them: open the WINDOW and it can get a bit dumb like with the third sister: i opened the roof and she closed it, she stepped under the window, she closed it, i opened it and we repeated all steps.\n\n2. The mistress dimitrescu: It is fun but also a bit repetitive but whats really great here is the whole chase part in the castle\n\n3. The doll: i honostly gotta admit that i didnt know what to do at first and it ruined it a bit. yeah she says \"find me\" but i didnt find her on my first room tour... i had to google but i get the idea\n\n4. The fishguy: best bossfight in the game but not only cause of the fight itself. it is cause of the build up. You have to get the power back on to drain the place while he is chasing you. the main fight is also fun cause you have the acid rain where you have to look for shelter and he can also block your way with the glibber. but you can explode it. And he looks so brilliant with the thousand eyes. dont you just wann kiss him?\n\n5. Heisenbergs buddy: not so good fight. he spawns those douchbags and i dont get one thing. Why does he spawn them when he jumps down again and not just letting him stand on that rock. its crammed and just chaos...\n\n6. Heisenberg: expected more. i just dont get why they made this pile of garbage out of him. i would have enjoyed fighting him normally more. he was such a fine guy with the hammer. (they probably didnt do it cause heisenbergs buddy also has a hammer.) and then you can do that tank action which is satisfying for sure. with the tank it was easy and on foot it was a bit clanky. visually its of course perfect\n\n7. Mirandas morning star dude: i dont know why the fight even exists. So chris can do some stuff? i dont know if i fought it wrong but it was soooo boring and annoying.always dodge get to his back and shoot. its always the same phase and you need so many hits.\n\n8. Miranda: it is a solid bossfight. sometimes its hard to read what attack she is going to do but its good. its not the best final boss but the arena, atmosphere and gameplay were solid and i enjoyed it\n\nit was a roller coaster of emotions in my case. I liked most of it but there were some things that annoyed me: All in all 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm just gonna say. it's the best resident evil game that has ever made.\r\nEvery thing about this game is just 10 out of 10 except reattaching the \r\nhand that's just straight up Bull Shit. Just like the previous game other \r\nthan that I might even say they did a real good job in the level design \r\nthan RE4 and other RE games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story,decent amount of horror to be specific the fucked up looking baby,all time favorite resident evil so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RE8 Village felt like an attempt to re-construct one of their best game in the series. RE4 Remake. However, the only negative thing for me was the fact that it is 60% shorter than RE4. Everything feels super-rushed. \n\nOverall the attention to details is amazing and the immersion is top notch. The story is delivered nicer I think.\n\nThe Village:\n\nThe details are just amazing it really feels like an old Romanian Village, from the muddy roads to the garbage everywhere. \n\nLady Dimitrescu or Feminist  Man-Hating Vampires: \n\nThe Castle is amazingly made and easy to navigate but the whole thing must have taken me like under 2 hours, it was so short...\nI loved how the negative characters were the feminists, first game to fight on woke?\n\nBeneviento:\n\nThis one was one of the best crafted horror sequences in gaming history. Reminds of the start of Outlast 1. Slowly building & under bed hiding locations.\n\nMoreau Swamp \n\nI was impressed by how easy and short this was but the puzzles thingy made it really fun.\n\nStronghold & Factory:\n\nThis one was inspired by the movie \"Frankenstein's Army\" & Wolfenstein 2009? \nThe whole factory is a living hell labyrinth took the longest because I got lost 5 times (first playthrough)\n\nChrist Segment was an epic addition, loved it that finally we have a game where a whole tactical team (Blue Umbrella) comes in to kick-ass. \n\nOverall this game is a must-play. It has some horror elements but main focus is on action. It has everything. But more inclined into action, rather than horror. (Similar to RE4, even tho RE4 was way more creepier overall, it did not have what will await you in Beneviento.)\n\n10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is fun and challenging with a lot of replay value. I had to uninstall it so I would play other games, because if I had a choice, it would be Village. Hunting for achievements, searching for secrets, and trying out new tactics, all while building up your arsenal lent to a great experience over and over and over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game for a resident evil franchise! Already been playing in every difficulty and maxed out every weapon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stunning art and visuals let down by convoluted plot and bland protagonist. The game can be very atmospheric at times, thanks in no small part to well crafted sounds (helps to play at night and with headphones ). As for gameplay, it's mediocre, if you played any of newer RE games, you know what you'll get.\n\n And it may be a small thing, but I find it hillarious that inhabitants of supposedly eastern european village speak with american accents\n\nI think many players will appreciate unlocking model viewer after finishg the game...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its not as good as RE7 but it still is very good with really smooth shooting but the story is just mid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In the case of the Resident Evil series, they tend to have a great story timeline with plenty of combat stirred in. With RE Village, the story is a tad lackluster but the combat and other game play aspects make up for the story deficiencies. There are multiple bosses and multiple \"mini bosses\" throughout the game. Overall, this game feels like any other Resident Evil game and I would definately recommend this game to others.           8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game , with storyline but its a shame its short",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game with a lot of depth, emotional roller coaster, this game will make even the toughest of people shed a tear, the game is made to be like resident evil 4 remake style (you are not stuck in 1 place like resident evil 7 everything revolving around the main house), the ones who decide to play the game i highly recommend getting the shadow of Rose dlc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with plenty of jump scares and medium to difficult puzzles. Really makes you think and very enjoyable game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably in the top 5 maaybe even top 3 of RE.\r\n\r\nThe writing was way better than a most other games, still some flaws but after so many years CAPCOMS writing continues to move forward. It was also cool that small things like, healing and NPC's were worked into the story and meant something. Made everything feel more immersive and thought out. \r\n\r\nIt has all the good things of old re games and new games. Takes what RE7 did and improves. Its also a little different from the other games in the franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely worth a buy and a play, if nothing else while it is on sale. I loved the main campaign, and was very moved at times during the story. I know the look of it may throw some people off, but I assure you, give it a play. You will absolutely not regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well I'm not quite sure with this one.\r\n\r\nIt's clearly a good game with a high production value, and apart from the shoddy HDR implementation the game is technically flawless. \r\nThe question remains: Is it a good RE game? Maybe. It's most certainly a good modern RE game and better than 7, but I think I prefer the old style of RE better.\r\nThe game does that style pretty well up until castle Dimitrescu but falls a part a bit after that. \r\n\r\nPlus every part feels like it was 15-20% longer than it needed to be and the last part of the game is a full blown first person shooter.\r\n\r\nIf you can live with that, get it. If not, play the remakes of the classic style RE games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Village hooked me from the start. The atmosphere and art are stunning, every area has its own personality, and the mix of horror and action works way better than people give it credit for.  A stylish, emotional, constantly engaging ride.\nRecommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "they absolutely nailed the atmosphere, game is solid, nothing new or special about it compared to RE7. My only criticism is that they really need to stop doing the \"activate the power\" puzzles, it got old 10 years ago.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best Resident Evil game in the franchise (by a small margin). Incredible story, near photorealistic visuals (somehow better than RE4R which was made after), and addicting gunplay/gameplay. It has so much replayability and stays fun every time you play it through. The challenges and bonus content add so much to the game in terms of content and progression. They definitely added elements from classic Resident Evil games which were missing in RE7. Full price, on sale, it is worth it either way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] IT'S NEITHER A HORROR, NOR SURVIVAL AND IT IS NOT REALISTIC IN A WAY  [/h1]\n[h2] –PREFACE– [/h2]\nRE7 is one my favorite games and while walking through its sequel i was judging it upon what i have experienced from [b] BIOHAZARD [/b] and what i have expected from real survival-horror game. It disappointed me quite heavily yet still i have felt some joy too. Here are my drawbacks and advantages for the one to decide upon purchasing and consuming this product of video game industry:\n[h3] - - - Drawbacks (Closing my eyes on non-realism, some poor details, arcade-esque gameplay elements and chris chapter) [/h3]\n[olist]\n[*] It is not a survival-horror experience as presented in many summaries, and stealth here is poor.\n[*] Game presents wider areas but there is no freedom thing to it in terms of exploration. It is too predictable, limited, and linear all in sense of story line.\n[*] Blunt puzzles..\n[*] Boss battles are extremely dull & non-original in gameplay terms.\n[*] [h3] DON'T BUY GOLDEN EDITION!! [/h3] Worse dlcs and basically no reason to replay the game after beating it.\n[h3] Shadows of rose DLC [/h3] is reusing of same locations, it has slow and dull gameplay, and it is not scary almost at all, all in one it doesn't worth it, better go watch walkthrough. Though there are couple of moments i liked better than in main game like beneviento basement line and altered version of it which reminded me toy story. \n[h3] Mercenaries Mode [/h3] it is again, reusing same locations, even more gamified experience. It is very simple and not rewarding at all, since i personally didn't like shooting in game that much.\n[hr][/hr]\nAs of other \"bonus\" content, it includes some concepts, lore material and models from winters family RE installments for those who interested in creation, early ideas and games universe generally.\n[/olist]\n[h3] + + + Upsides (Separate plus goes to russian localization and its bad language!) [/h3]\n[olist]\n[*] Locations, their design and scale. It is impressive, epic, various and atmospheric. (+ Photomode is a nice addition for making some shots)\n[*] Characters. Especially villains! Their design, acting, unique traits. Interest was dragging me to their lair for the ultimate meet. Each of them made it to me. (Heisenbergs charisma nailed)\n[*] Tale alike interpretation. It explains many non-realistic points and makes game more nice in sense of dark fantasy adventurous tale. Especially parts with duke reveal the game from this point of view.\n[*] Treasure design and hunting. Interesting addition to the village hub and gameplay generally, yet i think it could be done more intricate, challenging and rewarding.\n[*] Ethans final demise and drama make this game a good movie to me)\n[/olist]\n[h2] –VERDICT– [/h2]\nComparing it to RE7 this one definitely loses on crucial survival-horror aspects and disappoints on expectations from intensity and some gameplay elements. But even though i didn't like relatively big portion of the game, i still think that it continues biohazard very nicely yet differently. Well, counting and analyzing, it is - pretty good [b] action adventure dark fantasy tale alike game [/b] with great visuals, locations, characters, cinematic fluff, and a pinch of horror, if you dare to call it so. My verdict for the [b] RESIDENT EVIL 8: VILLAGE [/b] with all my criticism still:\n[h1] GREAT [/h1]\nP.S. [spoiler] Game seems different and more survival-horror since beginning til some \"too much\" sections of demitrescu castle. One of my favorite episodes in the game is in louisas house. Shortly we see there some survivors, tensity around them and great moment of helenas father turning into werewolf. Then goes garage scene, fire and helenas dramatic fall. I think it was quite promising and properly made but unfortunately the game starts to feel different afterwards.. [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh village, to say that you hold a special place in my heart would GENUINELY be an understatement. This was one of the first few games ever to make me tear, something only The walking dead and God of war managed to do, this is what makes resident evil so far ahead of any other horror franchise, it’s the fact despite being so simple with its stories it’s just so unique and appealing, it draws you in so easily with its vibe I just can’t describe it, despite Ethan not being so deep he’s just such a beautiful written and well put character that makes him so special for me, the things he does just for his family, I fully believe (spoiler): he was dead when Miranda pulled his heart but the cheer will to save his daughter made he keep going and that’s why he sees eve, he was dead and came back instantly for her, the only horror protagonist that I consider up there with Ethan in this regard is Harry. \n\nThere’s lots of goods in this game idk from where to begin, the pacing and gameplay are also beautiful. I love the lvl design and how well installed it to the theme this game is taking compared to 7 especially in the first 2 areas. Castle Demitrescu is such a classic with its re vibe area that reminds me alot of the training facility, but ALOT better. House benviento is also incredible and shows how unhinged village could’ve been if capcom wanted to make this game scary.  \n\nThe First and Second acts shows how capcom can perfectly pace horror and action in one game, the first one being horror and the 2nd being horror and their both nearly as good as one another, I would say Moreau section is just a lil off vibe for me but it’s still decent, the Lycans hideout Carrie’s the 2nd act for me and it’s such an awesome action section. \n\nNot to mention The 3rd act, Heisenbergs factory feels like we went back to the classic RE style with the fun of backtracking and puzzle searching, same with Castle Demi but in a very different vibe, and despite what everyone says I think this is one of the best locations in the series, the enemy variety is great and the puzzles are good, the backtracking is fun and the lvl design is very complex and unique, the bosses takes it down a notch tho because the spinning fan dude is hitting and Heisenberg was a massive disappointment, idk why such a great section had very mediocre bosses, not to say they were bad but they were not as good as they should’ve especially for the 3rd act.\n\nAlso it would’ve been the best if it wasn’t for Chris’s section, it’s literally COD😭 just remove it, it’s such a drag and unfun especially with how atrocious the Urias boss is. Remove it and the game will be so much better, \n\nthe reason why I think the game doesn’t fall off because of Chris is simple, the showdown against Miranda will forever stay as the best finale in any re game for me, it gave me sigrun vibes and in a good way. And that ending… my god what a beautiful conclusion to Ethan’s character, my goat will always be my top 1 fav RE character.\n\nNot to mention a very good DLC that’s very horror focused with more story that gives so much more character depth to Ethan. \n\nOVERALL:\n\nThe Introduction: 9/10 \n\nCastle Demitrescu: 10/10\n\nHouse Benviento: 10/10\n\nThe Swamp: 7/10\n\nLycan’s Hideout: 9/10\n\nHeisenbergs Factory: 9/10\n\nChris’s campaign: 3/10 (literally COD)\n\nThe Ending: 11/10\n\nOverall: 9.5/10\n\nMy 3rd or maybe 2nd fav RE game, will forever be special for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This Is my favorite  Resident Evil game. I love everything about it. You can buy infinite ammo for the weapons separately and you have a lot of goot keybinds. I am recommending but buy it from G2A for a lower price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This may be one of my favorite RE games. Though it was not as scary as its prequel, it certainly had a lot more variety to offer with its gameplay and it was leaning towards a more action style while still maintaining its horror vibe. Its also like a semi open world game where you can roam around the village and find interesting treasures, which I fairly enjoyed hunting for. Its like a homage to all RE games and a very good follow up regarding the story of Ethan winters and how it connects to other RE titles. The game and character designs and visuals were superb as well, and it runs great on the deck. Narrative was also excellent, though it may have dragged on a bit towards the end. The third person setting included with the DLC package can also offer a different playthrough experience, which is a nice option to have. This is a very easy recommend for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I prefer the atmosphere of RE7 more this was still an enjoyable weapon with weapon combat and hunting food for the Duke Monster Hunter style. The new enemy types of werewolves were a welcome change. The story was not the best sadly.. The castle section was the overall strongest portion. The castle and the shadows of Rose DLC were the most engaging for me. Shadows of rose had a silent Hill level horror vibe to it more scary than the main game. The game overall is atleast worth playing once for the gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game and all the other Resident Evil Games. \nI cant wait to play Resident Evil : Reqium",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game to get on sale and play during Halloween season. Starts off a bit weak but gets better once you get further in. EDIT: Forgot to say that you NEED to play RE 7 BEFORE playing this game. This game is a direct sequel and assumes you know what happened in RE 7.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably in my top 3 resident evil games. It's basically just 4 with a first person perspective and a new coat of paint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game has the scary aspect that all resident evil fans wish to see and also has good combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just finished RE7. Bought this after. Love the story and QOL improvements. The Truth I have found it easier than RE7. But still worth playing. Especially if you get get it on a Steam Sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the action in Village more so than RE7. For me this is my favourite RE game to date. It has good replay ability so you can continue improving your weapons with each new game playthrough. I found the HDR was better left off as the picture was always too light even when darkening the image down in the game options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil Village is the 8th entry in the survival-horror series Resident Evil. After the 6th game, which received backlash for not following the series’ survival-horror roots, Capcom decided to make a game with a smaller scope, and one that was more horror focused. That game was Resident Evil 7. It was widely praised, and Capcom had the unenviable task of following it up. Resident Evil Village was their followup.\nI 100% recommend playing Resident Evil 7 before Village. While there is a recap of the story of 7 in Village, you should play it yourself to know the story. It is an incredible game. But this review is about Village, not 7. Is it as good as 7? Is it better perhaps? I guess you’ll have to read this long ass essay.\nNow, if you don’t like reading (like 80% of everyone I’ve met), you can skip to the last paragraph. If you do like reading, here’s my review.\n\nStory\nVillage takes place a couple of years after 7. You still play as Ethan Winters. Mia, Ethan’s wife, is reading a book to Rose, their newborn daughter. It is a local book, as they’ve moved somewhere in Europe. It creeps Ethan out, but evidently not Rose, as she is put to sleep. Just after Ethan puts Rose to sleep, Mia is shot and killed by… Chris Redfield? Without explaining, they capture Rose and a bewildered Ethan. \nEthan wakes up outside a crashed Umbrella van, in a snowy forest in the middle of nowhere. He ventures to a village where all of the residents are evil. There are some who are not, but they’re extremely paranoid. He soon finds out that an epidemic has come over this village, where the people turn into beasts called Lycans. They worship a being known as Mother Miranda as some sort of way to keep them sane. Ultimately, everything goes to shit and Ethan is captured once more, this time by the Lycans. He is then brought in front of Mother Miranda, where four of, seemingly, her children argue on how to kill him. Ethan is chased by Lycans throughout a dungeon after this argument, and he ends up in one of the children’s (Lady Dimitrescu, who you’ve probably already heard of before) castle. Your goal (for now) is to escape Castle Dimitrescu and find Rose.\nThis story has a lot more moving parts than the last story. It’s much more complicated. It also has way more cutscenes than the last game did. It also characterizes Ethan more, where in the last game, he was pretty much just a silent protagonist who would echo your thoughts occasionally, in this game, a crazy development occurred and he actually has a personality. \n\nGameplay\nResident Evil has always been a survival-horror series. Village is no different. You explore the areas, sliming opps, solving puzzles, and being scared, now in the 1st person, just like the last game. Village leans a tad more into the action side of the series than 7 did; it’s not full-blown RE4 levels, but it’s more than 7. The general pace of the game is faster, and I think this is actually worse for the horror experience. You can get away quicker, and the gunplay feels less good as a result. Also, the physics are dumbed down. You can’t shoot off individual body parts like you could in 7. There are also no storage boxes, which I find odd. My last complaint is that cutscenes are often intrusive, like some of them take forever. I get it’s a horror game and it’s about atmosphere, but sometimes I just want to play the game, you know?\nThat seemed negative, but Village gets a lot of things right. For starters, there is a shop system. In 7, there were some cages you could open. Here, a fat man named the Duke sells you things, such as resources, upgrades, and foods, and he can buy various treasures you can collect from enemies. I know this system existed in prior games, but this is my first experience with it, and it’s a welcome addition. Also, the greater focus on action leads to some pretty sick setpieces, one of which you’ll see at the very start of the game. Probably the game’s biggest strength is its exploration. In 7, it would gate certain areas off from you. In Village, while it occasionally does that, you will always be able to return to the areas later. There are a lot more secrets and hidden areas in this one, which is just flat-out cool. They also reworked the inventory system slightly so that key items don’t take up space in your normal inventory. You also have to slide resources around in order to make space. Some people don’t like this, but I think it’s pretty alright.\n\nI’m not sure if I could call either game’s general gameplay loop better than the other. They are separate experiences meant to cater to different parts of their audiences. What I will say, at the very least, is that the gameplay loops are similar enough so that if you liked 7’s, you will like Village’s.\n\nPresentation\nVillage is set in a rural, mountainous area somewhere in Europe, speculated to be Romania, but there’s no way of knowing. Village is beautiful. This is what they’re talking about when they say a “9th-gen game”. All around it’s very pretty. It’s also good at establishing an atmosphere, a lot like its predecessor. It’s odd, because the settings are polar opposites, but its atmosphere feels similar. I hear that Village tries to be 4, which takes place in a similar setting and has a similar atmosphere, so good on you, Capcom.\nI wanted to mention this somewhere, but I didn’t know where, so here it is. In the last game, they never actually showed Ethan’s face, which sort of became a joke in the community, and in this game, they double down on it. There are a handful of renders of him, but his face is always covered or shadowed. I thought that was really funny. This series certainly is good at inside jokes.\nThe sound effects are good, but not as good as the previous game. In 7 they just seemed to stand out more. Here, they’re very solid though, and add to the ambience. There’s very little music, and when there is music, it fits. As for the voice acting, besides for one character, I would say it’s very, VERY good. \nThere’s even a photo mode so you can take cool screenshots of this game and make them like your wallpaper or something.\n\nContent\nAccording to Howlongtobeat.com, RE Village is roughly 10 hours long, which is a good length. There is much more to explore in this one than in 7 though. The new focus on exploration leads to it being much easier and much more fun to dig through and 100%. There are a lot more optional treasures and secrets in the village. It actually does a really good job at keeping those hours distinct, too. Another thing this game (and this series) does well is the pacing. In a 10 hour game, it isn’t too hard to have good pacing, but this one keeps you hooked throughout the whole thing. I was always curious to see what would come next.\nIn the way of story DLC, there’s only 1, being the Winters’ expansion. It’s about 3 hours long. I have not played it, and chances are I won’t, because it costs too much to justify its runtime for me. I hear it reuses lots of areas as well, and the only big difference is it being in a 3rd person camera angle.\nThere are also some side modes, the most well known being Mercenaries. Village’s version of Mercenaries is less replayable than previous iterations of it, but it essentially tasks you with defeating all of the enemies in an area as efficiently as possible. You can play as either Ethan or Chris in the base game, and get more characters with DLC.\nThere are a handful of other DLCs, but I frankly don’t care about them enough to cover them. They aren’t story expansions, so I don’t care. \nThis game has a lot of DLC. But it has a lot of base-game content, as well.\n\nPositives:\n-Incredible atmosphere and setting\n-Fun exploration\n-Intriguing story that characterizes Ethan well\n\nNegatives:\n-Faster gameplay and worse gunplay\n-Long and sometimes obtrusive cutscenes\n\nI’m running out of room. This always happens with me comparing sequels. Good game, maybe better than 7. Buy on sale. Don’t buy with DLC’s, overpriced imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game with thrilling twists scattered throughout the story! I absolutely loved it. Even 4.5 years after it's release, the story still feels fresh and exciting. My only wish would be to be able to return to locations once you finish them to grab items you may have missed... I didn't realise I wouldn't be able to get back to Moreau's reservoir after completing it :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil Village never truly scared me, but its atmosphere helped maintain a constant and strong sense of dread throughout the game. I often found the game extremely easy, with most boss fights feeling like an anticlimactic ammo management simulator rather than true battles to the death. Regardless, the story was excellent and the ending really stuck with me. Definitely worth picking up on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun to play, especially having bonus stuff to play with after finishing the game. tho the FOV sucks and you need to mod the game to up it. overall, really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a great game...i personally enjoyed it more than Biohazard. i beat it like 6 times. it was pretty fun going back and upgrading my weapons/inventory to become op *the S.T.A.K.E. is your best friend* I highly recommend playing Shadows of Rose after completing the main story. there's a sense of closure you get from the dlc that i don't think people should miss out on.\n\nidk which was scarier: the Mia mannequins or the Baby. either way i was left traumatized from both. good luck.\n\noverall, highly recommend. pretty scary. awesome game :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game. The gameplay got better as the game progressed for me. However, the dialogue and story is okay at best. Still worth it if you're an RE fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.  I've been a big fan of the Resident Evil games for a long time and this is probably one of my favorites.  Great story and awesome characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most enticing games I have ever played and I can play it again and again...and never get bored of Lady D and the story of Ethan Winters and Rose;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite RE title. Good story, good jump scares and Castle Dimitrescu is the best place in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Final espectacular para un prota espectacular, DLC el cuál totalmente vale la pena en rebajas. Coge más factores del 4 que de los otros (enfocándose más en la acción, con un mercader y te quitan la caja de objetos) pero una buenísima ejecución como la del 4. Puta Miranda y Redfield ya no parece un cocainómano en este juego.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story was captivating from start to finish; emotional and beautifully written. The ending genuinely moved me, enough to make me buy the DLC right after finishing it. I was particularly impressed by the opulent atmosphere of Castle Dimitrescu; its golden details  were stunning, as well as by how authentic the village felt, a perfect recreation of its real-world inspiration. A visually rich and narratively engaging experience throughout.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is super fun and is underrated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Don't get all of the positive reviews really. When I saw the original trailer for this game I had the expectation that it was gonna be a resident evil game that leaned more into horror (like RE7, given it's a direct sequel), but it only had a couple of \"scary\" sections. Also story/plot is all over the place, but that's not unheard of for a resident evil game. Not a bad game, but not the game I was hoping for",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Is a mix of Resident Evil 4 and 7, but it isn't as good as either with weak story progression and Really BAD plot twist which retcon the RE7 Story. it isn't a bad game. It's just has too many Ideas that most of it are not executed properly. The best parts that game shows its strength is in the first 5 hours of playing it ( especially house beneviento section )",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Honestly the game is got some classic Resident Evil elements, but the story and the first-person view took away a big part of what made the series special.\n\nMaybe the story is just set in a different time, but it really feels like Capcom twisted the story just to fit the changes they wanted to make to the series… changes that no one asked for.\n\nThey replaced the main enemy of the series \"zombies\" with these casual designed monsters, they looks so simple as if they were designed by an amateur designer, with their sounds literally feel like they -devs- were downloaded from some random free sound library on internet. It was both funny and sad watching these monsters climb ropes and jump at me like they were freaking Tarzan.\n\nThe FOV is so narrow that you can barely see your surroundings, which makes you feel lost all the time unlike other decent shooter games, And here’s the good news for people who get motion sickness.. you'll never play this game cause ull get strong headache and eyestain, cause the devs -in their infinite wisdom- didn’t even add a FOV option. They just designed it like this!\nI even tried using reframework to change the FOV and the camera got some glitchs. And when the company “tried to be smart\" they made a third-person option but guess what? you have to pay more for it than the price of the actual game :D\n\nId be more satisfied with the game and would hit the like button if it had a different title like for example \"The Hero Whose Face You'll Never See\". Other than that as a Resident Evil game I wasn’t really happy with it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1]Astaghfirullah[/h1]\n\nDefault FOV is 81 with no slider.\nVignette can't be turned off.\nStuttery unlocked framerate.\n\nThank GOD for REframework, is what you THINK until you play the game itself.\n\n\nThis game fails at everything it sets out to do as a SURVIVAL HORROR game:\n- Generous autosaves, which means no stakes or tension; it's now a legitimate strategy to let yourself be killed to redo encounters. So there is no longer any survival, just horror.\n\n- They made crafting items have infinite inventory capacity, which means you can (and will) have infinite ammo ready to be crafted, even on hardcore difficulty. Meaning there is no survival, just horror. \n\n- The \"horror\" in this game sucks ass. The lycans replacing zombies aren't scary. The main antagonists aren't scary. The sections where they take your guns and go OOOO SCARY isnt scary at all. So there is no horror. There is nothing at all. \n\n- Bonus: The game isnt hard even on hardcore, because the devs assumed you'll play with a controller and then ceased thinking, because this game makes you want to headbang a table with pencils in your nose. \n\nSo, whats left is a horror-themed action game with shitty gunplay, a shitty port, a funny fat guy, and by default an FOV that gives me a bigger headache than the game itself.\n\nPlay RE7 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not like normal resident evil games. \nIt's like it was supposed to be some haunted house game, then rebranded as resident evil.  \nAlso, it has the worst script of all time.  \nNormally I like resident evil, silent hill, etc.  But this is almost unplayable.   \nYou were warned.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much like the last game, this one is just about frustrating you as much as possible. Too many points in the game where there is no clue what to do next, or which way to go. For example, early on there is a stage where an endless wave of monsters are coming at you and you are supposed to run. Where are you supposed to run? Had to wonder around through about 15 deaths before I figured out. That's not fun, its just annoying. I wish these games were playable, they look cool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong this was a good installment to the series and fun to play. However, this game has way too much action and not enough horror. even on my first play through there was only one section that felt even slightly spooky and its a little disappointing.\nYou can get through the game pretty quick even if you go for everything there's some replay value but not a lot \nhowever definitely worth a play if you are a fan of the series or just RE7",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly? This story to me is on the same level as RE6: boring game, nonsense plot, dumb characters, and a campaign that gets super annoying halfway through.\r\n\r\nThey had the brilliant idea of giving Chris that “villain” vibe at the start, which only makes him look like a complete idiot, because he knew Ethan wasn’t just a normal guy after everything that happened in RE7, and even then he refuses to explain anything UNTIL ALMOST THE END OF THE GAME.\r\n\r\nI won’t even get into Miranda’s plot with her “amazing” shapeshifting powers, or Spencer’s letter in her lab that turns him into a clown, because if his whole goal through the entire franchise was immortality, why the hell didn’t he use the damn megamycete if he KNEW it existed? To me, this was Capcom’s horrible attempt to force a connection between this game and Umbrella’s origin story in the dumbest way possible.\r\n\r\nAnd the way they treated Dimitrescu honestly pisses me off too: the entire marketing campaign was built around her and her daughters, just for all of them to die in under three hours of gameplay :D wow, amazing!!!! And now we have to deal with Capcom throwing her skin into Grace in Requiem because they know they threw away all her potential as an actually good villain.\r\n\r\nI didn’t just hate the story, I hated the gameplay too. It was super underwhelming, especially because they removed a mechanic that’s been in the franchise SINCE 2005: the unique weapon system.\r\n\r\nEvery weapon you get after the starting ones (Lemi, M1897, and the M1851) is just flat-out BETTER in every single way. There’s none of that weapon diversity like in Resident Evil 4, where each gun had a UNIQUE ability when fully upgraded, and the stats weren’t always superior. In Village, that just doesn’t exist. After the first playthrough, you never touch the starting weapons again because they’re terrible.\r\n\r\nI really hope they learned from this game’s mistakes and nail it with Requiem, because this franchise has insane potential, but it just gets wasted over and over by mediocre games like this one.\r\n\r\nDon’t even ask me what I think about Rose’s DLC. That thing doesn’t exist, it was just a collective hallucination.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "7 hours in and a key item didnt spawn. completely bricking my first and only play through. games been out for 4 years. so i cant recommend it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After six hours of playing this game a bug occourd, which made all statues in the castle disappear. This means, that progress is no longer possible. The only option for me would be to replay the entire game. This is riddiculus for such an expensive game. Verry sad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Visuals are stunning and atmosphere oppresively gloomy. Overall nice setting for a horror game but that's where the good stuff pretty much ends. \r\n\r\nWithout spoiling anything the story is really and I mean really weak. Deus ex machina moments galore, the plot is obnoxiously contrived to the point of hillarity and don't get me started on the ending (pun intended).\r\n\r\nBoss fights are heavily scripted to the point that it just becomes a trial of error till you find out what the devs wanted you to do. Hell the game even starts with the hardest fight sequence, not even telling you that you have to survive for a certain ammount time. Slogging through it on hardcore almost made me to ask steam for refund. Ultimately I've managed to cheese it by running lycans around a chimney on a rooftop till the timer ran out and the cutscene happened.\r\n\r\nThe game has a built in system of ammo starvation. If you're conservative and hit your shots, then the next ammo pile has 8 rounds instead of 20 in it or maybe an extra enemy spawns making you waste ammo so it's damn if you do and damn if you don't which kinda makes the whole ordeal feel pointless.\r\n\r\nIn the end I was glad that it's over. I didn't care about the protagonist or the villain and I'll probably forget the plot in a week.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's so many features I like in Resident Evil Village, particularly its setting, combat, and visuals, but my enjoyment of it is crippled by its flaws.\n\nThe story and dialog are astoundingly bad and make no sense.  It wouldn't be such a problem if the story was in the background such as with RE 1, but Village keeps putting weight on its narrative foot.  And the writing is not laughably bad, it's just an annoying bad.\n\nI haven't played the previous few RE games so I don't know if this is already a trend, but I am disengaged by the way Village relies on extreme fake stakes and fake harm.\n\nCut scenes will have monsters do shockingly brutal things to the player, then the player walks away with \"merely a flesh wound\".  After the third or forth fatal injury the shock has been lost.\n\nAnd if being effectively immortal isn't enough, so many times the protagonist should have failed his mission but is spared because the villains have contrived idiocy.\n\nEthan has enough plot armor to swallow a nuke.\n\nHaving auto-regeneration in a Survival Horror game takes both the survival and the horror out of the gameplay.  There's no better way to remove tension then by allowing players to tank damage with no repercussions.\n\nWhile RE games tend to be fairly linear, the ones I've played did a good job of hiding it and making the player feel in control.  Village feels like a bait-and-switch, where its layout appears non-linear but is gated to be linear.  Part of the problem is with Village's \"theme-park\" layout with separate lands, it's like a Mega Man game without being able to choose which level to play next.\n\nI'm not a big fan of boss battles so I am biased, but for me Village's boss battles are an annoying tangent.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game fucking sucks and is incredibly unfun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game crashes every 10 minutes. And after the Castle part of this game, it falls off a cliff.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not like Resident Evil 5 and 6.\nNot enough kililng and too much talking and thinking. I ended up watching Cutscenes Movie from YouTube instead of playing the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game. Unclear objectives. Lots of backtracking and wandering around to find obscure locations. Loss of progress if you aren't near a save point and need/want to quit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't run it and steam won't let me get a refund because I installed it overnight and it launching while my computer was asleep counted as 9 hours of playtime. Okay game though, but steam support is horrible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game in theory is good, but it clearly has a way that players are \"supposed\" to play. If you don't do things in the exact order it wants you to you get locked out and cannot go back. I didn't know in the factory that I wasn't supposed to go through the small door in the ventilation duct without doing something else first and now I am locked there with no way out. I hadn't made the key to the next door yet because I didn't know I needed to yet and I had saved over my old save when I brought up the Duke. What a horrible design, I spend 15 hours playing this to not even be able to finish. 1/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like it but im having problems trying to finish the first thing when you get to the villege without my game crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have been a Resident Evil fan ever since I played Resident Evil 3 for the first time. Always preordering the games, however they first lost me when Resident evil 6 came out. Then again with Resident Evil 3. After having avoided this title for a few years, I decided to give it a go....\n\nHonestly, I haven't been so disappointed with a Resident Evil title since Resident Evil 6...\n\n**SPOILERS**\n\n\n\n\n\n\n\nSo the game does start out pretty dang strong. Lady Dimitrescu and the overall castle was an absolute joy. However, everything afterwards is a sharp decline in quality. I honestly couldn't care less about any of her other siblings and the puzzles within the puppet house was the absolute most enraging I have ever been while playing a game before!!! I'm a survival horror junkie!! I love puzzles!! But those were ridiculous.\n\nAlso, the entire game is like one massive maze. Where I have to keep constantly openeing a map just to take a few steps. Like was there that little thought put into level design? I mean really? Plus the enemies ended up being a lot easier than I expected. I wound up just defaulting to my knife most of the time....\n\nAnd then of course the whole Chris angle too.....honestly I'm so sick and tired of seeing him. Give me someone else for a change. He has absolutely zero personality, oh but they did make him into a major a**hole in this game so that's some development at least!\n\nI also would like to end this with the absolute biggest sin in the game! The massive amount of indoor plants with absolutely zero windows! I don't know why but that really took me out of the game...\n\nThankfully I played the Resident Evil 4 Remake before this one, just get that one. While playing this game I just wanted to play Resident Evil 4 instead, it did it all better!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "- poor gameplay with ultra slow movement\r\n- strictly linear with invisible barriers all over the place\r\n- 'difficult' enemies are bullet sponges\r\n- lack of horror elements\r\n- boring story",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Obviously not a bad game, but there are SO many annoying things going on here for me personally. \n\n- Lycans are very irritating (and quite a few other enemies), they grab you, throw you on the ground and attack you, so disruptive!! Just hurt me and let me move on with my day lol.\n\n- Difficulty, playing on Hardcore, and I expected it to be hard, but sometimes it is just silly how much health some enemies have!! First segment of the game, when you have very few bullets and no upgrades took me like 40 minutes, I don't see how you make that decision, and not equip the player better, it's just not fun, there is a fine line between Hard, and bs. And Ethan runs like a 5 year old. He's so stupidly slow. \nThe werewolves (third one you fight). A rough estimate, 2 mines,  3 mag bullets, 10 shotty, 5 SR, and a few pistol bullets. And the fight itself is just not fun, run around like an idiot hoping it doesn't jump you (I know and I used the flour bags, actually useful). \nHarder enemies are just bullet sponges unfortunately, some more than others. \nI know, \"play on lower difficulty\", but then it would have actually been too easy + I got the Lady on like 3rd try-ish, the girls 2nd or 3rd, too. Autosave is bad in a few locations, wish devs would tell the difference between hard and time wasting. \n\n- Now, another big one, guarding. It's SO good, it negates insane amount of damage, but you have to do it before you are hit (I know) but I mean like, anticipate the hit ??! I have guarded exactly the same time I am getting hit SO many times and nothing, instead of having Ethan actually push the enemy then or do something, nope, doesn't work. Not a fan of that. It takes a lot away from it, because if I know I am going to get hit, I'll try to run, only good obviously when you can't run, but there is very few situations and places I didn't have enough space to run. Face tanking is NOT my first instinct, ever lol.\n\n- Moreau's fight is an abomination.\n\n- I want to nit-pick a little, I shouldn't have to look up how to change ammo on weapon, I shouldn't press \"Quit - Game' to then go back to main menu, press Enter, then Del then Yes. Needs a map lol.\n- Can't reload save after you hit ESC ???!! HOW do programmers at Capcom manage to do the weirdest decisions? \n- You open the menu to craft, and you return to a complete halt, getting you killed.\n- One of the daughters, \"Let me give you a tour of the place\", I immediately run back to safe room, and I miss the tour :( lol.\n- Another one, if the Lady sees you while roaming and follows you, then the segment with Cassandra upstairs doesn't happen (when she is the only one left). They break their own game rofl.\n- I have had between 100k - 200k for most of my time after the village opened up (now going to 4th major boss), I know they don't want you to upgrade weapons too much, and buy too many bullets, etc, but it's disappointing to have that much money, be excited to spend it but there is nothing to spend it on. Oh, so the plan is to throw a couple weapons at the end of the game and stupidly raise prices of upgrades, OK. (I had 500k then).\n- If whoever designed the last Labyrinth \"Puzzle\" could go ahead and NEVER do a \"puzzle\" again, the world would be a better place. Difficult and you can't see anything, excellent \"puzzle\" design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Starts good then gets progressively worse and worse",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terribly ported. It's like they never played a game on PC before...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks. dont play this. doesnt even feel like resident evil",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i  can not reconfigure movement  keys to the mouse , i ve asked for a refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is the Heisenberg battle 10,000,000 hours long ???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Glues his hand on with some herb juice, Cmon !!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i wish they would go back to their roots, feels like magical bs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is soo bad!!!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not my Resident Evil",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it was ight",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too scaryyy",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "scary",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get all of the positive reviews really. When I saw the original trailer for this game I had the expectation that it was gonna be a resident evil game that leaned more into horror (like RE7, given it's a direct sequel), but it only had a couple of \"scary\" sections. Also story/plot is all over the place, but that's not unheard of for a resident evil game. Not a bad game, but not the game I was hoping for",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The default FOV is absolutely horrible and the only way to fix this is to mod it.. couldn't get myself to play more than the prologue because of this. Crazy how there is no FOV slider for a game like this.\r\n\r\nRefunded.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Is a mix of Resident Evil 4 and 7, but it isn't as good as either with weak story progression and Really BAD plot twist which retcon the RE7 Story. it isn't a bad game. It's just has too many Ideas that most of it are not executed properly. The best parts that game shows its strength is in the first 5 hours of playing it ( especially house beneviento section )",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Honestly the game is got some classic Resident Evil elements, but the story and the first-person view took away a big part of what made the series special.\n\nMaybe the story is just set in a different time, but it really feels like Capcom twisted the story just to fit the changes they wanted to make to the series… changes that no one asked for.\n\nThey replaced the main enemy of the series \"zombies\" with these casual designed monsters, they looks so simple as if they were designed by an amateur designer, with their sounds literally feel like they -devs- were downloaded from some random free sound library on internet. It was both funny and sad watching these monsters climb ropes and jump at me like they were freaking Tarzan.\n\nThe FOV is so narrow that you can barely see your surroundings, which makes you feel lost all the time unlike other decent shooter games, And here’s the good news for people who get motion sickness.. you'll never play this game cause ull get strong headache and eyestain, cause the devs -in their infinite wisdom- didn’t even add a FOV option. They just designed it like this!\nI even tried using reframework to change the FOV and the camera got some glitchs. And when the company “tried to be smart\" they made a third-person option but guess what? you have to pay more for it than the price of the actual game :D\n\nId be more satisfied with the game and would hit the like button if it had a different title like for example \"The Hero Whose Face You'll Never See\". Other than that as a Resident Evil game I wasn’t really happy with it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Ima get a lot of angry comments but I think this is the more disappointing RE games in the series I was coming in hoping for another horror focus game like RE7 which I love that game and for the first few hours I was enjoying it but after the dollhouse area the game definitely took more of a action turn which I started to feel underwhelmed all away to the end and the story isn’t too bad but it has plot holes but I will praise the game for the gameplay it is really fun the map is also beautiful and the designs for the enemies is spectacular and I am so glad Ethen VA did a better job since he sounded so bored at 7…..overall not a bad game at all but I was just disappointed it didn’t capture what I like about 7 I hope 9 does a better job",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Imma be frank, this isn't it. It isn't RE6 bad, but it just doesn't work. They tried to mix RE7 (great game) with RE4 (also great game) but it doesn't work because both are completely different game styles. You can't be a slow paced survival horror game AND an action horror game. So that leaves us with this poorly paced mess of a game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h1]Astaghfirullah[/h1]\n\nDefault FOV is 81 with no slider.\nVignette can't be turned off.\nStuttery unlocked framerate.\n\nThank GOD for REframework, is what you THINK until you play the game itself.\n\n\nThis game fails at everything it sets out to do as a SURVIVAL HORROR game:\n- Generous autosaves, which means no stakes or tension; it's now a legitimate strategy to let yourself be killed to redo encounters. So there is no longer any survival, just horror.\n\n- They made crafting items have infinite inventory capacity, which means you can (and will) have infinite ammo ready to be crafted, even on hardcore difficulty. Meaning there is no survival, just horror. \n\n- The \"horror\" in this game sucks ass. The lycans replacing zombies aren't scary. The main antagonists aren't scary. The sections where they take your guns and go OOOO SCARY isnt scary at all. So there is no horror. There is nothing at all. \n\n- Bonus: The game isnt hard even on hardcore, because the devs assumed you'll play with a controller and then ceased thinking, because this game makes you want to headbang a table with pencils in your nose. \n\nSo, whats left is a horror-themed action game with shitty gunplay, a shitty port, a funny fat guy, and by default an FOV that gives me a bigger headache than the game itself.\n\nPlay RE7 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not like normal resident evil games. \nIt's like it was supposed to be some haunted house game, then rebranded as resident evil.  \nAlso, it has the worst script of all time.  \nNormally I like resident evil, silent hill, etc.  But this is almost unplayable.   \nYou were warned.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much like the last game, this one is just about frustrating you as much as possible. Too many points in the game where there is no clue what to do next, or which way to go. For example, early on there is a stage where an endless wave of monsters are coming at you and you are supposed to run. Where are you supposed to run? Had to wonder around through about 15 deaths before I figured out. That's not fun, its just annoying. I wish these games were playable, they look cool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong this was a good installment to the series and fun to play. However, this game has way too much action and not enough horror. even on my first play through there was only one section that felt even slightly spooky and its a little disappointing.\nYou can get through the game pretty quick even if you go for everything there's some replay value but not a lot \nhowever definitely worth a play if you are a fan of the series or just RE7",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly? This story to me is on the same level as RE6: boring game, nonsense plot, dumb characters, and a campaign that gets super annoying halfway through.\r\n\r\nThey had the brilliant idea of giving Chris that “villain” vibe at the start, which only makes him look like a complete idiot, because he knew Ethan wasn’t just a normal guy after everything that happened in RE7, and even then he refuses to explain anything UNTIL ALMOST THE END OF THE GAME.\r\n\r\nI won’t even get into Miranda’s plot with her “amazing” shapeshifting powers, or Spencer’s letter in her lab that turns him into a clown, because if his whole goal through the entire franchise was immortality, why the hell didn’t he use the damn megamycete if he KNEW it existed? To me, this was Capcom’s horrible attempt to force a connection between this game and Umbrella’s origin story in the dumbest way possible.\r\n\r\nAnd the way they treated Dimitrescu honestly pisses me off too: the entire marketing campaign was built around her and her daughters, just for all of them to die in under three hours of gameplay :D wow, amazing!!!! And now we have to deal with Capcom throwing her skin into Grace in Requiem because they know they threw away all her potential as an actually good villain.\r\n\r\nI didn’t just hate the story, I hated the gameplay too. It was super underwhelming, especially because they removed a mechanic that’s been in the franchise SINCE 2005: the unique weapon system.\r\n\r\nEvery weapon you get after the starting ones (Lemi, M1897, and the M1851) is just flat-out BETTER in every single way. There’s none of that weapon diversity like in Resident Evil 4, where each gun had a UNIQUE ability when fully upgraded, and the stats weren’t always superior. In Village, that just doesn’t exist. After the first playthrough, you never touch the starting weapons again because they’re terrible.\r\n\r\nI really hope they learned from this game’s mistakes and nail it with Requiem, because this franchise has insane potential, but it just gets wasted over and over by mediocre games like this one.\r\n\r\nDon’t even ask me what I think about Rose’s DLC. That thing doesn’t exist, it was just a collective hallucination.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "7 hours in and a key item didnt spawn. completely bricking my first and only play through. games been out for 4 years. so i cant recommend it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After six hours of playing this game a bug occourd, which made all statues in the castle disappear. This means, that progress is no longer possible. The only option for me would be to replay the entire game. This is riddiculus for such an expensive game. Verry sad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Visuals are stunning and atmosphere oppresively gloomy. Overall nice setting for a horror game but that's where the good stuff pretty much ends. \r\n\r\nWithout spoiling anything the story is really and I mean really weak. Deus ex machina moments galore, the plot is obnoxiously contrived to the point of hillarity and don't get me started on the ending (pun intended).\r\n\r\nBoss fights are heavily scripted to the point that it just becomes a trial of error till you find out what the devs wanted you to do. Hell the game even starts with the hardest fight sequence, not even telling you that you have to survive for a certain ammount time. Slogging through it on hardcore almost made me to ask steam for refund. Ultimately I've managed to cheese it by running lycans around a chimney on a rooftop till the timer ran out and the cutscene happened.\r\n\r\nThe game has a built in system of ammo starvation. If you're conservative and hit your shots, then the next ammo pile has 8 rounds instead of 20 in it or maybe an extra enemy spawns making you waste ammo so it's damn if you do and damn if you don't which kinda makes the whole ordeal feel pointless.\r\n\r\nIn the end I was glad that it's over. I didn't care about the protagonist or the villain and I'll probably forget the plot in a week.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's so many features I like in Resident Evil Village, particularly its setting, combat, and visuals, but my enjoyment of it is crippled by its flaws.\n\nThe story and dialog are astoundingly bad and make no sense.  It wouldn't be such a problem if the story was in the background such as with RE 1, but Village keeps putting weight on its narrative foot.  And the writing is not laughably bad, it's just an annoying bad.\n\nI haven't played the previous few RE games so I don't know if this is already a trend, but I am disengaged by the way Village relies on extreme fake stakes and fake harm.\n\nCut scenes will have monsters do shockingly brutal things to the player, then the player walks away with \"merely a flesh wound\".  After the third or forth fatal injury the shock has been lost.\n\nAnd if being effectively immortal isn't enough, so many times the protagonist should have failed his mission but is spared because the villains have contrived idiocy.\n\nEthan has enough plot armor to swallow a nuke.\n\nHaving auto-regeneration in a Survival Horror game takes both the survival and the horror out of the gameplay.  There's no better way to remove tension then by allowing players to tank damage with no repercussions.\n\nWhile RE games tend to be fairly linear, the ones I've played did a good job of hiding it and making the player feel in control.  Village feels like a bait-and-switch, where its layout appears non-linear but is gated to be linear.  Part of the problem is with Village's \"theme-park\" layout with separate lands, it's like a Mega Man game without being able to choose which level to play next.\n\nI'm not a big fan of boss battles so I am biased, but for me Village's boss battles are an annoying tangent.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game fucking sucks and is incredibly unfun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game crashes every 10 minutes. And after the Castle part of this game, it falls off a cliff.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not like Resident Evil 5 and 6.\nNot enough kililng and too much talking and thinking. I ended up watching Cutscenes Movie from YouTube instead of playing the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game. Unclear objectives. Lots of backtracking and wandering around to find obscure locations. Loss of progress if you aren't near a save point and need/want to quit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't run it and steam won't let me get a refund because I installed it overnight and it launching while my computer was asleep counted as 9 hours of playtime. Okay game though, but steam support is horrible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game in theory is good, but it clearly has a way that players are \"supposed\" to play. If you don't do things in the exact order it wants you to you get locked out and cannot go back. I didn't know in the factory that I wasn't supposed to go through the small door in the ventilation duct without doing something else first and now I am locked there with no way out. I hadn't made the key to the next door yet because I didn't know I needed to yet and I had saved over my old save when I brought up the Duke. What a horrible design, I spend 15 hours playing this to not even be able to finish. 1/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like it but im having problems trying to finish the first thing when you get to the villege without my game crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have been a Resident Evil fan ever since I played Resident Evil 3 for the first time. Always preordering the games, however they first lost me when Resident evil 6 came out. Then again with Resident Evil 3. After having avoided this title for a few years, I decided to give it a go....\n\nHonestly, I haven't been so disappointed with a Resident Evil title since Resident Evil 6...\n\n**SPOILERS**\n\n\n\n\n\n\n\nSo the game does start out pretty dang strong. Lady Dimitrescu and the overall castle was an absolute joy. However, everything afterwards is a sharp decline in quality. I honestly couldn't care less about any of her other siblings and the puzzles within the puppet house was the absolute most enraging I have ever been while playing a game before!!! I'm a survival horror junkie!! I love puzzles!! But those were ridiculous.\n\nAlso, the entire game is like one massive maze. Where I have to keep constantly openeing a map just to take a few steps. Like was there that little thought put into level design? I mean really? Plus the enemies ended up being a lot easier than I expected. I wound up just defaulting to my knife most of the time....\n\nAnd then of course the whole Chris angle too.....honestly I'm so sick and tired of seeing him. Give me someone else for a change. He has absolutely zero personality, oh but they did make him into a major a**hole in this game so that's some development at least!\n\nI also would like to end this with the absolute biggest sin in the game! The massive amount of indoor plants with absolutely zero windows! I don't know why but that really took me out of the game...\n\nThankfully I played the Resident Evil 4 Remake before this one, just get that one. While playing this game I just wanted to play Resident Evil 4 instead, it did it all better!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "- poor gameplay with ultra slow movement\r\n- strictly linear with invisible barriers all over the place\r\n- 'difficult' enemies are bullet sponges\r\n- lack of horror elements\r\n- boring story",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Obviously not a bad game, but there are SO many annoying things going on here for me personally. \n\n- Lycans are very irritating (and quite a few other enemies), they grab you, throw you on the ground and attack you, so disruptive!! Just hurt me and let me move on with my day lol.\n\n- Difficulty, playing on Hardcore, and I expected it to be hard, but sometimes it is just silly how much health some enemies have!! First segment of the game, when you have very few bullets and no upgrades took me like 40 minutes, I don't see how you make that decision, and not equip the player better, it's just not fun, there is a fine line between Hard, and bs. And Ethan runs like a 5 year old. He's so stupidly slow. \nThe werewolves (third one you fight). A rough estimate, 2 mines,  3 mag bullets, 10 shotty, 5 SR, and a few pistol bullets. And the fight itself is just not fun, run around like an idiot hoping it doesn't jump you (I know and I used the flour bags, actually useful). \nHarder enemies are just bullet sponges unfortunately, some more than others. \nI know, \"play on lower difficulty\", but then it would have actually been too easy + I got the Lady on like 3rd try-ish, the girls 2nd or 3rd, too. Autosave is bad in a few locations, wish devs would tell the difference between hard and time wasting. \n\n- Now, another big one, guarding. It's SO good, it negates insane amount of damage, but you have to do it before you are hit (I know) but I mean like, anticipate the hit ??! I have guarded exactly the same time I am getting hit SO many times and nothing, instead of having Ethan actually push the enemy then or do something, nope, doesn't work. Not a fan of that. It takes a lot away from it, because if I know I am going to get hit, I'll try to run, only good obviously when you can't run, but there is very few situations and places I didn't have enough space to run. Face tanking is NOT my first instinct, ever lol.\n\n- Moreau's fight is an abomination.\n\n- I want to nit-pick a little, I shouldn't have to look up how to change ammo on weapon, I shouldn't press \"Quit - Game' to then go back to main menu, press Enter, then Del then Yes. Needs a map lol.\n- Can't reload save after you hit ESC ???!! HOW do programmers at Capcom manage to do the weirdest decisions? \n- You open the menu to craft, and you return to a complete halt, getting you killed.\n- One of the daughters, \"Let me give you a tour of the place\", I immediately run back to safe room, and I miss the tour :( lol.\n- Another one, if the Lady sees you while roaming and follows you, then the segment with Cassandra upstairs doesn't happen (when she is the only one left). They break their own game rofl.\n- I have had between 100k - 200k for most of my time after the village opened up (now going to 4th major boss), I know they don't want you to upgrade weapons too much, and buy too many bullets, etc, but it's disappointing to have that much money, be excited to spend it but there is nothing to spend it on. Oh, so the plan is to throw a couple weapons at the end of the game and stupidly raise prices of upgrades, OK. (I had 500k then).\n- If whoever designed the last Labyrinth \"Puzzle\" could go ahead and NEVER do a \"puzzle\" again, the world would be a better place. Difficult and you can't see anything, excellent \"puzzle\" design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Starts good then gets progressively worse and worse",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terribly ported. It's like they never played a game on PC before...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks. dont play this. doesnt even feel like resident evil",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i  can not reconfigure movement  keys to the mouse , i ve asked for a refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is the Heisenberg battle 10,000,000 hours long ???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Glues his hand on with some herb juice, Cmon !!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i wish they would go back to their roots, feels like magical bs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is soo bad!!!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not my Resident Evil",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it was ight",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too scaryyy",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "scary",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly the game is got some classic Resident Evil elements, but the story and the first-person view took away a big part of what made the series special.\n\nMaybe the story is just set in a different time, but it really feels like Capcom twisted the story just to fit the changes they wanted to make to the series… changes that no one asked for.\n\nThey replaced the main enemy of the series \"zombies\" with these casual designed monsters, they looks so simple as if they were designed by an amateur designer, with their sounds literally feel like they -devs- were downloaded from some random free sound library on internet. It was both funny and sad watching these monsters climb ropes and jump at me like they were freaking Tarzan.\n\nThe FOV is so narrow that you can barely see your surroundings, which makes you feel lost all the time unlike other decent shooter games, And here’s the good news for people who get motion sickness.. you'll never play this game cause ull get strong headache and eyestain, cause the devs -in their infinite wisdom- didn’t even add a FOV option. They just designed it like this!\nI even tried using reframework to change the FOV and the camera got some glitchs. And when the company “tried to be smart\" they made a third-person option but guess what? you have to pay more for it than the price of the actual game :D\n\nId be more satisfied with the game and would hit the like button if it had a different title like for example \"The Hero Whose Face You'll Never See\". Other than that as a Resident Evil game I wasn’t really happy with it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Don't get all of the positive reviews really. When I saw the original trailer for this game I had the expectation that it was gonna be a resident evil game that leaned more into horror (like RE7, given it's a direct sequel), but it only had a couple of \"scary\" sections. Also story/plot is all over the place, but that's not unheard of for a resident evil game. Not a bad game, but not the game I was hoping for",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The default FOV is absolutely horrible and the only way to fix this is to mod it.. couldn't get myself to play more than the prologue because of this. Crazy how there is no FOV slider for a game like this.\r\n\r\nRefunded.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Is a mix of Resident Evil 4 and 7, but it isn't as good as either with weak story progression and Really BAD plot twist which retcon the RE7 Story. it isn't a bad game. It's just has too many Ideas that most of it are not executed properly. The best parts that game shows its strength is in the first 5 hours of playing it ( especially house beneviento section )",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "*Only Recommended for People who are entirely blind heading into this game*\n*Spoiler Warning*\n\nAs someone who has 100%'ed almost every RE Game (Besides RE 1, 5 and 6) this game also just quite frankly is dissapointing, unlike RE7, this game has almost 0 atmophsere, which is funny considering it's the sequal to one of the most scary and haunting RE games made, this games entire premise is just big tall hot vampire women, it gives Far Cry 3 vibes after Vaas is killed, expect she isn't even played well, just overall sucky character design, as she is hands down the main drawing point of this game and it shows. Heisenburg is a close second, However has a piss easy boss fight and you never seen him during the middle of the game (Besides one early-game cutscene, Ethan as a character sucks, mainly due to his extreme use of Jason Born one-liners (God knows where the confidence came from) that makes him feel generic video game character 66, even in the 3rd person mode they added he has 0 life, and makes it extremely hard to put yourself in the shoes of the character (Something I feel RE games have done very well, both allowing you to imagine yourself in them aswell as enjoy they as their own.) The Shadow of Rose DLC is fucking appaling, skipped every single cutscene and if there was no achievement linked to the completion of the \"DLC\" I would've never touched it. Overall this game suffers from major identity crisis, attempting to be a Action almost loot and shooter mixed with the horrid RE elements other games suffer from, aswell as not having an engaging story plot due to the lack of care most people have for Ethan Winters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ima get a lot of angry comments but I think this is the more disappointing RE games in the series I was coming in hoping for another horror focus game like RE7 which I love that game and for the first few hours I was enjoying it but after the dollhouse area the game definitely took more of a action turn which I started to feel underwhelmed all away to the end and the story isn’t too bad but it has plot holes but I will praise the game for the gameplay it is really fun the map is also beautiful and the designs for the enemies is spectacular and I am so glad Ethen VA did a better job since he sounded so bored at 7…..overall not a bad game at all but I was just disappointed it didn’t capture what I like about 7 I hope 9 does a better job",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Imma be frank, this isn't it. It isn't RE6 bad, but it just doesn't work. They tried to mix RE7 (great game) with RE4 (also great game) but it doesn't work because both are completely different game styles. You can't be a slow paced survival horror game AND an action horror game. So that leaves us with this poorly paced mess of a game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The short and dirty for this game is that it's really well made, and really boring. Resident evil as a franchise is torn between the classic puzzle solving, exploration, and inventory management survival horror of the ps1 era games and the action horror of post resident evil 4 until RE 7 went back to survival horror. This game tries to pay homage to both eras with middling success. \n\nOn the classic survival horror side: Village has maps that slowly open up and loop back to earlier sections as you obtain more puzzle items and keys. The problem is, with the exception of the main hub area, that the maps are too short and basic due to this game being split up into different sections that all have different vibes that they're going for. You don't have much time to really familiarize yourself with the layout of the level before being pushed into the next gameplay chapter. The puzzles are also very basic.\n\nOn the action horror side: Village pays a lot of homage to RE 4. You have upgradable weapons, an eccentric merchant, and a moment early in the game that is very reminiscent of the opening segment of RE 4. The problem is the combat isn't very good. Guns have minimal impact and village doesn't have the arcade-y movement and melee options from RE 4. You just shoot enemies until they're dead.\n\nThe game does have good parts, the hub area you revisit between main segments is the highlight of the game as it slowly opens up each time you revisit it. I also won't go into spoilers, but there is a segment in this game that probably the scariest the franchise has ever been. unfortunately, this part is a slog on replays.\n\nBuy on a deep sale, or better yet replay RE 4 or its remake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game crashes when playing the campaign it. Mercenary works fine but I have not been able to get through the into of the campaign, no matter what I do it just won’t work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game. but after a while, I just got irritated with the game controls.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Astaghfirullah[/h1]\n\nDefault FOV is 81 with no slider.\nVignette can't be turned off.\nStuttery unlocked framerate.\n\nThank GOD for REframework, is what you THINK until you play the game itself.\n\n\nThis game fails at everything it sets out to do as a SURVIVAL HORROR game:\n- Generous autosaves, which means no stakes or tension; it's now a legitimate strategy to let yourself be killed to redo encounters. So there is no longer any survival, just horror.\n\n- They made crafting items have infinite inventory capacity, which means you can (and will) have infinite ammo ready to be crafted, even on hardcore difficulty. Meaning there is no survival, just horror. \n\n- The \"horror\" in this game sucks ass. The lycans replacing zombies aren't scary. The main antagonists aren't scary. The sections where they take your guns and go OOOO SCARY isnt scary at all. So there is no horror. There is nothing at all. \n\n- Bonus: The game isnt hard even on hardcore, because the devs assumed you'll play with a controller and then ceased thinking, because this game makes you want to headbang a table with pencils in your nose. \n\nSo, whats left is a horror-themed action game with shitty gunplay, a shitty port, a funny fat guy, and by default an FOV that gives me a bigger headache than the game itself.\n\nPlay RE7 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not like normal resident evil games. \nIt's like it was supposed to be some haunted house game, then rebranded as resident evil.  \nAlso, it has the worst script of all time.  \nNormally I like resident evil, silent hill, etc.  But this is almost unplayable.   \nYou were warned.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much like the last game, this one is just about frustrating you as much as possible. Too many points in the game where there is no clue what to do next, or which way to go. For example, early on there is a stage where an endless wave of monsters are coming at you and you are supposed to run. Where are you supposed to run? Had to wonder around through about 15 deaths before I figured out. That's not fun, its just annoying. I wish these games were playable, they look cool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong this was a good installment to the series and fun to play. However, this game has way too much action and not enough horror. even on my first play through there was only one section that felt even slightly spooky and its a little disappointing.\nYou can get through the game pretty quick even if you go for everything there's some replay value but not a lot \nhowever definitely worth a play if you are a fan of the series or just RE7",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly? This story to me is on the same level as RE6: boring game, nonsense plot, dumb characters, and a campaign that gets super annoying halfway through.\r\n\r\nThey had the brilliant idea of giving Chris that “villain” vibe at the start, which only makes him look like a complete idiot, because he knew Ethan wasn’t just a normal guy after everything that happened in RE7, and even then he refuses to explain anything UNTIL ALMOST THE END OF THE GAME.\r\n\r\nI won’t even get into Miranda’s plot with her “amazing” shapeshifting powers, or Spencer’s letter in her lab that turns him into a clown, because if his whole goal through the entire franchise was immortality, why the hell didn’t he use the damn megamycete if he KNEW it existed? To me, this was Capcom’s horrible attempt to force a connection between this game and Umbrella’s origin story in the dumbest way possible.\r\n\r\nAnd the way they treated Dimitrescu honestly pisses me off too: the entire marketing campaign was built around her and her daughters, just for all of them to die in under three hours of gameplay :D wow, amazing!!!! And now we have to deal with Capcom throwing her skin into Grace in Requiem because they know they threw away all her potential as an actually good villain.\r\n\r\nI didn’t just hate the story, I hated the gameplay too. It was super underwhelming, especially because they removed a mechanic that’s been in the franchise SINCE 2005: the unique weapon system.\r\n\r\nEvery weapon you get after the starting ones (Lemi, M1897, and the M1851) is just flat-out BETTER in every single way. There’s none of that weapon diversity like in Resident Evil 4, where each gun had a UNIQUE ability when fully upgraded, and the stats weren’t always superior. In Village, that just doesn’t exist. After the first playthrough, you never touch the starting weapons again because they’re terrible.\r\n\r\nI really hope they learned from this game’s mistakes and nail it with Requiem, because this franchise has insane potential, but it just gets wasted over and over by mediocre games like this one.\r\n\r\nDon’t even ask me what I think about Rose’s DLC. That thing doesn’t exist, it was just a collective hallucination.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "7 hours in and a key item didnt spawn. completely bricking my first and only play through. games been out for 4 years. so i cant recommend it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After six hours of playing this game a bug occourd, which made all statues in the castle disappear. This means, that progress is no longer possible. The only option for me would be to replay the entire game. This is riddiculus for such an expensive game. Verry sad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Visuals are stunning and atmosphere oppresively gloomy. Overall nice setting for a horror game but that's where the good stuff pretty much ends. \r\n\r\nWithout spoiling anything the story is really and I mean really weak. Deus ex machina moments galore, the plot is obnoxiously contrived to the point of hillarity and don't get me started on the ending (pun intended).\r\n\r\nBoss fights are heavily scripted to the point that it just becomes a trial of error till you find out what the devs wanted you to do. Hell the game even starts with the hardest fight sequence, not even telling you that you have to survive for a certain ammount time. Slogging through it on hardcore almost made me to ask steam for refund. Ultimately I've managed to cheese it by running lycans around a chimney on a rooftop till the timer ran out and the cutscene happened.\r\n\r\nThe game has a built in system of ammo starvation. If you're conservative and hit your shots, then the next ammo pile has 8 rounds instead of 20 in it or maybe an extra enemy spawns making you waste ammo so it's damn if you do and damn if you don't which kinda makes the whole ordeal feel pointless.\r\n\r\nIn the end I was glad that it's over. I didn't care about the protagonist or the villain and I'll probably forget the plot in a week.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's so many features I like in Resident Evil Village, particularly its setting, combat, and visuals, but my enjoyment of it is crippled by its flaws.\n\nThe story and dialog are astoundingly bad and make no sense.  It wouldn't be such a problem if the story was in the background such as with RE 1, but Village keeps putting weight on its narrative foot.  And the writing is not laughably bad, it's just an annoying bad.\n\nI haven't played the previous few RE games so I don't know if this is already a trend, but I am disengaged by the way Village relies on extreme fake stakes and fake harm.\n\nCut scenes will have monsters do shockingly brutal things to the player, then the player walks away with \"merely a flesh wound\".  After the third or forth fatal injury the shock has been lost.\n\nAnd if being effectively immortal isn't enough, so many times the protagonist should have failed his mission but is spared because the villains have contrived idiocy.\n\nEthan has enough plot armor to swallow a nuke.\n\nHaving auto-regeneration in a Survival Horror game takes both the survival and the horror out of the gameplay.  There's no better way to remove tension then by allowing players to tank damage with no repercussions.\n\nWhile RE games tend to be fairly linear, the ones I've played did a good job of hiding it and making the player feel in control.  Village feels like a bait-and-switch, where its layout appears non-linear but is gated to be linear.  Part of the problem is with Village's \"theme-park\" layout with separate lands, it's like a Mega Man game without being able to choose which level to play next.\n\nI'm not a big fan of boss battles so I am biased, but for me Village's boss battles are an annoying tangent.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game fucking sucks and is incredibly unfun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game crashes every 10 minutes. And after the Castle part of this game, it falls off a cliff.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not like Resident Evil 5 and 6.\nNot enough kililng and too much talking and thinking. I ended up watching Cutscenes Movie from YouTube instead of playing the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game. Unclear objectives. Lots of backtracking and wandering around to find obscure locations. Loss of progress if you aren't near a save point and need/want to quit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't run it and steam won't let me get a refund because I installed it overnight and it launching while my computer was asleep counted as 9 hours of playtime. Okay game though, but steam support is horrible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game in theory is good, but it clearly has a way that players are \"supposed\" to play. If you don't do things in the exact order it wants you to you get locked out and cannot go back. I didn't know in the factory that I wasn't supposed to go through the small door in the ventilation duct without doing something else first and now I am locked there with no way out. I hadn't made the key to the next door yet because I didn't know I needed to yet and I had saved over my old save when I brought up the Duke. What a horrible design, I spend 15 hours playing this to not even be able to finish. 1/10.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}