{
  "positive": [
    {
      "review": "It’s an action video game based on the world of BLEACH.\nit works kind of like a  beat-‘em-up full of magic, sword fights, and cool characters.\nAnd, it's f2p!\n100+ hours in and I've not spent a dime.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It’s an action video game based on the world of BLEACH.\nit works kind of like a beat-‘em-up full of magic, sword fights, and cool characters.\nAnd, it's f2p!\n(1000+ hours on PC + Mobile) in and I've not spent a dime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "help I re installed the game after changing the OS and lost my account lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for bleach fans. Good game for busy people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a very fun gacha game with tons of characters to unlock and all characters are amazing and unique. Really recommend playing this with friends too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"This game is an absolute masterpiece! The world-building is so immersive, and the attention to detail is incredible. From the storyline to the mechanics, everything feels so well-crafted and polished. It’s rare to find a game that not only challenges you but also makes you emotionally invested in the characters and world. You can really tell a lot of love and passion went into creating this.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nunca mas me salieron personajes de banner nuevos, una bosta, para gente nueva lo recomiendo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра 'BLEACH Brave Souls' - это достойный мобильный экшен для фанатов вселенной Bleach. Отличная графика, передающая атмосферу аниме, и аутентичные спецэффекты делают бои невероятно зрелищными. Геймплей хорошо адаптирован под мобильные устройства, управление интуитивно понятное, а разнообразие персонажей позволяет собрать свою любимую команду.\n\nСистема прокачки и развития персонажей достаточно глубокая, требующая времени и усилий, но это добавляет игре глубины и реиграбельности. Сюжетная кампания охватывает все основные арки аниме, позволяя заново пережить любимые моменты. \n\nМожно отметить донат, но он не критичен и не делает невозможным комфортную игру без вложений. Регулярные обновления и ивенты поддерживают интерес к игре. В целом, 'BLEACH Brave Souls' - отличный выбор для поклонников Bleach и любителей динамичных мобильных экшенов.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played enough of this game on steam and online to say that this is an excellent gacha. Very f2p friendly and tries to be up to date with the current evolution of the Bleach Universe (side stories, main story catching up to the show, etc). The game explores and exploits the depth of the Bleach Universe. I must say that in the recent years, new mechanics were implemented and I find them quite interesting, very grindy too. \nThe only thing I recommend to any beginner in this game, find friends to play with. Coops and Raids are just more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how easy it is to level up in this game. and you can also get cute little mini versions of characters!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the characters look very cool and Bleach is one of my favorite mangas",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gacha games usually are not great, BUT this is bleach so its fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got some really cool characters loved the art and designs for the ultimate's",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game if you want to play something chill!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the best bleach game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BLEACH Brave Souls is that game where you say “I’ll just log in for the daily rewards” and suddenly you’re knee-deep in a banner praying for a 5★ unit while being handed your 9th copy of Some Random Filler Character #3.\n\n---\n\n### Pros:\n\n* Fully voice-acted anime screaming to remind you this *is* serious business.\n* 10 different Ichigos, 8 different Rukias, 0 different chances of you actually pulling the one you want.\n* Combos look like you’re deleting entire dimensions, but in reality you’re farming story mode… again.\n* Auto-battle lets you “multitask” while you pretend you’re not just watching your phone play itself.\n\n### Cons:\n\n* Gacha:\n\n  * Brain: “Save your orbs.”\n  * Fingers: *ten pull on every banner with a cool thumbnail.*\n* Drop rates so low you start believing in ancient rituals: changing language, spinning the camera, sacrificing dupes.\n* “This event is easy” – says the person with a level 200 max-transcended god unit and 4 limited supports.\n* Inventory management is 50% of the gameplay. The other 50% is regretting past summons.\n\n---\n\n### Peak Brave Souls Experience:\n\n* Skip the anime for years. Learn the entire plot from character descriptions.\n* Pull a character you wanted 6 months ago… right after a dry streak made you quit for 3 weeks.\n* “I’m F2P” you say, with 0 orbs and dead eyes.\n\n---\n\n10/10\nTurned my love of BLEACH into a full-time part-time gacha job.\nWould farm the same quest 500 times for one more resource and a cooler Ichigo again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "terrible game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Veeery good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NICE F2P GAME ~ RELAX",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "f",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great! it's got ichigo, and white ichigo, and black ichigo, and captain ichigo, and real ichigo, and quincy ichigo...",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "Not really a review, just a tip for anyone who lost their progress,\n\nTo recover your data just lauch the game in safe mode and link to your Klab account.\n\nTo run a Steam game in safe mode, open your Steam Library, right-click the game, select Properties, go to the General tab, and type -safe into the Launch Options field.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "(81-652-557)You can take a quick look at my main account and see i have a love for the game have played it all the way back in like 2016-2017 in my opinion BBS is still one of the best gacha-action Whether you been slicing hollows since day one or your just stepping into the souls society Klab has polished this game over the years into a great experience for beginners and for vet there are still end game modes that can still be struggled with without a stacked roaster with massive character pool with community made designs being added crossovers and seasonal celebrations honestly impressive how they keep the community so invested.After a while like most games it can get repetitive with the game play loop starting to seem its not too bad with the auto mode.If your a bleach fan the game holds up great graphics stellar voice acting and combat is satisfying when not in auto. I'm 100 free to play my only complaint is that some of the older units (first 2 years of game) aren't as usable into meta even though i know they try to make it so you can play anyone effectively this era the other thing is summing rate i was around when it was 0.3-0.5% rate to get a 5 star but now its 3-5% so way better and you can increase your overall by doing steps or upgrading summing rate (i only upgraded it 2 of 5) sometimes i can do 5 summons and only get 1-2 characters which is annoying when you have no way to get orbs.Remember any negativity is Yhwach's PR department working overtime",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I got this game on steam first but then had to move to mobile because I couldn't open the game, and it seemed like other people had the same issue. Other than that, this is a very fun and enjoyable game, the grind is very addictive and it is amazing to see so many variations of all your favorite characters from Beach.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its very good for a free game i dont like how the gacha is but besides that the combat is good and the graphics arent the worst",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i would recommend this game to noxusswag specifically not anyone else if youre not noxusswag do NOT play this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "help I re installed the game after changing the OS and lost my account lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for bleach fans. Good game for busy people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a very fun gacha game with tons of characters to unlock and all characters are amazing and unique. Really recommend playing this with friends too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"This game is an absolute masterpiece! The world-building is so immersive, and the attention to detail is incredible. From the storyline to the mechanics, everything feels so well-crafted and polished. It’s rare to find a game that not only challenges you but also makes you emotionally invested in the characters and world. You can really tell a lot of love and passion went into creating this.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nunca mas me salieron personajes de banner nuevos, una bosta, para gente nueva lo recomiendo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра 'BLEACH Brave Souls' - это достойный мобильный экшен для фанатов вселенной Bleach. Отличная графика, передающая атмосферу аниме, и аутентичные спецэффекты делают бои невероятно зрелищными. Геймплей хорошо адаптирован под мобильные устройства, управление интуитивно понятное, а разнообразие персонажей позволяет собрать свою любимую команду.\n\nСистема прокачки и развития персонажей достаточно глубокая, требующая времени и усилий, но это добавляет игре глубины и реиграбельности. Сюжетная кампания охватывает все основные арки аниме, позволяя заново пережить любимые моменты. \n\nМожно отметить донат, но он не критичен и не делает невозможным комфортную игру без вложений. Регулярные обновления и ивенты поддерживают интерес к игре. В целом, 'BLEACH Brave Souls' - отличный выбор для поклонников Bleach и любителей динамичных мобильных экшенов.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played enough of this game on steam and online to say that this is an excellent gacha. Very f2p friendly and tries to be up to date with the current evolution of the Bleach Universe (side stories, main story catching up to the show, etc). The game explores and exploits the depth of the Bleach Universe. I must say that in the recent years, new mechanics were implemented and I find them quite interesting, very grindy too. \nThe only thing I recommend to any beginner in this game, find friends to play with. Coops and Raids are just more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how easy it is to level up in this game. and you can also get cute little mini versions of characters!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only good thing about this game are the characters( that includes the design, voice lines and the visuals for the characters) , the content in this game has been same since the launch ( most of it ) , but if you like bleach you should try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a yuhh chill asf play it but itll be hard if u dont play it while theyre giving exp and stuff and play it for fun then get the good characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please fix it for the game because I can't access my game because of error in login section",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for gooners and bleach fans",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "alwasy a fan of bleach and this game can be idled while working so its perfect if u want to make progress passively while working",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive played this game on both PC and mobile. \n\nMy honest experience isnt as terrible as it is, great content, easy to grind and etc etc....\n\nCharacters however are nice, especially the gacha and the orbs  system kinda fucking sucks on that hand..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game all around. al;ways more characters to get and the content is actually cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been great for years and gives Bleach fans a great game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game, i love farming the summon currency so i can gamble and get shafted :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with a friend, it is the type of grindy gacha game that you can rely on to keep you company but cannot deliver anything of noteworthy quality itself. \n\nEither the translation or the story telling is ass, the only event I've played so fard had really bad dialog that did not even fit the characters. \n\nGraphics do not seem like much but they grow on you, I thought it was too chibi but you grow into it.\n\nOverall it is such a mediocre game that you really have nothing much to say. Yes, this is a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a gacha game first and foremost so keep that in mind when starting. Unless you get the newest characters released at the time you may/will depending on time have a bad time with content since powercreep does exist and is decently rapid. If you want a gacha game without rapid powercreep but with sort of free to play aspects play limbus company, or punishing gray ravens",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BLEACH: Brave Souls is basically anime chaos in 3D form—and I love every second of it. You can mash buttons, unleash flashy special moves, and watch Ichigo somehow slice through a dozen enemies while Rukia floats dramatically in the background. The best part? You can assemble dream teams that would never happen in canon and just watch the mayhem unfold. Fast-paced, ridiculous, and full of nostalgia-fueled destruction—10/10, I’ve never felt more like a god of anime violence.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great free-to-play gacha game for fans of the anime! Combat is fun and relatively simple, character collection is engaging, and it's constantly updated with new content. Definitely worth checking out if you enjoy Bleach!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the characters look very cool and Bleach is one of my favorite mangas",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gacha games usually are not great, BUT this is bleach so its fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once I found out the app version was on steam I started to play it here non stop. I will say they need more Shunsui skins.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "اللعبه ذي له ذكريات حلوه وفترته جميله ومن اجمل الفترات",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Got some really cool characters loved the art and designs for the ultimate's",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Самая лучшая гача-чиби игра, очень легко развиваться мне понравилось, всем советую!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i usually can't play most games for more then 30 minutes at a time but this game is amazing 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bleach is the best anime to since this is bleach game u should play. Likenow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Currently having issues logging in after the last update.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "really good game but please add an option that removes the ally system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "had a good run with the game but sadly it falls off with time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for 8 years ive enjoyed it very fun and exciting to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "ulquiorra is in the game so that makes it a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than that shitty one piece rush game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bleach anime is fun better than naruto :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game without pay to win",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like it alot i have 53 hours btw i went to a 2 day trip and left it on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "я выбиваю всех бьякуй и я счастлива. не отвлекайте, играю в ббс",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "played on mobile. still fun on here",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, please k lab if oyu see this, make a naruto version of this game would be sick af <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big grind but fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best bleach game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeh its ight i guess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very awesome game, I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just wish this was a Naruto game instead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BLEACH Brave Souls is that game where you say “I’ll just log in for the daily rewards” and suddenly you’re knee-deep in a banner praying for a 5★ unit while being handed your 9th copy of Some Random Filler Character #3.\n\n---\n\n### Pros:\n\n* Fully voice-acted anime screaming to remind you this *is* serious business.\n* 10 different Ichigos, 8 different Rukias, 0 different chances of you actually pulling the one you want.\n* Combos look like you’re deleting entire dimensions, but in reality you’re farming story mode… again.\n* Auto-battle lets you “multitask” while you pretend you’re not just watching your phone play itself.\n\n### Cons:\n\n* Gacha:\n\n  * Brain: “Save your orbs.”\n  * Fingers: *ten pull on every banner with a cool thumbnail.*\n* Drop rates so low you start believing in ancient rituals: changing language, spinning the camera, sacrificing dupes.\n* “This event is easy” – says the person with a level 200 max-transcended god unit and 4 limited supports.\n* Inventory management is 50% of the gameplay. The other 50% is regretting past summons.\n\n---\n\n### Peak Brave Souls Experience:\n\n* Skip the anime for years. Learn the entire plot from character descriptions.\n* Pull a character you wanted 6 months ago… right after a dry streak made you quit for 3 weeks.\n* “I’m F2P” you say, with 0 orbs and dead eyes.\n\n---\n\n10/10\nTurned my love of BLEACH into a full-time part-time gacha job.\nWould farm the same quest 500 times for one more resource and a cooler Ichigo again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "terrible game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "diddy game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "goated game bro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Veeery good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak fiction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NICE F2P GAME ~ RELAX",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "f",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Decent game but notifying only in game that they remove facebook link so i lost 100hours of gameplay im not ever playing it again wasnt on the game for a long while then hopped on reinstalled pc and its all lost",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dude wrong game.. Wrong game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so butt bro.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Update deleted my account.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game randomly deleted my account information with no way to recover and no reason why it would have done so. Do not play this game unless you are willing to have your account suddenly erased for no reason.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The game has a real trojan in it.\n\nI thought maybe it was a false positive like a lot of comments were saying, but luckily I have pretty good antivirus and when it found the trojan it attempted to connect to a strange website and dozens of connection attempts where being blocked after installing. It's not a false positive. Steam downloads a legit trojan when you install this game.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "After playing the Game for over 200 Hours they deleted all my data, and reset me back to nothing along with many other players data. The only way to restore your data is apparently you have to have had an account on their website beforehand, and linked it with the Game? It's been a few days, and it still hasn't been restored just a constant login error. I'm just glad I didn't spend much money on the Game besides a little when I first played it.\r\nSuffice to say I will never play another game from this developer, and I highly recommend against playing live service Gacha Games like this as you never know when they will decide to shut down, and destroy all your hard earned progress (hopefully you didn't pay much actual money.), or pull something like what they did to me, and much of the community and reset you to zero.\r\nIt's completely unacceptable, shameful, embarrassing, and unprofessional there still has been no word or update from the developers. Apparently you can reach out to them, and they'll make you jump through a bunch of hoops, and expect you to remember everything you did when you first played the Game to maybe have a small chance of getting your data back.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Can't even play the game anymore because they randomly decided to patch in an update that mass deleted accounts. Good game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Another PaytoWin/HaveFun BS, that sits on Fan Favourite legendary Anime title. Only good thing about this is how many original new Alternate powers and forms of Characters were created. FUCK GACHA AND FUCK GACHA GAME MAKERS.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Decent game but notifying only in game that they remove facebook link so i lost 100hours of gameplay im not ever playing it again wasnt on the game for a long while then hopped on reinstalled pc and its all lost",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Wow, imagine playing a gatcha game since 2017 (started on the phone and migrated to steam when it became compatible) with the same account, only to find that your data was wiped out on 10/4/2025. Any characters I had? gone. Any progress made? Yeah that is gone too. There was no notice of this big data wipe on SNS accounts either.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "today, lost for game data on stream but account use from google play. i cant login my account link google play to app game. \r\n\r\nnot go any use steam download. Use go play login link Xbox or PS5 or PC. Steam bad now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "logged on today and my accounts gone I then played to see if there was anything in settings to change back to my original account in a last ditch effort but at the part where it wants you to continue to the second mission it shows the cfow campaign and nothing works. Really sucks had 140 hours in it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "been playing this for years now and logged it today with everything gone and unable to get it back.   edit: now doesnt even let me log in. Do not download this trash",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I literally just lost my account randomly. Yesterday it was working fine and then when I open it up today I lose my entire account and have to start a new character for absolutely no reason at all. I have close to 300 hours on the game and to lose all of that sucks beyond belief. If I can't get it back, I'm uninstalling the game. Fucking sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Garbage save system, game randomly loses data and Klabid did not save it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it sucks and the controls are dog caca and the story telling is not compelling at all! :/ dont install its a WASTE of storage and time in my opinion... its good if you wanna kill time or smth but not much else :p",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played this game since the early days, back when it wasn't released globally. Got introduced to it from a friend at school who was a real Bleach fan, we were playing together and having so much fun. Story mode was difficult back then, we would grind at the highest level chapters for EXP and Coins and we'd do it manually, else our characters wouldn't clear the stage.\n\nToday, I went to play Guild Quest before the reset and saw the screen pop with a different ID, telling me to input a nickname.\n\nI'm thinking: Was about time. I was done with the game, seen this game go from \"choose your fav character and have some fun in co-op\" to \"choose the meta character, else it's a ban from my room\". \n\nIt was really fun at the beginning, every new mode to play characters was fun too, until they turn them into something else. \n\nI watched the game slowly turn into an average money-making pretty much a card-collecting game at this point. Nothing worth doing, you wouldn't even play the new characters you acquire, just turn auto and like frozen, let it go. \n\nEpic Raid is a chore, used to be fun, I'd record myself clearing bosses with weak ressurection characters for fun, now they can't clear the mode since the bosses have been insanely buffed. PVP was always a chore, Co-Op is worth nothing to veterans, they drop items you usually have stocked in hundreads of thousands already. Guild Quest only for orbs. It used to have a speedrun mode back then that was fun, I'm definitely a casual player but even I would play and try to beat my time or a Youtuber's because it was fun.\n\nAnyways. Total slop of a game. I don't recommend to new players. Me? Only endured it for so long because I felt I was deep into it, but just like other MMOs I've played, I have to know when to stop.\n\nLosing the account is my out sign. For people who do have fun with the game or used to, sorry you had to go through this, I hope they fix it and you all get your accounts back. I've chosen to move on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3,750 hours, randomly data wiped, wrote an email to klab, some random answear (sounds like they dont care about this shit) think twice before playing this game ;3",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pathethic game full of cheaters force you to grind if you want be top or have some gems to summon or orbs I don't remember these shits.. it took closely year them to notice I was cheating it's a joke  a fucking year hahahahaha. What were they doing this time? What's funny I didn't cheat much like be top in bbs or any ranking.. so pathethic play 12 hours daily to get these characters for nothing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has completely reset my account twice now and as refused to acknowledge that I have an account for the stupid website or whatever it is that it tells you to sign up for to save your progress.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been playing for a long time and this isn't the first time I've lost all my data. Maybe I should have learned my lesson but the fact that you can just randomly lose all your progress and money for no apparent reason is bizarre. Fix your shitty save system klab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my acc is gone now. no link to klab. steam cant save me now\ni though if iam changing into PC from mobile.my data will save then this happening.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just lost my account just couse yes data was lost after ubdate i grinded 150 hours for nothing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gatcha thats not really gatcha friendly. Imagine spending 50 bucks for TWO pulls, cause thats how many premium currency you can buy for 50 bucks. Just grind for a month then pull on a banner you eventually like, thats the only way of getting new things.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "just install and it black screen, good game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game data wiped without warning after 1k+ hours played",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't have my old data, I don't want to grind from 0 to everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IT WILL LOG YOUR WHOLE ACCOUNT OFF AND THEN NEVER TRY TO LOG U BACK IN",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "really bad cellphone type game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it reset my data for no reason",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "wiped out my account out of no where had so many hours",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Update deleted my account.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Are they F kidding me, where my data",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid game ngl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game randomly deleted my account information with no way to recover and no reason why it would have done so. Do not play this game unless you are willing to have your account suddenly erased for no reason.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The game has a real trojan in it.\n\nI thought maybe it was a false positive like a lot of comments were saying, but luckily I have pretty good antivirus and when it found the trojan it attempted to connect to a strange website and dozens of connection attempts where being blocked after installing. It's not a false positive. Steam downloads a legit trojan when you install this game.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "After playing the Game for over 200 Hours they deleted all my data, and reset me back to nothing along with many other players data. The only way to restore your data is apparently you have to have had an account on their website beforehand, and linked it with the Game? It's been a few days, and it still hasn't been restored just a constant login error. I'm just glad I didn't spend much money on the Game besides a little when I first played it.\r\nSuffice to say I will never play another game from this developer, and I highly recommend against playing live service Gacha Games like this as you never know when they will decide to shut down, and destroy all your hard earned progress (hopefully you didn't pay much actual money.), or pull something like what they did to me, and much of the community and reset you to zero.\r\nIt's completely unacceptable, shameful, embarrassing, and unprofessional there still has been no word or update from the developers. Apparently you can reach out to them, and they'll make you jump through a bunch of hoops, and expect you to remember everything you did when you first played the Game to maybe have a small chance of getting your data back.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Can't even play the game anymore because they randomly decided to patch in an update that mass deleted accounts. Good game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Decent game but notifying only in game that they remove facebook link so i lost 100hours of gameplay im not ever playing it again wasnt on the game for a long while then hopped on reinstalled pc and its all lost",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Wow, imagine playing a gatcha game since 2017 (started on the phone and migrated to steam when it became compatible) with the same account, only to find that your data was wiped out on 10/4/2025. Any characters I had? gone. Any progress made? Yeah that is gone too. There was no notice of this big data wipe on SNS accounts either.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Another PaytoWin/HaveFun BS, that sits on Fan Favourite legendary Anime title. Only good thing about this is how many original new Alternate powers and forms of Characters were created. FUCK GACHA AND FUCK GACHA GAME MAKERS.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "today, lost for game data on stream but account use from google play. i cant login my account link google play to app game. \r\n\r\nnot go any use steam download. Use go play login link Xbox or PS5 or PC. Steam bad now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "logged on today and my accounts gone I then played to see if there was anything in settings to change back to my original account in a last ditch effort but at the part where it wants you to continue to the second mission it shows the cfow campaign and nothing works. Really sucks had 140 hours in it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "been playing this for years now and logged it today with everything gone and unable to get it back.   edit: now doesnt even let me log in. Do not download this trash",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I literally just lost my account randomly. Yesterday it was working fine and then when I open it up today I lose my entire account and have to start a new character for absolutely no reason at all. I have close to 300 hours on the game and to lose all of that sucks beyond belief. If I can't get it back, I'm uninstalling the game. Fucking sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Garbage save system, game randomly loses data and Klabid did not save it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FUCK IS BIH ASS GAME HONESTLY.. this shitty ass game ragebaited me so much while naming myself like tf am i gon name my acc? 'bigdick\" ? fuckass game doesnt even let me name my account fuck this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it sucks and the controls are dog caca and the story telling is not compelling at all! :/ dont install its a WASTE of storage and time in my opinion... its good if you wanna kill time or smth but not much else :p",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played this game since the early days, back when it wasn't released globally. Got introduced to it from a friend at school who was a real Bleach fan, we were playing together and having so much fun. Story mode was difficult back then, we would grind at the highest level chapters for EXP and Coins and we'd do it manually, else our characters wouldn't clear the stage.\n\nToday, I went to play Guild Quest before the reset and saw the screen pop with a different ID, telling me to input a nickname.\n\nI'm thinking: Was about time. I was done with the game, seen this game go from \"choose your fav character and have some fun in co-op\" to \"choose the meta character, else it's a ban from my room\". \n\nIt was really fun at the beginning, every new mode to play characters was fun too, until they turn them into something else. \n\nI watched the game slowly turn into an average money-making pretty much a card-collecting game at this point. Nothing worth doing, you wouldn't even play the new characters you acquire, just turn auto and like frozen, let it go. \n\nEpic Raid is a chore, used to be fun, I'd record myself clearing bosses with weak ressurection characters for fun, now they can't clear the mode since the bosses have been insanely buffed. PVP was always a chore, Co-Op is worth nothing to veterans, they drop items you usually have stocked in hundreads of thousands already. Guild Quest only for orbs. It used to have a speedrun mode back then that was fun, I'm definitely a casual player but even I would play and try to beat my time or a Youtuber's because it was fun.\n\nAnyways. Total slop of a game. I don't recommend to new players. Me? Only endured it for so long because I felt I was deep into it, but just like other MMOs I've played, I have to know when to stop.\n\nLosing the account is my out sign. For people who do have fun with the game or used to, sorry you had to go through this, I hope they fix it and you all get your accounts back. I've chosen to move on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3,750 hours, randomly data wiped, wrote an email to klab, some random answear (sounds like they dont care about this shit) think twice before playing this game ;3",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pathethic game full of cheaters force you to grind if you want be top or have some gems to summon or orbs I don't remember these shits.. it took closely year them to notice I was cheating it's a joke  a fucking year hahahahaha. What were they doing this time? What's funny I didn't cheat much like be top in bbs or any ranking.. so pathethic play 12 hours daily to get these characters for nothing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has completely reset my account twice now and as refused to acknowledge that I have an account for the stupid website or whatever it is that it tells you to sign up for to save your progress.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been playing for a long time and this isn't the first time I've lost all my data. Maybe I should have learned my lesson but the fact that you can just randomly lose all your progress and money for no apparent reason is bizarre. Fix your shitty save system klab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my acc is gone now. no link to klab. steam cant save me now\ni though if iam changing into PC from mobile.my data will save then this happening.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just lost my account just couse yes data was lost after ubdate i grinded 150 hours for nothing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gatcha thats not really gatcha friendly. Imagine spending 50 bucks for TWO pulls, cause thats how many premium currency you can buy for 50 bucks. Just grind for a month then pull on a banner you eventually like, thats the only way of getting new things.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "just install and it black screen, good game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game data wiped without warning after 1k+ hours played",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't have my old data, I don't want to grind from 0 to everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IT WILL LOG YOUR WHOLE ACCOUNT OFF AND THEN NEVER TRY TO LOG U BACK IN",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dude wrong game.. Wrong game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "really bad cellphone type game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is so butt bro.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it reset my data for no reason",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "wiped out my account out of no where had so many hours",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Update deleted my account.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Are they F kidding me, where my data",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid game ngl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "meh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game randomly deleted my account information with no way to recover and no reason why it would have done so. Do not play this game unless you are willing to have your account suddenly erased for no reason.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The game has a real trojan in it.\n\nI thought maybe it was a false positive like a lot of comments were saying, but luckily I have pretty good antivirus and when it found the trojan it attempted to connect to a strange website and dozens of connection attempts where being blocked after installing. It's not a false positive. Steam downloads a legit trojan when you install this game.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "After playing the Game for over 200 Hours they deleted all my data, and reset me back to nothing along with many other players data. The only way to restore your data is apparently you have to have had an account on their website beforehand, and linked it with the Game? It's been a few days, and it still hasn't been restored just a constant login error. I'm just glad I didn't spend much money on the Game besides a little when I first played it.\r\nSuffice to say I will never play another game from this developer, and I highly recommend against playing live service Gacha Games like this as you never know when they will decide to shut down, and destroy all your hard earned progress (hopefully you didn't pay much actual money.), or pull something like what they did to me, and much of the community and reset you to zero.\r\nIt's completely unacceptable, shameful, embarrassing, and unprofessional there still has been no word or update from the developers. Apparently you can reach out to them, and they'll make you jump through a bunch of hoops, and expect you to remember everything you did when you first played the Game to maybe have a small chance of getting your data back.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Can't even play the game anymore because they randomly decided to patch in an update that mass deleted accounts. Good game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Decent game but notifying only in game that they remove facebook link so i lost 100hours of gameplay im not ever playing it again wasnt on the game for a long while then hopped on reinstalled pc and its all lost",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Wow, imagine playing a gatcha game since 2017 (started on the phone and migrated to steam when it became compatible) with the same account, only to find that your data was wiped out on 10/4/2025. Any characters I had? gone. Any progress made? Yeah that is gone too. There was no notice of this big data wipe on SNS accounts either.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Another PaytoWin/HaveFun BS, that sits on Fan Favourite legendary Anime title. Only good thing about this is how many original new Alternate powers and forms of Characters were created. FUCK GACHA AND FUCK GACHA GAME MAKERS.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "today, lost for game data on stream but account use from google play. i cant login my account link google play to app game. \r\n\r\nnot go any use steam download. Use go play login link Xbox or PS5 or PC. Steam bad now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "logged on today and my accounts gone I then played to see if there was anything in settings to change back to my original account in a last ditch effort but at the part where it wants you to continue to the second mission it shows the cfow campaign and nothing works. Really sucks had 140 hours in it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "been playing this for years now and logged it today with everything gone and unable to get it back.   edit: now doesnt even let me log in. Do not download this trash",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I literally just lost my account randomly. Yesterday it was working fine and then when I open it up today I lose my entire account and have to start a new character for absolutely no reason at all. I have close to 300 hours on the game and to lose all of that sucks beyond belief. If I can't get it back, I'm uninstalling the game. Fucking sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Garbage save system, game randomly loses data and Klabid did not save it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FUCK IS BIH ASS GAME HONESTLY.. this shitty ass game ragebaited me so much while naming myself like tf am i gon name my acc? 'bigdick\" ? fuckass game doesnt even let me name my account fuck this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it sucks and the controls are dog caca and the story telling is not compelling at all! :/ dont install its a WASTE of storage and time in my opinion... its good if you wanna kill time or smth but not much else :p",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played this game since the early days, back when it wasn't released globally. Got introduced to it from a friend at school who was a real Bleach fan, we were playing together and having so much fun. Story mode was difficult back then, we would grind at the highest level chapters for EXP and Coins and we'd do it manually, else our characters wouldn't clear the stage.\n\nToday, I went to play Guild Quest before the reset and saw the screen pop with a different ID, telling me to input a nickname.\n\nI'm thinking: Was about time. I was done with the game, seen this game go from \"choose your fav character and have some fun in co-op\" to \"choose the meta character, else it's a ban from my room\". \n\nIt was really fun at the beginning, every new mode to play characters was fun too, until they turn them into something else. \n\nI watched the game slowly turn into an average money-making pretty much a card-collecting game at this point. Nothing worth doing, you wouldn't even play the new characters you acquire, just turn auto and like frozen, let it go. \n\nEpic Raid is a chore, used to be fun, I'd record myself clearing bosses with weak ressurection characters for fun, now they can't clear the mode since the bosses have been insanely buffed. PVP was always a chore, Co-Op is worth nothing to veterans, they drop items you usually have stocked in hundreads of thousands already. Guild Quest only for orbs. It used to have a speedrun mode back then that was fun, I'm definitely a casual player but even I would play and try to beat my time or a Youtuber's because it was fun.\n\nAnyways. Total slop of a game. I don't recommend to new players. Me? Only endured it for so long because I felt I was deep into it, but just like other MMOs I've played, I have to know when to stop.\n\nLosing the account is my out sign. For people who do have fun with the game or used to, sorry you had to go through this, I hope they fix it and you all get your accounts back. I've chosen to move on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3,750 hours, randomly data wiped, wrote an email to klab, some random answear (sounds like they dont care about this shit) think twice before playing this game ;3",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pathethic game full of cheaters force you to grind if you want be top or have some gems to summon or orbs I don't remember these shits.. it took closely year them to notice I was cheating it's a joke  a fucking year hahahahaha. What were they doing this time? What's funny I didn't cheat much like be top in bbs or any ranking.. so pathethic play 12 hours daily to get these characters for nothing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has completely reset my account twice now and as refused to acknowledge that I have an account for the stupid website or whatever it is that it tells you to sign up for to save your progress.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been playing for a long time and this isn't the first time I've lost all my data. Maybe I should have learned my lesson but the fact that you can just randomly lose all your progress and money for no apparent reason is bizarre. Fix your shitty save system klab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my acc is gone now. no link to klab. steam cant save me now\ni though if iam changing into PC from mobile.my data will save then this happening.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just lost my account just couse yes data was lost after ubdate i grinded 150 hours for nothing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gatcha thats not really gatcha friendly. Imagine spending 50 bucks for TWO pulls, cause thats how many premium currency you can buy for 50 bucks. Just grind for a month then pull on a banner you eventually like, thats the only way of getting new things.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "just install and it black screen, good game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game data wiped without warning after 1k+ hours played",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't have my old data, I don't want to grind from 0 to everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IT WILL LOG YOUR WHOLE ACCOUNT OFF AND THEN NEVER TRY TO LOG U BACK IN",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}