{
  "positive": [
    {
      "review": "I'll start by saying this is a beautiful with devs that work really hard and care alot about their project.\n\nBUT\n\nImagine the satisfaction of mining in Minecraft BUT you have to manually hit E to collect\n\nEvery.\nSingle. \nBlock.\n\nForget the combat jank and the movement jank forget all that I can deal with that.\n\nMy partner wants to build. I want to collect.\n\nCollection requires me to beat my E key like it stole something from me.\n\nWe need any crop, wood ect well my index finger is screaming please god no.\n\nI am not the first or last to bring this up and honestly after over 10 years on Steam this is like my 3rd review ever.\n\nPlease please PLEASE fix the E spam or we might not be revisting this game again no matter how many capaybaras they add.",
      "voted_up": true,
      "votes_helpful": 245
    },
    {
      "review": "Well, I told myself I'd review the game at 100 hours. 99.9 works too! (Early Access)\n\nLet me start by saying this is the most fun I've had on a game in YEARS! \nThink, Skyrim, Valheim, Breath of the Wild, Minecraft, and The Forest combined. No cannibals, just spooky moments.\n\nThe Positives: \n1. Co-op makes this game incredible! I can't tell you how much fun it is to play with someone who will read the lore with you in goofy voices, jump off cliffs with you randomly, and abandon you in the middle of a boss fight because they almost got one shot. Having a loot goblin friend makes it even better.\n2.It's GORGEOUS!! Seriously, I can't emphasize how beautiful this game is! I run a 2080ti and I find myself on top of mountains and trees admiring the views from above or along the water admiring the reflection of the sunset more often than I play the game. OH, and the rain! The change in sound the ground makes when its wet or dry, the way it sounds inside compared to outside, and how it looks at sunset is phenomenal!\n3. The game runs incredibly smooth! From fighting hordes of enemies, to jumping into a pool of water, and even how it feels to jump off of a spire and dive straight down while gliding. \n4. Farming! If you enjoy comfy cozy games like I do or you have a friend or partner who isn't combat oriented but loves to farm and decorate. Then this game is for you. I've spent a solid 10-15 hours so far (with many more to come) just designing our homes, barn, castle (Fort Kelvin in my case) and I still have more to do.\n5. Crafting - Yes the farming is included in this but I want to say that this is the best crafting I've ever used in a game. It may not be as complex as minecraft with their redstone but the way you can combine and design using the voxel game system is amazing. You can create a base completely from scratch or even take over existing areas and build off of them. I HIGHLY recommend Fort Kelvin after you unlock Hannah Reed from her quest because you can rebuild the walls, buildings, and the cave system to have a nice clean fort that keeps all of your villagers in a safe area. \n6. VOXEL GAME - This brings me to my next point. You can literally destroy 99% of the areas/buildings/trees etc. There are obviously specific things that can't but this opens up ways to get around the world because of it. Can't get past a gate early game and don't have a grapple? Mine around it. Can't get into a tower because brand new? Use Altars and build stairs literally to the top (Lets game it out for example). It's a ton of fun creating basements, caves, and treehouses using this system as well. \n7. The story - I really enjoy that there is so much lore spread out in the game. It really shows the devs put a lot of time and effort into creating a world that told a story to it. The NPC's you rescue bring so much life into the game as long as you're willing to read. \n\nThe Cons: (or in this case, needs to be worked on to improve the game) \n1. The quest system. I had to rollback my cloud in order to finish a quest, \"The Morning Grind\", due to me accidentally pickaxing a skeletons body that I had to interact with and remove a ring from. I think making quest related interactions invincible would fix this simple bug. Also, while playing in co-op, my partner doesn't always get the quests when I interact with certain items or lore. \n2. Combat - My biggest frustration is getting into a fight and not being able to lock onto the target I want to in an easier way. For example, if i use a wand or a bow, sometimes the lock will target the enemy in the back instead of the guy in my face stabbing me with his sword. Sometimes I want to shoot a barrel to take out a group but instead my wand targets the guy next to the barrel instead and then I lose that opportunity. Now, I've learned how to work with this, sword enemies up close, dodge/blink back and wand enemies at mid range while using my bow to blow up barrels with free aim but swapping between my weapons on my action bar isn't always the easiest in a fight. I think there should be an easier lock on system, not sure how, but I have hopes. Oh, and make a way to block with a bow because that would be realistic. \n3. HEAL CHANNEL - Please make it so i can right click or left click in order to heal others or heal myself. It's a nice cheap spell for healing and that simple change would be huge for early/mid game mages. \n4. Pets/NPC's - They LOVE to get stuck in walls or furniture! Also, is there a way to code the npcs to return to their spots when set to 0m after going to bed? I would enjoy that if so. Like they walk to their beds at night and then return back to their spots. \n5. Map - I would like to see more clarity of the different zones on the map. You learn them eventually but I think this would benefit early/mid game for people who don't explore as much. That way when they need to get supplies, they know where to go easier. \n\nAgain, this game is one of the best I've ever played. I can't wait to sink in more hours as content continues to be released!",
      "voted_up": true,
      "votes_helpful": 75
    },
    {
      "review": "I picked up Enshrouded last week with a friend, and honestly, I didn’t expect to fall this hard for a game so fast. The world is absolutely beautiful and haunting at the same time—exploring the valleys, ruins, and hidden corners feels like stepping into a living fantasy painting. The survival and building systems feel intuitive but deep enough to stay interesting, and uncovering new gear makes every adventure feel rewarding.\r\n\r\nCo-op is where this game truly shines. My friend and I have spent hours building, fighting, and wandering—sometimes with a real plan, sometimes just “let’s see what’s over that hill” vibes. Either way, it’s always fun.\r\n\r\nAnd now I’m so hyped for Update 7. The water update looks gorgeous and adds exactly the kind of atmosphere and immersion the world has been teasing since day one. Seeing the devs continue to expand and refine things just makes me more confident that this game is only going to get better with time.\r\n\r\nIf you love exploration, building, and a world you can genuinely get lost in—this one’s for you.",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "By far one of the best voxel games I have ever played. The level of detail and love the developers pour into each update is incredible. The graphics run very well, and with the water update, now you can create creeks and gardens. While I feel there is still much to add. This, this makes me happy to play as a family game.",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "Honestly? It's like Skyrim, to me, on the aspect that it has vast exploration, a lot of interactivity with the world around you (minus the NPCs, they're okay on that part), skill level tree that branches out on how you want your character to turn out, and a lot of good enemies/bosses that it never gets dull.\n\nI like the base building mode. You gather new ideas as you progress through the game, and it's really fun to see what new building blueprints come-up! Although, I don't particularly care much to be building (unless I can get some sort of blueprint on a starter house/farm of sorts, I'd be more into it. I'm lazy on crafting blocks).\n\nMy only complaint is that, when it gets dark, it sure as heck gets DARK. I'm over here having to squint my eyes, or open them wide, to not die from a pitfall, or some spawn of enemies jump scaring me. I turned up my brightness a little, so it kind of helped, but I would prefer some sort of wearable lantern/light source to help with the dark, as I can't hold a torch in one-hand and wield a weapon in the other.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Great survival game to play with friends. \nThe graphics are stylized and detailed.\nBuilding stuff is very well done allowing you to make 1x1 small blocks and customize everything you build exactly how you want it to look.\nArmor and equipment significantly alter you stats and help you overcome harder enemies.\nThe game has quests and lots of exploration in between, unlockable equipment, buildings and NPCs that join your base, so you have a feel of progression as you complete the quests and add all the rewards (new buildings or people) to your base.\nOverall a cozy game to play with friends and enjoy building and a huge world to explore.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "If you love survival-craft games, play this! Also if you dumb down the graphics it plays just fine on the Deck.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Dark Souls danger and gameplay with base building cozy survival craft AND its multiplayer co-op. YES PLEASE! \r\nSet out and explore the dangerous fallen world of Enshrouded. Fight, Survive, and Explore. Build a Village and rescue NPCs to live and work in it. Keen developers have worked hard to provide several big updates to add to the games content. The voxel based building in Enshrouded is the best of any game so far by a mile. The graphics are great, there are several biomes to explore, puzzles to solve, and tons of enemies to dispatch. Overall this game is a 10/10 when it comes to the Survival Craft genre. The best one out of the bunch.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Best voxel game ever. It looks super pretty and the gameplay is never boring. \n\nThis is an Exploriation game with fighting, farming, tame animals, stories and building. \nYou can even build your own town with actualy villagers that you can find all over the world. Give them homes and you can even let them wander around in town. They even sleep in their own bed you give them. And they have also handy skills to craft all kinds of things for your adventure or your base.\n\n\n+ The world is BIG really big exploration map. and you wil alwayse go back to older area's to farm more materials if you need them. for crafting or base building.\n+ Game has all kinds of world settings you can edit to match your playstyle.\n+ Can be played solo or in coop with some friends. \n+ You never have to reset your save game to get the newst update. only the locations of your flame(base altar) is saved on the world all other locations wil respawn and reset over time. so you can endless mine and ensless open chests. \n\n- You need to instal the game on an ssd or it wil be laggy\n- Higher graphics card recommended if you want to look at the pretty graphics.\n- Chest resets every 20-30 minuts in game time after opened. its timer pauzes when game is not playing, be aware.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Easiest 'Labor of Love' pick ever.\n\nThe game was already a blast on day 1 of early access and was absolutely worth every penny of its price. And then the devs started working. Less than 2 years later the game has to offer so much more than I ever wanted or imagined. This game is a real unicorn among early access, especially in the trifecta of open-world / survival / crafter. If every early access was like this there would be no 'buyer's remorse' and I would have no money.\n\nCan't wait to jump back in.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[h1]One of the best games of all time.[/h1]\nHonestly, i was skeptical because i think the fantasy theme is well over done. (Elder scrolls, WoW, Elden Ring, Baldur's Gate 3, Etc.) Just burnt out of the theme, however i decided to give it a try anyways and boy i shouldn't have judged a book by its cover. \n\nI was wrong, this is one of the greatest games of all time and its still in early access. It has everything from the hardcore darksouls type player to the casual cozy farmer gamer. And the best part is you can dabble in both depending on your mood. Not much more to say, exploration, combat, music, ui, farming, gear, progression, survival mechanics, graphics. It has it all and is extremely addictive. \n\nThe only 4 negatives i would say is the character creator kind of sucks, and the friendly npc's dont act very smartly or feel real. They need more life they just mindlessly walk around and say random annoying things. Then they get stuck in floors alot. Would be cool if they pretended to do tasks or something. Mob variety in each zone is lacking including the shroud, youll see maybe 3 different mobs in each biome. And sometimes a player wont progress to the next biome for 10 hours or so depending on difficulty so then youll just see the same 3 mobs for hours and it gets repetitive. Last thing no mantling. You can mantle out of water but not while normally walking on land. Add mantling please. But thats about it for negatives. \n\nThis is easily going to be a game of the year contender next year on full release. However, dont let the early access state fool you, this game is content packed and as is, its worth playing right now. I have 12 hours into it on the survivor difficulty and have barely seen maybe 25% of what the game has to offer furthermore if you are the creative builder type there is easily 250+ hours here for you. Its so worth it and would highly recommend for literally any-type of player. Excited for the future of this game its only up from here.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Good survival/adventure game, if you like to build and you have creativity, I'll recommend it a lot",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best adventure-rol-building-survival games out there right now. Very good for solo players, awesome for coop ones. \nThe map is very big already on Early Access and, update after update, it gets better. Lots of things to do, lots of places to discover.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Highly recommended if you're into survival crafters. The game provides a plethora of structures and decor. Build a tiny fishing hut or a massive village with a working sewer system. Not into building, no problem, the map is huge and provides many biomes for adventures (Caves, dungeons, bosses, jumping puzzles). There is so much to do wether you're solo or with friends, this game is worth at least a play-through, well worth the buy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An excellent cooperative survival game that involves entertaining combat with medieval weapons and magical skills against various types of enemies.\n\nIt has received several interesting updates over time, most recently a water system that is simply magnificent.\n\nThe strongest point is undoubtedly the freedom and quantity of assets available to build and decorate comfy homes, which is simply epic for those who enjoy this gameplay.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have played quite a lot of building/crafting/survival games. What comes them being \"good\", for me this means reasonably low amount of bugs, practical crafting/building system and some visuality. This one excels in all of those. If I forget what I was doing just to watch sun rising, that's a definition of stunning environment.\n\nThis game really earns all the positive reviews it has. I could repeat almost word for word for example this one:\nhttps://steamcommunity.com/id/RealLeRoi/recommended/1203620/\n\nIf you enjoy building/crafting/survival games, this one is a-must-try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My favorite survival game of the year! I love the RPG elements, and the building system is incredibly creative and unique. The optimization could use a bit of improvement, but it’s clear the developers have poured their heart and soul into this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really thought I have a review for this already.\n\nFor me, it is definitely one of the top top survival games you can play and the devs are really putting in some hard work.\n\nI haven't played a lot the last 2 patches as I am patiently waiting for 1.0 to fully dive in into the world again.\n\nBut if you enjoy survival games with lots of exploration to do and probably the best building system there is, give the game a go.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "You've got survival, you've got combat, you've got building, you've got flying, you've got magic, you've got leveling progression, you've got sweet arse skills, you've got sneaking, you've got a bunch of quests, you've got material gathering (you've got a variety of materials), you've got grinding, you're got terraforming, you've got swimming, you've got planting a bunch of different trees to create your very own forest, you've got a beautiful world, you've got an unforgiving world, you've got challenges, and most importantly you've got caring devs. \n\nYes, I recommend this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Such a fun game. Pretty cozy and chill but challenging if you want it that way.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I'm still baffled how large the world is, so many places to conquer, stories to uncover and loot to hoard.\r\nGreat RPG where you always have something to explore, or you can just chill and build something nice.\r\nThe graphics are amazing and performance is smooth.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "When I said\n\"I wish Ark would fix it's bs\"\nand\n\"I want something like Elder Scrolls I can play with friends that is NOT Elder Scrolls online but feels like an Elder Scrolls game\"\nTHIS is what I meant.\n\nDo I miss the dinosaurs and pointy ears? Sure.\nBut do I cry when bulding anything? No.\nIs it chaotic and filled with random players? Also no.\n\nOk, seriously. This is a beautifully made game and stands for itself, I don't want to compare it too much with other games I like. It's beautiful, fun to play with friends and I love all the hidden secrets and chests so far. And you can adjust the settings, so you can have your very own experience. I for example rushed into the settings to turn off the \"lose all your stuff and cry\"-setting IMMEDIATELY.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i would like to say on the surface it looks weird but then you play and start realizing its like a mix of minecraft, dnd, baulders gate, its just good man get it and play and maybe get a friend to have fun with",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The world is a real joy to discover! A lot of care seems to have gone into it and there are a lot of secrets to discover and breathtaking areas to explore. I have a Radeon RX 5500 XT and it runs around 45fps on balanced settings, which is okay for me. I play solo and am having a blast!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, amazing dev team!! lots of content and just a great coop experience overall",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I picked up this game when it first released and have played it on and off since then.  I never got too far, wanting to wait until the world and updates were more fleshed out for me to experience fresh.  Since Wake of the Water came out, I have been hooked and playing almost everyday.  This game really knows how to inspire a sense of exploration and wonder in a beautifully crafted world where everything feels intentional and not just placed to fill space.\nI'm so excited for the eventual 1.0 release and am certain I have hundreds of hours of content left to go through until then.  The game is a night and day difference since it released building upon a strong foundation with beautiful graphics, in-depth lore, fun RPG combat elements, and capturing a sense of solitude but also hopeful feeling of rebuilding a world after the collapse of civilization. Highly recommend, 10/10 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best open world sandbox / Builder / RPG games I've played.  Loads of fun and the developers continue to improve it!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very Creative, Adventure, Relaxing, Fun with family and friends or Solo. Variety of Features to choose on how you play! Can easily step away as needed to tend to yourself and real life! It reminds me of a more advanced version of Minecraft, I love it! ^.^",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game needs some major tweaks though, please make stamina not drain out of combat, and please please PLEASE PLEASE LET US TELEPORT TO FRIENDS AT ANY TIME",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game nice progression even for an old duffer like me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very underrated game, and absolutely beautiful to play and build in",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun and beautiful survival/craft/open world sort of joint, you know what you're getting into with these sorts of games. Each patch really moves the needle on content and mechanics, and it's great fun co-op.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enshrouded is a great open world survival RPG.  Its one of the few in the genre along side Abiotic Factor that promotes both single player and co-op.  What I mean by this is that unlike most other games in the same genre, Enshrouded allows you to tweak the difficulty of your world, allowing you to either make it super hard or super easy.\n\nIn the world difficulty, you can choose to have a custom game difficulty selection, you can change how much damage you do and how much enemies do, the size of enemy health bar, the amount of loot that drops, how fast or slow is the production of items (speed of refining crafting materials in various crafting benches), the difficulty of the fishing minigame, and much more options.\n\nNot only that but Enshrouded is also adding in new weapons and weapon types, like in the most recent update the devs added in 2-handed swords, where previously there were only 2-handed axes and hammers.  Enshrouded also added swimming and a brand new biome.\n\nMy only complaints/suggestions to the devs are:\n\n1.  Please make it so that Shields do not disable/make invisible/make disappear the armour plating on the left hand of the character while wearing the Knight armour set and Warrior armour set.\n\n2.  Can we please get some kind of weapon and shield transmog? Having armour cosmetic slots was awesome, but can we please get some for weapons and shields?  As of now I think (but don't quote me on this) that you will slowly unlock the crafting recipes for various weapons you find?  But I'm not 100% sure what causes them to unlock and not sure if it applies to all weapons.\n\n3.  Please expand on the armour dying mechanic.  As of now it is very limited as to which armour and how you can dye your armour sets.  But it would be cool to be able to change the colour of the armour plating for melee armour.  I really wish I could change the colour of the armour plating on the Knight armour set and the Mercenary armour set.\n\nAll in all, Enshrouded is a game I 100% recommend if you like a open world survival RPG.  Its great for both solo and co-op play.  Do take note this game is in EA, so even though I did mentioned things I have issues with above, I still do love this game and hope the Devs will eventually come around to addressing the issues I've mentioned eventually.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was just looking for something cozy, but this game far surpasses my expectations. The world is huge and the scenery is BEAUTIFUL! I want to build houses everywhere, so I can sit back and admire. That said, there is more to do than just build. The exploring is fun and the enemies can be skilled to match your style - the whole game can be adjusted to match your style. \r\nSeriously recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I've ever played and I've played a lot! I'm just telling you: if you like this genre everything in this game is just what you would wish for. It's like...as close to perfect as I've played in the genre. And now they just released highly interactable water?? I played it about a year straight a year ago and after a layoff... this is where I'll be for the next months! I can't wait to get back! (In truth been setting my private server back up in prep for a couple weeks here...lol!)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enshrouded has come a long way during early access, and it has been great to see how many updates the developers released. Each one added a ton of content or new mechanics, and  it's hard not to notice how much care went into creating their world.\r\n\r\nOne thing that stood out to me was the team adding bodies of water and even flowing water into the game. Players had been asking for it from the start, and even though it was very hard to implement into their voxel engine, they made it happen!\r\n\r\nThe visuals are also a highlight, especially the lighting. The atmosphere during sunrise, in dark caves, or in the shroud itself looks amazing and gives the game a lot of personality.\r\n\r\nOverall, Enshrouded has become something special, and watching it grow with each update has been a big part of the fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I hate the \"survival\" aspect of open world survival crafting RPGs. I hate meters and managing them when there is a large interesting world to explore with fun mechanics and character depth. This game lets me eschew hunger (disgusting) and durability (the worst). I still have to eat to get buffs, but I am okay with finding interesting ingredients while out in the world and combining them to get the buffs for my class and playstyle. Food not even required. \n\nThe devs do great with this game. There is still a little bit of QoL to do, but I thoroughly enjoy this game. \n\nP.S. Please allow me to hold F to gather/harvest.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I am a big building/survival game nerd. I'm a sucker for those titles. Often caught myself buying those risky early access titles (yikes). I've played 800h+ of Minecraft, 400h+ of No Man's Sky, 300h+ of Satisfactory, 200h+ of Valheim, 200h+ of Ark Survival Evolved, 100h+ of Rust, 100h+ Cities Skyline, name a building/survival game, I've probably spent hundreds of hours on it.\n\nEnshrouded stands to become one of my, if not my favorite game of the lot. Here's why;\n\n## Build\n\nOne of the best, if not the best building game. The adaptive voxel-based building system paired with the free-placement of detailed furnitures as well as the possibility to place wandering NPCs makes your build come to life. Enshrouded's great, colorful and vibrant graphics lets you enjoy your creation exactly how you imagine them. Every building can have the feeling you want, from magical greenhouses to sadistic dungeons.\n\n## Survival\n\nThe survival aspect of the game looks a lot like Valheim. The food system is almost identical, forcing you to eat different kinds of food to get the full buffs. Although I don't play on the highest difficulty, the survival aspect of the game seems to be much more forgiving than Valheim. I have yet to spend an entire afternoon running after my dropped loot, only to die again trying to leave the damn swamp. I have yet to unlock cooking, but there is enough variety in the ingredients to lead me to believe that, combined with alchemy recipes, it will be decent and varied enough for the sake of combat and exploration.\n\n## Combat\n\nSo far the combat is challenging and has enough depth for a survival, adventure, building game. It can feel basic if you're used to Souls-like games, Mordhau etc. but IMO it's diversified enough through various combat styles to not get boring. It's Hogwarts Legacy-level magic combined with a basic medieval RPG (so far). Grinding for rarer loot and working towards upgrading it feels meaningful and rewarding. I hope that the game continues to scale in a similar way for the entire playthrough and add more challenging end-game to encourage replayability.\n\n## Exploration\n\nThe world is beautiful so far, and I've almost only seen forest and mountains. I have yet to leave the starter biome (the map is huge). Points of interest are an interesting blend of combat, puzzle and platformer, which keeps the gameplay varied throughout the exploration. There are few QoL Mobility equipement to craft which can make moving around more efficient and interesting. Exploration feels rewarding and pushing your expeditions too far can be deadly. You have to explore strategically and be prepared for almost anything (although I would love to see some dangerous random events added to add even more to this).\n\n## Depth\n\nA lot of these types of games are missing depth. They include so many different systems that they often fail to add sufficient depth to make it meaningful to even want to reach the end of their mechanics. They often present you with the same old building, crafting, cooking, fishing systems, each lacking depth and meaning to your progression. The games scales in content, but not in depth or rely in a specific gameplay aspect to justify replayability (PVP for Rust, Endless Exploration for NMS, ...), or some very obviously flawed systems make it much less rewarding. In Enshrouded case, so far, it seems to be a little bit better on that end.\n\nAll in all, if a game that balances survival, building, combat (but not hardcore) and exploration almost perfectly (in my book), you'll definitely enjoy Enshrouded.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enshrouded is a great game and I'm having a lot of fun with it. However I don't think it's perfect, but it sure is close enough to it that I don't mind it's flaws and will keep playing anyway\n\nFirst of all I like that the game gives you options to customize how you'd like to play and the level of challenge. That is always appreciated especially for me who likes playing games like this for exploration and building more than combat \n\nI like the atmospheric music when, it's especially good when I'm gludiing a long distance, looking at the world and enjoying the tunes. \n\nI like how the game looks. Sometimes it takes a bit to load textures in but it's usually snappy.  Although I feel it's somewhat limited in things like character creation. I have a list of characters I usually recreate during these sort of games and out of all of them I was only able to make 1, decently.  So if you're looking for a game that has a crazy good character creator that will ensure you can make whatever character you have in your head? This is not it. \n\nI like building. The way tiles merge to fill up spaces is satisfying. Building in this game IS satisfying. It makes me wanna make an effort at making something good. You'll be doing a lot of back and forth for material hunting for the building blocks tho lol. (Except maybe later in the game where you're gonna be more full on basic materials like stone and wood) \n\nThings I don't like are crafting times. Even set at 200% I just DO NOT see the point of stations havingcl crafting timers and this seems to be a thing in most modern games. These are f2p mobile mechanics in a game I paid for. When I need material to build a station and/or gear, I don't wanna sit there for 15 minutes waiting for it to finish crafting so I can progress with adventuring. \n\nLike most of these games, it becomes extremely grindy for resources the further you go in. I learned you should place down alters next to resources you'll be coming back to often if they're far from your base. \n\nThe map will easily overwhelm you with 700000 question marks that aren't even that important and are just locations for you to discover. Rather than let you explore yourself, the game holds your hand and tells you where most locations are. Just let me find them myself. That is part of why exploration is rewarding. \n\nGenerally, you'll have like 12+ active quests or something. most, of course, are for npc survivors that you rescued and they all boil down to \"go here, find something, bring it back\" or sometimes hidden treasure with gear/weapons that are worse than what you already have so their only use is salvaging them. It just feels like a waste of time. \n\nAll in all though, I think Enshrouded is one of the better games in this genre and I'm having a good time with it. I'm sure it'll only get better and better with time!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great survival game with a few major exceptions:\n- Lack of animation cancelling\n- Red Dragon Youngling fight",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has been a breath of fresh air for the survival game genre that won't end after a week of grinding. This game feels like a mix of Dark Souls and Skyrim with the building of Minecraft/Valheim. For the people who like exploration and combat you're in luck, Enshrouded offers many points of interest to come across with lots of hidden loot and challenging enemies along the way. Or if you enjoy building, this game offers one of the most intricate and detailed building experiences I have found if you have that itch to make some stunning builds. I would encourage anyone to try this game out, you won't be disappointed!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enshrouded is probably one of the best co-op survival action RPGs out there.\n\n[u]Game World / Story / Quests:[/u]\nThe world with all its biomes is really massive, is looking beautiful, has a lot of interesting places to discover and explore and most importantly, it does not feel empty. Quests will take you to almost every location and they feel diverse enough. The Shroud also allows for different gameplay and is a clever way to control the progression, so you have to follow certain main quests, while still having a lot of freedom. The underlying story sets the general framework for the world and why you are there, but it has not too much impact. There are a TON of quests, many are optional. Depending on your playstyle, progression can be really slow.\n\n[u]RPG / Combat / Gameplay:[/u]\nThe skill tree and various roles are fairly complex, with many different abilities to suit your character. Specializing and splitting up roles does give you benefits and goes well with 3-4 players. The combat system is fine, sometimes a bit to easy. Balance could be better, some abilities are almost useless, while others are mandatory to succeed. Although there are a lot of different enemy types, you rarely have to fight them differently. Boss fights are cool, but there could be more of them.\nTypical RPG-elements like looting, leveling up gear, different armor sets, food-buffs are all included and mostly are implemented well.\n\n[u]Building / Crafting:[/u]\nThe building system allows for extrem freedom and creativity. One of the most outstanding features, setting it apart from other games. Due to the amount of complexity it can get a bit fiddly here and there.\nFarming resources can get repetetive, depending on how much you want to build. But overall the game offers a lot, if you love to build.\n\n[u]Graphics / Sound / UI:[/u]\nWhile having a beautiful art style and the game world looking really nice and atmospheric and immersive, the details of textures are not to crazy. But they dont need to be for this type of game. Still it is very demanding from a hardware perspective. Sound design is fine.\nSince it is a RPG-game, you spend a fair amount of time in menus and inventories. There are a lot of QoL features, to make some things quicker and easier. But there is also more room to improve.\n\n[u]Co-op:[/u]\nThe game really works well with multiple players. The world is big enough, a single player might even be overwhelmed. In the End, gaming is a lot more fun with a group of friends, and Enshrouded is definitively providing that!\n\n\nDespite being an early access game, it already feels very complete and the developers seem to improve the game further, including community feedback.\nIn conclusion i can for sure recommend the game, especially for people searching for great co-op experience, where you can sink many hours into!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Downloaded the game last year and never gave it a fair shake until a week or two ago. Its been great. there's tons to do, satisfying combat and a great building system. Definitely worth playing if you're interested.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is by far the best build craft game on the market and it's not even 1.0 yet.... it's a easy 8/10 especially for the price point Keen Games has this as.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just keeps getting better and better. Huge, immersive and clearly made by people who just want to make a great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game! Love the mechanics and very happy with all the love this game has gotten this year!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best survival crafting games at all. Beautiful graphics and the best building system there is.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game made huge improvments in Terms of gameplay and grafics this year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is an absolute blast, Personally I think this is the best survival game ever made. There have been so many amazing updates and the game is now massive and I look forward to always jumping back on. \r\n\r\nMy only gripe is the combat, I do feel the combat seems fairly simple and boring at times. I do hope they decide to dedicate a good amount of time to rework some of the combat and make it a much more deeper mechanic with more weapons, fighting styles, much more abilities and move sets,  etc.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most beautiful and addicting game I have played in a long time. Whether you want to relax, or focus on travelling to an untouched tomb; there is always something fun to do. If you are looking to build a beautiful base(s), there are so many different options; and endless ideas! This is the most fun I have had for years, playing enshrouded, and exploring the vast world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enshrouded scratches the same itch Valheim does, but with its own magic. \r\n\r\nThe gliding is pure joy, the sunsets are gorgeous, and stumbling into something new never gets old. The base-building is top-tier, and it’s easily become my favorite survival builder. Can’t wait to see what the full release brings!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is god tier. It gets better and better. The devs actually listen to their players. \r\n\r\nThis game is fun, this game is enjoyable, this game just keeps getting better. This is what EA done right looks like. This is what a survival RPG looks like.\r\n\r\nThis is what a AAA game (should) looks like. This is what these billion dollar companies should be doing when it comes to their games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Im Realy Like the Game. Good art, Good gameplay. Easy Building. just I don't have any friend that I know to play with. T_T",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There is a lot I like about the game... and a fair bit I don't...\r\nMost are small niggles and I am sure the devs will get to in time.\r\nThe main thing is the game is active alive and getting lots of updates !!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\n\n- Very, very beautiful looking game, I've rarely seen a game look so good. I always said, all a game needs to look good is a lot of vegetation + good lighting, and this game perfected that.\n\n- Combat and skills are fun and don’t really get boring.\n\n- Base building is very detailed + you can build underground.\n\n- A lot of biomes that look very different from each other.\n\n- Exploring is a lot of fun until it’s not anymore (see cons).\n\n- A lot of quests and content.\n\n- Dungeons/Camps/Caves are a lot of fun; some of them take forever to do (in a good way).\n\nCons:\n\n- Stamina! Why is stamina a thing... The map is already way too big, why limit sprinting/gliding? But the worst thing is the stamina consumption while mining or chopping trees. Just why? It serves no purpose at all. It makes no sense how combat doesn’t use stamina but everything else does. It just slows down progression for no reason at all. The only thing that’s okay is stamina while climbing & rolling. Just let me mine and farm without having to stand still for a minute to refill stamina.\n\n- The map is way too big for the amount of content the game has. There are not enough bosses or enemy types in the game, which makes it get repetitive really quickly. You fight the same enemies over and over again in every biome. It’s always either the Shroud, Humans, Undead, or Vukah enemies, and that continues throughout the whole game.\n\n- Exploring becomes less and less interesting the further you get into the game because the loot is randomized. You can do a Hollow Halls dungeon for an hour and get the same loot from the final chest that you get from random normal chests in the open world.\n\n- Crafting feels weird sometimes. Why do I have to wait 10 minutes to craft something? It makes it feel like a mobile game.\n\n- I’m playing as a Mage, and the auto-targeting with wands can be really annoying. A lot of times there are enemies right in front of me, and the auto-targeting will lock onto an enemy far in the back or in the air.\n\n- The NPCs in your base are really annoying because they scream and make noises every 0.5 seconds.\n\nThings I want to see/could be better:\n\n- A \"Sort to nearby chests\" button. It takes a long time to put everything into chests after coming back from a loot trip.\n\n- Expanded skill tree.\n\n- Base raids + NPCs defending the base.\n\n- More interesting loot/rewards for clearing long dungeons/camps.\n\n- Mounts! The map is so damn big, we need some kind of mounts. No flying mounts though, please — that would ruin exploring completely.\n\n- Modding support. Just let people mod the game. It makes every game better, especially these types of survival games.\n\n- Give people more control over how they want to play. I complained about stamina already, but I wouldn’t have done that if I had the ability to just turn off stamina.\n\nOverall: I enjoy the game a lot and know it’s going to do well. I’m not too harsh with my criticism because I know it’s still an Early Access game in the end.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm addicted to this game! Enshrouded dumps you into a massive world and basically says “Go nuts,” and we absolutely did.\n\nThe map is huge and sooooo pretty. I spent my first hours running around going [i]oooh[/i] at every shiny thing like a good little loot gremlin I am.\n\nBuilding is top-tier. Total freedom with 1m, 2m, 4m, roof and terrain blocks, so go ahead and craft a majestic base or whatever architectural war crime your heart desires.\n\nMining is its own chaos. You can dig through rock, walls, ground, and even the [i]definitely don’t touch this[/i] bedrock. Naturally, we touched it. And reshaped it. Devs, please don’t look at our hole.\n\nGraphics are insane. You just have to take a moment and admire the views. And with the new water added, the map feels more complete. Can't wait to see what the Devs will cook up next!\n\nThe skill tree is massive, there's 12 class paths you can mix however you want. There is definitely something for everyone!\n\nIn short: 10/10, will continue digging the deepest hole and looting everything.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I started playing this game with my good friend Sam. since playing we have both clocked in 200 hours between us. anyway long story short. I have quit my job.\r\n\r\nGBYM",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So much content for an early access game. Some studios would have called it v1.0 a long time ago, but Keen Games keeps going, filling in this massive map with so much detail, scale, verticality and intrigue.\n\nYou see the mountains over there? Yeah, you can climb them.\nAnd tunnel through them...\nAnd build an entire base inside of them...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A slow start but becomes even a very relaxing and exciting game where you can decorate your house or beat dragons. Still need some QoL adjustments but for now an enjoyable experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best survival-crafting games out there. Great progression, solid building, and fun combat. NPC gimmicks add life to your base and make the world feel more alive. Overall, a polished and enjoyable experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I very nearly marked this as \"not recommended\", but I suppose it depends on what type of game you enjoy playing.\r\n\r\nIn effect, this is a bloody amazing base-building game with awesome \"vibes\", and some really great exploration. But the combat is just... well, it's terrible for those that enjoy \"proper\" combat, and that's a big let-down for me given a huge basis of the game is to be \"level up, choose your skills, fight the stuff with magic and weapons\". It must also be said that the game does come across a little \"childish\". But I still recommend the game if you're okay with not-serious and unsatisfying combat/levelling as the aesthetics and base building is AMAZING enough to make up for it. It's a chill game, pick it up on sale.\r\n\r\nSo a TLDR would be: Great if you enjoy base-building and light colourful vibes, with some good fantasy archetypes. Bad if you're looking for intense or skill-based combat. Bit childish.\r\n\r\nWhat's good:\r\n- Stunning visuals and vibrant colour. It's a very pleasing-to-look-at game\r\n- Audio is really good. Each environment has it's own music and sounds which really makes for good vibes  \r\n- Cannot overstate how AMAZING the base building is in this game; it's arguably the flagship for the game. It's easy and intuitive, satisfying AF and makes even not-very-creative people have the ability to make something that fits their vibe. You can make anything from a whole town, to a wizard tower, to a grim hovel. Honestly, the base building is just SO good.\r\n- The fantasy aesthetic is vibrant. You'll get swept up in it easily!\r\n- The exploration and detail that has gone into the map is vast.\r\n\r\nWhat's bad - combat specific:\r\n- Combat, combat, combat - what a let down! The whole design and energy of the combat gives off \"children acting out make-belief fantasy fights in the playground\".\r\n- The combat doesn't appear to be overly skill-based at all. Rather, it's overly simplistic and not fun or engaging at all for those that like proper challenges, timing your buttons/reactions, etc.\r\n- I recommend researching other Steam threads on this as people have discussed the specifics better than I can express it.\r\n\r\nWhat's bad - other:\r\n- The character design/lack of customisation. Perhaps it's unfair to compare it to other games, but I find the design of the characters a bit silly and gives the game a bit of a childish feel to it. And it must be said that, in a game with such great base-building options, why so few character customisation options?\r\n- The button layout/mapping is pretty poor. I highly recommend re-binding keys as needed as the initial layout is... not great. (Really not sure how the game has developed this far without more people addressing this, to be honest. I've played pretty complex games with a lots of toolbar management, resources, etc. and they're all much easier to manage than this... Once you re-bind things you can make it make more sense, but I wouldn't be surprised if a full overhaul is put in before 1.0 releases)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everything! I absolutely adore this game. I don't need this to be posted, I just need ya'll to know this game is amazing and I appreciate all the hard work.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Having played Terraria, Valheim and many more titles i will have to say this is a gem! Alot of fun and a big world to discover! 10/10 solo or with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of best open word survival craftin games wich i started playing them in early ecess ... and it's progress in growwing in content dovloping is awesom.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm fairly hard to please when it comes to survival crafting type games...but this is fantastic even in EA. I've owned this game for quite awhile and it's clear the devs stick to their roadmap and listen to the community. Multiple updates have been released and they have all been great with relatively minor (but quickly fixed) bugs.\n\nAs for the game itself:\n\n1.) It looks incredible graphics wise. The amount of times I've stopped because of the insane lighting at certain times of the day is countless.\n\n2.) The world is massive and handcrafted as opposed to the plethora of half baked \"procedural\" games we've seen.\n\n3.) Exploration is inviting, this is huge. If I decide I want to do a quest and head that direction, there is a fairly large chance I will get sidetracked by something I spot along the way and will veer off course to go check it out. This is what made exploration in games like Skyrim great to me. \n\n4.) Gear progression feels pretty nice, the grind never feels excessive to me. There is a grind to gather resources etc...but it is not overbearing.\n\n5.) Quests are plentiful if not slightly lacking in some ways, there is no solid story to follow but instead you will find lore notes across the world that help further explain what has happened. Generally it is a \"go to this place and retrieve this\", if it weren't for the variety of places to see etc...this could be a negative to some. Quests while required to progress, are not lore dumps of a story.\n\n6.) Combat is okay, this was the weakest point when I first started playing the game. AI attack variety etc..is not very diverse. I feel it has improved slightly in some ways, the addition of gems were a major improvement in variety of weapon builds.  At the end of the day combat is still quite simple, you dodge and attack or you tank and attack. Z\n\nEDIT: It looks like there has been a entire team recently formed dedicated entirely to combat, I would expect large improvements to combat to be on the horizon. \n\n7.) Building/Crafting are among the best if not THE best of any survival/crafting games I have tried. It just works. The insane amount of items to unlock and craft can keep people busy for countless hours.\n\nFinal Thoughts: For less than $30 I'm not sure I've played a better survival/exploration game. This sits alongside Valheim at the top of this genre...even if they are totally different games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes, exactly what I was looking for. Not too survival, not too fantasy. Semi-perfect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best open world PVE crafting games I have ever had the pleasure of playing. \nSuch an incredibly well done game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game ever for me! As someone who loves survival games, base building, and exploration.. THIS IS IT! The team always sticks to their promises and keeps delivering impressive improvements. The new Wake of the Water update was one I’d been eyeing for so long, and IT DID NOT disappoint. Every update is such a visual masterpiece ^^\r\n\r\nThere are so many options to build that I keep getting ideas after ideas on what to create. It really encourages creativity and lets players showcase their talent, bringing their own visions to life and shaping their bases exactly how they imagine them *coughs* built my own big settlement that one Flame Altar is not enough lol\r\n\r\nExploration is such a vibe too! Every corner I come across is jaw-dropping !! I truly appreciate the dev team for the effort and attention to detail they put into making this game so wholesome. Thank you sm! Looking forward to the upcoming updates and any new games you may create in the future!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Full disclosure, I am part of the Enshrouded Creator program. That being said, I have had this game sitting in my steam library for the past 6 months waiting to give it a try. I recently decided to try it, and it is amazing. Probably one of the best survival games I have played. I have played ark, 7 days to die, the forest, scum, and many more. This one is definitely one of the better ones. Its like survival meets skyrim. If you like the open world, sandbox, survival genre, definitely give it a try and follow shockradio on twtich ; )",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "100% worth the price. This is one of my absolute favorite survival/exploration/crafting/base building games of all time, and it continues to get better as the amazing devs continue to build on it. If you're at all a fan of the genre, you're missing out if you skip this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I didn’t expect to get this hooked, but Enshrouded completely pulled me in. I played it solo, unlocked all of the game’s achievements, and enjoyed every bit of the journey. The world design, combat, and progression are all incredibly satisfying, and the sense of discovery kept me coming back until I’d done it all.\n\nEighty hours flew by before I even realized it. Enshrouded has a great mix of survival, adventure, and RPG elements that’s worth every minute.\n\nEasily one of my favorite survival RPGs. Excited to dive into the new Wake of the Water update!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good survival, grindy game to sink some hours into.\r\nbetter with friends and higher difficulties to really unlock the aspect of using proper potions and farming matts\r\nsome of the farming is a bit much, having to go back to older zones to farm regents and other items etc\r\nbut apart from that the game is quite enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "almost as good as elden ring. i absolutely love this game. would like to see a couple more things like a lantern that you can equip to your waist but definitely 9.8 out of 10 so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Today, a game with a building system that feels like Minecraft + Valheim + Conan Exiles all in one. Think of it as Minecraft, but grown up. We’re talking about Enshrouded, a co-op survival action RPG developed and released by Keen Games GmbH.\n\n[h1] Chicken Jockey [/h1]\nI used to play a lot of Minecraft. First on PC and later on console. That game consumed a lot of my time. I loved Minecraft because of the building, the creativity, and the freedom. I think that’s why I really enjoyed Enshrouded too. It’s definitely not a Minecraft clone, because this game is much more realistic (graphics) and way more RPG-like.\n\n[h1] Story [/h1]\nIn Enshrouded, you play as a Flameborn, one of the last survivors of your people. You wake up in a world threatened by a dangerous, mysterious mist. You head out to explore this world, defeat enemies, and slowly rebuild the old kingdom. You can create huge structures, upgrade your gear, and play together with others, up to 16 players at once.\n\n[h1] Early Access [/h1]\nWe have to keep in mind that Enshrouded is still in Early Access. The developers say they want to continue building the game together with the community. They want to actively listen to feedback and use it to add improvements and new content.\n\nThe game is not finished yet and will get more biomes, enemies, locations, crafting materials, recipes, gear, skills, and more building and decoration options when it fully releases. They say the current Early Access version is already complete at its core and offers plenty of fun, but will continue to expand. The price will go up after Early Access, so keep that in mind if you’re unsure whether to buy it now!\n\n[h1] Gameplay [/h1]\nWhile exploring the world, you’ll search through ruins, wander the wilderness, and try to become stronger along the way. Your goal is to bring the land back to life. You do this by surviving and building. Build structures, work out every detail, and place NPCs who unlock new workstations and better gear. The Shroud has created deadly bosses and corrupted factions, and it’s your job to fight them. When I first launched the game, it immediately felt good. I quickly got the hang of the basic mechanics and started exploring the world. During combat, I noticed that dodging is super important. I built my own settlement and crafted all kinds of different items.\n\nIt really felt like playing Minecraft again, but in a more modern style. I did immediately notice that it’s an Early Access game, but I think you should look past that a bit and give the game a chance. I found the building system enjoyable and pretty easy to understand. It’s important to dodge properly during fights and use powerful abilities and spells so you can shape your own combat style as a Mage, Ranger, or Warrior. Without gear, you’re nothing, so craft and upgrade legendary weapons and armor. Expand your skills and make sure you master them!\n\n[h1] Variety and issues [/h1]\nYou’ll quickly notice that the game is a mix of fighting, exploring, building, and gathering. That’s why I think it fits really well with players who enjoy survival + RPG. And it’s super cool that the game has co-op, without forcing it. But I did have one moment where I thought: I’m closing the game and uninstalling it immediately. I was peacefully cooking my meat, no enemies anywhere. Out of nowhere, a wolf spawned in and started attacking me. Because of that, I respawned behind the fire, inside the fireplace. I was stuck, and the fire (and the wolf) killed me again, making it impossible to ever get my loot back.\n\n[h1] Conclusion [/h1]\nSurvival felt a bit too easy, and I really missed enemy variety. Combat became repetitive fairly quickly since it’s mostly a simple click-and-dodge loop. After a few hours, I started feeling “done,” even though the game itself wasn’t. I just didn’t feel encouraged to keep going.\n\nEarly Access is definitely noticeable, especially in frustrating moments like when a wolf suddenly spawned beside me and caused me to lose my loot permanently. Still, the core of the game is strong. The mix of building, exploring, fighting, and gathering works well, and for players who enjoy survival + RPG, this game definitely has potential. I played solo, and with co-op your sessions can easily become more fun and much longer. And since it’s still growing, there’s plenty of room for it to become something really good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Crafting, base building, and survival. What more could you want, oh yeah the graphics are also on point. The combat mechanics are great as well. all around fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing build system, attentive developers, and extremely fun game play! Two thumbs up!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hand down the best survival game out there. Even when it first came to early access there were dozens of hours of content and even more if you like building, which this games building is fantastic. Since then they have had I think 5 massive updates that have added so much. I'm honestly flabbergasted at this game and if you're a fan of survival at all or even just building absolutely need to check out this game. A massive kudos to the devs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As I've gotten older, modern RPG-style games have felt daunting to me for some reason—a reflection on my changing tastes, certainly, and not the games themselves.\n\nEnshrouded has successfully recaptured some of that love for the RPG genre. Playing with friends on a custom server, this game is simply so much fun, even in its early access state. The promise of many more updates, which will continue to expand this already massive game, always brings me back. While it's not a game I play day-to-day, it's one I will definitely keep installed and ready!\n\nThere is a huge amount to do here: great gameplay, advanced base building, and my favorite part—exploring the stunning world the developers have created. If you have friends interested in survival and crafting RPGs, you will easily get many hours of enjoyment from this one.\n\nThis game is easily a must-purchase, whether it's on sale or not!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun exploration/ base builder. The world is vast and varied. The game play is customizable as well. Similar to Skyrim, you can choose a general melee, magic, or bow build and specify deeper in those talent trees. While the game is early access at this moment, it plays like a fully released game. No game breaking bugs, and every major update is more like an expansion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enshrouded is an nice spin on the survival genre. Building system is very well done, it is quite easy to build the way you want. Enshrouded managed to avoid annoying parts of travelsal with gliding and ever so green double jump. Battling is quite simple combinations of attack combos, stamina management and parrying, but it just works. \nI've been impressed by so far by enshrouded. It is good in singleplayer and better with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I get lost in the building lol removing rubble, rebuilding entire towns, its all very distracting. I really like this game, my only gripe is that without friends, there's not really much direction or maybe I should say any compelling incentive to leave the beginning area right away.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is truly a labour of love. It is still in Early Access and already has more content than some full releases, and you can tell that the people at Keen Games love what they are doing. And I hope they keep doing it!\n\nThe story is interesting, the game looks amazing, and the building mode is genuinely fun. The only reason this comment isn't more detailed than this right now is because I genuinely lack the words to describe how amazing and fun this game is.\n\nBuy it. It's worth the money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love this game. And the devs motivation and workflow should be the industrial standard for all these games. like valheim, etc. while they take 2 years for a little update, enshrouded delivers and delivers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The only game where me and my wife both enjoy the all aspects ( especially building and adventuring ) 110%",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Reminds me of a mix between Valheim/New World (without the MMO aspect).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's gone from pretty great to fantastic really quick and they just keep making it better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite other users voicing their concern over the UI, Combat, Building and other assorted bugs I still must recommend this game. \n\nMy only con so far is you have to wait in the main menu for about 5-7m for the shaders to compile.\n\nThis game is beautiful, there is so much to do and see in this world. If you see it, you can probably go there. Is there red shroud blocking access somewhere? Just go over the mountains. Although if you go towards the snow you won't be able to defeat the cold effect til A. You have gear for it and B. Your flame is 8. I got up there to the spot I want to build when my flame was 5, it is now 6 and my cold resistance is 6 @ the flame but 0 away from the flame. \n\nI love to build in this game, love exploring new areas and such. You can customize your game experience, you don't have to play it hardcore and can instead play a relaxed game. Setting up a dedicated server is quite easy, however updating it can be a bit of a bother. SteamCMD... \n\nAlso. If you think you're stuck and can't progress, look for alternate routes in.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "2500 hours in the game and i'm still not bored of the game. Playing solo or with friends there is building, crafting, survival, combat, lore in every level from relaxed to hardcore survival.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If the look & combat of Fable and building & voxel terrain of Valhiem had a baby, you'd have Enshrouded.  This isn't one of those EA titles that needs to bake before it's playable.  There is plenty to do, see and craft. I'm pretty sure there are hundreds of hours of this game in my future. Instantly one of my favorites and I'm only 11hrs in.  Looks like the Dev's are pouring their heart and soul into this and I am 100% down to support whats going on here.\r\n\r\nGreat game, you should play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is fricken sweet and so great with friends.\nFor the love of building play it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With over 600 hours in, obviously I like this game.  I like the building aspect of the game and the wandering and questing just add to it.   And you can set the difficulty to your taste.  From easy to down right suicidal.  I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Convinced my friend to play, shes known to enjoy these types of games. The only resisted that almost cost use playing was the compiling Shaders at the beginning. It'll take awhile and I'm not sure what the factors are for it taking any less time, but the game overall has been fun. Especially if you've enjoyed games like Valheim, feels much more polished that that, but both good games in their own. \r\n\r\nAnd a muchhhh better version of Runescape Dragonlands upon release.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Combat 6/10\nLiterally everything else 10/10\n\nIts a crime that you made combat tab target. \nEnvironmental damage can be very Counter intuitive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "THIS game plays fantastic on steam deck with xbox series controller.. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you love building this will become your go to comfort game. If not it will still be a satisfying adventure through a well crafted world",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A beautiful and enjoyable RPG experience, but it would be greatly improved with a well-developed campaign.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent survival crafting game, crazy fun to jump into with some friends!\r\nThe shroud mechanic adds a level of urgency and timing to the harder content and makes the game very fun and interesting.\r\nHighly recommend to anyone looking to have fun either solo with more forgiving rules for a more power dynamic sort of fun or to people with either a small or large group of friends trying to enjoy a game about fantasy and survival crafting!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best survival crafting fantasy game I ever played!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please, I need friends to play this game, it's so lonely. xD Add me if you want to game together! This game is good, but lonely.\n\nNow for the review: I played this game day one when it released, but quit, and came back  on the water update and oh boy it got a lot of updates. Now is the game perfect? No, It's still needing that QoL uplift before it can really shine. The game has a grind to it, not unreasonable but a grind none-the-less because of the level system. It's literally the blueprint to an immersive MMO being that you can go anywhere and build yourself a castle if you so choose to. Now the combat still feels a little weird with the melee and the magic feels either a little too OP or underwhelming, but I'm going to chalk it up to levels because some enemies are literal sponges if you crank up the slider, while others are cheesecake if you go any lower than default. Also the combat doesn't have weight which is what it's missing currently. There's some form of impact but there's no weighted feeling so the combat feels finky as it feels more like an arcade hack n slash.\n\nIf you want an easier time understanding how the game plays, it's like if Valheim had a baby with Breathe of the Wilds and this thing came out and in terms of building, it feels like Very Advanced form of Minecraft? It's weird I know but it works. You just need to get past the learning curb and you'll be making yourself a town in no time! Also the water updates are breathe taking. Please give it a shot and please enjoy this game with your closest friends, it's a fun one.\n\n\nWishlist Fixes:  \n\nCannot interact with NPC when they are standing on the flame shrine, or in a door way.\n\nUpgrade combat to feel weighted or more impactful as it feels like an arcade hack n slash or at least give us a heavy hit attack if we hold the trigger.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Devs still adding things. Didnt get the attention it deserved with Palworld releasing at same time. Deserves far more love/players",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Ugh, that was fast.  Bought this game two weeks ago and quickly became my new favorite.  Playing it after work every day. Then, in an instant, they release 'wake of the water' update and the game is wrecked. Combat went from maybe a little easy-ish to downright punishing.  Look, I've played Valheim for years and not unaccustomed to punishing games and combat, but this went from 0 to 100 through the patch.  Areas that I felt like I could fight in but had to be cautious now one-shot me.  Game progression is completely broken, I'm going to have to go back two zones and...what... farm new gear?  I didn't buy a gear farm simulator, I bought an open world game that I was enjoying through exploration and exciting combat that I could run away from if I strolled into a dangerous area. Now, I go exploring, step into the wrong cave, and now it's body recovery for an hour because I get one-shot trying to get my body back.\n\nAlso, blocking an enemy attack now takes a quarter of my fking stamina.  So, you have baddies on the map that swing 4 times before you can attack back.  Good luck with that.  Stamina gone, can't attack, dude with an explosive cannon lobbing crap at you at the same time.  The game doesn't support my play style anymore. Now I have be become some dark souls twitch master and perfectly parry every enemy or I'm laying face down two seconds later. You completely lost the 'breath of the wild' fun that was honestly damn well curated and replaced it with dark punishing frustration.\n\nYou get to keep my $30, but I'm moving on. I haven't had a fun game killed this quickly in a number of years.  Very disappointing.  Maybe the worst re-balancing I've ever experienced.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "This game has some of the best building in its genre, it has an incredible world, fantastic terrain manipulation and a perfectly passable crafting system. Unfortunately it has some of the worst combat in the survival and base building genre by far. So bad, in fact, that despite adoring everything else about the game, I cannot bring myself to commit to playing the game for any long period of time, because I know that I will inevitably need to engage in it to unlock some random thing that will enable me to go back to playing the part of the game that I actually enjoy. Its just unfortunate that a single aspect of this game destroys it's experience so much.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "I wanted to like this game, but the combat is genuinely frustrating and breaks the experience. Every swing moves the character forward like they’re ice-skating—there’s no precision or weight. Lock-on controls are clunky and confusing, requiring two buttons to switch targets, which ruins flow during fights. Enemies kill you in seconds while your own attacks feel delayed and unresponsive. It doesn’t feel like skill-based combat—it feels random and janky. The world and building look great, but none of that matters when just fighting basic enemies feels like wrestling the controls. Please focus on fixing combat responsiveness, hit detection, and movement physics before adding new content.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Overall this is an amazing game - almost everything is executed perfectly, from base building, to farming, to exploration, to collectables, to gorgeous and plentiful armor sets.\n\nThere are hundreds of quests, each with a story, that all add to an exceptionally well done world building full of lore and intrigue and drama in an age long past. A bit sad and gloomy, but enjoyable and a treat to go through and read about.\n\nThe base feels lively and comfy due to both the amazing building & decoration capabilities and the NPCs you can rescue and... er... adopt(?) I guess, that roam around you base if you let them.\n\nWhere it still needs improvement is the combat, which, imo, is the weakest part of the game.\nWhile melee is at least passable, with the caveat that dodges have no iframes (really, really bad choice), and blocking/parries are jank as hell and the timings are atrocious, and finally that melee itself has no inherent \"combo\" moves at all (you can spec into a couple, but no heavy/light attack or after-parry repostes for example).\n\nMagic is absolute garbage. Literal trash on fire. The staff is NOT a combat weapon, it is a \"stand as far back as possible and lob spells until all is dead\" tool of disjointed, boring destruction. You cannot parry or block with the staff, and you cannot bonk with the staff.\nWands are somehow worse. The staff at least has SOME oompf (fireballs go boom), but the wands are like pissing on the enemy and somehow they die. No stagger on hit, annoying auto-lock-on that I wish was toggle-able, and, cherry on cake, neither wands nor staves can do any sort of finisher or combo moves.\n\nHonestly magic feels like you become this glorified turret. Your only button is Left Click. No combos with jumps or dodges or whatever, just left click at enemy and watch hp bar go down.\n\nCombat needs a total rework - keep the talents like jump-smash and the dodge-attack, but give all weapons a lot more moves, and magic, especially, a lot more flexibility and just stuff to do with.\n\nOverall, a 6/10 game, mainly because one of the core pillars is depressingly badly implemented at the moment.\n\nNow, some might say \"but a 6/10 should be recommended!\" - to this I say \"No, not yet. When they rework combat, add more enemy variety, and make blocking, dodging, and magic not suck phalluses, then I'll change it to positive and give the game a 9/10\".\n\nI eagerly await a ton of bug-fixes, performance improvements and a combat rework, these Devs appear to be competent and listening, so I'm cautiously hopeful.\n\nEdit:\nI want to be more fair as to just how bad combat is:\n\nEnemies, even the weakest ones, always stagger you on hit. 2+ enemies can effectively stunlock you... however YOU cannot stunlock THEM. In fact, no weapon, regardless of size or speed, staggers enemies AT ALL. This completely breaks the flow of combat, since you have to spam block/parry mid-attack since the enemy doesn't care it was just whacked with a huge 2h hammer in the face.\nYou have no poise, yet enemies have infinite poise. How is this fair?\n\nMelee builds (1h + shield, 2h) have no adequate answer for big flying enemies. Small flying enemies can be \"pulled\" to you and you can quickly whack them, but big ones = death trap. You will pull yourself to them and promptly miss any attack and fall to your death or be forced to glide down.\nThe only actual answer is a bow... which is not buffed by any melee-based stat (Strength). So you just stand there, dodging annoying homing projectiles, while you unload 10 arrows into some flying blob.\n\nMagic also has no adequate answer for big flying enemies, since wands don't have the range, and staves have ammo + no homing + mana cost + slow cast = a long, long time to kill.\n\nEdit: Ranged (Bow) and Daggers. That is all. Finally good gameplay, shame all the other weapons are either bad or simply mediocre.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game is good overall, and it's really enjoyable at first. But after some time you will see why this game has some big flaws (unfortunately, as i really hope this can get better). I will write a lot here so if you have time to read and make a decision on this game I really hope this will help you. I started playing this game a year ago.\n\nI'm gonna start with the good things about this game.\n\n1. World. The world is nice and big. Beautiful scenery, lots of exploration to do, lots of places to explore, some big, some small. You can get lost into places tho, but overall, the world is amazing. 9.5/10\n\n2. Building. Not building in particular, but decorating what you have built. The game offers you a plethora of decorations and multiple designs for them. It really makes your base more enjoyable and not being boring and plain. 9/10\n\n3. Story? I'm putting this in the good parts even tho I never got into the story myself as I don't want to discredit it. I completely skipped every dialogue and everything that you have to read about the story mostly because the game is not finished, therefore, the story is not complete and they constantly add new story and new pieces into it (even the old world). When the game will be finished, I will definitely do a new play-through for the story. I can't rate this. so 0/0.\n\n4. Devs. Devs are constantly working on this game to improve it and add new stuff. Which is amazing. I really like this. 9/10\n\nNow the \"bad stuff\". The game can still be enjoyable, but after one year of playing and almost 300 hours spent into this I can say that this things are not good and really annoying.\n\n1. Combat. Combat is...weird...enemies are quite overpowered when they are at your level, and even lower levels. It only takes 2-4 hits, depending on the enemy to get you killed. Most of the time you are fighting multiple enemies. Dodging is decent, but sometimes useless when you are fighting multiple emenies as you can get stuck into another enemy. Blocking and parrying is quite useless. Try blocking or parrying attacks when you get attacked by 2-3 melee mobs and 2 ranged ones. Bosses and mini bosses are even more OP, with some attacks being unblockable for some of them. Your attack animations feel clunky. Enemies don't get dazed (what i mean by this is that if you attack a little earlier than when an enemy attacks, even tho you land the first hit, they will still hit you back). 4/10\n\n2. Builds and talents. When it comes to builds you have two viable options in my opinion. Melee, which is OP or mage which is decent. You have the options to play with daggers as well using sneak, but it feels pointless. Enemies will detect you most of the time. Archer builds are mostly useless due to the talents, they really have no great impact. Other than this for archers, the constant grind for materials for arrows is time consuming. Mage builds are decent, but only after a certain level, once you get quite a lot of talent points. Lower level mage you can scrap it, even if they added in the new update a low level spell with minimal resource requirement it still weak, compared to melee builds. Spells for later in the game are good but you don't have that many options. I mean, you have options, but it's quite a pain the ass having to waste multiple bag slots with spells and cycling through them when you want to choose what spell to use. Most of the time you will find yourself using 2-3 spells, maybe 4 at max. 3.5/10\n\n3. Old saves/worlds corruption after new updates. Would you like to spend time creating an interesting base for yourself? You can do this, but expect corruption after a new big update. They constantly change the old world. So for example, if you choose to make a home in the 2nd zone, if they change the world in that place, where you are building is safe (you have a protected area) but the things around your base will change. I'm talking about new terrains levels, new hills and mountains appearing. I spent this year creating an interesting base around the terrain I had, but with the last 2-3 updates, the world around my base became warped. New terrain levels outside my base, new mountains. I created a wall, with a gate on a road that was put there by the developers, last update moved the road, and now in front of my gate I have a huge hills. Now the base doesn't make any sense. 0/10\n\n4. Materials/resources grind. This is wack...even tho you can increase the loot amount from the world settings, you will still find yourself in a constant material grind. You can't make automated farms or anything like that like in minecraft for example, therefore you need to do this yourself. As you progress in the game, you will find yourself in a constant need of resources as, for example, you will need X,Y,Z material to craft A,B,C thing that will use on its own or help you craft J,K,L stuff. It literally takes a lot of time. 3/10\n\n5. Building and terraforming.\na) Bulding. Building is quite fun at start. You can create some nice looking houses and stuff. However, it's repetitive and boring after some time. You can only build in rectangle, square and cube shapes. You don't have circles or ovals. You can try doing some triangles I guess but it's looks wacky. (this is maybe because of my limited creativity but still not great options). All in all, building is fine, but being limited to rectangles is not a good thing. Maybe in a future update this will change. 6/10\nb) Terraforming. Don't try it. Or try it, and wished you never tried it. I personally never got to make it look good or natural like the world. You can still make it look a little bit decent. 3.5/10\n\n6. Husbandry\na) Pets. Pets are nice, but pointless. They are nice to have around your house and they give you a buff. You have a total of 6 pets but all of them give the same small buff to HP. Most of the time they will get stuck in different places and you will have to pick them up and put them back down just so you can see them running around. 4/10\nb) Domesticated/Tamed animals. You can domesticate wild animals. It's great, they provide you with resources/food, however, they require specific building around them in order for this to work. If you add fences (decorations) or just a thin wall, and put their bed next to it, when they wake up from their bed they will have a chance of spawning outside their pen, therefore not having access to food and not producing what they produce. Constantly having to pick them up and putting them in their pen is a pain in the ass. I feel this needs to be improved as this bug has been around since i started playing. 6/10 just because they give useful stuff.\n\n7. NPCs. You have NPCs. Most of them are useless. They just walk around your base, doing nothing, not working, not doing anything, maybe sitting on a bench/chair from time to time. Most of the time you will see them walking into a wall. So if you want to have a village/castle or anything like that and make it feel alive, it will feel alive but a little bit. The other useful NPCs are just for crafting and giving you workbenches, that, you guessed, you have to work. Again, they are not working not doing anything. (maybe i haven't discovered the way to make them work but I feel like I should have by now or at least being a quest in the game that teaches you how to put them to work.) 5/10 just because of the useful NPCs and workbenches that are vital to your gameplay and progression.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Graphics system couldn't be initialized.\n\nCant start the game, no official fixes for this either.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The game is very good. But performance is horrible. With a ryzen7 7800x3d and rx7800xt the game can't reach 60fps at 1440p native resolution with balanced graphic settings. The game also looks ugly with those settings. I remember it ran better when early access launched and hope there will be a performance patch soon that improves fps a lot so I can play it again.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Came back for the update and now half the time i load into an area i either cant move at all or it takes moving into the menu, escaping out over and over in order to be able to control my character. Sound effects and animations are happening 3 and 5 seconds after i input the actions. It's a mess, a steaming mess. On top of the lag in sound and animation now apparentll the torch works to illuminate when and if it feels like it. Stuck in a dungeon with no light at all, have to log out and back in, completely unacceptable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I reluctantly regret to give this a negative reveiw\n\nits not because the game is poor or not entertaining or a substandard product, in fact it is an amazing game, a massive adventure, if you like Valheim, Pax Dei or Conan type builder survival games this tops them all.\n\nit has one game breaking issue\nLag and tatency.... instability that behaves and feels like your on a MMO with extremely bad upload/download server speeds. \nfor some reason this game tanks all systems even though your PC superceeds the recommended hardware from the developer.\n\nwhats even worse, the discord community gives 'work arounds' to try to mitigate these problems that just make it worse, players shouldnt have to deep dive into command lines on windows to try to optimise this game to make it run as intended.\nthats not a fix, thats not the expectation of the gaming community, players should not have to reconfigure their PC to make the game run as it was intended.\n\nfrom memory this game ran perfectly fine when it was released, myself and several friends traversed the map and the story with no stability issues at all.\nbut now its literally unplayble, after about 10-15mins of play the game freezes, lags, loose all sound as the game tries to catch up on all audio effects that have been 'backed up' as you move through the world, and once it runs again your teleported into a red river of lava or appear 30-50 meters away from where you were... and get bombed with a bazzillion audio effects from your actions over the past 10mins...\nI lost count how many times i died trying to destroy shroud roots from 'warping' into the red rivers from Lag, even more trying to recover my dropped loot.\n\nLag...? like what?! lol, even though I am playing solo on a private world\nLag refers to Server Lag that goes hand in hand with MMO type games like Warthunder or SWTOR\n\noptimisation and stability improvements are needed.\n\nBut as i said at the start, the game is amazing, it just needs to be stable.\nthe discord channel is full of community complaints about the stability and other related issues.\n\nsome developer feed back on this growing concern would be great.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "game started strong, but now plays like garbage. the lag has gotten so bad i die regularly to the environment or lagging out and falling clear out of the sky. i used to truly enjoy this game but now all i can do is loathe how far it has gone downhill as far as playability is concerned. i run all settings at max performance and still lag out??? i used to be able to run the game at max quality. optimization is a must in order to make this a playable title once more(especially on public servers)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As of Update 7, this game is non-functional for me. Stays in eternal loading screen on save.\nApparently this is because of AMD GPU's. You'd think they would have done some QA. \nNerfs are pretty bad too, especially for melee characters. Devs seem to want to make this game mmo lite, with all the grind that entails.\n\nNote: I am on Linux. So this may not apply to you.\n\nOperating System: Nobara Linux 42\nKernel Version: 6.17.7-200.nobara.fc42.x86_64 (64-bit)\nProcessors: 16 × AMD Ryzen 7 9800X3D 8-Core Processor\nMemory: 32 GiB of RAM (31.0 GiB usable)\nGraphics Processor: AMD Radeon RX 9070",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The good:\nThe game uses a custom in-house engine, meaning there is no UE5 shenanigans. The keybinding system is one of the best ones I've seen so far in gaming, everything, including the menu navigation is fully rebindable, there wasn't a single \"hard\" bind in my <2h of testing. The world creation seems very V Rising inspired at least. The role system is very neat for people to be able to join whilst not compromising the integrity of your world.\n\nThe bad:\nThe system requirements of the game are heavily misleading, the game uses at least 8gb of VRAM on 1080p on minimum performance settings and even then it cannot go over 50fps on 1080p on an Intel ARC B580 and the utilization is locked at 100% while cpu utilization is 10%. To add on to that, the graphics settings changing have next to no impact on fps, the only thing substantially affecting it is the render resolution, so on an 12gb card you can get 60fps only on 720p with everything on the lowest settings. Compiling shaders is for some reason limited to only 7 threads, I have a Ryzen 7 5700x3d cpu, let me use it fully so I don't have to spend a whole hour to compile shaders. Yes, I did wait until the compilation finished and I tried the Endeavour Tool Fix and the results were the same. On top of all of that, there are heavy graphical glitches even on max quality settings with the skybox rendering random squares that flicker all the time. Save files also corrupt every patch, like V Rising, hopefully they learn from the failure of that project and not have that on release, that is unacceptable for a multiplayer survival game on release.\n\nOverall, for a game made in a custom engine with baked lighting and alleged support for all 3 gpu brands, the game needs a lot more polish before launching. I am aware it is still in early access but I cannot recommend the game currently in the state that it is. They need to re-test and be transparent with the actual system requirements and expected frame rates on which settings. For now it's a refund, but I would like to revisit the game if they improve on release.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "What happened to this game?!?! It used to run so beautifully the last time I played it getting 130+ fps constant, now it struggles to get 80fps in areas that arent even congested with FSR 3.1 on, all low settings. Uninstalled and will not be playing until they learn how to optimize. It's been out for 2 years now people, come on. If the game can't reach console standard fps on a $1000 PC, then you need to focus on making the game perform better...",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Hoooboy where to start...... TL;DR is: KG is doing the same thing way to many devs do lately, that is seemingly becoming more and more out of touch with the user base, and making changes to their product few if any wants and that forces the game towards multiplayer and making life hard for solo players.\r\n\r\nBut uh, the longer review isn't really going to be that much longer than the TL;DR I think.... We'll see after my rant. I'm just tired and have \"game dev\" fatigue, maybe that's why. They nerfed a lot of stuff regarding health, stamina and mana regen(and similar relevant stats) forcing you to play in a group unless you're the peep who soloed that dark souls/elden ring boss naked with an urn over their head. \r\n\r\nThey add more and more stuff to the game without fixing existing problems. I wish more companies did like CA(warhammer 3 total war) did with their latest fiasco, they delayed their coming DLC to try and actually hotfix a problem(even though we had to drag them kicking and screaming to do it). The new water addition to the game has added more grind, more forced ways to play and together with the previous Shroud overhaul the game has just become an un-enjoyable experience. \r\n\r\nOh, and I'm still forced to compile shaders every time i start the game for 30-50 minutes. They keep saying they're working on it but nothing has changed so far. Nothing, literally nothing, stops the game devs from increasing their technical debt it seems. \r\n\r\nI'm done with this game for now. Let it cook, don't buy it yet. Find out first if the devs are going to continue make these ruining decisions or if they're actually going to start listen again and make use of the tremendous potential their game actually has. If they do not, give this one a pass.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This is a negative review because the game was once stable, I never had a crash. Now I get them far too regularly (~1-15min) despite ensuring all steps have been taken to stop crashes I still get them.\n\nI have now lost 10,000+ runes due to this i.e. the act of pulling from inventory to character then crashes means they are no longer in server save or character save.\n\nI am beyond frustrated and the only fix is if the devs create a fix as I have followed every guide on how to stop crashes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Expansion dropped - Loaded up saves - Extreme Lag and stuttering - Loaded up New Game - Same Performance issues - Spouse and I had a blast on this game before this update - Logged into discord on the troubleshooting page and posted logs - Was told my GPU was overloaded to play this game on custom settings - I have a 3070 \"Not the newest but not oldest\" and it runs Battlefield 6 perfectly - Game optimization needs work.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is a lack of content in terms of combat. There is a lot to do for the creative people, so if you enjoy that aspect then this is a given buy. But if you came for the combat, the epic battles, the bosses, the character progression then you will probably as disappointed as i've been so far.\n\nAs far as i'm concerned there are maybe 1 or two bosses that aren't _just_ tank & spank (minor mechanics). The other enemies are extremely boring and repetitive. The same enemies repeated over and over, just different skins basically.\n\nI really think this game has potential, but as it is today i am disappointed in the lack of content and the way the team seems to avoid adding more traditional content.\n\nAlso performance; the game is very beautiful but the performance even on a top tier PC is severely lacking.\n\nOverall i don't regret buying the game, but i would not buy it again for the price knowing what i know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The progression is absolutely terrible. Needing to do dozens of quests for one crafting station unlock is so tedious.\nThe grind for mats is never-ending and stack size is small with resource gain being awful even on max settings. Stack size amount is not an option in the settings, I do not want to build 90 chests and deal with organizing that.\nThe combat is dull and stamina management is genuine torture, especially on some parts like the massive dungeons with puzzles.\n\nOverall probably the worst survival game I have ever played. For $30 you can get both valheim and terraria instead.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game and many things I do love. I love the building system. It allows so much flexibility and creativity. I love the UI and controller support is pretty good. The concept of the story is interesting and has potential.\n\nBut I cant recommend it because of the following reasons. \n\nMy character feels like a dwarf and the character creator has no way to adjust this. \n\nThere are tons of items in this game overfilling your inventory in the first hour. So you can build chest that hold very little so you build a ton. But you need to organize them otherwise you will not find what you need to craft anything. Then shortly you can make chest that allow you to craft from inventory except blocks for building ?????? WTF. This entire system on inventory management needs some work and balancing. \n\nThese are mild irritants to the dead world. Its beautiful but the only NPCs are enemys or your ANNOYING crafting people you summon, They wave and balk everytime I walk past them luckily you can mute them in the settings. Sure the story supports why there are no people but still. You have full towns just empty of life. Maybe a wolf.  \n\nAnd my biggest gripe is the questing. It starts of fine. One or two quest at a time. You see them on the map and make your way there. At some point early on it got out of control. I have 20 quests no clue what is next and they are scattered all over the map. Take this road there its pointed in that direction. Nope dead end to a mountain. I will go around. Field of Lava. Eventually you just try flying from the towers because you cant find any other way unless you drill a hole in a mountain.  \n\nSo I just quit. I had a quest log just full of nonsense with no clear direction of what the narrative is or why I should care about the alchemist lost mortar and pestle. A map that does not encourage exploration but frustration. And an inventory overwhelmed with stuff and three special \"use from inventory\" chests loaded with building materials I cant use from inventory. And four crafters waving and shouting \"hey\" like a drunk Navi from Ocarina of Time.\n\nIts EA they can fix his. Otherwise its a great base builder. That is it. I will give it another chance when 1.0 drops. But I am not optimistic",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've been looking forward to playing this game for a while now. However, unfortunately after the most recent content update this game is virtually unplayable due to repeated long frame drops, which I'm assuming is some sort of memory leak. I will check back and change review if this issue is corrected.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "wait for the update to be fixed before trying it,it was good before now its so bad,one block even perfectly timed on a enemy 2 levels below me takes all my stamina from full,stuns me,and i die in 3 hits,swinging a sword makes you slide in the direction you are facing drastically,and i found many instances where my stamina bar would go to nothing when im just standing in place.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game really seems to be interesting. Despite of that, I can't recommend it YET. My PC specs are much higher than the recommended ones and still I can't reach 50 FPS (maximum I got) unless everything is set on Low. Hope they fix it and work to make the game run better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Devs seriously need to take some time to do QOL. Things like 'auto-pickup' and 'party shared quest progress' being on the roadmap for your game is just silly.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I would love to be able to give this game a positive review. The few months I was able to play it, it was amazing. Unfortunately, the last 2 patches have made the game completely unplayable. I am stuck in the percentage of gamers who can't get past shader compilation without the game crashing. My computer specs well surpass the recommended, and I was able to play it previously. Fix your optimization, devs. Please.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not really an open world game. Just a typical adventure RPG on rails. The map is designed as a series of valleys you have to traverse, essentially making the game linear. The combat areas are all timed so you only get a few minutes to attempt a dungeon before the timer insta kills you. So if you like games that are linear with time pressure this will be fun for you.\nIf you wanted to explore a large world freely or take your time looking around in a dungeon, you won't get to do that here.\nNothing is procedurally generated, it's always the same map and the same stuff in the same spots. Zero replay value. The Early Access barriers are big red noclip barriers that just prevent you from traveling down paths that are still in development. You want to fly and explore? Nope, hit a transparent programmer wall. Why add flying and then give us nowhere to go? Gotta bait in the suckers with that trailer.\nEven on full I release I don't think this is going anywhere. The linear map design has ruined the game for me and fixing that would require a foundational game redesign.\nGo down path A, you have 5 minutes.\nGo down path B, you have 5 minutes.\nGo down path C, you have 5 minutes.\nContinue for 40 more linear quests until you hit the \"still under development...\" content cliff.\nAll sequential, all timed, the illusion of free will.\nIf you played Valheim you will wonder why this game even exists. Enshrouded feels like a bad clone missing everything that makes a game innovative. Enshrouded could be the most cookie-cutter action RPG of the decade.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The difficulty is too random. Some monsters in starting areas can kill most players in a single hit, whereas others will pose no risk at all. Players are presented with quests which can not be accomplished at their level. This fact often won't be clear until half way through the quest. The game also does not appear to scale well with the number of players. I've played solo and with 2 players, and the game still feels like it's basically random difficulty. I keep trying to love this game, and it keeps kicking me in the balls.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Solid RPG game, however I really hate how games like these do not deliver when it comes to character customization for POC. As usual there are less than 5 black hair styles with one of them being that terrible looking Killmonger cut. Not to mention no curly hair either??? Also face and bodies should lowkey be customizable but thats just my opinion. Please add more hairstyles for POC that actually look good and are not generic and ugly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "4070ti, i9 14900k, 64gb RAM. I don't have the nerve to play this game calmly. it lags every second, the effects lag behind, and the sound turns off spontaneously. there are Balance settings, 70 frames with a drawdown of up to 10. I get thrown back when running, the textures take a very long time to load. no matter what graphics quality you set, the frames remain the same, they don't change. I physically can't play the game until the optimization is fixed. :steamthumbsdown:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I just can't deal with the stamina system anymore. It used to be tolerable, but now with it raining all the time I have to constantly stop and find a place to hide in order to remove the debuff and then I get to enjoy the adventures of sitting in a hole I dug into the side of a mountain. Having to create Flame Alters just so I can get back to the area I'm adventuring in, when the rain subsides, feels so awful and takes away the big draw for this game, and that is in fact the adventuring. I'm sure when I get to a higher level it's better, but I don't play games just because it might eventually be better. \r\n\r\nI know you can reduce the weather. However, the devs want this mechanic in as is and that's what I'm complaining about.\r\n\r\nHaving to use the teleport system to cheat the mechanic feels awful. There should be a way to protect from the rain, while moving through the rain. All options force you to stand around somewhere and wait for the weather to stop.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really really wanted to like this game... it does a lot of things right, but at the end, packing a game with a thousand features does not matter if you do not nail down the simple stuff first. like fixing hit boxes when selecting stuff.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Combat system and progress system in this game is outright aweful . Stamina is GONE in one second of fight animations are totally LOCKING you in place you cant do anything, skill tree is mostly useless .. They say PARRY them yes go and parry 5 mobs at the same time each area in this game has massive amount of mobs which each can kill you in 2 hits .. Unless you are 5-7 levels above those monsters which you in most of the time are not . \r\nNext really stupid decision is how armors works or lets say they dont work they are outright crime .. first you cant find any armor which is better that you can craft after 30 hours i have GOTTEN nowhere because its constant RETURN here and there for your dead body ...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After almost 70 hours I'm just tired of the combat. The world and base building kept me playing but I'm fed up with the combat on my second play through. The melee combat can be fine but I just want to be a wizard and the combat with wands and staves just feels awful. The game has an input queue so you have to be careful not to do too many inputs and get locked in an animation. This alone doesn't bother me. Enemies are fast, enemies pop out at you from behind corners, shields/parry feel inconsistent, enemies will lunge at you and hit you from behind because of wonky hit boxes and attack animations, hordes of enemies will chase you down. All these factors together make for a confusing combat system. It feels like it should be fast paced because of the ability to parry, enemy speed, and hordes, but the animation queue and animations lock bring the speed of YOUR combat down really far. There are times where you just feel boned. Dodging feels inconsistent with what I think is no invincibility frames and more weird hit boxes where it looks like you have dodged away but still take damage like the game is lagging even though I'm playing locally. At least in games like dark souls, after you die to the guy behind the corner you know he is there waiting for you behind the corner but this game isn't like that. Enemies spawn dynamically and sometimes you get unlucky, sometimes you play for hours and only get unlucky. \r\n\r\nWhile I don't recommend this game, I don't think it's completely bad. If a bit of wonky combat doesn't scare you then 100% give it a try. If you have ever found yourself wanting to toss your keyboard through you monitor due to wonky combat maybe look for something else.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Officially done with this game. I loved playing it... until this water update, where they started nerfing players' builds across the board. With the latest patch, they essentially added even more nerfs, this time cutting damage perks on weapons in half. The game isn't fun anymore. I'm dying more than anything else when previously my level 35 mage FELT like a level 35 mage. And before any of this game's fanboys say \"then change your settings\", I'm going to pre-emptively counter with \"I shouldn't be having to change world difficulty settings mid-playthrough just to keep the same difficulty level those same zones had previously\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just started a fresh save, and the game runs so bad it's ridiculous. \n\nInstantly refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do NOT recommend the game in its current state. Just spent two hours making a new base, making it all pretty and functional. Needed to move the flame altar just a little, so deactivated it. Could not put one back down after I did that, was glitched out. So only option? restart the game. The entire base was deleted, all the resources gone. Hours and hours of resources gone, all the base gone, all the time gone. Lots of issues with lag (despite that I'm the host?) as well as many other issues. The game has absolute potential, but when losing all your shit like that.  It  can get F%@#d. i would refund it if i could.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "still find this laggy with a decent gpu and high ram and a ryzen 9. every game i got i can play max settings with ray tracing and all that yet this is the only 1 that is on low and still lags!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why am I waiting 45-60 min, each and every time I load this game - for it to \"compile shaders\"?\n\nAttempting to play the game while it is doing this act, results in 1-4fps.  Unplayable.  \n\nWhat the hell happened?  This game was working just fine like 8 months ago and now i refuse to wait roughly an HOUR to simply start playing. \n\nEACH AND EVERY TIME IT LOADS!!!  Wtf is this?!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a review is pending - but with how things are going, will probably not change. \n\nEnshrouded is an amazing game for exploration and for those with that creative talent for town and city building. You can make insanely pretty things in this game. If you are easily gripped by seeing amazing sights and things- and enjoy just simply wandering about with a healthy spice of being menaced by things far above you in level, this is a game you might enjoy. That comes at a caveat. \n\nCombat. \n\nSimply put if you don't mind basic combat systems that become VERY samey and never truly improve- or have much beyond the basic combos, I would snatch this game up on a sale. Otherwise stay away (ESPECIALLY if you enjoy melee combat that actually improves over time). \n\nWithout spoiling to much of what you fight in terms of bosses- the combat in this game left me with much to be desired. I've made a character for each archetype, and I mean EACH - and found all of them wanting barring the simplest one, archer- and the mage. (NOT warlock - the wand users)\n\nThe skill tree is deceptive. It is EXPANSIVE with some cool ass passives littered through it but within that giant alluring mess are keystone abilities that basically make melee combat have combos and moves that actually make combat NOT feel like a snorefest. I find it very lazy to have all basic moves like a riposte on parry or a dodge attack or jump slam attack something I need to spend skill points on. They have had 'skill tree rework' and 'combat rework' on their roadmap for two years and every year I come back hopeful just to see all theyve done is take more garbage onto the tree. \n\nWands skill tree is still pretty iffy considering wands are in a very awful place with the targetting system. Mages and healers get the world as their oyster- and all melee get a gem system you cant even touch at the start of the game thanks to rarity restriction and the gem forge restrictions that lead you into the shroud. \n\nNow on to bosses. Bosses are. Very interesting. They lack a creative touch that makes them a boss players will go, 'wow remember that epic fight?', except you can tell they want you to have that experience just based on map build up and scenery alone. \n\nThe city boss and mountain peak boss both have this flaw of being extremely frustrating- but i find the mountain peak boss to truly be an affront to game design. If you are a solo melee player, you will struggle - and most likely die on your first attempt with how poorly telegraphed some of its attacks are. You will be forced to bring a bow. The entire thing just kind of reeks- ill be real. The first 4 minutes felt awesome, but then all that hype gurgles down the drain when it yanks you out of immersion with some of its 'mechanics'. I wont spoil any more then that since if people DO get it, they can at least be surprised, since it was actually quite cool to do in the beginning. \n\nAdding the greatsword was an INTERESTING step- but one I think doesnt actually prove they plan on fleshing out the combat. I like to hope that maybe they are simply rushing to finish all the areas and exploration before making melee combat not feel like guff but... well. I'm not too hopeful. If you are big into the unga bunga and want some layers to your melee- stay away from this game. Save yourself the frustration - or conform to doing a hybrid, or grab it if you have 3+ friends willing to join you to soften the numbing boredom.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So many bugs for me. only me out of 3 others playing together and i get stuck with infinite load screens when teleporting or sometimes get stuck in place when i respawn or use a bed. forcing to either Alt+F4 or back to main menu. Its also weird how i can hear everything in environment on infinite loading screen and mouse curser pops up as if i am in the GUI if i open inventory or such. Happens over 50% of the time teleporting or respawning making game unbearable to play with friends at this time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you are interested in this game, read this first. This game has had issues since day one, and has developed more issues since I first played it almost a year ago.\n\nTo begin with, there is an issue with the way the game manages its files where downloading a 7mb update or replacing a single corrupt file will take just about as long as a fresh install. Some people on the forums say this is because all the game files are archived (bundled together), so the files have to be un and re-archived every single time.\n\nNext major issue, \"compiling shaders\". Once you have downloaded and updated the game you are good to play right? Wrong, after the ridiculously long update process, you will then launch the game to either an initially black or incredibly low res title screen (that takes a good while to render) with a little loading icon in the corner of the screen warning you that it is 'compiling shaders' and that you should wait for it to finish before playing the game. After waiting ANOTHER HOUR for the shaders to compile, I finally get in game and... you guessed it, more issues.\n\nNext, the game seems to unload any assets that aren't on the screen for more than 30 seconds. You open your bag, give it some time to load the icons for all the items you have. Close you bag for awhile and reopen it again, same thing! This also goes for weapons. If you use a wand, it will take several attacks before it looks like you are visually attacking. Stop attacking for a minute, and once again there is no visual indicator; wait some more. Similarly, the 'fast travel is just as bad'. Fast travel back to your base and you will be stuck on a black loading screen for another couple of minutes.\n\nHonestly, I have never played a game that left me this frustrated and made me feel like I wasted so much time. When I first played this game, I was able to overlook some of the issues, but following an update in the summer, the game was unplayable. I decided to wait it out until the next update, which just came out, and all these issues still persist. I would recommend waiting until the developers directly address the issues of update times and compiling shaders before even considering to buy this game (it has been a year). As it is, save yourself your money, time, and frustration.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "For the short amount of time I played the game I was having a lot of fun. \nBut the game runs terribly. I have a RTX 5080 and running this game on 1440p is still only giving me a max of 70 fps no matter what graphic setting I put it on. But the FPS drops are the real issue. Going from 70 to 10 for a second to jump back up makes me extremely sick.\nSo for now I will be refunding the game and I hope they will prioritize that above any new gameplay features.\n\nI'll come back when it releases out of EA to see if it has gotten any better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's like a bunch of really smart people made a technologically advanced game and forgot to put any effort into making it fun. The level design, as artistic and pretty as it looks, feels tedious and annoying. The enemies have annoying abilities that stun you. Dying is an inconvenience, not a punishment. The map is massive and everything is far apart with massive obstacles in the way, and you have no mount to get you there faster. The devs just assume you want to fast travel everywhere. They give you a million base slots, but building a single one takes ages. Every NPC has to be manually added into the game, instead of just being added into the hearth. You a dozen chests to hold your items, and you need almost every item. Crafting base objects is unimaginably arbitrary, consume 2 rock and 5 flint, make 100 blocks, and it takes anywhere between 70 an 90 blocks to make a piece, so you have no idea how many resources you need to do what you'd like. You die and your loot spawns in arbitrary positions. You get stuck in the shroud, along with your loot, die, and there is no way to get your stuff back without restarting the session. Sometimes 1 swing on stone gets you 3 pieces, sometimes 3 swings gets you 1 piece. Leveled item lists are completely broken, I found a level 42 item on the starter bridge and a level 39 staff after the first boss fight. Progression is completely chucked, you can find a gem crafting station far closer than the introductory quest for gem crafting. Grappling seems essential, but finding the grappling sites are like looking for a needle in a haystack, you'll easily look over one 3-5 times before noticing it, leading you to get stuck in the maze that is major dungeons. Quest markers will say an objective is above you when it is just, not, and the opposite is true as well. You essentially need to carry a bow, even if you are a melee character, just to hit switches in dungeons, if you forget, you might end up wasting an hour, or you'll die to enemies that fly and use ranged attacks, with you'll never hit. Starvation is a cool mechanic, but there is ZERO audio visual feedback for when you are dying to it, you just.. poof. Striking leaves a strange desync between the attacks and the audio and effects. On that note, sometimes audio just doesn't play for actions at all, like explosions that should have a lot of different sounds and visuals fall completely flat with a puff of smoke, a bunch of crap on the ground, and no audio. The enemy AI sucks terribly, I've cleared every boss without a single issue on Survival difficulty because they just have the same bland attack patterns and swing way too late. The hardest mobs in the game are the swarm mobs, the absolute peons, because they will stun lock you. Leveling is extremely painful, you should just, boost xp rewards to the 200% mark for mining and combat and not let it be editable. Lining up something like items to objects, or the rake for leveling dirt, is extremely frustrating, not intuitive, and a massive time sink. Aligning most building pieces is tedious and frustrating. All of the quests are fetch and feel very uninspired. The best story content is found in documents laying around the world but they are few and far between. The shroud timer makes no sense to me, it's just an annoyance. You die if it reaches 0:00, but the only consequence is that you have to eat food again (IF you are on Survival) and run back.\r\n\r\nThis game is a ball of tedium in a cool engine. If you are the type of person that can sink 500 hours into a game just because you like to make something that looks cool, like a castle in a mountain or something, you might enjoy it. If not, you should seriously steer clear. The action/adventure/game loop is dreadfully boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Why completing  shaders took so long on nvme and i have to do it 3 times in a week fix it soon it always kill the fun",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "why does this game demand more from a computer than elden ring, seriously consider your priorities. on a computer that can run VERY similar games this one doesnt even boot up. completely unoptimised and overly punishing on your system. fyi valheim, palworld, and satisfactory run perfectly fine, but this game cant even start.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The start felt too much like Fortnite the survival game, in the worst way...I wanted to enjoy this game but I feel like there is not enough there to grab you at the start and I didn't want to keep the game to find out if it would grow on me so i refunded it.\nI also feel like this game suffers a lot if you try and play it with too many players, I felt overwhelmed with pop-ups and didn't really know if I should be focusing on questing, exploring or survival.\nAlso my friends were struggling with performance a lot even after trying to make the game look like a fogged up mirror, so that is something to consider if you don't have a high end PC.\n\nThis game might become great when you progress but it's an expensive game to keep with hopes of enjoying it later.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I purchased this game to play with my friend, started up a deticated server, and I lagged... with a reported ping of 300+... even though... My server... was next to my PC.\n\nKeen needs to do some serious work on their net-code for this co-op game... that you can't really co-op on... on a deticated server.  I've not bothered trying it peer-to-peer.  May be better?  Once they fix the netcode, I'll take another look.\n\nThe second game I've ever requested a refund for.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game looks incredibly nice and thinking about playing it makes me feel like I'll have a good time, but when it comes to actually playing, it's incredibly boring, progression is a chore and there's just absolutely nothing to keep me going. The stories that you can run into through notes left in the world and quests aren't really an engaging form of storytelling, and the somewhat lifeless NPCs sending you on fetch quests arent either. Getting to the next material tier and farming for a high leveled high grade weapon (that will become obsolete on your next tier) can work on the short term but it quickly goes from boring to bothersome. There is just something in the gameplay formula that seriously doesn't work for me.\nThe combat seems as wide as the ocean, but is actually as shallow as a spoonful of water. There are different weapon types, supposedly many possible playstyles with the skilltree (which you can only even start properly unlocking at higher levels because most upgrades are just stat increases), but none of them have any proper depth. I'd much prefer if we just had 1 fleshed out playstyle but it had actual depth besides dodging and button mashing. And honestly, I feel like there probably is one in there (possibly melee adjacent), but with so many other options I definitely didn't choose that one.\n\nThe only part of the game that engages me is the building, but without being able to terraform the little random patches of shroud everywhere that serve no gameplay purpose besides messing up your builds, which is by the way like the most highly requested feature of the game that hasnt been added, it just always throws a wrench in my plans when I come back for a new update and I see it's still not a feature, and just makes you wonder what the hell the devs are doing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A janky, cluttered mess.\n\n-UI is bloated and is PAINFUL to navigate\n-Starting a game is really confusing when trying to play with friends for the first time.\n-Map design is really weird and some dungeons feel like they are either unfinished or were never playtested.\n-I mean seriously, some grapple hook placements, ladder placements, death pits, etc are just so questionable it makes me wonder if the devs actually tried to play their game. (I'm looking at you hollow halls)\n-Stamina is soooooo annoying dude, climbing uses so much and you have to listen to your character huff and puff obnoxiously the entire game.\n-Combat animations are boring and clunky, parrying is hard because the animations are so inconsistent and unclear. \n-Quest progression is weird and often has you trying to do things way beyond your level.\n-Hollow Halls\n-Character customization is locked after your initial creation.\n-... and more",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm constantly amazed by the building in this game. It's essentially voxel, and it's really fun. \n\nThe crafting system isn't anything new; but it works.\n\nThe quests are basically all fetch quests, but it's good enough to get you to explore the world.\n\nThe combat, in my opinion, is where Enshrouded completely fails. Sure, you can spend a lot of time building, but eventually you'll want different building materials. To get those, you'll have to engage in the game's combat. There's no \"creative mode\" either. The majority of Enshrouded's progression revolves around the combat.\n\nThe combat is pretty simple but I thought parries and dodge-rolling would be good enough. I was wrong. There are no i-frames at all. No i-frames when dodge rolling, no i-frames on merciless attack (the attack after stance-break). Dodge-rolling is meant to create space between enemies not dodge attacks. I guess there are people who like this, but I found it extremely frustrating especially since you have to engage with the combat to progress with the game. Combat is much less about learning enemy attacks and much more about having the right gear and kiting.\n\nThe stamina system is probably my least favorite thing. Even with the fully rested buff, it feels like stamina takes forever to recharge. Stamina in combat can make sense; it slows the player down and / or prevents them from spamming dodge (which doesn't make sense here because dodging doesn't have i-frames). Swinging your weapon doesn't take stamina, which is great, but using any tool (pickaxe, axe, etc) *does* take stamina. Especially in the early game, it feels like you spend more of your time waiting for your stamina to recharge instead of digging. Every other use of stamina is fine, but why does mining resources take stamina? \n\nTLDR: The game feels *really close* to a good game, but right now it's really slow and frustrating. Here's what I would change:\n- put some i-frames in the combat.\n- remove stamina cost from mining / digging.\n- add creative mode (inf blocks, no stamina, flying, etc.)\n\nI'd recommend this game if they added creative mode; the building is *that* good.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fire the people who created this game's combat system. It's stuffy, boring crap. Trying to fix it by copying hundreds of skeletons and giant hamsters just looks lame.I want to explore the world, but fighting here is not difficult, just tiring.This is the biggest flaw of the game that covers all its advantages with a crust of filth.All the opponents here are designed to tire you out. The game lacks weapon and enemy physics, and they always gravitate toward you with attacks as sharp as my diarrhea, or perform long, tedious series of blows. In the crypts with skeletons on the hard difficulty level, you will experience true hell. What idiot came up with this? Why? In the notorious Valheim, we felt every blow and enjoyed the battles. Are you practicing masochism here? And why are the enemies so ugly? The zombies in the shroud are beautifully drawn, but on the surface, ugly marauders and hypertrophied, overgrown hamsters await us. Why? Why is the main character a short-legged, ugly hobbit? He looks comical... why? I don't understand. Why are the swimming animations amazing but the combat animations ugly? Combat is as important a part of the game as exploration and construction...why??? The game could have been a masterpiece if not for these \"whys\"",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "it was great until I had to sit there for half an hour waiting for it to compile shaders every time I launch the game. no thanks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's unplayable since the last update... 2 fps on a 4070 with DLSS on",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you like Valheim, V Rising, or Ark Survival, play those games. In its current state, it has no idea what it wants.\n\nPlay solo, enemies spawn in the thousands, weapon animations lock you in place for minutes at a time, any dodge has no I frames, and default leveling is horrid.\nPlay coop, experience is \"shared\". Beat an enemy, its shared, kill a boss/break a root, no share. Harder difficulty results in a worse overall experience rather than making the game feel more difficult. PLEASE ADD AN OPTION FOR NEW PLAYERS TO MATCH WITH THE HOST'S LEVEL. I don't want to join a random server just to level or play the same quests 10 times because a casual player just joined.\n\nCombat: Hitboxes on par with Dark Souls 2, there is a lock on feature for fighting, not a bad idea. What they don't show is there is a soft lock on that is ALWAYS ON, melee/ranged/magic doesn't matter. Players and enemies have it, so if you don't use it every enemy can bash your head in when you are focusing on one of the other 20 that are fighting you. Stamina is a joke, rain can just erase half of your bar even with stamina boosting foods, standard attacks from enemies empty it with single hits.\nPerformance: Better than most other games, but it still needs work. Also, turn off small vegetation if you want to have a better time finding things on the ground.\nQuests: If you need 5 unique quests to unlock a new stand that changes a single recipe from a 3:1 to 2:1 ratio, just scrap the damn thing. Also, if the quest is to read 2 notes for a building block, WHY IS THE NEXT NOTE A KILOMETER AWAY PAST AN ENTIRE MOUNTAIN RANGE?\nUI: It's so busy, it starts to enter that Destiny 2/The Last Descendant territory of eye bleed.\n\nThis game only feels playable if you are cheesing something, whether it's a build, xp gain, or mobility. It is in a really rough state.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Building and exploration is lots of fun. Combat is not. Which is unfortunate, because a lot of the game's progression revolves around combat. I enjoyed my time playing, but having to constantly interface with the unfun combat system eventually got old. For the time being I think I will just wait for a combat overhaul.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Steam Deck support was on the roadmap on release then removed and seemingly forgotten. Early Access bait and switch.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Quantity over quality throughout the entire scope of game mechanics. Hard to recommend this when there's so many other games with the same core game play that aren't rough and unpolished. This has pretty decent graphics/world building and crafting, but other than that its significantly lacking in genuine substance. After 25 hours in the same world save, *everything* feels like a chore. Progression is extremely slow and not at all rewarding. \r\n      The building looks amazing though, they got that part right.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The setup, the lore, the world, the mechanics all excelent.\n\nCombat feels floaty, like there is no inpact, I think this could be easily solved with better character physics and an effect I have seen very few times. Dragons Dogma does it and it works. When the weapon makes contact there is a subtle jitter effect added to the attacker and attackee.\n\nAlso, customization options are essential, not to mention mod support.\n\nNow for this BIG one. This game runs like shit. You can have a top notch rig and have to run FSR garbage.\nI HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAATE FSR, DLSS and all that horrific garbage. It makes the game look blurry as all fuck and its infuriating that devs rely on it to get even passable performance.\n\nWe used to make games that look better with lesser hardware. Dramatically lesser.. There are no excuses here its insain.\n\nIf your game cannot perform well on a Highish Mid system on High settings with NO FSR/DLSS you have failed as a developer. Pure and simple.\n\nIf I cannot play your game at a reasonable framerate on native settings, I'm not playing it. If this game doesnt get better by the next patch in this regard its getting a refund from me.\n\nYou are wasting your time adding content if people cannot enjoy it unless they spend 6grand on just a GPU.\nFuck off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i loved this game. but after the first expansion any area you go to runs like crap. god forbid you dont have a 4080 or better because this game will not run unless your fine with the lowest graphical settings at less than 60 fps with dlss. at that point you will be experiencing pop ins and horrible lighting. please please allow is to play with static lighting and no more depending on AI or DLSS to optimize your game. i have a 3070 so maybe im just poor.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game balance is entirely ruined by every item respawning upon log out. Some may disagree, but I can't get past it as a solo player. Seems like an easy thing to have an option for upon world creation.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is really cool but i just cannot get over how stiff the movement is and how stiff the camera is. its extremely jarring and not fun to play with. The game runs pretty poor considering how good my specs are. Its sad that the devs have integrated Ray tracing into the game which already will tank performance for everyone. Im running all AMD specs maybe the game isnt good with AMD as well idk. and keep in mind i have also optimised everything. \n\nunfortunately i cant recommend the game with how badly stiff the movement and camera is and also how poor the game runs. i was able to get a nice playable frame rate with frame gen, but no way near what i should be getting. I will definitely revisit the game if mainly the camera and movement is improved cause it was almost giving me a head ache and if the devs can make it so we can turn off ray tracing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could run the game perfectly fine before this water update. Now anything above lowest settings is a lagfest. It constantly freezes every 2 seconds and even in the menu its unusable. Literally unplayable right now unless i want to play it looking like a ps2 game. Would not bother buying until its fixed tbh which sucks to say.\r\nmy specs are rtx 4070 AMD Ryzen 9 5950x 32gb ram btw. could run this perfectly fine back when i had a 3050",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While the content is great, I have two glaring issues with the game I cant get over.\n\n1. Movement is very jittery, instant acceleration, and diagonal movement ie holding W sprint + A/D is actually faster. Some very strange programming going on.\n\n2. The lag, performance, on a good spec pc, its not great. Ghosting artefacts, flashing graphics. While the game looks fantastic, this heavily brings it down.\n\nI hope the devs resolve these issues instead of pumping new content, until then I cant recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Normally I would recommend this game all day as it is easily one of the best in the genre. But for some unknowable reason they super hard nerfed the regeneration rates of health, mana, and stamina. Health is by far the worst offender with what feels like far less than half the rate it was before. Makes the game slow and generally un fun to me.\n\nLiterally everything else about the game is absolute gold, but I can't stomach the time spent sitting around. And yeah, they want you to use food and potions. You should have already always been using food before same as Valheim and potions are just so expensive to make that I couldn't be bothered to do the grind to make them in bulk. They are also for combat only, not the part I have an issue with.\n\nAll this leads you to sitting around for obscene amounts of time between combat encounters waiting for your bars to fill or wasting combat resources.\n\nI'll update to recommended when and if they add a difficulty setting to either toggle between old rates or just flat percentage sliders like many other areas. Until this I don't even want to play the game much less change my review.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Don't get me wrong, the game is good. Exploring the world is fun, farming is effortless, and everything looks beautiful. But playing co-op is simply impossible; constant disconnects not only ruin the experience, they cause a very negative emotions. You just completed a dungeon and earned an epic weapon, and then you get kicked out of the game—you reappear God knows where with an empty inventory. You've simply been thrown back in time 10 minutes. Have fun playing this game in co-op.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is not in a good optimized state no matter your hardware you are lucky to get between 30-70 fps it probably is a great game but the fps is so bad its unplayable currently i refunded it as soon as i could after i tried it mind you i have a 4060",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is great if you have a group of friends to play with, because it absolutely does NOT value your time whatsoever.\n\nHowever I will continue to play because of sunk-cost fallacy and because I was promised Capybaras.\n\nBuilding mechanics are 10/10. I honestly love how they did base building and I wish other games did something similar.\n\nCrafting mechanics however are 0/10. They are tedious and effectively require you to gather massive amounts of materials from 5 different biomes to start a 5-step process to get one item that you need to craft one piece of gear or a food item. It's not fun, it wastes your time, and honestly feels like it was done intentionally to pad the game out.\n\nAlso the Lesser Fell Dragon boss fight is the biggest piece of shit in this game and the fact that they haven't figured something out about it  by now kinda shows that Keen Games doesn't actually employ anyone who knows how boss fights work.\n\nTl;dr - If you have 2-4 friends playing with you this'll be great up until you hit Albanieve Summits, then you'll start to hate it. If you're solo you're gonna start hating things by about level 10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game needs stronger mechanical progression of some sort. Combat at level 5 feels pretty much the same as at level 20.\r\nThe skill tree is split in some things that feel almost mandatory and an overwhelming part that seems to hardly matter.\r\nAreas are visually distinct but feel barely any different in what you actually do in them.\r\n\r\nThe base building is great, but that alone is not enough to carry the game in it's current state.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Enshrouded is so infested with lag that my RTX 4070 can barely run the full game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad performance (CPU temp issues and very low fps even on performance preset for RTX 4060 Ryzen7840hs) ruined the game for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I should like this game, it has all the things I look for.. but.. It just doesn't click with me.\n\nFrom the lacklustre \"Story\" missions that don't do anything other than \"Go Here, kill that\"\nTo the world feeling both full of things but lifeless at the same time.\nThe boring level grind because most things you do don't give any XP, and that horrendously large skill tree just taking me completely out of the fun of Progression.\nBuilding, which should be the thing I like the most, I just can't enjoy it here, the building system looks both really good and really convoluted at the same time. Too many buttons, no decent build camera and constantly having to break the flow to get decorations from one place or building blocks from another because I can't just use the resources I've gathered to build directly isn't fun or engaging.\nCombat feels like a chore, it's not engaging or rewarding, more often than not the Lock-On is more problematic than it should, enemies have a weird difficulty scaling where one is a total pushover and the next will deck you instantly.\n\nThe thing I was more interested in, the Shroud and the Fact you're supposed to cleanse it, is totally insignificant, because nothing on the world is permanently changed, the Shroud you clear just gets back after a while and no terrain or structure stays permanently destroyed, it's totally pointless to engage with the one thing this game could have different from the rest.\n\nMaybe the game picks up after a while, maybe the things showed on the Store videos and screenshots give more life to the game, but I'm honestly not committed to play any more of the game, which is a real shame to me because I wanna like it, it has some nice features here and there, but I can't force myself to enjoy something I'm still on the fence about after 15 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game itself is great, there should be some kind of note that you need really good specs and a higher end gaming system to play it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[b]Pros:[/b]\n\n* Great graphics\n* Building is fun\n\n[b]Cons:[/b]\n\n* The combat is absolutely terrible\n* The game’s purpose feels artificially constructed.  Quests and overall progress are generic and boring\n* The world is completely empty and there’s nothing to do except fight a few repetitive NPCs\n* The crafting system is frustrating: half of it involves talking to NPCs, and the other half is waiting hours for materials to process\n* There’s no real incentive to build anything beyond basic shelters\n* The world resets after every restart\n* Chests feel like a joke\n* Updates keep making the game worse instead of better\n* Shroud is fun only for few hours",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game's UI is so bad. animations also so poor need to improve and also combat system is not good enough to play. It's early access but game is not playable in right now",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For me the game is too much of a grind without the rewards. Way too slow paced with the leveling up. Looting gets repetitive. Just overall I did not enjoy this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Incredibly boring to me. \nIt tries to take so many aspects from other titles only to not really have it's own grounding as a survival game. \nIf a room temperature bottle of water brand was a survival game, it would be named Enshrouded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The titular \"Enshrouded\" mechanic is a little irritating and boring, I feel it basically does nothing but waste the player's time. The mechanic is you get X minutes in \"Enshrouded\" areas before being insta-killed. It starts at 5 minutes, with the ability to be upgraded. I only upgraded once to get it to 6 minutes.\n\nProblem is you can sort of get stuck doing death runs if you get caught in a bad spot and can only inch your goods back through the fog, and it limits how much the player can play the game and what they can do. The player should never feel they are doing nothing and wasting their time, they should always be playing the game. Snooze-fest to have to leave an area every 5 mins or be needlessly stressing about the time when I'm already being railed by enemies non-stop. No time limit, buff enemies a bit, and baboom the game feels better. The game low-key already has a timer built in with resources for survival like food and potions, yet the enshrouded timer was also added for some reason. Most people wont venture longer than they have resources for, the game should be focused more around that, it would make upgrades and such feel much more rewarding as well.\n\nAlso magic and ranged are OP compared to melee. Felt pointless to be using a melee weapon if you can aim the bow at heads, makes enemies even a few levels above you trivial. Combat locking is dookie. Graphics aren't well optimised; this game should not be the size it is for what it is and take as long to load as it did. Thought I was launching Marvel Rivals with how long shaders took to compile.\n\nIn the end, it was just okay. I know this game is in early access, maybe I'll come back and change my review. Idk",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Enshrouded feels full of possibilities at first. The crafting system, the possibility to build things, the endless number of different materials.\r\n\r\nBut as you progress, it starts feeling like too much. Always another pile of materials. to build another crafting station to... for what again? The game feels empty. No NPCs besides the ones you rescue. The story feels absent, given it is only learned through reading in-game texts. The enemies barely have a personality. No true feeling of capturing class dynamics with the skills you play. The skill system is very basic. We keep finding copies of the same weapons. Most weapon attributes except for damage feel like an afterthought. The game boils down to crafting... and attacking until things die, or you do. I left feeling disappointed, although the building engine did leave a positive impression.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A struggle to play. Early access for sure... a bit too much for my tastes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried to play this game since day 1 and it's crushing right away or after playing 20min.\r\n\r\nI tried all fixes that I could find on online and I tried all fixes I was suggested by TROUBLESHOOTING on official Enshrouded discord. NONE of them helped and at the end I was told by some mod or similar called Cross. Quote \"well this ones also still in development so issues are bound to happen sadly\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The world looks great, but building feels very hard, confusing and not optimized. You have way too many different materials, that you don't really know what to do with them, right from the start. There is no smooth feeling of progression. Some say this game is like Valheim, I would say it feels more close to Conan Exiles - way too much stuff going on right from the start.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poorly optimised, constant lag when plying solo private server, feels like I'm playing a mmo on dialup with over 10000 people in the same zone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has serious issues with vulkan shader rendering and has had these issues for over a year.  It can take hours for it to pre-render shaders.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I purchased this game to play together with my partner, self-hosted as we live together and he has a powerful PC. Although the start of the game was fine, later on, specifically the Imperial City area is completely unplayable. There is constant rubber-banding, lag, and it's impossible to enjoy the game / engage in combat since you get a lag spike and *shock horror* you die. \r\n\r\nWe hadn't even had the chance to experiment with the rich building features this game has, as in order to unlock key materials to do so, you need to progress with the storyline - which you just literally cannot do. We had hoped that we could play this game during our free time but the lag makes it simply frustrating. It is really a shame since the game has such good potential! \r\n\r\nAfter reading up about it, I understand that buying a dedicated server may (and a hard emphasis on the may), but for just the two of us who on average can only commit a maximum of a couple hours a week to this game - it's disappointing that you can't just buy the it and play it as you would expect to without incurring extra costs. \r\n\r\nThe game is in early access, and hopefully optimisation will get better in the future, but for others in a similar situation as ourselves, I really cannot recommend it at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really want to enjoy this game, but the optimization isn't there and the combat/controls felt too clunky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For the record, I absolutely LOVED this game when it first came out, in terms of the voxel grid design, Enshrouded is my favorite game of all time, hands down, the building and terrain editing mechanics, are the best attempt at using voxels so far that I've ever seen, 10/10 amazing job, that being said... You guys have completely ruined the Mage, its almost unplayable in comparison to the other classes now, the dodge is useless, doesn't appear to give invulnerability frames or most importantly \"BREAK THE GOD DAMN LOCK ON\" I cant tell you how many times I've been killed mid dodge or followed through my entire dodge animation like it didn't even happen only to be killed immediately afterwards, WTF is the point of a dodge if it doesn't do anything, the wand animations are WAY too long and grossly under powered considering how weak you are and how vulnerable it makes you, not to mention they aren't interuptable, so the dodge can't be activated even if it was useful until it's too late, or a little too early and you end up not dodging anything anyhow, using wands in any situation other than from the top of a building cheesing the mobs is suicide, and why do mages need a double payment to cast a spell, mana and the charges? mana is a charge. I am so thoroughly disgusted with what you have done to the mage class, if this is what we have to look forward to in terms of combat, I would rather have my money back... went from OP to overwhelmingly underpowered, I hope you're all ashamed of the terrible balancing job you all did, and fyi if you have to adjust a difficulty slider just to make a class playable. you failed... PS, I will gladly change this post to the most beautiful shiningly positive review, assuming this is fixed...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have faith it's going to be good eventually but the recent nerfs have sucked all the fun out of the game for me right now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "With all the games out now a days just like this game it is not as good as most of them and lacks quality of life features in its game. Like auto pickup and full keybinds etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "8/10 exploration, base building, and crafting but the 3/10 combat just drags the whole game down. I keep trying to pick it up again but every time I have to fight (you know like 50% of any survival crafter) I just get frustrated. I can’t even convince myself to play, how can I recommend it to others?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fucking trash development team. The early game requires hours upon hours of gameplay just to progress to level 10, and that isn't even enough to feel like you can enjoy it. The movement is garbage and half ass responsive. I have more fun kicking myself in the balls. The only good thing about this game is the building, and it's not worth the headache it comes with",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The performance optimization is still painfully garbage almost a year after I bought the game. I keep dropping it and telling myself \"they'll probably fix it in a couple months\", but at this point I don't know if that's ever going to happen. There's no reason this game should be running at sub 60FPS using medium to medium-high settings (With DLSS on performance), on a device with a core ultra 9, RTX 4080, and 32GB RAM. \n\nIf these issues ever do get addressed, I can easily see myself putting in over a hundred hours in this game, but at it's present state, it just gives me a headache.\n\nI'd say hold off on buying until the game is finished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not optimized and it runs at less than 30 fps and that's after setting everything to highest performance.    I can play Horizon at almost 60 fps yet for Enshrouded we need some kinda NASA computer?   No, until developers will eliminate shader compilation and improves enormously its graphics optimization (so it runs on normal computers) the game remains unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Recent updates completely ruined performance.\n\nI went from running fine to like 3 fps with everything on super low.\n\nI wish Steam would perma ban any dev that does that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was playable for me till this newest update now the performance is just terrible and it makes the game unplayable hopefully they can sort this out really enjoyed playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "30-40min compiling shaders every graphics card update sucks big D.Was an awesome game till that issue started happening.Cant recommend till it's fixed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish I could give this a 'mixed' review. The game is fun, and the concept is good, but some areas seem to be extremely confused in the direction and there is a definite lack of review on how the additional content fits into the gameplay.\r\n\r\nThe new fishing for example, I kept breaking my line on rare fish and it wasn't until I searched *spoilers* did I find out you only get access to additional rods from the newest, lvl ~40ish area. The introduced fishing minigame, which is pushed very early through the villagers, and you can only get better at what is currently end game. Who reviewed this idea? It only takes thinking about this briefly from a new player perspective to recognise this is a terrible implementation, this game is still an 'in development' game and thus should be catering to a growing playerbase, why is something implemented and introduced to new players but the only development to this gameplay concept is brought about in the late game?\r\n\r\nBeing early access and a multi-platform game, some things such as excessively limited keybinds is understandable, but why am I still falling through the map on Blackmire? I had these issues when I first explored Blackmire maybe a month after it came out? A long time ago. And I am *still* falling through the map in that area, getting sent back all the way from the *spoilers* shroud root in SE Blackmire after going all the way through that horrible maze.\r\n\r\nMeanwhile, as far as something that has also not improved during this process, lock on and hit registration, especially using the jump slam attack (which may be new I do not remember it) are still crap, I hit things behind me more consistently than what is directly in front, and any lunge attacks that I sidestep hit me similarly in the back, so at least it's consistent that in this universe it is easiest to hit that which you cannot see.\r\n\r\nGame still has amazing feelings, vibe, music is great, world feels interesting to explore and loot feels rewarding, just really hope that we see more refinement instead of new content without considering how it interacts with new or returning players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very fun game until we got inside Hollow Halls. Tanking skills DID NOT WORK AT ALL.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some game breaking bugs remain. Delayed input, delayed/missing graphics. Game is fun if you are ok with dying to an invisible explosions.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has potential but still need polishing.\n\nCool game to just relax, build or rebuild village and explore.\nYou can do it solo, with friends or random players. Up to 16 players can be in you or other player world.\nYou can also set up a password for more privacy.\n\nYou also got customizable difficulty so you can play the way you want to play it.\nAnd there is also gear transmog system in game.\n\n\nThings that I would like to see change or add:\n\nCombat is clunky and needs polishing. Also one thing doesn't make sense to me.\nOne-handed weapons are fast and do good damage. Two-handed weapons have more AoE and do bigger damage but are slower. This is all normal standard design.\nBut what do the daggers bring? Speed? No one-handed weapons are better. Damage? Other weapons do it better. AoE? Ofc not its daggers we are talking about.\nPersonally I see no point of using them especially if I also consider how clunky combat is in this game and that alot of times especially on higher difficulty you will be fighting a lot of enemies at same time and they can be very aggressive so you will have better time in combat with other weapons then daggers.\nDaggers should bring increase attack and movement speed which allows for more frequent and rapid attacks on a single target but this things are just to slow for a daggers.\n\nThing I would like to see is that if we could get more options in character creator to make more different fantasy races-Flameborns (dwarfs, elves or half-orcs for example).\nI know your character already is not \"human\" but Flameborn so that is just one more reason we could have different looking Flameborn that where artificially created by original Humans and Ancients.\nAah well maybe someone will make a mode.\n\nOooh and remove Hollow Halls please.\nThey are most boring, annoying and time consuming thing in the game. When you have seen one you have seen them all and they just get longer.\nThey are not fun with a group and they are definitely not fun solo.\n\nWorld (quests) progression is not bound to character but to server-host world.\nThat means doing quests in co-op/multiplayer World alone will complited quests for you and other players to if they are there with you in that World at the time or not.\nThis if you ask me is not a good design for any multiplayer/co-op game.\nSo you need to really play together to not miss anything which can be hard and frustrating with random players because not every one can find common free time to play together.\nWith a group of friends it might be easier to coordinate the time but this is still bad design for a game.\n\nQuest design and the way a player is guided to appropriate content is not good.\nProgression quests especially for unlocking crafting and building does not seem to be coherent and logical all the time or in short: the design is all over the place.\nOn the end you just end up wondering why you can not craft or build certain things that you need.\nThe game should not hold the players hand but it should lead the player in a way that he will be able to enjoy the content the most.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Couldn't get the game to load. Minidump error even after trying several different \"fixes\". Might try again the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has a great concept, but it has poor execution. I've tried to start this game probably 5 times now, but can't make it passed the second boss without getting bored. This game is a lot of running around to try to find new stuff to do, dying, and spending 15 minutes trying to get back there.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}