{
  "positive": [
    {
      "review": "Aight so lemme be clear, I love this game, I put in 600 hours and I'll put in a thousands more. I'm not going to quit until its dead. There's been a handful of other games that try to be like it but none of them have the same level of polish or depth. The mechanics are extremely well thought out and every character feels unique.\r\n\r\nGod damn though this game needs to treat new players better. They basically cant queue ranked without a premade, and that can be hard to get when a decent portion of the playerbase is too high of a rank to queue with them. There are a lot of mechanics that aren't explained very well or are not explained at all despite being extremely important, and you'll have to spend hours digging through discord, old reddit threads, and youtube to learn about them. \r\n\r\nThere's also a lot of inconsistencies due to the low tick rate of the servers. This has been a problem for a long time and sometimes it makes the game really suck to play. The CN server runs like 6x faster than NA, even with a VPN at 200 MS, it felt more consistent than 30 MS on NA/Global. I know you have the money, I see the people running around with every skin in the game, just upgrade the servers already, shit dude I'd pay for it myself if I wasn't just some dude with a normal job.\r\n\r\nOther than that though, I love the game and I want to see more people on it. Better onboarding and a tiny server upgrade would go so far.\r\n\r\nNot part of the review, but please for the love of god ignore anyone complaining about CN/SEA/SA/EU players on NA. There's like a 99% chance that the Chinese dude is living and going to school/working in North America, there's no reason to play on NA if you (normally) have access to CN servers. You also have such a massive disadvantage with high ping that if you're losing to a SEA/SA/EU player, you're probably just worse than them.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Still the most unique BR available. It has its flaws which will be addressed below but lets start with clearing up some misconceptions/outdated information regarding the game. The most obvious deterrent for potential new players to even install the game is that it requires HVCI to be turned off. While this was true when Windows 11 was new, this requirement was removed via an update several months later. HVCI is no longer required to be turned off as of this review and all other reviews that mentioned this issue are either outdated or just trolling. Next, there are claims that the game is infested with hackers (some reviews claim up to 90% of players are hacking). This is completely false. I have spent over 3k hours in the game and the number of people that were hacking/using some exploit can be counted on one hand. There definitely are players who still use hacks/find exploits but they are a small fraction of the playerbase (the same can be said with any other BR). The devs also publish weekly banned players lists to remove hackers and keep such behaviour in check.\n\nWith the misconceptions out of the way, lets move on to the negatives. First of all, the playerbase in the West (NA/EU servers) is tiny compared to Asia (SEA/AS servers). If you play on SEA/AS servers, kindly skip to the next paragraph as matchmaking is not an issue. For NA/EU servers, most new players will only be playing against bots (and winning most matches) in ranked mode until Solar. Assuming that they have the patience to reach Solar, newbies will then be placed in lobbies with top server players and proceed to be obliterated by them. Such matchmaking is understandably frustrating for new players as the learning curve can seem too steep. This is the point where newbies quit because they are demolished by veterans almost every match past Solar rank. Personally, I have also experienced this when I was new to the game so all I can say to new players is: Stay patient & \"Get Good\". Participate in custom lobbies to learn Neutral/combos/movement tech and you will be able to put up a fight against good players eventually. \n\nAnother negative is the abysmal server disconnects during games, especially in crowded areas/endgame fights. These can vary in severity from being mildly annoying to causing the match to be lost. These glitches can happen quite often too, sometimes a few times during every match on bad days. You will experience screen stutters in mild cases, to seeing the screen buffer icon while the screen freezes and tries to reconnect to servers in worse cases. There is also the less common but potentially game breaking bug where you are sent back to the login screen during a match if you use certain hero skills, such as Tianhai's combo breaker F skill. As of writing this, the hero skill bug seems to be fixed but I will update this review if it happens again.\n\nFinally, I shall address positives after all that doom and gloom. From all the previous points mentioned, you may think that all the drawbacks outweigh the positives, but I beg to differ. This is hands down the most unique BR available. Its depth of combat and movement mechanics is unmatched by any other modern game of its genre. Fights against real players are satisfying regardless of outcome once you have learnt the basics of Neutral/True Combos/Scalerushing. In a world where most if not all new games try to make you feel like a champion, this game constantly reminds you of your shortcomings in skill. You will lose way more than you win until you \"get good\". You will need to earn your wins which in turn feel much more fulfilling. I would also like to mention that there is a PvE mode called Showdown which is similar to Souls-like games and an extraction mode called Rift Traversal for those looking for something other than the BR. I highly recommend trying Showdown if the BR/PvP is not your cup of tea as boss fights there are just as challenging and fulfilling at the highest difficulty.\n\nIn conclusion, Naraka stands out as a unique melee-based BR experience in a sea of shooter BRs. \nIs it perfect? No.\nDoes it have technical issues? Yes. Sometimes.\nIs it challenging but fulfilling to learn and improve? Absolutely.\nIs it fun? Hell yea.\nMore importantly, is it worth your time? Find out for yourself. \nNaraka: Bladepoint is free to play and available across PC, XBox & PlayStation.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The amount of things we can do on this game is just huge ! A lot of dopamine to trigger :) just maybe too much sometimes and we get lost, but still having fun times.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "this game is best to play both solo and multiplayer i love playing with my husband and my brother if i had more time to play i would non stop play this game its amazing and fun and i love the rewards i get for how long i stay on the game best game ever 10/10 would recommend again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really enjoy the game, would love to go back to playing. Im currently having an issue getting into the account with my save file in it, customer service hasn’t been helpful in the issue. Though it’s more the backend it’s still their team. (Day 4 now)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game. I love the gameplay, the sound effects, and the beautiful graphics. \r\nI honestly love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Action packed, fun, technical. Combat mechanics reminds me of Monster Hunter but PVP. I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just found this game a few months ago and it has become my go to. The fun of it is also an issue though as the more you play and progress, the more powerful you get overall with the character, This also creates a massive issue because some servers have been out way longer and it creates this ultimate unfair feeling when going against someone that has been on since the begining. I would ask them to create a mode where everyone is on equal tier so it goes by luck and skill instead of the guy who sucks but has been on for way longer. Totally new maps would be welcome too but for the most part little things like adding a over powered sword one month and then swapping the thing to watch for the next month keeps the game interesting, where winds meet is similar in fighting but not nearly as polished and a lot of the over powered people are on that now so this is a good time to jump on and get leveled up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely competitive melee-focused battle royale based on Chinese mythology. Great online community and fun, unique, endlessly customizable characters. The massive variety in skills, weapons, outfits, hairstyles, accessories, individual abilities and more makes the player customization in this game one of the best. Also some of the best looking playable characters in any competitive game. The ranking system is well-designed, and the maps are beautiful tp play in. There is such a wide variety of modes to play, with my favorite being ranked Solos, Duos and Trios. However, there IS a casual mode to choose, with a plethora of different game-modes for un-ranked play. This game has so much to offer I can't even begin to write it all in this one review(: There are also PvE modes that are available in solo or co-op, with challenging bosses, utilizing an entirely different ranking system and skill progression than the PvP modes. This game has something for any gamer, and I very much recommend playing if you want a game that is both rewarding to play as well as highly competitive. 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game completely reimagines the battle royale formula by focusing on fast-paced, skill-based melee combat, parkour, and a wuxia-inspired aesthetic. It's a breath of fresh air in a genre dominated by shooters. The rock-paper-scissors-style combat system (normal attacks, parries, charged attacks) is deep and incredibly satisfying to master. It feels more like a fighting game than a typical battle royale. The Eastern fantasy art style is beautiful, and character designs are full of personality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a quality game that doesn't require skill to play. You can play both solo and in teams. There are many game modes to choose from. You can play with bots if you don't want to fight with others. But be careful of Smurfs. Even low-level players may be new or don't play often, but sometimes high-level players want to hit newbies for fun. But don't worry, it's not limited to this game. Smurfs are everywhere, in every game. Have fun and good luck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "手感顺、节奏快、玩起来真的很舒服\r\n而且对喜欢脚脚的玩家来说，这里还挺温柔的嘻嘻\r\n整体体验很爽 想轻松打也好或想认真爬也行～",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Br to come back to and just play  and have fun the loot pulls are on a diff lvl for sure there is not only br but co op game modes as well to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly the best combat system I have ever seen in my entire life. This game has so many details, and is so deep. Getting to the high rank \"Asura\" is only the beginning of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played ALOT of competitive games and have been able to get good and reach high ranks in most of them, but this game right here humbled me SO hard. Just when I think I have it all figured out, some dude with a Chinese name flies in and makes sure I know my place. \n\nIt’s insanely frustrating to learn, but the movement and combat in this game is incredibly unique and addicting. Unfortunately the game is suffering from a very low player count in NA, and if it wasn’t for it being popular in China, it would have probably EoS’d by now.\n\nIf you are new to the game, most matches will be bots and maybe 1 or 2 other players until around Solar rank. Once you hit Solar you will start getting lobbies full of players, but also sitting in pretty long queues. This in my opinion is where people drop the game. It’s not hard to reach Solar since you will mostly be fighting bots, but once you get there you can get matched with some of the best players on the server. You WILL get shit on REPEATEDLY. \n\nI’ve stuck with Naraka for a while but not without getting discouraged from continuing several times. Unfortunately theres just no other game quite like this one. I always find myself coming back.\n\nI’ve never wanted a game to make a resurgence quite like I do for Naraka. Luckily the small community it does have has been very nice to me and I’ve even been able to hop in calls with some of the top players in NA to get advice. This is one of my favorite games, even though it’s one of the games I’m worst at, and I hope one day it gets the love it deserves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Game I've played, helps to train and improve your mechanics for most of the other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game như con cặc, mấy thằng khựa, ba tàu, vạn quân, thất nghiệp, neet, không có cuộc sống hôi lông bú dái chó.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good gameplay with acceptable graphics and beautiful skins for both characters and weapons in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game,but without controller it's hard to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very underrated game... nice combats & maps would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a super cool game.game is not Ez players say bad because there skill issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a big fan of battle royales.\nBut this game surprised me positively when you can manage with just melee weapons.\nThe character customization is versatile and there are so many characters that everyone can find something they like.\n\nThe second game mode with bosses brings a nice different challenge and perspective to the game (unfortunately, not all characters are available in this mode yet).\n\nAnd the third and newest game mode... it's like tarkov. Not one of my favorites, but I've had enough in the two game modes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ninjas. Battle Royale. Several characters to choose from. Several weapons to choose from with different skills and abilities for each. Very well put together *applause*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's really fresh for me an battle royal with hack and slash  was so fun there's so many heroes you can use with different skillset and skin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quick thing I want to mention before I get into the meat of my review. Another Steam User has claimed that the game requires you to disable HVCI. Upon starting the game, I did not have such an alert show up, BUT I did notice part of my Core Isolation stuff was disabled due to Easy Anti-Cheat (Which this game doesn't use, from what I can tell). If you have EAC, odds are high that whatever Narakas Anti-Cheat needs disabled is already disabled by EAC.\r\n\r\nOkay, so. When I first was considering Naraka, I was on the fence. I didn't really want to get sunk into ANOTHER Battle Royale, as I've kinda checked out of most BRs, these days. That said, Naraka is... weirdly enough, a breath of fresh air. The melee focused approach to it is certainly an interesting idea that I do not hate, but I am also speaking from the perspective of someone who has only played vs AI in the dedicated bot lobby mode. \r\n\r\nSpeaking of that, A vs AI/Bot Lobby mode that allows full progression of the game should be the norm nowadays, with how overly competitive games have gotten. Between some players just naturally getting better quicker than others, and the SBMM systems just not working (most of the time), I have enjoyed most of the matches against the AI, and it allows me to just chill and relax, be it on my own, or while in a discord call with friends. I will not speak on the regular BR, as I have no intentions on touching it, seeing as I can play the game the way I want to and still get rewarded as much as others.\r\n\r\nNow, onto Showdown, the PvE mode. Its... interesting. On one hand, I wish the missions were longer and had a more cohesive story, but the more I thought about it, the more I didn't mind them being short. It reminds me of mobile games and their incredibly short levels, BUT without the horrendous stamina system that basically prevents you for playing for longer than you want to. I also love how the ranged gameplay was also changed to be just as satisfying as the melee gameplay.\r\n\r\nI have not tried the Extraction Shooter gamemode, as I am not a fan of that genre at all (mainly because every single one that has existed is a PvPvE one, and I'm not really into PvP games as a whole, anymore), so I will not be speaking on it. \r\n\r\nAs for cosmetics, its a typical Eastern made game, so most high rarity cosmetics are going to show more skin or be very extravagant. If you're into that, I don't judge. My only gripe on the cosmetic part is the fact a lot of cosmetics from Hidden Treasures (The Battle Pass) are seemingly never coming back. But, this is an issue that plagues every live action game nowadays, so I'm not going to hold it against the devs too much. I will say, one thing that I have to praise the devs for is the ability to completely change a characters facial features (For the most part, there is one character that cannot be altered, due to the fact they are a collab character). Being able to use one character as a basis for another character I want to bring into the game is amazing, and I'm glad it is an option.\r\n\r\nFrom my initial perspective, Naraka Bladepoint is a pretty fun game with a fair amount of stuff to do that I'm glad a friend recommended to me. Hopefully it continues to improve as time goes on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of ly favourites game all of the time 🫵 best battleroyale if you love art martial inverse played it before on epic game now on steam pure masterchief.. and u have amazing combo with more than +15 type of weapon melee etc.. skins are cool (i got few of them for free as f2p) \nGive it a try and see if you like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An addctive and fun game to play solo and with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Skill comes to mind when talking about this game. Its not just button mashing. As a South African my ping is 240 on the Euro Server. So it's a disadvantage that I have to live with. Local server would be nice but I understand why there is also not a server. But still very enjoyable. I highly recommend to play it with a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A highly competitive fast passed mele/shooter battle royal done right. from the environment to the gameplay this it a very immersive experience! tons of unique and satisfying weapons to use, also lots of cool characters to play as.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game overall for PVP. Game mechanics are good. One thing to improve would be blocking opponents hits once the opponent hit combo's you really cant do anything else. I want to see a full MMO for this game and it would be epic! I highly recommend playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally just different and a good different anime battle royale without being cartoony",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Es un juego muy bueno es un battle royal muy completo puedes personalizar de una manera genial todo, cosméticos para todo, se consiguen fácilmente sin tener que meter un centavo y su estilo frenético es genial, tu solo elegí entre las muchas armas que hay y que habilidad te gusta ya luego le editadas todo para que sea como gustes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Naraka is one of best games that i have played till date, quick match feels a little underwhelming because players are mostly spawned far from each other and sometimes finding other players to kill feels like walking simulator. but ya combat and weapons i just love it and environment and the  ambience of game is awesome too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing this game for a while, and it’s a thrilling mix of fast-paced combat and acrobatic parkour. The grappling hook and wall-running mechanics make moving through the environment incredibly satisfying. Combos, parries, and counters feel impactful, and mastering the timing gives a real sense of skill.\nThe variety of heroes and weapons keeps the gameplay fresh, and the Ultimate moves are visually impressive. The world of Morus and Holoroth is gorgeous, with a Far Eastern aesthetic that really sets the tone. Some fights can be challenging, especially against clever opponents, but that just makes victory feel more rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game with great combat and amazing modes, the simple Battle Royal, the Guild showdown, the Free for all mode, a great PVE story mode too and the new one a god damn extraction mode! This game has literally everything! Great movement, Great Skills and great weapons with very diferent and technical combos! \r\nFeels great to play and i am glazing it till the next day. ITS FREE!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра NARAKA: BLADEPOINT – это глоток свежего воздуха в жанре королевской битвы. Уникальная механика боя, основанная на парировании, уклонении и выстраивании стамин-менеджмента, делает каждую схватку напряженной и захватывающей. Система захвата крюком позволяет молниеносно перемещаться по карте и устраивать засады, добавляя вертикальности в геймплей.\n\nВизуальный стиль игры, вдохновленный азиатской мифологией, впечатляет детализированными локациями и проработанными моделями персонажей. Разнообразие героев с уникальными способностями и стилями боя радует, позволяя каждому найти своего фаворита.\n\nОднако, новичкам игра может показаться сложной из-за высокого порога вхождения в боевую систему. Требуется время, чтобы освоить механики парирования и контр-атак. Также, игра требует мощного железа для комфортной игры на высоких настройках.\n\nНесмотря на это, NARAKA: BLADEPOINT предлагает захватывающий и уникальный опыт для любителей королевских битв и файтингов, способный затянуть на долгие часы. Игра постоянно обновляется, добавляя новый контент и улучшая баланс, что делает её всё более привлекательной.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "when i say this game is way better than other battle royal games i mean it there multiple ways to play and a fighting style along with character for everyone this game if it was given a grade is a+ i really recommend this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i spent $500 in 22 hours! i love making my characters look cute. \ngameplay is fun too i guess",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better at Battle Royale than Fortnite, better at Extraction looter than ARC Raiders, better at fighting than Street Fighter, better at bosses than Dark Souls and better at grinding than Warframe!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is kinda good to kill time if you wanna experience battle royall as meele give it a shot its perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thrilling melee combat with breathtaking freedom of movement. The parkour and swordplay create an incredibly dynamic and satisfying battle royale experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good pvp and pve for any player ALL is abouth reflex",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The anti-cheat is Chinese spyware, if u have installed it make sure to delete it from your system 32. Anything that is has \"naec\" in the file name delete it right away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far so good with 58hrs on this game am liking all the updates and the l;ove",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its cool game but ping is not stable and to high",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game with cool designs and characters, game play is addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a bot! I'm just bad at playing this game and can't come up with funny nicknames... But it's still fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked this game, I haven't played it in months, I had 95 hours on the first month of playing this game, \n\nbut the player base does have cheaters, or the spammers who use a rush sword then again and again a gamebreaking combo, which is understandable as I can do the same, so it's fair.\n \nthe graphics are fine, the combat system is fine too, although it has bots in many matches, the big big problem is, matchmaking takes upto 30 minutes, you heard me, half an hour.\n\nIt's a great game but low popularity, the events shouldn't be mentioned, its the same everyday, can't blame the devs, no people = dead game, it needs low ping so you can't switch regions for more players either, rip naraka, hope you get popular once again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you get people in your lobbies, you can actually start learning, it took me alot of games to get killed in my first 1v3, the game tells you its giving you bots essentially to help you get used to the game first which i understand cause man this game can get sweaty and throwing someone head first into that could be really offputting lol. The game feels really good though, 1v3 felt really ganky so i switched to duos and it felt much more doable. Id say its a 7/10 so far. Unique live service swordplay BR which has an extraction mode lol? Hell yeah.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good batlle game but skins need pay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've alone played for a short time but, I find it very fun so far. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT FREE GAME :) BEAUTIGULL ART JAPANESE AND NOT PAY TO WIN!  NICE FREE STUFF TOO!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best martial art for multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun. even more fun if there is more players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 cultivation gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game. If Tekken and Skyrim had a baby this would be it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks 10/10, Gameplay 7/10, Audio 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tessaw 🤤😩 darling. I'll only play this for her and her only.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Make treasures more accessible.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Better than most yet the player base is small ...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome beginner friendly game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look at my profile picture.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "spam click to victory :|",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game so much. so underrated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game but suck at it :C",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game, gameplay 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great!!! give it time it gets good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gooooooooooooodddddd game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool fucking game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game I love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "idk its good tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is excelent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game since 2021",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i fucx w it so SLIDE THRUU",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bad game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game ok vcl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "creative team is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it so much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CHILLING like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tolong adain skin mas mas jawa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "git gud",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game requires you to disable HVCI which protects your kernal memory from having malicious code inserted. I wouldn't recommend playing this game, there is no reason to force you to disable this function unless you were trying to do something malicious.",
      "voted_up": false,
      "votes_helpful": 195
    },
    {
      "review": "I would recommend this game, if the multiplayer had more real players. 95% are bots :/",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "I like the game and the concept of the game but the fact that it requires you to disable HVCI which protects your kernal memory from having malicious code inserted, kinda sounds fishy. I wouldn't recommend playing this game. HVCI is specifically designed to protect the integrity of kernel-mode code and data. Disabling HVCI removes this protection specially in a Chinese game? Nah..",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I genuinely dont get how a game that still has almost no competitors can mess up its daily active users this badly. Even mobile gamers are now trash talking PC players. You totally deserve this player bleed.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Instead of just leave an unsubscribe button in email, they force me to contact support to stop receiving emails? And there is no information on how to contact support? The customer service window in the game is just a bot and there is no where to contact their support directly\r\nI stopped played a long time ago because I don't feel like the game but can't stop receiving email so I'm just gonna leave this here so people think twice before accepting their email. Maybe I will just mark them as spam",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It’s a game with deep and enjoyable gameplay, but the matchmaking system is absolutely awful. Don’t waste your time practicing this game unless you actually enjoy getting beaten up until you GeT GuD.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Serviceable gameplay, decent optimization, and beautiful graphics, but it gets stale fast. \nThe combat is painfully simple beyond a few combos, and the game feels like it’s 90% bots (because it is).\n\nAlso requires kernel level access which is always a red flag.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Clunky, frustrating, and poorly balanced. The style is cool, but the game itself is complete trash to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "couldnt even get past the click to start it keeps crashing. was excited to try and play it but nah its boo boo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is full of hackers!! New players beware!!! Its pretty sad you have to cheat in a VIDEO GAME to be good at it!! smdh!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At first glance cool game. Once you invest some time into it you see its lie. Servers full mostly of bots. Combat interesting at first, boring later, fancy moves doesnt matter at all, timing do all the wins. Graphics are quite nice, some cool artistic weapon concepts. Character skins are meh. \n6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't even wanna do a deep review on this one.\n\nLook. The gameplay itself is amazing. The Smash/Brawlhalla type of combat, a dozen of weapons with cool movesets, amazing parkour and an interesting map.\n\nBut if I had to pick ONE game with the worst matchmaking ever, it would be Naraka. Literally [b]every match[/b] is \"95% players are bots, the other 5% are (I'm not exaggerating) some sort of top 1000 players of the previous season or tournament winners.\" \n\nI wanted to enjoy Naraka but it's impossible. \n\nP.S. Also, thousands of cosmetic(and often ugly) microtransactions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When it released the game had an amazing potential and was a fresh breeze to all kinds of battle-royale games. It offered an unique medieval/fantasy style combat and good content that hooked me into playing that game. Unfortunetly throughout the last 2 years 24E and NetEase somehow managed to make only bad decisions and mishandled the game to the point where EU/NA/SEA community is almost not existent. Let the player numbers not fool you. The great majority of playerbase shown are CN players. The rest of the regions can get up to 2k active players at best during rush hours. 24E completely failed with the game's advertisements and appeal to western players. There was simply none to begin with. The big f2p update was a complete flop on many levels. Ignoring core problems of the game in terms of balancing or matchmaking killed player retention where no new players are joining and the ones that do join are thrown into bot matches or later on straight into the grasp of veteran players (because they are the only ones still playing the game somehow). Shortly after those players leave because of pure frustration. Game also had pretty good monetization system where you could buy the battlepass one time and get the next ones for free by completing the previous ones (still has it). Devs also managed to fumble that by adding more and more predatory things each big update (more fomo, gacha chests, spliting bp into two (pvp and pve), locking certain cosmetics into overpriced bundles and so on, and so on. Overall as for now I recommend everyone to stay away from that game....period. Naraka unfortunetly became one of those symbols of wasted potential and it really had good one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after update the game and reshader, the fps drop to 45fps  how to fix this \nmy space i7 14gen HX\nram 64g\nRTX 4060 ?\nis that a bug or sth id try to repair game file and upgrade graphic driver still the same",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Last I gacha in this game I got cannon lol.. I wanna get Polesword extreme",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dog game. Devs don't give a damn about their global fanbase except for how much money they'll spend on the heavy gacha system. Way too many bugs, hackers and exploits that get ignored until the CN player base complains about it. \r\n\r\nUtter waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is sort of my dream fighting game:\r\n1. 3d (not 2d sprites)\r\n2. Good graphics\r\n3. Melee focused not shooting\r\n\r\nHowever it is just too much crammed, also doesn't work well with Linux\r\nRay reconstruction doesn't work with 30 series cards? Why?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "taskbar wont disappear while game boot, not matter what",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the worst developers. why? they made game mechanics too difficult like in super smash bros, and made character's ultimate attacks that hit 100% arrmor + 20~40% hp and you like 2-3 hit to die. and ultimate attacks fills up in less than 30s you can ultimate, run 30s and gripple stun opponent and again ultimate, EZ WIN, uuhu ez. BRUH, i better play \"ssbm\" than this shit.\nyeah plus if you got not powerful PC you gonna wait in match start until shaders, textures and all that things to load, until other players playing. eg you spawning, others looting, you still spawning, zone is 3rd stage, you still spawning. this is too good.\n\nbut i agree, there is good character face customization, i made my favorit idol's and more, thank you for that.\n\nGameplay                     4/10\nOutfit                            8.5/10\nFace Custom                 8/10\nGraphic Optimization   4/10\nRanked match optimiz  5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst shit to ever exist, abilities are unbalanced, weapons too, opponent matching is awfull, dont play this mix of genshin and fortnite - its ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wow i tought these game can customize chartaher, appreantly is not. Wow wasting my memory for these game. And ithese game macthmathing not mmorpg.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I guess I compare this game to NARAKA: BLADEPOINT put 3 hours into the game got into the whole combo system and I got it very disappointed and I picked the hard difficulty that I would get a challenge but to beat the boss you got to spam it same building blocking or any other abilities is pointless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "seems like fun but then you meet the hackers. Constantly finding people who obviously are cheating and exploiiting being able to attack through any combo and having infinite stamina. avoid avoid avoid avoid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having melee weapons be the main star of a battle royale is cool. The game just doesn’t feel very smooth though. Also we def got into a bot game so the normal experience will probably be way worse. Item system sorta sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Finding a match takes too long when u ranked up a bit 30+min is kinda too much when the match itself takes around 15min only",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuttering a lot on i5 12400F + 3060 Ti. All low. DirectX 11 and 12 tried. Nothing works. All same outcome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After a month break this game just completely stopped starting up. Only way to fix is to hard reset PC. Have fun! Top 9 Justina Gu in my State!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2 / 10 Phew I don't know why but I prefer Dark Souls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another battle royal littered with chinese fucking cheaters, Example A chinese player almost dead grapples the air and keeps grappling the air and flies away, Example B chinese player rushes you, you hit them with your ultimate repeatedly and they take 0 fucking damage and ZERO CC from the hit and in turn stunlock you into oblivion and even if you can use an ability or counter to break free it won't work. Expample C Just like Pubg you get like 10 to 30 matches in when first starting and it's ppl around your skill level then these chinese fucking cucks come in and literally kill the whole lobby fight 1 v 1000000000 and will win everytime. constantly spamming their ultimates, to constantly disarming your character non stop that there is literally zero point to try, when you see chinese people join the lobby you might as well leave.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHY ACCOUNT EROR CODE 211",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game lz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game nhu cac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "e lol xoa di \r\ngam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "GAME KONTOL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game requires you to disable HVCI which protects your kernal memory from having malicious code inserted. I wouldn't recommend playing this game, there is no reason to force you to disable this function unless you were trying to do something malicious.",
      "voted_up": false,
      "votes_helpful": 191
    },
    {
      "review": "I would recommend this game, if the multiplayer had more real players. 95% are bots :/",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "I like the game and the concept of the game but the fact that it requires you to disable HVCI which protects your kernal memory from having malicious code inserted, kinda sounds fishy. I wouldn't recommend playing this game. HVCI is specifically designed to protect the integrity of kernel-mode code and data. Disabling HVCI removes this protection specially in a Chinese game? Nah..",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I genuinely dont get how a game that still has almost no competitors can mess up its daily active users this badly. Even mobile gamers are now trash talking PC players. You totally deserve this player bleed.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game itself is pretty cool, nice combat mechanics and beautiful aesthetics (for my taste). However, as a player based in South America, all servers had horrible lag. And, strangely enough, the fastest one for me was South East Asia, which is weird because, in other games, always NA servers are way faster for me when there's no SA server, since it's much closer. That tells me that maybe the lag problem is not only because of the distance. But, hey, if you happen to not have a lag problem, it's a good videogame, particularly considering it's free.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "After update, so much bug and lag game 1 year ago comback\nIs it old codes ?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Instead of just leave an unsubscribe button in email, they force me to contact support to stop receiving emails? And there is no information on how to contact support? The customer service window in the game is just a bot and there is no where to contact their support directly\r\nI stopped played a long time ago because I don't feel like the game but can't stop receiving email so I'm just gonna leave this here so people think twice before accepting their email. Maybe I will just mark them as spam",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Trash game, unable to queue up with real people. All bots",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It’s a game with deep and enjoyable gameplay, but the matchmaking system is absolutely awful. Don’t waste your time practicing this game unless you actually enjoy getting beaten up until you GeT GuD.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Serviceable gameplay, decent optimization, and beautiful graphics, but it gets stale fast. \nThe combat is painfully simple beyond a few combos, and the game feels like it’s 90% bots (because it is).\n\nAlso requires kernel level access which is always a red flag.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hypes you up with bots when in solo or duos, then if you even attempt trios, you're thrown into a madhouse with people who've been sweating shower free for years on the game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Clunky, frustrating, and poorly balanced. The style is cool, but the game itself is complete trash to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "couldnt even get past the click to start it keeps crashing. was excited to try and play it but nah its boo boo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is full of hackers!! New players beware!!! Its pretty sad you have to cheat in a VIDEO GAME to be good at it!! smdh!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At first glance cool game. Once you invest some time into it you see its lie. Servers full mostly of bots. Combat interesting at first, boring later, fancy moves doesnt matter at all, timing do all the wins. Graphics are quite nice, some cool artistic weapon concepts. Character skins are meh. \n6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't even wanna do a deep review on this one.\n\nLook. The gameplay itself is amazing. The Smash/Brawlhalla type of combat, a dozen of weapons with cool movesets, amazing parkour and an interesting map.\n\nBut if I had to pick ONE game with the worst matchmaking ever, it would be Naraka. Literally [b]every match[/b] is \"95% players are bots, the other 5% are (I'm not exaggerating) some sort of top 1000 players of the previous season or tournament winners.\" \n\nI wanted to enjoy Naraka but it's impossible. \n\nP.S. Also, thousands of cosmetic(and often ugly) microtransactions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When it released the game had an amazing potential and was a fresh breeze to all kinds of battle-royale games. It offered an unique medieval/fantasy style combat and good content that hooked me into playing that game. Unfortunetly throughout the last 2 years 24E and NetEase somehow managed to make only bad decisions and mishandled the game to the point where EU/NA/SEA community is almost not existent. Let the player numbers not fool you. The great majority of playerbase shown are CN players. The rest of the regions can get up to 2k active players at best during rush hours. 24E completely failed with the game's advertisements and appeal to western players. There was simply none to begin with. The big f2p update was a complete flop on many levels. Ignoring core problems of the game in terms of balancing or matchmaking killed player retention where no new players are joining and the ones that do join are thrown into bot matches or later on straight into the grasp of veteran players (because they are the only ones still playing the game somehow). Shortly after those players leave because of pure frustration. Game also had pretty good monetization system where you could buy the battlepass one time and get the next ones for free by completing the previous ones (still has it). Devs also managed to fumble that by adding more and more predatory things each big update (more fomo, gacha chests, spliting bp into two (pvp and pve), locking certain cosmetics into overpriced bundles and so on, and so on. Overall as for now I recommend everyone to stay away from that game....period. Naraka unfortunetly became one of those symbols of wasted potential and it really had good one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after update the game and reshader, the fps drop to 45fps  how to fix this \nmy space i7 14gen HX\nram 64g\nRTX 4060 ?\nis that a bug or sth id try to repair game file and upgrade graphic driver still the same",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not usually the reviewer type, but tonight's experience convinced me.\n\nThe game is genuinely fun and enjoyable. When it works. Unfortunately, there are constant disconnects for no clear reason and frequent account errors that leave you stuck on a “Continue” button that does absolutely nothing. Doesn't have anything to do with my set-up or internet connection. \nYou end up having to restart the game. And it takes an eternity to restart the game, with all the disclaimers and everything.\n\nIn quick matches, this becomes infuriating. You get disconnected, the game claims you’re “protected” while offline, but by the time you’ve relaunched, sat through all the loading screens, and dealt with the unresponsive menus, you’ve died seven times. Unbelievable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ill be short and sweet imo this game is Silky pig slop, If you want free games there are better options on offer, If battle royal is your jam I would second there are much better options on offer.  Combat is mostly dull and uninteresting. If all you care about is waifus and me do gamer then this is for you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself isn't bad; the wide variety of weapons is very nice. However, the game requires admin access every time it starts, which is a common no-go. Furthermore, the matchmaking becomes poor after the third game, meaning you often encounter significantly more experienced players relatively early on. Many heroes have an ultimate ability that makes them nearly invincible when playing alone, as they simply deal too much damage and are too tanky even when you manage to survive till their ultimate is over you're nearly dead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mạng lúc nào cũng căng mà chơi game hơi tí lại thông báo mất kết nối, hacker thì đầy ra hầu như trận nào cũng gặp, team up thì tùm lum chán chả buồn chơi chứ nói gì đến giới thiệu cho người khác",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Matchmaking is unquestionably horrific. Rather than sweat it out against chinese players that do nothing but haunt quick matches, id PREFER to play against players in my region as i level up my account to finally play ranked at lvl 50 btw. Why do players from the top 100 chinese guilds continue to join my and my friends quick matches? id understand if i played against a casual chinese player...but nothing in competetive gaming is \"casual\" with them as its literally a matter of life or death in most cases. too bad really",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Last I gacha in this game I got cannon lol.. I wanna get Polesword extreme",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dog game. Devs don't give a damn about their global fanbase except for how much money they'll spend on the heavy gacha system. Way too many bugs, hackers and exploits that get ignored until the CN player base complains about it. \r\n\r\nUtter waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is sort of my dream fighting game:\r\n1. 3d (not 2d sprites)\r\n2. Good graphics\r\n3. Melee focused not shooting\r\n\r\nHowever it is just too much crammed, also doesn't work well with Linux\r\nRay reconstruction doesn't work with 30 series cards? Why?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "taskbar wont disappear while game boot, not matter what",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the worst developers. why? they made game mechanics too difficult like in super smash bros, and made character's ultimate attacks that hit 100% arrmor + 20~40% hp and you like 2-3 hit to die. and ultimate attacks fills up in less than 30s you can ultimate, run 30s and gripple stun opponent and again ultimate, EZ WIN, uuhu ez. BRUH, i better play \"ssbm\" than this shit.\nyeah plus if you got not powerful PC you gonna wait in match start until shaders, textures and all that things to load, until other players playing. eg you spawning, others looting, you still spawning, zone is 3rd stage, you still spawning. this is too good.\n\nbut i agree, there is good character face customization, i made my favorit idol's and more, thank you for that.\n\nGameplay                     4/10\nOutfit                            8.5/10\nFace Custom                 8/10\nGraphic Optimization   4/10\nRanked match optimiz  5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst shit to ever exist, abilities are unbalanced, weapons too, opponent matching is awfull, dont play this mix of genshin and fortnite - its ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wow i tought these game can customize chartaher, appreantly is not. Wow wasting my memory for these game. And ithese game macthmathing not mmorpg.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I guess I compare this game to NARAKA: BLADEPOINT put 3 hours into the game got into the whole combo system and I got it very disappointed and I picked the hard difficulty that I would get a challenge but to beat the boss you got to spam it same building blocking or any other abilities is pointless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "seems like fun but then you meet the hackers. Constantly finding people who obviously are cheating and exploiiting being able to attack through any combo and having infinite stamina. avoid avoid avoid avoid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having melee weapons be the main star of a battle royale is cool. The game just doesn’t feel very smooth though. Also we def got into a bot game so the normal experience will probably be way worse. Item system sorta sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Finding a match takes too long when u ranked up a bit 30+min is kinda too much when the match itself takes around 15min only",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuttering a lot on i5 12400F + 3060 Ti. All low. DirectX 11 and 12 tried. Nothing works. All same outcome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After a month break this game just completely stopped starting up. Only way to fix is to hard reset PC. Have fun! Top 9 Justina Gu in my State!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2 / 10 Phew I don't know why but I prefer Dark Souls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another battle royal littered with chinese fucking cheaters, Example A chinese player almost dead grapples the air and keeps grappling the air and flies away, Example B chinese player rushes you, you hit them with your ultimate repeatedly and they take 0 fucking damage and ZERO CC from the hit and in turn stunlock you into oblivion and even if you can use an ability or counter to break free it won't work. Expample C Just like Pubg you get like 10 to 30 matches in when first starting and it's ppl around your skill level then these chinese fucking cucks come in and literally kill the whole lobby fight 1 v 1000000000 and will win everytime. constantly spamming their ultimates, to constantly disarming your character non stop that there is literally zero point to try, when you see chinese people join the lobby you might as well leave.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHY ACCOUNT EROR CODE 211",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game lz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game nhu cac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "e lol xoa di \r\ngam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "GAME KONTOL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game requires you to disable HVCI which protects your kernal memory from having malicious code inserted. I wouldn't recommend playing this game, there is no reason to force you to disable this function unless you were trying to do something malicious.",
      "voted_up": false,
      "votes_helpful": 195
    },
    {
      "review": "I would recommend this game, if the multiplayer had more real players. 95% are bots :/",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "I like the game and the concept of the game but the fact that it requires you to disable HVCI which protects your kernal memory from having malicious code inserted, kinda sounds fishy. I wouldn't recommend playing this game. HVCI is specifically designed to protect the integrity of kernel-mode code and data. Disabling HVCI removes this protection specially in a Chinese game? Nah..",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I genuinely dont get how a game that still has almost no competitors can mess up its daily active users this badly. Even mobile gamers are now trash talking PC players. You totally deserve this player bleed.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game itself is pretty cool, nice combat mechanics and beautiful aesthetics (for my taste). However, as a player based in South America, all servers had horrible lag. And, strangely enough, the fastest one for me was South East Asia, which is weird because, in other games, always NA servers are way faster for me when there's no SA server, since it's much closer. That tells me that maybe the lag problem is not only because of the distance. But, hey, if you happen to not have a lag problem, it's a good videogame, particularly considering it's free.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "After update, so much bug and lag game 1 year ago comback\nIs it old codes ?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Instead of just leave an unsubscribe button in email, they force me to contact support to stop receiving emails? And there is no information on how to contact support? The customer service window in the game is just a bot and there is no where to contact their support directly\r\nI stopped played a long time ago because I don't feel like the game but can't stop receiving email so I'm just gonna leave this here so people think twice before accepting their email. Maybe I will just mark them as spam",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Trash game, unable to queue up with real people. All bots",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is full of hackers!! New players beware!!! Its pretty sad you have to cheat in a VIDEO GAME to be good at it!! smdh!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It’s a game with deep and enjoyable gameplay, but the matchmaking system is absolutely awful. Don’t waste your time practicing this game unless you actually enjoy getting beaten up until you GeT GuD.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Serviceable gameplay, decent optimization, and beautiful graphics, but it gets stale fast. \nThe combat is painfully simple beyond a few combos, and the game feels like it’s 90% bots (because it is).\n\nAlso requires kernel level access which is always a red flag.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hypes you up with bots when in solo or duos, then if you even attempt trios, you're thrown into a madhouse with people who've been sweating shower free for years on the game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Clunky, frustrating, and poorly balanced. The style is cool, but the game itself is complete trash to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "couldnt even get past the click to start it keeps crashing. was excited to try and play it but nah its boo boo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At first glance cool game. Once you invest some time into it you see its lie. Servers full mostly of bots. Combat interesting at first, boring later, fancy moves doesnt matter at all, timing do all the wins. Graphics are quite nice, some cool artistic weapon concepts. Character skins are meh. \n6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't even wanna do a deep review on this one.\n\nLook. The gameplay itself is amazing. The Smash/Brawlhalla type of combat, a dozen of weapons with cool movesets, amazing parkour and an interesting map.\n\nBut if I had to pick ONE game with the worst matchmaking ever, it would be Naraka. Literally [b]every match[/b] is \"95% players are bots, the other 5% are (I'm not exaggerating) some sort of top 1000 players of the previous season or tournament winners.\" \n\nI wanted to enjoy Naraka but it's impossible. \n\nP.S. Also, thousands of cosmetic(and often ugly) microtransactions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When it released the game had an amazing potential and was a fresh breeze to all kinds of battle-royale games. It offered an unique medieval/fantasy style combat and good content that hooked me into playing that game. Unfortunetly throughout the last 2 years 24E and NetEase somehow managed to make only bad decisions and mishandled the game to the point where EU/NA/SEA community is almost not existent. Let the player numbers not fool you. The great majority of playerbase shown are CN players. The rest of the regions can get up to 2k active players at best during rush hours. 24E completely failed with the game's advertisements and appeal to western players. There was simply none to begin with. The big f2p update was a complete flop on many levels. Ignoring core problems of the game in terms of balancing or matchmaking killed player retention where no new players are joining and the ones that do join are thrown into bot matches or later on straight into the grasp of veteran players (because they are the only ones still playing the game somehow). Shortly after those players leave because of pure frustration. Game also had pretty good monetization system where you could buy the battlepass one time and get the next ones for free by completing the previous ones (still has it). Devs also managed to fumble that by adding more and more predatory things each big update (more fomo, gacha chests, spliting bp into two (pvp and pve), locking certain cosmetics into overpriced bundles and so on, and so on. Overall as for now I recommend everyone to stay away from that game....period. Naraka unfortunetly became one of those symbols of wasted potential and it really had good one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after update the game and reshader, the fps drop to 45fps  how to fix this \nmy space i7 14gen HX\nram 64g\nRTX 4060 ?\nis that a bug or sth id try to repair game file and upgrade graphic driver still the same",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not usually the reviewer type, but tonight's experience convinced me.\n\nThe game is genuinely fun and enjoyable. When it works. Unfortunately, there are constant disconnects for no clear reason and frequent account errors that leave you stuck on a “Continue” button that does absolutely nothing. Doesn't have anything to do with my set-up or internet connection. \nYou end up having to restart the game. And it takes an eternity to restart the game, with all the disclaimers and everything.\n\nIn quick matches, this becomes infuriating. You get disconnected, the game claims you’re “protected” while offline, but by the time you’ve relaunched, sat through all the loading screens, and dealt with the unresponsive menus, you’ve died seven times. Unbelievable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ill be short and sweet imo this game is Silky pig slop, If you want free games there are better options on offer, If battle royal is your jam I would second there are much better options on offer.  Combat is mostly dull and uninteresting. If all you care about is waifus and me do gamer then this is for you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself isn't bad; the wide variety of weapons is very nice. However, the game requires admin access every time it starts, which is a common no-go. Furthermore, the matchmaking becomes poor after the third game, meaning you often encounter significantly more experienced players relatively early on. Many heroes have an ultimate ability that makes them nearly invincible when playing alone, as they simply deal too much damage and are too tanky even when you manage to survive till their ultimate is over you're nearly dead.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}