{
  "positive": [
    {
      "review": "Immortal Redneck, only with friends.\n\nI'll note that the game is addictive; we played for 10 hours in one night session.\n\n+Co-op.\nThe synchronization between players is very good. There are no unexpected disconnects.\nEach player has their own drops, their own guns, their own scrolls, but they can be exchanged with each other.\n\nTypically, similar games, like Deep Rock, have a chill zone where players can rest between runs and play minigames. This is missing here, and it's missing.\n\n+Bosses.\nAt the time of writing this review (6nov), there are 3 bosses available, each with their own mechanics.\n\n+Pleasant visual style.\nThe graphics are easy on the eyes, yet all enemy skills are visible.\n\n+Variety.\nFor an early access game, the variety of guns and passive skills is decent. You can partially choose which direction to take (survivability, damage, mobility, etc.).\nYou can experiment with builds, making them different every run.\n\nWeapons, like scrolls, aren't all unlocked right away. They unlock as you achieve certain in-game achievements.\nBut for the most part, it's the player's skill itself that matters, rather than leveling up.\nLeveling up simply simplifies the gameplay.\nAfter 10 hours, we progressed further not because we were super-leveled, but because we had gained certain knowledge about enemies, learned the map, and adapted to the shooting mechanics.\n\nP.S. The game is very similar to Immortal Redneck, from the graphics to the gameplay.\nP.S.S. Objectively, judging by the reviews, people really liked Gunfire Reborn, and the most important thing now is that the developers don't stop adding new content.\n\nUnpleasant moments\n\n-Hitboxes.\nThey're good in open spaces, but when there's an obstacle, bullets fly into an invisible texture.\n\nYou also can't shoot between planks, where a huge gap is clearly visible, but the bullets just shatter into thin air.\n\n-Variety.\nRegarding the \"random events\" that make gameplay more difficult in some rooms, which is good because it gives players a challenge.\nThere are three such events, and they repeat over and over again.\n\nIt would be EXTREMELY interesting to solve some puzzles.\nThey would fit the theme of this game, and again, it would add variety.\nThere needs to be an incentive to explore the area. To do this, we need to create secrets (breakable walls, a specific soundtrack in some corner of the location,\n\n-Master.\nThe NPC who upgrades weapons has a very sad look. Too bad ))))\n\nWhat I'd like to see in the future.\n\n1-Marks.\nThe ability to mark enemies and portals that other people in the lobby can see is really needed in this game.\n\n2-Normal challenges.\nWhich can be selected at the START of the campaign, and which will provide a small reward.\nYou need something like \"Kill 50 enemies with headshots,\" \"Evade 15 enemy abilities,\" \"Deal 1,000,000 damage.\"\n\n3-Weekly challenges.\nWith some kind of enhanced enemies, like \"Defeat 3 bosses in a row\" or \"Survive 15 waves,\" which would award, for example, 500 upgrade points, and they would only be available once a week.\n\n4. Skins.\nIt's a small thing, but it's nice to be able to customize your cat (the main character) and weapons.\n\n5. Puzzles and secrets on the map.\n\n6. Statistics.\nStatistics on how long it took to kill the boss, and which player in the party dealt the most damage to it.\n\n7. Path Choice.\nSo that players can choose between the easy path or the hard one, where, for example, the enemies are elite, but completing it will yield a more valuable reward.",
      "voted_up": true,
      "votes_helpful": 71
    },
    {
      "review": "The game itself is excellent — pure fun and mechanical expressiveness.\nHowever, the lack of a clear roadmap makes it hard to decide whether it’s worth buying or not. Everything that comes out lately is just DLCs selling characters.\n\nRight now, the game only has 4 stages, 6 unlockable characters (4 through leveling and 2 through mastery points, with one of them being absurdly useless), and 8 paid characters — all of which are incredibly strong.\nA huge number of weapons are also locked behind DLCs.\n\nIt’s sad to see such a promising game taking the simplest route to make quick money.\n\nThat said, I had a great time playing it. Still, running through the same 4 stages over and over gets repetitive. The Mastery System genuinely adds something valuable to the experience, and the extra game modes are really good.\n\nConsider buying it only if you’re aware that you’ll likely spend another $5/€5 per DLC (there are 4–5 so far) just to play new characters and weapons — all within the same 4 stages. \n\n(Small Plus: The final bosses of each stage do change after u beat them. So that helps it; I would probably aim to a 36/48 runs before its too repetitive and dull in the normal version of the game.)",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "A genuinely life-changing roguelite. Every character and weapon has the potential to become satisfyingly overpowered AND you get to learn Chinese and Russian when they fail to translate it properly!",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "its a bit too slow at the beginning, but gets better with time. \nalso, the first few difficulties are way too boring tbh\n\noverall its an awsm rougelike if u dont fall asleep in the first few runs",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I immediately became obsessed with this game. The artsyle and gameplay loop checks so many boxes for me, personally.\nThe weapons are all very fun or satisfying to use, and the characters all feel pretty different and powerful in their own ways. \nNot one run has felt the same as another. This game very much scratches an itch I didn’t know I had. Super fun, super replayable. Very much recommend.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "6/10\n\nGame loop is fun, good amount of depth. Fun to play with friends. The meta, everything surrounding the game loop, is where it struggles.\n\nIt's a coop game without drop-in. You start in a lobby and play to the end. This means your time budget needs to be flexible and you better have a stable internet connection. No computer restarts, no urgent family business, no \"only play for an hour\" buddy sessions. You cannot join games that have been started.\n\nFor comparison, Shape of Dreams saves the current run per completed stage and allows you to resume it together. Nothing of that sort in Gunfire Reborn.\n\nAnother issue is that it is unoptimized, prone to stutter, which is noticeable in an fps game. Some maps, some positions, some angles, can cause massive frame drops, often not bad enough to make the game unplayable because you keep moving, but it is not a smooth experience and feels frustrating when you're used to stable framerates. Don't expect an actual fps. It's an fps style roguelite.\n\nThe game is very Chinese. English localization is functional but at times hard to understand. Some tooltips are still straight-up in Chinese. On the plus side, there seems to be a decent wiki that explains the gibberish.\n\nStill having fun with friends, but even though we are the ideal test group with no time constraints and no issue playing the same game for hours, patiently waiting for each other if family business calls, I still feel the strain from not being able to save at some point or drop out for half an hour and rejoin,\nOr the classic: starting a solo game and then someone comes online and you restart to play with them, and then the next guy comes online and you two restart to play as three.\n\nThe game is super arcade-y, so there really is no design reason for it either, other than \"hasn't been done yet\". Doesn't feel like an adventure, final boss doesn't feel like an achievement. It's just spending 1-2 hours getting overpowered and talking about how overpowered everything is. The limitation of no drop-in is odd. It even technically looks weird, since Steam still allows you to invite friends to a running game, and they won't even see you're already in a game, they'll see you idle in lobby. So you better have voice comms or you're sitting there waiting for the host to ready up.\n\nFun is had, however. Just feels tedious. Maybe that'll get implemented at some point.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It’s like Borderlands met Kung Fu Panda in a roguelite fever dream. You’re a cute animal with way too many guns, yelling “I got this!” right before a beetle deletes you. 10/10 — adorable chaos.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The characters in this game are very fluffy and cute, the game is fun too",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Gunfire Reborn is a roguelike shooter with stylized cell-shaded graphics. The game has a steep difficulty curve and limitless variations of each weapon. Progression comes at a steady pace and the multiplayer offers a great cooperative adventure. Several of the characters and weapons are locked behind paid DLC, but the base game has plenty of content to warrant purchasing, especially if it's on sale.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pretty good coop roguelite, a bit slow as a shooter (Roboquest has much faster pace) and locations variations aren't too exciting, but game is decent and great in all other aspects (performance and bugs wise too), so it's definitely pass and pleasant in all way around game with much space for build experimentation.\n\n8/10 - Great game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game\nEngaging and Relaxing at the same time\nProgression and variety of characters and weapons is fantastic\n\nIf they added more map variety this game would be Tremendous however as it stands its still really good.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is a cocktail of everything we love: intense gunfights, tons of different loot, a character development system that makes you come back, and, of course, a co-op mode that will either strengthen your friendships or completely destroy them.\n\n🧠Gunfire Reborn is the perfect choice for those who are tired of giant games and just want to play something that brings pure, unabashed pleasure. It is easily addictive, offers plenty of opportunities for experimentation and fun. It is one of those games that you return to again and again. It does not try to be something that it is not, and this makes it even more attractive.\n\nThe gameplay is quite simple - we choose a hero and run through the level, along the way killing enemies that get in our way. The levels are quite small and linear, although sometimes there are secret locations, for passing which you can get a reward. We go through several levels, and at the end a boss awaits us. We repeat this process three times (or four times at higher difficulty levels) - and now, the race is over.\n\nEach of the available heroes has its own skill tree, its own unique skill and its own specific \"grenades\" - for example, a dog throws just a regular grenade, while for a leopard this grenade takes the form of chain lightning. The skill tree, in turn, is divided into three different branches, which mainly focus on strengthening the main skill, \"grenades\" or damage/effects from weapons. Thus, each of the characters can be developed in at least three different ways, which, in turn, also adds variability to the gameplay.\n\n✅Pros.\n- Fast-Paced Combat\n- Co-Op Multiplayer\n- Progression & Upgrades\n- Character Variety\n\n❌Cons.\n- Repetitive Gameplay\n- Lack of Narrative Depth\n- Limited Solo Progression\n- Randomness Can Be Frustrating\n\n🧾Summary.\nDespite all the variety in terms of weapons/character development, in terms of environment the game does not grab stars from the sky. Each stage consists of several possible templates that are superimposed on the level. Therefore, in just a few races, you will see most of the possible environment options, after which there will be only repetition. If this element is critical for you, then the game will most likely bore you quickly.\n\nGunfire Reborn is a blast for fans of roguelikes and cooperative FPS action. If you enjoy experimenting with different builds, the challenge of progressing further on each run, and team-based play, it’s a rewarding experience. But if you're not fond of repetitive gameplay or solo challenges, you may find it lacking.\n7/10🔚\n\nP.S. The game is very similar to Immortal Redneck, from the gameplay to the graphics.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ Replayability }---\n☐ One and done\n☑ Maybe after a year\n☐ Worth a second run\n☐ Played it 20 times and still not bored\n\n---{ Microtransactions }---\n☐ None\n☐ Only cosmetics\n☑ Slightly pay-to-progress\n☐ Pay-to-win\n☐ More shops than gameplay\n☐ Casino Simulator\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "🎮From the very beginning, the game doesn't leave you in suspense about the pace. The tutorial is a pleasure to complete, immediately showing you and allowing you to experience the incredibly enjoyable dynamics of the game. After a brief introduction, you can begin your first attempt at defeating swarms of diverse enemies and disproportionately gigantic bosses. Such a concise introduction is very satisfying, especially when you think of the multitude of unnecessary tutorials that we have to laboriously wade through in many other games.\n\nFortunately, the game doesn't slow down at all afterward. The shooting mechanics are incredibly satisfying, but it's important to remember that many enemies' shields are bullet sponges, and they don't react to significant damage. Well, there's no point arguing with genre standards, especially if the developers manage to inject a ton of joy into the game, although it's worth cautioning those who shy away from this approach to eliminating enemies.\n\nThe arsenal our heroes can wield is remarkably diverse and offers a completely different approach to exterminating unwilling opponents. Weapons include energy rifles, acid-firing pistols, bows with exploding arrows, and crossbows that shock enemies with electricity. Furthermore, some weapons have a secondary (more powerful) firing mode. While the variety of weapons available for inflicting harm cannot be denied, it's worth noting that many weapons appear in almost every game. I didn't find this to be a significant obstacle, but it can become somewhat tedious in the long run. It's worth noting, however, that the balance of acquired weapons isn't ideal; sometimes you might encounter a weapon that weakens you significantly or increases your power dramatically.\n\nGear alone, however, isn't everything. You also collect scrolls throughout the game, which have specific effects on damage dealt, health points, critical hit chance, and the effects of hero skills. These are divided into primary skills (like a ball that freezes enemies or a claw attack) and secondary skills (various grenade variations or special attacks with different effects). Both are assigned separately to our anthropomorphic heroes, of which there are currently six. They differ not only in their skills but also in their personal attributes, such as health, shield, and movement speed. Each character plays differently, and it's a lot of fun to discover a new style of play; especially since all skills, when used correctly (and upgraded with scrolls), can completely change the course of the game.\n\nThe levels are one of the game's main attractions. Boss fights divide the stages into individual sections, each set in a different location, which adds a fresh feel after the previous levels. The polygon-based graphic style is certainly commendable, as I think it's simply very pleasing to the eye and lends a lighthearted feel to the entire game.\n\nEach level is filled with exploding barrels with various effects that must be utilized appropriately; Otherwise, we run the risk of enemies taking advantage of us. Individual stages don't last particularly long. To reach the final boss, we must overcome 10 procedurally generated levels with regular enemies (with optional passages to vaults, where we participate in a specific challenge as a reward) and several boss fights.\n\nAfter completing the entire stage for the first time, we gain access to the Elite difficulty setting, which, of course, offers more challenging challenges, but the more lucrative rewards effectively encourage us to play this mode. Furthermore, after defeating the final boss, we gain access to a short but quite challenging bonus map. We also gain access to daily challenges from the main menu. These things ensure that the endgame isn't the slightest bit tedious, especially considering the two higher difficulty levels.\n\nAs long as we play dynamically and thoughtfully enough, the game shouldn't pose any major challenges. However, this begins when we're momentarily blinded by inattention, as the game quickly reminds us what we should be focusing on. You can die very quickly, even if you just had full armor and a brimming health bar. Enemies can set you on fire, shock you, or poison you (and we can kill them too), effectively draining your life. However, the game is prepared for this possibility. It allows you to revive once in exchange for a currency called \"soul essence,\" which you accumulate over many playthroughs. The cost of reviving isn't particularly high; you often earn enough in a single playthrough, but it can sometimes sway your decision to abandon further action.\n\nIn addition to the single-player mode, the game also offers a cooperative online mode, which, in principle, doesn't deviate from the standard gameplay, and I'd even venture to say it greatly enhances the experience of dispatching hordes of enemies. Matchmaking with strangers works very smoothly, although you can, of course, invite your friends if they also own the game. Playing with multiple players becomes even more dynamic during battles; other players are often helpful, swapping weapons, pointing out interesting scrolls, and greatly assisting in combat by using various skills. It's hard to get bored while playing together, and I highly recommend trying the multiplayer mode for those who usually shy away from the online aspects of various games.\n\nHowever, if someone doesn't shine on the battlefield from the start, there's nothing to worry about. If you consistently play and hone your skills, you'll gain a significant amount of the aforementioned \"soul essence,\" which you can use to purchase permanent upgrades called talents. The skill tree is so extensive that purchasing all the upgrades should take several dozen hours of gameplay.\n\n👍Pros.\n- Fun surface-level combat\n- Vault stages\n- Consequential bosses.\n\n👎Cons.\n- Samey runs\n- Quickness of death\n- Movement isn’t encouraged\n- Disconnect between single- and multiplayer designs\n\n🏁Summary.\nYou'll have to experience it for yourself. Fans of the roguelite genre will undoubtedly love this title and will spend dozens, if not hundreds, of hours playing it. If I had to name games it's similar to, I'd naturally mention Enter the Gungeon, which has a very similar gameplay structure; Shadow Warrior, with its similar approach to shooting and using elements against specific enemies; and the Borderlands series, as Gunfire Reborn has looter shooter elements. If any of these games resonate with you, it's definitely worth considering playing this title.\n🎯6/10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "might just be peak bro, rouglike and each character is actually fun to play as.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a pretty great game to play with friend i have enjoyed my last 9 hrs playing it. It is a fast pace game so if you like that you may like this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I first played Gunfire Reborn through Xbox Game Pass with a friend and the game was a lot of fun. I completed almost everything but I had a weird bug where my progress would not sync between my Xbox console and my Windows PC. Even with that issue I still enjoyed the game.\n\nIt really sucked when I noticed new updates, characters, and DLC coming out on Steam while the Xbox and Windows versions were not getting anything. I could not understand why the console version stopped receiving updates. It reminded me of the same publishing problems that happened with 7 Days to Die. \n(Same thing damn publishers)\n\nI bought the game again on Steam when the latest DLC released and it has been amazing. I had to start over but that is fine because the game is fun and the Steam version is fully updated.\n\nI just hope that one day the console and Windows versions catch up to the Steam version so my Xbox friends can play with me using all the new updates and DLC characters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gunfire Reborn offers a wide cast of colorful characters with unique abilities, solid gun-play, and an absolutely stupid amount of replayability. If you're like me and can't resist a good roguelike, grab some buddies and try this one out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A roguelite first-person shooter for the buggers that are either fans of stylistic, varied, flashy combat with tons of weapon variety; multiple characters that have different skill sets to learn and master; lots of earnable progression which is done through gameplay and commitment; runs like an absolute dream even on a mouldy potato battery that was found in one of Yandere Dev's bins, or you're a furry. \r\n\r\nFor both audiences, I'd say this game nails it. Do play it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is my favorite game ever of all time, it got me through covid and living with my BTCH ex girlfriend, i love these devs <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Had my fun for a bit during the free weekend that we had recently, but i think its the type of game you need friends to play with and cant rely on the match making System to get you games\n\nI think its neat but i dont see myself playing much if i bought it\n\nCute art and Character Designs, I approve the furry aesthetic a lot. \n\nI say its up to you if you want to give it a try, but keep in mind its best you already have another person ready to play it together",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesome gameplay + awesome characters + beatifull progression + everything is very fucking damn good and u can make urself broken af + u are not beating the furry allegations\n\nBuy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Translation can be spotty, but has definitely gotten better. Great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun co-op rogue-like FPS hero shooter game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun looter shooter mixed with rougelite mechanics. Characters and guns are unique enough from each other to have various play styles and runs. The guns feel pretty great and offer a lot of variety in terms of gameplay.\r\n\r\nOnly downside is the localization is a bit weird, with a lot of the English translations and descriptions not being clear or easy to digest. Almost like they used AI to translate everything, as opposed to having an actual bilingual staff member to work on it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lovely rogue-like in cartoon style. It is very fun and well balanced. \n\nThe only negative aspect: You need to buy most characters with real money. 5€ for an ingame character is way too expensive..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic blend of rogue lite, FPS, and a brawler. Quirky characters and interesting weapon design and interactions to boot. Strong recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a fun roguelike. Even without the DLC's, there's a lot of characters that emphasize different playstyles, so there's bound to be at least one character you vibe with. Gun variety is good, with everything from rocket launchers to swords, and the modifiers can further specialize your weapons. The occult scrolls serve as passive upgrades, and there's a huge number of them that do a ton of things that can help define your run. And on top of all that, the actual gameplay is real satisfying, the guns and skills feel good to use.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun game. Not quite my kind of game, but a very good one, so I can recommend it to anyone who enjoys games of this genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cute little game a bout [spoiler] GENOCIDE [/spoiler] and collecting ancient relics to [spoiler] EXTERMINATE [/spoiler] your way to the shrine for you to [spoiler] DESTROY [/spoiler] monarch and free the island from the doom!\n14 completely broken skills out of 10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "friend of mine got the game and its dlcs for me and i must say i didnt think id like the game since i dont play roguelikes much but this game won me over its alot of fun with or without friends so if your someones thinking of trying a roguelike try this and you may just like it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great fun to play with friends. The characters all have their own distinct playstyles, and different builds change how each plays. Seasons add unique twists on gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game.  Every play through is different.  Some games are more challenging, sometimes you can be super powerful, some games are an uphill battle.  Everything is variable in each play-through.  Love this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is like awesome. If you like having fun and doing fun this is way to have fun. Make fun in game with the fun making",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I would describe this game as the baby of Overwatch and Risk of Rain 2. What sold me on this game is the gunplay!! The gunplay in this is amazing honestly. I wasnt expecting much in terms of technical skill. The gunplay in this reminds me SO MUCH of Overwatch 2 as far as how the weapon \"feels\" like when youre using it. This is a relaxing rogue-like without any crazy time constraints. I love the laid back feel of this game. The characters are absolutely adorable. I loved the gunplay of this game so much that i bought all of the DLC and i'm honestly enjoying all of it. You get way more bang for your buck with the DLC than you do in the other hero shooters out there *cough OW2 cough*. The enemies are silly but can be challenging to defeat. My biggest complaint about this game is that the amount of rewards you can reap as a solo player is a SIGNIFICANT amount less. Unless you're playing with someone you're going to have a VERY slow progression. If experience earned could be scaled differently, it would be so much better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, but servers are mostly dead. Takes a long time to find a match, sometimes not even possible. If it continues like this, i will change my review to negative.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game ever and I would buy it for everyone I know if i could afford it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "juego indie cooperativo que tambien se puede jugar solo, divertido y rejugable con distintos personajes(algunos son de pago, pero tambien estan los que vienen con el game y para desbloquear)\r\ndesbloquear habilidades para tu personaje y puedes ir aumentando la dificultad progresivamente\r\ntambien puedes elegir la opcion de matchmaking para que te empareje online y cooperar juntos en la mision",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I say a lot about games that are just about getting bigger numbers but honestly this one is just so fun. The combat is addictive and I keep coming back to this game. I really like the weapon variety. Have at least 80 hours with console. The different characters are fun and the season strength gimics are interesting. I would say it’s not a particularly hard game untill you add modifiers but it’s still really fun either way. Is every DLC worth it, maybe not, but the game is fun and worth it. It feels to good hurl a brick cross map and get that wonderus crit sound. Plus if you get a good run it can get pretty broken and who dosnt like it when that happens",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came over from the console ver. where 505 still refuses to update the game much beyond release (no dlc still). Even still, the game is really enjoyable. Here? On PC? One million trillion times better. In the top 3 of my favorite roguelikes. Can't wait to bring my friend over too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addicting rouge-like. Possibly one of the best fps rouge-likes I've played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR, if you love risk of rain and borderlands, you will LOVE This game. \n\naside from the console edition, this game is a genuine masterpiece. there is not a single genuine complaint i have that isnt some minor nitpick. the mechanics are easy to understand, the gameplay is addicting as hell, and the guns all feel REALLY good. the dlcs as well are super hype and add some really fun weapons to the game. cannot recommend enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, one of my favorite games and love the new characters. The devs are transparent and their roadmap is placed right in front of you when you load the game, wish more devs did this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game. core gameplay is solid. The seasonal modifiers can be hit or miss but I appreciate the devs trying to keep the game fresh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "out of all the rogue-likes out there this is one of the few that I keep coming back to. I think the base game has enough build variety to really sink some teeth into and the dlc's add even more - characters and weapons. I've had a ton of fun playing solo and with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, but somehow runs keep taking literal hours to complete and it's kinda hard to get someone to agree to play this together, i could just have a skill issue",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got the game on sale specifically to have something like it to casually play with friends. It's nice having seasons to give that bit of incentive to come back every now and then, but be prepared to see the same maps over and over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably better in co-op but single player is still a lot of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an overall good game but whatever you do DON'T overplay it as you can get tired of it really really fast, Games fun with friends especially sometimes arguing with them like the troll you are just know that there's so many options, I do dislike that you can cheat the game and spam in a free run to consistently get the shards as you can just play it for hours on end and get over 11k shards or such, Game sometimes glitches here and there but overall fun to play with on some occasions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Devs keep adding new levels and weapons to keep the game fresh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really simple, fun and enjoyable game! If you like these types of games, or even just want to try something new, get this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addictive, cute characters and fun gameplay especially with partner :).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would recommend this game, its very fun, with cool bosses and fun controls, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was definitely an unexpectedly good surprise, especially for the value. Despite some inconsistent enemy movement, there is excellent weapon and upgrade variety. Even since my recent purchase, even more content has been added (enemies, weapons, maps) for free. I have been looking for a solo game similar to Roboquest, and this one satisfied that search, but added its own flavor to this subgenre. If you like optimizing a build, in more ways than just specific gun buffs, as well as consistent replayability, I recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Roguelike FPS I've played.\nIt has it's quirks with translation issues, but overall it's a standout of the genre for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Can play through many times and its just as fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute floofers and amazing fun. \n\nIf you enjoy roguelites and fluffy animals, you'll enjoy this.\n\nMake sure you bring your friends for maximum fluffiness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun FPS. great storyline and graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got into this party way late- which didn't matter as all seasons are available at your behest. \nTheres like 12 ish hours of grind for your main persistent buffs, and maybe a few more on kitting out each character. \n\nThen you're 'done' right? .. Well the thing is , on a good roguelike, the focus is on the gameplay loop and trying different trees on each of the multiple chars. Solo its pretty cool, but add some friends and it's even better. \n\nHere's one of the best examples of how to do a roguelike, and something about the arcade style action and cutesy yet somber characters has a good feel to it. I enjoyed this like crazy as a fps romp even though I shy away a bit at roguelikes. This has a lot of soul behind it and it's not one to overlook.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game when it was free for a weekend, fell in love, decided to buy it, fell even more in love, bought the dlc bundle, been having an absolute blast.\n\nRoguelike's are right up my alley and one with a fantasy feel like this is just perfect. Run's super smooth, haven't seen too many bugs, characters are fun and each offers a new playstyle. Will say, some are definately better than others (Looking at you Li)\n\nI'd recommend picking this up, really fun game and the devs are awesme too. Really excited for the future of this game! ^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its basically borderlands with furrys in a roguelike setting, the characters are diverse and a lot of fun, content updates are generally really good but very intermittent. Cant recommend this one enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A long-supported, intricate rogue-like shooter that has the most inventive and satisfying weapon design of just about any game I can think of. If you have a favorite video game gun (Needler, Devotion, Mastiff, etc), there is probably some reincarnation of it in this game. All the DLC is worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Insta-buy if you like looter shooters.  No reservations.  Loving how this game completely satisfies the Borderlands itch!  I'm 100 hours in, up to Reincarnation 8 difficulty and about halfway through the characters.  Best game I bought all year by far.  Shooter builds, skill builds, melee builds, a summoner build.  \r\n\r\nMost brilliant and unexpected build?  That owl...pretty mind-blowing character build concept.\r\n\r\nBe wary of the addiction potential of this great title...manage your life energy wisely my gaming friends...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tldr: Buy it. If you like shooting things, you will have a ton of fun. \n឵\nIt’s an amazing game. No mindless farming for progression, no masochistic grinding for success, just pure fun. It also contains one of my all-time favorite weapons in shooters: No, none of the wacky ones, but the basic-ass rifle named Revealer. Even without special effects, it is just so damn satisfying to spread the love (in the form of headshots), that I can't stop myself from picking it up every time I see it. \n឵\nThe core game loop is simple yet effective: You start with a basic pistol with infinite ammo, and get to choose a first main weapon from a random selection of three as well. After that, you’ll be constantly presented with new weapons, skills, character upgrades, ways to enhance the weapon you already have, etc. Everything happens one thing at a time, so there is never a moment where you are confused or overwhelmed; The only hesitation will come from the strategies and builds forming in your head, which is what roguelikes/-lites are supposed to do.\n\nAll of them are also significant in their nature, so you’ll never have to gripe with getting some bs like “+2% weapon damage” that feel (and are) worthless: Double the headshot damage, but halve the damage if you miss? There we go baby!\n឵\nSame goes for the meta progression, they are neither the useless “play for 1 hour to get <+1% weapon damage>”, nor the gatekeeping “play for 1h to get <ability to reload weapons>” type – every upgrade has an impact on gameplay, yet none is necessary to beat it: Perfect.\n឵\nOne thing to mention is the “FPS x Roguelite x RPG” marketing; I have no idea where the “RPG” part comes from. Yeah, sure, you’re playing a role, but you’re doing that in essentially all games. This contains no story, no dialogue, and only 5 individual upgrades per char, which are completely linear and choiceless. \n឵\nWhich brings me to my last point: The game is focused on what it does best. There is no tacked-on story, no boiler-plate dialogue with NPCs, no forced quests (albeit there being opportunities to accept challenges for rewards), and no tutorials or explanations outside the main menu - you are truly just running, gunning, and molding your character into a godly angel of death. Absolutely perfect to listen to music, a podcast or an audio-book in the background. \n឵\nRegarding the DLCs: Don't believe the nay-sayers that they are in any way, shape, or form predatory: The base game offers around 50h of fun for the average player, and around 100h if it really hits the mark for you. So I would have given it an absolute recommendation for 30$, let alone for 15-20$. Btw.: The 50h are based on an early version of the game with up to season 3 content available, now the game is at 7; All of them are and stay available and introduce new mechanics, so the 50h are probably a low estimate. \n឵\nSo, do I have something negative to say as well? Kinda: \n[list]\n    [*]Weapons have enchantments, up to a bunch of them. But getting a specific weapon to have a set of (more or less) specific enchantments is somewhere between difficult and impossible. This isn’t really bad, as it is a design and balancing decision, (otherwise everyone would immediately craft the “Primordial God-Killer 9000”) – still, I’d wish for more flexibility there. \n    [*]Same goes for leveling the weapons; Weapons drop with levels, which you can increase with money. But if you sank a bunch of coin into a specific one, you will be very hesitant to switch to a new one – even if it is the same with better enchantments - as all those levels go down the drain. So some way of transferring or merging levels would be great (and a simple money return doesn’t cut it either, as the amount of times you can upgrade at a single vendor are limited by default).\n    [*]More maps: Look at my playtime. New weapons and characters in the DLCs are cool, but what I need are more enemies and biomes, preferably with some enemy types being a counter to certain strategies, e.g. having specific element immunities, a hidden CRIT-spot, or stuff like that, to spice up the gameplay. And I am more than willing to pay for that!\n[/list]\n\nSo yeah, in sum: Buy it. If you like shooting things, you will have a ton of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peakfire Reborn\n\n\ni click the buy button for every dlc thank yuo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game but a short one. run great on my potato pc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is an awesome rpg/fps/rougelike. the vast varieties and hero combos are nearly endless, not to mention the cool maps, enemies and bosses. however for someone who's used to fps style games, i would suggest the devs to add an admire toggle (that allows you to view your gear's details ect) and also add a little bit more customization to heros, like hats or accessories to flex your progress. \r\n\r\nfor those struggling with crown prince v. lu wu (first boss) id recommend focusing on using fire buffs,(pyrodominance) fire weapons exclusively, timed dashing, use chain ability and aim for lu wu's head (weakspot) \r\n\r\n\r\nif you like cool guns, bossfights, chinese mythology and furries, then this game's for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like maxing out stats in various combinations and watching enemies explode on the screen, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun rogue-like. Every run requires a different build, so thinking and adaptability make every run unique.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands made into a roguelike. A lot of really fun weapons with cool unique mechanics, each character plays interestingly and unique (Big Turtle Man fan here). I think my favorite thing about the game so far though is that they don't stop adding new to this game. The seasons offer cool skins (with no premium purchase required) and some ways to modify gameplay to keep things interesting into 100s of hours easily.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, actually very enjoyable and fun to play with friends, i really hope they add more stages or more secondary routes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its just good dude. the dev team is dedicated to bringing tons of content, solid game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game, especially when with friends! Building characters in this game is pretty straightforward and if you're playing higher difficulties with Fortune Rolls it makes build crafting even CRAZIER. Straight up nuking rooms and face tanking enemies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im not sure if i recommend this game or not, the rougelike elements are on point though there arent many biomes, you basically almost go through the same things over and over again. also some ping issues but they dont matter much. satisfying combat and skills the characters are well designed and made",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Extremely enjoyable first person roguelike shooter. I prefer the more ‘mature’ graphics of deadzone, but the gameplay and build options are more abundant and fun to experiment with in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game that focus on replayability, offers a lot of unique and fun characters and builds. \nAdded a lot of content over time with free updates as well as good DLC content.\nA fun game to return to regularly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got a renewed Love for this game recently. I am having a BLAST with this! My goto char currently is Lyn and love building just full out Primary Skill DMG. I am currently managing to nuke every enemy in incarnate 2 more or less. The current season is also fun, at least with the right dice rolls. (EZ skill DMG that constantly nukes with Lyn's execute passive xD)\n\nThe game overall is very fun and addicting. It does feel a little repetitive with the same tiles and bosses over and over again. But I've seen that the devs plan adding more tiles and hopefully new tiles as well as new bosses. I would for example love for it to be multiple tiles in the beginning that gets randomly selected by the game instead of it always being the same one over and over again.\n\nBut again, overall very fun game that I whole heartily recommend!\n.\n.\n.\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First person Risk of rain 2 with harder bosses and slightly easier non elite type enemies. Best part is all seasonal and limited/pass cosmetics are obtainable at any time except for specific ones like anniversary avatar frames and stuff like that. You can play any season at any time which matters due to each season having their own unique system to change each game you play, cards for buffs, dice rolls for bonuses, etc. Meta progression exists as well meaning each run lets you upgrade a skill tree for more buffs and ways to get stronger during a run. Best bought with dlc though no doubt, the characters and weapons you get from the dlc are worth it so grab them with the game if possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty good game tbh, solo or multiplayers, a good roguelike, a beautiful one, gameplay wise, the customization is pretty great, game replay is better than ever\n\nthe only prob is the price of the dlcs, they are way too expensive for what it is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first played this, I almost didn't like it. But it quickly became one of my favorites of all time. \nCute character designs, insane builds. broken weapons. \nIt didn't truly click until I unlocked Qing Yan, now he's all I play\n\nI will say, I wish the guns had a little more haptic feel, or impact. Even when they're strong, they feel weak to shoot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great. If you are a fan of roguelites and arcady shooters like borderlands you will love it. \n\nDLC is well implimented and some of it can now be unlocked for free. \n\nThe season system lets you unlock previous seasons cosmetics without having to spend money. \n\nExtra characters are well designed. \n\nI fought an enemy called the \"Elite Crab Vanguard\". \n\n10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very underrated game, the amount of different builds and characters and guns in the game just make this game endless fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quality game,addictive and fun,good mechanics and weapons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. Gameplay and characters are diverse",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2]I love this game so much[/h2]\n\nI wish this game had a demo, I would have bought it sooner, free weekend on top of sale, new contents and dlc launch was big brain move.\n\nThis game and Roboquest are extremely similar like they are almost twin, it's hard not to compare them, Roboquest is obviously a superior product but Roboquest is too balanced, the devs are obsessed with balancing like they are Bungie with Destiny 2. I have never had a run where I felt like I have broke the game like in many other roguelikes/lites, I mean it's a roguelite, big numbers should go brrrr right? This is where Gunfire Reborn truly outshine.\n\nEvery single run is so consistence, rewards will always increase your dps, improves your build or survivability one way or another, there's no niche items, there's no bad weapons, they're all depends on your character and build. Numbers will start out small but by the end of the run you should be in range of hundred thousands if not millions damage.\n\nEvery character have at least 3 builds you can play with, a weapon focus build, a primary/secondary skill build or a mix of both. Yes there are a lot of DLC characters and weapons but the base game have 6 characters and plenty of weapons already. You don't need them unless you want more contents or 100%. Although second character should have unlocked within the first few hours so people don't have to be stuck with the first character for many runs.\n\nDifficulties doesn't hit you like a wall either but a slowly incline hill. There are more contents once you unlocked the highest difficulties. You will need meta progression to actually start winning but I never felt like I have to grind instead of just playing because it's fun and get meta currency.\n\nCo-op is fun, you should play with at least a bot teammate for free revives early on if you don't have friends but do not play with people who have maxed out meta progression, they'll just blast through the game and leaving you behind it's not fun at all as a new player.\n\nMovement kinda suck compare to Roboquest, only dodge, no double jumps, no grappling hook, no character that can fly/float, you just walk all the time, sometime really fast but that's it.\n\nEnglish translation is fine most of the time but the new season 6 content translation is not great sometime, the wordings could be confusing or inconsistent. \n\nWithout a firing range it's very hard to tell whether or not something you just added to your build actually work or not especially later in the run where so many things can happen in a single shot.\n\nI can see why some people like this more than Roboquest. Roboquest is a movement shooter first roguelite after so their build making aspect is honestly weak where Gunfire Reborn is a roguelite first FPS after so it's really depends on your reference.\n\nI'm close to 100% the game and I'm not even close to experience everything this game has to offer. I hope the devs will add a firing range like Roboquest.\n\nEdit: Forgot to mention that there are multiple seasonal mechanics that add tons of depth to the gameplay, you can choose to play with any seasons mechanic at any time or without them. These mechanics are really fun, some can completely change how you play. There are also daily challenge and another game mode which I haven't tried yet.\nThe game suddenly have performance issue after Nov 7th update with no fix.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple concept\r\nVery fun gameplay\r\nCute characters\r\nLots of build variety\r\nPassionate developpers\r\n\r\nA recipe for success.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Roguelite Borderlands\" is so compelling, I played it until bedtime, dreamt about a puzzle variant of it, and then played that for another four hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great action roguelike?  I don't know anymore but this game is fun as hell and its great to play with your friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best FPS rogue-like game in my collection and I've played a lot of them. They keep it fresh by having new and inventive seasons (free) and introducing new characters via paid DLCs which are well worth it. I'm over 360 hours into this game and I still haven't fully explored everything yet. It might seem overwhelming at first with the wide-range of scrolls, characters, weapons, and modifiers, but keep with it. Yes, expect to die a lot at first, but that's how all of these games start off. Keep at it and you'll be tackling the highest difficulty in no time. Great for casual players as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and addicting! Fun to boot up for a couple rounds, 7 hours later its been 8 runs and its 3am",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its really fun but hard at the same time plus i like explosion dog he's 100% my play style of just exploding everything plus the characters and some enemies are cute or kinda hot i do think the movement kinda sucks unless you get the right scrolls but thats the only complaint i have 9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its Really FUN and everything is earned theres no microtransactions at all\n\ni get the having dlc but people need to calm down saying its too hard to get good weapons hey guess what its almost like its a rogue-like i mean its random \n\nnot trying to be mean but i have seen so many people saying its too hard and theres bugs theres not a lot of bugs at all tbh i haven't ran into any atleast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty fun fps games, good difficulty. And don't worry to play it with public, each person got their own loot so you don't have to fight over for the loot and chest like in pubg or something. The season battlepass also free for all player, you just need to grind for the xp and the rewards is yours to keep.\n\nEvery characters in the game also have their own unique gameplay and build, you can try same character but different build that match your playstyle, the free starter character also pretty good already, and the DLC characters look so good and have a fun gameplay, You can tell by the DLC review percentage. Definitely going to buy the DLC for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun builds, great art style, and the ability to become overpowered = good ROGUELITE\n\nsome issues with english translation but not too big of a deal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is hardcore. If you die, you have to play the game over again. But after the uninstall and refund, its not possible. So I beat the game in a sense.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "look man i'm level 167. this game has bad runs, its true, but it also has crazy stupid runs where one bullet is one kill, even on bosses.\r\nabsolute recommend to anyone, not just furries.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what if borderlands was an arena shooter roguelite and all the player characters were furries",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "chinese animals with guns, how could it get any better?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top reasons why you should play;\n- it's Fun\n- has Guns\n- can be played with friends :3\n- has Guns\n- Nona ♡",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend group and i have had this game since before the full release and have always loved every second of it. it has always been our go to rogue like. I highly recommend it to anyone",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "你个单机游戏EULA里365天不活跃就删数据是什么意思\nWhat does it mean in a single-player game EULA that if you are inactive for 365 days, the data will be deleted?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Game feels good to play but the loop is on repeat. Also all the characters are locked and also locked behind dlc and it just makes the game boring. We were all Cats the whole 3 hours of playtime and we still werent close to unlocking a new one. Very dumb.\r\n\r\nPros:\r\n- Gameplay is fun.\r\n- Game is great looking.\r\n\r\nCons:\r\n- Every start of every game is a loop and the level is the same.\r\n- Characters all locked for ages so your stuck using the starting character unless you grind for 5-6 hours.\r\n- Games balance feels weird. First your killing everything in one hit then the boss has 2 million health and your just dodging the same attack over and over for 20 minutes because its health is bloated for no reason.\r\n- Most weapons are copy paste with little reason not to just go big number.\r\n\r\nAt the end of the day I can see why people like it but I dont see anyone playing it long without getting burned out and bored so I'm shocked at the rating.\r\n\r\n4/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "game is fun in the beggining, but once you're on the high levels, the game its just unfun. Its really unbalanced with enemies' projectiles hitting you through walls, a lot of immortal enemies that just slow the pace of the game and unfun numbers of  traps on the level",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "hiding that much content behind a paywall is not a good practice for a game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The gameplay is fine but the progression outside of runs is very bland. Also the runs take way to long 49 minutes so you just get one shoted from the last boss.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Very repetitive.\r\nMatchmaking is dead, can't find a match is 10 minutes.\r\nMost of the characters are paywalled by a DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The core objective of a roguelike is to make you want to start over — to experiment with new builds, chase exciting synergies, and feel that each run is a fresh opportunity.\n\nThis game completely misses that mark. Every run feels like a punishment rather than a new adventure. The build variety is shallow, the weapons are uninspired, and restarting isn’t exciting — it’s a chore. Instead of thinking “I can’t wait to try that next,” you’re thinking “I can’t believe I have to go through this again.”\n\nIf you want to see a roguelike done right, play Deadzone Rogue. That game understands how to make every run feel meaningful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has quickly been filled to the brim with random emotes, icons and useless items to make it feel more \"rewarding.\" Playing the game was the reward, playing the levels was the fun. You didn't have to ruin it\n\nBesides my petty reasons it feels like the difficult has been made much easier. Way too easy than I remember before my break. Before I could not beat the Polar Bear boss without building a build and planning. Now I don't even have to think, just spray and pray.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The dullest roguelike ever. All the locations feel exactly the same, it's like playing through the same basic fps game over and over, with the same few bosses and guns. Whoever compared it to borderlands is insane, they have absolutely nothing in common. You move at half speed with the shortest dashes in videogame history.\nYou earn souls and use them to upgrade your global skill tree, kind of like Rogue Legacy, except it's a boring grindfest instead. \nAnd wow look at that, there's a trillion DLCs that add more characters to the game, what a rip off.\n2 weeks after I bought it there was a free weekend all of a sudden... ffs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've gotten 12 crashes so far with about 13h in every single crash is the same \"UnityPlayer.dll caused an Access Violation\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play, but boring alone and a lot of clunk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very repetitive.\r\nMatchmaking is dead, can't find a match is 10 minutes.\r\nMost of the characters are paywalled by a DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so low fidelity i get motion sick. its like putting on reading glasses when you dont need them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring repetitive gameplay. No multiplayer for new players as matchmaking takes forever. buy something else",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just the the damn pirate ship boss and this game will be a lot more fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't you just love when a game gimps your character at half strength and speed making specific enemies impossible due to your cooldowns rather than your skill, and tells you \"just grind more!\" as the solution?\nDon't you just love these dogs♥♥t meta-progression mechanics that artificially pad out the playtime of otherwise 90 minute games while also progressively making themselves so easy anyone with enough time to burn can get the highest rank?\n\nI don't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate the rng factor. one mid game one hundred bad ones. rng is what this game is about",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ts furry game buns. moves like a unity game and plays like a roblox game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi,\nIt's me, your local rogue-lite hater. I'm just checking if I really don't like this genre. Again. This was n-th try.\nI report that my aversion still stands strong.\nSo, I just want to say that it is really a rogue-lite, indeed. With all the consequences. What a surprise. So, understandably - I hate it.\n\nThanks for your attention. Have a nice day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "100% the game just for them to add more achievements behind a pay wall >:(",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Overrated rougelite that doesn't stand out in an oversaturated genre.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I failed the daily challenge skill issue",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They added forced arbitration into their EULA with the new update and dlc. Good game, but I refuse to tolerate this sort of EULA BS, so its getting a negative from me now",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "你个单机游戏EULA里365天不活跃就删数据是什么意思\nWhat does it mean in a single-player game EULA that if you are inactive for 365 days, the data will be deleted?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This game is great but I will never recommend it to play unless you have friends. The matchmaking is dead, and non-existent.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "It's fun but the game is so imbalanced.\n\nI shouldn't have to be mindfully restricting myself in every single aspect of gameplay (Gun choice, character choice, season choice) just to play the game on a normal level. The DLC is vastly overpowered, and some season effects play the game for you. Maybe good for very casual gamers.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Movement is way WAY too slow for a fast paced game like this, and also has the worst tutorial when it comes to game design,  also in the game if you're new and playing with friends who have played before, you have to deal with harder enemies when you have way less revive time and stuff, essentially, only good in singleplayer.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game feels good to play but the loop is on repeat. Also all the characters are locked and also locked behind dlc and it just makes the game boring. We were all Cats the whole 3 hours of playtime and we still werent close to unlocking a new one. Very dumb.\r\n\r\nPros:\r\n- Gameplay is fun.\r\n- Game is great looking.\r\n\r\nCons:\r\n- Every start of every game is a loop and the level is the same.\r\n- Characters all locked for ages so your stuck using the starting character unless you grind for 5-6 hours.\r\n- Games balance feels weird. First your killing everything in one hit then the boss has 2 million health and your just dodging the same attack over and over for 20 minutes because its health is bloated for no reason.\r\n- Most weapons are copy paste with little reason not to just go big number.\r\n\r\nAt the end of the day I can see why people like it but I dont see anyone playing it long without getting burned out and bored so I'm shocked at the rating.\r\n\r\n4/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "hiding that much content behind a paywall is not a good practice for a game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The gameplay is fine but the progression outside of runs is very bland. Also the runs take way to long 49 minutes so you just get one shoted from the last boss.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Riddled with bugs and typos. UI is a mess. Movement and shooting feels so janky, like a mobile game in alpha. I have no idea how this game can be overwhelmingly positive, I guess if you love animals and foxes?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "game is fun in the beggining, but once you're on the high levels, the game its just unfun. Its really unbalanced with enemies' projectiles hitting you through walls, a lot of immortal enemies that just slow the pace of the game and unfun numbers of  traps on the level",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game boring and characters confusing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The core objective of a roguelike is to make you want to start over — to experiment with new builds, chase exciting synergies, and feel that each run is a fresh opportunity.\n\nThis game completely misses that mark. Every run feels like a punishment rather than a new adventure. The build variety is shallow, the weapons are uninspired, and restarting isn’t exciting — it’s a chore. Instead of thinking “I can’t wait to try that next,” you’re thinking “I can’t believe I have to go through this again.”\n\nIf you want to see a roguelike done right, play Deadzone Rogue. That game understands how to make every run feel meaningful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has quickly been filled to the brim with random emotes, icons and useless items to make it feel more \"rewarding.\" Playing the game was the reward, playing the levels was the fun. You didn't have to ruin it\n\nBesides my petty reasons it feels like the difficult has been made much easier. Way too easy than I remember before my break. Before I could not beat the Polar Bear boss without building a build and planning. Now I don't even have to think, just spray and pray.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The dullest roguelike ever. All the locations feel exactly the same, it's like playing through the same basic fps game over and over, with the same few bosses and guns. Whoever compared it to borderlands is insane, they have absolutely nothing in common. You move at half speed with the shortest dashes in videogame history.\nYou earn souls and use them to upgrade your global skill tree, kind of like Rogue Legacy, except it's a boring grindfest instead. \nAnd wow look at that, there's a trillion DLCs that add more characters to the game, what a rip off.\n2 weeks after I bought it there was a free weekend all of a sudden... ffs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've gotten 12 crashes so far with about 13h in every single crash is the same \"UnityPlayer.dll caused an Access Violation\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play, but boring alone and a lot of clunk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very repetitive.\r\nMatchmaking is dead, can't find a match is 10 minutes.\r\nMost of the characters are paywalled by a DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so low fidelity i get motion sick. its like putting on reading glasses when you dont need them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring repetitive gameplay. No multiplayer for new players as matchmaking takes forever. buy something else",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just the the damn pirate ship boss and this game will be a lot more fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't you just love when a game gimps your character at half strength and speed making specific enemies impossible due to your cooldowns rather than your skill, and tells you \"just grind more!\" as the solution?\nDon't you just love these dogs♥♥t meta-progression mechanics that artificially pad out the playtime of otherwise 90 minute games while also progressively making themselves so easy anyone with enough time to burn can get the highest rank?\n\nI don't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate the rng factor. one mid game one hundred bad ones. rng is what this game is about",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ts furry game buns. moves like a unity game and plays like a roblox game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi,\nIt's me, your local rogue-lite hater. I'm just checking if I really don't like this genre. Again. This was n-th try.\nI report that my aversion still stands strong.\nSo, I just want to say that it is really a rogue-lite, indeed. With all the consequences. What a surprise. So, understandably - I hate it.\n\nThanks for your attention. Have a nice day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "100% the game just for them to add more achievements behind a pay wall >:(",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Overrated rougelite that doesn't stand out in an oversaturated genre.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I failed the daily challenge skill issue",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They added forced arbitration into their EULA with the new update and dlc. Good game, but I refuse to tolerate this sort of EULA BS, so its getting a negative from me now",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "你个单机游戏EULA里365天不活跃就删数据是什么意思\nWhat does it mean in a single-player game EULA that if you are inactive for 365 days, the data will be deleted?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This game is great but I will never recommend it to play unless you have friends. The matchmaking is dead, and non-existent.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "It's fun but the game is so imbalanced.\n\nI shouldn't have to be mindfully restricting myself in every single aspect of gameplay (Gun choice, character choice, season choice) just to play the game on a normal level. The DLC is vastly overpowered, and some season effects play the game for you. Maybe good for very casual gamers.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Movement is way WAY too slow for a fast paced game like this, and also has the worst tutorial when it comes to game design,  also in the game if you're new and playing with friends who have played before, you have to deal with harder enemies when you have way less revive time and stuff, essentially, only good in singleplayer.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game feels good to play but the loop is on repeat. Also all the characters are locked and also locked behind dlc and it just makes the game boring. We were all Cats the whole 3 hours of playtime and we still werent close to unlocking a new one. Very dumb.\r\n\r\nPros:\r\n- Gameplay is fun.\r\n- Game is great looking.\r\n\r\nCons:\r\n- Every start of every game is a loop and the level is the same.\r\n- Characters all locked for ages so your stuck using the starting character unless you grind for 5-6 hours.\r\n- Games balance feels weird. First your killing everything in one hit then the boss has 2 million health and your just dodging the same attack over and over for 20 minutes because its health is bloated for no reason.\r\n- Most weapons are copy paste with little reason not to just go big number.\r\n\r\nAt the end of the day I can see why people like it but I dont see anyone playing it long without getting burned out and bored so I'm shocked at the rating.\r\n\r\n4/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "hiding that much content behind a paywall is not a good practice for a game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The gameplay is fine but the progression outside of runs is very bland. Also the runs take way to long 49 minutes so you just get one shoted from the last boss.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Riddled with bugs and typos. UI is a mess. Movement and shooting feels so janky, like a mobile game in alpha. I have no idea how this game can be overwhelmingly positive, I guess if you love animals and foxes?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "game is fun in the beggining, but once you're on the high levels, the game its just unfun. Its really unbalanced with enemies' projectiles hitting you through walls, a lot of immortal enemies that just slow the pace of the game and unfun numbers of  traps on the level",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game boring and characters confusing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The core objective of a roguelike is to make you want to start over — to experiment with new builds, chase exciting synergies, and feel that each run is a fresh opportunity.\n\nThis game completely misses that mark. Every run feels like a punishment rather than a new adventure. The build variety is shallow, the weapons are uninspired, and restarting isn’t exciting — it’s a chore. Instead of thinking “I can’t wait to try that next,” you’re thinking “I can’t believe I have to go through this again.”\n\nIf you want to see a roguelike done right, play Deadzone Rogue. That game understands how to make every run feel meaningful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has quickly been filled to the brim with random emotes, icons and useless items to make it feel more \"rewarding.\" Playing the game was the reward, playing the levels was the fun. You didn't have to ruin it\n\nBesides my petty reasons it feels like the difficult has been made much easier. Way too easy than I remember before my break. Before I could not beat the Polar Bear boss without building a build and planning. Now I don't even have to think, just spray and pray.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The dullest roguelike ever. All the locations feel exactly the same, it's like playing through the same basic fps game over and over, with the same few bosses and guns. Whoever compared it to borderlands is insane, they have absolutely nothing in common. You move at half speed with the shortest dashes in videogame history.\nYou earn souls and use them to upgrade your global skill tree, kind of like Rogue Legacy, except it's a boring grindfest instead. \nAnd wow look at that, there's a trillion DLCs that add more characters to the game, what a rip off.\n2 weeks after I bought it there was a free weekend all of a sudden... ffs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've gotten 12 crashes so far with about 13h in every single crash is the same \"UnityPlayer.dll caused an Access Violation\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play, but boring alone and a lot of clunk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very repetitive.\r\nMatchmaking is dead, can't find a match is 10 minutes.\r\nMost of the characters are paywalled by a DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so low fidelity i get motion sick. its like putting on reading glasses when you dont need them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring repetitive gameplay. No multiplayer for new players as matchmaking takes forever. buy something else",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just the the damn pirate ship boss and this game will be a lot more fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't you just love when a game gimps your character at half strength and speed making specific enemies impossible due to your cooldowns rather than your skill, and tells you \"just grind more!\" as the solution?\nDon't you just love these dogs♥♥t meta-progression mechanics that artificially pad out the playtime of otherwise 90 minute games while also progressively making themselves so easy anyone with enough time to burn can get the highest rank?\n\nI don't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate the rng factor. one mid game one hundred bad ones. rng is what this game is about",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ts furry game buns. moves like a unity game and plays like a roblox game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi,\nIt's me, your local rogue-lite hater. I'm just checking if I really don't like this genre. Again. This was n-th try.\nI report that my aversion still stands strong.\nSo, I just want to say that it is really a rogue-lite, indeed. With all the consequences. What a surprise. So, understandably - I hate it.\n\nThanks for your attention. Have a nice day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "100% the game just for them to add more achievements behind a pay wall >:(",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Overrated rougelite that doesn't stand out in an oversaturated genre.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I failed the daily challenge skill issue",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They added forced arbitration into their EULA with the new update and dlc. Good game, but I refuse to tolerate this sort of EULA BS, so its getting a negative from me now",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "你个单机游戏EULA里365天不活跃就删数据是什么意思\nWhat does it mean in a single-player game EULA that if you are inactive for 365 days, the data will be deleted?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This game is great but I will never recommend it to play unless you have friends. The matchmaking is dead, and non-existent.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "It's fun but the game is so imbalanced.\n\nI shouldn't have to be mindfully restricting myself in every single aspect of gameplay (Gun choice, character choice, season choice) just to play the game on a normal level. The DLC is vastly overpowered, and some season effects play the game for you. Maybe good for very casual gamers.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Movement is way WAY too slow for a fast paced game like this, and also has the worst tutorial when it comes to game design,  also in the game if you're new and playing with friends who have played before, you have to deal with harder enemies when you have way less revive time and stuff, essentially, only good in singleplayer.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game feels good to play but the loop is on repeat. Also all the characters are locked and also locked behind dlc and it just makes the game boring. We were all Cats the whole 3 hours of playtime and we still werent close to unlocking a new one. Very dumb.\r\n\r\nPros:\r\n- Gameplay is fun.\r\n- Game is great looking.\r\n\r\nCons:\r\n- Every start of every game is a loop and the level is the same.\r\n- Characters all locked for ages so your stuck using the starting character unless you grind for 5-6 hours.\r\n- Games balance feels weird. First your killing everything in one hit then the boss has 2 million health and your just dodging the same attack over and over for 20 minutes because its health is bloated for no reason.\r\n- Most weapons are copy paste with little reason not to just go big number.\r\n\r\nAt the end of the day I can see why people like it but I dont see anyone playing it long without getting burned out and bored so I'm shocked at the rating.\r\n\r\n4/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "hiding that much content behind a paywall is not a good practice for a game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The gameplay is fine but the progression outside of runs is very bland. Also the runs take way to long 49 minutes so you just get one shoted from the last boss.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Riddled with bugs and typos. UI is a mess. Movement and shooting feels so janky, like a mobile game in alpha. I have no idea how this game can be overwhelmingly positive, I guess if you love animals and foxes?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "game is fun in the beggining, but once you're on the high levels, the game its just unfun. Its really unbalanced with enemies' projectiles hitting you through walls, a lot of immortal enemies that just slow the pace of the game and unfun numbers of  traps on the level",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game boring and characters confusing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The core objective of a roguelike is to make you want to start over — to experiment with new builds, chase exciting synergies, and feel that each run is a fresh opportunity.\n\nThis game completely misses that mark. Every run feels like a punishment rather than a new adventure. The build variety is shallow, the weapons are uninspired, and restarting isn’t exciting — it’s a chore. Instead of thinking “I can’t wait to try that next,” you’re thinking “I can’t believe I have to go through this again.”\n\nIf you want to see a roguelike done right, play Deadzone Rogue. That game understands how to make every run feel meaningful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has quickly been filled to the brim with random emotes, icons and useless items to make it feel more \"rewarding.\" Playing the game was the reward, playing the levels was the fun. You didn't have to ruin it\n\nBesides my petty reasons it feels like the difficult has been made much easier. Way too easy than I remember before my break. Before I could not beat the Polar Bear boss without building a build and planning. Now I don't even have to think, just spray and pray.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The dullest roguelike ever. All the locations feel exactly the same, it's like playing through the same basic fps game over and over, with the same few bosses and guns. Whoever compared it to borderlands is insane, they have absolutely nothing in common. You move at half speed with the shortest dashes in videogame history.\nYou earn souls and use them to upgrade your global skill tree, kind of like Rogue Legacy, except it's a boring grindfest instead. \nAnd wow look at that, there's a trillion DLCs that add more characters to the game, what a rip off.\n2 weeks after I bought it there was a free weekend all of a sudden... ffs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've gotten 12 crashes so far with about 13h in every single crash is the same \"UnityPlayer.dll caused an Access Violation\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play, but boring alone and a lot of clunk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very repetitive.\r\nMatchmaking is dead, can't find a match is 10 minutes.\r\nMost of the characters are paywalled by a DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so low fidelity i get motion sick. its like putting on reading glasses when you dont need them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring repetitive gameplay. No multiplayer for new players as matchmaking takes forever. buy something else",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just the the damn pirate ship boss and this game will be a lot more fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't you just love when a game gimps your character at half strength and speed making specific enemies impossible due to your cooldowns rather than your skill, and tells you \"just grind more!\" as the solution?\nDon't you just love these dogs♥♥t meta-progression mechanics that artificially pad out the playtime of otherwise 90 minute games while also progressively making themselves so easy anyone with enough time to burn can get the highest rank?\n\nI don't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate the rng factor. one mid game one hundred bad ones. rng is what this game is about",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ts furry game buns. moves like a unity game and plays like a roblox game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi,\nIt's me, your local rogue-lite hater. I'm just checking if I really don't like this genre. Again. This was n-th try.\nI report that my aversion still stands strong.\nSo, I just want to say that it is really a rogue-lite, indeed. With all the consequences. What a surprise. So, understandably - I hate it.\n\nThanks for your attention. Have a nice day.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}