{
  "positive": [
    {
      "review": "If you need reviews for The Sims I assume you lived under a rock. \n\nYou can controll people and Build houses.\nThe game mostly works even on my potatoe.\nThe EA Launcher is absolute Junk but sadly nececcary.\nctrl+shft motherlode gets you 50000 in Sims Currency\nAfter every update I have to reactivate all mods.\n\n\nOver 1500€ in DLCs is a Number and everything you need to know about EA. \nI've bought functional cars for less money. \n\nBut the Base Game is free and there are endless Mods. So Fxxk it.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "Good game, one of the greediest, lazy, and annoying publisher, thank god for steam release because I will never ever ever touch EA launcher (even thought this game gets redirected to the ea launcher when you launch it, atleast it minimizes it using steam, i just do not want to touch that thing) choke on nuclear dirt EA",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "A game the tenant can overcome their sorrow.\r\nA game the single can find their love.\r\nA game the poor can't afford to play.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "As someone who has been playing The Sims for years and can't resist buying every new expansion pack I can say that this game has a strange power that draws you in It's actually quite simple: build a house, create a character build a life but that's not where it ends The Sims is such a game that you lose track of time while playing it you go in thinking \"I'll just tidy up the house a bit,\" and three hours later you're picking out wall paint It's still a lot of fun to play but it's not without its flaws I especially think some packs are way too weak in terms of value for money there are items that add just a few objects or animations but charge the full pack price that's a bit frustrating still when you play with mods the game reaches a whole new level I can say I've stopped playing without mods the game's own content is fun but mods truly expand the game graphically it has a sweet colorful and easy-on-the-eyes design In short it has established its own unique aesthetic and has maintained it for years However some animations still look like they did 10 years ago",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's OK. I'd give it 4 stars, EA sucks but the game is alright. Sims 1 is better in my opinion.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Too many expansion & packs that should've been in the base game instead.\r\nBut still fun",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I’ve been playing The Sims since around 2002, and The Sims 4 is still one of those games I never seem to get tired of, even after all these years. The amount of content keeps the game feeling fresh and exciting (there are still so many mechanics in there that I've never tried), and the community around it is incredibly vibrant and SO creative. I also really appreciate how inclusive the game has become, there are just so many options to build my characters and fine-tune my stories to perfection. The lore and the weird little in-universe details are still there, no matter how much people like complaining about it not being as unhinged as the Sims 1 and 2. Even if it's not cool as a gamer to say The Sims 4 is your favorite game, it is always my answer!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very nice game if you run it with mods. I am not giving hundreds of dollars to buy DLCs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its great. The game is overall fun and enjoyable, my only issue is the prices for expansions.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "PEAK MEDIA, i made john doe and arthur lester kiss. Gay sloppy style.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "One of the best game for relax. \r\nDLC is so bad, only play if you \"know\" what you doing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game on PC with lots of add on packs and mods",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A life-sim playground perfect for creativity or chaos. Great for building, storytelling, or, yes, destroying your community in delightfully evil ways.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the sims is one of my fav games! yes your sim doesnt always listen but its always entertaining to play highly recommed trying it out",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing Sims 4 is fun because where else can I create chaotic families, build weird houses and live out my virtual drama without real life consequences :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very cool, dlcs are just unessecarily expensive",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun to play! Even with just the base game, there's a lot of options to customize characters and build houses. Playing as the characters you make is fun too! I've played this on multiple devices and have... many hours of this played that Steam doesn't know about XD",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "amazing game buy the DLCs when on sale and look on curseforge cuz their might be a mod that can give you the same thing a DLC can (: anyway a fun game to relax to",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Hands down, one of the best games of all time.\nIf you love creativity, creation, drama, and life, this game is for you! Half the time I spend hours simply creating sims and its so fun. Bringing a human being to life of your own creation and descending them into a wacky world where they can have children, work a job, or do so much more if you have expansion packs (which I highly recommend). This game is so funny and enjoyable. The expansion packs have brought a world of drama into my sims lives as now some have become vampires, werewolves, or witches! Additionally, I love the normal (non-paranormal) aspects as well. Getting to raise a family and design your own home, getting to see your family trees expand and even interact with other families you have made is a beautiful sight to see. \nSome things to note: This game does take time if you want things to be completely in your control. Whether its creating a sim, building a home, ensuring that each sim in your household grows the skills you want them to have, all takes time and care. But if this doesn't interest you, then get a little wild with it, let your sims do their own thing. That's what makes this game amazing is that you can do whatever you want and whenever you want. \nFor newcomers, the game may seem bland at first, but even without expansions packs there are ways to have fun. I strongly recommend using cheats if your looking for a sandbox-based gameplay, (you can easily find them on the web) and the Devs even support the use of cheats as well because they just want people to have fun. \nBe creative, go crazy, and let loose! If this game ever feels stressful because your trying to make the perfect family, then I'd recommend letting go of control and watching your sims grow a bit with small nudges in the right directions. Sometimes complete control is not always necessary for the right outcomes in this game. \nHope this review finds you all well, cheers!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing this game for years however it is really annoying when the base game is bugging out constantly. I even deleted all my mods and the game still wouldn't launch. I love the sims but it is crazy that EA hasn't fixed all the bugs in their game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best simulation game of all time. I suggest the developers to please include a built-in storage cloud so I can switch device without starting new game :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool fun exciting game for children and adults so brilliant and amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A world of creation and new ideas. Very easy to control mods you can add and lots of unique customization options from housing, to characters, pets and more, just all together 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hate this damn game, its consuming my whole life and my family had to have an intervention...... im writing this on the nurses computer, im pissed, i have over 15 hundred hours on this game and have spent too much money on it and my familys all you need to get a life and something and now i have gripy socks, so a win is a win i suppose and now since me and the nurses are in kahoots im allowed four hours every night to play, yay! i also hate this game with a raging 5 stars...... this is all a joke, except the part about how many hours i have played and all the money i spent thats not a joke",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun ....I love sims 4 because its so realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "while the gameplay is lacking compared to previous titles, this is the best sims to build in. im not gonna talk about the dlc other than yes it is very expensive and you should only buy the dlc on sale. honestly the gameplay isnt even that bad but definitely look into downloading mods for more options",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing The Sims for over ten years now, on various devices: computer, PlayStation, even an old Nintendo DS. It's still one of my favorite games, and I will always recommend it to anyone looking for a non-stressful, highly customizable game. You can basically live out your dreams through your Sims and do just about anything you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "realy good game to get building creating and make ur own caracters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game controls can be tricky for first-time players. Free-Cam is kind of slow as well. Unfortunately there's also not a lot of compatability with base-game material, so you either have to role with objects associated with one central theme or purchase add-ons. Aside from that the gay is quite fun to play. Buildings look good, and the drama between Sims is hilarious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent but had some bugs when it comes to one of my sims during Elderly Demise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Sims game. I only have the base game but honestly it's got plenty of build mode features in this one if you know what you're doing. There's always an abundance of custom content available for these games as well. To be honest I don't know if I have played a single sims game that I haven't enjoyed. They're all unique, specifically the console versions like The Urbz: Sims in the City or The Sims: Bustin Out, where they have a single player, story mode style of gameplay. If we're talking about The Sims 1-4 series, they were all perfectly engineered, the build modes in all of them are plenty enough to make you feel like a palace architect at times, and overall just great games tbh. Sims 2 is probably my personal favorite, I have the complete collection with every expansion pack when they gave it away for free in like 2014. It's just your basic ass Sims game tbh. I don't remember how much I paid for it but I probably got it when it was on sale. Whatever price it is, its definitely worth the money.\n\n-UPDATE- I found out this game is now a free-to-play game. While I am very opinionated on this matter, I've left a critical review about how Counter Strike: Global Offensive (now cs2) is a free-to-play game as well. I don't want it to seem like EA, Valve, and many other modern video game companies are riding the wave of making their games free-to-play and making all added extra features pay2win, but honestly, I feel like this is making it very unfair for me, the consumer, to go out and actually buy the real games, only to find out that in about a year, its just going to be deemed as a free-to-play game. EA, do you guys really think this is a free-to-play game? Have some damn respect for yourselves boys, I paid good money for this game only for it to valued as a free-to-play game. I'm gonna need my money back or some type of DLC reimbursement because I actually paid money for this game on Origin. Making your games free-to-play after a certain amount of time, makes me feel like the companies that publish these games are actually de-valuing the game. Personally, if I see a game that's free-to-play, I might automatically think its a trash ass game. That, or it's ridden with a bunch of pay2win DLC to make you shell out dollars into the actual, full game. Older legacy games like The Sims 2 and 3 cost money, full price, and honestly, now that I think about it, it put's a sick taste in my mouth thinking that EA decides to devalue their main game, The Sims 4, whereas the older, classic games in the series, are still full price. So does that mean the classic Sims games were better than 4, since they're still worth money to this day? Hot take.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well kind of recommend this game it can be better like cheaper game passes and be able to have mods and would not  get a virus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game and I like the option of things like cc's to be added",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing the sims series for decades, and I still love it. I'll probably keep playing it for years to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another major simulator game based on daily life which still got players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% worth playing, it is a fun game if you like Life simulator games. The only thing I would say about it not being good, is how expensive the DLC's are, wish they weren't £35 every DLC sucks really",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, cant wait for an open world of some sort for the next game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love that im able to customize my game, all though I wish there was more freedoms on building and life activities. The DLCs are very expensive and its best to wait till theres a sale to buy them but this game is fun to play buy it self",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a fun and silly game with extra game passes but it is also fun without them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much. I've almost have all the packs and kits. This is the game I have played the most out of my entire library. This game is my zen mode for after work. I love all of the different things to do in the game and I can't wait for the new packs to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's wayyyyyyy to expensive but i love to make different people and build cute houses.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a fun game, the ideas of things to do are endless. If you like to build, create and let your imagination run wild this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "had 400 plus hours on my Old account back in 2016.\r\nBut this game is fun, the music can be a bit annoying after a few hours of playing.\r\nplaying on PC is way better with mods, dislike how much DLC there are, but at least the game is free for people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend playing with vampires and realm of magic, its really fun and keeps things interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10 game I liked a lot about this game and think the character customization is a 9/10 and a 11/10 with mods and ive learned the simlish language after around 60-70 hours or so (Kill Travis, Ive modded it to when Travis dies it resets him so I can kill him again)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is basically just The Sims 2 with more complex simulation setups (Build Mode especially) but with riddiculously limited neighborhood feature. Which might be favorable to the newbies but the veterans might found these simplifications to be disappointing.\n\nBut, in terms of actual simulation gameplay: Hands down this might be the best one in the series.\nI was never been a fan of The Sims 3's overcomplicated simulation gameplay loop, so The Sims 4 made it more streamlined... to an extent.\n\nMy first impression: 65/100\n\nI will update this review, once I reached at least 50 hours of The Sims 4 play time.\nStay tuned.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good classic game despite EA being greedy these days for kept making thousand of DLC either expansion packs with high price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Sims 4 is super easy to get hooked on. Building houses, making characters, and watching your Sims live their funny, messy, or perfect lives is always fun. There’s so much to do and it’s really relaxing but addictive at the same time. I always end up losing track of time whenever I play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my core memory games, iconic, but as i get older it become a luxury",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game that I keep reinstalling.\r\nI come back to it every now and then for the serenity and for the therapy of building the houses...\r\n...and yes, it's fun to play with their little lives as well...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "But not from steam, If you want to play the base game then its fine, but if you want to mod the game you have to go through EA as any DLC you buy from steam can't be transferred over, I only realised this after trying to mod AFTER I had played the game for over 2 hours so I can't get a refund for the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice graphics, a lot of fun to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an immortal game, developed over many years, with an endless list of regularly created add-ons sold for big money, an endless flow of cash for the publisher ;-]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Sims is great. Really Creative. Much more fun when you do challenges for more varied gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "graphics are great overall a fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funs & fairly easy to play. I'm an avid Freeplay player so it takes some getting used to for building. Overall, pretty neat game. I also have yet to figure out how to move Sims that were once roommates to separate households.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i recommend this game to anyone who likes the decorate or just needs time to their self, Ten out of ten would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "transferred from sims 3, pleasantly surprised at how good it is after avoiding it for years! \r\ni'm gonna have to drop all my money on it\r\n\r\n+ dlcs are good\r\n- need walls to keep sims in pool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game def has a lot of tricks you have to learn to build.  However it is good enough to take the time.  EA of coarse is a greedy company and wants to make every feature you need to buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to zone out to. A lot of fun to mod and just get creative with!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game, but I think it has way too much DLC and it is very glitchy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Sims 4 — a game where my Sims live better lives than I do, despite having the IQ of a warm biscuit.\n\nAs for the expansions:\nGet to Work — finally I can supervise my Sims at their jobs just to confirm they’re as incompetent as in real life.\nCats & Dogs — adorable pets who get sick more often than I buy new DLC (which is… a lot).\n\nThe downside? The price. Collecting all the expansions costs about as much as a mortgage on an empty lot.\n\nRating: 7/10. Everything annoys me, yet I keep playing. Classic Sims fan behavior.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the ability to endlessly create and build new houses, businesses, and lives. My all time favorite game. I have over 6000 hours in total across my different downloads of the game. Highly suggest using bundle sales to get the best deal on all dlc's!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game to play, though the DLC is crazy expensive. you know EA's greed is endless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the Sims, so what's not to like? Overall it's an amazing example of playing and customizing a character you want to be in real life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's glitchy sometimes, but that's probably because of my computer. Other than that it's great. I would recommend downloading mods to go with it as well after you've played a while because it can get a little repetitive. Happy simming!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very fun and you can bild and create relationships and people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "left the game running over night, came back to everyone on fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10 Years In… Send Help!\n\nI’ve built 200 houses, deleted 199 of them, made families, removed ladder from the pool “for science,” watched my Sim flirt with a fridge, and somehow I’m still here. Every time I swear I’m done, the game hits me with a new expansion like: “What if your Sim… knitted?” and suddenly I’m back, ruining another Sim’s life.\n\nAt this point, I don’t play the game. The game plays me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought because ex-girlfriend forced it. Hated it at first. Then… obsession. Built worlds, ruined lives, controlled tiny digital humans like a god. Never thought I’d love this kind of game. 10/10, because love is weird and so is controlling pixel people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and creative game with relaxing gameplay. There's plenty to do in the base game without having to purchase any DLC's. But there are many DLC's with great content that would improve and expand both the world and what you can do in the world. The Sims 4 got even better now that they are finally fixing bugs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the sims 4 game other than the endless glitching. Other than that I would ABSOULTLY recommend this to others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it took a long time to load but its an awsom game (sorry if i didn't spell that right)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great addictive game. Well made and minimal bugs. Consistant frequent updates which continue to imporve th  experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sims has seriously on--evolved. There's no real right or wrong way to play the game -- the whole point is to enjoy yourself. I love that it asks questions like peeing standing up or down, can get someone else pregnant or get pregnant, be in many relationships without jealousy (an aspiration goal/reward), and letting you choose pronouns. It is so open ended in so many ways and continues to open up more and new ways to play. I look forward to seeing what they do next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game for a crazy long time (even longer than my Steam recorded time) and I just want to say that it is dumb. It's a great game, but a lot of the updates are dumb and cost too much money. \n\nThanks!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has been around and has carried most of my sims memories. EA has since ruined the experience ever since they started jacking prices up. i love this game and it will always have a place in my heart. I have some DLC, not all, and it can be an experience with js one dlc. thank you EA.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is free but dlcs are so expensive, recommend playing with mods though if u can",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My life is depressing, but with this game i can truly feel how the others feel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun! I love giving the characters friends to hang out with. I don't know if you're able to see how many hours I've played, but if you can't, it says 1268 hours. Don't worry, I haven't actually played that long. I've probably played like 15 hours total, but I've accidentally been leaving open this tab for weeks straight. I do recommend this game though, it is very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. When I don't know what to play or just want to enjoy myself, there is always something to do in the Sims.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🏠 The Sims 4: O Simulador de Dívida Imobiliária e Experimentos Sociais 🏠The Sims 4 é, sem dúvida, o melhor simulador de vida que existe, principalmente porque ele replica perfeitamente a realidade: tudo custa dinheiro e sua casa nunca estará pronta.A Realidade Nua e CruaO jogo começa inocente. Você cria um Sim. Ele é lindo, cheio de aspirações, quer ser o próximo astronauta ou um chef 5 estrelas. Mas a vida real bate rápido:A Carreira: Você manda seu Sim para o trabalho às 9h e ele volta às 18h com uma promoção que lhe rendeu +12 simoleons por hora. Expectativa vs. Realidade em sua forma mais pura.O Fogo Amigo (Literalmente): Colocar uma lareira nova na casa? Ótimo. Seu Sim vai tentar cozinhar macarrão com queijo pela primeira vez e, em 30 segundos, a cozinha inteira estará em chamas. A Morte (Ceifador) aparece, bate um papo casual e leva embora o seu Sim que tinha acabado de pagar a conta de água.O FOMO (Medo de Ficar de Fora): O jogo base é a amostra grátis. A verdadeira experiência The Sims 4 custa o equivalente a um rim no mercado negro. Gatos e Cães? Pacote. Ser um vampiro? Pacote. Ir para a faculdade? Pacote. A EA não vende um jogo, ela vende um estilo de vida, e esse estilo de vida é caro.VereditoNeutro (Mas Principalmente Positivo). É um jogo incrível para liberar seu lado controlador. Paguei R\\(30nojogobasenapromoção,masjágasteiR\\) 500 em expansões. Vale a pena? Sim, mas minha carteira chora. Compre em promoção e prepare o bolso para o vício!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game, interesting and you can do whatever you want which can really improve creativity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its the sims, its iconic and classic and great at its best. but its full of bugs that sometimes are critical",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game in my opinion, it makes time pass by quick so thats good. Very fun and multiple things you can do on it. there are packs you can buy but the base game is also very fun. would recommend some packs as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sims4 is a very versatile game that allows you to relax and enjoy just dinking around on those days you are to tired for a game that requires a bit to much thought but is fun and relaxing to play instead. Also it just keeps growing and coming out with expansions so there is something for everyone in this game for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, Simple, and great to relax to after a hard day!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite part is honestly just decorating your house and yard. It's very cathartic and peaceful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in my recent gameplay i have used a machine to clone the same sim 8 times. they all live in the basement painting and generating income with no natural sunlight. they have minimal food and will be cloned again when one of them dies. instant money maker. love this game <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my 2nd most played game on steam, i really recommend it for people with lots of creativity, and or enjoy life simulation games, even if not anywhere close to the sims (Ex: my most played game, Spore)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cant complain too much as this one is free, but its still an ea game lets be real here ;P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For when you need to put your enemies through a tough life or you just wanna play god for a bit, truly a game for everyone, evil or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the game is good, I enjoy it for short periods of time but I think if you play just base game there's very little you can do but all of them are really expensive (even with the sales)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the interactions between sims and pets. The horses pack is great for playing western families.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are a lot of games I love, but The Sims 4 is the one I always end up coming back to. No matter how long I’ve been away, it’s always waiting for me with that same comforting feeling.\n\nWhat I love most is how easy it is to slip into my own little world. Some days I’m building a tiny cottage surrounded by flowers, other days I’m giving my Sims chaotic life choices and watching the drama unfold. It’s the kind of game that fits whatever mood you’re in.\n\nIt’s not a flawless game, but it’s a cozy one. And honestly? That matters more to me.\nIf you’re looking for a warm, endlessly replayable comfort game, The Sims 4 is exactly that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun at first but its kind of a pay to win because you get bored as the longer you play but overall i recommend tho. Its like life but in game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game that lets you design and create all kinds of buildings while also allowing you to play god with a bunch of sims giving them free will to do as they please or tell them what to do and live a life you want from doctor to criminal to raising a family to living alone away from people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Sims™ 4 continues the franchise’s legacy as one of the most entertaining and creative life-simulation sandboxes out there. Whether you enjoy building dream homes, micromanaging daily routines, or creating over-the-top stories filled with chaos, the game gives you plenty of freedom to play your way.\n\nWhat The Sims™ 4 Does Well:\n\nPowerful Build/Buy Mode: Building houses is incredibly intuitive thanks to flexible tools, room templates, and a massive variety of design elements. Even beginners can create impressive homes quickly.\n\nCreate-a-Sim (CAS): The character creator is detailed and easy to use. You can sculpt facial features, pick from many outfits, and give Sims unique personalities and aspirations.\n\nPlayer Creativity: The game shines most as a creativity engine. You can tell stories, recreate real-life people, or make absurd scenarios—whatever fits your style.\n\nModding Community: An active modding scene adds tons of content, gameplay features, and visual improvements that keep the experience fresh.\n\nWhere It Falls Short:\n\nBase Game Feels Light: Without DLC, the gameplay loop can start to feel repetitive. Many features fans expect (e.g., deeper personalities or expanded activities) require expansion packs.\n\nPerformance & Bugs: While improved over time, occasional bugs and odd Sim behaviors still appear.\n\nExpensive DLC Model: The sheer amount of paid add-ons can be overwhelming and pricey.\n\nConclusion:\nThe Sims™ 4 is a fun, flexible sandbox perfect for creativity, storytelling, and casual gameplay. While the base game has limitations, especially without add-ons, it still offers countless hours of entertainment—especially for fans of life sims and open-ended play. If you enjoy building or crafting character-driven stories, this game is absolutely worth trying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is not without its flaws. The biggest drawback is the lack of an open world. Moving between any two lots (including from home to a neighbor's house or the gym) requires a loading screen. This breaks the immersion and makes the worlds feel small and segmented.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The amount of mods I have is gonna kill my computer eventually.\nYou gotta love the community, I love building in Sims and with the mods I spend 90% of the playtime just making sims and living in my own fantasy world.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Finally uninstalled recently. Going private really was the final nail in the coffin. \n\nI loved playing Sims enough that I ignored the bad parts but I can't anymore. The game is incredibly buggy despite near constant updates and patches. DLC is prohibitively expensive for not enough content. Installing DLC has a good chance of breaking your game.\n\nMods are needed to make the game fun and at times are even needed to make the game playable. \n\nIncredibly disappointed that I've spent so much time in a game that couldn't care less if I had a good experience.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "Almost $1,200 USD to be able to play the game like it was meant to be played. EA deserves to go bankrupt.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Been my favourite game for years, have put up with their BS piecemeal market strategy, spent somewhere in the region of 700GBP on kits and expansions over the last decade- but as soon as the buyout to the Saudi government and the Trump family goes through I'm switching to Paralives, who have recently promised that ALL future updates and expansions will be free. This game is not worth going to hell for.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "it's insane how a company just gets allowed to release overpriced after overpriced dlc with no innovation, while constantly ignoring the people whose cultures they are stealing to make content from. you cannot convince me that they did not have the west african dlc already planned knowing the backlash they would receive. if you wanna play this use third party to unlock dlc's because it's not worth any of your money, they do not care about you",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The developer didn't even bother to set up Steam Cloud, which is super easy to do, but hey - it's another AAA studio that doesn't care about the people.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Works terribly and is an absolute scam for me as someone who played console as a teen and has now upgraded to a PC and has no path of recourse for transferring the hundreds of dollars of DLC that I accumulated over a decade since this game came out to my new preferred platform. When you ask your player base to pay $1,000+ for access to all game features, it sure would be the decent thing to do to just make all this stuff cross-platform.\n\n But alas, gotta pinch those pennies as a multi-million dollar corpo, right? Explains why EA has such a great reputation right now!\n\n p.s...!\n free the Alice Madness Returns IP. Greedy leeches...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The EA app is absolute fucking trash. EA if you want to harvest my data at least make a launcher that fucking works",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I genuinely love playing The Sims 4. The core gameplay is solid, the building tools are fantastic.\n\nBut. The base game is an empty, soulless husk. It's a beautifully decorated box with nothing inside. You have to spend literally HUNDREDS of dollars on DLC just to get the features that were standard in previous games. Want seasons? That'll be $40. Want pets? Another $40. Want your sims to not have the personality of a wet napkin? You'll need at least two Gameplay Packs and a Stuff Pack for that.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "cool and all but EA sucks ass, keeps popping out expensive half-assed expansion packs that break your game further (even without mods), basically force us to learn code just to play their dried up shriveling money-cow of a game. \r\nI would not recommend this game to any console player as the mods are the only thing that keep it running, the community is amazing and extremely talented, but its frustrating when the CEOs basically give us the broken game to fix for free. \r\nThank God Paralives is coming out.\r\n(I have 400+ hours on the EA app, which might make this a bit hypocritical since im complaining but keep playing it, but oh well)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overcharging packs for a broken game. Each update gives the chance that you won't be able to play what you pay for. Money-grabbing scheme with no care for players or quality.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you are willing to look up mechanics, cheat codes and deal with many mostly minor but aggravating glitches, then this game will be a lot of fun! You can build with detail and create your own story. Plus there are interesting challenges out there. I think most people will struggle with the glitches and having to look up all the different codes and keyboard tricks to get the game to do what you actually want though.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has SUCH potential...if only it wasn't made by EA.\n\nNo way should basic game mechanics be dlc...and no way should all the dlc be more than 1 grand are we ffr.......\n\nSuch a waste of a perfectly good game. \n\nFuck EA",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "my favorite game and a game i cannot reccommend. EA has gotten so greedy, if you want the entirety of this game you need to spend over one thousand dollars. its buggy, its my childhood, and its a game i struggle to let go of. i have spent thousands of hours on this game (iirc>2000 on the ea app) and i dont regret it but its heartbreaking to see how every bit of this game is for money. especially with EA being sold i can only see that growing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In the year of our lord 2025 this game lacks basic gaming shit like an autosave. The base game misses out on basic needs like weather. all the expansion packs cost as much as a game in of itself which is obv not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "good game, played a bunch on other platforms.\n\ndon't recommend because greedy ahh company charged us for this game on every platform then randomly made it free and left everyone out to dry, like c'mon, these non-sales prices on DLC are absolutely WILD for what they actually add\n\ncommon EA L",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game has been broken for 10+ years. With every new pack comes new bugs. Embarrassing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game kinda \r\nEA is a bad company and only goal is to milk this game till dumb a** people stop buying the trap that is dlc.\r\nAny good dev team making a game makes the \"dlc\" an update but hey what do I know :/ I'm not a dev \r\nand I'm only making this to review bomb it to make myself feel better. I bought the game that's the real issue of steam right now making games that people paid hard cash for into free to play hells. But F*** EA",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every pack is not worth the price. There is relatively no gameplay without the packs. Every feature in the game has some sort of bug related to it. The game is always shutting down for some random reason at least once a week. Don't waste your time and energy on a game that isn't even fun unless you download a million mods and spend $2,000 on packs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This hurts my heart to write considering I’ve grown up with the sims, but with the recent buyout I can’t say I recommend this to anyone. I’m personally not going to buy any more DLC or financially support the company in any way since the company who bought the out will probably not support how diverse the game is. I love this game but the buyout is a major turnoff for me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sometimes it launches, sometimes it doesn't. The EA client that launches from steam has a separate play button, but it is disabled when the game is launched through steam. After all these years, this game is still buggy and expensive. EA is a terrible company that prioritizes profit over quality every time. I will NEVER buy another product from them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game honestly so shit unless you want to spend $100+ for the game packs. The base game is so \r\n boring and basic, its better just to get the older games. Or sail the seven seas for the packs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a cash grab, it's unplayable without DLCs and mods. No Sims 5 is crazy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The dlc is absurd I can't believe this game convinced a bunch of teenage girls to spend like 50 dollars on digital pieces of furniture",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "unfortunately this game is actually fun so i can't write it off as 100% awful but if you want to start playing the sims you should probably play a past entry instead. the amount of dlc is ridculous and while i dont have any, i've heard they aren't really worth the price, either. it updates very frequently which might sound like a good thing but this actually means that every month or so there's a new gamebreaking bug to fix, especially if you have mods or dlc. and of course the previous titles don't really get updates so this isn't an issue. Do Not Get This Game.\n\nalso i know i might have low hours right now but trust me i have at least 300 in this game, it's just that's only stored on the EA app and not steam because i only recently redownloaded it on steam",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whats the point of this game anymore in 2025 the updates once a month or whatever to fix bugs just keep creating more problems with packs that cost too much and the mods and such keep conflicting and getting the free version of packs only works if you didn't update it overall its too much of a problem to keep having to send so many hours fixing and reconstructing saves that don't work anymore and waiting for the mod creators to fix their projects before the next update is a game that's draining to play because you only get a few weeks to play before having to mend your files and if the other games were free like this with mods i would switch but nope so back to scarlet's list and another 2 days of testing gameplay",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could (foolishly) ignore the sheer greed of EA in their money-grabbing DLC's that should have been base game. I did ignore it. Even bought some DLC's myself.\r\nWhat I cannot ignore is the rejection of everything the Sims community stands for. Inclusion, representation, community. In choosing to align themselves with not only anti-queer organisations, but also engaging in the use of AI, The Sims franchise has become nothing more than a soulless cash grab. Entirely not worth suffering through countless bugs, broken saves, DLC that just does not work, and a base game that lacks any substance thus requiring DLC's to be playable. \r\nIf you want to watch your Sim stare at their phone 24/7 and let their toddler starve to death, or not go to the toilet until they pee their pants because they won't stop autonomously using a computer, or just outright refuse to do anything at all... Have fun. But EA have made it clear they don't care for the LGBTQIA+ community, nor do they care for the rights of artists, writers, humans as a whole, or the environment, in utilising AI.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was a souless cashgrab before the buyout but the new owners being a dicatoriral goverment and a bunch of nazis is the final nail in the coffin for the sims being worthile. Play it is good fun but dont pay a single cent for anything in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To develop a game and make the owning ALL DLCs over $1000 is insane especially since:\r\nA) Base game is very buggy even though the game is from 2017.\r\nB) Most DLC features of the Sims 4 are part of the base game of the Sims 3 and 2.\r\nC) Most of the DLC is bugged and or can risk your file saves. \r\nThis is not as though EA does not have the resources to fix the game, but shows as a gross example of the company prioritizing profit over quality.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sims 3 had a DLC collection worth ~400 USD. Sims 4 has a collection of DLC work ~1600 USD. The game does not have anywhere near 4x the value and replayabilty than Sims 3. The Sims series is moving in a very unfortunate and poor direction overall in my opinion. Even Sims 2 was handled better than this.\n\nSims 4 with its core game design strips away several features that were included for free in Sims 3, as well as breaks a lot of the immersion they had introduced with Sims 3. In Sims 4, instead of being able to explore an entire town, you're sent back to loading screens and never-ending popups to decide where you want your character to go, and with who. Not to mention they had the community vote on which bugs to fix, rather than just fix them all?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A buggy mess where my only entertainment arises from fan creations like mods, builds, or fan-made challenges. The Sims 4 has no real challenge, it crashes like hell on my high spec gaming laptop, EA itself is really scummy, and WHY ARE THERE SO MANY PACKS OH MY GOD! Just make a Sims 5....or better yet, if the Sims wasn't basically our only Life Sim option aside from an AI riddled early access for InZoi, I guarantee this shady mess wouldn't be as popular as it is now. \n\nOverall, the game and company sucks, but the community is gold so there's still fun to be had thanks to them. Modders save lives, Nintendo could learn a thing or two.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Takes 2 and a half years to get this game to load up, IF it loads up. Nearly unplayable. Otherwise its fun, when it loads....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ISTG I am never touching an EA game ever again IN MY ENTIRE LIFE!!!\r\nBasically 1 hour of troubleshooting their HORRENDOUS launcher and game interface!!!  \r\nGame won't load after the december 2nd, 2025 update. The shop is the only thing that works proprely.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The building is garbage. Roofs glitch through walls into your house. The camera flies around the screen while you're trying to do things. What determines an open or closed room makes no sense whatsoever. These are only things I know how to describe. It doesn't come close to the amount of garbage you have to deal with to build a house. It's not like I'm doing super complex things to my build either. It's very simple things that make the structures not work properly anymore. The fact this game has been out for so long and these things are still a problem leaves me with 0 hope of enjoying building in this game. Especially when considering they aren't going to make a Sims 5. Which leads me to another point. One that I have seen multiple people complaining about. The expansions packs and whatnot are ridiculously high priced for what you're getting out of them. Especially when you're buying them in a game with so many issues. I wouldn't recommend anyone download this game unless you're prepared to deal with the stress and anger that comes with it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "please do not spend a cent on this game!! EA is considering being sold to buyers who will completely ruin everything good about this game. boycott while it will actually still make a difference!!! use mods, or just play base game!! the DLC is way too expensive to be worth it anyway!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The most realistic simulation element of The Sims 4 is its depiction of consumerism. Yes, all aspects of life should be transformed into marketable aesthetics and sold in bite-sized packages. I agree. Let's go to chain store Hot Topic and purchase counterculture clothing. Playing The Sims 4 is like playing with your dolls and making them act out playing with dolls. Also, each room of the dollhouse you're playing with costs money to unlock. And so do the four seasons.\r\nThe Sims 4's monetization is a self-perpetuating exploitation machine built on the same group of people. No one is going to get into The Sims 4 this year, look at all the DLC and rub their hands together and go: \"I'll just work my way through this DLC bottom to top!\", the only people still buying anything are the people who are already in this deep. \r\nTo be clear: I love the idea of The Sims. The games are even fun to play. But there are few corporate cabals crueler and more driven by investors than EA. For the good of your own state of being, I can not recommend spending a penny on DLC for this game. If the consumer truly has any power with their purchases, then things like this are only allowed to happen because people keep buying into it. Reject bad consumer practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The base game is fun but the expansion and game packs cost too much money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no no no! RUN AWAY from EA!!! Owned bout 600 dollars worth of games (including most sims expansion)  until EA bought Origin and I lost EVERYTHING years ago. Congrats EA, you really are a piece of work and you have successfully screwed me among countless others. Give yourself a pat on the back and have a beer with the money you stole. Looking at reviews for the returning Sims game, sounds like EA still can't manage to get their games working properly and will prolly just sell their company again, thieving hundreds of dollars from people like me and making sure you have no games to play. \nBut don't worry, they will HAPPILY allow you to buy it again and again and again...\n\nFor the paying customers, please stop burning your hard earned money for these ravenous companies whos main purpose is to offer bare minimum while shoving sales, popups and supposed \"expansions\" down your throat. Lets bring reliable CDs back which offer fully operational, gimmick free games without the need to relinquish your personal information or even connect online. I would actually buy every sims 1,2 and 3 ALL OVER AGAIN (including expansions) when I can install AND play without the internet interference. I don't care if it is even a \"one time connection\" bs. Utterly unnecessary. RIP sims. Hang in there true gamers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, so greedy. Y'all made Anadius retire, you went private, release kits NO ONE asked for for prices that intelligent beings wouldn't be paying for. You have bigger issues to solve, people to listen to, and you still prioritise your EXCESSIVE profits over the player's experience. No matter what you do, this game is still broken. This game would be nothing if it weren't for the modding community, and somehow you managed to mess that up too. I hope one day people can finally see you for what you are and stop giving you this money you lust so much for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sims 4 will always be one of my comfort games but it needs way too many packs and mods to be playable in the long-term.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong. The Sims is the only dollhouse game worth a damn. Played them on and off since 2000. \nGreat fun in build/buy mode. Always enjoyably frustrating in play mode, provided I cheated for a little moar initial money and made it so they don't age to infirmity within 15mins of starting. \n\nI like the Sims. This is a good one. Runs better than 3 ever did, which is nice.\n\nI'm just not looking forward to a bunch of journalist-murdering wahhabist bigots with infinitely more money than shame or brains, retroactively wringing-out all the fun gay stuff that we've been able to enjoy since The Sims 2. Hell, they'll probably even go back and remove the funny cartoon \"booooing\" when you tried get 2 dudes to kiss in The Sims 1. Just to be thorough.\n\nWhat's next? A Sim City game, where you're only capable of constructing geometric eyesores in a long straight line, serviced by a fleet of poo trucks?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has incredible potential, but just that. The Sims 4 would be nothing without modders, and I think it's lazy how much the base game sucks, considering it has had half a decade to become something better. The packs are disgustingly overpriced, and the creators just don't care about this game anymore. It's such a shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've played more on my old ps4 before getting a pc.\r\n\r\nAnd even now, I cant stand the game WITHOUT mods. And now most dont want to work despite being installed correctly. So take that how you will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "money hungry devs and toxic hyper woke community like what am i supposed to say here its a nice game just overpriced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game but you have to pay for literally everything to make the game more fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have been a loyal sims player since 2015. Sadly, EA has traded in any care and love that the fanbase has had for the game for profit. Packs are broken and remain buggy. I'm bombarded with adds for buggy packs that cost $40 each every time I open the platform. I wish that they would care more about fixing the issues with the game than trying to create new features that also do not work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game requires an external launcher and forces the player to create an additional account on another portal - for me this is automatically a negative review.\n\nThe price of this game with all the DLC is terrible. I love The Sims, but I'd rather go back to the older instalments.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate this game so much but its also really funny and i cant stop playing it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "400+ hours on record and I can safely say a good chunk of it was just waiting for things to load or getting a sim to do something other than stand around and ignore their queue. Most of the enjoyable parts came from nostalgia, mods and custom content made by other players. Maybe the buggy crazy sims experience was charming once upon a time but it simply isn't today. Free to play but pay to get a buggy DLC that might break other mechanics in the game. Not to mention most devices can barely run it without feeling like it's being played on a 15 year old laptop, which is what I used to play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything getting into smaller packs to sell more is urgh! And sims 3 mechanics on building was better. Idk if its just me but it became needlessly complicated :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "optimisation sucks for a game that was originally released in 2014",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk why would u play this over the older sims games but if u STILL WANTS TO PLAY TS4 FOR SOME REASON, u should crack all the dlc instead of spending almost $1000 on it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It forces you to use the EA App to play it, which rarely works half the time. It's disgusting, especially considering the expansions cost as much as a whole new game. Put your money towards the new game instead, you're more likely to get something playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i pressed play and EA was loading the game but then after that it said, \"An error on our and caused to not load the game\" I dont know maybe its because i downloaded alot of cas mods.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent and hour building a house, then accidentally clicked C or V on my keyboard. Which crashed my game for some reason, and my house didn't save.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Actually fuck you ea for selling the sims to awful people, you were already greedy as shit but you wanted to sink to new lows, the game itself is fine if not kinda boring without mods",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just playing this game gives me a feeling of dread and despair for whatever reason... it's probably better if you spend a fortune on all the DLCs? That or spending some time heavilly modding the game >.<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very laggy, bad unless have dlc, dlc is expensive, also ea sucks rn",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can be VERY BUGGY at times. sometimes updates will even break your game to the point where its unplayable (cmon ea you can playtest these things). also, the game just feels very lackluster, and when i used to play this game a lot, i often found myself bored. the expansions don't bring much excitement either--in fact, they make the game even more buggy. there's also way too many expansions. this may not seem like a bad thing at first until you realize that it's ea and the expansions are for the money...go play the other 3 sims games instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed this game very much, but for months now my game has been broken and I have found no way to fix it. I can use CAS just fine, but once I select a home for my household and try to begin the game, I receive an error message. Additionally, if I enter build mode through an already created household, I cannot save my work. I have tried reinstalling twice, and I have tried removing and reinstalling my mods as well. Nothing seems to work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not much to do unless you take the time to install so many mods and very greedy devs packs are way to expensive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Borderline unplayable sometimes right now, even without mods or DLC installed. It's so buggy and prone to soft locks, its amazing that this game comes with 30 dollar add-on content that only makes it even more buggy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its works sometimes, and when it does its really fun. However there's always something that eventually makes it crash and then you cant play for a month or two. Worst sims. I switched from EA to steam to fix this issue, and now it crashes on steam too. I don't even download mods anymore i'm too scared it'll never launch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after i reinstalled the sims, the mods werent working, (i use curseforge) so i deleted all mods and the game to restart it. and when i redownloaded it to play, it said EC:10500. I really hope to fix this issue but for now ill just stop playing until this problem gets fixed, and worst part is, i dont even know whats wrong.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate it when companies want you to install their useless launchers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just make the sims 5 with preferably NOT 100's of dlcs that cost thousands of dollars to get them all.\n\nwould be nice to move on from 4, this game is 11 years old.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has such little content and has so many glitches unless you wanna buy 2-3k in dlc, most of which I think should've been base game. Not a lot of customization options and you can't really make lifelike sims gameplay and personality -wise without that dlc. Not to mention a lack of options for base game in general. It just feels unfinished for a game that's been out for so long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but by far the most horrendous DLC policy I’ve seen yet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game fails to close properly resulting in having to entirely reboot steam. Been an issue for years, and still not fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't play normally, during the game, the game just turn off and doesn't save play progress. I waisted 3 hours for nothing!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it sucks but im addicted so i cant really stop . do not get this game if you value your wallet and time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Sims is The Sims, but The Sims 4 is literally a piece of trash, unplayable after character creation and house building. The NPCs are too kind and flat. Even if your characters get into a fight with an NPC, it won't affect the gameplay at all. DLCs are expensive, yes, but that's not the main problem with The Sims 4. The Sims 2 and 3 were fun to play without mods or expansions, but if you launch The Sims 4 without installing mods first, you'll get a boring, empty piece of crap. The character customization is also terrible. All those personality traits are incredibly strange, and I don't notice them changing my character's personality in any way. I remember the character customization in The Sims 2 and am amazed at how they could ruin such a wonderful game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really disappointed in the Sims 4 becoming the continuing flagship of the franchise. I really appreciated getting new game versions and it's not exciting to be stuck in the 4th iteration. I started playing the sims with The Sims 1 and moving to The Sims 2 and The Sims 3 was always exciting. Stagnating with The Sims 4 does not bring me joy. I have really appreciated what it's brought to the series with greater representation, but it's greatly limited by how old the game has become. Additionally so, I'm upset with the EA sale and thus my previously favorite game is no longer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know how I got 25 hours on this game, maybe I was afk. As expected, full of microtransactions and just terrible graphics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i downloaded a bunch of mods and everything worked fine until it forced me to update the game and now nothing works and im not sitting there redownloading everything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's fun if you don't care, but it's suck when you wants more along with seasonal errors",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't know why, but i can't play at all, all the game does is give me an error 22 message in the corner when i try to play a character, or crash to desktop when i try to make a new character. i don't have any mods on this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so many bug even you build and selling some item moving item cant move. when you play cant play, need to exit and  start or load again so tired to uninstalled and installed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Sims 4 always ends up leaving me unsatisfied every time I try to get into it. The gameplay isn't deep enough to stay engaging, and there are too many frustration points for this supposedly cozy game to actually feel cozy. But the biggest problem comes from the DLCs, which are obscenely overpriced and notorious for containing features that feel like they should be in the base game. It feels predatory, which, again, is [i]not[/i] a great vibe for a cozy game.\n\nYou might get more out of it if your main interest is building cool houses or designing custom characters. Both build-mode and create-a-sim are pretty robust, especially with mods.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It really saddens me how much extra money you have to spend on this game to make it what you want. In my opinion if you need mods to keep a game interesting, its not really worth playing anymore. ):",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "until i can use ALL the packages, add ons and expansions thru either EA or Steam, i doubt i will continue playing, much less recommending. and i will not be getting any more extras until this is fixed. Any thing you have to pay to use should be available on both platforms no matter what. We paid for it, so give us back its use. Thank you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the whole EA sale drama, I have uninstalled the sims for the first time in over 15 years that I have been consistently playing the game and buying content. Massive disappointment but its 2025, companies should be responsable for their actions and the sims hasnt done anything exciting in probably 10 years. Hopefully something better will come along and take the place of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Although its now free, I wouldn't recommend. I bought it a few years ago and it still has tons of bugs and glitches that just have been totally ignored- of course they release newer updates but they can't even fix old problems.\nThe cost for anything on the game is so expensive like I could literally buy a few video games for the price of one expansion pack. \nUse your money elsewhere, its not worth it here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was good until this massive update. now, whether or not autonomy is enabled, my sim only moves if i direct him. Very tedious",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It would't let me launch the game, i tried multiple ways to fix it and then when i clicked on the game again it worked but all my things were gone, i tried adding them back with what i had in my saves folder and then i tried launching the game again and it would't launch again so i just deleted everything and uninstalled the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Packs and other things are way to buggy, they very obviously don't care about the game, there's no actual game play that makes you feel actually interested, i've only ever made sims and houses with huge amounts of mods because the base game is so boring. unless they actually fix the game don't bother unless you just want to make sims, plus they're making you pay for things that should just be in the game, its too money grabby and just shows people that you don't care about making a good game u just care about making money, plussss i don't want to support the people they're selling to so best believe i will not be playing any ea games if that does happen. i cant wait for paralives highly recommend that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Okay. First of all: I love sims. I always have. Secondly, on my EA account, I have several thousands of hours of gameplay, if I ever figure out how to embed images I can provide the screenshots to prove that. I play on Steam now because I recently switched over to Linux on my new PC and EA and Linux are like oil and water. So when I tell you to that I do not recommend Sims 4, [i]I mean it.[/i]\r\n\r\nIt has very little to do with the actual game itself, but as to what I will say with to that end, Sims 4 is borderline unplayable without mods. They advertise packs to you with a [i]shopping cart icon[/i] right next to your Live Mode, Build/Buy, and Manage Worlds icons. The main menu has adverts for their newsletter. As to the actual game itself, it is extremely buggy. I will give them this much, they are trying to fix that in some of the newest updates. But there is still so much more that needs to be fixed before you'll hear me stop complaining about the bugs. Much of what I've mentioned here, however, can be patched with mods, assuming you play on PC.\r\n\r\nMy main problem is not with the game itself, but rather, the company that makes it. You may say that most if not all major game dev companies have their problems, and to that I will tell you that I agree. EA is one of the worse ones, is what I will follow up that agreement with. The game and all its DLC costs, last I checked, over [i]1k.[/i] If you don't find that insane, I don't know what to tell you. The most recent buyout is one of my main reasons for posting this review, as well. I don't like what it might mean for the future of not just Sims 4, but the franchise as a whole.\r\n\r\nDon't get me wrong. I love Sims. I've been playing it since I was 12 years old. But I can't recommend it with the state of EA as it is now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Forcing to launch via the EA app and forcing an account after it's already installed via Steam. This is the kind of crap the gets me to go pirate the entire series rather than pay for DLC. Can't stand it when games have their own individual launchers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just cause you may enjoy this game doesn't mean I can recommend it in good faith with the sheer amount of DLC.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "With just how many hours i played this god damn atrocity of a game trust me i know its flaws. and yes i did play it a looot, but its not like cause its good, it just has like.. zero alternatives? Like really, what else is there for me to play, horrible looking old simses that are probably just as bad, or that buggy still in the oven inzoi that only came out not so long ago? Yeah, unfortunately, for now at least, this game has practically no competition. just let me vent, aight? i just wanna build okay? the life mode is super boring but whatever just let me build my pretty little houses and stuff, but no.. i wouldn't even be able to explain just how bad even the build mode is in this review, just for the love of god don't play this game and wait til inzoi or some other alternative gets going or something, really. don't let yourself get on the hook like i did, PLEASE!! >.< but yeah i like building and if you do too then unfortunately, again, there are no alternatives for now. thank god i at least didnt pay for it like many people did before it became free..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I spend more time trying to get the game to work than playing it. Don't download it, you will find yourself going through videos and Reddit posts for a week only to abandon it and when you come back to the game after a year it will magically work. \r\n\r\nThe cycle repeats.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to love this game. I watched tons of Sims 4 content hoping to play it one day. It was one of the reasons I saved for a PC. However, I do not agree with many of the actions of both EA and the Sims team. I have found it very difficult to continue playing this game due to the new ownership of EA. Their values conflict with a majority of players, including myself. The Sims 4 has been a comforting and inclusive community, but I don't believe it will stay that way. I also fear that AI may be used, especially to cut costs. \r\nWhile the new owners of EA are my main reason to stop supporting the game, I do have complaints with some changes the Sims 4 team has made. It seems like they are more focused on making money than the game and its community. Until these issues are resolved I won't be buying dlc and likely won't be playing the game either. I sincerely hope that the Sims 4 gets better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "money hungry game, kinda sucks, laggy. ignore my hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Isn't it so cool to make you pay like a thousand dollars to get all the content that's crazy\r\n\r\nalso why did they make it free",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BUGGY FUCKING GAME, LEARN TO CODE AND FIRE THE RETARDS, THIS IS WHY YOUR BEING BOUGHT OUT BY THE MIDDLE EAST RIP BOZO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh, I just couldn't get into it. And over $1500 worth of DLC just to experience everything? And have to have an external EA account that wants to run in the background? No thanks, I'll stick to playing Sims 3 on console whenever I wanna play The Sims. On the plus side, the amount of character customization is insane.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The pay to play nonsense has gone to far seriously eat a bag of dicks!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The franchise was sold to Saudi Arabia. Any purchase actively supports violence against queer people and women.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "buggy, doesnt work, soulless, evil corp. yawn",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "after making new creation char can't move it to the homeworld household who is selected, always back to create new one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "RIP to all diversity content that we're about to lose. Shove it, saudi prince",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}