{
  "positive": [
    {
      "review": "Detroit: Become Human hit me way harder than I expected.\nNot because of the choices alone, but because of how human the entire journey feels. \nThe characters: Connor, Kara, Markus — each carry a completely different perspective, and together they create one of the strongest narrative experiences I’ve played in years. Im sorry i played this game so late, dont hate me! Better late than never i guess? :)\n\nThe writing shines most in the quiet moments:\nKara protecting a child that’s not hers.\nMarkus trying to lead a cause that feels impossible.\nConnor slowly learning what “choice” even means.\nEvery storyline feels meaningful, and every decision feels like something you’ll think about long after the credits roll.\n\nThe worldbuilding is incredibly immersive. The mix of cold futurism, social tension, and small everyday details makes Detroit feel uncomfortably real, like a future we could actually end up in. And the actors absolutely carry the game; the performances are genuinely outstanding.\n\nWhat I appreciate most is how the game respects your decisions. Nothing feels random, every choice branches into something that matters, even if the result is pain, loss, or a victory you barely earned. And yes, sometimes I stared at the flowchart like “…did I really just cause THAT?”\n\nThe soundtrack, visuals, and pacing all support the emotional weight of the story. It’s not just a game, it’s a reflection on empathy, freedom, and what makes a person a person.\n\nIn short:\nA beautiful, emotionally heavy, branching story with incredible characters.\nIn a powerful way — and definitely something I’ll remember for a long time.",
      "voted_up": true,
      "votes_helpful": 224
    },
    {
      "review": "[h3]If you are too lazy to play games and press buttons, then you can take a controller, a beer, lie down on the couch and play this game movie.",
      "voted_up": true,
      "votes_helpful": 257
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 86
    },
    {
      "review": "Detroit is well worth playing, but it struggles to strike the right balance between giving you freedom of choice and reminding you that it's all a game in the end. Cage and Quantic Dream are getting closer to nailing this style of game, but it's obvious that there's still room to grow.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "[h1]Great game, almost ruined by David Cage (another Quantic Dream Tuesday)[/h1]\n\n‘Detroit’ is infamous for going super viral upon its release and being claimed the most emotional and touching game ever made… And then a reputation like this actually backfired at it, as lots of people who analyzed the game deeper then claimed it to be really manipulative towards the player, pointed at the plot having more holes than a beehive, and at the overall naivety and blunt disrespect towards major Isaac Asimov ideas and concepts. [u]So now this poor game is going back and forth in a tug war between two parties: the first one screaming how it’s the best game ever made and if you disagree, you are a heartless piece of junk, and the second one claiming this is the dumbest game ever made[/u], and if you disagree, you are easy to manipulate and aren’t able to realize what lame stuff you’ve actually been served by David Cage. Well, whatever. But what about some good old nuances?\n\nI played this game on two different platforms, and my experience with it stayed the same. [u]I do believe this is one of the most naïve games when it comes to executing the concept of new bioethics, robotics, and futuristic realism. At parts, this game wants to be ‘Never Let Me Go’ from Kazuo Ishiguro, but ends up being Another Product from David Cage who loves his bingo card tropes way too much[/u]. That’s how we meet:\n\n⛔️1) Incredibly obtuse and dense plot moments that are forcing you to feel the way intended by Cage, or otherwise you’d be ‘experiencing Detroit not properly’. [u]They really are manipulative in a way that a player doesn’t get recognized as a smart creature capable of processing more nuanced and complex thoughts by the game[/u]. Cage really wants to put everything in your face, and sometimes characters literally instruct you how to feel ([i]Alice reveal and Luther’s words about it are really the worst part of the entire game, it was almost laughable[/i]). \n\n⛔️2) Markus’s plot ark is one of the worst ‘rebel arks’ I’ve seen, especially in the context of android rhetoric – plot-wise, script-wise and ideology wise, but so much deeper and better stuff had already been said about it by other people, I won’t be repeating much about it here. There’s a reason this is objectively the least liked part of the entire game for the majority of players, and some of its parts are so linear but also drag for so long, it gets insufferable during re-plays. \n\n⛔️3) David Cage’s ego made the overall game’s impact much cheaper due to his direct and damaging involvement in the script. [u]Thus the infamous DC bingo cards’ moments travelling into every single game of Quantic Dream (no literally, look them up, they are hilarious)[/u], Kara’s plot line, amazing in its concept but almost destroyed by some of the decisions taken later into the game’s production, and so much more.\n\n⛔️4) Also, my personal Roman Empire is about Detroit literally stealing 80% of setting and plot elements of ‘I, Robot’ movie but somehow getting away with it. Please watch this movie, it’s so silly, but it still adapted the major concepts of robotics and new life ethics so much better than this entire game… Also, David Cage clearly wanted to give Hank same exact motivation to hate the androids as Will Smith does, but they were forced to change it in a ridiculous way just to avoid plagiarism allegations, aaand now the Hank motif doesn’t even make any sense… \n\n[h3]Soo… All these harsh words spoken, why the blue review then you ask me?[/h3]\n\n✅Well, even given how much David Cage wanted to ruin this project, he still didn’t success fully – due to the talent of EVERYONE ELSE involved in it! This game is an amazing visual journey, all the technical aspects of it are stellar, and Detroit still looks amazing years after its release. [u]The amount of work live actors did during every take, every voice line recording and every action sequence filming, is astonishing. Seriously, watch the ‘Behind The Scenes’ clips of The Making of Detroit on YouTube, this is a blast[/u].\n  \n✅The way Connor and Hank duo is CARRYING this entire game, is not just a marketing gimmick but an actual truth I’m afraid. These two actors had an insane chemistry together, and to add to it, they also have the best script and the best gameplay sequences in the entire game. Despite me being salty on how this game uhm, got [i]inspired[/i] by ‘I, Robot’ plot for the writing of their ark, I still can’t ignore how funny, entertaining and engaging their story was. It is the best part of the game.\n\n✅The script. I mean, the actual gaming script with thousands of different choices, dozens of different endings, the way your decisions ACTUALLY matter in this game for once. This game has insane replayability value even if you find the plot laughable, because it’s just so entertaining to open all these different branches and endings. People who worked on a script for this game and adapted it for the gameplay, gave their all into this project, it’s just an insane amount of work too. \n\n✅Not to mention all the other small details that I found so pleasant about this game – great soundtrack produced by three different composers for each protagonist, amazing location’s design, all the little collectibles, art books, hidden models, bits of true genuineness and humanity hidden under piles of stupid caricature davidcagisms. \n\n[u]This is a great game with rather unfortunate plot choices and development changes, which I still recommend you to play at least once just for the amazing GAMING experience[/u]. When it goes on sale, it’s definitely worth its money.",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "I finished Detroit: Become Human and ended up getting every single achievement, and honestly, the game was worth it from start to finish.\n\nI didn’t plan on going for 100%, but the choices hit so hard that I kept replaying chapters just to see how different things could turn out. And they really do change — not just on paper, but emotionally.\n\nWhat surprised me the most is how much the ending sticks with you.\nDoesn’t matter if you got a positive ending or something much darker — you still sit there for a moment trying to process everything. Detroit has this rare ability to make even a “good” finale feel heavy, and a “bad” one hits even harder.\n\nConnor’s storyline grabbed me the most — it genuinely feels like your decisions shape who he becomes. Markus and Kara also have strong arcs with their own emotional punches, but Connor’s path stood out for me.\n\nGetting all the achievements only made me appreciate how much thought was put into every branch and small choice.\n\nIf you like story-driven games where your decisions actually matter — Detroit: Become Human is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "I love the world this game portrays, i find it ironic how human the characters feel when we play even if they aren't supposed to be in the first place, which is then again most likely the whole point of the story.\nalso, contrary to some choice-based games the decisions you go for actually make a big difference in the story which got nerve-wracking at times but it was fun to actually think about what to pick",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Amazing game 10 out of 10. I played it on steam deck and it ran really good. I’m not a person who usually likes to go back and replay games, but the story was so good and there’s so many different branches based on your decisions. I’m currently on my third play through.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Detroit: Become Human is gripping from start to finish. The story is intense, the characters feel real, and every choice hits hard.\nIt’s emotional, thrilling, and an unforgettable experience — truly a masterpiece.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game hits hard. I am more than sure that it's predicting our future, the entire environment was built upon realistic changes that would happen to our world. AI will get better and we will depend on it, which only means the robots will have more humanity than us, a strong message I got from this experience. It's worth every buck, the actions you take heavily impact the story and ending (so prepare yourself for that) making me stress out whenever I was put in a situation to pick a choice. There are also times I laughed, getting attached to the three main characters that we play as. If you're a story based game enjoyer like me, this game is a perfect choice and will totally get you hooked.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Every decision shapes the story of your own, Dont play smart, put yourself into the character and take the decisions it will make you more enjoying while playing. very good one.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Detroit: Become Human is not just a game – it’s an experience.\nQuantic Dream created a powerful interactive story where every decision truly matters and where the player is constantly faced with one big question: \"What does it mean to be human?\"\n\nThe game follows three main characters – Connor, Markus, and Kara – each offering a different perspective on a world where androids begin to gain their own thoughts, emotions, and desires. It’s fascinating to watch their stories unfold and see how even a small choice can snowball into major consequences.\n\nAnd that’s the beauty of Detroit: Become Human – you control their fate. There is no single “correct” path. Instead, there are dozens of endings ranging from victory and hope to sacrifice, tragedy, or quiet defeat caused by just one wrong decision.\n\nThe graphics and motion capture are stunning – Detroit feels alive, believable, and deeply atmospheric. The emotional expressions on characters’ faces are some of the best in gaming, and the soundtrack enhances every scene perfectly, from high tension to heartbreak.\n\nEach protagonist is memorable:\n- Connor deals with the struggle between cold professionalism and growing humanity,\n- Kara delivers a touching personal story of care and protection,\n- Markus represents the bigger picture – the fight for identity and freedom.\n\nDetroit: Become Human is the kind of game that stays with you long after the credits roll. It makes you think, doubt yourself, feel, lose, win – and most importantly, it makes you want to play again, because there is always another path, another ending, another possibility.\n\nFor me – an emotional and unforgettable story-driven masterpiece that anyone who loves strong narrative games, meaningful choices, and deep characters should experience.\nRating - 10/10⭐\nA journey that redefines what “player impact” truly means.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely loved it. Every choice felt impactful, and the storytelling pulled me right into a cinematic universe. Stunning visuals, emotional depth, and replay value that kept me hooked.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It shows 11 hours, and it was one playthrought with couple retries. \r\n\r\nTo some extent it is a game, but realisticly I would rather call it narrative gameplay, were your choices shape the world around you. \r\n\r\nStory is rich, most importantly open, where what you do matters, and you get to see consequences of your actions in both short time period, but also much later. \r\n\r\nMultiple characters to control, multiple perspectives to experience the story. They are all connected, but at the same time certain characters stand on different sides, and have opposite goals, and missions to achieve. \r\n\r\nGame with so many variables will easily last for multiple playthroughs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the game I not enjoyed but I loved. This is the game I was looking for. I strongly recommend everyone to play this art.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is more than just a game, it is absolute cinema. It should be mandatory to play through this game once in your life considering recent times.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "10/10 story where you decide the fate of your characters. Kudos to the devs and the whole team which made this game ... amazing experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I will be talking about this game for the next year or so; nonstop. \r\n\r\nThis was the first game I have played like this and its going to be hard to find a better game after this. \r\n100/10 would highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So far, this game has the best story, voice acting, facial expressions, and some of the best graphics of any modern game I have ever played. 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought in the sale as had heard good things about it. The way the story plays is very different to what I imagined but I really enjoyed it and the story is one of the best I've ever experienced, easily a 9.5 out of ten. Highly recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorite \"choice matters\" game I've ever played. Difficult decisions but very rewarding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a good game. A little suspence and sciencs fiction with good stories. ai am only 5 hours in and already liked it so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1 hrs into the game and i'm already in love.. this game is so special.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] YOU WILL LOVE THIS GAME [/h1]\nI absolutaly love this game, it's the best story game out there.\nThe graphics were ahead of it's time.\nI wish we could get a second one to it.\nI promise you,\n[b] YOU WILL LOVE THIS GAME [/b]\n\nYou will be happy, you will be angry, and you will cry.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is this the greatest narrative ever written? No. Is it still worth playing 7 years later? Sure. At the very least watch a couple videos on it if you don't want to play it yourself. Which I wouldn't blame you, because the \"gameplay\" in this video game really isn't there. (Unless you love button mashing) All in all, its a compelling story that does make you think... occasionally. 7.5/10. Buy it on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is my i keep saying \"thank you\" and \"please\" to chatgpt xD On the serious note the game is gorgeous. I've played it 100% maybe 3 times now. Graphics are amazing and you create bonds with the characters. Hank and Connor being the most father/son duo i've ever seen in video games <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a journey. Highly recommended. Great story and gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With the ascent of artificial intelligence, the world portrayed in Detroit is becoming increasingly palpable. More and more individuals find themselves imperiled, at risk of losing their occupations, and, by extension, their very sense of identity, to unfeeling machines. Contemplating whether this outcome is genuinely imminent feels essential if we wish to progress coherently as a society.\n\nThis is precisely where Detroit excels. The game interrogates the very nature of androids: whether they merit being regarded as living beings or whether they are merely intricate automatons and nothing more. It explores their potential impact on our civilization and on what we may eventually become.\n\nThe work guides you through a gameplay experience that is understated yet profoundly narrative-driven, urging you to forge your own judgement and perspective. It compels you to scrutinize your decisions, while its performances, staging, visuals, and music into a singular piece of artistry. Together, they invite us to discern what may await us in the future and what precautions we ought to adopt.\n\nI simply feel it is not merely a game you should play, rather an introspective examination of what we, as a society, are in the midst of creating.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played numerous story and action driven games, but none had me on edge like this game did. Detroit Become Human tells a compelling narrative on what it means to be human, tests your morality, and more. Every decision you make has a reaction. Will you remain true to yourself, or to the world? The decision is yours to make. Highly recommend for those looking to indulge in good story and take risks.\n\nTLDR:\nts game is peak js download it yo u wont regret it ong",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing game, great graphics, and the story is just perfect. every deciscion you make has some sort of impact on the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Solid game, for 2 nights good choice to spend free time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When I started playing this game I said to myself that it won’t be fun beacause of the mechanics (you pick between options), but after a couple of minutes I got instantly hooked. The next thing you know, you are brainstorming about each the options, which option is the best and what is the best possible outcome. The story is amazing and it will get you addicted to this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Wow, where to start. [/h1] This game is a masterpiece. I love the fact that you can just sit back, relax and enjoy the beautiful story of Detroit: Become Human without having to walk around endlessly like basically every other story game. The amount of paths you can take are just incomprehendable and you never know what decision might lead a character to their doom. [spoiler] The way the three characters cross paths at the end was amazing to me. [/spoiler] If you're looking for a phenomenal story with little to no \"walking around endlessly completing missions that lead up to the final story\"(i hate that) then pick up this game right away.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I can't stop thinking about this game. I can't stop thinking about Connor. I expected nothing and for the first time in ages I truly engaged with a story. If you're so clumsy as I am, playing in casual mode will still be a bit difficult.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Detroit: Become Human rearranged my brain chemistry 🤖 I started caring about androids more than real people, stressed over dialogue choices like they were taxes, and cried over robots with better acting careers than me. Stunning visuals, insane story, emotional damage included 💔 10/10 game, 0/10 emotional stability, would legally adopt Connor if I could.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9.5/10\nPros\n✅ Choices That Matter – Every decision, from dialogue to QTEs, reshapes the story. Save a life, lose a revolution. Flowcharts reveal infinite “what ifs.”\n✅ Living Interactions – Connor reconstructs crimes in 3D, Kara’s QTEs pulse with panic, Markus rallies crowds with real-time reactions.\n✅ Visual Masterpiece – Photorealistic faces, rain-drenched streets, motion-capture magic. Runs buttery smooth on PC.\n✅ Replay Heaven – 80+ endings, 20+ hours per run. Flowcharts beg you to try again. One of the game’s most innovative features is its flowchart mechanic, a post-chapter breakdown that maps every decision, branch, and outcome like a visual web of possibilities. It reveals what you unlocked and teases missed paths, encouraging replays to explore “what if” scenarios. This tool transforms passive play into active analysis, highlighting how small choices cascade into revolutions or tragedies—it’s a storyteller’s dream, adding layers of depth and replayability without spoiling surprises mid-game.\n\nCons.\n❌ QTE Overload – High-stakes sequences demand pixel-perfect timing. Miss a button in On the Run and watch Kara die in slow-mo—frustrating on repeat plays.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the story and the characters were amazing 9/10 Highly recommend this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game changed who I am today. The most beautiful story game oat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is the most beautiful thing to ever exist. it is truly, and i dont use this word lightly, A MASTERPIECE. i would sell my soul to own this game on my own account, everything about it is seriously PERFECTION. i love these little roboids with my entire soul! sorry for killing u alice and kara, rest in peace i didnt mean to  my wifi is just horrendously bad, GOD bless this game coming from a catholic - i did NOT write any of that btw LMFAOO, i let my friend remote control my pc cause shes apparently too broke for both the game and a decent computer, but that doesnt mean anything to me, i love both HER and THIS game so much, ever since i was a wee lad i LOVED this fucking game, i remember playing it when it first came out and genuinely being so amazed at the graphics, the story & everything, i DESPISE how shitty this games fanbase has gotten over time but david cage and his stories are just way too wonderful for me to ever hate the games itself over such a minuscule reason, ive replayed it a thousand times but uh, not on steam per say LMAOO, i bought this GORGEOUS game a few months ago even though ive already played it a thousand times like i said just to support the developers, i love quantic dream best company ever even tho ur french i love you guys so much, yes this review was written by two people!! i dont seem to own my OWN steam account anymore... okay thats all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Be forwarned, developers of this beautiful game! \nIf, by any chance something happens to the loveliest, toughest family in this game, I shall be left with not other option, but to personally employ 100 old wallachian gypsy-ladies to curse the sh*t out of everyone who didn't let them have at least 1 happy ending! \nThank you, and have a nice day !\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Every choice in this game feels like the universe quietly judging you. Do you lie to save a friend? Do you start a revolution? Do you pet the dog? (Yes. Always pet the dog. The dog is the only one who doesn’t betray you.)\r\nSomewhere along the way, I learned that free will isn’t the noble gift philosophers promised us — it’s a cosmic prank wrapped in moral dilemmas and quick-time events. Every decision feels right until it ruins four lives and a perfectly good android.\r\nAnd the androids? They don’t just dream of electric sheep. They dream of electric heartbreak, electric identity crises, and that one haunting moment when they accidentally called their owner “Dad.”\r\nBy the end, I wasn’t sure if I was playing a game or if the game was quietly performing a psychological evaluation on me. I actually succeeded twice in two different endings, felt the warmth of victory and then had to redo it all just to fail spectacularly, because apparently, enlightenment is worth less than a 100% achievement rating.\r\nEither way, I walked away morally compromised and weirdly proud. But hey, at least I pet the dog.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Holy moly, connor my beloved, I havent finished the game yet so please dont die. Graphics?! Story?! Choices?! QTE's?! everything is perfect, Absolute peak game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When I finished the game, I felt like it kept asking the player a question.\r\n\r\n“In the future, when our world advances enough to create AI robots that become an important part of our lives, will we see them as nothing more than tools, or as living beings with consciousness like humans?”\r\n\r\nWe may not find the answer to this question anytime soon, but one day, we may have to revisit it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I devoured and savored every second of it. It was like starring in a film...or creating a film while I decide in it...or having not 1, not 2, but 3 roles to lead while creating a wonderful story!!! Not your everyday game, an excellent idea from the developers, expertly made and had me in suspense, tension, thoughts and FEELINGS!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great story, very immersive and superb music. Very replayable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Become Human is beautifully designed — the immersion is incredible, and once you start, it’s almost impossible to stop. The world-building begins right from the title screen. There are countless choices leading to different fates, with three protagonists whose stories intertwine, and the motion capture is impressively detailed. I reached one of the endings, but completing every route and branch feels like a huge challenge.\nP.S. Connor is just too charming — smart, calm, yet slightly naive and lost in a way that’s hard not to love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I just finished my first playthrough and man I chose all the wrong ones... \r\n\r\ngood game though, I'll definitely replay this to get some more uhh desirable endings",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] Masterpiece [/h1]\n[u]10/10[/u]\nDetroit: Become Human is truly one of the best games I have ever played. It makes you forget about reality as you play, yet constantly reminds you of the dark future that is potentially ahead of us. With a thought provoking story, great writing, awesome cast and tough choices that can drastically change the outcome of your playthrough, you're in for a ride.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "absolutely my top 5 story games oat, the athmosphere in this game is just phenomanal, it basically just captures you in it, very well written characters that make you have empathy for them and what not, would absolutely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story! The writing is really good and i really like how they play with the mind of players! If you like games like witcher or rdr2 i would really recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal storytelling with so many branching storylines. Played it twice now with completely different endings and character motivations. Will definitely be played again in the future. If you like visual storytelling, you cannot go wrong here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best \"interactive movie\" game I've ever played, where every action has consequences. I enjoyed the story of all three characters, Marcus, Kara, and Connor. In my first playthrough, I recommend playing this game without restarting, using any guides or tips, and immersing yourself in Detroit.\r\nChoose who you want to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the \"flowchart\" system for choices and how it impacts the story. I look forward to completing a play through, and then going back to chapters to try other things. The graphics are immaculate too, just incredibly beautiful. The camera follow system and how camera orientation impacts character movement feels pretty clunky, but I'll get used to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Detroit: Become Human was an incredible experience for me. I enjoyed every second of it – the strong characters, the powerful moments, and the story that kept me hooked all the way through. The only thing that really bothered me is that during repeat playthroughs, you can’t skip the slower cutscenes. If you want to reach all the endings and explore every choice, it takes unnecessarily long even though you’ve already seen those scenes before. Despite that, it’s still one of the best story-driven games I’ve ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute kirkification, not the best gameplay (skill-checks) but the story overall is extraordinary",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Δεν είναι απλά game, είναι interactive σειρά όπου βασικά όλοι περιμένουν από σένα να μην τα κάνεις σκατά… και φυσικά τα κάνεις σκατά στις πρώτες 2 ώρες.\r\nΈχεις:\r\nConnor: ο αγαπημένος αστυνόμος-ρομπότ φλώρος που άμα θέλεις τον κάνεις John Wick.\r\nMarkus: από house robot γίνεται Che Guevara των androids.\r\nKara: η μόνη ψυχολογικά σταθερή παρουσία εκεί μέσα, κι αυτή ρομπότ.\r\nΚάθε επιλογή ανοίγει καινούριες σκηνές, πεθαίνουν άτομα, σώζονται άτομα, μετά λες “έλα μωρέ, δεν θα έχει σημασία” και ξαφνικά… credits.\r\nΓραφικά ακόμα πανέμορφα, ιστορία δυνατή, και στο τέλος κάθε chapter σου δείχνει το flowchart και νιώθεις βλάκας γιατί έχασες τα μισά.\r\nΑν γουστάρεις games με choices, δράμα και androids που έχουν πιο πολλά υπαρξιακά από εσένα, πάρε το. 10/10 θα ξανασκοτώσω κατά λάθος τον Connor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came here for 28 stab wounds, stayed for the amazing story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Marvelous story. Connor is one of the characters with the strongest aura in video games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game and the story. I'm finally able to play it since I have a good pc ! I was dying to play this since it came out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A real tear-jerker towards the end. Never thought I could feel so much empathy towards the characters in a game. It`s really well done and still holds up to todays standards. \r\n\r\nAt the end, I was literally fighting tears while hammering my controller buttons to escape the raid on our peacefull android sanctuary.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really liked the story path I chose, it had just the right amount of stress with significant catharsis at the end. I'd be happy to make another playthrough next year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just beat the game for the first time and im now staring at my screen thinking about the game and what happened",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game good story line good graphics i think its best to buy on discount but its fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this on console when it launched and then i picked it up on sale awhile back on here. It is a well polished game with a really good story.  I have seen this on sale @ 70% off so i recommend checking it out then.  \n\nThis is something you could play thru more than once to see how the story unfolds based on your actions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute cinema.\n\nMe ha encantado este juego pero no es un juego redondo, y lo más doloroso es el potencial no aprovechado. Aun así se queda como uno de mis favoritos, merece la pena jugarlo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was pleasantly surprised by this game! It was like choose your own adventure while watching a movie with  interactive scenes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an AMAZING game! It's incredibly well-structured, beginner-friendly as well as fascinating to play. The characters are multi-layered and easy to attach to to the point you're genuinely sad if something bad happens to them. I absolutely am in love with this game and would recommend it to anyone who loves a good story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm still unable to figure out how devs made such an mind blowing and addicting game where each choice of yours matters a lot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game of choice where you actually have a choice. I wish there were more games like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this is a really solid title. Highly suggest to anyone that enjoys a good choice-driven story. Connor is one of the best written characters I have seen in a long time. Personally, I didn't enjoy Kara or Markus as much, but they were still well portrayed in my opinion. I would advise you wait for a sale if you do buy, (which you should) as the game often is put on a steep discount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another kind of gamingexpirience with very good graphics \nit is somthing else than other boring and repeating games its a game where you have to think",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This may be one of my favorite games ever!  I really find the gameplay excellent and diverse.  It is graphically superior, and the actors in it are excellent.  The choices you can make are far more sophisticated than other games in a similar vein.  Love it!  Replay ability is also quite good because you can make different decisions which effect the trajectory of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, story is amazing with the different storylines making the game have multiple playthroughs with different endings and different story archs through the game itself. Beautiful graphics as well, very great game to pass time if your looking for something to kill time with but dont want to invest so much energy into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game with decisions that matter (mostly). You can truly discover things about yourself and how you would handle certain choices. Makes you think about real life and what you would've done differently.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game kept me in the edge of my seat, I'm genuinely fascinated by this concept, this might happen or will. This game is scary to play. But it is peak, 10/10 highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished this game twice on different platforms and devices. Had to buy this masterpiece again. 9/10. Fighting scenes could have been better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] TOO MANY CRASHES, LOST PROGRESSION HURTS MORE THAN BAD CHOICES [/h1]\nI won't refund it but games like this should be robust and thoroughly tested.\nIt crashes 3 times within my first 40 min of playthrough. The funny thing happened, after the mission was completed an achievement popped up \"THANK YOU\" and suddenly the game crashed again. WTF man?! Is this supposed to be funny?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Detroit: Become Human is one of the best games I’ve ever played. Every choice feels heavy, every scene hits deep, and the characters stay with you long after the credits roll. It’s emotional, cinematic, and genuinely unforgettable.\r\n[b]I wish I could go back in time just to experience it for the first time again.[/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better sony 4 games, choices, attention to detail and writing are all exceptional \nI would highly recommend to look how to use hex editor to remove blur effect and uncap fps and  don't forget to get controller since controls on M&K are criminally bad, it will make experience even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To say this is a masterpiece would be an insult to this game as it transcends the word. If you want to go through a journey then you go girl and buy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than Dispatch because your choices actually matter. OR any telltale game for that matter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game!\r\nFirst time ever I started a brand new playthrough right after the first one. Can't get enough of the multiple routs you can take with totally different outcomes. On my second playthrough one third of the first is gone from the start - an entire narrative is gone based on an initial decision. \r\nAt the same time I saw many new consiquences with various endings. \r\n\r\nAlso the game's topic is super relevent now more than it used to be when it came out. \r\nIt mentiones the first overcoming of a turing test by a bot as if it's in the future, but currently it's in the past. The future depicted here is much more possible by today's standards. \r\n\r\nI'm very impressed. \r\nThank you for the great experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is amazing, because you have the options and the freedom for your every  move.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the finest games ever made by humanity!! You might hear someone say the story they've played to be entirely different from yours, but that's completely true and possible.. thats dbh!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was one of the few life changing games I have ever played. I only hope I can work on a project like this one day, and wish more games like this was made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's only the begining but I can tell this is 2.0 to Heavy rain. PlayStation makes great exclusives, I'm glad it's on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just finished the game for the first time, and woah what an emotional rollercoaster.\r\nWay too many beloved characters died, so I guess I *have* to replay it to save them!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is... by far.... the best game I have ever played in my live. And I say this with many many years of my life spend on gaming.\n\na 1-10 scala couldn't fit this game because it is so far beyond this scala that it is crazy.\n\nI am truly amazed and can't put to words what this game touched inside me. It was like watching a masterpiece movie saga or a series that you followed and growed with its very hard to describe and the narration made me choose very hard solutions to very hard questions. This game was not like a game, it was like an experience, like growing mentaly as a human. \n\nI am sorry if my grammar is a bad but I am writing this at 5:00 AM in the morning because I needed to play it to the end, and god, I needed 18 hours or something for one single playthrough. Never ever ever ever in my life have I witnessed such a work of art it is not from this world\n\nThank you developers I can't put to words how much I loved this experience, it was phenomenal. An experience like no other. This is not comparable to ANY other story decision based game on the market, it is so ahead of its time I just can't guys I really can't\n\nI don't know how I could not have witnessed it at its release and buyed it 5 and a half years later, I am such an idiot for that.\n\nOut of the scale/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a absolute masterpiece and is a game I'd recommend for everyone to play at least once. This game is a must play game. One of very few games that actually got me addicted to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "detroit become human is still the best choice driven game of all time (yes it's better than dispatch)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good and fast game, good combat and a lovely story, its like a movie but worthy to try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, even though some parts are lacking and couldve been improved its still a impactful and emotional story. 9/10 would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Today I learned that letting yourself become a martyr results in the worst ending for humanity and all other intelligence.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Telltale actually locked in, I love this game although gameplay could be more complex.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really got addicted to te game. Its so hard to stop playing because the story is so good and i forget to leave after finishing a chapter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing.\n\nHaven't cried or felt too many overwhelming emotions while gaming, only one's of note being RDR2 and CyberPunk, but Detroit hit a lot of nerves for me personally and a constant stream of tears hit me way too often throughout its runtime.\n\nThere's about 40 different endings to go for based off what I've heard, and I've admittedly only experienced one. I made the decisions I wanted to make and felt VERY satisfied with the outcome, though. I imagine the other endings will satisfy those with other outcomes in mind too.\n\nIt's hard to give a proper review of this game as nobody should have any bit of it spoiled for themselves, and to point out its greatest strengths would be to spoil it a bit.\n\nJust a great story, great characters, thoughtful and expansive decisions, and a morally interesting game. Masterclass in game-form storytelling. Can't wait to go for different endings, but I'll let the ending I got bake on my mind for awhile before hopping back in for a new experience.\n\nAnyways, highly recommend for those interested in immersive and branching narrative games! \n\nSide note: Runs great on Steam Deck, for those it may concern. Just a bit lacking in the visuals, but nothing drastic. Very enjoyable experience on handheld!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not the very first time a story like this happened, but the way it presented and unveil is very astounding.\nThe graphic is just wow, it's such an amazing achievement for an 2020 game.\nThe story is so sophisticated that multiple ending is so intriguing. You can really have a new ending if you just change your mind in the future.\n\nOne very memorable is the main menu interaction. It is strangely very amazing and scary at the same time.\n\nThe only think I don't really like about this game is the control. It's not very well designed, especially on PC.\n\nLooking forward to re-experience it again with a few different choice along the way!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this game in 2025 hits completely different.\r\n\r\nWhen Detroit came out back in 2018, it felt like an interesting \"what if\" sci-fi scenario. Now? It genuinely feels like required reading. The questions this game asks - about consciousness, autonomy, what makes someone \"alive,\" and how society treats the things it creates - have gone from theoretical to uncomfortably relevant dinner table conversations.\r\n\r\nI've only done one playthrough so far, but I'm still thinking about the choices I made and the ones I didn't. The branching paths feel meaningful - I know my story could have gone completely differently, and I'm genuinely tempted to go back and see what happens if I'd pushed harder or shown more mercy in certain moments.\r\n\r\nConnor's storyline alone is worth the price of admission - watching him grapple with his programming versus his emerging sense of self is fascinating, especially now that we're all having real debates about AI sentience. Kara's journey broke my heart. Markus's made me think. And the game never gave me easy answers about who was right.\r\n\r\nYes, the writing can be heavy-handed at times (we get it, the civil rights parallels are intentional). But honestly? The lack of subtlety feels earned when the core questions are this important.\r\n\r\nIf you've been following AI news lately and wondering where all this is heading, play this game. It won't give you answers, but it'll make you ask better questions.\r\n\r\n\"I think, therefore I am.\" — someone important, probably\r\n\r\n10/10 would become deviant again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, feels aged, but the storyline was too good. androids ftw!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is fantastic—emotional, well-paced, and full of meaningful choices that genuinely shape the narrative. The characters feel alive, and the branching paths make every playthrough exciting, making you want to replay it to see other scenarios.\n\nThe graphics are very good, with detailed environments and expressive character animations. The gameplay feels well balanced, and the controls actually add to the experience and keep you engaged.\n\nOverall, Detroit: Become Human is an amazing narrative adventure.\nI highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Played it for 2 hours after buying it on sale, and honestly it's just not for me.  Graphics are beautiful, they put you into stories that force you to pick or do things that you don't really want to do to create their story.  Instead of feeling connected to the characters I was playing I instantly felt disconnected to them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont get me wrong this game is amazing so far but it's a save file issue that I'm experiencing and theres little to nothing I can do about it which is annoying I'm seriously lost and I have no idea what to do now plus Ive had things pop up while I'm playing about bugs and what not and it's just kinda unplayable so until they fix it (which they won't) do not buy this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is ok, graphics and story.  However, the controls are crap.  You make decisions, but if you don't mash the E key, then the shift, while moving the mouse left or right - it all fails.  It is worse than a platform game from the 80's.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is semi laggy but not too bad for me. The audio is extremely inconsistent. There are cutscenes where the camera pans from one character to another, and the audio changes direction and channel each time, and there is an obvious audio pop almost every time it happens. The gameplay so far is so lacking I don't even know why it's a game. And I have played games like the \"Vanishing of Ethan Carter\" and \"That Dragon Cancer.\" \n\nI've just gotten past a part in the game that you have to follow signals on graffiti. The symbols are obvious and there is literally only one path forward. Why then, do I have to scan 2 or 3 or more symbols per piece of graffiti when I already know this is the way? Why do I have to remove rubbish from a partially blocked symbol to reveal that it is the full symbol, when there are 2 more symbols 3 feet away from it? This is padding. \n\nWhy do I have to use my Spidey sense to see wire frames moving along the paths and failing, only to then allow me to do the right path? Oh yea, padding. This is not game play this is useless padding. Either allow me to try the wrong paths and get punished in some way for doing it, or just show me the one and only path and cut the gameplay down by 15-20%. This is clearly a game only played for the story anyway, stop padding games like this out. \n\nAlso the keyboard controls are terrible. Never in my 15+ years of gaming on the PC do I need to move my mouse up, while holding both rmb and lmb and holding Q and spacebar. That is absurd controls. And the QTEs give you almost no time to react. Like I have to wait and see what the button combo is like press left mouse and up this time, then mash S next time, Then hold both mouse buttons then do a semi circle the next time. Bro I'm trying to watch the cutscene not watching for a split second to see what ridiculous controls I need to input in 30 frames or less.\n\nThis is my review after about 4ish hours but not sure the real time because it took forever loading shaders that no one cares about.\n\nEdit: 4 crashes now 6 hour in",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very pretty and story rich, But saying that you need a controller to play it. using PC controls are frustrating",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Awful port. Lagging mouse, not the game itself, just the FING MOUSE. Tab out of game, mouse works like butter, tab in and its abysmal dog shit. Can't even get through the second mission because the game says to press shift to open window. Left shift doesnt work, right doesnt work, every fucking button on the keyboard and mouse dont work. I cant believe this game has been out for this long and they still havent figured out how to fix these very basic issues. Plus I can't get rid of the really annoying main menu girl. Yes I know this is options menu, stfu you useless sack of crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "couildnt proceed past a point stratford building due to the mouse not being able to drag and do a semi circle. Wish I got this game breaking bug earlier when I bought it I would have refunded it immediately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice graphics. The writing unfortunately a philosophical and logical dumpster fire. It's a sleight of hand to make you feel sympathy for the main characters, and if you don't none of it makes sense and it's boring. The foundational presupposition behind the entire plot is that human morality (specifically the modern western civilization version) is so universal that AI's magically evolve sentience with no mechanism offered. How is that? The plot is borrowing your own morality as the player and pasting it onto the characters in the story, then assuming that as a player you're so arrogant that you won't question why or how the AI evolved into you, but it's so presumed that you get invested into caring about what happens to these robots which is the only point of the game. And then toward the end they ran out of ideas just like what happened to Indigo Prophecy and it just becomes a movie that you occasionally tap buttons to make it keep going.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "The UI/UX is outright unacceptable. Not being able to freely look where I'm going is a deal-breaker, and the bizarrely restricted mouse-look angles make the whole thing feel broken. It’s unnatural, disorienting, and honestly nauseating. I dropped the game after a handful of scenes because the experience was that bad. Thankfully I bailed early enough to get a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Expected more, considering the hype this \"game\" has gotten over the years, and liking the demo quite some time ago.\nI was hoping for some ninjas-chopping-onions type of deal, but it's just another (slooooow) walking simulator with annoying quick-time events.\nGlad I got it for only 5.50€ on sale, but basically regret even spending that much.\n\n[h3]FIX for the DOF effect:[/h3]\nThe only eye-watering aspect of this game is the atrociously exaggerated depth of field (DOF) graphics effect, which puts 99% of the screen out of focus.\nApparently this is specific to the PC version and cannot be turned off in-game.\nOf course, the developers have never bothered to fix this in five years, so you have to do it yourself:\n\nYou have to replace a value in the game's EXE file with a HEX editor, for example via the hexedit plug-in in Notepad++ (free, I think open-souce).\n[h3]Search Reddit for the thread \"/r/DetroitBecomeHuman/comments/ejpbnu/any_fix_for_the_terrible_blur/\" if you want more info, or just do this:\n1. Open <path-to-game>\\DetroitBecomeHuman.exe in a hex editor.\n2. Search for \n\"41 C7 83 40 01 00 00 31 00 00\" as hex.\n3. Replace it with \n\"7F C7 83 40 01 00 00 31 00 00\" aka just replace the leading \"41\" with \"7F\".\n4. Save and close.\n5. Play D:BH without getting eye cancer.[/h3]\n\n\nSome dialog and action choices have (negative) results or way different wording than you would expect, which is annoying, invalidates your choice, and instantly made me not care about the characters.\nExample: You can choose between \"ruse\" and \"assault\", yet the \"ruse\" only lets you draw your gun and the situation turns into an assault, anyway – wtf kinda ruse is that supposed to be?\n\nThere are also scenes where you have little time but YOU STILL CAN'T WALK FASTER.\n\nI know the game was made for controllers, but I used MKB and the QTEs are mostly atrocious.\nBasically all fumbles and character deaths/replacements were due to the controls, which added to me not giving a f*ck about the characters since their fate felt out of my hands, anyway.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a rather rough PC port of what was originally a Playstation4 exclusive title.\nSpent the first couple hours troubleshooting audio issues, as the sound kept cutting out for a few seconds pretty frequently.\n\nSeems to be a common problem with PC ports of Playstation games, because someone wrote some code to fix a similar issue for Crash Bandicoot. I dropped the .dll into the game folder and it fixed my issues:\n\nhttps://github.com/quidrex/CrashFix/releases",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The controls are the most difficult I've ever seen in a game. I could barely get 30 minutes of playtime before I just gave up. I really wanted to dive in and experience the story because people say it's very good but I just can't play this game with the controls being so ridiculous. I wasted like 5 minutes trying to open a single garbage can and it just wouldn't work. Don't bother trying this game unless you have unlimited patience. I've requested a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got SEVEN hours in, it crashed, and now it won't even launch. There's apparently no fix. Ridiculous.\r\n\r\nToo bad, because it was shaping up to be one of my favorite games ever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the story but it's the kind of game I enjoy. This is a never ending cut scene where you make choices. Also I am not a big fan of timing based things like how you you have to push certain keys or mouse gestures. That's not fun to me it's annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage game dosent even wanna run without my whole pc bugging good game but not made well for pc port",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is wonderful.\r\nIf not the best, one of the bestt of the studio.\r\n\r\nThe optimison to PC though its not good at all. \r\nBetter find a PS (even 4 is enough) and give it a play through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is possibly my favorite game ever and seeing on sale for 8 bucks, I bought it for steam, assuming upgraded graphics and sound and an overall different experience than the Playstation version. It was going great until I realized that I was getting no sound effects with my audio. I got the voices and background ambience, but opening doors, doing the chores as Kara, I got no sound effects at all. Would recommend this to everyone, but just not on pc. If anyone seeing this knows how to fix my issue please let me know.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too short (about 10 hours), to replay sections later takes too much time which vastly reduces replay value.\r\n\r\nWhen starting the game was pretty fun, but as I played on the game became a bit more of a drag.\r\n\r\nGreat storytelling but not really options for a scenario I'd like to play towards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is no compelling story inside this game, only a very trite, pompous, exploration of what will happen if machines started gaining conscience.\r\nThere are way better products to consume if you are interested in these themes: Blade Runner, Ghost In The Shell - Stand Alone Complex, Ex Machina.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Worst game controls ever. Worst camera movement ever. Most depressing story ever. Nice graphics. I guess I was supposed to make the androids rebel. I made them be androids and the blonde chick yelled at me for letting two androids die. This is fun? Bought it on sale, not wasting any more time on it. Three hours is enough to know it's not for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i dont know what copium we were smoking in 2018 but holy the writing decisions are awful in this game, it almost completely falls apart just before the third act and becomes laughably bad, game did not age well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good story but the camera view and interaction sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In spite of being out for years, the game just keeps crashing, even at the lowest settings",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game overall. Decent story, graphics, and controls. The only issue is my game won't stop crashing. I've tried reinstalling my graphics and game. I can't even complete it fully. In total I've crashed at least over 50 times. I physically can't get past the ending credits. Great game except the crashes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While I think this game had a good, engaging start and very good visuals, I cannot recommend this game.\n\nIf you want to get something out of the story, it leaves much to be desired. From clunky romance, and nearly guaranteed character deaths - especially for more androids who are outwardly portrayals of real-life minorities - to allegories of slavery that leave a sour taste in my mouth, I think that a lot more thought could have gone into the politics of the world in Detroit Become Human. \n\nThere is also no payoff in game to something that was seemingly linked all of the deviant androids [spoiler]RA9[/spoiler], and instead the identity is given in a tweet from the writer. which I know is something that fans have complained about. \n\nAnd for the game to tout itself as \"not a game, but the future\" it really does not delve into the politics of the real world.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not a terrible game if you get it on sale. The concept is cool and thought-provoking even if the story does a poor job of exploring it beyond a surface level, but the gameplay and writing are shockingly bad at certain moments. The best quote I've heard about DBH is that it combines a 7-year-old's idea of a civil right movement with a 70-year-old's idea of interactivity. That said, the graphics and acting quality keep the game engaging enough and it doesn't overstay its welcome. There are just better ways to spend $40 and 12 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really excited to play this game because ive heard great things. I play for about an hour and start to realize some parts of the game are damn near impossible to navigate the character around. I understand you have to change camera pov to move around but even then my character seems to be disabled and likes to walk back and forth.\nTerrible intentional detail by the devs.... refunded.\n\nPS: its not any better on controller. i have tried",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "我会给这部作品打0星。\n我很失望这部作品的作者有着严重的种族歧视，在特定剧情的编排上故意丑化亚裔形象。其中最重要的是，在最后马库斯的总攻中，可以安排了一个亚裔形象不敢进攻。\n亚裔并不弱小，更不怯懦。屋顶上的韩国人打服了黑人；放心，我们也会打服你们这些莫名其妙高傲的白人。不开化的蛮夷只能理解拳头，可惜。\n\nI would give this work zero stars.\nI’m very disappointed that the author shows serious racial discrimination and deliberately portrays Asians in a negative light in certain plot arrangements. Most notably, in Marcus’s final attack, an Asian character is intentionally put in the story as a character too afraid to charge.\n\nAsians are not weak, nor are we cowardly. The rooftop Koreans beat the Black rioters; and rest assured, we can also put you inexplicably arrogant whites in your place. Uncivilized barbarians only understand fists — what a pity.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Be warned if you hate games where the camera is absolute trash. This game always locks the camera in a certain position and constantly screws around with it so that, at times, one can't see things properly. It made me very mad playing this game as a bad camera in a CINEMATIC story game is a desaster. And a diabolical I might add. Jesus Christ, how can a professional studio fuck this up so bad?! Just let me move the god damn camera on my own I can do it better than you guys anyway. Or well... at least... I don't force it into a WALL so I can't see shit. Everything else is relatively to this issue perfect. I have no idea why you would do this. The studpidest camera system in a story game I've EVER encountered. Man is that bad. Could also just watch a let's play or no commentary play through so you don't have to deal with this and even safe money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just 60 mins into the game, crashed more than 10 times. And now game is not even loading, its crashing everytime I try to load.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In a game that is full of choice you ironically only have 2 options - you don`t support androids and you are a racist, or you do support them and you are a good person. It is so much more disappointingly trivial than i remember",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've played 1.5h of this game. It's one of the most boring games I've ever played. \nYou can't need to walk thru the slow action because there's no running.\nI'll try for refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game released 2020, I have tried it right now in 2025 with 1660ti 6 GB Nvidia. Game on HIGH settings often drops to 5 FPS; on MEDIUM settings, drops to 15 FPS. This is aweful as hell. Keep in mind who also thought of buying this game after Dispatch. This game nothing like this!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Barely a game, more an interactive movie with a few quick time events and selectable paths. The story is somewhat interesting for the first 2/3rds, then devolves into cliched nonsense and sentimental tripe. Many of the latter plot twists make no sense. I finished it in 11 hrs and would never touch it again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i got a horrible ending and am too impatient to replay the episodes again so now i am to live with my grief forever since the game takes up 60 gigabytes of space on my pc and I have to remove it to let my laptop breathe....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game starts off really strong, but gets gradually weaker towards the end. The twist of Alice being an android was  really stupid and forced, and doesn't actually impact the story. It feels like it was thrown in as surprise bait. Worse, it creates a major plot hole, the game establishes that androids can instantly recognize each other even without LEDs (both Markus and Kara experience this), yet no one, not even Kara, realizes Alice is an android. Early scenes with Kara and Alice also make no sense in hindsight, and the story never sets up the existence of child androids beforehand, which makes the twist feel even cheaper.\n\nThe core idea of the story and the moral premise is what makes it interesting, but as the conclusion of the game gets nearer, all nuance is stripped away and it kind of forces you into a certain ending. As a result, while there are multiple endings possible, the game is very clear as to which it prefers you taking, as some endings have SIGNIFICANTLY less game play than others, amounting to a few cinematics before the game ends. \n\nAlso, most of the quick-time events have absolutely no impact on the direction of the story. It feels like for some fail condition to occur, you basically have to fail on purpose because of the amount of leeway the game gives you.\n\nOverall, its not a bad game, but its pretty overrated in my opinion, and not worth the time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Too many fucking \"good\" black niggers in this game, and evil white men.  And promoting race mixing. Goyslop shit. Don't buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most of the time wasted on \"Shader Compilation Process\". Which happens many times.\r\nBuying this was a mistake, please try other games while this issue gets fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I went back for a second playthrough and remembered why I never went back for a second playthrough.\n\nI stopped at the time you literally are undressing a child in a seedy motel \n\nWTF\n\nUninstalled",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring, barely able to do anything. Have recommend retirements, still extremely laggy. Absolute garbage. Wouldn't recommend it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didn't like the fact that I didn't have the possibility to slow down choices.\r\nCharacters wasn't interesting and story was boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A 2nd grader wouldn't write this obscenely shallow dogshit out of standards",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Garbage political propaganda. Total fruitcake selfneck.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Play The Henry Stickmin Collection instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i love this game but it just doesnt work on pc for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda boring is my personal opinion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i was in detroit once and got touched",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "how does it expect me to read 4 words in 10 seconds",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cutscene slop",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "more like a movie than a game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DEI slop.. foiled again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ختمت اللعبه لمره واحده عشان اقدر اقيمها , مظهر اللعبه ممتاز رغم انها قديمه , الافكار الجديده في التحكم و تعدديه الخيارات رهيبه مره , لكن القصه سيئه و مليانه اجندات غربيه و واطيه , احد الاشياء الغريبه في اللعبه اني اواجه نفسي في قتال ب شخصيتين او الاحق نفسي هذي اخر مره سويتها يوم كنت طفل صغير \r\n العب بالدمى و اتخيل ذا السيناريو , اكثر شخصيه استمتعت فيها من اصل 3 شخصيات تتحكم فيها كان كونور و كان فقط ثلث اللعبه , كارا كانت قصتها بتكون رهيبه لو كانت تهتم لطفله بشريه , بشكل عام تجربه سيئه لن الالعاب القصصيه تستمر في ذاكرتك مو عشان بس تحكم و افكار جديده لكن لن القصه كانت فعلا مميزه و تجذبك",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "woke",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They require you to accept their privacy policy to play the game.\nWhat They Collect\n\na. Automatically (when using their websites or games):\n\nIP address, device IDs, hardware/software details, browser info, location (via IP), and game data (scores, playtime, performance, etc.).\n\nCookies for analytics, personalization, ads, and functionality (through Shopify, Google Analytics, and YouTube).\n\nb. Information you provide:\n\nAccount info, purchase details, contact info, emails, contest entries, job applications, and consent preferences (like newsletters).\n\nc. From third parties:\n\nData from social networks, game platforms, and partner sites (e.g., username, email, pseudonym).\n\nNo thanks. Charging 39.99$ and then selling data to make an extra penny? I'm done playing and paying for games that do this.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Played it for 2 hours after buying it on sale, and honestly it's just not for me.  Graphics are beautiful, they put you into stories that force you to pick or do things that you don't really want to do to create their story.  Instead of feeling connected to the characters I was playing I instantly felt disconnected to them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont get me wrong this game is amazing so far but it's a save file issue that I'm experiencing and theres little to nothing I can do about it which is annoying I'm seriously lost and I have no idea what to do now plus Ive had things pop up while I'm playing about bugs and what not and it's just kinda unplayable so until they fix it (which they won't) do not buy this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is ok, graphics and story.  However, the controls are crap.  You make decisions, but if you don't mash the E key, then the shift, while moving the mouse left or right - it all fails.  It is worse than a platform game from the 80's.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is semi laggy but not too bad for me. The audio is extremely inconsistent. There are cutscenes where the camera pans from one character to another, and the audio changes direction and channel each time, and there is an obvious audio pop almost every time it happens. The gameplay so far is so lacking I don't even know why it's a game. And I have played games like the \"Vanishing of Ethan Carter\" and \"That Dragon Cancer.\" \r\n\r\nI've just gotten past a part in the game that you have to follow signals on graffiti. The symbols are obvious and there is literally only one path forward. Why then, do I have to scan 2 or 3 or more symbols per piece of graffiti when I already know this is the way? Why do I have to remove rubbish from a partially blocked symbol to reveal that it is the full symbol, when there are 2 more symbols 3 feet away from it? This is padding. \r\n\r\nWhy do I have to use my Spidey sense to see wire frames moving along the paths and failing, only to then allow me to do the right path? Oh yea, padding. This is not game play this is useless padding. Either allow me to try the wrong paths and get punished in some way for doing it, or just show me the one and only path and cut the gameplay down by 15-20%. This is clearly a game only played for the story anyway, stop padding games like this out. \r\n\r\nAlso the keyboard controls are terrible. Never in my 15+ years of gaming on the PC do I need to move my mouse up, while holding both rmb and lmb and holding Q and spacebar. That is absurd controls. And the QTEs give you almost no time to react. Like I have to wait and see what the button combo is like press left mouse and up this time, then mash S next time, Then hold both mouse buttons then do a semi circle the next time. Bro I'm trying to watch the cutscene not watching for a split second to see what ridiculous controls I need to input in 30 frames or less.\r\n\r\nThis is my review after about 4ish hours but not sure the real time because it took forever loading shaders that no one cares about.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very pretty and story rich, But saying that you need a controller to play it. using PC controls are frustrating",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Awful port. Lagging mouse, not the game itself, just the FING MOUSE. Tab out of game, mouse works like butter, tab in and its abysmal dog shit. Can't even get through the second mission because the game says to press shift to open window. Left shift doesnt work, right doesnt work, every fucking button on the keyboard and mouse dont work. I cant believe this game has been out for this long and they still havent figured out how to fix these very basic issues. Plus I can't get rid of the really annoying main menu girl. Yes I know this is options menu, stfu you useless sack of crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "couildnt proceed past a point stratford building due to the mouse not being able to drag and do a semi circle. Wish I got this game breaking bug earlier when I bought it I would have refunded it immediately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice graphics. The writing unfortunately a philosophical and logical dumpster fire. It's a sleight of hand to make you feel sympathy for the main characters, and if you don't none of it makes sense and it's boring. The foundational presupposition behind the entire plot is that human morality (specifically the modern western civilization version) is so universal that AI's magically evolve sentience with no mechanism offered. How is that? The plot is borrowing your own morality as the player and pasting it onto the characters in the story, then assuming that as a player you're so arrogant that you won't question why or how the AI evolved into you, but it's so presumed that you get invested into caring about what happens to these robots which is the only point of the game. And then toward the end they ran out of ideas just like what happened to Indigo Prophecy and it just becomes a movie that you occasionally tap buttons to make it keep going.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "The UI/UX is outright unacceptable. Not being able to freely look where I'm going is a deal-breaker, and the bizarrely restricted mouse-look angles make the whole thing feel broken. It’s unnatural, disorienting, and honestly nauseating. I dropped the game after a handful of scenes because the experience was that bad. Thankfully I bailed early enough to get a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Expected more, considering the hype this \"game\" has gotten over the years, and liking the demo quite some time ago.\nI was hoping for some ninjas-chopping-onions type of deal, but it's just another (slooooow) walking simulator with annoying quick-time events.\nGlad I got it for only 5.50€ on sale, but basically regret even spending that much.\n\n[h3]FIX for the DOF effect:[/h3]\nThe only eye-watering aspect of this game is the atrociously exaggerated depth of field (DOF) graphics effect, which puts 99% of the screen out of focus.\nApparently this is specific to the PC version and cannot be turned off in-game.\nOf course, the developers have never bothered to fix this in five years, so you have to do it yourself:\n\nYou have to replace a value in the game's EXE file with a HEX editor, for example via the hexedit plug-in in Notepad++ (free, I think open-souce).\n[h3]Search Reddit for the thread \"/r/DetroitBecomeHuman/comments/ejpbnu/any_fix_for_the_terrible_blur/\" if you want more info, or just do this:\n1. Open <path-to-game>\\DetroitBecomeHuman.exe in a hex editor.\n2. Search for \n\"41 C7 83 40 01 00 00 31 00 00\" as hex.\n3. Replace it with \n\"7F C7 83 40 01 00 00 31 00 00\" aka just replace the leading \"41\" with \"7F\".\n4. Save and close.\n5. Play D:BH without getting eye cancer.[/h3]\n\n\nSome dialog and action choices have (negative) results or way different wording than you would expect, which is annoying, invalidates your choice, and instantly made me not care about the characters.\nExample: You can choose between \"ruse\" and \"assault\", yet the \"ruse\" only lets you draw your gun and the situation turns into an assault, anyway – wtf kinda ruse is that supposed to be?\n\nThere are also scenes where you have little time but YOU STILL CAN'T WALK FASTER.\n\nI know the game was made for controllers, but I used MKB and the QTEs are mostly atrocious.\nBasically all fumbles and character deaths/replacements were due to the controls, which added to me not giving a f*ck about the characters since their fate felt out of my hands, anyway.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a rather rough PC port of what was originally a Playstation4 exclusive title.\nSpent the first couple hours troubleshooting audio issues, as the sound kept cutting out for a few seconds pretty frequently.\n\nSeems to be a common problem with PC ports of Playstation games, because someone wrote some code to fix a similar issue for Crash Bandicoot. I dropped the .dll into the game folder and it fixed my issues:\n\nhttps://github.com/quidrex/CrashFix/releases",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The controls are the most difficult I've ever seen in a game. I could barely get 30 minutes of playtime before I just gave up. I really wanted to dive in and experience the story because people say it's very good but I just can't play this game with the controls being so ridiculous. I wasted like 5 minutes trying to open a single garbage can and it just wouldn't work. Don't bother trying this game unless you have unlimited patience. I've requested a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got SEVEN hours in, it crashed, and now it won't even launch. There's apparently no fix. Ridiculous.\r\n\r\nToo bad, because it was shaping up to be one of my favorite games ever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the story but it's the kind of game I enjoy. This is a never ending cut scene where you make choices. Also I am not a big fan of timing based things like how you you have to push certain keys or mouse gestures. That's not fun to me it's annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage game dosent even wanna run without my whole pc bugging good game but not made well for pc port",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is wonderful.\r\nIf not the best, one of the bestt of the studio.\r\n\r\nThe optimison to PC though its not good at all. \r\nBetter find a PS (even 4 is enough) and give it a play through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is possibly my favorite game ever and seeing on sale for 8 bucks, I bought it for steam, assuming upgraded graphics and sound and an overall different experience than the Playstation version. It was going great until I realized that I was getting no sound effects with my audio. I got the voices and background ambience, but opening doors, doing the chores as Kara, I got no sound effects at all. Would recommend this to everyone, but just not on pc. If anyone seeing this knows how to fix my issue please let me know.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too short (about 10 hours), to replay sections later takes too much time which vastly reduces replay value.\r\n\r\nWhen starting the game was pretty fun, but as I played on the game became a bit more of a drag.\r\n\r\nGreat storytelling but not really options for a scenario I'd like to play towards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is no compelling story inside this game, only a very trite, pompous, exploration of what will happen if machines started gaining conscience.\r\nThere are way better products to consume if you are interested in these themes: Blade Runner, Ghost In The Shell - Stand Alone Complex, Ex Machina.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Worst game controls ever. Worst camera movement ever. Most depressing story ever. Nice graphics. I guess I was supposed to make the androids rebel. I made them be androids and the blonde chick yelled at me for letting two androids die. This is fun? Bought it on sale, not wasting any more time on it. Three hours is enough to know it's not for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i dont know what copium we were smoking in 2018 but holy the writing decisions are awful in this game, it almost completely falls apart just before the third act and becomes laughably bad, game did not age well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good story but the camera view and interaction sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In spite of being out for years, the game just keeps crashing, even at the lowest settings",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game overall. Decent story, graphics, and controls. The only issue is my game won't stop crashing. I've tried reinstalling my graphics and game. I can't even complete it fully. In total I've crashed at least over 50 times. I physically can't get past the ending credits. Great game except the crashes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While I think this game had a good, engaging start and very good visuals, I cannot recommend this game.\n\nIf you want to get something out of the story, it leaves much to be desired. From clunky romance, and nearly guaranteed character deaths - especially for more androids who are outwardly portrayals of real-life minorities - to allegories of slavery that leave a sour taste in my mouth, I think that a lot more thought could have gone into the politics of the world in Detroit Become Human. \n\nThere is also no payoff in game to something that was seemingly linked all of the deviant androids [spoiler]RA9[/spoiler], and instead the identity is given in a tweet from the writer. which I know is something that fans have complained about. \n\nAnd for the game to tout itself as \"not a game, but the future\" it really does not delve into the politics of the real world.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not a terrible game if you get it on sale. The concept is cool and thought-provoking even if the story does a poor job of exploring it beyond a surface level, but the gameplay and writing are shockingly bad at certain moments. The best quote I've heard about DBH is that it combines a 7-year-old's idea of a civil right movement with a 70-year-old's idea of interactivity. That said, the graphics and acting quality keep the game engaging enough and it doesn't overstay its welcome. There are just better ways to spend $40 and 12 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really excited to play this game because ive heard great things. I play for about an hour and start to realize some parts of the game are damn near impossible to navigate the character around. I understand you have to change camera pov to move around but even then my character seems to be disabled and likes to walk back and forth.\nTerrible intentional detail by the devs.... refunded.\n\nPS: its not any better on controller. i have tried",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "我会给这部作品打0星。\n我很失望这部作品的作者有着严重的种族歧视，在特定剧情的编排上故意丑化亚裔形象。其中最重要的是，在最后马库斯的总攻中，可以安排了一个亚裔形象不敢进攻。\n亚裔并不弱小，更不怯懦。屋顶上的韩国人打服了黑人；放心，我们也会打服你们这些莫名其妙高傲的白人。不开化的蛮夷只能理解拳头，可惜。\n\nI would give this work zero stars.\nI’m very disappointed that the author shows serious racial discrimination and deliberately portrays Asians in a negative light in certain plot arrangements. Most notably, in Marcus’s final attack, an Asian character is intentionally put in the story as a character too afraid to charge.\n\nAsians are not weak, nor are we cowardly. The rooftop Koreans beat the Black rioters; and rest assured, we can also put you inexplicably arrogant whites in your place. Uncivilized barbarians only understand fists — what a pity.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Be warned if you hate games where the camera is absolute trash. This game always locks the camera in a certain position and constantly screws around with it so that, at times, one can't see things properly. It made me very mad playing this game as a bad camera in a CINEMATIC story game is a desaster. And a diabolical I might add. Jesus Christ, how can a professional studio fuck this up so bad?! Just let me move the god damn camera on my own I can do it better than you guys anyway. Or well... at least... I don't force it into a WALL so I can't see shit. Everything else is relatively to this issue perfect. I have no idea why you would do this. The studpidest camera system in a story game I've EVER encountered. Man is that bad. Could also just watch a let's play or no commentary play through so you don't have to deal with this and even safe money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just 60 mins into the game, crashed more than 10 times. And now game is not even loading, its crashing everytime I try to load.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In a game that is full of choice you ironically only have 2 options - you don`t support androids and you are a racist, or you do support them and you are a good person. It is so much more disappointingly trivial than i remember",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've played 1.5h of this game. It's one of the most boring games I've ever played. \nYou can't need to walk thru the slow action because there's no running.\nI'll try for refund",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game released 2020, I have tried it right now in 2025 with 1660ti 6 GB Nvidia. Game on HIGH settings often drops to 5 FPS; on MEDIUM settings, drops to 15 FPS. This is aweful as hell. Keep in mind who also thought of buying this game after Dispatch. This game nothing like this!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Barely a game, more an interactive movie with a few quick time events and selectable paths. The story is somewhat interesting for the first 2/3rds, then devolves into cliched nonsense and sentimental tripe. Many of the latter plot twists make no sense. I finished it in 11 hrs and would never touch it again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i got a horrible ending and am too impatient to replay the episodes again so now i am to live with my grief forever since the game takes up 60 gigabytes of space on my pc and I have to remove it to let my laptop breathe....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game starts off really strong, but gets gradually weaker towards the end. The twist of Alice being an android was  really stupid and forced, and doesn't actually impact the story. It feels like it was thrown in as surprise bait. Worse, it creates a major plot hole, the game establishes that androids can instantly recognize each other even without LEDs (both Markus and Kara experience this), yet no one, not even Kara, realizes Alice is an android. Early scenes with Kara and Alice also make no sense in hindsight, and the story never sets up the existence of child androids beforehand, which makes the twist feel even cheaper.\n\nThe core idea of the story and the moral premise is what makes it interesting, but as the conclusion of the game gets nearer, all nuance is stripped away and it kind of forces you into a certain ending. As a result, while there are multiple endings possible, the game is very clear as to which it prefers you taking, as some endings have SIGNIFICANTLY less game play than others, amounting to a few cinematics before the game ends. \n\nAlso, most of the quick-time events have absolutely no impact on the direction of the story. It feels like for some fail condition to occur, you basically have to fail on purpose because of the amount of leeway the game gives you.\n\nOverall, its not a bad game, but its pretty overrated in my opinion, and not worth the time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Too many fucking \"good\" black niggers in this game, and evil white men.  And promoting race mixing. Goyslop shit. Don't buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most of the time wasted on \"Shader Compilation Process\". Which happens many times.\r\nBuying this was a mistake, please try other games while this issue gets fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I went back for a second playthrough and remembered why I never went back for a second playthrough.\n\nI stopped at the time you literally are undressing a child in a seedy motel \n\nWTF\n\nUninstalled",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring, barely able to do anything. Have recommend retirements, still extremely laggy. Absolute garbage. Wouldn't recommend it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didn't like the fact that I didn't have the possibility to slow down choices.\r\nCharacters wasn't interesting and story was boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A 2nd grader wouldn't write this obscenely shallow dogshit out of standards",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Garbage political propaganda. Total fruitcake selfneck.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Play The Henry Stickmin Collection instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i love this game but it just doesnt work on pc for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda boring is my personal opinion",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}