{
  "positive": [
    {
      "review": "A game that doesn't take itself too seriously is a breath of fresh air in the pretentious industry.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This is the first Like a Dragon game for me and boy was it an amazing ride!\n\nIt took me a while to understand how everything worked but this game is well done and the story brings a tear to my eye.\n\nHands down Ichiban is one of the best gaming characters that wears his heart on his sleeve!\n\nI think this is a great starting point for anyone wanting to dip thier toe into the Like a Dragon series.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Great game. Loved the story. I HATE the True Final Millennium Tower",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Incredible JRPG with a great cast of characters.  Music is great, story is great, and the world is loaded with things to do.  Excellent game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game gets a lot more interesting once you become schizophrenic 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Yakuza franchise has always been one of my favorite video game series, and of that series, this might be tied with Yakuza 0 for my favorite game. Largely because of the story and its ability to have both hilarious moments and heartwrenching serious moments. I really loved watching Ichiban's journey and the interesting side plots of all of his friends. If you enjoy story-rich JRPGs, and haven't already played this game, then I wholeheartedly implore you to experience this masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely fun the main character Ichiban is one of myall time favorites and after 120 hours I can say the game is worth every penny I'm still not finished. I find myself doing every side mission cuz I don't want to miss anything like the one mission I hunted down baby formula only to find a grown man in diapers and a mistress just died laughing out loud. buy it n it won't disappoint",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like the story , the changes in the map...Making the Kamurucho enviroment more modern...But I don't like the fighting gameplay they use...I am a fan of the old and traditional Beat em up style they used in the previous games ..But it fits in this because Ichiban fight as a group",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite good \r\nIf you want to get a fast money pass a Management game with DLC and you won't feel any need in funds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Regardless of whether you're new to what was formerly known as Yakuza and is now known under it's more literal translation, Like a Dragon, or someone that has played the entire series, this game comes highly recommended, even more so if you love epic stories, awesome characters and character development, and/or are a fan of RPG's. Bonus points if don't mind having yourself a nice cry because a game's story got to you.\r\n\r\nStory and Character Development (A+ or 100/100): Even if you're new to the series (as I was when I played this the first time) and some of the nods to the series' history will not hit as hard as they otherwise would have, I still thought the story was amazing Those nods will hit even harder if you have played the rest of the series and are still somehow in the dark about what awaits you. \r\n\r\nThis was the first game I played in the series when I first played it a couple years ago, and it connected with me so much that I spent the next year playing the rest of the series before playing Infinite Wealth (the sequel to this game). Story and character development are where this series shines most.\r\n\r\nCombat and Systems (for RPG fans A or 90/100, for most other people B or 80/100): If you love RPG's, I think you will find the combat enjoyable even if it does not do much to add anything new to the genre. I really enjoyed it myself, but it is not as if it does a lot to avoid feeling repetitive at times. Still, it was the first RPG game in the series and it does nearly everything else well. Good build variety, enjoyable skills, upgrades to chase, paths to making your characters very OP while still ensuring the game still feels balanced.\r\n\r\nSide Content (B or 85/100): While the \"weird\" and \"cringe\" sub-stories are even more weird and cringe relative to the earlier games, I do not think it is so great that it justifies the narrative that the series has abandoned its identity. Some are weird, some are cringe, some are funny, and some are even touching. That has always been a constant in these games.\r\n\r\nThe side activity for making money is ok, but is not as engaging as some of activities in prior games (fellas, it's ok, we know you spent hours giving a hostess a makeover in the hostess club activity in prior games). There are some other activities new the series that were challenging and enjoyable enough to complete all of the challenges and content tied to them.\r\n\r\nVoice Acting (A+ or 10/10): When I first played this a couple of years ago, I did not understand that this was the first game in the series to receive English dubs. Having said that, I now try to play each game where there are English dubs twice (once with the Japanese VA's and the other with the English VA's) because of how much I enjoy the Japanese VA's as an English speaking person. \r\n\r\nIt was always going to be difficult for them to follow in the footsteps of the performances from earlier games in the series, but as an English speaking person, I gauge that quality as \"can I still understand the emotional meaning or heaviness of how the character they are portraying is feeling even if I do not speak the language?\" and the answer here is a resounding yes.\r\n\r\nWhile I'm not sure I have enjoyed the English VA's in remakes being made of earlier games (or Man Who Erased His Name and Pirate Yakuza), I do think the English voice cast does an amazing job here.\r\n\r\nOverall (A or 95/100): One of my top 3 games in the series and one of my all time favorite stories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great twist to the Yakuza formula. I found the turn based gameplay \"making sense\" with the setting, mixing the strategic and wacky elements together. The story is a 10/10. There is a lot here that can touch you deeply while still being funny as hell. I love Ichiban as a protagonist. This game made me laugh and cry and I cherish every moment spent with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First introduction into the Yakuza series, loved the story fun combat, amazing time overall highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not my cup of tea but an amazing game with a ton of depth! It is not often that I am recommended a game with such fantastic NPC's  or story but this breaks the pattern! If you enjoy story base turn based combat this game is for you. I enjoyed the minigames and was engaged consistently.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For starting off feeling like a joke game, this was really engaging, packed with content, and had a really interesting story. If you can get into turn-based games at all, I would 100% recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "50/50 split between Saints Row The Third and a JRPG. Coincidentally, 50/50 points is what I would rate this game too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was my first proper introduction to the Yakuza series. I had played Yakuza 0 before, but only for about two hours, so that doesn’t really count.\nI’ve never been too into classic beat ‘em up combat — it never really clicked with me — but every now and then I’d see some random clips showing the story or funny moments, and every single time I’d get the urge to try again.\nThen I found out that a turn-based Yakuza game existed, and that you don’t necessarily need to play the others to understand the story (though it’s better if you do). And honestly, I don’t regret it at all.\n\nThe story  without spoilers  was both good and bad, in a way. There were sad, funny, and “WTF” moments, and sometimes the tone shifted from serious to ridiculous in just a few seconds. I actually enjoyed that, even if I’d make a few small adjustments.\n\nThe gameplay was fantastic. I’ve played a lot of turn-based JRPGs, and this one was incredibly fun  using all the abilities, playing the minigames (I loved Dragon Kart!), eating food for buffs, and so on. My only real downside was the long and kinda boring dungeons; they take too much time to complete. \n\nSolid 9,5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with lots of fun side quest and mini games but way too many cut scenes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is truly a flawed gem. It’s astonishing how much detail the developers put into creating hundreds of posters, signs, billboards, and restaurant menus that make the neighborhoods where the story unfolds—Kamurocho, Ijincho, and Sotenbori—feel genuinely alive.\r\n\r\nThe story itself is quite good. It starts off strong, slows down a bit in the middle, but finishes with a powerful and satisfying ending. One aspect that really appealed to me is that most of the main characters are people in their 30s and 40s. That alone makes them feel far more relatable and human compared to the typical “colored-hair hero #392 with cute sidekick #292” trope so common in JRPGs.\r\n\r\nWhile the game is filled with slapstick humor, the main story maintains a serious tone. By the end, I genuinely cared about most of the main characters—though, unfortunately, some of the party members who join later aren’t as well developed. Story-wise, it’s easily above average compared to most games released today.\r\n\r\nNow, the reason I call it a flawed gem lies in the gameplay. At first, I enjoyed it, but over time the gameplay began to feel repetitive. Since the game is heavily story-driven, the developers padded it with a lot of side content—mini-games, item collecting, crafting, plant growing, optional dungeons, and even a kart racing mode. Those are fantastic if you enjoy a “playground” approach to your games, and if you dive into everything, you’ll easily get hundreds of hours and your money worth out of it. But for me, I was mostly in it for the story and scenery. Some sections ended up feeling like chores, especially since the difficulty curve isn’t consistent. The game is about 95% easy battles, then suddenly it throws a few boss fights at you that require grinding for hours to level up, gather items, and fine-tune your party.\r\n\r\nAll in all, I appreciated that this game feels made with adult players as it deals with mature themes and depicts the nightlife of a major city without crossing into crass sexualization, excessive gore, or cheap fanservice. I would recommend this to anyone who enjoys JRPGs and needs a break from the more common tropes of the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haha, it's the silly gimmick game with tons of wacky minigames!\n\nWait holy crap why is the story so engaging?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yakuza (7): Like a Dragon is one of the best JRPGs on the market. It has an amazing and immersive story, tons of side activities and perfect amounts of shenanigans. It doesn't take itself too seriously and embraces the weirdness. \r\n\r\nAs for the combat, it's good enough. It's funny, flashy, not too complex and not too shallow. However, as it usually is in JRPGs, the combat gets old after a while. The game can be slightly grindy at times which only accelerates the burnout. Some of the late-game dungeons feel too long and just unnecessarily drag on. To sum up the combat is a nice addition to the game, but is definitely not the main star.\r\n\r\nBeware of the final boss. The entire game is easy and you are never at any risk of losing the fight. That suddenly changes during the final fight. The boss has an RNG attack which deletes one of the party members. If he happens to target the MC you are simply screwed and have to redo the fight. There is a way to prevent that, but it requires you to use a specific job with a specific skill. This is horrible game design, because you either have to pray to RNG or grind to level up said job. It didn't ruin the experience, but it left a sour taste after an overall excellent game.\r\n\r\n[h1] Steam Deck [/h1]\r\nYakuza 7 runs very well on the deck. Set to 800p/45fps made it so the fans were silent and battery lasted 2-3h. Usually I don't like 3D games on the deck, but this game and Persona 5 were an amazing experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most bizarre story and side quests that I have ever experienced in any video game, this was funny, fun, and wild on so many levels.\n\nHeavily recommend this game to anyone on a weekend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games great so far, the story felt very interesting in the beginning and has gone a little slow since then. This games pacing might be a bit off, but it still feels enjoyable. I'm currently chapter 3... maybe halfway through.. couldn't say since I haven't finished it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kinda late to the party. My first game from the yakuza series and the story is absolute cinema! Its a jrpg and i dont mind learning the mechanics and its actually really fun. Trying to perfect this game. The TFMT is tough. Wish me luck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first time diving into the Yakuza series, and I gave it a shot because I enjoy turn-based RPGs. I wasn’t expecting it to be such a rollercoaster—fun and heartbreaking all at once. It’s seriously an underrated gem. It reminds me of those early 2000s games where developers made stuff out of passion for the players, not just for corporate goals. Also… this game totally made me crave Peking duck, haha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Totally a fantastic game. Both the story and battle mechanics are refreshing for the Yakuza series. And I did enjoy my 130 hours playing (and mainly grinding) this game. \n\n*In my case, in order to max out all jobs for all party members I took out around 643 invested vagabonds (located in the Kamurocho dungeon). As for the weapons, in order to max out the level of 7 weapons, I cleared the 26th - 30th floor of Sotenbori dungeon around 100 times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game just. keeps. expanding.\n\nWasn't sure how much I would like this game. I had never played a Yakuza game before and the trailers back in 2020 just looked to reinforce that it wasn't my type of game. \nBut I love Turn-based games, so I gave it a whirl. \nThis game is nuts.\nThe story is really engaging and reminiscent of a lot of the shadow stuff that happens on the world stage. It also has surprisingly (and hilariously) caused me to reflect on my own life at points.\nEvery time I boot this game up to continue the story, I get wrapped up in all the side content, or even just running around the world. \nAnd the scope of this game is so big; as stated up top, this game just keeps. opening. up.\nThe story, the side content, the... everything... it just keeps getting bigger.\nThis game is dope and I'm only like 69 (nice) percent through the actual story itself\nGet it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel bad for the people who played this as the first game in the series thinking it wouldn't tie into the rest at all.\r\n\r\nIt does, and key moments in the story rely on it. That said, I doubt that they didn't have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game. I was initially concerned with the transition to turn based rpg, but pretty early on into the game I had realized how much fun could come of it. Once you start leveling everyone up and getting new skills and jobs the game just gets so insanely fun to mess around with. I also think the many many interactions between the party members can very entertaining, and I genuinely enjoyed going through every ones drink links. Moving forward in the series, I will watch Ichiban's career with great interest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10. Amazing game. Wacky and lovable characters. Amazing map. And great storyline. Fun to play. Ichiban is now one of my favorite game protagonist of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was recommended to me and purchased for me by a friend. This game - the seventh in the series - is often mentioned as a good entry-point to the massive Yakuza franchise, and I don't have reason to disagree.\n\nBeing my first entry into the franchise, I don't have much knowledge of the world or narrative. Based on the name, marketing and reputation for this game, I formed a misconception that this would be some kind of wacky romp of a story, a-la the later 'Saints Row' games, so I was surprised to instead receive a straight-edged drama full of serious character and passion. The silly-ness is there, don't get me wrong, but it shows itself in the side-stories, random encounters and minigames rather than in the forefront of the game as a whole.\n\nOnce I adjusted to the tone of the story, I then tricked myself for a second time by assuming that I would be involving myself in the creation or development of an underworld organisation or crime family, so you can imagine my surprise when I got to the end of the story and was still essentially homeless - fighting men dressed in garbage bags in the sewers, and searching for cockroaches in the park - almost a side-character in the wider world of the existing yakuza organisations. Cameos and references to other games in the series are evident, even though most of them certainly flew over my head - a swelling orchestral score and a dramatic zoom-in and reveal as a new Japanese man walks into a room gives it away! Saying that, the new protagonist and independent story don't rely on prior franchise knowledge.\n\nI did go through the game using the English dub - I hear that the earlier games in the franchise don't have great voice acting outside of the Japanese originals, but I agree with the general sentiment that the English performances in this rendition are very well done in most instances. The numerous jokes, puns, and creative NPC names that would obviously not be direct translations show a level of care far beyond a simple copy-paste translate job that many C- or J-RPGs rely on.\n\nOn the topic of care, I find the world- and level-designs to have been very well crafted. Based on real Japanese prefectures, the playable spaces are very densely detailed with minimal repetition, and the NPCs and vehicles populating and moving around the environment give it a somewhat genuine feel. I did get slightly annoyed by the distribution of a set of collectibles halfway through the game, forcing me to re-explore many of the nooks and crannies that I had already delved through.\n\nOverall, the game seems to be well made, and runs very well. In my time I only experienced one or two noticeable bugs. If you pay too close attention, you may wish for more variety in some character animations - such as the slow bow-legged walk that everyone in Japan seems to do.\n\nSettle down for some long gameplay sessions. This game includes both long sections of game where Saving is disabled, as well as hour-long cutscenes without warning (or twenty minute cutscenes with one minute of gameplay leading into another twenty minute cutscene). For some reason, there seems to be two or three different levels of production of cutscenes, so halfway through a scene the quality will suddenly lower, or the audio and animation will stop and suddenly the characters are speaking to eachother with freeze frames and text boxes - perhaps a decision to reduce the translation work or an otherwise creative choice, but it feels quite jarring and doesn't seem to align with the high production values of the rest of the story.\n\nThe turn-based fights are fine, but I find myself annoyed by several implemented mechanics. The free 'follow-up' attacks that your party perform outside of your control may do additional damage, but also remove certain status effects from enemies or attract aggro in a way that could be detrimental to the fight. There are a large number of environmental interactions that can occur during fights, such as your character kicking a bin, sign, or bicycle towards an enemy, but more often than not the object misses the enemy or instead hits an ally. You have no control of the movement or positioning of the characters in the fight, making it very difficult to target group- or area- attacks, and have no way to manoeuvre away from similar attacks on your own party. I'm currently grinding towards the post-game battle dungeon 'True Final Millennium Tower', and have found myself up to this point primarily only using basic attacks, although the grinding and levelling system is encouraging me to experiment with different classes and party-formats that I didn't need to change during the story.\n\nOverall, a well made game with a long but engaging story. A good springboard into the franchise, but not the greatest battle mechanics. Not for everyone, but recommended if interested.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "same yakuza energy but with dragon quest turn based combat which i think is an ok changeup from button mashing combat but definitely not a great fit for my playstyle.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the take on turned based combat is fun but does tend to get kind of stale sometimes. really my biggest issue is with the amount of cutscenes and awkward difficulty curb which seem to be a common issues at least for me in the yakuza series. if you've played other games in the series you'll pretty much be walking into the same thing just with a different combat twist, if you haven't played a yakuza game before i think this is a poor starting point to jump into the series and the rest of the games tend to go on sale for pretty cheap all the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolute gem from beginning to end. I'll admit, I HATE fans of this game, I hate what this game is in the context of a soft reboot of a franchise that split the whole community in half because of the change in combat, the change of protagonist and shift in tone for the story on the surface (which ended up proving me completely wrong, the story is amazing!) and yet...I can't get myself to hate this game. This game is a tried and true, earnest and honest story from beginning to end.\n\nIn my 20s, a story about the solidarity of finding friendship at your lowest point and finding purpose in a world unfamiliar to you is incredibly important, and something more people should take solace in in the times we live in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nanba carried, the best character, the best story, the best personality, i mean, who else could you smell from 10 miles away.\nI do think that he's a spiritually israeli IDF agent though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It has a cinematic story, about friends, family, betrayal, and other things. And yeah ton of cracks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "> Doesn't just jump the shark; plays hopscotch with it\n\n## Why\n\n- Absurdly over the top, but can still get you invested in characters\n- You never know what you're gonna get when you start a side quest\n- Entertaining JRPG combat with depth and real-time elements\n- Ichiban is strong candidate for my number one protagonist\n\n## Why Not\n\n- Gets a bit grindier toward the end after mostly avoiding it well\n- Some late game bosses are absolute tanks even if you're levelled appropriately\n\n## Impressions\n\nTrying to predict where Like a Dragon will go next is an exercise in futility. The prologue introduces us to Ichiban, our baseball bat-wielding golden retriever of a protagonist, by having him utterly fail to meet his shakedown quota for the day by helping his intended victims instead. After setting the scene with numerous, extensive cutscenes, the game spares itself constantly trying to justify Ichiban's continued existence as a yakuza by having him take the fall for a senpai and spending 18 years in jail.\n\nUpon release he finds a world entirely unlike the one he left. The clan he used to belong to effectively no longer exists, seemingly betrayed by Ichiban's father figure who's now a prominent figure in the rival clan. In classic Ichiban fashion he immediately makes a beeline for said father-figure, determined to prove he's actually a good guy despite all evidence to the contrary, and catches a bullet for his trouble. Waking up some time later in a homeless encampment he meets the first member of his party, and thus begins his heroic journey!\n\nI really enjoy how much the devs leaned into the switch from beat-em-up to JRPG; it's even given an in-universe justification via Ichiban being a huge Dragon Quest fan and the combat encounters just being his interpretation of fights through that lens. All the classic elements are here; physical attacks, magic with elemental types, gear and classes, but they're all reinterpreted for a modern setting (e.g you gain access to the job system by going to 'Hello Work' and... looking for a job). There's also a bit of added interactivity during the turn based combat; well timed inputs on attacks and blocks will give you bonues damage/negation. This interactivity with the absolutely wild animations for some attacks and creative enemy design keep combat intersting throughout a long, soap opera style story.\n\nThe story definitely works best if you just let yourself be caught up in it without thinking too hard about how/why any of this is happening, though despite its frequent absurdity there are a lot of really touching moments and compelling characters scattered about. Ichiban himself is probably the best of these; his irrepressible optimism and faith along with a... straightforward approach to decision-making make him a force to be reckoned with. He's not naive, he's been around the block and knows how the world works, but he chooses to believe the best of people even if it seems ridiculous. And well, if they don't live up to those expectations, there's always his trusty baseball bat. Your party members all have their own stories as well, especially the core 3. You'll meet some others as the story progresses who are fleshed out to varying degrees, and they're different enough that most players will find at least someone to get attached to.\n\nI'd heard Yakuza side stories were something else, and they definitely lived up to that. The variety in both mechanics and tone is crazy, ranging from helping a little girl collect donations for her sick brother to changing lives with the power of ultra-spicy kimchi and funding the development of a gigantic Roomba (then naturally having to fight it after it turns evil). Each time you reach into the side-story lucky dip you'll find something new, and I definitely went out of my way whenever I saw a new marker pop up just to see what craziness was in store for me next.\n\nI don't know if I'll ever go back to play the (6!) original games in the series, but I'm definitely on the Like a Dragon train going forward. This game wore a lot of hats and pulled them all off with style, keeping me engaged over a ~60 hour runtime and making me hungry for Infinite Wealth to go on sale so I can see where the 一番 protagonist and (hopefully) friends go from here. You're missing out if you don't give this one a try, especially on sale for ~$8.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decided to grab this on sale one day and the game is so fucking good I should have paid full price. The combat is fun, the storyline is amazing, like I'm actually mad I didn't get into this game sooner that's how good it is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun off the wall humor you expect from the Yakuza franchise, wrapped in a familiar turn based style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love shirtless oiled up schizophrenic Japanese men fighting against corruption 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The mad lads at RGG did it, they managed to write a new legend without downplaying the others. The story of Ichiban Kasuga is full of motivation and hope even when you are scraping the barrel. It will make you grin like a madman, laugh, cry and bump your fist on the desk, the typical RGG trope. The story is very well paced, though sometimes you have to halt and go grind for XP and gear to be able to face the next challenge.\r\n\r\nI am still not sold on the turn based combat in this game, although I enjoyed it more than I expected during the initial phase; there are a lot of abilities for each \"job\" of each character but only a handful of them will see any use at any point in the game. Some abilities depend on positioning and with enemies moving at random and you being unable to move your character in combat some abilities cannot be used to their maximum effect. Other than that, the abilities are over the top and well animated, resulting in an overall fun combat experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This world may be full of cynics, but I still want to be Ichiban Kasuga.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so much content and chapters to invest in and unlock i give it a solid score 8.7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Review by [url=https://store.steampowered.com/curator/33369540-Abrix/]Abrix\n Gaming[/url] – 4K quality gameplay reviews and recommendations.[/b]\n\n[b]Yakuza: Like a Dragon – A Bold Reinvention Fueled by Heart, Humor, and the Rise of a New Hero[/b]\n\n[i]Yakuza: Like a Dragon[/i] is not just a new chapter in the Yakuza series — it’s a rebirth. It takes massive creative risks by shifting from real-time brawling to turn-based RPG combat, introducing an entirely new protagonist, and building a story around a fresh cast. And somehow, it succeeds beyond expectations. What emerges is one of the most heartfelt, ambitious, and emotionally powerful RPGs of the past decade.\n\nIchiban Kasuga is a revelation. He’s not Kiryu’s replacement — he’s his own kind of hero. Where Kiryu is stoic, composed, and controlled, Ichiban is wild, passionate, goofy, impulsive, and endlessly optimistic. Left behind by the people he devoted his life to, betrayed by the system he believed in, and thrown into a world that forgot him, Ichiban chooses not bitterness but hope. His compassion and refusal to give up make him instantly lovable — a hero who leads not through fear, but through loyalty and kindness.\n\nThe story balances heavy themes and absurd humor with incredible precision. Homelessness, political corruption, human trafficking, organized crime — the game isn’t afraid to explore harsh social realities, but it never crushes the player under their weight. The emotional journey is cathartic and inspiring, and when the big moments hit, they hit hard. The bond between Ichiban and his party — Adachi, Nanba, Saeko, Joon-gi Han, Zhao, and others — becomes the beating heart of the game. They aren’t just allies; they’re found family.\n\nThe shift to turn-based combat is brilliant. Every skill feels impactful, stylish, and hilarious, blending JRPG strategy with the absurd comedy the series is famous for. Classes (or “jobs”) like Hero, Hostess, Breakdancer, Chef, and Musician are ridiculous in concept but shockingly deep in mechanics. Planning buffs, debuffs, status effects, and combos turns every encounter into a satisfying strategic puzzle. Summons — or “Poundmates” — are some of the funniest and most creative attacks ever seen in the genre.\n\nYokohama is stunning — massive, vibrant, and alive. It is easily one of the richest open worlds in the franchise, full of side quests that range from laugh-out-loud comedy to genuinely emotional character stories. You can feed hungry cats, help struggling businesses, fight street gangs, mentor employees, audition theater actors, drink with party members, or bully seasoned criminals at karaoke. The world constantly rewards curiosity.\n\nSide content is huge and diverse:\n• Dragon Kart racing\n• Restaurant bonding & personality stats\n• Can collecting mini-game\n• Business management simulation (one of the best in the whole series)\n• Underground arena challenges\n• Vocational exam quizzes\n• Dating routes and party bonds\n\nEvery mode is polished, meaningful, and entertaining — nothing feels like filler.\n\nVisually, [i]Like a Dragon[/i] is dramatic and expressive. Character performances are top-tier, cutscenes are cinematic and emotionally charged, and the soundtrack is spectacular — blending dramatic orchestral pieces, triumphant battle anthems, and soulful emotional tracks. The final chapter, the music that accompanies it, and the ending cutscenes combine into one of the most unforgettable finales in modern RPG storytelling.\n\n[i]Yakuza: Like a Dragon[/i] isn’t simply a new direction — it’s proof that change can build legacy rather than erase it. It honors everything the series represents: loyalty, sacrifice, brotherhood, justice, humor, and heart. And it boldly pushes the franchise into the future with a new hero capable of carrying that torch.\n\nIchiban Kasuga doesn’t replace the Dragon of Dojima —\nhe becomes a hero in his own right.\n\nAnd watching him rise is nothing short of extraordinary.\n\nYou can check my gameplay video [b][url=https://www.youtube.com/playlist?list=PLxvWbrDkSJsBU3U2JpHBDda25WiSuDlt9]here[/url][/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Japanese schizophrenic bumps into his friends for 90 hours straight.  Hilarity ensues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "did not expect such good writing in a Yakuza game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a weird mixture of silly things and a serious story, super fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yakuza games sucks  and this is the worst yakuza game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best RPGs of all time and a great start to a new era of like a dragon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice gameplay if you love turn base rpg",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Once you're at rock bottom, the only way forward is up. But the bottom doesn't have to be all dark and gloomy. If you can stand and look up, you'll see the light of hope up there.\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Finished Yakuza Like a Dragon, Love A Female Gang Boss character, The Story feels like a Reinterpretation of Yakuza Kiwami when it comes to the MC and His story, His Father Figures, and his Yakuza Code, and Like a Dragon takes these concepts interesting ways with how sets Ichiban and the Main antagonist who’s more active presence in the story with how he interacts with other characters and how much influence he has compared to Nishiki, Ichiban has to rely on Bonds and other characters to help him in his journey since he sees as an RPG videogame compared to Kiryu who is more of a lone wolf, And they do they him justice with how OP and the Yakuza Jesus he seems and the amount of glaze he gets, Ryo Aoki is a Politician so he needs others to do his dirty work for him and can’t let everything trace back to him and like Nishi wants to rise to the top through any means \r\n\r\nThe Bond System is really good since it reminds me a lot of Persona since it really lets get to know your party members and you get rewarded for with the extra xp and allows character access to other types of jobs and gives plenty of customization options, And there are plenty options to boost the ranks like Convos, battles, and restaurants and makes the game really feel you want to connect with the main cast \r\n\r\n Gameplay takes a lot ideas from Dragon quest and it's fun quirk both for Ichiban as Character in how sees the world and how it engages in combat, The Job System is interesting where you can switch roles but doesn’t reset your stats and progress and you can switch in and out of different job roles and keep your stats at a certain level, leveling up or Job rank up restoring your health and MP like the DQ3 remake \r\n\r\nThe DIfferent types of skills depending on the job have a great amount of variety and you can make certain builds on what style you prioritize over  but it’s difficult to figure what characters are weak to or resistant to and there aren’t any indicators to explain why since your MP attactks have fists, knife type of attacks, and elemental so it’s difficult to figure who is weak to what and the enemy types in this game are varied greatly depending on the story context and area and they may function differently but is still difficult to pin down their behaviours compared to DQ 3 remake where the indicators for the weaknesses are very consistent and simple to figure out\r\n\r\nThe Mix between Real time Combat and Turn Based RPG is an Interesting take with how much the characters can interact with the environment depending on the location and the level design like character being blocked by certain objects and walls, Characters picking up objects to beat others with it, characters rag dolling on other objects \r\n\r\nThe Level Spikes of the Game before fighting Majima and Kiryu were pretty annoying but Majima was less egregious since you had the battle arena to farm for Ranks and Stats and get useful gear from the fights but the same can’t be said for Chap 14 since the Yokahama dungeon enemies would be ranked too low to farm off of \r\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first I was hesitant to try Yakuza in the RPG format but was pleasantly surprised! The amount of content scattered around felt overwhelming initially but was satisfying to chug through. \r\nOne thing that could've been explained better was the Shareholder Meetings in the Management minigame, but thankfully someone on Reddit gave a more in-depth explanation.\r\n\r\nIchiban off jump is very open about his optimistic outlook and wears his heart on his sleeve. He's a good replacement as the mainline protagonist and will earn his spot in the big leagues through sheer will and effort (plus it seems like Kiryu is in the next game so maybe we'll even get some mentorship stuff between the two)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game makes any trip you take to Japan suddenly have 2x times more value.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you're a fan of rpgs, turn-based combat, and a truckload of side quests and activities, then this game is for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very refreshing take on the series and an alright entry point if for some bizarre reason you don't want to play the now easily accessible previous games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Was a bit hesitant with the change of gameplay from the original series but ultimately enjoyed it. Great story, massive roster of wacky enemies and some genuinely touching moments.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a surprising masterpiece. Having gotten the JRPG bug from Exp33 earlier this year, I've gone through Dragon Quest X and Metaphor: ReFantasio before this one, which both were enjoyable in their own right. But to me, this one exceeded them. I loved the theme of rooting for the underdog. This game had some very thought provoking and meaningful messages that it delivered with an insane sense of humour alternating with serious, tear jerking drama (that on occasion bordered a bit on the sappy side, which also was addresed by the game itself). The dialogue was enjoyable and the story line engaging and I watched through every (long) cutscene with interest. All the characters were great personalities that you felt invested in. There were a couple of times where I felt that the protagonist must be the most gullible idiot around and felt some irritation at how much he was willing to forgive some things. These made the plot maybe a tad unbelievable, but hey that's your soap opera drama right there. I'm looking forward to checking out the other Yakuza games after this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game would’ve been a 10/10 if i didn't have to talk to women to progress with the story",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game, love the main char!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "youll be exhausted by the end.\r\n\r\nKeep on living Ichi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love playing as a schizophrenic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a special fucking game, man.........",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really liked beating up bums on streets >:)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is so chill chat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "man FUCK THE CHAPTER 9 FIGHT, Overall loving it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This one made me a fan of the series. \n\nLaughed a lot playing this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't stop simping for Saeko. Help",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak Story, OST & Gameplay.\n❤️",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "made it from rags to riches",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i uninstalled because of ishioda (skill issue)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome having a blast",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fucking good ass game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth every cent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Too much gaming, Mr. Unemployed.\" - Adachi",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best yakuza games i've played",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good   game a must buy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sehr unterhaltsam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "true final tower was a laugh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is tuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jogasso da bexiga",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its aiight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10 holy fuck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Cinema",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Magnificent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a Yakuza, and I'm... Like a Dragon!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "LIKE A WHAT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yakuza... Like a Dragon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best one since 0",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "It very much doesnt fit yakuza series, this game has good story but horrible gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played every Yakuza game, I don't know why the devs decided to switch this game to turn based combat, it ruined the fun for me, I used to play this game specifically because of the fun combat, now that its turn based the gameplay is honestly quite dull. sure many people like turn based titles, but I think to implement it to Yakuza, a game well known for its fun combat mechanics is honestly a huge let down. in my opinion it was a waste of money, atleast let people choose the gameplay style, not just switch it up suddenly. every yakuza game had live combat, I was honestly disappointed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is not for me... I grinded so much and wasn't enough, tried to adjust difficulty so I could keep going just for the story but this option wasn't available and I don't understand why... Its a shame because everything else was good, I was enjoying the story. . .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring RPG combat where you can't walk down a street without getting into at least 4 fights in a row. Cutscenes make these fights take far longer than anything in Kiryu's games. City has almost nothing to do, if you can get there without being bombarded with the most mid JRPG combat you've ever experienced (unless you've played Dragon Quest). Story is FULL of coomer, moral relativist slop; was a real turn off compared to the other games in the series. At least the coomer aspects of yakuza were always optional and tucked away to the side.\n\n Was really looking forward to this game, but after trying to finish it twice, I was just constantly left feeling disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "probably one of the worst turn based jrpgs ive ever played core wise. it got all the funny yakuza stuff we know and love but there's way too much combat and you can in most cases not avoid them and the worst part is it barely gives you any exp/rewards. this game feels like it's playtime got doubled just because of this alone. also providing 2 additional jobs as dlc is just such a low blow when you've already purchased the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay mechanics are okayish and can be fun sometimes. Ending was cheesy, dragged for too long and wasn't really worth it at the end of the day. The Yakuza series has this shit plot twist where \"someone\" would come in after the fight and kill an important character. So sick of this crap. \r\n\r\nEither way, I recommend not wasting time on this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to like this game, but I can't.\nI like turn-based combat and wanted to try a yakuza game, so I got it on sale.\n\nThe main characters are great. \nCool gameplay concepts.\n\nBut, after a while, it just stops being fun.\nSide quests bored me to no end, the main story had good moments, but nothing to keep me that much invested. \nThe absurd attacks stopped making me laugh. The JRPG parody become just become the worst parts of an JRPG : long, grindy, lots of mechanics unused as the difficulty curve mostly* looks like a flatline.\nCombat is boring. You'll overpower most enemies after a certain point, so I stopped trying to improve my strategies, gear, etc...\nAnd then, the [spoiler] Majima & Saejima [/spoiler] fight. Suddenly, a mandatory boss fight has 10 more levels than you. Cool. And you simply lose. Now the game wants to be difficult.\nBefore that, you unlock an area for grinding. I choosed to quit.\n\nI don't think this game is worth it.\nHonestly, I would love to be proven wrong. Maybe I didn't understand some mechanics. But I don't want to trust another promise of 'it gets fun after X hours\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It pains me to write this because I actually like the Yakuza franchise. This game isn't exactly bad I just don't like the most evident change which is the combat. It would been better if turn based was a mini-game not general combat for everything. You have to grind in arenas to become strong enough to beat a story boss. The game got less interesting when returning characters got out of the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As an RPG it´s great. Good classes and abilities, godd combat and progression. As a Yakuza game, it´s a fucking disgrace and should be avoided at all costs. DLC is also hiding 2 Jobs/Classes behind a paywall they are absolutly NOT worth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm starting to burn out on this one. I've certainly gotten some good play time out of it but I have some issues with how it's designed. \n\nYou can't get anywhere without getting dragged into some pointless fight. Just walking a block in the game could result in 2-3 fights. You can't really sneak past enemies. Try to avoid them by going the next street over and there will be more. \n\nParts of the story just drag on and on and on and on... I don't need another conversation about how you are brothers or loyal, or whatever, speed it up.\n\nThe game taunts you by telling you to save, but you can't. Why? The game wants you to go through another cut scene, or ten, first. I swear I've played for an hour or more without the ability to save because I'm in endless strung together cut scenes. This means you can't just play for a few minutes or stop to, you know, live life.\n\nGenerally speaking the game is good. I actually like the battle system. It's got a decent sense of humor. The characters are interesting enough. It's just at 35 hours of play time the story really feels like it should be done. The twists and surprises are just getting annoying at this point. I'm ready to move on but I may never actually get to finish this game because it is apparently unending. I know some people like games that they can commit every waking hour to, I'm just not one of them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Apparently this is a great game? Well if it is, the price of admission is high enough to rate it a thumbs down in my books. Four hours of gameplay and this is what I've experienced:\n\n1. 10 mins of cinematic cutscenes with a vaguely interesting story, bad dialogue and exceptionally awful voice acting\n2. Another couple of minutes of Temu cutscenes where two characters grunt at each other while unvoiced dialogue scrolls across the screen\n3. Briefly wander around a bland, boring environment with nothing to do except make your way to the next objective, suffering through a bunch of awful quasi-random encounter battles along the way\n4. Go back to point 1 and start all over again\n5. Did I mention this goes on for nearly four hours?\n\nThis could be the greatest game ever made and it would still suck just because of how awful the starting experience is.\n\nBonus awfulness points because this is literally how you exit the game:\n1. Enter the pause menu\n2. Go to settings\n3. Select return to title screen (no, there is no exit game option)\n4. Select Yes I want to exit\n5. Select Yes I want to exit (not a typo, you have to do this twice)\n6. Watch four separate unskippable full screen ads\n7. Select exit game \n8. Select yes I want to exit\nWhat the actual f**k is this nonsense?\n\nI plan on continuing playing because it seems like I might just about be at the point where I can actually play the game! But no amount of fun is enough to wipe off the stink of those first four hours so it will forever remain a thumbs down for me. Play if you enjoy games that like to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "WHY every game reach IDIOTIC POINT of design so late that it is not possible to refund and forgeyt this shit?! Developers should be forced to walk through their shit out production  10 times before being paid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm 2.5 hours in and I've had four very easy fights, ran through the streets a few times, and the rest has been an unfathomably boring story. I'd rather watch my faucet drip than play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "having to install a mod to have playstation glyphs show up lmao dog shit game dog shit company",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought the combat system was serviceable until I had to learn the hard way that once the Kasuga dies in combat, despite other party members being alive, it is instant game over. This was in the middle of a seriously long and boring dungeon and I lost all my progress within it. Decided to drop the game there because if the rest of the dungeons in this game are this long with nothing interesting offer, I didn't want to play anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a strange one for me. It started so well, and I really thought my first Yakuza game might get me to buy the others, but once I got past the halfway point, all the issues with the game came up... and they suck.\r\nI am sure there will be many who love the game and everything about it, but the small issues in the first half were nothing compared to the total slog that was to come.\r\n1. The game really wants you to do the bussiness side game, to the point that if you dont, get ready for a very long grinde.\r\n2. The game item pricing starts ok, but later on it gets insane, unless you have done well with the business side game.\r\n3. There are some points where it makes you travlel for 10 mins before you fight a boss, and they dont bother to put a save before the boss.\r\n4. There is a lot of talking...a lot. I thought it would calm down, but nope, it got to the point where I was skipping chatter because of how the story went and the fact that 50% of what they said (after early character development) was just blah blah.\r\n5. The story has a few twists and turns, which again was great, but only early on. It got laughable the longer it went on. Just when you thought who was to blame, \"No, it was I\", then a bit longer \", Ha, I think you will find that I did it\", and later  \", Actually, it was us who brought about the\" Again, this happened so many times that it just got old, and I gave up.\r\n\r\nThere are more issues, but I don't want to waste any more time on these. I should have started with Infinite Wealth? The first half of the game is good, even perfect, but as it goes on, the minor cracks get bigger and bigger.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game does not respect your time. I've played all other Yakuza games leading up to this point and I play to experience the story and then I pass onto the next game and that's not really possible here. I'm feeling the need to go through the dungeon and grind because they want to pad out play time and drag everything on to make this a 50 hour game. I'm quitting and moving onto the next, genuinely infuriating combat system with encounters taking way too long, only to have more random enemies spawn 3 feet away from you and pull you into another encouter. To put it into perspective all my characters are level 21 and we're against 5 level 12 enemies, using the auto feature with no abilities it took 5 minutes to kill them all, the turns simply take too long to play out. Once I finished that encounter another group of 5 was right around the corner sitting where I needed to go. You win, I quit.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if ur playing the yakuza games in chronological order, it might not be for you. pacing is genuinely garbage, turn based combat is really different. dont get me wrong, ichiban is likable and a cool mc but the game just genuinely drags out to the point where its not really interesting anymore",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game, but I can't.\nI like turn-based combat and wanted to try a yakuza game, so I got it on sale.\n\nThe main characters are great. \nCool gameplay concepts.\n\nBut, after a while, it just stops being fun.\nSide quests bored me to no end, the main story had good moments, but nothing to keep me that much invested. \nThe absurd attacks stopped making me laugh. The JRPG parody become just become the worst parts of an JRPG : long, grindy, lots of mechanics unused as the difficulty curve mostly* looks like a flatline.\nCombat is boring. You'll overpower most enemies after a certain point, so I stopped trying to improve my strategies, gear, etc...\nAnd then, the [spoiler] Majima & Saejima [/spoiler] fight. Suddenly, a mandatory boss fight has 10 more levels than you. Cool. And you simply lose. Now the game wants to be difficult.\nBefore that, you unlock an area for grinding. I choosed to quit.\n\nI don't think this game is worth it.\nHonestly, I would love to be proven wrong. Maybe I didn't understand some mechanics. But I don't want to trust another promise of 'it gets fun after X hours\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It pains me to write this because I actually like the Yakuza franchise. This game isn't exactly bad I just don't like the most evident change which is the combat. It would been better if turn based was a mini-game not general combat for everything. You have to grind in arenas to become strong enough to beat a story boss. The game got less interesting when returning characters got out of the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It very much doesnt fit yakuza series, this game has good story but horrible gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As an RPG it´s great. Good classes and abilities, godd combat and progression. As a Yakuza game, it´s a fucking disgrace and should be avoided at all costs. DLC is also hiding 2 Jobs/Classes behind a paywall they are absolutly NOT worth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played every Yakuza game, I don't know why the devs decided to switch this game to turn based combat, it ruined the fun for me, I used to play this game specifically because of the fun combat, now that its turn based the gameplay is honestly quite dull. sure many people like turn based titles, but I think to implement it to Yakuza, a game well known for its fun combat mechanics is honestly a huge let down. in my opinion it was a waste of money, atleast let people choose the gameplay style, not just switch it up suddenly. every yakuza game had live combat, I was honestly disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm starting to burn out on this one. I've certainly gotten some good play time out of it but I have some issues with how it's designed. \n\nYou can't get anywhere without getting dragged into some pointless fight. Just walking a block in the game could result in 2-3 fights. You can't really sneak past enemies. Try to avoid them by going the next street over and there will be more. \n\nParts of the story just drag on and on and on and on... I don't need another conversation about how you are brothers or loyal, or whatever, speed it up.\n\nThe game taunts you by telling you to save, but you can't. Why? The game wants you to go through another cut scene, or ten, first. I swear I've played for an hour or more without the ability to save because I'm in endless strung together cut scenes. This means you can't just play for a few minutes or stop to, you know, live life.\n\nGenerally speaking the game is good. I actually like the battle system. It's got a decent sense of humor. The characters are interesting enough. It's just at 35 hours of play time the story really feels like it should be done. The twists and surprises are just getting annoying at this point. I'm ready to move on but I may never actually get to finish this game because it is apparently unending. I know some people like games that they can commit every waking hour to, I'm just not one of them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay mechanics are okayish and can be fun sometimes. Ending was cheesy, dragged for too long and wasn't really worth it at the end of the day. The Yakuza series has this shit plot twist where \"someone\" would come in after the fight and kill an important character. So sick of this crap. \r\n\r\nEither way, I recommend not wasting time on this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Apparently this is a great game? Well if it is, the price of admission is high enough to rate it a thumbs down in my books. Four hours of gameplay and this is what I've experienced:\n\n1. 10 mins of cinematic cutscenes with a vaguely interesting story, bad dialogue and exceptionally awful voice acting\n2. Another couple of minutes of Temu cutscenes where two characters grunt at each other while unvoiced dialogue scrolls across the screen\n3. Briefly wander around a bland, boring environment with nothing to do except make your way to the next objective, suffering through a bunch of awful quasi-random encounter battles along the way\n4. Go back to point 1 and start all over again\n5. Did I mention this goes on for nearly four hours?\n\nThis could be the greatest game ever made and it would still suck just because of how awful the starting experience is.\n\nBonus awfulness points because this is literally how you exit the game:\n1. Enter the pause menu\n2. Go to settings\n3. Select return to title screen (no, there is no exit game option)\n4. Select Yes I want to exit\n5. Select Yes I want to exit (not a typo, you have to do this twice)\n6. Watch four separate unskippable full screen ads\n7. Select exit game \n8. Select yes I want to exit\nWhat the actual f**k is this nonsense?\n\nI plan on continuing playing because it seems like I might just about be at the point where I can actually play the game! But no amount of fun is enough to wipe off the stink of those first four hours so it will forever remain a thumbs down for me. Play if you enjoy games that like to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "having to install a mod to have playstation glyphs show up lmao dog shit game dog shit company",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WHY every game reach IDIOTIC POINT of design so late that it is not possible to refund and forgeyt this shit?! Developers should be forced to walk through their shit out production  10 times before being paid.\nUPDATE (+15 hours) This shit is even  shittier with endles combat that you can not loss (because you have healer and its magic points are recovered by physical attack) but to finish it you need 100 rounds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm 2.5 hours in and I've had four very easy fights, ran through the streets a few times, and the rest has been an unfathomably boring story. I'd rather watch my faucet drip than play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls only respond 10% of the time.  Most of the time you have to restart and fight 10 to 15 times to actually succeed.  \n\nYou would think a game that has been out this long, they would fixed it, but apparently they are just as lazy as all other game developers, with the ONLY exception of ConcernedApe\n\nAt least he actually made a game that works correctly.  \n\nPut in a bit more time.  Its Shit. Total Shit.   Got to Chapter 3, game crashed during the Can Collection feature, and now the saves are corrupted, so I would have to start back from the beginning.   \n\nWhat a waste of game, and it took longer than 2 hours to find out how bad it was, so i cant get my money back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought the combat system was serviceable until I had to learn the hard way that once the Kasuga dies in combat, despite other party members being alive, it is instant game over. This was in the middle of a seriously long and boring dungeon and I lost all my progress within it. Decided to drop the game there because if the rest of the dungeons in this game are this long with nothing interesting offer, I didn't want to play anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a strange one for me. It started so well, and I really thought my first Yakuza game might get me to buy the others, but once I got past the halfway point, all the issues with the game came up... and they suck.\r\nI am sure there will be many who love the game and everything about it, but the small issues in the first half were nothing compared to the total slog that was to come.\r\n1. The game really wants you to do the bussiness side game, to the point that if you dont, get ready for a very long grinde.\r\n2. The game item pricing starts ok, but later on it gets insane, unless you have done well with the business side game.\r\n3. There are some points where it makes you travlel for 10 mins before you fight a boss, and they dont bother to put a save before the boss.\r\n4. There is a lot of talking...a lot. I thought it would calm down, but nope, it got to the point where I was skipping chatter because of how the story went and the fact that 50% of what they said (after early character development) was just blah blah.\r\n5. The story has a few twists and turns, which again was great, but only early on. It got laughable the longer it went on. Just when you thought who was to blame, \"No, it was I\", then a bit longer \", Ha, I think you will find that I did it\", and later  \", Actually, it was us who brought about the\" Again, this happened so many times that it just got old, and I gave up.\r\n\r\nThere are more issues, but I don't want to waste any more time on these. I should have started with Infinite Wealth? The first half of the game is good, even perfect, but as it goes on, the minor cracks get bigger and bigger.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game does not respect your time. I've played all other Yakuza games leading up to this point and I play to experience the story and then I pass onto the next game and that's not really possible here. I'm feeling the need to go through the dungeon and grind because they want to pad out play time and drag everything on to make this a 50 hour game. I'm quitting and moving onto the next, genuinely infuriating combat system with encounters taking way too long, only to have more random enemies spawn 3 feet away from you and pull you into another encouter. To put it into perspective all my characters are level 21 and we're against 5 level 12 enemies, using the auto feature with no abilities it took 5 minutes to kill them all, the turns simply take too long to play out. Once I finished that encounter another group of 5 was right around the corner sitting where I needed to go. You win, I quit.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if ur playing the yakuza games in chronological order, it might not be for you. pacing is genuinely garbage, turn based combat is really different. dont get me wrong, ichiban is likable and a cool mc but the game just genuinely drags out to the point where its not really interesting anymore",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game, but I can't.\nI like turn-based combat and wanted to try a yakuza game, so I got it on sale.\n\nThe main characters are great. \nCool gameplay concepts.\n\nBut, after a while, it just stops being fun.\nSide quests bored me to no end, the main story had good moments, but nothing to keep me that much invested. \nThe absurd attacks stopped making me laugh. The JRPG parody become just become the worst parts of an JRPG : long, grindy, lots of mechanics unused as the difficulty curve mostly* looks like a flatline.\nCombat is boring. You'll overpower most enemies after a certain point, so I stopped trying to improve my strategies, gear, etc...\nAnd then, the [spoiler] Majima & Saejima [/spoiler] fight. Suddenly, a mandatory boss fight has 10 more levels than you. Cool. And you simply lose. Now the game wants to be difficult.\nBefore that, you unlock an area for grinding. I choosed to quit.\n\nI don't think this game is worth it.\nHonestly, I would love to be proven wrong. Maybe I didn't understand some mechanics. But I don't want to trust another promise of 'it gets fun after X hours\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It pains me to write this because I actually like the Yakuza franchise. This game isn't exactly bad I just don't like the most evident change which is the combat. It would been better if turn based was a mini-game not general combat for everything. You have to grind in arenas to become strong enough to beat a story boss. The game got less interesting when returning characters got out of the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It very much doesnt fit yakuza series, this game has good story but horrible gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As an RPG it´s great. Good classes and abilities, godd combat and progression. As a Yakuza game, it´s a fucking disgrace and should be avoided at all costs. DLC is also hiding 2 Jobs/Classes behind a paywall they are absolutly NOT worth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played every Yakuza game, I don't know why the devs decided to switch this game to turn based combat, it ruined the fun for me, I used to play this game specifically because of the fun combat, now that its turn based the gameplay is honestly quite dull. sure many people like turn based titles, but I think to implement it to Yakuza, a game well known for its fun combat mechanics is honestly a huge let down. in my opinion it was a waste of money, atleast let people choose the gameplay style, not just switch it up suddenly. every yakuza game had live combat, I was honestly disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm starting to burn out on this one. I've certainly gotten some good play time out of it but I have some issues with how it's designed. \n\nYou can't get anywhere without getting dragged into some pointless fight. Just walking a block in the game could result in 2-3 fights. You can't really sneak past enemies. Try to avoid them by going the next street over and there will be more. \n\nParts of the story just drag on and on and on and on... I don't need another conversation about how you are brothers or loyal, or whatever, speed it up.\n\nThe game taunts you by telling you to save, but you can't. Why? The game wants you to go through another cut scene, or ten, first. I swear I've played for an hour or more without the ability to save because I'm in endless strung together cut scenes. This means you can't just play for a few minutes or stop to, you know, live life.\n\nGenerally speaking the game is good. I actually like the battle system. It's got a decent sense of humor. The characters are interesting enough. It's just at 35 hours of play time the story really feels like it should be done. The twists and surprises are just getting annoying at this point. I'm ready to move on but I may never actually get to finish this game because it is apparently unending. I know some people like games that they can commit every waking hour to, I'm just not one of them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay mechanics are okayish and can be fun sometimes. Ending was cheesy, dragged for too long and wasn't really worth it at the end of the day. The Yakuza series has this shit plot twist where \"someone\" would come in after the fight and kill an important character. So sick of this crap. \r\n\r\nEither way, I recommend not wasting time on this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Apparently this is a great game? Well if it is, the price of admission is high enough to rate it a thumbs down in my books. Four hours of gameplay and this is what I've experienced:\n\n1. 10 mins of cinematic cutscenes with a vaguely interesting story, bad dialogue and exceptionally awful voice acting\n2. Another couple of minutes of Temu cutscenes where two characters grunt at each other while unvoiced dialogue scrolls across the screen\n3. Briefly wander around a bland, boring environment with nothing to do except make your way to the next objective, suffering through a bunch of awful quasi-random encounter battles along the way\n4. Go back to point 1 and start all over again\n5. Did I mention this goes on for nearly four hours?\n\nThis could be the greatest game ever made and it would still suck just because of how awful the starting experience is.\n\nBonus awfulness points because this is literally how you exit the game:\n1. Enter the pause menu\n2. Go to settings\n3. Select return to title screen (no, there is no exit game option)\n4. Select Yes I want to exit\n5. Select Yes I want to exit (not a typo, you have to do this twice)\n6. Watch four separate unskippable full screen ads\n7. Select exit game \n8. Select yes I want to exit\nWhat the actual f**k is this nonsense?\n\nI plan on continuing playing because it seems like I might just about be at the point where I can actually play the game! But no amount of fun is enough to wipe off the stink of those first four hours so it will forever remain a thumbs down for me. Play if you enjoy games that like to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "having to install a mod to have playstation glyphs show up lmao dog shit game dog shit company",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WHY every game reach IDIOTIC POINT of design so late that it is not possible to refund and forgeyt this shit?! Developers should be forced to walk through their shit out production  10 times before being paid.\nUPDATE (+15 hours) This shit is even  shittier with endles combat that you can not loss (because you have healer and its magic points are recovered by physical attack) but to finish it you need 100 rounds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm 2.5 hours in and I've had four very easy fights, ran through the streets a few times, and the rest has been an unfathomably boring story. I'd rather watch my faucet drip than play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls only respond 10% of the time.  Most of the time you have to restart and fight 10 to 15 times to actually succeed.  \n\nYou would think a game that has been out this long, they would fixed it, but apparently they are just as lazy as all other game developers, with the ONLY exception of ConcernedApe\n\nAt least he actually made a game that works correctly.  \n\nPut in a bit more time.  Its Shit. Total Shit.   Got to Chapter 3, game crashed during the Can Collection feature, and now the saves are corrupted, so I would have to start back from the beginning.   \n\nWhat a waste of game, and it took longer than 2 hours to find out how bad it was, so i cant get my money back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought the combat system was serviceable until I had to learn the hard way that once the Kasuga dies in combat, despite other party members being alive, it is instant game over. This was in the middle of a seriously long and boring dungeon and I lost all my progress within it. Decided to drop the game there because if the rest of the dungeons in this game are this long with nothing interesting offer, I didn't want to play anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a strange one for me. It started so well, and I really thought my first Yakuza game might get me to buy the others, but once I got past the halfway point, all the issues with the game came up... and they suck.\r\nI am sure there will be many who love the game and everything about it, but the small issues in the first half were nothing compared to the total slog that was to come.\r\n1. The game really wants you to do the bussiness side game, to the point that if you dont, get ready for a very long grinde.\r\n2. The game item pricing starts ok, but later on it gets insane, unless you have done well with the business side game.\r\n3. There are some points where it makes you travlel for 10 mins before you fight a boss, and they dont bother to put a save before the boss.\r\n4. There is a lot of talking...a lot. I thought it would calm down, but nope, it got to the point where I was skipping chatter because of how the story went and the fact that 50% of what they said (after early character development) was just blah blah.\r\n5. The story has a few twists and turns, which again was great, but only early on. It got laughable the longer it went on. Just when you thought who was to blame, \"No, it was I\", then a bit longer \", Ha, I think you will find that I did it\", and later  \", Actually, it was us who brought about the\" Again, this happened so many times that it just got old, and I gave up.\r\n\r\nThere are more issues, but I don't want to waste any more time on these. I should have started with Infinite Wealth? The first half of the game is good, even perfect, but as it goes on, the minor cracks get bigger and bigger.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game does not respect your time. I've played all other Yakuza games leading up to this point and I play to experience the story and then I pass onto the next game and that's not really possible here. I'm feeling the need to go through the dungeon and grind because they want to pad out play time and drag everything on to make this a 50 hour game. I'm quitting and moving onto the next, genuinely infuriating combat system with encounters taking way too long, only to have more random enemies spawn 3 feet away from you and pull you into another encouter. To put it into perspective all my characters are level 21 and we're against 5 level 12 enemies, using the auto feature with no abilities it took 5 minutes to kill them all, the turns simply take too long to play out. Once I finished that encounter another group of 5 was right around the corner sitting where I needed to go. You win, I quit.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if ur playing the yakuza games in chronological order, it might not be for you. pacing is genuinely garbage, turn based combat is really different. dont get me wrong, ichiban is likable and a cool mc but the game just genuinely drags out to the point where its not really interesting anymore",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game, but I can't.\nI like turn-based combat and wanted to try a yakuza game, so I got it on sale.\n\nThe main characters are great. \nCool gameplay concepts.\n\nBut, after a while, it just stops being fun.\nSide quests bored me to no end, the main story had good moments, but nothing to keep me that much invested. \nThe absurd attacks stopped making me laugh. The JRPG parody become just become the worst parts of an JRPG : long, grindy, lots of mechanics unused as the difficulty curve mostly* looks like a flatline.\nCombat is boring. You'll overpower most enemies after a certain point, so I stopped trying to improve my strategies, gear, etc...\nAnd then, the [spoiler] Majima & Saejima [/spoiler] fight. Suddenly, a mandatory boss fight has 10 more levels than you. Cool. And you simply lose. Now the game wants to be difficult.\nBefore that, you unlock an area for grinding. I choosed to quit.\n\nI don't think this game is worth it.\nHonestly, I would love to be proven wrong. Maybe I didn't understand some mechanics. But I don't want to trust another promise of 'it gets fun after X hours\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It pains me to write this because I actually like the Yakuza franchise. This game isn't exactly bad I just don't like the most evident change which is the combat. It would been better if turn based was a mini-game not general combat for everything. You have to grind in arenas to become strong enough to beat a story boss. The game got less interesting when returning characters got out of the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It very much doesnt fit yakuza series, this game has good story but horrible gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As an RPG it´s great. Good classes and abilities, godd combat and progression. As a Yakuza game, it´s a fucking disgrace and should be avoided at all costs. DLC is also hiding 2 Jobs/Classes behind a paywall they are absolutly NOT worth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played every Yakuza game, I don't know why the devs decided to switch this game to turn based combat, it ruined the fun for me, I used to play this game specifically because of the fun combat, now that its turn based the gameplay is honestly quite dull. sure many people like turn based titles, but I think to implement it to Yakuza, a game well known for its fun combat mechanics is honestly a huge let down. in my opinion it was a waste of money, atleast let people choose the gameplay style, not just switch it up suddenly. every yakuza game had live combat, I was honestly disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm starting to burn out on this one. I've certainly gotten some good play time out of it but I have some issues with how it's designed. \n\nYou can't get anywhere without getting dragged into some pointless fight. Just walking a block in the game could result in 2-3 fights. You can't really sneak past enemies. Try to avoid them by going the next street over and there will be more. \n\nParts of the story just drag on and on and on and on... I don't need another conversation about how you are brothers or loyal, or whatever, speed it up.\n\nThe game taunts you by telling you to save, but you can't. Why? The game wants you to go through another cut scene, or ten, first. I swear I've played for an hour or more without the ability to save because I'm in endless strung together cut scenes. This means you can't just play for a few minutes or stop to, you know, live life.\n\nGenerally speaking the game is good. I actually like the battle system. It's got a decent sense of humor. The characters are interesting enough. It's just at 35 hours of play time the story really feels like it should be done. The twists and surprises are just getting annoying at this point. I'm ready to move on but I may never actually get to finish this game because it is apparently unending. I know some people like games that they can commit every waking hour to, I'm just not one of them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay mechanics are okayish and can be fun sometimes. Ending was cheesy, dragged for too long and wasn't really worth it at the end of the day. The Yakuza series has this shit plot twist where \"someone\" would come in after the fight and kill an important character. So sick of this crap. \r\n\r\nEither way, I recommend not wasting time on this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Apparently this is a great game? Well if it is, the price of admission is high enough to rate it a thumbs down in my books. Four hours of gameplay and this is what I've experienced:\n\n1. 10 mins of cinematic cutscenes with a vaguely interesting story, bad dialogue and exceptionally awful voice acting\n2. Another couple of minutes of Temu cutscenes where two characters grunt at each other while unvoiced dialogue scrolls across the screen\n3. Briefly wander around a bland, boring environment with nothing to do except make your way to the next objective, suffering through a bunch of awful quasi-random encounter battles along the way\n4. Go back to point 1 and start all over again\n5. Did I mention this goes on for nearly four hours?\n\nThis could be the greatest game ever made and it would still suck just because of how awful the starting experience is.\n\nBonus awfulness points because this is literally how you exit the game:\n1. Enter the pause menu\n2. Go to settings\n3. Select return to title screen (no, there is no exit game option)\n4. Select Yes I want to exit\n5. Select Yes I want to exit (not a typo, you have to do this twice)\n6. Watch four separate unskippable full screen ads\n7. Select exit game \n8. Select yes I want to exit\nWhat the actual f**k is this nonsense?\n\nI plan on continuing playing because it seems like I might just about be at the point where I can actually play the game! But no amount of fun is enough to wipe off the stink of those first four hours so it will forever remain a thumbs down for me. Play if you enjoy games that like to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "having to install a mod to have playstation glyphs show up lmao dog shit game dog shit company",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WHY every game reach IDIOTIC POINT of design so late that it is not possible to refund and forgeyt this shit?! Developers should be forced to walk through their shit out production  10 times before being paid.\nUPDATE (+15 hours) This shit is even  shittier with endles combat that you can not loss (because you have healer and its magic points are recovered by physical attack) but to finish it you need 100 rounds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm 2.5 hours in and I've had four very easy fights, ran through the streets a few times, and the rest has been an unfathomably boring story. I'd rather watch my faucet drip than play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls only respond 10% of the time.  Most of the time you have to restart and fight 10 to 15 times to actually succeed.  \n\nYou would think a game that has been out this long, they would fixed it, but apparently they are just as lazy as all other game developers, with the ONLY exception of ConcernedApe\n\nAt least he actually made a game that works correctly.  \n\nPut in a bit more time.  Its Shit. Total Shit.   Got to Chapter 3, game crashed during the Can Collection feature, and now the saves are corrupted, so I would have to start back from the beginning.   \n\nWhat a waste of game, and it took longer than 2 hours to find out how bad it was, so i cant get my money back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought the combat system was serviceable until I had to learn the hard way that once the Kasuga dies in combat, despite other party members being alive, it is instant game over. This was in the middle of a seriously long and boring dungeon and I lost all my progress within it. Decided to drop the game there because if the rest of the dungeons in this game are this long with nothing interesting offer, I didn't want to play anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a strange one for me. It started so well, and I really thought my first Yakuza game might get me to buy the others, but once I got past the halfway point, all the issues with the game came up... and they suck.\r\nI am sure there will be many who love the game and everything about it, but the small issues in the first half were nothing compared to the total slog that was to come.\r\n1. The game really wants you to do the bussiness side game, to the point that if you dont, get ready for a very long grinde.\r\n2. The game item pricing starts ok, but later on it gets insane, unless you have done well with the business side game.\r\n3. There are some points where it makes you travlel for 10 mins before you fight a boss, and they dont bother to put a save before the boss.\r\n4. There is a lot of talking...a lot. I thought it would calm down, but nope, it got to the point where I was skipping chatter because of how the story went and the fact that 50% of what they said (after early character development) was just blah blah.\r\n5. The story has a few twists and turns, which again was great, but only early on. It got laughable the longer it went on. Just when you thought who was to blame, \"No, it was I\", then a bit longer \", Ha, I think you will find that I did it\", and later  \", Actually, it was us who brought about the\" Again, this happened so many times that it just got old, and I gave up.\r\n\r\nThere are more issues, but I don't want to waste any more time on these. I should have started with Infinite Wealth? The first half of the game is good, even perfect, but as it goes on, the minor cracks get bigger and bigger.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game does not respect your time. I've played all other Yakuza games leading up to this point and I play to experience the story and then I pass onto the next game and that's not really possible here. I'm feeling the need to go through the dungeon and grind because they want to pad out play time and drag everything on to make this a 50 hour game. I'm quitting and moving onto the next, genuinely infuriating combat system with encounters taking way too long, only to have more random enemies spawn 3 feet away from you and pull you into another encouter. To put it into perspective all my characters are level 21 and we're against 5 level 12 enemies, using the auto feature with no abilities it took 5 minutes to kill them all, the turns simply take too long to play out. Once I finished that encounter another group of 5 was right around the corner sitting where I needed to go. You win, I quit.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if ur playing the yakuza games in chronological order, it might not be for you. pacing is genuinely garbage, turn based combat is really different. dont get me wrong, ichiban is likable and a cool mc but the game just genuinely drags out to the point where its not really interesting anymore",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game, but I can't.\nI like turn-based combat and wanted to try a yakuza game, so I got it on sale.\n\nThe main characters are great. \nCool gameplay concepts.\n\nBut, after a while, it just stops being fun.\nSide quests bored me to no end, the main story had good moments, but nothing to keep me that much invested. \nThe absurd attacks stopped making me laugh. The JRPG parody become just become the worst parts of an JRPG : long, grindy, lots of mechanics unused as the difficulty curve mostly* looks like a flatline.\nCombat is boring. You'll overpower most enemies after a certain point, so I stopped trying to improve my strategies, gear, etc...\nAnd then, the [spoiler] Majima & Saejima [/spoiler] fight. Suddenly, a mandatory boss fight has 10 more levels than you. Cool. And you simply lose. Now the game wants to be difficult.\nBefore that, you unlock an area for grinding. I choosed to quit.\n\nI don't think this game is worth it.\nHonestly, I would love to be proven wrong. Maybe I didn't understand some mechanics. But I don't want to trust another promise of 'it gets fun after X hours\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It pains me to write this because I actually like the Yakuza franchise. This game isn't exactly bad I just don't like the most evident change which is the combat. It would been better if turn based was a mini-game not general combat for everything. You have to grind in arenas to become strong enough to beat a story boss. The game got less interesting when returning characters got out of the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It very much doesnt fit yakuza series, this game has good story but horrible gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As an RPG it´s great. Good classes and abilities, godd combat and progression. As a Yakuza game, it´s a fucking disgrace and should be avoided at all costs. DLC is also hiding 2 Jobs/Classes behind a paywall they are absolutly NOT worth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played every Yakuza game, I don't know why the devs decided to switch this game to turn based combat, it ruined the fun for me, I used to play this game specifically because of the fun combat, now that its turn based the gameplay is honestly quite dull. sure many people like turn based titles, but I think to implement it to Yakuza, a game well known for its fun combat mechanics is honestly a huge let down. in my opinion it was a waste of money, atleast let people choose the gameplay style, not just switch it up suddenly. every yakuza game had live combat, I was honestly disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm starting to burn out on this one. I've certainly gotten some good play time out of it but I have some issues with how it's designed. \n\nYou can't get anywhere without getting dragged into some pointless fight. Just walking a block in the game could result in 2-3 fights. You can't really sneak past enemies. Try to avoid them by going the next street over and there will be more. \n\nParts of the story just drag on and on and on and on... I don't need another conversation about how you are brothers or loyal, or whatever, speed it up.\n\nThe game taunts you by telling you to save, but you can't. Why? The game wants you to go through another cut scene, or ten, first. I swear I've played for an hour or more without the ability to save because I'm in endless strung together cut scenes. This means you can't just play for a few minutes or stop to, you know, live life.\n\nGenerally speaking the game is good. I actually like the battle system. It's got a decent sense of humor. The characters are interesting enough. It's just at 35 hours of play time the story really feels like it should be done. The twists and surprises are just getting annoying at this point. I'm ready to move on but I may never actually get to finish this game because it is apparently unending. I know some people like games that they can commit every waking hour to, I'm just not one of them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay mechanics are okayish and can be fun sometimes. Ending was cheesy, dragged for too long and wasn't really worth it at the end of the day. The Yakuza series has this shit plot twist where \"someone\" would come in after the fight and kill an important character. So sick of this crap. \r\n\r\nEither way, I recommend not wasting time on this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Apparently this is a great game? Well if it is, the price of admission is high enough to rate it a thumbs down in my books. Four hours of gameplay and this is what I've experienced:\n\n1. 10 mins of cinematic cutscenes with a vaguely interesting story, bad dialogue and exceptionally awful voice acting\n2. Another couple of minutes of Temu cutscenes where two characters grunt at each other while unvoiced dialogue scrolls across the screen\n3. Briefly wander around a bland, boring environment with nothing to do except make your way to the next objective, suffering through a bunch of awful quasi-random encounter battles along the way\n4. Go back to point 1 and start all over again\n5. Did I mention this goes on for nearly four hours?\n\nThis could be the greatest game ever made and it would still suck just because of how awful the starting experience is.\n\nBonus awfulness points because this is literally how you exit the game:\n1. Enter the pause menu\n2. Go to settings\n3. Select return to title screen (no, there is no exit game option)\n4. Select Yes I want to exit\n5. Select Yes I want to exit (not a typo, you have to do this twice)\n6. Watch four separate unskippable full screen ads\n7. Select exit game \n8. Select yes I want to exit\nWhat the actual f**k is this nonsense?\n\nI plan on continuing playing because it seems like I might just about be at the point where I can actually play the game! But no amount of fun is enough to wipe off the stink of those first four hours so it will forever remain a thumbs down for me. Play if you enjoy games that like to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "having to install a mod to have playstation glyphs show up lmao dog shit game dog shit company",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WHY every game reach IDIOTIC POINT of design so late that it is not possible to refund and forgeyt this shit?! Developers should be forced to walk through their shit out production  10 times before being paid.\nUPDATE (+15 hours) This shit is even  shittier with endles combat that you can not loss (because you have healer and its magic points are recovered by physical attack) but to finish it you need 100 rounds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm 2.5 hours in and I've had four very easy fights, ran through the streets a few times, and the rest has been an unfathomably boring story. I'd rather watch my faucet drip than play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls only respond 10% of the time.  Most of the time you have to restart and fight 10 to 15 times to actually succeed.  \n\nYou would think a game that has been out this long, they would fixed it, but apparently they are just as lazy as all other game developers, with the ONLY exception of ConcernedApe\n\nAt least he actually made a game that works correctly.  \n\nPut in a bit more time.  Its Shit. Total Shit.   Got to Chapter 3, game crashed during the Can Collection feature, and now the saves are corrupted, so I would have to start back from the beginning.   \n\nWhat a waste of game, and it took longer than 2 hours to find out how bad it was, so i cant get my money back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought the combat system was serviceable until I had to learn the hard way that once the Kasuga dies in combat, despite other party members being alive, it is instant game over. This was in the middle of a seriously long and boring dungeon and I lost all my progress within it. Decided to drop the game there because if the rest of the dungeons in this game are this long with nothing interesting offer, I didn't want to play anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a strange one for me. It started so well, and I really thought my first Yakuza game might get me to buy the others, but once I got past the halfway point, all the issues with the game came up... and they suck.\r\nI am sure there will be many who love the game and everything about it, but the small issues in the first half were nothing compared to the total slog that was to come.\r\n1. The game really wants you to do the bussiness side game, to the point that if you dont, get ready for a very long grinde.\r\n2. The game item pricing starts ok, but later on it gets insane, unless you have done well with the business side game.\r\n3. There are some points where it makes you travlel for 10 mins before you fight a boss, and they dont bother to put a save before the boss.\r\n4. There is a lot of talking...a lot. I thought it would calm down, but nope, it got to the point where I was skipping chatter because of how the story went and the fact that 50% of what they said (after early character development) was just blah blah.\r\n5. The story has a few twists and turns, which again was great, but only early on. It got laughable the longer it went on. Just when you thought who was to blame, \"No, it was I\", then a bit longer \", Ha, I think you will find that I did it\", and later  \", Actually, it was us who brought about the\" Again, this happened so many times that it just got old, and I gave up.\r\n\r\nThere are more issues, but I don't want to waste any more time on these. I should have started with Infinite Wealth? The first half of the game is good, even perfect, but as it goes on, the minor cracks get bigger and bigger.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game does not respect your time. I've played all other Yakuza games leading up to this point and I play to experience the story and then I pass onto the next game and that's not really possible here. I'm feeling the need to go through the dungeon and grind because they want to pad out play time and drag everything on to make this a 50 hour game. I'm quitting and moving onto the next, genuinely infuriating combat system with encounters taking way too long, only to have more random enemies spawn 3 feet away from you and pull you into another encouter. To put it into perspective all my characters are level 21 and we're against 5 level 12 enemies, using the auto feature with no abilities it took 5 minutes to kill them all, the turns simply take too long to play out. Once I finished that encounter another group of 5 was right around the corner sitting where I needed to go. You win, I quit.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if ur playing the yakuza games in chronological order, it might not be for you. pacing is genuinely garbage, turn based combat is really different. dont get me wrong, ichiban is likable and a cool mc but the game just genuinely drags out to the point where its not really interesting anymore",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game, but I can't.\nI like turn-based combat and wanted to try a yakuza game, so I got it on sale.\n\nThe main characters are great. \nCool gameplay concepts.\n\nBut, after a while, it just stops being fun.\nSide quests bored me to no end, the main story had good moments, but nothing to keep me that much invested. \nThe absurd attacks stopped making me laugh. The JRPG parody become just become the worst parts of an JRPG : long, grindy, lots of mechanics unused as the difficulty curve mostly* looks like a flatline.\nCombat is boring. You'll overpower most enemies after a certain point, so I stopped trying to improve my strategies, gear, etc...\nAnd then, the [spoiler] Majima & Saejima [/spoiler] fight. Suddenly, a mandatory boss fight has 10 more levels than you. Cool. And you simply lose. Now the game wants to be difficult.\nBefore that, you unlock an area for grinding. I choosed to quit.\n\nI don't think this game is worth it.\nHonestly, I would love to be proven wrong. Maybe I didn't understand some mechanics. But I don't want to trust another promise of 'it gets fun after X hours\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It pains me to write this because I actually like the Yakuza franchise. This game isn't exactly bad I just don't like the most evident change which is the combat. It would been better if turn based was a mini-game not general combat for everything. You have to grind in arenas to become strong enough to beat a story boss. The game got less interesting when returning characters got out of the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It very much doesnt fit yakuza series, this game has good story but horrible gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As an RPG it´s great. Good classes and abilities, godd combat and progression. As a Yakuza game, it´s a fucking disgrace and should be avoided at all costs. DLC is also hiding 2 Jobs/Classes behind a paywall they are absolutly NOT worth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played every Yakuza game, I don't know why the devs decided to switch this game to turn based combat, it ruined the fun for me, I used to play this game specifically because of the fun combat, now that its turn based the gameplay is honestly quite dull. sure many people like turn based titles, but I think to implement it to Yakuza, a game well known for its fun combat mechanics is honestly a huge let down. in my opinion it was a waste of money, atleast let people choose the gameplay style, not just switch it up suddenly. every yakuza game had live combat, I was honestly disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm starting to burn out on this one. I've certainly gotten some good play time out of it but I have some issues with how it's designed. \n\nYou can't get anywhere without getting dragged into some pointless fight. Just walking a block in the game could result in 2-3 fights. You can't really sneak past enemies. Try to avoid them by going the next street over and there will be more. \n\nParts of the story just drag on and on and on and on... I don't need another conversation about how you are brothers or loyal, or whatever, speed it up.\n\nThe game taunts you by telling you to save, but you can't. Why? The game wants you to go through another cut scene, or ten, first. I swear I've played for an hour or more without the ability to save because I'm in endless strung together cut scenes. This means you can't just play for a few minutes or stop to, you know, live life.\n\nGenerally speaking the game is good. I actually like the battle system. It's got a decent sense of humor. The characters are interesting enough. It's just at 35 hours of play time the story really feels like it should be done. The twists and surprises are just getting annoying at this point. I'm ready to move on but I may never actually get to finish this game because it is apparently unending. I know some people like games that they can commit every waking hour to, I'm just not one of them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay mechanics are okayish and can be fun sometimes. Ending was cheesy, dragged for too long and wasn't really worth it at the end of the day. The Yakuza series has this shit plot twist where \"someone\" would come in after the fight and kill an important character. So sick of this crap. \r\n\r\nEither way, I recommend not wasting time on this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Apparently this is a great game? Well if it is, the price of admission is high enough to rate it a thumbs down in my books. Four hours of gameplay and this is what I've experienced:\n\n1. 10 mins of cinematic cutscenes with a vaguely interesting story, bad dialogue and exceptionally awful voice acting\n2. Another couple of minutes of Temu cutscenes where two characters grunt at each other while unvoiced dialogue scrolls across the screen\n3. Briefly wander around a bland, boring environment with nothing to do except make your way to the next objective, suffering through a bunch of awful quasi-random encounter battles along the way\n4. Go back to point 1 and start all over again\n5. Did I mention this goes on for nearly four hours?\n\nThis could be the greatest game ever made and it would still suck just because of how awful the starting experience is.\n\nBonus awfulness points because this is literally how you exit the game:\n1. Enter the pause menu\n2. Go to settings\n3. Select return to title screen (no, there is no exit game option)\n4. Select Yes I want to exit\n5. Select Yes I want to exit (not a typo, you have to do this twice)\n6. Watch four separate unskippable full screen ads\n7. Select exit game \n8. Select yes I want to exit\nWhat the actual f**k is this nonsense?\n\nI plan on continuing playing because it seems like I might just about be at the point where I can actually play the game! But no amount of fun is enough to wipe off the stink of those first four hours so it will forever remain a thumbs down for me. Play if you enjoy games that like to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "having to install a mod to have playstation glyphs show up lmao dog shit game dog shit company",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WHY every game reach IDIOTIC POINT of design so late that it is not possible to refund and forgeyt this shit?! Developers should be forced to walk through their shit out production  10 times before being paid.\nUPDATE (+15 hours) This shit is even  shittier with endles combat that you can not loss (because you have healer and its magic points are recovered by physical attack) but to finish it you need 100 rounds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm 2.5 hours in and I've had four very easy fights, ran through the streets a few times, and the rest has been an unfathomably boring story. I'd rather watch my faucet drip than play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls only respond 10% of the time.  Most of the time you have to restart and fight 10 to 15 times to actually succeed.  \n\nYou would think a game that has been out this long, they would fixed it, but apparently they are just as lazy as all other game developers, with the ONLY exception of ConcernedApe\n\nAt least he actually made a game that works correctly.  \n\nPut in a bit more time.  Its Shit. Total Shit.   Got to Chapter 3, game crashed during the Can Collection feature, and now the saves are corrupted, so I would have to start back from the beginning.   \n\nWhat a waste of game, and it took longer than 2 hours to find out how bad it was, so i cant get my money back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought the combat system was serviceable until I had to learn the hard way that once the Kasuga dies in combat, despite other party members being alive, it is instant game over. This was in the middle of a seriously long and boring dungeon and I lost all my progress within it. Decided to drop the game there because if the rest of the dungeons in this game are this long with nothing interesting offer, I didn't want to play anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a strange one for me. It started so well, and I really thought my first Yakuza game might get me to buy the others, but once I got past the halfway point, all the issues with the game came up... and they suck.\r\nI am sure there will be many who love the game and everything about it, but the small issues in the first half were nothing compared to the total slog that was to come.\r\n1. The game really wants you to do the bussiness side game, to the point that if you dont, get ready for a very long grinde.\r\n2. The game item pricing starts ok, but later on it gets insane, unless you have done well with the business side game.\r\n3. There are some points where it makes you travlel for 10 mins before you fight a boss, and they dont bother to put a save before the boss.\r\n4. There is a lot of talking...a lot. I thought it would calm down, but nope, it got to the point where I was skipping chatter because of how the story went and the fact that 50% of what they said (after early character development) was just blah blah.\r\n5. The story has a few twists and turns, which again was great, but only early on. It got laughable the longer it went on. Just when you thought who was to blame, \"No, it was I\", then a bit longer \", Ha, I think you will find that I did it\", and later  \", Actually, it was us who brought about the\" Again, this happened so many times that it just got old, and I gave up.\r\n\r\nThere are more issues, but I don't want to waste any more time on these. I should have started with Infinite Wealth? The first half of the game is good, even perfect, but as it goes on, the minor cracks get bigger and bigger.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game does not respect your time. I've played all other Yakuza games leading up to this point and I play to experience the story and then I pass onto the next game and that's not really possible here. I'm feeling the need to go through the dungeon and grind because they want to pad out play time and drag everything on to make this a 50 hour game. I'm quitting and moving onto the next, genuinely infuriating combat system with encounters taking way too long, only to have more random enemies spawn 3 feet away from you and pull you into another encouter. To put it into perspective all my characters are level 21 and we're against 5 level 12 enemies, using the auto feature with no abilities it took 5 minutes to kill them all, the turns simply take too long to play out. Once I finished that encounter another group of 5 was right around the corner sitting where I needed to go. You win, I quit.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if ur playing the yakuza games in chronological order, it might not be for you. pacing is genuinely garbage, turn based combat is really different. dont get me wrong, ichiban is likable and a cool mc but the game just genuinely drags out to the point where its not really interesting anymore",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game, but I can't.\nI like turn-based combat and wanted to try a yakuza game, so I got it on sale.\n\nThe main characters are great. \nCool gameplay concepts.\n\nBut, after a while, it just stops being fun.\nSide quests bored me to no end, the main story had good moments, but nothing to keep me that much invested. \nThe absurd attacks stopped making me laugh. The JRPG parody become just become the worst parts of an JRPG : long, grindy, lots of mechanics unused as the difficulty curve mostly* looks like a flatline.\nCombat is boring. You'll overpower most enemies after a certain point, so I stopped trying to improve my strategies, gear, etc...\nAnd then, the [spoiler] Majima & Saejima [/spoiler] fight. Suddenly, a mandatory boss fight has 10 more levels than you. Cool. And you simply lose. Now the game wants to be difficult.\nBefore that, you unlock an area for grinding. I choosed to quit.\n\nI don't think this game is worth it.\nHonestly, I would love to be proven wrong. Maybe I didn't understand some mechanics. But I don't want to trust another promise of 'it gets fun after X hours\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It pains me to write this because I actually like the Yakuza franchise. This game isn't exactly bad I just don't like the most evident change which is the combat. It would been better if turn based was a mini-game not general combat for everything. You have to grind in arenas to become strong enough to beat a story boss. The game got less interesting when returning characters got out of the story.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}