{
  "positive": [
    {
      "review": "if it wasn't left for dead by ea, it would be the greatest star wars game of all time hands down.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "still the only big multiplayer star wars game out there... but its pretty great at that.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I love it especially being a snowtrooper! they look epic! and I think you should play it",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Honestly? I fired this game up “for just one match to see what multiplayer is like”… that was months ago.\nI haven’t seen real sunlight, I'm a native of Endor now, and I still don’t know how to turn it off.\n\nIf there is a quit button its probably locked behind a micro transaction..",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "very fun. mods are (for cosmetic) fun. cheating is for pathetic losers who are no good without them.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Not bad, just a little rough for new players... however, its the only faithful to the films game for modern hardware soooooo, grab it, its crazy cheap anyway",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "great game, lots of fun even if youre not into starwars",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Star Wars Battlefront II (2017) is an absolute blast and one of the most rewarding Star Wars gaming experiences available. The game brilliantly captures the epic scale of the franchise, delivering stunning visuals, cinematic sound design, and incredibly immersive battles across iconic locations from all eras. Its diverse roster of heroes and villains feels fantastic to play, each offering unique abilities that keep matches dynamic and exciting. The multiplayer is fast, polished, and endlessly replayable, while the single-player campaign adds heartfelt story moments that enrich the Star Wars universe. With years of updates shaping it into a content-rich, community-driven gem, Battlefront II now stands as a must-play title for both fans of the saga and anyone who loves thrilling, beautifully crafted action games.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of if not the best game ever pretty active rn, 100% worth it on sale,\n also u get to shoot ewoks with machine guns what other game lets you do that??\n9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun, if you can find a game and if that game isn't filled with hackers or is a one-sided stomp. I don't enjoy wasting my time with the matchmaker, and a server browser system (like what they had in the OG BF2) would be a quicker, better way for every player to find a game they want to play. Once you make it into a match, you're gonna have a blast!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not as good as 2005, but genuinely one of the best Star Wars shooters ever. It has both great grunt and Jedi/Sith fantasy. It's also just full of maps and content from all three eras of Star Wars, and the build variety is pretty solid for a game like this. Pick this one up on sale. \r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game with strong storyline and PvP gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, easy to play shooter with nice variety between massive multiplayer, single player, coop. Additionally, has good variety between space and land battles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great absolute peak but i hope they added stuff from battlefront 2015 i wanna drive a at-at dawg..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The NPC's quickly running to cover then popping their heads up left and right every second is hilarious. I see it as a feature rather than a bug, quite a nice tactic to bullet dodging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reminds me so much of the original I played on the PS2 years ago in my elementary school best friend's basement. Good times. Although I've had difficulty finding online matches, but that could just be due to my own lack of awareness or knowhow when it comes to online gaming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "epic.... this game is epic... combat is good.. maps are good... there are better shooters out there but this is more then just a pure shooter. its sword fighting and more. if ur a fan of star wars u will love this. if ur not  then u will probablly still like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Star Wars game after all the fixes. Wish EA didn't drop the ball on support",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First off, don’t pay attention to my playtime. I’ve played this game loads more on other platforms. Battlefront 2, probably one of my favorite games ever. Faithful to the films, stupidly beautiful visuals, and great gameplay. On top of that, the Celebration Edition with ALL the dlc is only $5. I’d say this is a great buy whether you like StarWars or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If the game wasn't abandoned by EA and filled with hackers, Battlefront 2 is an absolutely fantastic experience. The game usually goes on sale for just a few dollars. Pick it up, stick to the ai battles online though. All the big online modes such as Galactic Assault are just plagued by hackers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Star Wars: Battlefront II continues to shine years after release thanks to its active player base and engaging gameplay. The large-scale battles, iconic heroes, and immersive Star Wars atmosphere make it a thrilling experience for both casual fans and competitive players.\nOn the downside, connectivity issues can sometimes disrupt matches, and certain game modes struggle to attract enough players, leaving them underpopulated. While the core experience remains strong, these drawbacks can limit variety for those seeking to explore all the content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game, real shame that EA killed it to focus on Battlefield. Only buy if it's on sale for $5 or less.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was soll man dazu sagen. Ist halt Star wars battlefront und Star wars battlefront ist eines der besten Star wars spiele die ich jemals gespielt habe es macht so unglaublich spaß und ich werde auf jedenfall immer weiter spielen xD solange bis ich alles fertig habe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd say it's very fun game to play with, even though sometimes there is a low player count on asia, still playable. I had fun and you'll love it if you are really a star wars fan. The story is great aswell! WE NEED BATTLEFRONT 3 RAHH",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They made some weird choices along the way but it's still a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best looking Star Wars game.  Devs nailed the authentic art and true to the Star Wars style is great.  Campaign is Ok.  Wish we had a Battlefront 3 or they continued working and supporting this game.  Recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super great game, but give us BATTLEFRONT 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good: LITERALLY is the best multiplayer star wars game out there and even though the player count has significantly dropped it's not hard to find a full match, especially during prime time. Some modes like heroes vs villains and ewok hunt feels like their own games rather than an alternative mode, i can imagine a stand alone ewok hunt game or maybe other developers can take inspirations from it to create a \"new\" genre.\r\n\r\nBad: Hackers. I wish EA added a good anti-cheat like they did with Battlefield 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I yelled at droids for roughly 5 hours straight and then exploded",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awsome game. Amasing graphics and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite a great game! I really love its easy to learn controls. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EA abandoned this game and its never being brought back to life, full of sweats but fun once in a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game but they need to invest in better anti-cheat. Other than the cheaters the game is legendary!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sick game. not a lot of players, but runs smooth and pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The singleplayer story is not as fun as the multiplayer battle royales I won't lie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very engaging and has a lot of progression, I would definitely recommend this game for people with money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, played the story multiple times, great community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, matchmaking sucks, beautiful game but sadly slowly dying.... \n\n👌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With the most recent updates and how they changed the way the game works, the coop mode and everything and just generally the fidelity of the game which was never in question. I can recommend it, no more lootboxes that are BS, no more stupid decisions, just you, blaster, a bunch of challenges to let you unlock stuff and the lootbox system is there to have you unlock stuff basically. Good stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As this game is on sale, I have decided to write a review. This game is a wonderful game, with wonderful multiplayer that truly captures the feeling of Star Wars, while being extremely fun to play with very fun gameplay mechanics. It has one major problem, being that the game is dead, and will not be receiving further updates. If we can repeat what happened earlier this year, we can continue to push for Battlefront 3. It is our New Hope.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game and original campaign, also online I rate the game 9/10 because some of the Creatures don't know what 1v1 is.                    \n\nPs.make bf3 ♥️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its one of the Best star wars games and its also my Fav movie series with all the movies so its just cool :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun FPS with multiplayer options. Slightly buggy but overall a lot of fun and a good way to waste time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good casual shooter that can hold a surprising amount of strategy. Don't take it too seriously and use those emotes! We're here to have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played this game a lot on my ps4 3-4 years ago and now i bought it on pc , this game is still fun and impressive for its age but it very obviously lacks updates and polish , i love the gameplay the gamemodes the graphics , this game had almost unlimited potential but ea killed it for battlefield (which wasn't even that good) , look if you wanna buy this game wait for a sale because 39.99 is simply not worth it when you put in mind that you'll wait a lot of time to find a game and there's hackers that likes to ruin the fun in a lot of the games , the best way to describe bf2 is wasted potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the coop mode. I wish it had more maps.\r\n\r\nI wish OG Galactic Conquest was a thing on here.\r\n\r\nBut frankly I like the game, I don't regret purchasing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is perfect for Star Wars lovers. The graphics are overall quite realistic, and the lightsaber sounds are better than ever. There are a bunch of gamemodes, and a bunch of characters to chose from in each one. The tactics and physics are great and realistic, too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, yes there are cheaters but still good. Just play co-op its better. And keep in mind 8 year old game, very good and beautiful scenery.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly Recommended. while the New player Controls arent THAT EASY for Campaign. the story in campaign mode is very awesome. while it doesnt include people like darth vader and such, Still a pretty good game. Would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game that fusions classic and nostalgic Star Wars, great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, but i wish there were more players\r\nqueue times for a supremacy match are insane",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a person that generally hates shooters, I actually found myself getting a little obsessed with this game. I enjoy the smaller game modes, i.e. Heroes vs. Villains, and like to spend time unlocking new abilities for my units. A must-play for lovers of 3rd person shooters and Star Wars!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really good it my new favorite game it is hard but really fun once you get good at it i would recommend it to others if you dont have it it is usually 3 euros",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! From time to time it would crash the PC. Recently, there've been more people playing which is great, waiting time is short, like seconds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game had a tough release in 2017, but boi, has it become a classic! Bought it again on steam on sale purely to get the achievements. Highly recommend it when on sale to play with your friends. Especially because the max party size is capped by gamemode, not a default 4. We easily played some matches with a party of 6!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very easy to level up and mods are very fun. only bad thing is cheaters game is perfect other wise one of the best star wars games out rn. My only thing i wish they did was add private match from bf1 and update the game so ppl cant cheat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really cool, awesome game mechanics, highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game really combines the great story of star wars and the comedy of a shooter game together well, this game isn't very well made or fixed but I would still play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an excellent game with a large variety of maps, characters, weapons, jedis. It can be hard to find online games going at times though.... Which is a shame it's an excellent game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The PVE is lacking, got through all of it in under 3 days. The only reason I bought this was because it was on a discount. PVP is abit better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is about star wars and star wars is cool so the game is cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, lively multiplayer scene, lots of class upgrades and variety in weapons and abilities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but mostly dead at this point. You can find people doing the occasional hero duels but that is about it. Maybe in the evenings you can come across some battle maps, and if you are lucky, with no cheaters. 8.2/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing game. If the game dies again, let it be known that I played until the last. For the honor of our brothers...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are moments in life when a human being witnesses something so beautiful, so transcendent, that words can only stumble in its shadow. For some, it’s the birth of a child. For others, it’s a sunrise over the ocean. For me, it is Ewok Hunt in Star Wars Battlefront II. This game mode is not merely a pastime—it is a revelation, a spiritual awakening disguised as asymmetric multiplayer. It is the purest distillation of fear, wonder, and joy that digital entertainment has ever bestowed upon mortal kind.\r\n\r\nThe setting alone—Endor’s night, cloaked in darkness, the air thick with mist and mystery—is enough to stir the soul. You spawn as a stormtrooper, isolated and trembling, flashlight flickering like the last spark of civilization amid the primal wilderness. Somewhere out there, tiny furred gods of the forest—Ewoks—watch with eyes gleaming in the moonlight. You hear the whisper of drums, the rustle of leaves, and then that war horn—an unholy symphony that makes your heart explode in reverent panic. Every footstep is a prayer; every crunch of a twig, a prophecy of your doom.\r\n\r\nAnd yet, to play as an Ewok is to ascend. No longer are you the hunted—you are the spirit of the forest itself, a guardian of nature armed with cunning, courage, and a spear sharp enough to puncture destiny. The balance of power flips, and what once was terror becomes euphoria. You dash between ferns, leap from the shadows, and rain down the will of Endor upon the metallic intruders who dared defile your sacred home. The satisfaction of striking down a stormtrooper and watching his soul vanish into the mist is not mere victory—it is transcendence.\r\n\r\nWhat makes Ewok Hunt truly divine is its duality. It is both horror and comedy, tension and release. It gives the player something rare in modern gaming: emotion. Not the synthetic excitement of scoreboard triumphs, but a deep, primal experience that binds friends and strangers alike in a ritual of laughter, panic, and awe. The moment when your flashlight dies and your voice cracks over the mic—“Where is everyone?!”—only to hear giggling from the trees above… that’s not gameplay. That’s communion.\r\n\r\nEvery match feels like a living myth. You are not just running and hiding or hunting and stabbing—you are participating in an ancient story: the clash between technology and nature, arrogance and humility, empire and rebellion. The Ewoks embody the spirit of the underdog, proof that joy and courage can overcome even the most advanced armor. They remind us that power is not measured in blasters or starships, but in heart, cunning, and the strength to fight for one’s home.\r\n\r\nTo those who have never played Ewok Hunt, it might seem like a novelty, a silly side mode tacked onto a massive Star Wars shooter. But to those who have felt its heartbeat, who have heard the haunting music swell as fireflies drift through the trees, it is something far greater. It is art. It is poetry written in moonlight and fear. It is the feeling of being alive in a world that wants you to forget how.\r\n\r\nEwok Hunt changed me. It reminded me that beauty often hides in absurdity, that joy can emerge from chaos, and that sometimes the smallest warriors fight the biggest battles. When I close my eyes, I still hear the horns echoing through the forest. They are calling me back—to the hunt, to the magic, to the sacred firelight of Endor.\r\n\r\nAnd I will always answer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☑ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☑ 7\r\n☐ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect game for starwars fan base. Unfortunately, there are tones of hackers. The power beyond the force is unacceptable. Luke Skywalker is no more a legend when the Hackers enter the chat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Wish they never stopped updating it. Had so much more potential",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun battle mechanics along with an enjoyable storyline make this game a must buy, though I'd wait for a sale also make sure to get the Celebration Edition so you don't need to grind for cosmetics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is super cool, the droids are awesome and so are the emperor and the force kin. you don't even have to play the star wads games to know what's going on and i really liked that! all in all really fun, i love palpitate and general gravid they are my favorite. try this if you like star wars guys!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I reccomend you buy this game its really fun and takes skill if you like moderate nonviolent first person shooters and star wars this is a good game for you also get frosty mod manager and download the expanded mod it has crashed only one time for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timeless classic with a dedicated and still very active player base. Would recommend playing off the fan-made Kyber launcher for good moderation and a bountiful mod library.🐵👍🏿",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Star Wars Battlefront II is an impressive and dynamic game that truly captures the spirit and excitement of the Star Wars universe. The graphics are stunning, offering a visually immersive experience that makes every battle feel cinematic. The gameplay is fluid and fast-paced, with excellent mechanics that make both ground and space combat engaging and enjoyable.\r\n\r\nOne of the strongest aspects of the game is its multiplayer mode, which allows players to team up or compete in large-scale battles across iconic Star Wars locations. The variety of characters, classes, and vehicles adds depth and strategy, while the progression system keeps players motivated to improve their skills.\r\n\r\nIn addition, the interaction between players and the dynamic battlefield creates a sense of realism and teamwork rarely seen in similar titles. The sound design, voice acting, and musical score perfectly complement the visuals, enhancing the overall atmosphere.\r\n\r\nOverall, Star Wars Battlefront II is a well-crafted and entertaining game that combines beautiful graphics, dynamic gameplay, and engaging multiplayer experiences. It’s a must-play for both Star Wars fans and anyone who enjoys action-packed, visually stunning shooters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very great game, though quite pricey if you didn't catch it on sale. SO much to do, and unlocks, but there is quite a grind. There is one downside, as there doesn't seem to be a good anti-cheat in the game, as before i have played and had people shoot me through walls, and even plainly teleport everyone to them, exploding them upon entering.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10 year old game, has faults, but despite all that its probably the best game I have played, (plus community is 50/50, some are horrible, some are true fans)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "original battlefront was better, although still a good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good reimplementation of battlefront 2, and quite enjoyable to play. Unfortunately the saudis own EA now so be aware that when you buy this game, you're helping like the the 3rd worst petrostate in the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its really nice. You can feel like  a clone and fight for the republic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I dislike EA but it's a good game just needs a larger player base",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "StarWars Babyyyyyy - gotta blow stuff up after a few brews and its multi and lots of thing - 10/10 ! Gotta do a bf3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun star wars game I love clones and droids!! but when is battlefront 3 coming out???????????????",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME OF ALL TIME (after Minecraft and Mortal Kombat obvs)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will make you look back on star wars so fondly you give the sequels a 2nd chance. then you remember there the sequels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Star Wars are spreading across multiple battlefronts, too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 can be racist to the other team of droids and clones with full impunity  \n\n#Battlefront3when?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DOWN WITH THE KKKLANKAS DEATH TO CAPITALISM DEATH TO MONOPOLIES GLORY TO THE FREE PEOPLES REPUBLIC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "full of bots but good game to relax and grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "galactic conquest offline mode with ai would solve this games issues",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very good and i recommend playing cus its frekaing eally god",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stop looking at the comments and buy this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "theres a lot of tryhards but the realism is just amazing\r\n\r\n7/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "literally the best comabt game i have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredibly fun but a timesink if you wanna max out your characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THEY FIXED IT ! FOR THE EMPIRE ! YOU LIAR , YOU BROUGHT HIM HERE TO KILL ME ... SUBSCRIBE TO PDXM4RK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Roger, I barely know her, *drums do that thing that drums do when someone makes a hilarious joke*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just buy it if you are hot starwars fan.\r\nnormal but short storyline.\r\nmany online mods need wait to fill but its ok. \r\nenjoy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reminds of me of the old Star Wars movies but better....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "REALLY GOOD GRAPHICS [just make sure you have a good graphics card] I HAVE BEEN WATING FOR THIS TO BE ON A SALE FOREVER AND IT HAS. ALSO REALLY GOOD GAME I RECCOMEND",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of the best games I have play in a good long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, Star wars is good, FOR THE REPUBLIC.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It sucks so much to know that this game is so close to being the pinnacle of star wars games. It would scratch that battlefront itch if it wasn't abandoned, stuck with bugs, and plagued with hackers who take joy in ruining online lobbies for everyone. EA and Dice could have given the game some more love and added characters, fixed the bugs, and did new skins as a way to make money off this and boost the star wars brand for quite a while as new star wars content kept coming out. Instead you have all the pieces and the blueprint for a great game, just sitting here languishing. It sucks.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "Does not work on Windows 10, I have tried fixes online and It crashes whenever I try to load into any game. Unplayable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is overrun with cheaters now, and DICE won't do anything about it. Stay away from this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only shooter game I enjoy but not with all the cheating. 1000% not ever worth touching due to that. You may be thinking oh it's probably not that bad but it seriously is. All day every match I got into some weird bs was happening. During one match the enemy team was somehow auto killing us the entire match. Spawn, dead. Spawn, dead. It's not like a golden gun cheat it's a spawn kill cheat. I have experienced that enough time to completely give up. Get it on your console where that isn't all the freakin' time. Not worth it on pc. Or better yet, vote with your money and never buy the game because both publisher and developer are scummy. Bon chance mon amie.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- Multiplayer is dead, even during 'peak' times. \n- The bots are not fun. \n- You can rarely fill even the 8 player modes, and the 20v20 modes are nearly impossible to even get enough players to start the game. \nWorth the $4 for the campaign (winter sale 2025), however get \"Lego Star Wars: Skywalker Saga\" first for the remastered nostalgia. \nSadly it seems it there will not be a battlefront III due to \"licencing cost\". I can only recommend buying for a few dollars. \nFYI check out \"Star Wars: Genesis\", a \"Starfield\" mod overhaul to make it a \"Star Wars\" game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Majority of games are hacked now sadly. Hacked so badly it is unplayable. Not just cheating players, but altering the gameplay so much that it is broken. Manually changing reinforcement numbers, event timers and moving all players into a location so there is instant death.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Battlefront 2 is a good shooter and an overall great game.\n\nBut I cannot, in good conscience recommend this game until EA fixes the rampant cheating issues.\nThere are hacks to instantly kill any player, fly hacks and even hacks to extend the timer for any objectives as much as the person wants (885 minutes is the highest I have personally seen).\nIt breaks my heart, because the game itself is actually really good.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This used to be a really good game, i mean it is but there are just too many cheaters. Everytime you join a multiplayer match you will always encounter a cheater, it's unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love Star Wars: Battlefront II. Enough that when it launched, I put hundreds of hours into the game on PS4, maxed everything out, platinumed the game and kept playing it for the bulk of 2017 and 2018. In 2025 on PC, the game is unplayable.\n\nFirst, it doesn't work with Direct X 12, requiring you to go turn it off. The game struggles with modern hardware, but these issues are small potatoes compared to the fact that the game is effectively dead.  The bulk of lobbies are empty except for 2-3 people waiting for another 12+ people to join to start a game, and what lobbies are full of blatant script kiddies insta-killing your entire team, perma-locking heroes, and inflating objective times until they max out at 2500 minutes making victory impossible for anyone but their team. It's a shame, because there's not really much here to enjoy in terms of single-player content.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The strong wamen \"I dont need no man\" badass empire chick single player campaign is lame. The multiplayer scene is rife with hacker nonsense. I barely played the game and already got tired of the cheating bull. Graphics and gameplay are pretty good though, but not enough good to outweigh the bad at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think that this game is fun but i couldent find a game for 12 m and loading the game with ea is horbal",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was absolutely disappointed with this game. If you want the experience of the original Battlefront 2 - just install and play it, no need to give a chance to this one,\r\n\r\nPros: \r\n- Good graphics optimization, was able to play in 2K on Ultra with 80-100FPS on a moderate GPU.\r\n- Not bad graphics in general, enjoyed it.\r\n- Never seen any serious bugs.\r\n\r\nCons:\r\n- Campaign is 4-8h long, depending on your style - it was shockingly short for me. It ended exactly at the point, when it felt like it must be a half or 2/3 of it..\r\n- Cards on each unit is just a time-consuming to study feature, that adds nothing to the gameplay.\r\n- Poor single player versatility and epicness - as a fan of the original Battlefront 2, it was absolutely a deal breaker to see, that in Skirmish you can't set up a game with a starship battle, in which you can deploy on the enemie's ship and sabotage it. Can't have a large-scale battle with different vehicles available to jump in. I could continue, but long story short - being able to do less in this game, then in the original Battlefront 2 - is just feeling like I was fooled to buy this game by it's name. My bad, must have checked gameplay videos and reviews prior to purchase.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Be careful of all the positive reviews on this game. Especially the ones that simply talk about the game's specs on paper because despite the numerous amount of glowing reviews on this game there is a harsh reality to any newcomer here.\n\nYou either have to be extremely good at the game to conjure any sense of fun.\nOR-\nBe completely nonchalant and easy going no matter how hard you're being beaten to a pulp (Masochist.)\nThat or a mega star wars fan.\n\nLook, on the surface when this game functions as intended it's a good game. Barring some balancing and netcode issues. It has fantastic visuals, sound, and attention to detail that still stands up even with modern releases.\n\nBut those times are few and far between. You WILL find yourself knee deep with hacker scum, sweaty try-hards, and general issues that end up making your average day on Battlefront 2 mostly on the respawn screen.\n\nHaving played this game for over 5 years now I have never gone a single day without at least 1 hacker ruining my experience.\n\nIf you are a big star wars fan or are somehow still interested in playing this game please do not pay full price. Either wait for May 4th promos or whenever this game is under 5 bucks. If they do in the future, Epic Games does give this for free too sometimes.\n\nI really want to like this game, but I usually end up logging off in a worse mood than when I logged on.\nGuess we star wars fans will have to keep waiting for Battlefront 3. (Dream on I guess.)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I loved this game when it came out. But after being abandoned, its plagued with hackers. So even when you can finally get into a full lobby, someone in it is either hacking with one hit kills, or halting progression of the objective indefinitely. Its a shame people resort to this to get themselves off, but it is what it is. No matter what the sale price is, the hackers make it not worth it, so I wouldn't bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Star Wars Battlefront II has some genuinely fun gameplay. Great combat with large-scale battles, though the scale of battles is not the size that Battlefront 1 had. Just like Battlefront 1, all the fun gameplay came at the end of it's life cycle due to the new content that added new heroes, maps, and new game modes — All content that honestly should have been in the game from day one.\n\nThe campaign is a major disappointment. The story is one huge letdown with no real replay value, and it never lives up to the potential of its premise that we saw in the trailers.\n\nThe biggest issue, though, is the state of multiplayer today. What used to be the best part of the game is now completely unplayable. Hackers have overrun the servers and ruined matches purely to troll, leaving the game effectively dead unless you're willing to put up with constant cheating. EA has abandoned this game, so with no future updates this is the state of play for the foreseeable future.\n\nOverall, it could have been a great Star Wars shooter — and for a brief moment, it was — but right now it’s impossible to recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this, but EA’s reputation and consistent anti-player decisions have driven me away. That being said, there are gameplay issues I consistently run into with finding good servers, and staying with my group. That being said, I’m choosing not to recommend any EA title, regardless of IP or nostalgia.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what a fucking joke of a game. The match balance and game modes are fucking awful. Nothing like the original games on Playstation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly kept matching with hackers over the weeks that i played, totally ruined the game for me..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Welp the Game doesn't launch. Thought I could get a good deal during the black friday sales. Boy i was major wrong on this game. Cant even boot up and these silly useless morpns from steam support assumes i have been playing for over 7 hours. yes i had an ea game pass once upon a time. What a freakin DUD!! steam support needs to bring back the phone lines and human beings in the fleash for interaction and communication. Quit using AI/ Do better. i hope the \"Steam Machine\" fails miserably like these 6-7 bogus sales lol DDDDDAAAAMMMMMNNNNN!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only 30 minutes in and this game has a massive cheater problem. Just avoid this on PC and play on consoles if you can.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The hacker problem is out of control. Almost every lobby has at least one cheater running around with. It completely ruins the flow of the match and makes it pointless to even try. Reporting does nothing, and there seem to be no active measures in place to deal with the issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i at first would recomend the game but to concle player this stinks if you dont have freainds because it is the samething and same chrters evrey time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a truly great game, the best Star Wars game on the market right now. Especially considering Battlefront 2 had a huge player base back then, with around 30,000 players. Unfortunately, all the players have disappeared, and the servers have become completely unplayable due to cheaters! It's a real shame, as this game had so much potential, but EA completely ruined it through a lack of support and the absence of a new anti-cheat system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's the biggest piece of dog shit I ever did play. All hackers, all homos, all sweats who need a fan to suck the stench out of their room, and all buffoons who severely enrage me. 10/10 ragebait experience, would choke myself out again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign is a pain in the ass. even on lower difficutlies its just spamming shit at you wich is fine 90% of the time until you suddenly get two tapped by a random enemy that you didnt see",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic BF2 experience in the golden years of playing this on console/pc with friends. Now it feels disappointing to attempt online for steam due to hackers and nothing really being done about it. The online community now seemed friendly and was able to get a few good matches in. I personally cannot recommend this until something changes with cheaters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is trash ; Loading into my first Multiplayer match in almost 2 years just for an exploiter to be teleporting around and 1-shotting people from the skybox lmao.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played through the single player story because multiplayer is not my cup of tea.\n\nIt was an utterly forgettable experience. Now, a few months later, I don't remember anything about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game right now is unplayable due to the increased amount of hackers i cant find one game without seeing a hacker one shooting everyone and flying with an invisible jet-pack  on an assault class EA does not care about this game anymore since it stopped using loot boxes witch was how they were making money on this game not worth getting at all unless you just want to play the single player story mode",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute TRASH.  Couldn't even launch the game because I was FORCED by \"EA\" to \"register\" whatever and to \"update my password\", blah, blah, blah...  All for a game THAT I PAID FOR.  I'm not here to jump through hoops of fire doused in gasoline to appease \"EA\".  I simply want to PLAY THE GAME THAT I PAID FOR.  Is that too much to ask?  Apparently so.  EA somehow believes that the customer is here to \"accommodate them\".  Not gonna happen.  Game has been UNINSTALLED and I'm requesting a refund.  I have literally HUNDREDS (closer to 1,000+) games on multiple platforms including steam, Epic Games, XSX, PS5 Pro, and Switch not to mention the emulators that we all know and love...  I don't have time for this.  LAST TIME I WILL E-V-E-R PURCHASE ANOTHER GAME ASSOCIATED WITH \"EA\".  How IGNORANT are the people running EA (into the ground)?  I'm out.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "just play the og game this game is bad and the gameplay is not good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome i have no idea why nobody plays it anymore so you shouldn't buy this game because nobody plays it anymore even though it might be the best Star wars game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some amazing game modes (Ewok Hunt) but EA ruined star wars BATTLEFRONT. Call this something else like Star Wars CoD and it might have worked.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Campaign is like a perfect side piece to the disney star wars universe. Same kinda terrible writing. Multiplayer is mid. Bought at 90% off, still not sure i think it was worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the WORST games ever. \r\nHORRIBLE balance. HORRIBLE matchmaking. HORRIBLE prograssion. Mediocre storymode. No inuitive at all.\r\n\r\nBeing a Star Wars fan it´s a huge dissappointment to see the potential of this game being wasted like this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dead game is dead, also i cannot state this enough. But Ea made trash to abandon.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Okay so... EA attempted to bring Battlefront series back, and how did that go!? Not much people play this game anymore, and I respect that. EVEN THE CLASSIC BATTLEFRONTS WERE BROUGHT BACK, ruined again... If there is going to be a Battlefront: 3, \"sigh\" don't ruin it more EA.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "EA completely abandoned this Game and therefore killed it, theyve stopped banning cheaters which means that in pretty much every lobby there are multiple of these worms, most trying to hide them, and some bluntly rage hacking. This wouldnt be a problem if theyd allow community hosted servers moderated by active players, yet they dont for god knows what reason. Dont buy this",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is good but there are so many hackers that it is impossible to play and EA does nothing about it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is only fun if you play on Solo mode against AI as the Multiplayer is filled with hackers who ruin the game. EA will not patch or enforce anti cheat against these people. The game without hackers is one of the best Star Wars Multiplayer games but until then it is not worth it unless you solo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trash gameplay thanks to the stupid heros.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cant even now play cuz some steam ea linking problem buIIshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the hardest part is finding a game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game stuck on loading",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is full of hackers Not worth buying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dead game full of sweats",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fuckass game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Constant crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck EA and Javelin.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i want a refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Comes with EA spyware",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "hackers, no fun in 2025",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have a Low End PC and plus i have it on XBox one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of hackers that destroy the lobby.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got bored with it. DNF",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lowkey broing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It sucks so much to know that this game is so close to being the pinnacle of star wars games. It would scratch that battlefront itch if it wasn't abandoned, stuck with bugs, and plagued with hackers who take joy in ruining online lobbies for everyone. EA and Dice could have given the game some more love and added characters, fixed the bugs, and did new skins as a way to make money off this and boost the star wars brand for quite a while as new star wars content kept coming out. Instead you have all the pieces and the blueprint for a great game, just sitting here languishing. It sucks.",
      "voted_up": false,
      "votes_helpful": 86
    },
    {
      "review": "Concern Regarding Anti-Cheat Enforcement in Online Play\n\nThe overall experience of playing this game online has been severely degraded by a significant and widespread presence of cheating. This issue has a detrimental impact on the core competitive environment and the general enjoyment for legitimate players.\n\nImpact and Vendor Response\n\nThe pervasive nature of unauthorized modifications directly ruins the in-game economy (the market) and negatively affects long-term player engagement. What is most concerning is the perceived lack of proactive and decisive action from EA.\n\nA core question remains within the community: What is the demonstrable record of permanent bans issued to confirmed cheaters on the EA network? The current level of enforcement appears ineffective, leading many to doubt the presence of sufficient deterrents.\n\nDemand for Permanent Disincentives\n\nTo effectively combat this escalating problem, a fundamental shift in policy is required. I strongly urge EA to adopt a zero-tolerance approach consisting of two mandatory steps:\n\nPermanent User Account Bans: Confirmed cheaters must receive an immediate and permanent ban from the game service.\n\nGame License Revocation: The license associated with the banned account should be permanently revoked.\n\nThis measure enforces a vital financial penalty. By requiring permanently banned users to re-purchase the game to attempt to play again, a clear and decisive cost is placed on cheating. Merely relying on kernel-level or client-side anti-cheat software, while useful, is insufficient without the guaranteed, unyielding threat of permanent license removal for repeat or egregious offenses.\n\nFailure to resolve this crisis with immediate and severe enforcement will directly impact my willingness to purchase any future titles from EA.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "In every match there is a cheater and developers doing nothing against it. No reason to play if you can't have fun bc of cheaters who can do whatever  they want and don't be punished, you can't even report them so till they doing something about it game gonna die",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Game was okay until the game breaking Cache Grab bug.  I tried all the supposed fixes without any luck.  I had to read the walkthroughs and watch videos of the last missions as a result.  \n\nAfter that I was done, didnt try any of the grindy stuff offered to get emotes and other crap.\n\nEA can suck it.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Just the fact that I need to launch the EA app makes me hate this. And the fact that the EA app messes with the Steam overlay is super annoying. Other than that the game is fine, i guess.\n\nAlso, cant remember last time I played a game that actually crashes the entire computer. But here we are...\nAnd when I booted up my computer again, all my display settings were screwed up. Brightness, gamma, contrast etc.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "a piece of shit game built by EA. broken, buggy, unbalanced. the game is dead with roughly 1200 players a week 25/10/2025.  Being the only game available to play in versus using iconic characters I would expect live updates and a strong fan-base however, EA has never delivered a perfect game nor a decent Star Wars experience. \r\n\r\nI was a big Star Wars fan prior to Disney buying Lucasfilm, it will take a hardcore Star wars fan to enjoy playing this game because you will run into bugs, glitches, modders, server issues, matchmaking issues, crashes, and unbalanced game mechanics. If you're not a Star wars fan DO NOT waste your time downloading it. If you know EA's reputation that should be enough to keep you away. \r\n\r\nCheers",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Does not work on Windows 10, I have tried fixes online and It crashes whenever I try to load into any game. Unplayable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is overrun with cheaters now, and DICE won't do anything about it. Stay away from this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "7/10 games theres a hacker and there is no ban list or report function no way to go to steam profiles to report that way either. game is a lost cause dont waste your money on a hackers paradise",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Requires the EA launcher and not many players online anymore so would not recommend. Even if you quit the EA launcher, background EA services don't close, essentially a virus!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "after today, do not support EA, we will be seeing the slow decay of our fav EA titles as the company was bought by donald trumps son in law and saudi arabia, this hedge fund will begin to cut costs, over work devs, add more ai slop and begin to destroy EA as a company from the inside for a quick buck, do not buy battlefield 6, boycott the sims, uninstall skate.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is fun, but I bought it intending to play with my friend and AI. However, the game doesn’t allow that . it only supports 4-player co-op missions, which means we have to play with two other strangers. I don’t understand why they didn’t make it possible to create a private lobby.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To wait 10 minutes to get into a lobby and find the game is hacked. What a pile of garbage.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "welp another time i wasted my money on a game i thought would be really good was extremly underwhelming",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Only shooter game I enjoy but not with all the cheating. 1000% not ever worth touching due to that. You may be thinking oh it's probably not that bad but it seriously is. All day every match I got into some weird bs was happening. During one match the enemy team was somehow auto killing us the entire match. Spawn, dead. Spawn, dead. It's not like a golden gun cheat it's a spawn kill cheat. I have experienced that enough time to completely give up. Get it on your console where that isn't all the freakin' time. Not worth it on pc. Or better yet, vote with your money and never buy the game because both publisher and developer are scummy. Bon chance mon amie.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- Multiplayer is dead, even during 'peak' times. \n- The bots are not fun. \n- You can rarely fill even the 8 player modes, and the 20v20 modes are nearly impossible to even get enough players to start the game. \nWorth the $4 for the campaign (winter sale 2025), however get \"Lego Star Wars: Skywalker Saga\" first for the remastered nostalgia. \nSadly it seems it there will not be a battlefront III due to \"licencing cost\". I can only recommend buying for a few dollars. \nFYI check out \"Star Wars: Genesis\", a \"Starfield\" mod overhaul to make it a \"Star Wars\" game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Majority of games are hacked now sadly. Hacked so badly it is unplayable. Not just cheating players, but altering the gameplay so much that it is broken. Manually changing reinforcement numbers, event timers and moving all players into a location so there is instant death.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Battlefront 2 is a good shooter and an overall great game.\n\nBut I cannot, in good conscience recommend this game until EA fixes the rampant cheating issues.\nThere are hacks to instantly kill any player, fly hacks and even hacks to extend the timer for any objectives as much as the person wants (885 minutes is the highest I have personally seen).\nIt breaks my heart, because the game itself is actually really good.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is pretty much dead, the servers are still active but you'll only get to play single player or just a couple of multiplayer modes, and because there's no moderation every lobby is filled with hackers.\r\n\r\nIt might have been good at one point but it's not worth your time anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The hacking is out of hand.. doesn't matter if you take a break, complain, whatever. Used to love this game.. I think I'm going to have to skip the next one if they make it and that makes me sad. Do not waste your money. It's literally unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The cheating problem kills the game completely. nothing else needs to be said past that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really want to like this game as I really enjoyed the 2005 version. However, the lack of custom matches really hurts my opinion of this game. I want to be able to do custom matches with friends without having to play with random online.  I'm also not the biggest battlefield fan, and this game feels like Star wars themed battlefield. \n\n<Insert obligatory EA is trash comment>",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Battlefront II Multiplayer is good, but the amount of cheaters you encounter makes the Multiplayer mode unfair and not enjoyable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Star Wars Battlefront II wasn’t a game I could enjoy, as I wasn’t able to play it's multiplayer in its prime, and aside from that, it doesn’t really offer much. I hoped to at least enjoy the campaign, being a huge Star Wars fan, but it failed to capture my interest. That said, the graphics and atmosphere are fantastic, truly immersing you in the Star Wars universe—arguably one of the best in that regard. I can’t speak to the full experience since I didn’t get to play it properly, and others may have more to share in other reviews, but from my perspective as someone who bought it and tried to play it, I wouldn’t recommend anyone else do the same.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love Star Wars: Battlefront II. Enough that when it launched, I put hundreds of hours into the game on PS4, maxed everything out, platinumed the game and kept playing it for the bulk of 2017 and 2018. In 2025 on PC, the game is unplayable.\n\nFirst, it doesn't work with Direct X 12, requiring you to go turn it off. The game struggles with modern hardware, but these issues are small potatoes compared to the fact that the game is effectively dead.  The bulk of lobbies are empty except for 2-3 people waiting for another 12+ people to join to start a game, and what lobbies are full of blatant script kiddies insta-killing your entire team, perma-locking heroes, and inflating objective times until they max out at 2500 minutes making victory impossible for anyone but their team. It's a shame, because there's not really much here to enjoy in terms of single-player content.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is dead used to be such a great star wars game now its just filled with hackers in ever server",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hackers are in nearly every lobby and have cheats that literally disable the game for everyone in the lobby.. how in the world does this game have a single positive review",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Galactic Assault has been unplayable for weeks due to cheaters. The sad truth is that we'll have to wait until next year for streamers to play this game again and bring to light the cheater problem. Fck you EA.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game but unplayable cause of cheaters",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is currently overrun by hackers and entirely unplayable, absolutely devastating to see a game that I love so much in such a sorry state :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game doesnt get updated anymore, leaving it in a unbalanced, unpolished state, the hitboxes can be weird, some \"techs\" that should of been patched years ago blah blah blah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The strong wamen \"I dont need no man\" badass empire chick single player campaign is lame. The multiplayer scene is rife with hacker nonsense. I barely played the game and already got tired of the cheating bull. Graphics and gameplay are pretty good though, but not enough good to outweigh the bad at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hackers have made the game unplayable, and EA does absolutely nothing about it. DO NOT DOWNLOAD THIS GAME.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think that this game is fun but i couldent find a game for 12 m and loading the game with ea is horbal",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was absolutely disappointed with this game. If you want the experience of the original Battlefront 2 - just install and play it, no need to give a chance to this one,\r\n\r\nPros: \r\n- Good graphics optimization, was able to play in 2K on Ultra with 80-100FPS on a moderate GPU.\r\n- Not bad graphics in general, enjoyed it.\r\n- Never seen any serious bugs.\r\n\r\nCons:\r\n- Campaign is 4-8h long, depending on your style - it was shockingly short for me. It ended exactly at the point, when it felt like it must be a half or 2/3 of it..\r\n- Cards on each unit is just a time-consuming to study feature, that adds nothing to the gameplay.\r\n- Poor single player versatility and epicness - as a fan of the original Battlefront 2, it was absolutely a deal breaker to see, that in Skirmish you can't set up a game with a starship battle, in which you can deploy on the enemie's ship and sabotage it. Can't have a large-scale battle with different vehicles available to jump in. I could continue, but long story short - being able to do less in this game, then in the original Battlefront 2 - is just feeling like I was fooled to buy this game by it's name. My bad, must have checked gameplay videos and reviews prior to purchase.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Be careful of all the positive reviews on this game. Especially the ones that simply talk about the game's specs on paper because despite the numerous amount of glowing reviews on this game there is a harsh reality to any newcomer here.\n\nYou either have to be extremely good at the game to conjure any sense of fun.\nOR-\nBe completely nonchalant and easy going no matter how hard you're being beaten to a pulp (Masochist.)\nThat or a mega star wars fan.\n\nLook, on the surface when this game functions as intended it's a good game. Barring some balancing and netcode issues. It has fantastic visuals, sound, and attention to detail that still stands up even with modern releases.\n\nBut those times are few and far between. You WILL find yourself knee deep with hacker scum, sweaty try-hards, and general issues that end up making your average day on Battlefront 2 mostly on the respawn screen.\n\nHaving played this game for over 5 years now I have never gone a single day without at least 1 hacker ruining my experience.\n\nIf you are a big star wars fan or are somehow still interested in playing this game please do not pay full price. Either wait for May 4th promos or whenever this game is under 5 bucks. If they do in the future, Epic Games does give this for free too sometimes.\n\nI really want to like this game, but I usually end up logging off in a worse mood than when I logged on.\nGuess we star wars fans will have to keep waiting for Battlefront 3. (Dream on I guess.)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game fucking sucks and is pure dog water. don't buy it, and don't even play it if you got it for free, do something better with your time on this earth please",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i was expecting to play a better looking version of what the original BF games were. a soldier in an army on a large open battlefield. instead i get dropped into a shit on some single player action game with a slow and clunky moving character being swarmed by mobs. i hate EVERYTHING about this game and extremely thankful i only paid $4 for this. uninstalling and never playing again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Singleplayer:\r\nA short story taken place directly after the battle of the Death Star 2. A tale about realizing what you're fighting for may be erroneous. \r\n\r\nMultiplayer:\r\nI realized about halfway through completing achievements, you can play Online Co-op Missions to unlock things easier to keep up with everyone who has maxed out Star Cards.\r\nThat doesn't really matter when the servers are riddled with hackers and the chat is filled with slurs. (H Just hide chat from your screen.) \r\n\r\nHeroes: Most of blaster wielding characters start to feel the same after a while and You're either playing Luke,Vader,Anakin,Obiwan. F*%K Bossk.  They've chosen to choose not 1 but 2 BB units as heroes. How cool is that....   \r\n\r\nIn the end it doesn't even matter. Its EA. It's in the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Game is no longer playable except for the Campaign and Co-op modes, every other game mode which requires more than 2 players can not be played. this is because majority of people playing this game at the time of this review are playing it through the KYBER mod which is a pay to play service, not available to the public. KYBER developers ask people to pay them a monthly fee through patreon in order to be allowed to play Battlefront 2 online. this practice has destroyed the games playability outside that service, and at the time of this review KYBER developers have no intention of releasing it to the public after more than 3 years despite constantly giving false hope. This game is no longer playable and not worth spending the money on. the only fix would be if the games developers brought out their own server browser to eliminate KYBER developers illegal cash grab scheme. Again, this game is NOT Playable and not worth the money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "cheating is making the game unplayable",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unfortunate to see a game with such a great multiplayer core be ruined by lack of attention & hack abuse. Haven't played a single game of BF2 in almost a week without rampant hackers so I'm just going to save the headache & uninstall. Implement a system that actually punishes these actions and I'll re-download. Tons of fun when actual people were playing, but not worth the headache of waiting 8-15 minutes for a game for a flying Bossk to teleport your entire team off the map as soon as you spawn.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's sadly inactive now. I wouldn't be able to recommend it anymore since me and my friend cannot find any people to match with anymore across several game modes.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}