{
  "positive": [
    {
      "review": "This game is incredible. I first played it at launch in 2013, and after suffering through Battlefield 6, and promptly uninstalling it. I decided to revisit Battlefield 4. I couldn’t be happier that I did. Returning to this masterpiece reminded me exactly why I’ve been a Battlefield fan since the days of Battlefield 1942.\n\nThe Levolution in BF4 is far superior to its modern counterpart. The level design, the pacing, and most importantly, the gunplay all eclipse the bland, overproduced chaos of Battlefield 6—otherwise known as Call of Duty: Rebooted.\n\nBattlefield 4 delivers a complete gaming experience: moments of pure chaos balanced with stretches of calm where strategy and planning actually matter. Every shot counts, and none of that artificial bloom, no background algorithms nudging your luck. You either hit your target, or you don’t. It’s honest, raw, and absolutely brilliant.",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "I played this recently and it’s great, no modern garbage like passes or clown skins, just that serious BF4 vibe. It runs smoothly and the graphics look almost the same as BF6. The only issue is most servers are dead; when you do find active ones, everyone just fights in the same tunnel or chokepoint, which gets repetitive and boring after a while.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Goated game. If BF6 ever crashes and burns (hopefully not), I'll return to this",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Single player mode is HORRIBLE. full of bugs. Laughable AI enemies and squad members. Online has a limited US population left. I feel like this was when Battlefield \"started\" to be fun again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Battlefield loop in a nutshell:\n\n1. Launch game\n2. Die\n3. Die again for 15 times\n4. Get kill\n6. Get cool guns\n7. Get attachments\n9. Play fav map\n10. Everyone is telling you to take a shower\n11. Sleep\n12. Wake up\n13. Repeat",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Trash ahh campaign. Only bought it for multiplayer and it didn't disappoint me. Love that there are still some active servers.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The game as always is very fun. What I dislike is that: I've upgraded my PC and I am using Win 11 and now it sometimes the game crashes or completly freeze up the PC and requires a restart",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good shooter. So realistick game. Everyone should try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2025 you can still find people waiting to get into a lobby best battlefeild game iv ever played the love that went into maps and guns think about this bf6 came out with 40 guns and only 4 handguns this game when it came out was like 80 guns and 30 side arms its night and day towers come down in bf4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would consider this to be a very good game and still has very open servers and runs very well on almost every pc or laptop that can handle it. a little frustrating that you die almost every time you spawn and the spawns are also very frustrating. still would recommend to any player looking to play an old game that still runs very well. servers are pretty much the only way you can play except for the campaign but regardless it is a very well played game and still has a massive fan base considering the age.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It does have some glitches but it's a very good game. Just check out by yourself, not gonna speak too much. It is NICE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is still fun after all this time i personly  got this for 5 euros because it was on sale and if you the premium version then you will get  every add on and you will get battlepack wich give good stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took this game for granted at launch back on console, this game inclusive of its DLC is a masterpiece. Two thumbs up from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OG battlefield, wish we could go back to this era. still one of the best together with bf1 and bf3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play this instead of battlefield 6.  Guns and weapons and vehicles that actually do damage, no battle royale, and no pay wall slop put into your face everytime you launch the game.  This game was actually crafted and given a purpose. Every thing actually worked like it should. Battlefield 6 is rushed and after the update today that basically changed barely anything wrong with the game, i think i'll stop playing bf6 from now on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's hard to believe that Battlefield 4 was released back in 2013, the graphics is way too good and was much ahead of it's time. Absolutely one of the greatest FPS game series ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If EA remade this game, god would forgive them for all their sins frfr. \r\n\r\nFUCK THE TBAG CLAN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite battlefields I've been able to play. Unfortunately, there is no way to get the campaign mission unlocks now. So if you want a P90 or a Saw, the devs told you to go f*** yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got this game about a year ago as of writing this review, the game wouldnt open when i first got it and nothing i did would help, but i started getting bored off the same games id always play so i redownloaded it- it works all of a sudden lol, good game and good story, 2nd best battlefield game right below BF3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BF4 is pure chaos and beauty. Explosions, destruction, teamwork — everything feels epic. The campaign might be short, but it’s cinematic, intense, and actually emotional at times. And the multiplayer? Still unmatched.\r\nEven a decade later, it still hits different.\r\nRating: ★★★★★",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mutliplayer is good fun (but the fact you need to manually update Punk Buster is ridiculous and lazy of EA/DICE). Singleplayer campaign is some of the most glitchy, immersion-breaking, cliche stuff ever - but an okay romp of shooting, unbearable cutscenes, stereotypical characters, and middling voice acting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best BF game i played, story is very good(personaly), kinda sad that you couldn't sacrifice yourself to save the Valkyrie and Irish in the end wasnt that lucky. About multiplayer i cant say anything because i havent played it. short story long- story is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak Battlefield.  Been out for years and it's STILL the best BF experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Old game, yes, but I wanna write something about it because this game meant a lot to me at some point. Super fun, the graphics are nice, the maps are good, some of them are great, variety in terms of weapons, classes and other unlockables, the campaign was really fun and good as well. If you're chill and you don't rage easily, chances are this is gonna be fun for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game. Not perfect at launch but stood the test of time. Got me into the world of battlefield. If you can find it on sale get it as the multiplayer scene is still alive and  lots of dedicated groups making this happen.\nWe don't talk about the campaign.\nRest in peace Old Yellow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best is battlefield 3 but 4 is as  close as we will get advancing on from that. GG loved it from its birth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played 20 hours intending to be a tactical squad leader and bring honour to my team.\n\nInstead, I crashed a jet into a skyscraper, revived an enemy by accident, and got kicked for “excessive C4 creativity.” Every match started as strategy and ended as spontaneous urban demolition.\n\nNow I no longer fear death—only elevators. 10/10, the real battlefield was the friends I team-killed along the way.\n\nHours on record: 19.6\nRecommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend got obliterated by a fucking railgun in front of my eyes, my life will never be the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Лучшая игра в серии. Потрясающие карты, транспорт, оружие, прокачка уровней. Нет лучше части, чем эта. Battlefield 6  свернул не туда, и стал похож на COD. Увы.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A true Battlefield, pure large-scale sandbox warfare without holding any punches. The game still looks incredible and is packed with content.\n\nIn my opinion, it’s the Battlefield that still has the strongest sense of community, with dozens of custom servers full of dedicated players logging in every day. You just can’t go wrong with this one. \n\nAbsolutely still worth playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best BF I played so much of it on my PS and I thought 1 was good too but the maps and weapons and vehicles there is just too much to not love this game one of my favorite pvp games ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only play solo campaigns in these games. That being said this is one of my favorites! The characters are really good and the choice you're given at the end of the game is actually pretty difficult lol. But it gives you a reason for 3 play-through's. Level design is good and leaves a lasting impression. Gun-play is great. One of my favorites FPS features is the \"X\" on the cross-hairs on a kill shot. Really wish every game employed this feature, it's just satisfying. This is one of the best in a dying FPS campaign age. Wish I could have more, 1 was okay but V really dropped the ball.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had 3 teammates shooting an enemy on the face  for 5 minutes straight  during the campaign without killing him 10/10 AI",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Battlefield 4 is a large-scale first-person shooter developed by DICE and released in 2013. Built on the Frostbite 3 engine, it emphasizes massive multiplayer warfare, destructible environments, and combined-arms combat across land, sea, and air. It refines the modern military formula established by Battlefield 3 with improved visuals, smoother gameplay, and greater tactical depth.\n\nMultiplayer is the centerpiece. Matches support up to 64 players on PC and modern consoles, blending infantry, vehicles, and aircraft in dynamic battles. The class system—Assault, Engineer, Support, and Recon—returns, encouraging teamwork through distinct roles and gadgets. The gunplay is responsive, with clear recoil patterns and a wide weapon customization system that lets players fine-tune performance for different situations.\n\nThe standout feature remains “Levolution,” where large environmental changes alter the battlefield mid-match. Skyscrapers collapse, dams break, and ships run aground, reshaping map layouts and strategies in real time. It adds unpredictability and spectacle, giving Battlefield 4 a unique identity among shooters of its era.\n\nThe campaign follows a U.S. squad caught in a geopolitical conflict involving China and Russia. It’s more cinematic than deep, offering set pieces and high production values but limited replayability. The narrative exists mainly as a tutorial for multiplayer mechanics.\n\nTechnically, Battlefield 4 launched with major performance and server issues that damaged its early reputation. However, DICE steadily patched and stabilized the game, eventually turning it into one of the most polished and reliable entries in the series. Today, it runs smoothly with strong optimization and minimal bugs.\n\nAudio-visual presentation remains exceptional. The sound design delivers powerful immersion—gunfire, explosions, and radio chatter all feel authentic. The graphics, even years later, hold up due to strong lighting, detailed textures, and large-scale effects.\n\nOverall, Battlefield 4 stands as one of the franchise’s best-balanced titles. It combines tight gunplay, large-scale tactics, and evolving maps into a complete and rewarding experience. Despite its rough launch, it became a benchmark for modern military shooters and remains a fan favorite for its depth, teamwork, and enduring replay value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Battlefield 4 is the last modern warfare Battlefield title that is not buried under clownish cosmetic garbage, manipulative FOMO battlepasses and microtransaction schemes designed to milk players while rewarding mindless, short attention span dopamine brain dead clowns instead of actual gameplay.\n\nGod, gaming in 2025 is so depressing, and every year feels like another step deeper into this soulless shithole of an industry.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10 hours campaign and 35 hours multiplayer that is still very active in 2025, PERFECT!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THIS GAME! I SOLD MY WIFE AND KIDS JUST SO I COULD AFFORD TO PLAY THIS GAME AND NEVER WORK AGAIN! I WOULD 100% RECOMMEND!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have an ungodly amount of time sunk into this game on PS3, and I have loved every second of it. I will miss you Battlefield 4, you got me hooked on a very good series that I absolutely adore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ohh, sweet 2013-14.\nHow I wish I could relive you for just a moment...\n\nThis game is as close I can get from it and it's still good a decade later, go and PTFO now!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Flashbang simulator, great way of seeing god every 5 seconds.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love committing murder (in game not actually but maybe ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best FPS game experience you will ever have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "THIS IS THE GAME. BF6 is trash compared to how well this game plays and feels. Why do new things suck as of late?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like the realism in regards to buildings blowing up. I do like the different maps and game plays that are available.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have over 1000 hours on Xbox and over 100 here on PC. There is too much that I like about this game to go into full detail.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best battle field yet, bf6 is close to this but they couldve done better",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "really good game, battlefield 6 is a pile of garbage.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "An absolute classic, over 900h on Origin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some say the greatest Battlefield of All Time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Peak Early 2000s older brother core game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Epic campaign experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUCK EA PLAYER APP IT IS SHITTY AS HELL\n\nON THE OTHER HAND BATTLEFIELD 4 IS <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's still just as fun as the day it was released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than BF6 as both games stand in November 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better then any other battlefield .",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Get it for 20 bucks like I did... great game....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just amazing story even thought it has some bugs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great games and always has been",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought it just because I loved it as a kid",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is better than my whole life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Play this or BF3 instead of the COD clone.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the best video games ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best battle game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very awesome battlefield game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its just a very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story mode is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ik vind het gewoon leuk om mensen neer te schieten.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Как понять что хост дayн\n- Метро 2014",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "//please turn off your naughty word filter//\r\n\r\nthis game throat fucks battlefield 6",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "hardcore conquest gets me hard like nothing else",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game saved my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, plane good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a game...loved it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best battlefield game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Glad to see people keeping this game alive",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "why this game its not playing anymore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Battlefield",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game like COD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best BF game ever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "We want remake of this masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nyc game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best battlefield",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very hard and Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its better than bf6",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best battlefield",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best battlefield",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still the best",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "\"You've been kicked by Punkbuster.\"\nThis game is 12 years old. I shouldn't have to troubleshoot it to play.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Battlefield 4 may look impressive on the surface, but the experience quickly falls apart thanks to its notorious launch bugs, constant server crashes, broken hit detection, and rubber-banding that makes every match feel like you’re gaming on dial-up internet. The campaign is bland, the AI is forgettable, and multiplayer often turns into chaos where vehicles dominate, snipers camp across the map, and you spend more time respawning than actually playing. Even years later, the game still suffers from inconsistent netcode and frustrating balance issues that make firefights feel unfair. Meanwhile, Black Ops 7 treated as a hypothetical future title feels like the exact opposite: fast, polished, stable, and designed with crisp gunplay, smooth movement, strong hit detection, and a progression system that actually rewards you instead of punishing your patience. Where Battlefield 4 feels messy, outdated, and unreliable, Black Ops 7 feels modern, consistent, and far more fun to jump into, giving players the tight, responsive gameplay BF4 often fails to deliver.\n\nEDIT : CLOWN REWARDER WILL BE REPORTED AND BLOCKED",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Game is battlefield, as expected, its fun. if it works.\n\nThe reason my review is bad, is because you have to jump through hoops to even play with their anti-cheat, and it doesn't even work.\n\nwhen you first install, the 'punkbuster' program will auto kick you every 5 minutes. the workaround is to go manually download the updated version and install that yourself. and that worked for awhile, but now its back to kicking me every 5 minutes. there was no new update, so I cant seem to fix it  now. (nor should I even have to try so hard. should fucking update itself, why am I intervening??)\n\nThen ontop of that, it doesnt even work as an anti cheat! there are cheaters, wallhackers, aimbots, ect who get kicked from the game by moderators. so why do I have to deal with this BS when its not even doing its job? \n\nDont waste your money on this shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy. Kicked by punkbuster after 5 minutes in game. every time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought it only to play the campaign as I've enjoyed the campaign in the other BF titles, but in this one there is a hindering bug that won't let you advance past a point in the campaign, and you need to do certain actions such as rebinding your keys and pausing for 30 seconds for the game to work again. What's insane is the fact that the issue is 11 years old and in the threads that were opened to signal this issue, the administrators of the forum closed the threads without even trying to say \"This is a known issue, working on a fix\" etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is riddled with bugs in the campaign and in multiplayer. They'll probably never be fixed, given the game's age. If you have to get a Battlefield game, get BF1 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game keeps crashing.  No other problems with the Battlefield series except for this one.  Because of that, I don't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This was a game I enjoyed playing while I had it installed. However, regardless of how this game plays, I can’t recommend anything published by EA. Between their policies, account handling, and overall approach to customers, they’ve earned zero trust from me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is dog shit. totally unplayable on fresh pcs. cant even play campaign without everyone t posing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unable to connect to any server, unplayable, ea and nvidia bugs resolved, strictly server issue...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just buy bf1 instead whatever community is left on this game runs and guns like cod, if slide cancelling was in the game thats all theyd be doing instead of b hopping every corner and camping spawn waiting for little bird or ifv",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Still the best battlefield game in my opinion Feels great to return to it from time to time. But now I get kicked by integrated anticheat \"Punkbuster\" every two minutes on any server. Tried reinstalling game, installing it on different PC, asked my frined to check if he is good, but he has same problem and there seems to be no way to fix it, maybe they REALLY want me to play only new Battlefield 6, who knows.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is a really good game, probably one of the best Battlefields, but EA has not made this work simply on Linux. Instead you have to jump through a few hoops that make the process a bit of a hassle. I would not recommend because of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Youve been kicked by Punkbuster, Youve been kicked by Punkbuster, Youve been kicked by Punkbuster.  \nBye,  delete and  forget.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a really good game but i dont recommend it for now because the campaign is broken and you wont be able to unlock a lot of weapons for multiplayer",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Battlefield 4 is great, but PunkBuster makes multiplayer unplayable [i] on top [/i] of being spyware.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The absolute shitties game known to man... I genuinely do not know where to begin with the bullshit that this game provides, and let me tell you it's top notch bullshit... From mechanics, to the in-game AI, to weapons etc. it's all shit. Please do not waste your money on this dumb EA scam. ANY OTHER GAME is better than this shit. Truly disappointed....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Did you teamkill? welp I hope you like playing the single player cuz now your perm banned from every server",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass game kicked by punkbuster every game do not buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No longer works on steam deck.  Well done EA Anticheat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Literally american war propaganda",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mfw the building that always falls down falls down. :| reddit: :O",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For making me install your fuckass app",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "story is full of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "needs better linux support",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate you punkbuster.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just wasn't for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck ea",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dull",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant even play the game anymore because EA is a fucking awful and retarded company",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "All is fun and game, until you swim in South China Sea campaign Mission.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "\"You've been kicked by Punkbuster.\"\nThis game is 12 years old. I shouldn't have to troubleshoot it to play.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game is battlefield, as expected, its fun. if it works.\n\nThe reason my review is bad, is because you have to jump through hoops to even play with their anti-cheat, and it doesn't even work.\n\nwhen you first install, the 'punkbuster' program will auto kick you every 5 minutes. the workaround is to go manually download the updated version and install that yourself. and that worked for awhile, but now its back to kicking me every 5 minutes. there was no new update, so I cant seem to fix it  now. (nor should I even have to try so hard. should fucking update itself, why am I intervening??)\n\nThen ontop of that, it doesnt even work as an anti cheat! there are cheaters, wallhackers, aimbots, ect who get kicked from the game by moderators. so why do I have to deal with this BS when its not even doing its job? \n\nDont waste your money on this shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy. Kicked by punkbuster after 5 minutes in game. every time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had a bad experience when i was playing story, there was a mission (battle ship wreckage)  in one part there was a diving part and i got stuck there then i started to stop and start the game again and again and it was annoying.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "full of cheaters. Spankerfield is free, open source, and easy to download. pretty much everyone uses it. this game is ONLY HvH",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Now, don't let the nostalgia fool you, Battlefield 4 is worse than the ones that came before.\n\nThe story has horrible writing, it literally starts with a flash foward of you letting your squad leader drown in a car, while, on the same mission, 2 minutes before it actually happens it makes you cut his leg in a supposed \"tense\" moment to get him out of some debris so he doesn't die there... as if that matters or as if I forgot what happened on the start of the mission.... and it doesn't stop there, the game tries to make you feel bad and worried about your squadmates even though they have NO PERSONALITY and even though the story keeps killing characters willy nilly, [spoiler]They even show you an actual interesting character, Dima from the previous game, and he just pulls a Black Op's Reznov, gets you out of a prison and fucking dies on the end of the same mission, wow, just wow. They killed off the most interesting character in the game to do a Call Of Duty refference, on Battlefield.[/spoiler], The game actively retcons all you did in 3 saying: despite all that war still broke out LOL.\nAnd still, it wouldn't excuse a bad review, but there's so much more...\n\nFor starters, on the badly written campaign, you are given a new mechanic, press Q to tell your squadmates shoot the designated enemies, this would have been a fresh interesting mechanic to play if it wasn't made useless by another mechanic: YOUR SQUADMATES DON'T DO DAMAGE, they don't even supress the enemy, actually, the enemy tends to ignore them and just focus you, so, on every single firefight, you have to kill every single enemy while every single enemy shoots YOU.\n\nEven then, the campaign would still be playable if it wasn't for the fact that it is PLAGUED by bugs. When I played on console, every time i stopped playing the campaign to switch games, play multiplayer or just to turn the console off, the ENTIRE PROGRESS was reset and had to play from the very first mission. Now, on PC I'm encountering bugs that I've never seen before, phasing through the floor and falling into the void, invisible walls appearing exactly where I need to advance (sometimes, somehow, tabbing out of the game and tabbing back in fixes this), enemies not spawning (need to kill all enemies to advance a checkpoint)...\n\nMoving to multiplayer, the only good thing I can say about it is that Levolution was a very interesting and fresh concept that works, and somehow EA has actively decided to ignore it and not use it on any other Battlefield game despite the nº1 thing that the community asks for.... (It's EA they don't know what made their games a success) and it has elevators.\n\nEverything else in multiplayer is just a watered down version of Battlefield 3: despite the levolution, normal destruction was toned down even more, vehicles are faster and repairing is also faster, so the old problem of engineer + vehicle = unkillable was worsened. Movement was made even faster and the penalties of running, jumping and shooting were toned down to promote a faster paced combat, which makes the new mechanic, leaning from corners actually obsolete. Maps were less big and less open than on 3, they even took off runways for the airplanes so you just spawn on one on the air. Classes feel less specialized than on 3 despite keeping most gadjets, more focus on individual play. The entire game feels less grounded and more arcadey than 3\n\nThen you have the battlepacks... the precursor of lootboxes and microtransactions, you can get them through play, but they inflated the camos for the guns, the camos for the characters, the different slots for different gun attachments... you could grind levels to get battlepacks but half of the battlepack is going to give you attachments for a gun that you don't even have yet. Want the acog sight for your favourite weapon that you use? good luck! it doesn't matter that you unlocked the acog for this rifle, this other rifle needs a whole other new acog.\n\nIt also kept the DLC tradition of BF3, selling a bajillion map dlcs, the funny thing is: they released one with maps from BF3 but reimagined and they literally just made them worse, Operation Metro on Conquest has 1 flag less, which effects the entire balance of the map. Caspian border, which was this nice, big, open map on BF3 is now a smaller map with a huge wall in a corner that interrupts all flow the original had, then they made another DLC that heavily hinted the mechs and motherships and showcased the dropships from 2142.... I'll just say that 2042 just feels like a worse insult now.\n\nThis game right here is where EA started to show that they have no idea what they are doing with their own Battlefield games, I want to believe 6 will be good but they don't even know what makes their games to succeed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Battlefield 4 may look impressive on the surface, but the experience quickly falls apart thanks to its notorious launch bugs, constant server crashes, broken hit detection, and rubber-banding that makes every match feel like you’re gaming on dial-up internet. The campaign is bland, the AI is forgettable, and multiplayer often turns into chaos where vehicles dominate, snipers camp across the map, and you spend more time respawning than actually playing. Even years later, the game still suffers from inconsistent netcode and frustrating balance issues that make firefights feel unfair. Meanwhile, Black Ops 7 treated as a hypothetical future title feels like the exact opposite: fast, polished, stable, and designed with crisp gunplay, smooth movement, strong hit detection, and a progression system that actually rewards you instead of punishing your patience. Where Battlefield 4 feels messy, outdated, and unreliable, Black Ops 7 feels modern, consistent, and far more fun to jump into, giving players the tight, responsive gameplay BF4 often fails to deliver.\n\nEDIT : CLOWN REWARDER WILL BE REPORTED AND BLOCKED",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I bought it only to play the campaign as I've enjoyed the campaign in the other BF titles, but in this one there is a hindering bug that won't let you advance past a point in the campaign, and you need to do certain actions such as rebinding your keys and pausing for 30 seconds for the game to work again. What's insane is the fact that the issue is 11 years old and in the threads that were opened to signal this issue, the administrators of the forum closed the threads without even trying to say \"This is a known issue, working on a fix\" etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is riddled with bugs in the campaign and in multiplayer. They'll probably never be fixed, given the game's age. If you have to get a Battlefield game, get BF1 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game keeps crashing.  No other problems with the Battlefield series except for this one.  Because of that, I don't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This was a game I enjoyed playing while I had it installed. However, regardless of how this game plays, I can’t recommend anything published by EA. Between their policies, account handling, and overall approach to customers, they’ve earned zero trust from me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is dog shit. totally unplayable on fresh pcs. cant even play campaign without everyone t posing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unable to connect to any server, unplayable, ea and nvidia bugs resolved, strictly server issue...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has 10+ years and still has tons of critical bugs in campaign that blocks progression like underwater wil inside ship and stuck boat when you about to blow Chang ship.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one of the better battlefield titles. played a few hundred hours via origin. good game.\n\nhowever, [u][b][h1]DO NOT BUY ![/h1][/b][/u]\n\n*Most* of the servers have the special sort of admin.\nFaking player counts, banning for no reason, blocking everyone else with decent stats from joining, etc.\nAlso, I have zero clue why I am banned from like half the servers when the only thing I could find online was a dismissed cheating accusation against me; honestly not sure if some of the servers ban you for an unsubstantiated report.\nEither way, expect the reddit mod variety of server admins.\n\nThe punkbuster issues can easily be fixed by using the latest pbsvc and pbsetup tools.\n[b]nevermind. Punkbuster is absolute garbage. Literally outplaying itself. During installation the drivers and files get installed to SysWOW64 but it tries to find and communicate with files in System32. Manually copying them is not enough. Sometimes the linking works, sometimes, I get kicked from punkbuster mid game. Not worth it. RIP BF4.[/b]\nAnd this last kick just hurt; chopper was chasing me and just as it was close to me and I lined up the RPG and clicked; *kick* -_-\n\nBeyond that, There are still many max level players in the game and >90% of them are cheesing / abusing every angle they can.\n\nThis game was fun when it was new, But these days, do yourself the favor and just forget about it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just buy bf1 instead whatever community is left on this game runs and guns like cod, if slide cancelling was in the game thats all theyd be doing instead of b hopping every corner and camping spawn waiting for little bird or ifv",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Still the best battlefield game in my opinion Feels great to return to it from time to time. But now I get kicked by integrated anticheat \"Punkbuster\" every two minutes on any server. Tried reinstalling game, installing it on different PC, asked my frined to check if he is good, but he has same problem and there seems to be no way to fix it, maybe they REALLY want me to play only new Battlefield 6, who knows.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Youve been kicked by Punkbuster, Youve been kicked by Punkbuster, Youve been kicked by Punkbuster.  \nBye,  delete and  forget.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played this on the Xbox when it dropped but it doesn't provide controller prompts in-game. You need to maneuver some menus with the mouse and it ends up feeling awful on controller. Do not recommend :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The absolute shitties game known to man... I genuinely do not know where to begin with the bullshit that this game provides, and let me tell you it's top notch bullshit... From mechanics, to the in-game AI, to weapons etc. it's all shit. Please do not waste your money on this dumb EA scam. ANY OTHER GAME is better than this shit. Truly disappointed....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Did you teamkill? welp I hope you like playing the single player cuz now your perm banned from every server",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass game kicked by punkbuster every game do not buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No longer works on steam deck.  Well done EA Anticheat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mfw the building that always falls down falls down. :| reddit: :O",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For making me install your fuckass app",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "story is full of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "needs better linux support",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate you punkbuster.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just wasn't for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck ea",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dull",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant even play the game anymore because EA is a fucking awful and retarded company",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "All is fun and game, until you swim in South China Sea campaign Mission.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "\"You've been kicked by Punkbuster.\"\nThis game is 12 years old. I shouldn't have to troubleshoot it to play.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game is battlefield, as expected, its fun. if it works.\n\nThe reason my review is bad, is because you have to jump through hoops to even play with their anti-cheat, and it doesn't even work.\n\nwhen you first install, the 'punkbuster' program will auto kick you every 5 minutes. the workaround is to go manually download the updated version and install that yourself. and that worked for awhile, but now its back to kicking me every 5 minutes. there was no new update, so I cant seem to fix it  now. (nor should I even have to try so hard. should fucking update itself, why am I intervening??)\n\nThen ontop of that, it doesnt even work as an anti cheat! there are cheaters, wallhackers, aimbots, ect who get kicked from the game by moderators. so why do I have to deal with this BS when its not even doing its job? \n\nDont waste your money on this shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy. Kicked by punkbuster after 5 minutes in game. every time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had a bad experience when i was playing story, there was a mission (battle ship wreckage)  in one part there was a diving part and i got stuck there then i started to stop and start the game again and again and it was annoying.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "full of cheaters. Spankerfield is free, open source, and easy to download. pretty much everyone uses it. this game is ONLY HvH",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Now, don't let the nostalgia fool you, Battlefield 4 is worse than the ones that came before.\n\nThe story has horrible writing, it literally starts with a flash foward of you letting your squad leader drown in a car, while, on the same mission, 2 minutes before it actually happens it makes you cut his leg in a supposed \"tense\" moment to get him out of some debris so he doesn't die there... as if that matters or as if I forgot what happened on the start of the mission.... and it doesn't stop there, the game tries to make you feel bad and worried about your squadmates even though they have NO PERSONALITY and even though the story keeps killing characters willy nilly, [spoiler]They even show you an actual interesting character, Dima from the previous game, and he just pulls a Black Op's Reznov, gets you out of a prison and fucking dies on the end of the same mission, wow, just wow. They killed off the most interesting character in the game to do a Call Of Duty refference, on Battlefield.[/spoiler], The game actively retcons all you did in 3 saying: despite all that war still broke out LOL.\nAnd still, it wouldn't excuse a bad review, but there's so much more...\n\nFor starters, on the badly written campaign, you are given a new mechanic, press Q to tell your squadmates shoot the designated enemies, this would have been a fresh interesting mechanic to play if it wasn't made useless by another mechanic: YOUR SQUADMATES DON'T DO DAMAGE, they don't even supress the enemy, actually, the enemy tends to ignore them and just focus you, so, on every single firefight, you have to kill every single enemy while every single enemy shoots YOU.\n\nEven then, the campaign would still be playable if it wasn't for the fact that it is PLAGUED by bugs. When I played on console, every time i stopped playing the campaign to switch games, play multiplayer or just to turn the console off, the ENTIRE PROGRESS was reset and had to play from the very first mission. Now, on PC I'm encountering bugs that I've never seen before, phasing through the floor and falling into the void, invisible walls appearing exactly where I need to advance (sometimes, somehow, tabbing out of the game and tabbing back in fixes this), enemies not spawning (need to kill all enemies to advance a checkpoint)...\n\nMoving to multiplayer, the only good thing I can say about it is that Levolution was a very interesting and fresh concept that works, and somehow EA has actively decided to ignore it and not use it on any other Battlefield game despite the nº1 thing that the community asks for.... (It's EA they don't know what made their games a success) and it has elevators.\n\nEverything else in multiplayer is just a watered down version of Battlefield 3: despite the levolution, normal destruction was toned down even more, vehicles are faster and repairing is also faster, so the old problem of engineer + vehicle = unkillable was worsened. Movement was made even faster and the penalties of running, jumping and shooting were toned down to promote a faster paced combat, which makes the new mechanic, leaning from corners actually obsolete. Maps were less big and less open than on 3, they even took off runways for the airplanes so you just spawn on one on the air. Classes feel less specialized than on 3 despite keeping most gadjets, more focus on individual play. The entire game feels less grounded and more arcadey than 3\n\nThen you have the battlepacks... the precursor of lootboxes and microtransactions, you can get them through play, but they inflated the camos for the guns, the camos for the characters, the different slots for different gun attachments... you could grind levels to get battlepacks but half of the battlepack is going to give you attachments for a gun that you don't even have yet. Want the acog sight for your favourite weapon that you use? good luck! it doesn't matter that you unlocked the acog for this rifle, this other rifle needs a whole other new acog.\n\nIt also kept the DLC tradition of BF3, selling a bajillion map dlcs, the funny thing is: they released one with maps from BF3 but reimagined and they literally just made them worse, Operation Metro on Conquest has 1 flag less, which effects the entire balance of the map. Caspian border, which was this nice, big, open map on BF3 is now a smaller map with a huge wall in a corner that interrupts all flow the original had, then they made another DLC that heavily hinted the mechs and motherships and showcased the dropships from 2142.... I'll just say that 2042 just feels like a worse insult now.\n\nThis game right here is where EA started to show that they have no idea what they are doing with their own Battlefield games, I want to believe 6 will be good but they don't even know what makes their games to succeed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Battlefield 4 may look impressive on the surface, but the experience quickly falls apart thanks to its notorious launch bugs, constant server crashes, broken hit detection, and rubber-banding that makes every match feel like you’re gaming on dial-up internet. The campaign is bland, the AI is forgettable, and multiplayer often turns into chaos where vehicles dominate, snipers camp across the map, and you spend more time respawning than actually playing. Even years later, the game still suffers from inconsistent netcode and frustrating balance issues that make firefights feel unfair. Meanwhile, Black Ops 7 treated as a hypothetical future title feels like the exact opposite: fast, polished, stable, and designed with crisp gunplay, smooth movement, strong hit detection, and a progression system that actually rewards you instead of punishing your patience. Where Battlefield 4 feels messy, outdated, and unreliable, Black Ops 7 feels modern, consistent, and far more fun to jump into, giving players the tight, responsive gameplay BF4 often fails to deliver.\n\nEDIT : CLOWN REWARDER WILL BE REPORTED AND BLOCKED",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I bought it only to play the campaign as I've enjoyed the campaign in the other BF titles, but in this one there is a hindering bug that won't let you advance past a point in the campaign, and you need to do certain actions such as rebinding your keys and pausing for 30 seconds for the game to work again. What's insane is the fact that the issue is 11 years old and in the threads that were opened to signal this issue, the administrators of the forum closed the threads without even trying to say \"This is a known issue, working on a fix\" etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is riddled with bugs in the campaign and in multiplayer. They'll probably never be fixed, given the game's age. If you have to get a Battlefield game, get BF1 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game keeps crashing.  No other problems with the Battlefield series except for this one.  Because of that, I don't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This was a game I enjoyed playing while I had it installed. However, regardless of how this game plays, I can’t recommend anything published by EA. Between their policies, account handling, and overall approach to customers, they’ve earned zero trust from me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is dog shit. totally unplayable on fresh pcs. cant even play campaign without everyone t posing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unable to connect to any server, unplayable, ea and nvidia bugs resolved, strictly server issue...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has 10+ years and still has tons of critical bugs in campaign that blocks progression like underwater wil inside ship and stuck boat when you about to blow Chang ship.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one of the better battlefield titles. played a few hundred hours via origin. good game.\n\nhowever, [u][b][h1]DO NOT BUY ![/h1][/b][/u]\n\n*Most* of the servers have the special sort of admin.\nFaking player counts, banning for no reason, blocking everyone else with decent stats from joining, etc.\nAlso, I have zero clue why I am banned from like half the servers when the only thing I could find online was a dismissed cheating accusation against me; honestly not sure if some of the servers ban you for an unsubstantiated report.\nEither way, expect the reddit mod variety of server admins.\n\nThe punkbuster issues can easily be fixed by using the latest pbsvc and pbsetup tools.\n[b]nevermind. Punkbuster is absolute garbage. Literally outplaying itself. During installation the drivers and files get installed to SysWOW64 but it tries to find and communicate with files in System32. Manually copying them is not enough. Sometimes the linking works, sometimes, I get kicked from punkbuster mid game. Not worth it. RIP BF4.[/b]\nAnd this last kick just hurt; chopper was chasing me and just as it was close to me and I lined up the RPG and clicked; *kick* -_-\n\nBeyond that, There are still many max level players in the game and >90% of them are cheesing / abusing every angle they can.\n\nThis game was fun when it was new, But these days, do yourself the favor and just forget about it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just buy bf1 instead whatever community is left on this game runs and guns like cod, if slide cancelling was in the game thats all theyd be doing instead of b hopping every corner and camping spawn waiting for little bird or ifv",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Still the best battlefield game in my opinion Feels great to return to it from time to time. But now I get kicked by integrated anticheat \"Punkbuster\" every two minutes on any server. Tried reinstalling game, installing it on different PC, asked my frined to check if he is good, but he has same problem and there seems to be no way to fix it, maybe they REALLY want me to play only new Battlefield 6, who knows.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Youve been kicked by Punkbuster, Youve been kicked by Punkbuster, Youve been kicked by Punkbuster.  \nBye,  delete and  forget.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played this on the Xbox when it dropped but it doesn't provide controller prompts in-game. You need to maneuver some menus with the mouse and it ends up feeling awful on controller. Do not recommend :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The absolute shitties game known to man... I genuinely do not know where to begin with the bullshit that this game provides, and let me tell you it's top notch bullshit... From mechanics, to the in-game AI, to weapons etc. it's all shit. Please do not waste your money on this dumb EA scam. ANY OTHER GAME is better than this shit. Truly disappointed....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Did you teamkill? welp I hope you like playing the single player cuz now your perm banned from every server",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass game kicked by punkbuster every game do not buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No longer works on steam deck.  Well done EA Anticheat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mfw the building that always falls down falls down. :| reddit: :O",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For making me install your fuckass app",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "story is full of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "needs better linux support",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate you punkbuster.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just wasn't for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck ea",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dull",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant even play the game anymore because EA is a fucking awful and retarded company",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "All is fun and game, until you swim in South China Sea campaign Mission.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "\"You've been kicked by Punkbuster.\"\nThis game is 12 years old. I shouldn't have to troubleshoot it to play.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game is battlefield, as expected, its fun. if it works.\n\nThe reason my review is bad, is because you have to jump through hoops to even play with their anti-cheat, and it doesn't even work.\n\nwhen you first install, the 'punkbuster' program will auto kick you every 5 minutes. the workaround is to go manually download the updated version and install that yourself. and that worked for awhile, but now its back to kicking me every 5 minutes. there was no new update, so I cant seem to fix it  now. (nor should I even have to try so hard. should fucking update itself, why am I intervening??)\n\nThen ontop of that, it doesnt even work as an anti cheat! there are cheaters, wallhackers, aimbots, ect who get kicked from the game by moderators. so why do I have to deal with this BS when its not even doing its job? \n\nDont waste your money on this shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy. Kicked by punkbuster after 5 minutes in game. every time.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}