{
  "positive": [
    {
      "review": "I like to run around as a medic screaming I'll rez ya! as bullets wizz by, its a pretty fun time.",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "So the first thing I wanna say about Battlefield 1 is that this game is straight up the peak of the entire Battlefield series. No joke, no debate — this is THE ONE.\r\nBF1 hits different. It’s the kind of game where you tell yourself “one quick match” and suddenly it’s 3 AM and you’re screaming “FOR THE EMPIRE” while charging with a bayonet like a psychopath.\r\n\r\nThe graphics?\r\nBro… even in 2025 this game looks cleaner, grittier and way more atmospheric than half the shooters released today. There’s something about the dust, the smoke, the lighting, the explosions — everything feels handcrafted.\r\nThis isn’t graphics, this is cinema. Every match looks like a war documentary shot with a Hollywood budget.\r\n\r\nThe sound design?\r\nDon’t even get me started.\r\nMortars, artillery, the screams, the guns — it all hits your soul.\r\nYou don’t play BF1, you experience it.\r\nHalf the time I’m running through the trenches hearing bullets fly past and I swear I can feel my chair vibrating.\r\n\r\nThe gameplay?\r\nTHIS is Battlefield. Massive chaos, huge maps, teamwork that actually matters, cavalry charging tanks, snipers crying in the distance, and you somewhere in the middle trying to survive the apocalypse.\r\nEvery gun has weight. Every explosion counts. Every push feels like a moment from a war movie.\r\n\r\nAnd the operations mode?\r\nMasterpiece. Peak content.\r\nNo Battlefield before or after managed to capture that feeling of two armies smashing into each other, inch by inch, flag by flag.\r\nThis mode alone carried the franchise on its back.\r\n\r\nVerdict?\r\nBattlefield 1 isn’t just the best Battlefield game — it’s one of the best FPS games ever made, period.\r\nDice caught lightning in a bottle with this one and they never replicated it again.\r\n\r\n10/10, still unmatched, still the king.\r\nThe GOAT of Battlefield.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Truly the best war-based game ever. Incredible sound design. A timeless classic, in my opinion.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "There’s just something about this game that hits differently. I can’t explain it, but it feels so much smoother and more enjoyable than most modern shooters.\nDespite the breathtaking advancements in game engines and the stunning visuals of today’s titles, I find that older games still offer a more satisfying experience.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Несмотря на яркую реализацию и сценарий с неплохим геймплеем, игра страдает от \"замкнутости\" сюжета и его очень быстрого прохождения. Хотелось бы получить более масштабный сюжет с глубокой проработкой персонажей и с более разноообразным количеством миссий. 8–9 часов игрового времени — это слишком мало: ведь после прохождения остаётся лишь блёклый отпечаток игры, а не яркое воспоминание, как могло быть. Однако за тему Первой мировой войны — этот период истории по‑прежнему остаётся одним из самых недооценённых в игровой индустрии, большой жирный лайк, а также за музыкальное сопрвождение, которое мне лично безумно понравилось.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I have played nearly exclusively back to basics (B2B), a gamemode with nothing but bolt action rifles, for the past 140 hours, all without HUD. The game is incredibly immersive, graphics that are so far ahead of it's time it is better looking than games that are 9 years older than it.\r\nThe game is still somehow populated and has no major issues, except maybe balance of some weapons.\r\nThe best way to experience it is clearly operations \r\n(also, B2B runs the same 4 maps exclusively on operations.)\r\nConsider the rest of the review my experience with no HUD B2B.\r\nMaps - There are 4, Monte grappa and Fao Fortress are incredibly stalematey. Both are sniper hell in vanilla, but now there are no vehicules and everyone is a sniper, so very attacker team dependent whether or not you will have fun.\r\nThe other two however, are a toe curling experience. I once had a perfect game on offense as a normal medic, with mk VI revolver, top score, 31 kills, all with no hud, on St. Quentin scar, the best B2B map, no questions asked, rarely stalemates, trench warfare is soooooo satisfying, atmosphere is absolutely incredible. Ballroom blitz first point might be the only section better than the first 2 points on st Quentin Scar, trench segments are incredible, I saw it stalemate exactly twice. \r\nB2B is best when you are forced into a tight space (aka trenches) Having a weapon that is not good in close combat in close combat drastically heightens the ttk, which makes fights feel more scrappy, longer and personal, instead of a who shoots first COD-fest. (I would give so much for a populated B2B Fort de Vaux server.) This brings us to gun (and melee) play.\r\nDEAR GOD THE SHOVEL IS SO SATISFYING.\r\nI have interacted with a person of the opposite sex at least once, getting a 9 killstreak with nothing but a shovel in a trench is comparable. I have 18 service stars (1800 kills) on the shovel, all the bolt actions have 12 in total, second highest is mk VI revolver with 14. The takedown animations make this game feel like a movie (especially with no hud). Hitting a revolver shot hipfire to shovel hit takedown combo is probably the second most satisfying way to kill people after takedowns. It just feels so scrappy. So desperate. The sounds your character makes when he sees a grenade are the best detail ever. Same with mud covering your gun as you fight.\r\nHUD is very unneccesary if you can count to five (ten if you are british and are using the lee enfield) Checking if you can revive teammates with q (and hearing a voiceline) is an option, memorising enemy helmets / pressing q is also an option. Feels much more intense when you have to actually use your brain instead of shooting at the guys under red squares. Not knowing when your points are captured and having to actually look at flags on different points makes it so much more stressful in the best way possible.\r\nMusic fits great\r\nTLDR: Shovel is toe-curlingly satisfying, go play B2B, turn off HUD, trenches are cool, I have a crippling fear of explosives, am going bald from the stress, SHOVEL!!!!!\r\n9/10, cause only feature missing is people blowing up, and not just turning into funny immersion breaking ragdolls, missing limbs would be so cool.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "110 hours in and i'm still loving it. The multiplayer is fantastic and there are so many small details that add to the immersion of the game. My favorite example being if you run into deepish water your guy will hold his gun higher to avoid submerging it. The community is great with a good number of servers still active and throughout the 95ish hours iv'e played on community servers I can't recall ever running into a single hacker. Gameplay is super nice and responsive. The campaign surpassed any expectations I had for a multiplayer focused game in the way I feel it is more engaging than most story focused games iv'e played. Best part is if your strapped for cash the game fairly regularly goes on sale for 3-5 dollars. Kinda long review put short I would 100% recommend battlefield 1.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Most cinematic fps experience ever. even more than 9 years after release the game is still very active. The graphics still hold up incredibly well and the sound design is incredible especially if you enable war tapes mode. 11/10 experience",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is stunning! A Spectacle to say the least. I really really like this game's visuals, voice acting and sound design, I've played many matches, a lot of which pissed me off but It did have its moments too..\r\nIts by far the best Battlefield I've played! The Servers are still active and thriving!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "takes me back to when this released on ps4, still fun here on steam and its not dead, people do still play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid Battlefield game. The environment and sound design really make you feel like you’re in an actual war zone. The map designs are good, the gunplay feels satisfying, and it’s still a very playable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being a hardcore battlefield fan since the day I could sit on my dad's lap and watch him play Battlefield: Bad Company 2, let me tell you that there is no any other game, like Battlefield 1.\n\nThe atmosphere this game has, the sound design. the guns, the handling — it's simply peak in terms of immersion.\n\nThe game has no rivals on the theme of WWI era shooter.\n\nDefinetly worth your money, time and attention.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-play Gang Beats for 1hr\n-Refund The Game\n-buy Battlefield 1 \n\nbest experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best battlefield games I have played, It's my first battlefield and I can say it was worth every single penny the immersion the screams the gun fire that sense of battle everything is unmatched I don't any other battlefield game really did what BF1 what except of BF6 since that has released now.\r\nBut great the community is still widely open and you can find servers availiable all of the time with active people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest battlefield game ever. hope they ll start adding some maps etc soon. wake up DICE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly a masterpiece. Hats off to anyone who is involved creating this incredible game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Battlefield 1 is the perfect intersection of \"War is Hell\" and a Michael Bay movie. It is chaotic and cinematic (even in multiplayer matches).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was my first game in the Battlefield series. To begin, the graphics and visuals still hold pretty well considering the game is almost a decade old. It still has a decent playerbase (>3k), although most of them play Conquest and Operations. The servers dedicated to other game modes are mostly empty, which is honestly a bummer. The class system is amazing and each class has their own gadgets and utility, along with different weapons for each class. The destruction is amazing and the chaos of each map just adds to the fun.\r\n\r\noverall, its a fun game and during sales it can be bought for dirt cheap price. So definitely go for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is not just a game it is a story. About the ones who fought, and died to defend somthing much greater than themselves. For almost a decade this game has been out and it has been played for just as long, and i hope that we never lose sight of the forgotten generation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "battlefield 1 would be peak if it weren't for the playerbase\r\nTLDR; I love this game and i hate the people who play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Battlefield 1[/h1]\n\n[quote][b]Tested on:[/b] ASUS ROG Strix G712LW\n(i7-10875H | RTX 2070 | 32GB RAM)[/quote]\n\nThis is an absolute masterpiece.\nThe game still playable with a good player base, pure multiplayer experience, the matches are really immersive, feels like you're in real battlegrounds.\nHistorically accurate.\nA negative aspect is that until this day the supporter class and its lmgs are pretty op, but they do not ruin the game experience.\n\n--- \n\n[b]Graphics & Visuals[/b]\n[list]\n[*] [b]☑ 10 - 9 (Masterpiece / Peak)[/b]\n[*] ☐ 8 - 7 (Great / Very Good)\n[*] ☐ 6 - 5 (Good / Average)\n[*] ☐ 4 - 3 (Poor / Below Avg)\n[*] ☐ 2 - 0 (Bad / Unplayable)\n[/list]\n\n[b]Sound & Music[/b]\n[list]\n[*] [b]☑ 10 - 9 (Masterpiece / Peak)[/b]\n[*] ☐ 8 - 7 (Great / Very Good)\n[*] ☐ 6 - 5 (Good / Average)\n[*] ☐ 4 - 3 (Poor / Below Avg)\n[*] ☐ 2 - 0 (Bad / Unplayable)\n[/list]\n\n[b]Optimization & Performance[/b]\n[list]\n[*] ☐ 10 - 9 (Masterpiece / Peak)\n[*] [b]☑ 8 - 7 (Great / Very Good)[/b]\n[*] ☐ 6 - 5 (Good / Average)\n[*] ☐ 4 - 3 (Poor / Below Avg)\n[*] ☐ 2 - 0 (Bad / Unplayable)\n[/list]\n\n[b]Gameplay & Mechanics[/b]\n[list]\n[*] ☐ 10 - 9 (Masterpiece / Peak)\n[*] [b]☑ 8 - 7 (Great / Very Good)[/b]\n[*] ☐ 6 - 5 (Good / Average)\n[*] ☐ 4 - 3 (Poor / Below Avg)\n[*] ☐ 2 - 0 (Bad / Unplayable)\n[/list]\n\n[b]Story & Narrative[/b]\n[list]\n[*] ☐ 10 - 9 (Masterpiece / Peak)\n[*] ☐ 8 - 7 (Great / Very Good)\n[*] [b]☑ 6 - 5 (Good / Average)[/b]\n[*] ☐ 4 - 3 (Poor / Below Avg)\n[*] ☐ 2 - 0 (Bad / Unplayable)\n[/list]\n\n[b]Value & Replayability[/b]\n[list]\n[*] ☐ 10 - 9 (Masterpiece / Peak)\n[*] [b]☑ 8 - 7 (Great / Very Good)[/b]\n[*] ☐ 6 - 5 (Good / Average)\n[*] ☐ 4 - 3 (Poor / Below Avg)\n[*] ☐ 2 - 0 (Bad / Unplayable)\n[/list]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Over 300h on EA, picked up on Steam recently.)\n\nDICE had it spot on for Battlefield 1. Really the best Battlefield of the franchise.\nPick it up on sale and enjoy its beautiful campaign and the chaotic operations in multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very immersive WW1 game. The maps are great game modes are great. Really makes you feel like you storming the trenches. Great Battlefield game. Still active after almost 10 years. I would definitely recommend this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I played this game, I felt a strange sensation at first; I really liked it because I had felt the same way in the old COD series and in COD WWII. Those games are great, but Battlefield’s story, mechanics, gameplay, and the way everything is presented—especially if you enjoy Multiplayer—make this game perfect for you. A COMPLETE MASTERPIECE, I HIGHLY RECOMMEND IT!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "260+ hrs played for, indeed the best [b] WWI themed FPS [/b] game among all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The conceptual peak of the Battlefield franchise, evident in ahead of time graphics and visuals, as well as polished gunplay and shooter mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it a good game but only thing that sucks is anti cheats cause it don't do anything still hackers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice and fun game. Valid story mode and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best experience i ever had bro , the chaos dang the adrenaline dangggg , should def play also the campaign bro its the best thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played a lot over on the EA app. This game has some of the best visuals and graphics in Battlefield history.\nIf you are looking for a good WW1 shooter, This is your game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10\r\n\r\nIt has a short and immersive story but aside from that i would say, There is no multiplayer game on the market which is as cinematic and immersive as this game depicting the era of World War. This is a hell of an experience. Must play if you are a fan of old Call of duty or generally a fan of world war games. Unique and realistic gunplay. Variety of maps. Lots of modes. I mean this is the best of the best. Definitely a must play for the fans of World War games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best battlefield game in the series.  Better than cod/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Singleplayer : 6/10\nMulitiplayer: 8/10\nAtmosphere: 8/10\nSound Design: 10/10\nGunplay: 8/10\nOverall : 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games that arent so demandable it is really fun even in 2025 even thought there is 1 australian server but if your looking to buy this wait for the sale it drops down to $2-$5 aud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The campaign is short, but impactful. The first one is definitely my favorite of all of it, but each brings a nice story about war and its atrocities. I don't play much multiplayer, but it's still pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very enjoyable single player game, much like the games I grew up playing so my opinion might be biased. I'm also too late for the game's golden era of multiplayer, so I can't tell you about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Atmosphere is unparallelled and immersive. Memorable maps and great audio.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best BF ever made. Love the large maps and the air, land and sea fights. If you love shooters and getting gased, bombed and shot. This is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like this game overall, but only issue is internet connection bug",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best FPS Game of all time. From the cinematics, to the tone, to the sound design, to the feel and balance of the guns, the unmatched attention to detail can be seen throughout the game. Truly one of the best games of a generation and a must have if you are a fan of the FPS genera.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely loving the cinematic vibe in operations. also how is this game so good looking and not that heavy performance vise ? cant all games be like this ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Insane graphics, excellent gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's 2025 and in my opinion, still one of the best FPS games. Immersion in this game is next level and sound design is elite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the battlefield where it started all for me, It wasn't the first battlefield, But... It was my Battlefield 1.\nThis battlefield dared to do something fresh, to try to make a game set during ww1, and DICE did amazing.\nI grew up on cod and frankly got tired of it, It felt too repetitive in terms of multiplayer.\nand now... I love BF, This game Is amazing, I just wish bots were added to the game, other than that, its good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really like it, but so much troubles on EA site. if u gonna do game launcher, make it steam quality or don't make it pls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good but the launcher is bullshit, it sometimes comes and sometimes doesn't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even after nine years, it still stands strong as one of the best games out there. The graphics are top-tier, and the game remains lively after all this time. It's a must-play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a damn good and polished battlefield game for the tail end of the golden era of gaming, albeit not perfect but hats off to delivering on such a functional and fun game set in a very restrictive era. yes there may be too many semi and full auto weapons but to diverge from that may have eroded the core battlefield experience and the pacing set by past titles. a more realistic game mode could have been delivered to fill that niche. operations was by far the best and most immersive addition to battlefield thus far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just got back into Battlefield 1 and it is still really fun and addicting. Getting a kill is very satisfying, especially as a sniper main. The planes/vehicles are awesome and the destruction is great. Plus, the quests are not a huge grind and you can complete them by just playing. Also, there are almost always 50 or more players in custom servers even after 10 years of the game running. This is easily the best Battlefield I've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This. I am hesitant to recommend the multiplayer to newcomers, because they can have a rough experience playing against good players. Obviously I want the game to be as populated as possible, but it's inevitable that at some point, the good players are sort of ruining the experience for the rest.\r\n\r\nAnd it's not even playing against good players, but not knowing how to find good games - I've read so many comments from people just being stuck on the team that gets the shit kicked out of them, and that's not fun for someone who's struggling with the game's basics.\r\n\r\nEvery time I would try playing with my friends that usually don't play Battlefield, they would join some unbalanced hellhole and I had to try to find a decent server for them, where they would at least have some fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best and most feature-complete Battlefield game since Bad Company 2. Incredible story, gameplay and atmosphere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is fantastic game so cool an nice graphic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Battlefield game ever made\r\n\r\nIve played every game since Bad Company 2 including BF6. This is the best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My family hates me and no longer wants me. this game makes me want to revive archduke franz ferdinand so that it was never made. 100% reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually jumping back to this because of the crap secure boot issue with EA anti cheat and the newer BF games. Too bad EA... too bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🎮Gameplay:\n☐ Terrible.\n☐ Bad.\n☐ Average.\n☐ Good.\n☑ Fantastic.\n\n\n📖Story:\n☐ It Doesn't Have One.\n☐ Horrible.\n☐ Bad.\n☐ Average.\n☑ Good.\n☐ Fantastic.\n\n\n⛺Graphics:\n☐ Potato.\n☐ Bad.\n☐ Average.\n☐ Good.\n☑ Beautiful.\n☐ Masterpiece.\n\n\n🎵Music/Sound:\n☐ Horrible.\n☐ Bad.\n☐ Average.\n☐ Good.\n☑ Amazing.\n\n\n🐞Bugs:\n☐ Game Itself Is One Big BUG.\n☐ Game Breaking Bugs.\n☐ Lots of bugs.\n☑ Few Bugs.\n☐ Nothing.\n\n\n💸Price:\n☐ Full Price.\n☑ Wait For Sale.\n☐ Refund It If You Can.\n☐ Don't Buy It.\n☐ Free.\n\n\n📝Final:\n☐ Terrible.\n☐ Bad.\n☐ Average.\n☐ Good.\n☑ Great.\n☐ Fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the better battlefields but holy fuck the Origin launcher is pissing me off like damn lemme play the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best BF game ever to be created! Also the most fun I've ever had in a game all time! Sadly this will probably be the case in 20 years too.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "brillant game, had for xbox as well, its great, still a fair few matches to be played online as well so bonus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10. it was great, amazing. the gameplay is so much detailed than the previous battlefield. after BF4 campaign not so good as BF3 finally this BF1 campaign felt unique with War Stories. I enjoyed Friends in High Places chapter with air combat that feels so much fun, also the free approach style of stealth in Nothing is Written chapter also sooo good. would definitely revisit the game for the multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best BattleField ever released.\r\nWorks on a potato in the current year and is somehow the most gorgeous release ever put out by the original DICE team before they decided to jump ship due to EA choosing to take over and destroy their reputation.\r\nAll the guns are actually balanced, all the vehicles are fun and all the maps are masterpieces.\r\nIt's just a shame that the playerbase is a teeny bit small now, still nothing to laugh at with an active near 7K players at peak hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "looks and feels realistic. really fun game to play. way better than any COD ive played and my favourite BF game hands down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good FPS game that has a solid multiplayer and a good cainpain and story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has to be top 5 FPS games ever made honestly. Best Battlefield game and prolly the most immersive game I've ever played aswell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun. Strangely enough still is even when I'm getting my ass kicked. It installs the EA client but what can you do. ¯\\_(ツ)_/¯",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Battlefield 1 is a first-person shooter developed by DICE and released in 2016. It shifts the series to World War I, offering a unique mix of historical authenticity and cinematic spectacle. The game stands out for its large-scale multiplayer battles, destructible environments, and immersive presentation that captures the chaos and brutality of early 20th-century warfare.\n\nMultiplayer is the core experience. Up to 64 players fight across massive maps featuring trench warfare, open fields, and urban ruins. The class system—Assault, Medic, Support, and Scout—returns with distinct roles that encourage teamwork. Gunplay feels deliberate and weighty due to the era’s weapon design; rifles, bolt-actions, and early automatic weapons dominate, forcing players to adapt to slower pacing and closer engagements.\n\nVehicles play a crucial role. Tanks, biplanes, and cavalry offer mobility and power, while the game’s “Behemoth” units—massive vehicles like airships, armored trains, and battleships—act as comeback mechanics that can shift the tide of battle. Each map is designed around these large machines, making every match unpredictable and cinematic.\n\nVisually, Battlefield 1 is exceptional. The Frostbite engine delivers realistic lighting, weather, and terrain destruction that make the world feel alive. Explosions send debris flying, dynamic weather changes visibility, and each map—from the deserts of Sinai to the forests of Argonne—has a strong atmosphere. The sound design is equally powerful, with thunderous artillery and haunting period music enhancing immersion.\n\nThe single-player campaign, War Stories, breaks from the linear formula of earlier entries. It tells multiple short, character-driven narratives across different fronts, each with unique gameplay styles and emotional tone. The stories focus on humanity and sacrifice rather than glorifying war, earning strong praise for presentation and tone.\n\nMechanically, the game balances historical accuracy with accessibility. Weapon customization is limited compared to modern settings, but progression systems, medals, and unlocks keep players engaged. The gameplay rewards positioning, coordination, and tactical awareness more than raw reflex.\n\nIn summary, Battlefield 1 revitalized the franchise by taking it back to a rarely explored era and executing it with scale and polish. Its mix of authenticity, spectacle, and teamwork made it one of the most memorable entries in the series. It remains a benchmark for immersive war shooters, blending artistry and design into one of DICE’s most accomplished works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have fun trying to push an  objective on operations when half your team are retard snipers who will get maybe 3 kills the entire round. \r\n\r\nStill great tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Battlefield 1 is and incredibly fun game with a very good campaign with some extremely replayable missions and interesting characters. Multiplayer is insane and I love the selection of classic guns and maps, 100% give this a try.\n\n8.2/10 Frederick Bishop and his missions were the best part of the game and his [spoiler]death was noble.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely fire, BUT, THE INFINITE LOADING SCREEN PROBLEMS ARE REALLY REALLY PERSISTENT. Anyways hella fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BF1 is really good. It's like lightning in a bottle except the developers managed to catch the lightning multiple times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9 year old game and the visuals/gameplay still holds up today. 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is excellent. The story and the gameplay is immersive af. My personal stories are... THE RUNNER, Friends in high places and Avanti Savoia!....\r\n\r\nHighly recommended. \r\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoy this game, have dabbled here and there, and this game does enough right to keep our group coming back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Quality for 10 Years and more educational historic describing real brutal of Great War.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Battlefield GOAT a timeless gem hope the community stays strong and active until the servers are closed. I went back to it after the disappointment of another broken POS Battlefield game. This never gets old or boring they don't make them like this no more. Put in nearly 500 hours on Xbox new to PC and jumped back in from the bottom and it's still worth it. Worth the price of admission even at full price more so than $70 CODfield",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very possibly the best Battlefield EVER made. I must have over 1,000 hours on console and it's an experience you'll never forget. Big focus on class coordination and specialization mixed seamlessly with the gear and setting of WW1. Game of the Decade tbh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still a very good game, this is fun to play on your own and even more fun with friends. I like the weapons in this game and the visuals are stunning, they really immerse you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favourite in the series, absolutely amazing mostly for the old guns, the nauseating pace of everything moving fast and yet your gun shooting slower, the rush of winning a match oh absolutely pick it up on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Because I'm a Turkish guy, I couldn't play 3rd and 4th scenarios. I couldn't kill Ottoman soldiers, even though it is just a game. I couldn't put my flag down. You can call me stupid, but this is pure patriotism and love for my country. \n\nIt is a great game though. However, I will delete it right now and leave 3rd and 4th scenarios unplayed until the day i die. \n\nLove from Turkiye, Neo-Ottoman Empire.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Review[/h1] \r\nI never was much interested in any battlefield, or giant pvp shooters in general. Sometimes WW1 or 2 shooters like Verdun or red orchestra and that’s about it. I decided to buy it mostly for the singleplayer campaign and after playing some multiplayer. It has its pros and cons but is a decent game with its issues\r\n\r\n[u]Multiplayer[/u]\r\nGenerally, its battlefield 3 or 4 gameplay tacked on with a World War 1 skin. You have almost modern sniper scopes, tanks around every corner, people use big satchel charges like tanks are the most common thing to see. Planes are hard to fly and I never bothered to learn them but they can be really annoying killing machines as there are less options to counter them than ever. The presentation is something else. Its still battlefield with its arcade gameplay, but offers many aspects that make up for unique situations, like giant stationary turrets with their cool animation or bayonet charges. I did personally see not so many cheater like in battlefield V, but there probably are a few. My favourite is the operations mode than add a small storyline to the map you play, giving different objectives and dialogues in-between. Although some of the maps have absolute awful spots where stalemates will always be there due to their design probably being made by someone who loved metro in bf3. The Italian map is the worst. Aside that, there are lots of interesting weapons, but I don’t like that the focus is most of the time on automatic weapons. Those are completely accurate and make most single shot weapons obsolete. Switching weapons is another thing, you basically don’t have a modification system, rather every single weapon that is slightly different is a new one. So, you will be able to choose a scoped and non scoped version, both being the same weapon but cluttering at some point your selection menu. This forces you to remember weapons completely by their name. \r\n\r\n[u]Story[/u]\r\nThe singleplayer story follows multiple short stories in World War 1. Some have more interesting stories, some others not. Especially gameplay related. Some stories are rather short and straightforward; some are more open or offer more open levels which can be stealthed. Second feels rather tacked on, the only stealth option you have is throwing stones, silent takedown and sometimes a silenced weapon. Its okay, usually take down this, capture this flag or collect or destroy those 3 items at those 3 spots. Much closer what you do in the multiplayer than what the story offered in the previous games.  The stories also focus on different aspects of the gameplay like tank, flying, special unit suit, infantery, melee/stealth etc. It’s a good standalone aspect, that introduces naturally multiplayer aspects without having to practice them. Despite that some of them can feel boring, especially the desert sections and some of the flying and most of the tank stuff.\r\n\r\n[u]Sound[/u]\r\nSound design is something that I think is the best portion of the game. Graphics aside, which can age over time, a well-made sound palette and songs can make a game forever feel original and good. Voice acting in many different native languages, lots of weapon sounds with echo plus a few good tracks added during gameplay without being overbearing.\r\n\r\n[u]Graphics[/u]\r\nBattlefield one chooses a more stylized graphic that looks almost cartoonish. I guess its to not make the game feel overly uncanny, as some of the cutscenes are so well made it almost looks realistic then it doesn’t. Adding some more colours making it look like a bit stylized keeps the edge off of making it hyper realistic without breaking immersion. Otherwise it mostly looks good, aside animations, especially death can look silly.\r\n\r\n[u]Conclusion/TL;DR[/u]\r\nAll in all, I think its the most fun and unique battlefield game. Although the World War one setting feels more or less like a skin and gameplay is the same as it ever was, with some adjustments. The singleplayer was a breath of fresh air and the presentation of the multiplayer matches better than it ever was.  Just don’t expect anything but an arcade multiplayer shooter with a world war 1 skin.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still alive and well, word of warning to new or returning players: there is a pretty decent skill gap as many of us have been playing for a while so we know the good spots, guns, vehicles, etc. so it might seem like you are dying too much. just stick with your squad and find the role you enjoy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i got trenchfoot and a muddy blowjob all in the same trench. they were 8 months apart but the line didn't move at all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good and good gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Andy McCoy kertoo Battlefield 1:en olleen muiden pelien korvike: \"Se oli ainut hyvä bäfä periaattees\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the gameplay, one of my favorite Battlefield games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing multiplayer however game allows only a weapon either Gewhr or another Rifle I dont recall the name now. How to unlock other weapons in multiplayer modes?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"This software cannot be used at the same time as the game. Please make sure its not running, or restart your PC.: VirtualController\"\n\nTurn off DS4 windows",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really great game, but there's one thing i don't like and doesn't make sense to me, when you're prone on a bumpy terrain and crawl up a bump enough to be able to see enemies, you spot some, you aim, crosshair is clearly on the enemy, you shoot, but your shots actually land on the bump instead, way below where your crosshair is...but the enemy across is doing the same thing as you but shoots you and he land the hits...makes absolutely zero sense to me...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "driving a mark IV whilst being sorrounded by german tanks and being relentless fired by infantry in the campaign really makes you think, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great short campaign and worth the $ on sale\nI'm not a multiplayer but if you are you're getting BF6",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so freaking good. Definite top 3 favorite of the Battlefield games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WHIZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ... HERE COMES THE WHIZZ BANG! (I love this game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best shooter game ever, absloute battlefield 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game. Lot of fun. Awesome atmosphere",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probable cause of ptsd. I wouldn't think I'd like something with realistic graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Battlefield 1 is, for me, the FPS that captures the atmosphere of war better than any other; every time I jump in, the fog-covered battlefields, the intensity of the explosions, and the weight of the period weapons pull me right into the experience. The War Stories hit surprisingly hard with the perspectives they show, while the multiplayer’s massive, chaotic maps always deliver unique, memorable moments. Sure, there are occasional balance issues that can be frustrating, but overall BF1 still offers a cinematic, immersive, and genuinely special experience I haven’t quite found in any other shooter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best Battlefield game that I have played. It still holds up to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "campagin was good and i got this on sale for 2 bucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely based to whoever enjoys history and the chaos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and full of challenges",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Love spending my money on a game that doesn't work! EA app doesn't launch despite hours of repairing files and troubleshooting and on top of that neither does Battlefield. Here's an idea EA. How about you take me out to dinner before you fuck me. Or I guess I could always pay you a visit with a home made nuclear bomb! Fuck you!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I try to lunch the game but i dont even get to the main menu and it crashes and i really want to play but i have tryd like every thing and it just does not work, i do like the game but i cant really like the game if you cant play it know what i mean? (i think it has someothing to do with the anitcheat but IDK so pls help and DEVS  FIX YOUR FUCKING GAME!!!)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Borked on Linux, following the introduction of Javelin Anti-Cheat. Worst of all, this AC is crappier than the one they had before, being reverse engineered before BF6 was even out. Nice one, EA! Fuck you.\n\nWhy update a 10 year old game that was working PERFECTLY fine as of now on Linux, only to break it? smh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Battlefield 1 is the kind of game that welcomes you to World War I by handing you a gun that fires slower than your Wi-Fi on a stormy day, then immediately lets a horse run you over like it’s starring in Fast & Furious 18. You’ll shoot someone six times, they’ll sneeze once, and somehow you’re the one who dies, thanks to hit detection that works perfectly just not for you. Your squadmates might as well be houseplants, because they’ll sprint past your dead body like they’re late to a meeting, refusing to revive anyone unless it’s for emotional support. Unlocking weapons feels like applying for a government permit, requiring endless grinding for something barely better than a bent paperclip. Meanwhile, Black Ops 7 plays like the developers bribed gravity, physics, and the servers to behave: guns aim smoothly, movement is faster than energy drinks allow, and progression hands you new gear so quickly you’ll wonder if you broke something. While Battlefield 1 has you wandering across a map large enough to lose your will to live, Black Ops 7 throws you right into the action with laser guns, sunglasses indoors, and actual hit detection. In short, BF1 feels like historical suffering, while BO7 is a futuristic theme park where everything just shockingly works.\n\nEDIT : CLOWN REWARDER WILL BE BLOCKED AND REPORTED",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Honestly I used to love this game, I sank way too many hours into its multiplayer. But over the past year this game has gone to shit. I Hate it so much now. I used to be able to log onto a match with people just about anywhere round the world, but now its all full of bots who take spots. You can log onto a match and it will say 63 out of 64 payers, which means its almost full then when you get in, you realize that the entire match is bots and there are only 3 dudes playing. And if it was just the bots I could maybe live with it, but its also the hackers, over the past 2 years the hacker have increased in size to make this game unplayable. Its starting to get on the same level as old TF2 before the fix. Guys will turn themselves invisible, or have auto aim and hit you on the other side of the map through a mountain. This game is just down right unplayable for multiplayer in 2025. If you want the campaign, then go buy a different game because the campaign also sucks. Just don't buy this game, I HATE IT AND YOU WILL TOO. Don't waste your money. I've sunk over 1000 hours in this game and I regret spending the last year convincing myself the the devs will come back and fix everything, no they won't. If you had asked me 2 years ago if you should play this game I would have said absolutely! But now, just don't, don't waster your time, your money, or your patience, this game sucks now. 0/5 stars",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "vehicles kill this game now.. there are no servers and the only server that has people is just a rush to get vehicles and 1 shot others.. trash game now since is a dead game.. reimburse if possible or just uninstall... not worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Linux users need not purchase. The new anti-cheat has completely killed the game for linux, there is no fix or remedy. Its dead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst net code in battlefield EVER.\r\nGetting shot from nowhere or from around a wall breaks this game. \r\nHate it. Not worth any dollar. Buy battlefield 4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the release of Battlefield 6, it became impossible to play; there were constant problems connecting to the servers.\nNow there's a problem with AMD drivers.\nI can't even play the game. I don't understand what I spent my money on.\nI'm giving it a negative rating until this is fixed.\n\n\n//После выхода Battlefield 6, играть стало невозможно, постоянные проблемы с подключением к серверам. \nСейчас вообще проблема с AMD Драйверами.\nВ игру вообще не заходит. За что потрачены деньги не понятно.\n Хочу поставить отрицательную оценку, до момента пока это не будет исправлено.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yani ortalama bir silah oyunu. Hiç içine çekmedi ve sürekli aynı şeyi yapıyormuşum gibi hissettim. Ki bir silah ve asker oyununda daha başka ne yapabilirsiniz ki. Call of duty 2 daha fazla ilgimi çekiyor açıkçası.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "story is nice but multiplayer is not really good for new player, lots of tryhard use unfair weapons the biggest facepalm is that it is very hard to unlock meta weapons. if it is your first battlefield then you will just die again and again in multiplayer [spoiler]planes and tank are pain in the ass and fuck motar trucks[/spoiler]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game, but as of now, most of the servers are dead, there is no moderation and now i cant even open it. only buy when on sale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Originally bought the game at launch on Origin (about 250 hours total)\nGame itself was pretty decent, amazing graphics (even in 2025), the mini campaigns are short but alright, then\n\n[b]EA decided to retroactively add an invasive kernel level anti-cheat (EA Javelin) almost 10 years after launch without warning. [/b]\n\nThis did not improve the (already low) cheater numbers in any meaningful way, while causing substantial issues for players and conveniently collecting a large amount of user data for EA:\n\n[list]\n    [*][b]Privacy Risk [/b] - EA Javelin collects a significant amount of data about your system, your usage of it and transmits all of it to EA - According to their privacy policy and user agreement they are not only allowed to use this data for cheat prevention (which would make sense) but also conveniently claim the right to use it for \"improving our products and services\", \"measure the effectiveness of advertising\" as well as share it with a large list of other companies among other things - see section 2 & 3 of their privacy policy\n\n    [*][b] Potential Security Risk due to the high privilege level of the anti-cheat[/b] - There have been multiple occasions where vulnerabilities in similar anti-cheats have been weaponized by malware for privilege escalation - Due to the age of the game this is an even bigger concern since such vulnerabilities might not be patched quickly (or at all) once support fully drops \n\n    [*][b] Breaks Steam Deck Compatibility [/b] - worked perfectly fine before\n\n    [*][b] Breaks Linux Support [/b] - worked perfectly fine before and with Win10 EOL you ether miss important security updates or are forced to switch to Windows 11\n\n    [*][b] Breaks many overlay & screen recording tools [/b]\n\n    [*][b] Breaks all single player mods [/b]\n[/list]",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "No-one playing this game anymore except players from Turkey and China. Utter garbage high ping custom servers, and no one playing from any English speaking nations.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "10 year old game, added anti cheat and bricked it. cant they just leave things alone?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is almost perfect multiplayer FPS. There's just one, big problem - the motherfucking EA launcher. It doesn't let me play this game. I played it for the last time more than a year ago and I had the same problems. I can't recommend it because of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Try to join a server that's populated, and it constantly puts me in a game by myself. 0/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Important historical details are oversimplified or portrayed in a distorted way, which takes away from the authenticity of the setting. It’s apparent that the game presents a biased depiction despite claiming to be inspired by real events.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game might have strong presentation, but I’m choosing not to support it because it’s tied to EA. Their track record with customer treatment and business practices has completely killed my interest in giving them money, no matter how good the game might be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game but wtf is this activation key bs??? apparently its because of a new anti cheat they added years after the game was already released and one of the reviews here says they steal a lot of your data.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks ass worst maps on any game ive ever played, most cheaters then  any games ive ever played, worst mechanics in any battlefield game out there, only play this shit ass game if u have mental problems or if you get beaten by ur dad with anger isseus",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks great with its graphics but not with its storyline, cause it's only a few campaings and after they finish, the only thing to do is play online but you'd be shot real quick. I can't move on, only stay on some stupid maps, constantly die.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story part of the game is so messed up that they haven't told history properly. They wanted to portray whoever you're fighting against as barbarians and murderers, and make themselves look like heroes. If you don't tell history properly in a game like this, I'm sorry, but you're a bunch of assholes. Fuck the game you're making. \n\nOyunun Hikaye kısmında o kadar piçlik varki tarihi doğru düzgün anlatmamışlar kime karşı savaşıyorsanız onları hep barbar ve cani göstermek istemişler ve kendilerini kahraman eğer böyle bir oyunda tarihi dügün bir şekilde anlatmıyorsanız kusura bakmayın ama büyük orosbu cocuğusunuz  yapacağınız oyunun amına koyayım     osmanlıyı çok saçma göstermişler son 2 bölüm osmanlılara karşı oynuyorsunuz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only play single player!!!\nI already owned the game on PlayStation, but unfortunately, I never got to finish it. Since I had a cheat system for my PC, I also bought the PC version and was excited to finally play it to the end. That worked fine until EA decided to add anti-cheat—and that was the end of it.\n\nThe video game industry is the only one that gets to pocket customers’ money without worrying whether the player actually gets to experience the entire game or just a few minutes.\n\nI won’t be supporting such a game developer again anytime soon by buying the same game again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Killed off Linux support, even for the singleplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\" EA Anticheat has detected an incompatible driver. Please update or disable 'c:\\windows\\temp\\atiflash\\atillk64.sys' and restart. (119) \"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gun is disabled so cant spawn,\r\ncant get new gun without playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix the bullshit balancing system and nerf the damn mortars",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT GET THIS ASS GAME I SWEAR I PAID MONEY JUST FOR MULTIPLAYER TO NOT WORK THE CAMPAIGN IS SUPER SHORT AS WELL ONLY AROUND 3 HOURS SO I CANT GET A REFUND REALISTIC GAME OVERALL BUT REALLY UNPLAYABLE I WANTED TO PLAY MULTIPLAYER",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cutscenes,cutscenes,cutscenes, In total, absolute chicken poo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't even play the game, the anticheat keeps booting me out of playing the campaign",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i would recommend this game but at this moment of time i cant even play the game as it crashes when i launch it. so dont buy this game as you wont be able to play it.\r\n\r\nit just says loading javelin anticheat then just closes and does not even crash, it just stops",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck you game is not raning  and fuck to inte fairos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only cheater...devs too stupid to fix it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THE FUCKING EA APP THING STARTING YO PISSED ME OFF, WDYM I HAVE TO ACTIVATE MY ACCOUNT BEFORE I PLAY THE GAME??!! I ALREADY DID THAT!!! FUCK YOUUU EA FUCK YOUUU",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I felt like the controls were wobbly and shaky and hard to control.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA,我就RNM,垃圾反作弊，老子进了半天都进不去，我就*******。*****。******。*********",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so ass and not beginner friendly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No longer works on steam deck.  Well done EA Anticheat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TOTAL BULSHIT, GAMEPLAY LIKE SUPER MARIO.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bok gibi oyun yonamayin",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rezalet bir oyun  aldığıma pimanım",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesnt work with anti cheat assholes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Requires EA play app to run.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible battlefield",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Screw you EA, I'm not leaving Linux just because you throw a temper tantrum because your launcher doesn't work here! if you're on Linux, stay away; \"Wine, Proton, and Steam Deck are not supported by this application!\" sounds a lot like \"Too lazy to maintain Linux support so screw you! And no, you cannot have your money back.\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ea kontol gabisa dibuka anjing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "anti-cheat is so pointless",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of hackers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why Kernal Anti-Cheat?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you be like wow look so fun play with friend, pay money ow walltet bored 1 day 👍",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "leaving a dislike for this makes me feel extemely bad for the developer of this game\nreally stunning, beautiful, smooth gameplay, PROPERLY optimized if using dx 11 and high/ultra setting\ncried a lot for the story mode, great music, perfectly captured war is truly horrible\nbest battlefield i've ever played\nuntill they added anticheat and force online only via the ea app, no ea? game wont launch, single player mode also REQUIRE INTERNET, f*** EA , ALWAYS RUINS EVERYTHING",
      "voted_up": false,
      "votes_helpful": 177
    },
    {
      "review": "NEW ANTICHEAT BREAKS LINUX SUPPORT\nNot allowing Linux players on a new title like BF6 is stupid but somewhat understandable. But removing Linux support for an almost 10-year-old game that has been running perfectly on Linux for years is pure lunacy.\nThe game is incredible. If you can play it, 100% do. The single-player campaign alone is worth it. But if you're on Linux/steam deck, don't buy this.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "I absolutely loved this game and I was happy it was compatible with linux for when I changed to it\n\nOr at least I would be if they didnt randomly kill linux after it being compatible for years, that kinda fucking blows doesnt it",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Love spending my money on a game that doesn't work! EA app doesn't launch despite hours of repairing files and troubleshooting and on top of that neither does Battlefield. Here's an idea EA. How about you take me out to dinner before you fuck me. Or I guess I could always pay you a visit with a home made nuclear bomb! Fuck you!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is MID, not bad but not great. EA Javelin Anticheat is the worst thing ever, crashes my game EVERY time since Skate. released, even reinstalling doesn't solve it... My hate for this piece of shit is on another level.\nI HATE YOU EA\nI HATE YOU EA\nI HATE YOU EA\nI HATE YOU EA\nI HATE YOU EA\nI HATE YOU EA\nI HATE YOU EA\nI HATE YOU EA\nI HATE YOU EA",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The gunplay, gameplay, and basically everything about this game is just amazing.\n\nHOWEVER!\n\nWhile the game itself is good, the main problem that this game has that prevents me giving a thumbs up, is that the community servers for this game are NOTORIOUS for faking player counts.\nYou'll notice how the server looks full in the server browser, but when joining the server, it's actually only a few players.\nThe community servers that do this are Happy Hour Madness, BudzExiles, TSC, Grumpy Old Men, and a few others I can't remember the name of.\nSo keep that in mind when buying this game and plan on playing community servers.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "My review is for multiplayer only.\n\nSomehow once humans get the opportunity to make something annoying they will always take it, i got this game expecting gameplay similar to ww1, you know, bolt action rifles, smgs for thrench clearing, machine guns to hold a point etc. but i didn't have my expections met. Machine gunners sprint fast no problem and blast you, people use smgs in long range fights and somehow find success, you hit a guy with a bolt action rifle and he survives does a 90 degree turn and kills you with his smg hundreds of meters away. And don't get me started on experimental guns in this game. Somehow guns that weren't even properly used in ww1 are in every match and they are usually more effective than historic ones, also i didn't like how i had access to british rifles as german empire, how tanky horses are etc.\n\nDegenerates get a truck, tank, bomber plane and use exploits within the game to farm kills instead of helping objectives by staying in out of bounds areas that you are not allowed to go  and once they get damaged they retreat to repair and repeat farming kills until game ends, hey good for you if you get your dopamine hits doing the same thing all game. You are in a map where vehicles aren't allowed? Jokes on you now its time for grenade, gas grenade, crossbow bomb and mortar spam time so have fun i guess.\n\nNow i know that most of the battlefield fans would probably not enjoy this game if they made guns realistic like isonzo and limited, but i don't enjoy playing ww1 as a normal run and gun shooter and honestly this game fails at being an ww1 game for me so i can't recommend it.\n\nAlso moderators of servers are annoying bitches, they get a bomber plane i shoot it down with my anti air gun i get kicked out because appearantly i can't use that gun to disrupt his 600 pound ass farming kills, or the one time in another server where i killed a moderator multiple times during campaign mode and whenever i joined back i was kicked out by him for no reason. Also servers kick you out if you are not a member of servers clan to make place for a member which is annoying as fuck.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "don't buy this, it's nearly unplayable, and it's a shame. ea play fucking sucks. you can't even have daemon tools installed (doesn't matter if it's running or not) because of the anti cheat. recently, every time i launch the game I get a virus popup from microsoft defender. this shit fucking sucks",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Great game even after all these years. However, after 8 years of the game being out, DICE decided to add KLAC for some reason. Just will not run on Linux now, while it ran pretty good before.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Don't get this if you are looking for a casual shooter, it's not, it's a nearly decade old game, (as of the time of this review) and suffers from the fact that the only ppl who play this anymore are sweats and tryhards who play nothing else who will blow you away and make fun of you for being new, and of course the other ppl left are the hackers, nuff said",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I try to lunch the game but i dont even get to the main menu and it crashes and i really want to play but i have tryd like every thing and it just does not work, i do like the game but i cant really like the game if you cant play it know what i mean? (i think it has someothing to do with the anitcheat but IDK so pls help and DEVS  FIX YOUR FUCKING GAME!!!)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Borked on Linux, following the introduction of Javelin Anti-Cheat. Worst of all, this AC is crappier than the one they had before, being reverse engineered before BF6 was even out. Nice one, EA! Fuck you.\n\nWhy update a 10 year old game that was working PERFECTLY fine as of now on Linux, only to break it? smh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Battlefield 1 is the kind of game that welcomes you to World War I by handing you a gun that fires slower than your Wi-Fi on a stormy day, then immediately lets a horse run you over like it’s starring in Fast & Furious 18. You’ll shoot someone six times, they’ll sneeze once, and somehow you’re the one who dies, thanks to hit detection that works perfectly just not for you. Your squadmates might as well be houseplants, because they’ll sprint past your dead body like they’re late to a meeting, refusing to revive anyone unless it’s for emotional support. Unlocking weapons feels like applying for a government permit, requiring endless grinding for something barely better than a bent paperclip. Meanwhile, Black Ops 7 plays like the developers bribed gravity, physics, and the servers to behave: guns aim smoothly, movement is faster than energy drinks allow, and progression hands you new gear so quickly you’ll wonder if you broke something. While Battlefield 1 has you wandering across a map large enough to lose your will to live, Black Ops 7 throws you right into the action with laser guns, sunglasses indoors, and actual hit detection. In short, BF1 feels like historical suffering, while BO7 is a futuristic theme park where everything just shockingly works.\n\nEDIT : CLOWN REWARDER WILL BE BLOCKED AND REPORTED",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Honestly I used to love this game, I sank way too many hours into its multiplayer. But over the past year this game has gone to shit. I Hate it so much now. I used to be able to log onto a match with people just about anywhere round the world, but now its all full of bots who take spots. You can log onto a match and it will say 63 out of 64 payers, which means its almost full then when you get in, you realize that the entire match is bots and there are only 3 dudes playing. And if it was just the bots I could maybe live with it, but its also the hackers, over the past 2 years the hacker have increased in size to make this game unplayable. Its starting to get on the same level as old TF2 before the fix. Guys will turn themselves invisible, or have auto aim and hit you on the other side of the map through a mountain. This game is just down right unplayable for multiplayer in 2025. If you want the campaign, then go buy a different game because the campaign also sucks. Just don't buy this game, I HATE IT AND YOU WILL TOO. Don't waste your money. I've sunk over 1000 hours in this game and I regret spending the last year convincing myself the the devs will come back and fix everything, no they won't. If you had asked me 2 years ago if you should play this game I would have said absolutely! But now, just don't, don't waster your time, your money, or your patience, this game sucks now. 0/5 stars",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Giving it a thumbs down only because it does not work on Linux due to the Javelin anti-cheat. I just want to play the single player campaign, dang it!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "vehicles kill this game now.. there are no servers and the only server that has people is just a rush to get vehicles and 1 shot others.. trash game now since is a dead game.. reimburse if possible or just uninstall... not worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Linux users need not purchase. The new anti-cheat has completely killed the game for linux, there is no fix or remedy. Its dead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is fucking trash.....full of aim bot and wall hack cheaters don't waist your time with this trash unless you're a cheater also....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am from the city of Zaporizhia and I can't play the game. due to some service limitation",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst net code in battlefield EVER.\r\nGetting shot from nowhere or from around a wall breaks this game. \r\nHate it. Not worth any dollar. Buy battlefield 4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the release of Battlefield 6, it became impossible to play; there were constant problems connecting to the servers.\nNow there's a problem with AMD drivers.\nI can't even play the game. I don't understand what I spent my money on.\nI'm giving it a negative rating until this is fixed.\n\n\n//После выхода Battlefield 6, играть стало невозможно, постоянные проблемы с подключением к серверам. \nСейчас вообще проблема с AMD Драйверами.\nВ игру вообще не заходит. За что потрачены деньги не понятно.\n Хочу поставить отрицательную оценку, до момента пока это не будет исправлено.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yani ortalama bir silah oyunu. Hiç içine çekmedi ve sürekli aynı şeyi yapıyormuşum gibi hissettim. Ki bir silah ve asker oyununda daha başka ne yapabilirsiniz ki. Call of duty 2 daha fazla ilgimi çekiyor açıkçası.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "story is nice but multiplayer is not really good for new player, lots of tryhard use unfair weapons the biggest facepalm is that it is very hard to unlock meta weapons. if it is your first battlefield then you will just die again and again in multiplayer [spoiler]planes and tank are pain in the ass and fuck motar trucks[/spoiler]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game, but as of now, most of the servers are dead, there is no moderation and now i cant even open it. only buy when on sale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Originally bought the game at launch on Origin (about 250 hours total)\nGame itself was pretty decent, amazing graphics (even in 2025), the mini campaigns are short but alright, then\n\n[b]EA decided to retroactively add an invasive kernel level anti-cheat (EA Javelin) almost 10 years after launch without warning. [/b]\n\nThis did not improve the (already low) cheater numbers in any meaningful way, while causing substantial issues for players and conveniently collecting a large amount of user data for EA:\n\n[list]\n    [*][b]Privacy Risk [/b] - EA Javelin collects a significant amount of data about your system, your usage of it and transmits all of it to EA - According to their privacy policy and user agreement they are not only allowed to use this data for cheat prevention (which would make sense) but also conveniently claim the right to use it for \"improving our products and services\", \"measure the effectiveness of advertising\" as well as share it with a large list of other companies among other things - see section 2 & 3 of their privacy policy\n\n    [*][b] Potential Security Risk due to the high privilege level of the anti-cheat[/b] - There have been multiple occasions where vulnerabilities in similar anti-cheats have been weaponized by malware for privilege escalation - Due to the age of the game this is an even bigger concern since such vulnerabilities might not be patched quickly (or at all) once support fully drops \n\n    [*][b] Breaks Steam Deck Compatibility [/b] - worked perfectly fine before\n\n    [*][b] Breaks Linux Support [/b] - worked perfectly fine before and with Win10 EOL you ether miss important security updates or are forced to switch to Windows 11\n\n    [*][b] Breaks many overlay & screen recording tools [/b]\n\n    [*][b] Breaks all single player mods [/b]\n[/list]",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "No-one playing this game anymore except players from Turkey and China. Utter garbage high ping custom servers, and no one playing from any English speaking nations.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "10 year old game, added anti cheat and bricked it. cant they just leave things alone?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is almost perfect multiplayer FPS. There's just one, big problem - the motherfucking EA launcher. It doesn't let me play this game. I played it for the last time more than a year ago and I had the same problems. I can't recommend it because of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Try to join a server that's populated, and it constantly puts me in a game by myself. 0/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Important historical details are oversimplified or portrayed in a distorted way, which takes away from the authenticity of the setting. It’s apparent that the game presents a biased depiction despite claiming to be inspired by real events.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game might have strong presentation, but I’m choosing not to support it because it’s tied to EA. Their track record with customer treatment and business practices has completely killed my interest in giving them money, no matter how good the game might be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game but wtf is this activation key bs??? apparently its because of a new anti cheat they added years after the game was already released and one of the reviews here says they steal a lot of your data.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks ass worst maps on any game ive ever played, most cheaters then  any games ive ever played, worst mechanics in any battlefield game out there, only play this shit ass game if u have mental problems or if you get beaten by ur dad with anger isseus",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks great with its graphics but not with its storyline, cause it's only a few campaings and after they finish, the only thing to do is play online but you'd be shot real quick. I can't move on, only stay on some stupid maps, constantly die.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story part of the game is so messed up that they haven't told history properly. They wanted to portray whoever you're fighting against as barbarians and murderers, and make themselves look like heroes. If you don't tell history properly in a game like this, I'm sorry, but you're a bunch of assholes. Fuck the game you're making. \n\nOyunun Hikaye kısmında o kadar piçlik varki tarihi doğru düzgün anlatmamışlar kime karşı savaşıyorsanız onları hep barbar ve cani göstermek istemişler ve kendilerini kahraman eğer böyle bir oyunda tarihi dügün bir şekilde anlatmıyorsanız kusura bakmayın ama büyük orosbu cocuğusunuz  yapacağınız oyunun amına koyayım     osmanlıyı çok saçma göstermişler son 2 bölüm osmanlılara karşı oynuyorsunuz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only play single player!!!\nI already owned the game on PlayStation, but unfortunately, I never got to finish it. Since I had a cheat system for my PC, I also bought the PC version and was excited to finally play it to the end. That worked fine until EA decided to add anti-cheat—and that was the end of it.\n\nThe video game industry is the only one that gets to pocket customers’ money without worrying whether the player actually gets to experience the entire game or just a few minutes.\n\nI won’t be supporting such a game developer again anytime soon by buying the same game again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Killed off Linux support, even for the singleplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\" EA Anticheat has detected an incompatible driver. Please update or disable 'c:\\windows\\temp\\atiflash\\atillk64.sys' and restart. (119) \"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gun is disabled so cant spawn,\r\ncant get new gun without playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix the bullshit balancing system and nerf the damn mortars",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT GET THIS ASS GAME I SWEAR I PAID MONEY JUST FOR MULTIPLAYER TO NOT WORK THE CAMPAIGN IS SUPER SHORT AS WELL ONLY AROUND 3 HOURS SO I CANT GET A REFUND REALISTIC GAME OVERALL BUT REALLY UNPLAYABLE I WANTED TO PLAY MULTIPLAYER",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cutscenes,cutscenes,cutscenes, In total, absolute chicken poo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't even play the game, the anticheat keeps booting me out of playing the campaign",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}