{
  "positive": [
    {
      "review": "Excellent game so far. - lots of different playstyles to choose from and so far alot of variety too, no level is the same. No copy paste BS here. - each level is different and each one has it's own problems to complete.\n\nVery different to what I usually play. \n\nIt's not easy and I've struggled on some of the levels, they all have to be approached differently because it's different situations.\n\nHostages? - You don't know where they are, so you can't go guns blazing as you might end up getting them killed.\n\nMission timers? - you have to complete the mission within that time or you'll fail and/or you and the hostages die. - there's no get out of jail free card here, you're stuck on the level until you beat the timer.\n\nOutnumbered? - You need to turn the environment into an advantage. - or use speed and surprise with flashbangs and granades.\n\nBusting a place at night? - night vision goggles are your friend, but you have to cut the lights which are inside the place that is full of angry people with lots of guns and most likely a hostage.\n\nStorming some shithole of a compound that has loads of corners, darkrooms, corridors, reinforced doors and windows? - you need actually think about what you're going to do.\n\nWhat about suicide bombers? Jahidi's and dudes that are armed to the teeth and open fire as soon as they spot you, snipers on rooftops, booby trapped doors. Rigged explosives on cars etc. \n\nI'm still on the training missions and not even unlocked the good stuff yet and this game is addictive and I knew I made the right decision buying it.\n\nI really enjoy how you have to plan EVERYTHING and executing the  perfect raid, watching it back and getting that satisfaction of all your tactics and planning coming together to beat the level... you WILL want to get three stars on every single level, because just getting one or two isn't satisfying enough. \n\nI highly recommend getting this game if you love tactics and planning ahead and seeing it all fold out. \n\nYou can even pause it in real time and tweak and adjust things. \n\nThat's my weekend sorted!\n\n£20 is a bargain for a game this good!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Sit back, relax and enjoy this tactical master piece. Love the modding support as well for this game giving even more content than it already has! Id recommend watching yt videos if you are still on the fence or unsure if this game is for you. \nI am very pleased with my purchase. 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game!\nGetting angles and timing right sounds straightforward, but when the bullets start flying, it is much more difficult than it might seem.\nAs with many great games, it is relatively easy to learn, but difficult to master. It plays very much as a tactical top-down shooter, but is at the same time a game of geometry and timing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this game is so much fun to just be able to knock back a few beers and kick some fucking doors down.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's great. It's pretty much what's on the tin. It the planning phase from Rainbow Six before it became bad, with an interface that is modern and pleasant to use. I don't agree with all design decisions, but all of them are sound. It's a well thought out game with a good chunk of content.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I adore this game. If you want a fun challenge that you can take on in small chunks when you have time around family life, it's absolutely perfect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I only recommend this game if you are a very patient and receptive player. Otherwise, the time-sink nature of the game will filter you out.\n\nThe game can be very punishing and frustrating, but if you learn to love the process of failing and learning, then there is depth and mastery to be found in the content within—both Vanilla and the Modded Content from the workshop. As of hitting my 100th hour, I have yet to figure out how to play the CIA. A 4 man-squad with an emphasis on stealth and covert tactics. Requiring more thinking and planning than the fast-reliable-loud US Rangers and Nowheraki Swat.\n\nDoorkickers 2 is a real-time strategy tactics game where you are encouraged to slow down and think your way through the map. It may not be macro-intensive, but there is still intensity to be found once the game ramps up in difficulty: bigger maps with larger squad sizes equating to more sightlines to cover, faster and more dangerous enemies, longer time investment to complete the map, timed obstacles, and more potential for failure (rocket launchers, emplacement machine gunners, elite enemies that shoot faster than your guys, and those stupid Suicide bombers).\n\nThe Replay feature makes all the trouble worth it, in my opinion. I have a lot of them stashed up, and I enjoy rewatching them from time to time, seeing all my actions unfold into one cohesive film. It's fun.\n\nStarter Advice for New Players\nIf you are starting out as a new player, here are some things I learned that I will give as advice to make the early game easier and more fun:\n\nForgo the Medals - Medals are inherently worthless and are only there to be self-imposed challenges for players. Only take them on once you have a good grasp of the mission and have max-leveled operatives to make it easier. I stopped doing them once I got all the achievements.\n\nForgo Single-Planning - Same with medals. It’s not needed and should only be done once you've finished the level at least once. Don't waste your time bashing your head against a wall trying to foolproof your plan to perfection, when most single plans completely rely on RNG. To be honest, single-planning can feel very janky and frustrating to play, as the game feels better for real-time play as is inherently designed. There are no single-plan save slots, you only get only one and it is easily lost, from experience. The only exception where single plans may reliably work is for smaller and time sensitive maps(Bomb defusal and Execution), but for large maps with timed objectives above one minute, I just don't bother with it.\n\nDo Not Be Afraid to Try All Mission Types and Sizes - While it is fun to stick to smaller-sized maps for easier quicker CQB replays, you will be missing out on the quality of one large map when you focus on the quantity of a dozen apartment or medium-sized maps. I will almost guarantee that any new player will be hesitant to try out the very large maps due to how macro-intensive it may look, having to control up to 10 units. But once you get the hang of the controls, the flow of the game, and the rhythm of slowing down to make concise decisions, large maps can be very fun and rewarding to complete.\n\nTo wrap everything up, here's a message to everyone, both veteran and new: Please give map makers the ratings they deserve. It helps boost higher-quality maps in the Steam Workshop sorting algorithm and helps the community find and play them. If you are struggling to find any good maps, I recommend going to a collection or finding those replays on YouTube. Thanks, and have fun!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is one of my favorite games of all time. Plus I love all the mods for this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I won't recommend this game to myself, not my gameplay style. \r\n\r\nThe game is good, the concept is very original, the devs effort is very visible in the game, but not something I would personally play more than 80 minutes.\r\n\r\nYet, I would love to see more games like this. I like this variant, bebing Aliens Dark Descent the best for my personal gameplay style.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its like the OG Doorkickers, but better in every aspect. Challenges are quite good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, not as good as doorkickers1 style wise but visually better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only wish that the rangers could have the ability to use the ballistic shields other than that, i love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Intense, challenging and very rewarding. Mistakes feel like your own and it's gratifying to watch the replay after you wrestled almost an hour for a 5 minute clip. :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with an excellent depiction of small unit tactical combat and an excellent mod community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great strategic puzzle game that keeps me coming back for more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great upgrade over the previous game, Doorkickers 2 moves the game from the 2D streets of Nowhere City to the 3D hideouts of Nowheraki, raiding terrorist cells instead of coke dealers. The big new feature though is destructible walls, with breaching charges and rocket launchers letting you make new entrances to otherwise deadly chokepoints.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super unique game with awesome gameplay for anyone into military games that can be unforgiving. \n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, it’s challenging and it has endless possibilities of missions since you can create your own.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome RTT game, a great step up from the first game. Lots of levels, weapons and approaches to missions. The addition of suicide bombers will cause you to use the c word at least 800% more often. A shoe in for Best Game You Suck At.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Door Kickers 2 takes everything good about the first game and makes it better.  The setting is better for the type of gameplay (always being a guns blazing approach didn't really suit the police setting) and brings a massive surge of variety in terms of tools and missions.  Not only that, but having distinct types of squad is a great change to keep things fresh, with a balanced squad (Rangers), a flexible specialist squad with very limited numbers (CIA), and the quantity over quality squad (SWAT).  Different weapons and equipment varying between squads and even between troop classes inside a squad also makes a world of difference.  The scale can also get wayyyy larger than anything in door kickers 1, which is both a blessing and a curse, since managing a large map can be much harder and confusing.  That being said, all the new systems feel great and it's rare that I feel like something is brokenly overpowered or can only be done with one specific strategy.  Additionally, more control options like vaulting, sprinting, suppressive fire, crouching, and being able to tell your troopers to aim at a particular point and \"slicing the pie\" as they move make the original feel primitive and clunky.  All of the presentation upgrades are very welcome.  The voicelines, graphics, and sound effects make the whole game feel better.  If you feel like the game is too hard, remember your options.  Would a grenade help?  Do you need to revamp your squad's gear?  Is there a way to approach from a different angle?  Tactics can take a while to learn but is very rewarding once it clicks.\n\nTL;DR, If you liked the original Door Kickers, then you'll love this game.  For everyone else, if you like top down tactical squad games, this is the best one on the market.\n\nPS: Devs, please give the SWAT sapper the riot shield back like in early access.  A riot shield perfectly fits their role, and I have no clue why it was removed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game since the beginning. It's great, it makes you think, it offers endless possibilities with the mod shop and the updates. I enjoyed every hour of playing this game. Truly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Vast improvement over DK1 but in the same vein of the game. Great modding potential and replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant tactical pussle game, some minor gripes with RNG here and there but overall a great experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic, I love the strategy and fast paced action. the hostage rescue always owns me but I try and try again. it never gets old.\nI would love if the publisher renewed the police or swat flavour with banks, plane and office building breaches.\n\nbut this is more than enough to scratch that itch :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A neat game about small team tactics from a top down perspective. A bit of an oddity in the Tactical shooter space due to not being first person nor standard third person. While the top down takes some getting used to, it means once you get it down, you can command these squads incredibly well. A very well made game, with some excellent mods to boot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Door Kickers 2 is everything a tactical strategy fan could hope for — smarter, faster, and more dynamic than its predecessor. The game nails the feeling of planning and executing high-risk operations, giving you complete freedom to design your approach and rewarding creative thinking instead of brute force.\n\nThe improved AI, expanded arsenal, and diverse operator classes add real depth, but the controls remain intuitive enough that you can jump right in and start experimenting. Every mission feels like a fresh puzzle, and the moment your plan comes together perfectly is incredibly satisfying.\n\nVisually it’s clean and readable, the sound design is punchy, and the pacing keeps you hooked. Whether you enjoy tight CQB planning or chaotic real-time firefights, Door Kickers 2 delivers an addictive blend of strategy and action. It’s one of the most engaging top-down tactical experiences out there — and it keeps getting better with every update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Getting angles and timing right sounds straightforward, but when the bullets start flying, it is much more difficult than it might seem.\r\nAs with many great games, it is relatively easy to learn, but difficult to master. It plays very much as a tactical top-down shooter, but is at the same time a game of geometry and timing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't write a lot of reviews. So when I do, you should buy it.\nLots of replay ability. Open modding community is great. Good dev support. \nCore functions are great. Fantastic CQB theory training.\nDevs: only thing I want added is the ability to create fireteams so you can move multiple units in a line. A small ask to go from 99% to 100%\n\nWell done!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Until your teammate decides not to check a corner...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My go to game if i just have a little bit of time to kill. Good variety and number of levels included + many many workshop maps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best strategy games available on the market right now. It offers some of the most entertaining tactical milsim gameplay even though you’re not actually controlling a character in the game. I highly recommend it for anyone looking to get into strategy games especially if you have a background in milsim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In brief, loving it so far but missing the police SWAT vibe and the large maps become a chore/time sink (perhaps more tolerable with a second player in co-op).\n\nThe only thing I'd really _really_ like changing is the gunshot sound FX. Imported from the first game, I think, but they're dull and anaemic, and both Door Kickers games warrant an audio barrage when the mission goes loud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with little details, you can master the master breach.\r\nEnjoy the graphics and sound, layout is generally good.\r\nCan get frustrating, better to only do a few missions at a time i find.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's definitely an improvement over the already excellent Doorkickers 1!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have to say the same as for the predecessor:\r\nIn the Army they teach you how to open doors.\r\nIn the Marines they teach you how to kick doors.\r\nIn the Navy SEALs they teach you how to blow up doors.\r\nIn the Door Kickers 2 game they let you do all three things.\r\nAll is just even better than before.\r\n11/9 would play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play if you don't have a lot of time. Game can run on almost anything and nearly anywhere. 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very good game. I can't really think of anything but good things about it.\nPlayed Door Kicker 1 before also very good game.\n\nYou can either make crazy one go plans and execute them or just go little bit at times. You can pause game and rethink what you are going to do. Very good and something to learn always about close combat tactics. \n\nGame has lots of missions and campaigns to play and of course the best mod workshop that brings a lot more to it.\nYou can customize your team for the mission and you unlock more stuff for them and gain experience. \n\nI can only recomend this game if you are into tactical strategy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tactical goodness. Lotta customization. Great community support. What else can you ask for?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome and at times challenging game.\r\nHad a lot of fun, mods also make it more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, makes you think about your steps. Fairly easy to learn as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Snappy movements, complete control and good punishments for bad plans. Every successful run works off the failures of past attempts, and I never felt truly cheated in this game. Very nice, very fun and an easy recommendation for people with patience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Player the first game on my phone and when I found out the was a 2nd I had to play, generally good game and I still love, plus workshop and maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. Better with KB and mouse than on deck but still a great game with lots of replay ability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You plan ahead and think of all the risks and possibilities in this game, but it's also relaxing at the same time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Door Kickers 2 is an exceptional top-down tactical shooter that combines strategic depth with fast-paced precision. The mission design is varied and well thought-out, giving players genuine freedom in planning and executing operations. Whether solo or in co-op, the gameplay remains consistently engaging, balanced, and highly replayable. A standout title for anyone who appreciates tactical realism and thoughtful design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A terrorist is on the other side of a door, WYD? \n\n0 Waiting for them to open it, then engaging them before they close it\n1 Using the door handle\n2 Kicking the door (per the game's title)\n3 Breaching charge on the door\n4 Wall-breaching charge on wall, bypass doorway\n5 Wall-breaching charge on door to blow it up\n6 Using frag grenade to blow up door\n7 Using grenade launcher to blow up door and wall\n8 Using an anti-tank launcher to blow up door-wall\n9 Installing a mod that gives you artillery/air support",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great SUT simmulator. It gets a lot of things really true to life (I'm no combat veteran, but I had my fair share of CQB and urban warfare training).\r\n\r\nHaven't gone through the story yet, but the OG scenarios are great.\r\n\r\nMusic is good and gets you in the mood. Sound effects are great.\r\n\r\nVissualy is great, amazing artwork.\r\n\r\nMy only complain would be that there are a few lacking tutorials on how to effectively play the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, just not for me. Well made, good graphics, no bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good brain workout, pretty much a puzzle game dressed up as a strategy shooter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kind of like a pausable-real-time XCOM with the tactics of Ready or Not (except more arcadey and forgiving) and the setting of Nowhere in the Middle East (literally). Easily gets my innovative gameplay nomination.\nDefinitely not a story game though. The only story is the a loose connection between mission descriptions, especially if you're doing one of the campaigns. That, and some witty descriptions on the gear.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good top down strategy game, and aside from Ironman Campaigns its very forgiving and allows you to reset maps and try different strategies until you find one that works!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may not seem like it but this is a puzzle game. Every room, every corridor, window, or entryway, a puzzle that needs to be solved or someone you don't want to die is very likely going to die. Lots a replay-ability too with the different achievements for each mission with things like lone-wolf, no-pause, or single plan upping the difficulty. Super fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was amazing when it released.... and it continues to get better. the many mechanics this game adds from the first one feel unplayable. so much love has been put in to this game i dont know where to start. the best mechanic this game has added that has drawn me back non stop is the new player factions. they  change fundamently how you play and go through levels, from the two new factions the cia and local middle east swat team the swat team has been the most fun for me. and the ability to change factions in coop to mix and match with others to create some fun dynamics and give you new ways to play through the same level but in a completely new way. they new factions arent just reskins of the old classes the squads were structed in  but are more styled realistic in roles in that factions squad. my fav ex on the middle east swat team there is a class where they are worth half a deploy point allowing you to have double the amount of soliders to controll and go through the mission. also can do this in coop and makes it even more fun. this game is perfect solo and coop only makes the experince heavenly 100% buy this game if you love cqb tactics this game is deep and polished",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My fave game as it makes you think from a squad or platoon of people, it also has tons of good mods and addons to make it even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatly enjoying the game. There's plenty of levels and also campaigns now with many ways to beat them.\nThe challenges can be an actual challenge and you can deal with them in your own way.\nThe modding and custom levels are also pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very realistic, and very good for strategic decisions even in the last second",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Door Kickers 2 is stress relieving fun.  Just enough problem solving, shoot em up, and variance to keep it entertaining for short term or lengthy play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Door Kickers 2 nails the fundamentals. The art style, engine, and overall feel are spot on, everything runs smoothly, and the tactical readability is excellent. Mods add a lot as well. I’ve had a great time playing with SAS kits, they slot right in without breaking the game. The missions are properly demanding too. You can’t just click your way through, you have to slow down, plan your angles, and think a few steps ahead.\r\n\r\nOne of the things I love is how the game pushes you to learn real CQB tactics. When you do, they actually work. Clear your corners, manage your spacing, coordinate your breach, and suddenly you’re playing on a completely different level. It’s the kind of game where you can hop in for ten minutes or sink ten hours into bigger maps and scenarios and both feel worthwhile.\r\n\r\nMy gripes are pretty small. The unlock system is the big one. Standard progression is fine, but I’m not a campaign player so having certain gear locked behind campaign completion is a bit irritating. The collision and line of sight can also get a little strange at times, though it never becomes a deal-breaker.\r\n\r\nEven with those issues, I think it’s a fantastic tactics game. Absolutely recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely great tactical game. An improvement on DK1 in every way. Graphics look great, 3d tilt is amazing for replay mode, tough challenges, several awesome campaigns and a great random mission generator. I haven't played co-op but will soon.\r\n\r\nMy favorite way to play right now is the tours of duty. Start a level 1 squad and try to see how long they can stay in the field, leveling up as they gain experience. It's a randomly generated campaign that stretches on for as long as you'd like.\r\n\r\nMy only quibbles are that (a) I wish it were possible to start a new squad with 0 stars, so they have to unlock the gear again without having to erase all of my progress on my other squads, and (b) I wish the co-op would allow you to play through an iron-man campaign (obviously you'd have to play with the same partner each time).\r\n\r\nI'd pay money for a WW2 version of this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive, great tactical game. Lots of workshop maps from movies like Sicario and tons of workshop mods, whats not to love?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself i enjoy a fair bit as i do tend to enjoy tactical games and have fond memories games like SWAT etc. It's competent at what it does, offers a vast amount of hand made missions, a way to play random steam workshop missions, and also does \"tour of duties\" modes where you can play ironman and last as long as possible on randomly generated missions. I think there's no shortage of content for players to enjoy, albeit players may eventually feel like the content gets a bit samey. The content loop i enjoyed the most were \"tour of duties\" and campaigns, as they create other motivations for continuing to play. \n\nMy main issue with this is that it suffers from some accessibility issues because of how item descriptions are written. It seems very clear to me that item tool-tips are written more with flavor and humor attempts in mind and not at all for communicating critical information which players need to understand and approach this otherwise rather brutal gaming experience. You do have access to some sort of graph to visually communicate how for instance a weapon performs. But this is just about as vague as it gets. \n\nThis in turn means that if you're not particularly ammo-sexual and familiar with modern weaponry, you will largely struggle to understand and grasp what items/weapons are, how they rate relative to each other, and how to improve your odds. The tool-tips read as though they're straight out of a bar-room discussions between gun nuts. How does this handgun compare versus that handgun? You won't know, but now you will have some random trivia about it under your belt. Not useful. Not helpful either.\n\nSimilarly, armors get pips. Pips to show how fast you are in them, and pips to show how much it protects the covered areas. That's it. You don't get told how much faster you will aim, move, or fire. You won't get told what suppression resistance the items afford you, nothing. You will just have a vague idea that you're about 1 pip faster and 1 pip less protected, whatever those values mean.\n\nDifficulty wise, it's rather difficult, depending on how experienced you are with the genre. But the points explained above certainly add to the difficulty in a way that does not feel very good. There are wikis for the game, but they too do not show that missing data-oriented information. So for the most part if you play this, you will have to trudge around and try to garner a vague understanding of how weapons fare relative to each other based on your limited empirical evidence.\n\nA bit of a missed opportunity imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watched Controlled Pairs Gaming play the game for years before finally getting it, and it is as good as it appeared to be. Enjoying it, enjoying the mods, enjoying the tactical geometry of the game. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good chill game. Fun exploring different tactics and synchronizing team movements. One of those unique must plays.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the most tactical, most realistic pausable RTS out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, requires a lot of active thinking.  Had instructors in the past reference CQB as \"a game of angles\" and it holds VERY true here as well.  Running your teams as 2, 3, 4, or even 5 person teams capable of breaking-off at various junctures and re-forming the stack is a conscious effort but is well worth the reward of seeing a well-executed plan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is essentially a very fun puzzle game. lets you do random missions or sets of tailor made missions that feel nice to run through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to learn and develop cqb knowledge and super addicting once you get the basics down. \r\n\r\nIt also has tons of modded content (new units/tools/maps) and has a great feature integrated in the mission select screen where you can choose a random workshop map which saves a lot of time browsing and installing missions manually from the workshop. \r\n\r\n10/10, only gripe is I wish the gun sounds were a bit better but there are also mods for this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game that has non stop action to offer. Once you've gotten your fill of the vanilla game, you still have mods to download and community made maps and missions to experience. It is an excellent game, and if you enjoy strategy driven games that require critical decision making, you'll enjoy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, honestly. One of the best. Too bad the first part won't be adapted to MacOS(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good and fun. I haven’t played a game like this in a while. However, there should be more practice mission.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very tactical and super fun game. you can random generate levels. top down game, but that adds to the tactical feeling of everything going on in the game. very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So much fun if you get a good mate and try playing through some missions. Trying to 3 star things can be trivial or a slog. Excellent fun!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game of all time. Outstanding mix of realism (the devs are nerds too!), tactical puzzle gameplay, and cool factor. Tons of content, and mountains of excellent community-made mods, maps, and campaigns, on top of randomly generated missions provide for endless hours of enjoyment. Excellent modding support allows you to modify the game to your heart's content.\n\nHighly recommend the \"Residential Tile Overhaul\" (for random map generation) and \"Nowhere to Survive\" (zombie mode) mods, along with your choice of the many, many excellent unit mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game to play solo and caos if played with frinds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Door Kickers 2 just clicks. The drop-in, drop-out style makes it stupidly easy to jump into a mission, whether you’ve got ten minutes or an hour. The modding scene keeps it fresh, and the controls feel so natural you barely think about them.\n\nIt hits that sweet spot of being tough without feeling unfair. When you finally nail a clean run with no injuries, it’s ridiculously satisfying — almost like solving a tactical puzzle. It’s simple to get into, hard to master, and weirdly addictive in the best way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like rainbow 6 siege if it was good and tactical, so nothing like siege",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, you can actually apply realistic strategies. Very punishing if you don't check every corner though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit dull at first but once you understand the mechanics, it becomes addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great to teach CQB tatics to people who doesn't understand a shit about tactical stuff, and then show them what happens when you follow the tatics, and when you don't follow the tatics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tactical shooter with less stress - infinite replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some operations can be complex to handle but is very addictive to play.\r\nGreat for practicing how to tackle different scenarios and adapting to challenging threats.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Breach door\r\nMagdump enemy\r\nKill vip in the crossfire\r\nFail mission\r\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played Ready or Not and then found this gem! Do you obsess over CQB tactics and don't mind a top down view? You'll love Door Kickers 2!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cool, hard at times! Great to kick back and try being tactical!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imagine, if you will, you’re a 31 year old ATF agent. You’ve been on the force for a while now when you get assigned to a somewhat routine mission. Some wacko has been evading his taxes as well as stocking up on illegal weaponry. You and a few of your fellow agents are advancing towards his compound through his extraordinarily long driveway when you hear it. The distinct noise of a small, propeller driven aircraft. You think *”Oh great, the bastards making a run for it”* when another noise breaks the silence among the advancing agents. You remember hearing it when you were pinned down in Afghanistan, asking for fire support towards that goddamned hill. You heard it when you rewatched combat footage from another soldiers perspective. You hoped and prayed you would never hear that noise again unless it wasnt aimed towards you. And by god, today it is. As you see your comrades getting mowed down I’m front of you, the distinctive *BRRRRRRRRRT* of a 30mm auto cannon erupts shortly after the first bullets hit their targets. The small plane then goes around for another run, miraculously leaving you in one piece, when you see something else that makes you feel even more fear than a CAS Cessna. An orange barrel, a large hazard symbol, and what looked like some sort of detonation rig. The Star Spangled Banner blares over several loudspeakers as the man youre trying to capture announces, *”TAXATION IS THEFT! DOWN WITH BIG PHARMA! ANCAPISTAN FOREVER!”*. Though it’s not what you would’ve hoped to hear, it’s the last thing you’ll ever hear.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The enemy have a tendency to congregate in bathrooms. Especially S-vests. Make of that what you will.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the Best CQB game avaliable that is also an RTS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best tactical games i've played...best with a friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun CQB, compared to other games like this its a good price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top down fully interactive Rainbow Six operations planner that I always wanted",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this game. The planning and the mods make this so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game with a passion. I highly, highly reccomend this game to CQB enjoyers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ">load into co-op\n>try to sketch out a plan on attack\n>realize you've drawn a dick\n>laugh about it for the rest of the session\n\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, easy to learn hard to master.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The devs put in decent work to make it the tactical game that it is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just some absolute hitters coming by to conduct business, frankly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, dont have much else to say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great simple game and works on SD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cool mechanics and fun strategy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Door kickers 2 is very good both vanilla and modding wise,",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "To me this game plays slow. Setting up your squad, choosing the right equipment, executing tactile gameplay; none of this has been engaging nor challenging. With enough time under my belt I feel it's not worth digging deeper to get to where I feel rewarded for my choices rather than just brute forcing every mission on hard to get 3/3 stars.  \r\n\r\nTLDR; Too easy, just brute force everything on hard and 3 star every mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sorry but joining the game and loooking forward to the campain . suiddently relaising that it takes alot of single missions to start the campain. sorry but dont want to jump ahed of train. thank you wery much.\nSkiben",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really disliked this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but there is no point in playing any of the other factions than the Rangers. If you pick CIA, you get two operatives with pistols that must go up against 50 Tier 3 PMCs. It's just not balanced or designed in a meaningful way to where you should use any other tactic than full lethal, which you have completely mastered by the time you unlock any other factions. Great idea of a game, but gets EXTREMELY repetitive and boring after the first 20 missions.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To me this game plays slow. Setting up your squad, choosing the right equipment, executing tactile gameplay; none of this has been engaging nor challenging. With enough time under my belt I feel it's not worth digging deeper to get to where I feel rewarded for my choices rather than just brute forcing every mission on hard to get 3/3 stars.  \r\n\r\nTLDR; Too easy, just brute force everything on hard and 3 star every mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sorry but joining the game and loooking forward to the campain . suiddently relaising that it takes alot of single missions to start the campain. sorry but dont want to jump ahed of train. thank you wery much.\nSkiben",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really disliked this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but there is no point in playing any of the other factions than the Rangers. If you pick CIA, you get two operatives with pistols that must go up against 50 Tier 3 PMCs. It's just not balanced or designed in a meaningful way to where you should use any other tactic than full lethal, which you have completely mastered by the time you unlock any other factions. Great idea of a game, but gets EXTREMELY repetitive and boring after the first 20 missions.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To me this game plays slow. Setting up your squad, choosing the right equipment, executing tactile gameplay; none of this has been engaging nor challenging. With enough time under my belt I feel it's not worth digging deeper to get to where I feel rewarded for my choices rather than just brute forcing every mission on hard to get 3/3 stars.  \r\n\r\nTLDR; Too easy, just brute force everything on hard and 3 star every mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sorry but joining the game and loooking forward to the campain . suiddently relaising that it takes alot of single missions to start the campain. sorry but dont want to jump ahed of train. thank you wery much.\nSkiben",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really disliked this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but there is no point in playing any of the other factions than the Rangers. If you pick CIA, you get two operatives with pistols that must go up against 50 Tier 3 PMCs. It's just not balanced or designed in a meaningful way to where you should use any other tactic than full lethal, which you have completely mastered by the time you unlock any other factions. Great idea of a game, but gets EXTREMELY repetitive and boring after the first 20 missions.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To me this game plays slow. Setting up your squad, choosing the right equipment, executing tactile gameplay; none of this has been engaging nor challenging. With enough time under my belt I feel it's not worth digging deeper to get to where I feel rewarded for my choices rather than just brute forcing every mission on hard to get 3/3 stars.  \r\n\r\nTLDR; Too easy, just brute force everything on hard and 3 star every mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sorry but joining the game and loooking forward to the campain . suiddently relaising that it takes alot of single missions to start the campain. sorry but dont want to jump ahed of train. thank you wery much.\nSkiben",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really disliked this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but there is no point in playing any of the other factions than the Rangers. If you pick CIA, you get two operatives with pistols that must go up against 50 Tier 3 PMCs. It's just not balanced or designed in a meaningful way to where you should use any other tactic than full lethal, which you have completely mastered by the time you unlock any other factions. Great idea of a game, but gets EXTREMELY repetitive and boring after the first 20 missions.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To me this game plays slow. Setting up your squad, choosing the right equipment, executing tactile gameplay; none of this has been engaging nor challenging. With enough time under my belt I feel it's not worth digging deeper to get to where I feel rewarded for my choices rather than just brute forcing every mission on hard to get 3/3 stars.  \r\n\r\nTLDR; Too easy, just brute force everything on hard and 3 star every mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sorry but joining the game and loooking forward to the campain . suiddently relaising that it takes alot of single missions to start the campain. sorry but dont want to jump ahed of train. thank you wery much.\nSkiben",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really disliked this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but there is no point in playing any of the other factions than the Rangers. If you pick CIA, you get two operatives with pistols that must go up against 50 Tier 3 PMCs. It's just not balanced or designed in a meaningful way to where you should use any other tactic than full lethal, which you have completely mastered by the time you unlock any other factions. Great idea of a game, but gets EXTREMELY repetitive and boring after the first 20 missions.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To me this game plays slow. Setting up your squad, choosing the right equipment, executing tactile gameplay; none of this has been engaging nor challenging. With enough time under my belt I feel it's not worth digging deeper to get to where I feel rewarded for my choices rather than just brute forcing every mission on hard to get 3/3 stars.  \r\n\r\nTLDR; Too easy, just brute force everything on hard and 3 star every mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sorry but joining the game and loooking forward to the campain . suiddently relaising that it takes alot of single missions to start the campain. sorry but dont want to jump ahed of train. thank you wery much.\nSkiben",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really disliked this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game but there is no point in playing any of the other factions than the Rangers. If you pick CIA, you get two operatives with pistols that must go up against 50 Tier 3 PMCs. It's just not balanced or designed in a meaningful way to where you should use any other tactic than full lethal, which you have completely mastered by the time you unlock any other factions. Great idea of a game, but gets EXTREMELY repetitive and boring after the first 20 missions.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To me this game plays slow. Setting up your squad, choosing the right equipment, executing tactile gameplay; none of this has been engaging nor challenging. With enough time under my belt I feel it's not worth digging deeper to get to where I feel rewarded for my choices rather than just brute forcing every mission on hard to get 3/3 stars.  \r\n\r\nTLDR; Too easy, just brute force everything on hard and 3 star every mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sorry but joining the game and loooking forward to the campain . suiddently relaising that it takes alot of single missions to start the campain. sorry but dont want to jump ahed of train. thank you wery much.\nSkiben",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}