{
  "positive": [
    {
      "review": "Its a little bittersweet that this game is ending, From it releasing at such an unfinished state and horrible microtransactions, it came pretty far. and became a pretty good game, I loved my time with this game. and think anyone should give it a try if they haven't already😌🤚",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "The beauty of Halo Infinite not only lies in its landscapes, maps nor art, but in the amazing and fluid gunplay, hell I would even go as far as to say it has the best gun play in any shooter, while still retaining the Halo identity and feel. But dosent matter how good the gameplay is, nothing will ever beat a mediocre company like 343 industries. Sadly this gem of a game suffers from the 343 treatment; what is the 343 treatment? While the game graphics and gameplay are amazing this game suffers from mediocre progresison system, a none existing or rewarding competitive structure, Idiotic customization system mix with the most restrictive customization in any halo game, file browsing seem like rocket science to 343 and the desecration of classic maps given the 343 treatment color pallet because painting a map completely neon green seem like a great idea to 343 industries. This game had everything going for it just to go down by incompetence, don't expect this game to be rewarding, it is not, only invest what little time this game has left with your friends because the company had the blueprint and never learned from there errors don't invest any money because the game will be dead by the time you get in. This a sad situation of a great game in a mediocre company just adding previous systems and game modes, that should have been in the game from the start, not to enrich the game but to say they did it. Enjoy the last remnants of Halo Infinite it was a disappointing but fun ride, the best gun play of any shooter game I've ever played.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Gameplay itself is solid for the most part, it simply lacks features/content.\r\n\r\n[b] 343 Really not earning their paychecks. [/b]",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "its enjoyable a definite upgrade from halo 4 and 5 but there is still room to make it better",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I believe that this is the best Multiplayer from Halo. While I think that the SBMM is to tight and not restrictive enough between playlists, not to mention the lacking of community playlists, this is by far the best Halo for MP.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Massively overhated game.\nThe majority of hate is towards the in-game shop where cosmetics are sold and about half can only be acquired with real money. It's just cosmetics btw, not pay to win or anything.\nPeople are idiots.\nThe gameplay, mechanics, and weapons are all better than ever. Wait times for most game modes are also low, so disregard ppl who say it's a dead game.\nThe game as a whole isn't perfect, it suffers from long load times and odd aiming compared to past titles, but honestly that's it for my complaints.\nThe ranked modes are solid, the casual modes are solid. There's something for everyone.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "One of the best shooters I've played, some of the most fun I've had in the genre (let alone the series), running on pretty much the best-looking engine out there, and all of that with nearly zero reason to play it. Microsoft's egregious mismanagement and impossible goals took a rock-solid foundation of a game with nowhere to go but up, and jackhammered it apart. This may sound like a negative review, because it is, however despite all of its many flaws there's nothing but positive sentiment I have to give to what's left of and for this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "AAAAAAA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for people with little to no experience and/or game time on first person shooters",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it is sooooo fun and enjoyeble i wish i could have master chif",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The gameplay in this Halo is probably some of the best in the series. I understand everyone else's reasoning for being peeved about the state game, but it's still just a dang good time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its aight now that they've updated it 15000 times and added the bare minimum for a halo game. still better than halo 4",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's not the best, but it's still a damn good time, also the campaign is pretty fun",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Halo Infinite plays incredibly well. It has some rare startup issues but easily resolved. The game play is sharp, movement feels great, and the open-world approach fits Halo better than I expected. The downside is the lack of content campaign missions start to repeat, the world feels underused, and the overall playtime is shorter than it should be. I do love the Large Maps. \n\nI honestly think 343 should release a small DLC that opens the large unreachable island on the map and add some more small features. The space is already there and expanding it with new objectives or story content would add a lot of value in my opinion. \n\nFor the future, Halo could really benefit from systems that keep the world alive after the campaign:\n\n\tRandom mission auto-generator\n\tBetter and more functional FOBs\n\tBanished retaking FOBs over time\n\tUNSC squads calling Chief for backup when under siege at FOBs\n\tUnit Command Feature where you can order UNSC troops basically to defend, attack an area, or to follow.\n\nFeatures like these would keep missions flowing and the world active long after the campaign ends.\n343 has admitted the Slipspace engine slowed them down, and their move toward a more stable engine like Unreal should help future Halo games get more content, more often. Infinite proves the open-world formula works it just needs more missions, more hours, and a world that keeps evolving.\n\nI still love the game, just one that deserves more support and expansion. Please consider the above for the next NEW OPEN World Halo and don’t lose the story line. 343 Started it and they need to finish it plus more. I really want the next Halo OPEN World to be a knockout of all Halos with the Unreal Engine. Please don’t take away my Grappling Hook. Thank you and that’s my review and 343 if you’re reading this, please take this to heart, if they do read these reviews. I hope they do. I love 343...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is kinda trashy compared to the rest of the Halo series. Although, when Bungie had it it was better, so I didn't expect too much for the story.\r\n\r\nNow, the actual gameplay I absolutely LOVE. The grapple-shot in the campaign (and multiplayer) is a gamechanger. I enjoyed that a lot. I haven't played the whole of the campaign yet, but I am excited.\r\n\r\nThe new idea to have an open world Halo campaign intrigued me. So I bought it when it went on sale. I think that the freedom of it is very fun. I have only been playing Halo for a few months, but I'd like to say I have a valid opinion.\r\n\r\nThe storyline and the limitedness of the split-screen on Xbox (even though I do not have it, it effects my friend and I when we want to play) dampens my thoughts on this. I also feel like it's a little too expensive. I think it could've been a little cheaper. I think even 10 dollars would make me happy.\r\n\r\nOverall, the gameplay is good and enjoyable, although the storyline is a bit iffy. I think I'd give it a 4/5 stars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really complete and has little to no tech issues anymore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 4 years the game is finally content complete, and its pretty damn good content at that.  The best halo multiplayer imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it. is it the best Halo no but the mutiplayer is very good just needs more community gamemodes and the campaign isn't the best but you can put hours into the game and enjoy yourself its sad to see it end now as its in a good place and they could make some remakes/remasters of older Halo games to get that Campaign itch while still having a live service mutiplayer but at the end of the day nothing good lasts for ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "underrated af\r\nStill worth playing, it's a shame so many people gave up on it because of the poor support at launch because the one thing I can say is it is a lot of fun (if you're good)\r\nBetter on pc than Xbox because I can actually hit my shots now but that's not an issue with halo infinite specifically\r\nI would say that there are a lot of high skill players and a lot of fresh installs, the in between is fairly limited\r\nMatchmaking can be very hit and miss but the gameplay is great\r\nDue to relatively small player count (usual daily peak of 2000) it can be a struggle to find games for some playlists but firefight and quick play can be very quick to find\r\nMicrotransactions suck but just keep your wallet close to your chest and you will be fine\r\nCampaign is nice but if you want a halo campaign just get MCC because multiplayer is the main appeal of infinite\r\nAnyway I do recommend this and I have about 50+ hours on this which aren't shown because I used to play it on Xbox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dropping this review to complete the steam nomination awards badge 2025. Thats all folks!\n\nGraphics looks good, gameplay feels smooth minus the terribly slow shader loading with every GPU driver update. Story is great for a long time Halo fan. Any chance to visit the Halo universe feels nice and the game is not really in a terrible place as it was at launch. Make of that what you will. \n\nA solid 8.5/10 (Halo 2 is my 10/10)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "La verdad la campaña me encantó, yo me pasé el juego en heróico y siento que tiene un nivel de dificultad balanceado, apreta pero no ahorca y eso se aprecia mucho, me encanta el estilo mundo abierto que le dieron al juego y los distintos objetivos en todo el mapa, me lo pasé bomba buscando las mejoras Spartan, los cosméticos y simplemente explorando a pie todo el mapa, la verdad me encantó mucho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "people just be hating to hate, this game is fun stop letting the media influence ur decision and try it before u hate too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still some of the best MP around in late 2025, its a shame more people dont play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is Halo Infinite the return of a legend or an attempt to revive the franchise?  \nAn overview of an ordinary player who grew up on Halo, but is not afraid to tell the truth.\n\n---\n\nWhen Microsoft announced Halo Infinite in 2020, fans around the world held their breath. After all, it wasn't just a new game — it was a promise to bring back the \"Golden Age\" of first-person shooters, an era when Halo 2 and Halo 3 forced schoolchildren to hide their Xbox under their desks in order to have time to play before the bell rang. However, what we got in the end is not just a game. This is a story about high ambitions, technical failures and an unexpected rescue.\n\n---\n\n🌌 Plot and atmosphere: \"The Master Chief is against everything\"\n\nHalo Infinite unfolds events immediately after the events of *Halo 5: Guardians*. Master Chief, one of the most iconic characters in the history of video games, finds himself alone on the destroyed Zeta Halo ring structure, with almost no memory and a broken suit. His ally is AI **The Weapon**, a conscious copy of Cortana, who is trying to figure out why she exists.\n\nThe plot doesn't break your brain, but it's atmospheric, emotional, and sometimes even philosophical. Especially if you've been following the saga from the beginning. There is no overload of dialogues or characters here — everything is focused on the Chief, his inner struggle and reconnecting with humanity. And yes, the finale leaves a light aftertaste... and a burning desire to see the sequel.\n\n---\n\nGameplay: freedom, but with caveats\n\nThe company is, perhaps, the main trump card of Halo Infinite. Unlike its linear predecessors, here you will find an open world on a huge ring structure. You can explore locations, clear out the bases of banshee bandits, find secrets, upgrade the Chief's abilities - all this in a free manner.\n\nThe gameplay is back to basics: ** No exoskeletons**, **No teleporters** — just stormtroopers, shields, grenades and your mind. The Return of the Grappling Hook (Grappleshot)** it has become a game changer: with its help, you can both accelerate in battle and perform spectacular jumping tricks. You can feel the weight of the Chief's body — he's not a superhero, he's a soldier, and this has its own aesthetic.\n\nHowever, **artificial intelligence** is a sore spot. Enemies often behave strangely, especially in difficult levels. It happens that the elites just stand and wait for their death, instead of attacking. It spoils the impression, especially when you want to feel challenged.\n\n---\n\n, Graphics and technical side\n\nAt the time of release (December 2021), Halo Infinite looked like... ** modestly **. Many fans criticized her for her \"plastic\" graphics and empty landscapes. But Microsoft and studio 343 Industries** did something that developers rarely do — they  listened to the community.\n\nOver the past two years, the game has received ** many updates**: improved terrain texture, added dynamic lighting and weather, redesigned animations. Today, Halo Infinite looks the way it should have looked when it was released — beautiful, large-scale, epic.\n\n---\n\n🕹️ Multiplayer: Chaos, but fun\n\nMultiplayer in Halo Infinite is free — and this is a bold step. It brings back the classic gameplay: Slayer, Capture the Flag, Big Team Battle** on huge maps with tanks and helicopters. All this works on an updated version of the Slipspace Engine, created specifically for this game.\n\nProblems? Yes, they were. At the start — inconvenient menu,  lack of rating modes,  problems with weapon balance. But gradually 343 Industries fixed everything. Today, multiplayer is a **live community** where beginners can practice and veterans can hone their skills.\n\n---\n\nHistorical context: from Bungie to 343 Industries\n\nHalo was born within the walls of Bungie, a studio that gave us not only a cult shooter, but also a cultural phenomenon. The first game was released in 2001 exclusively on Xbox and became a \"system game\" — without it, the console simply did not make sense.\n\nBut in 2007, Bungie left Microsoft, leaving the franchise in the hands of an internal studio, 343 Industries, named after one of the AI characters in the Halo universe. At first, fans were skeptical about the change of creators, but Halo 4 (2012) and Halo 5 (2015) Proved that the spirit of the series is alive.\n\nHalo Infinite was conceived as a **relaunch**, but with respect for the legacy. And although its development was accompanied by layoffs, leaks and internal conflicts, the game eventually became what many were waiting for: ** a love letter to fans from themselves**.\n\n---\n\nConclusion: is it worth playing?\n\nyes. Necessarily.  \nHalo Infinite is not perfect, but it is ** honest**. It shows that even in the era of battle royales and loot boxes, it is possible to make a shooter in which the main values are freedom, tactics and a sense of adventure.\n\nIf you:\n- we grew up on Halo 2 over a LAN network,\n- Do you want to experience nostalgia with a modern look,\n- just looking for a high-quality shooter with a soul,\n\n— then **Halo Infinite** is your choice.\n\nAnd if you don't believe me, just download the multiplayer for free and see for yourself: The chief is still in business**.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a rough start, this game clawed its way out of the woodworks to be in some way, complete. It is now at the very least a game I can revisit for years to come. Multiplayer is and has been an amazing experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an okay game if you really like grinding for items, It could take a few weeks to get something decent like an armor set or weapon skins but if you're okay with buying one battle pass that offers credits, then you're set to have some cool stuff. \n\nWhat does suck is the player base at times but thats to be expected in any MP game now a days so its a game, not the best game but hey its a game, 6.5-10.\n\nFlood modes are fun, ig.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than I thought, the open world still a little bit boring, through",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good now, but they stopped updating it LOL\r\nShould've launched like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo Infinite has the best multiplayer gameplay in the series! Its a ton of fun, the weapons are great and the state that the game finished in is really good. There was issues at launch but those have been largely addressed. Ive not done the math but Im pretty sure there is more customization for free in this game than any other halo game. Yes there are a ton of paid cosmetics and yes the prices are way too high but overall the game is great.  Dont believe the hate. This Halo game was 343s swan song and while there were issues it was definitely the best multiplayer and campaign of any of their games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You... You cant get past the main menu.\nAfter looking into it, I am not alone.\nHow can something so simple be this hard?\nLet me guess, you guys had the contractors/interns do that too...\nProbably my favorite campaign OAT tbh, but ya know..... cant play it.\n\nEDIT:\nI've just spent 3 hours of my life any finally figured it out. No thanks to Microsoft/343/Halo Studios.\nI can try to help someone if you message me, but thats 3 hours of fixing someone elses mistake that I can never get back.\n\nEDIT AGAIN\nIf the game crashes or closes, it .... wont.\nOnce again, it appears I am not alone.\nIt will crash task manager if you use task manager to close Infinite.\nThis software might be malware LOL\nThe quickest way to relaunch Infinite is to restart our PC.... by hand as the malware will not close so you cant even click restart pc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Both multiplayer and campaign were fun. Definitely 343s best work. Definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A new Halo experience with the feelings of the past. I enjoyed the open world experience with the upgrades and some side missions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Прикольная игра, всем советую, еще и бесплатная! На самом деле огромное спасибо разработчикам за их работу. Очень классная игра. Играйте",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great controls and variety of game modes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed playing it BUT, BUT, BUT the story should have been finished. Since Halo 4 we keep getting incomplete games!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great story, fun gameplay, and excellent multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I havent played the campaign yet, but the game is good especially with multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is Halo Infinite deeply flawed? I'd say sure.\r\n\r\nBUT... this game has my favorite Firefight. The PvE scratches a ton of the itch Halo gives me and the modern match-making combined with faster-paced Firefight has led me to play over 700 matches of it. I don't believe I've played even 100 matches of Reach or ODST Firefight COMBINED.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun. open world campaign is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "overall the story doesn't have the same \"weight\" to it as the others, but it was a very enjoyable time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am not gonna pretend like this game is the best Halo, cuz it is not, that much is obvious.\nThat said I still very much enjoy this game for all the best and worse reasons.\n\nTo me at it's best, it's a fun Halo game with silly gadgets, fun forge maps, and cool cosmetics\nAt it's worse, it's a pretty okay game overall, pretty bad decisions made by the devs, and said cosmetics cost more than they should. I mean come on.. 10 dollars for a damn color swap??\n\nBut, despite this, I do love this game. It's a fun title to pop in and pop out whenever I feel like it. I do hope the next multiplayer Halo is better than this for the sake of the Halo community, thought I sorta kinda very much doubt it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played mainly on Xbox, putting in hundreds of hours. Although the game is not what it could have been, especially graphically, the multiplayer is a ton of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mostly played this on Xbox when it first came out. Campaign is super fun. Multiplayer is pretty cool. Forge is confusing to me. Overall I give it a 7.8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty good. And it's free! Formula is freshened a little, although it's in some way still sad to see this zombie of a franchise still being paraded around.\n\nCampaign is not free, haven't tried that. Probably won't. Halo 1 was cool but the other games have been weepy and stale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Review After 100% Completion[/h1]\r\n\r\n[h2]Recommendation: Recommended[/h2]\r\n\r\n[h3]What I Liked (Pros):[/h3]\r\n+ Sandbox gameplay is peak Halo. Grappling around Zeta Halo, launching fusion coils, hijacking vehicles mid-air, it’s the most fun I’ve had in a Halo game. The freedom and creativity in combat are unmatched.\r\n+ Best-feeling Halo in the series. Movement is fluid, responsive, and empowering. The grapple hook alone changes everything, traversal, combat, exploration, it’s a game-changer.\r\n+ Open world exploration feels right. Landing on the ring and being free to roam, uncover secrets, and tackle objectives in any order captures the spirit of what Halo always hinted at.\r\n+ The Banished and the Endless are incredible factions. The Banished bring raw brutality, while the Endless introduce terrifying lore implications. [spoiler] The idea that they’re immune to the rings, more dangerous than the Flood, [/spoiler] is wild.\r\n+ Legendary ending teases something huge. [spoiler] Atriox being revealed alive after seemingly dying off-screen is a massive twist. Replacing him with Escharum felt like a downgrade at first, but knowing he’s still out there sets the stage for something epic.[/spoiler]\r\n+ Multiplayer is finally in top form. With Forge, custom games, new modes, and balance updates, it’s the best Halo multiplayer has been in years.\r\n+ Co-op campaign is a blast. Playing through the story with a friend, unlocking co-op achievements, and coordinating attacks was super fun.\r\n+ LASO is actually fun. Unlike previous Halo LASO runs, this one lets you carry the tank gun the entire time, and grappling around speedrunning it with a friend was an absolute blast.\r\n+ Cortana’s arc is surprisingly powerful. Her off-screen death early on felt like a letdown, but the full picture reveals a tragic redemption. [spoiler] From coldly executing Spartans to sacrificing herself to destroy the ring mid-activation, her story ends on a high note.[/spoiler]\r\n+ The Weapon (Joy) is a standout. Her dynamic with Chief, especially the moment she learns [spoiler] he tried to delete her, is raw and emotional. The awkward tension, the trust rebuild, and her growth are handled beautifully.[/spoiler]\r\n+ The Pilot adds heart. His fear, vulnerability, and connection to Chief humanize the story. Seeing Chief care about marine losses and comfort the pilot, all while never removing his helmet, is masterful. If only the TV show understood that. No one needed to see Chief’s cheeks.\r\n+ Boss fights are a major step up. Halo Infinite finally delivers memorable boss encounters. Standouts include: Escharum, The Harbinger & Jega 'Rdomnai.\r\n\r\n[h3]What I Didn’t Like (Cons):[/h3]\r\n- No campaign DLC. The Legendary ending begged for continuation, and the Endless deserved more screen time. It’s a huge missed opportunity.\r\n- Lack of biome variety. The campaign sticks to one terrain type, forested mountains. No deserts, snowfields, swamps, or alien zones. It makes the ring feel smaller than it should.\r\n- [spoiler] No Flood appearance. Even a late-game tease would’ve been enough. Their absence feels like a gap in the Halo DNA, though shoehorning them in might’ve felt forced.[/spoiler]\r\n- Staggered launch hurt momentum. Releasing campaign and multiplayer separately fractured the experience. If it had all dropped together, fully featured, it would’ve landed way harder.\r\n\r\n[h3]Wishlist – Things I’d Love to See Added:[/h3]\r\n[list]\r\n[*] Campaign DLC – Expand the story, explore the Endless, and give us new biomes and missions.\r\n[*] Biome Diversity – Snow, sand, alien structures, anything to break up the visual monotony. \r\n[*] Flood Encounter – Even a short arc or side mission would’ve added tension and nostalgia. \r\n[*] Unified Launch Model – Future Halo entries should release campaign and multiplayer together, fully featured. \r\n[*] Incentives to Replay Campaign – More unlocks, secrets, or progression tied to campaign completion would help.\r\n[/list]\r\n\r\n[h3]Achievements:[/h3]\r\nMost achievements in Halo Infinite are straightforward and can be earned through exploration, combat creativity, and completing campaign objectives. The good news is that nearly all missions are replayable, so there’s very little risk of permanently missing anything, a huge plus for completionists.\r\n\r\nThere are a few that require extra attention:\r\n[list]\r\n[*] Headmaster – Complete all missions on Legendary with all Skulls active (LASO). It’s tough, but this version is actually fun thanks to the tank gun. Grappling around the map and speedrunning it with a friend made it one of the most enjoyable LASO runs in the series.\r\n[*] Wolves at the Doors - In co-op, lower all three gates within 15 seconds of each other at Riven Gate, hard with 2 or less players.\r\n[*] Controlled Demolition - In co-op, destroy four Fuel Silos within five seconds at either Ransom Keep or the Forge of Teash.\r\n[/list]\r\nThe only real grind in the campaign comes from collecting all the upgrades and collectibles. You’ll need a minimum of two saves: one for tracking and collecting everything, and another dedicated to speedrunning missions and completing LASO. Overall, it’s a fair achievement list, just keep an eye on your progress and clean up as you go.\r\n\r\n[h3]Memorable Quotes:[/h3]\r\n[list]\r\n[*] \"The ring is not your salvation. It is your prison.\" \r\n[*] \"We are the harbingers of your end.\" \r\n[*] \"You have been freed. But you are not free.\" \r\n[*] “The missions change. They always do.” \r\n[*] “We all fail. We all make mistakes. It’s what makes us human.”\r\n[/list]\r\n\r\n[h3]Final Thoughts:[/h3]\r\nHalo Infinite gets so much right. The sandbox is brilliant, the movement feels nice, and the factions are some of the best in the franchise. Grappling through Zeta Halo, launching into fights, and piecing together the mystery of the Endless feels like classic Halo with a modern twist.\r\n\r\nBut it also feels like a game that missed its moment. If it had launched with everything it has now, co-op, Forge, polished multiplayer, and dropped campaign and multiplayer together, it could’ve been a cultural reset for Halo. Instead, the staggered release and free-to-play multiplayer split the player base. It brought more cheaters, fewer incentives to stick around, and left a lot of players skipping the campaign entirely,  which is a shame, because it’s genuinely great.\r\n\r\nA lot of people probably bounced off early when they found out Atriox and Cortana were killed off-screen. [spoiler] It felt like a massive L at first. But the payoff later, Atriox being alive, Cortana’s redemption, and Chief’s emotional arc, really lands. [/spoiler] The way they handled Chief’s grief, his bond with the pilot, and his evolving relationship with The Weapon (Joy) was some of the best character work the series has ever done.\r\n\r\nAnd the voice acting? Absolutely top-tier. Jen Taylor voiced Halsey, Cortana, and The Weapon (Joy), and you can clearly tell them apart. Her performance, alongside Steve Downes as Chief, carries the emotional weight of the entire story. If either of them ever gets replaced, the soul of this franchise goes with them.\r\n\r\nAnd on the multiplayer side, unlocking the samurai armour and earning the Hayabusa armour again, just like I did back in Halo 3, was a nostalgic high. It brought back that same sense of pride and grind, and it was awesome to see it return in Infinite.\r\n\r\nStill, what’s here is excellent. It’s the most fun I’ve had in a Halo game since Reach. And if they ever drop that campaign expansion? I’ll be first in line.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was a very interesting love-hate thing with me, it being Halo I wanted to love it, play it, and do everything I could with it, but then the choices they took with the game, the micro transactions/lack of modes/no new maps and zero actual DLC and not to mention how painfully slow it was to level anything up during the first year of the games life.\n\nThis game was a golden platter handed to Microsoft, but because it didnt make billions of dollars Microsoft cut the cord on 343, I wont put all the blame on 343 as it seems with this game they really wanted to do something with it but got screwed over by the over lords of MS. \n\nAfter several updates though, I can def say this game is alot more fun to play now, having a ton of free to get gear, some of which being some very iconic, an actual account level to grind towards with a sweet reward at the end (although I wish we couldve gotten more rewards then just emblems for the climb up to Onyx. A few other good things about this game, the gun play feels the best out of every halo, its reactive, satisfying and smooth, the guns look and feel good (besides the fuel rod and carbine, but they both still feel good to use) the unique versions of the weapons are cool and I really enjoyed the story of this game, its a huge step compared to halo 5's story, and Id even go as far to say its better then halo 4's story. I would def recommend getting the story if you dont care about multiplayer.\n\nThe armor in this game is awesome and dookie, on one end of the armor we have a BUNCH of classics that returned and have never looked better, while on the other end we have sets that look like the belong in the loonytoon show, and although with this final update we got a ton of free to aquire gear there is still a TON of very classic and iconic gear sets locked behind $20+ pay walls, which is my biggest take away fromt his game, as one of the main reason I was a huge fan of halo was the armor, and with halo 5 being whatever that was with its armor I was really hoping Inf was gunna be different, and although it is better then that stupid rec packs its still annoying seeing some of my beloved helms unable to be obtained cuz I dont wanna spend a stupid amount of money on a dying game for 3 pieces of armor.\n\nIn the end tho, if you dont care about a crazy amount of customization, or just wanna try the story, or mess around on firefight (which is what I mainly do) I 100% recommend playing this game, dont listen to all the crash outs saying this games the worse of the series cuz it is by far not, That will always be Halo 5 in my eyes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its not as good as the bungie games but damn they come soooo close. easily the best 343 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beat it on Legendary. Not the best overall campaign out of the games, but still entertaining. The grapple hook was the best part. The open world map was pretty cool as well but could use variety in biomes. It didn't change much. Once you're done though, you'll be left wanting more of course.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good. Most the bad reviews are irrelevant at this point or just terrible excuses to why they wont play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've withheld my review of this game for some time, but now that the official sunset has been released, I feel I must speak my piece.\n\nI would recommend this game. I've enjoyed the gameplay since day one. Does it get repetitive? Sure. But we get a new COD every year, they're basically the same game, but we still play them (well I don't but you get what I mean). The game has remained solid throughout its development. It had connection issues, it had droughts, it had practices that were put into play just to take your money because you suffer from FOMO (February 4th Update, looking at you), but I wouldn't ever say the game felt broken.\n\nI am newer to the community, with my first game being ODST and my first multiplayer being Halo 5, and I understand that the community has been patient time and time again with broken promise after broken promise, but, at the end of the day, this game is still fun and still delivers a consistent experience. \n\nI've stuck with Infinite throughout its whole life cycle. There isn't a week long period I can think of where I didn't at least play this game for 1-2 hours. I used to play the game for the weekly rewards, then those were taken away. I used to play the game because my friends did, but they left Infinite behind. I used to play the game because I cared about my rank, but me being amazing at this game was a ship that sailed all the way back in season 2. Now, I play this game because it is fun. Not because it makes me spend money, not because it gives me a place to play with my friends, because it is fun.\n\nI understand that people are mad at 343/Halo Studios, and you have a right to be. The art should remain connected to the artist, but that doesn't mean the art isn't beautiful.\n\nWill I keep playing this game? Yes. After all, its the only halo multiplayer we'll have for some time. Campaign Evolved will bring friends together, but Infinite and MCC, for now will be the only games that can bring the community together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean...it feels weird that you launch the game and have to \"queue\" for the Campaign. It even gives you a warning that you're leaving your matchmaking room. The campaign feels like an afterthought and that just isn't what I prefer when it comes to the Halo universe. The story was....okay. I don't really feel like it added much to the overall universe that other games have previously. And it felt weird to be dropped into the middle of a storyline. The graphics are absolutely beautiful, the gameplay is also great. I just wish the story and campaign were more important than the multiplayer aspect. Also, fvck microtransaction. Microtransactions ruin so much, I wish we could move away from this practice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like a lot of people are saying, there are plenty of missed opportunities. This game is now over four years old and is still bustling with missing content or \"potential\" (like hello, are we ever getting Rocket Race back??), depending on how salty you want to be.\nFor all its faults, I'm always having a blast when I'm playing this. Much like Battlefield has their \"Only in Battlefield\" slogan, there are a lot of moments within the Halo Infinite multiplayer that you just don't get in any other game. It's chaotic, crazy, creative, and a lot of fun (except for when you get killed, then its bs.)\nPick it up if you haven't already. The single player campaign is in a league of its own as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game updates have come to an end and while the game had a rough launch the game has come a long way. Canceled campaign updates were sad with what the game could have been. Previous battle passes about to be put in the shop is a great thing that can preserve this game. Since launch and many updates the game is in a way better place than it was with many new guns, vehicles and others the game is overall worth playing now it is a fun and good time and a shame that it took years to become a complete experience. (Note: most of my time on this game was logged on my xbox not steam)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plenty of missed opportunities, I have my issues with it, yet entertaining nonetheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "from the movement to the graphics to the shooting to the story. this game just makes you want to play infinite hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are a lot of negative things I can say about Infinite, but at the end of the day I think it's a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Multiplayer is fun, balanced (as much as halo can be, really), and you can earn a lot of cosmetics just by playing now through spartan points, it reminds me of the credit system from reach. Has definitely improved far beyond its state at launch. Its free! If your specs can run it, why not give it a try at least? If you need a break from PvP, you can play firefight modes against non-player characters, but it can still get challenging, which is good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like the multiplayer to pass the time, what i like the most about halo multiplayer is the weapons, no attachments, non of that crap, simple and fun. id recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "join castom server\r\n\r\nsee someone who has mic\r\n\r\n talk to him he leave\r\n\r\n best conversion i had ll day 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally worth playing now. I can plaay it for more than 1 game without getting bored. (4 years after launch)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo Infinite is one of the best free sandbox games you can get. Especially now compared to at launch where it wasn't as F2P friendly, this game has what feels like unlimited customization and plenty of fan service as far as armor pieces and attachments. Halo infinite is new and fresh both from the 1-3 era of halo and the 4-5 era. and merges aspects of both using it's own weapons and maps, while also having legacy maps and modes for every fan of halo, new or old. More people should play this game honestly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game, do recommend, just wish they would add more stuff for some suits and update the sensitivity for Xbox controllers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is great nowadays. The multiplayer is very fun now that its had a few updates, and the campaign is miles ahead of Halo 4 and 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The soundtrack is so inspiring, I truly believe that this is an epic game. The variety of guns, modes, vehicles, and character customizations amaze me. An epic game, truly I tell you it is an epic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i haven't finished the game yet but idk how i feel about this open world type of biz i just gotta get used to it i guess but hey yeah fucking up aliens as masterchief is always awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a great game. I've been playing halo since I was like 7 or 8 and halo 3 was the game that started it all for me. Now I'm a junior in high school and looking back. After 4 whole years I've been playing infinite, even with its up's and down's, this game will be one of the best games that we got after Bungie left microsoft and maybe one of my top 5 favorite halo games. One thing i wish they could do is add, just before they stop updating the game, assassinations. Probably won't happen in this update, but still it would be cool to see some of those sneaky kill animations. Either way, its a great game and it is sad to see it go, but, HOPEFULLY, we have a great future ahead of us with Halo studios.\n\nI look forward to seeing new and old halo players in the games to come.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I genuinely don't get why Infinite got so much hate - it's not perfect, but the concept of an open world Halo Game is super fun - It could have been better, but it also could have been a lot worse",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This isn't a game you play to watch numbers increase or dress up in fancy gear.\nYou play this to enjoy a balanced arena shooter with satisfying gameplay.\nCOD, Fortnite and many others have got you covered if you can't enjoy a game without dopamine hits from numbers or dressing up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the realistic gameplay and good graphics. The enemies were good too. I have no dislikes about the game. everything about it was good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I grew up on Halo. I've enjoyed its highs, loathed its lows; Explored the many levels for skulls, terminals, super bounces, and everything in between. I appreciate what Infinite has done for both its multiplayer and campaign after the massive departure from everything I loved in Halo 5. Its not easy in the current world to backtrack the direction you've been headed, accept the loss, and return to your roots. Infinite does that in alot of ways while still trying to maintain some momentum and freshness it sought to bring to the more recent titles. Honestly the game has alot going for it, but it really lacked Forge on launch when player count was at its peak. Community is what made this game memorable for so many of us, and  not capturing that community by initially delivering a half baked product really hurt this game overall. Enjoying it none the less.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dont watch the hate, most of them are because of the Battle Pass, microtransactions and random stuff. But the game itself with a low price of 0$ is really good !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AMAZING CAMPAIGN, can't wait for the next one :) Multiplayer is also amazing!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Surprised this game is mixed. Honestly the best Halo I've played since 1-3. Way better than Reach, 4 or ODST. This one is a little bit more open word experience compared to the traditional linear story line. You take over bases and territory along side doing the main story missions. If you like Just Cause style gameplay then you'll probably like this game. Co-Op gameplay works great and multiplayer is very active. Campaign is $20 and multiplayer is free with is fair price for this IMO. Overall great addition to the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A solid Halo story campaign but nothing special.\r\nThe open-world is okay, not great but not bad either.\r\nBest thing was the grappling hook.\r\n\r\nMultiplayer was terrible in the early days since as a keyboard+mouse player you were at such a disadvantage compared to controller players that it felt almost criminal. They iirc fixed that, but never touched competitive since.\r\n\r\nINIFNITE is FINITE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a true Halo fan, you'll love this game. I have been with Halo for 20+ years, and despite all the changes, it still feels like Halo, they all have AND this one is free. It's fosho worth the time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good pvp, however way to many people running around who have clearly never touched a FPS title. hard to watch at times.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not as good as the originals but better than 4 and 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast paced but reminds me of the original Halo multi player as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game now, Id recommend with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open world design is bad, missions are okay, certainly not the best Halo, but better than Halo 4, worse than 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spent 45 hours at launch thinking \"Halo is back!\" Turns out, it was just visiting for the weekend and never called again.\n\nThe \"Live Service\" feels more like \"Life Support.\" The servers have more desync than a bad Zoom call, and the player base is so small you’ll start recognizing the same three enemies in every match.\n\nThey called it \"Infinite\" to describe the queue times, not the content. Stick to the Master Chief Collection.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Apparently deleting the intro logos causes Easy Anti-Cheat to freak out lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it never downloads but is a cool game with a lot of eastereggs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game that my absolute DOLL of a partner got me and I WUV HER SO MUCH",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the Multiplayer. Please bring Cortana back in the future games. PLEASE!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot of fun to play on Xbox and PC (: Thank you to the entire team that worked on and manage this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The addition of the Grappleshot adds a layer of creativity and mobility that completely transforms how you approach fights and exploration.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, but shorter campaign than expected",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great  multiplayer and story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too laggy for me it needs to run more smoother.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of people don’t like this game but I had a lot of fun with the multiplayer,  keep it fresh with new game modes and cosmetics to earn. I agree they should remove sprint tho. If you get the campaign IT IS UNFINISHED AND HAS BUGS, it took my brother 2 hours to get 1 skull because all the enemys were invisible invisible. Not halo invisible. They were just not there and the threat sensor didn’t work. but open world halo is very fun and I loved finding all the Easter eggs and upgrading the equipment. Overall I loved finding all this game and have a lot of fun with my friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sure, the game was absolute trash at launch, over the years and as of this review, the game is insanely fun. It does suck that the game is now no longer going to be updated, especially how 343 promised us 10 years of Halo infinite, but it is still a very good game to play for all FPS players, be it competitive or casual. I've loved my time with this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "sadly the second this game gets good and has enough content to justify playing it, they decide to abandon it. This game has extrerme potetial, especially with the forge mode, being the best map and game editor i ever saw in a video game, its sad to see such a game beeing abandoned",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game with great gunplay, solid maps, and that classic Halo feel. Sadly, I have to play on about 250 ping since there are no local servers, so matches can get a bit janky at times. Still, despite the lag and occasional rough moments, the game is enjoyable and keeps me coming back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tbh it’s a hot take but I have loved every Halo game. Every single one. Dont care what the haters say. This game is fun just like every Halo before it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I only played the multiplayer, but it's fantastic. Absolutely would recommend, I get my ass kicked mostly and sometimes I kick ass, but I fail sometimes and die a lot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy this game. I have been playing the MP since day one and I love it. While the MP is free, the campaign costs 60 bucks. I wouldn't recommend it unless you are a diehard Halo fan. 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing throughout the last 4 years, I think this game get's overly hated on constantly. Grappling Hook was such a blast to play around with. My favorite online multiplayer title.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"We knew this day would come. They have found our fortress among the stars\" \r\n08/11/25 - Halo Infinite's content updates are coming to an end!\r\n\r\nI know a lot of people have a lot of very valid problems with this game. The over stuffing of micro transactions; with no way of grinding in game currency (like Helldivers 2) without opening your wallet. The amount of things that were missing at launch from playlists to vehicle and weapon variety. And of course, all the way to the customisation options we could and SHOULD have had! For me, the lack of 100% cross core and the lack of vehicle variety are the biggest failings of this game\r\n\r\nSo why is my review positive? Why did I open this with a quote to a arguably better game? Because for all this game's problems, it does not change the fun I had! The hours I have spent on discord with my friends playing this game; from the amazing custom games! Playing infection in an Ikea shop was truly insanity and I laugh just thinking back to it! to the intense battles on slayer or super fiesta CTF where me ans Spartan 001 battled to the end and never gave up! \r\n\r\nOne of my favorite Halo Multiplayers will always be Halo 5! The speed, the assassinations; The ground pound. The weapons and the total joy that was Warzone Fire fight will always be something I cherish! Halo Infinite came on par with those memories! I lost a very close friend just before this came out. He was like my brother! He was the man who truly got me into Halo back in 2010, in many ways he trained me! And all the time I played Infinite, I always wished he was there with me, by my side fighting the banished like we fought for Reach! That said, my friend Kane who I played this with was amazing and I cherish how whenever I open the game; he saw it as as sign to join me!\r\n\r\nThis game was not perfect and my frustrations remain! But the fun I had, the laughs and the joy I feel when I look at this game will never go away!\r\n\r\nHalo Infinite, I love you! <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game so far ...but I expected better graphics. Very smooth game play.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "👎 Not Recommended\n\nHours played: 2,000+\n\nI’ve been playing Halo since Halo 3 back in 2007, so this series means a lot to me. Even though I enjoyed Halo Infinite early on especially around Season 3 and the Spirit of Fire operation I can’t help but feel disappointed with where this game has gone. The newest operation, “Operation: Infinite,” is finally releasing some coatings that were in the game files since launch but were never available unless you paid absurd prices in the shop or waited for them to show up in an operation pass.\n\nRemember when 343 said they had a 10-year plan for this game? That fell apart almost immediately. At launch, Infinite felt fresh fun gameplay, fluid movement, and a lot of promise. But after 2,000 hours, you start to see all the cracks.\n\nEver since the so-called “network update” about a year ago, the experience for me as a PC player has been steadily going downhill. Anything above 80 ping and the game becomes borderline unplayable constant blanks, heavy aim, broken hit registration, grenades disappearing midair, and rockets that simply don’t fire or explode. The gun-play feels great mechanically, but the networking and desync completely ruin it.\n\n343 has had control of the Halo franchise for over a decade now, and after three mainline games, it still feels like they’ve learned nothing. “One step forward, three steps back” should honestly be their company slogan at this point. Infinite nails the fundamentals the art direction feels closer to Bungie’s golden era, your Spartan feels agile and grounded, and movement is crisp like Halo 2 and Halo 3 not the hyper-speed, twitchy mess of Halo 4 and 5. The insider flight tests were amazing, the community feedback was overwhelmingly positive, and everyone was saying, “Halo is back.” Then the game actually launched… and it was the exact opposite of what we were promised.\nThe live service model is a desperate cash grab. Six years of development, over a hundred developers, and half a billion dollars yet Halo Infinite still has less content than most $40 indie shooters. They marketed it as “free to play,” but still charged $60 for the campaign which itself launched incomplete, lacking mission replay, co-op, or proper progression for months.\n\nThey promised “Halo Reach-level customization” and delivered a system where 85% of all cosmetics are locked behind paywalls or FOMO-limited event passes. You either grind through uninspired event challenges or pay up. And even then, the shop prices are ridiculous.\n\nThere’s just no motivation to play anymore. I only log in when there’s an operation or limited-time event, just to grab cosmetics I’ll probably never use. And even during those, I end up frustrated desync, heavy aim, disappearing grenades, and constant blank shots make matches infuriating. Playing on keyboard and mouse feels awful; aim feels sluggish and inconsistent, as if my Spartan is wading through quicksand.\n\nThe population drop tells the story: from millions at launch to under 7k daily players. For a franchise as legendary as Halo, that’s depressing. It’s a shell of what it used to be.\n\nHonestly, they should’ve just delayed the game another two years instead of rushing out a half-finished product to meet deadlines. 343 has had 12 years to prove they can carry Halo’s legacy and every time, they fall short. Infinite had everything going for it nostalgia, hype, solid mechanics but they still managed to fumble it beyond belief.\n\nAnd now with the recent reveal of Halo: Campaign Evolved (the new remaster), it’s clear no one at 343 or Halo Studios knows what they’re doing. Instead of fixing core gameplay issues or restoring community trust, they’re chasing remasters and marketing gimmicks. At this point, I just want a solid Halo multiplayer experience again something that respects the players, plays smoothly on PC, and doesn’t nickel-and-dime you at every corner. Until then, I’m done. Honestly, if you want to play a good Halo game, go play the Master Chief Collection. It’s far more enjoyable, the customization actually feels rewarding, and Halo: Reach is still alive and well with players who genuinely love the series. MCC feels like Halo. Infinite just feels like wasted potential.",
      "voted_up": false,
      "votes_helpful": 145
    },
    {
      "review": "dog shit game wont let you login\ndog shit game claims theres an error with login and proceeds to do nothing \ndog shit",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "not halo to me, game is a joke with years of promise and nothing to deliver at the very end. At least the campaign was seldomly enjoyable",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Played for few days, game was alright but since last couple weeks i have been having this really annoying crash on the game. Its been about a week that i have not been able to make any progress in the campaign mode since it crashes around a certain point in game and then shuts the game down on itself. I'm able to play for few minutes and then it freezes around same point and shuts down. This is ridiculous since i have tried everything on my end to get it working. I hope i get a fix on this from somewhere \"343 Industries\".",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it's a shame to see what the 343i did to our beloved master chief...\nthe \"open-world\" campaign adds nothing to the already-proven and fun gameplay loop the series is known for, although shooting feels pretty nice and especially the grappling elevates the movement (unlike adding sprint! don't know why they keep insisting to add sprinting to a game designed not to have sprint but what do i know? i'm not a genius working in 343i...)\nget the game for playing cam\"pain\" and enjoy a match or two in multiplayer but don't go looking for a full HALO expereince.\ni miss old bungie man...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dead in australia\r\n\r\nregardless, its a shit game, lol",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "completely worthless at even being able to open the game, worthless company of people with bad morals that are objectively evil.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Pathetic excuse of a game.   They can't even figure out their own shit. Don't waste your time. Halo really has fallen.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Coming from someone who played Halo 1, 2, 3 and 5. I STILL play the original Xbox Live Halo 2 multiplayer thanks to Insignia, (yes even on the original console xbox live works). \nHalo Infinite however, the last time I played it at launch, all the weapons felt weak/time to kill was too long, so at least 80% of my deaths were being melee'ed. I dont remember Halo being a boxing simulator with jetpacks.\nI am sticking with MCC and the OG Halo 2 Xbox Live. Bungie supremacy, fock 343.\nAlso the whole 10 year plan thing lol, everyone can at least agree that was total BS by 343. What a joke.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Probably safe to say at this juncture that charging people $20 for the colour white was a bad call that had catastrophic consequences for the franchise's last stand.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game would refuse to let me play without signing into my Xbox account and yet also refuse to let me sign into my Xbox account. Not even being signed into the Xbox app did anything. Tried every single fix and work-around i could find for almost an entire hour and nothing at all worked.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Reinstalled the game to check out what was new. I can't even sign into my xbox account when logging in. The xbox live popup comes up to sign in, but vanishes and an error comes up saying \"you must sign into xbox live\". Not sure if this is a bug or what.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The campaign is a buggy mess with bullet sponges and I'd rather play MCC for multiplayer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a RTX 8gb on my MSI laptop and Halo says that the card is not supported. I run win11 25h2 and latest nVidia drivers that just updated and for about a year now this game keeps saying it cannot find my graphics card or that it's not compatible. I used to play this all the time on this laptop but something happened last year and now I can only play this on my ATI RX580 desktop pc. So weird that the game supports a 10 year old card but not a 2 year old one. Oh well, I can play it perfectly fine on Xbox Live on this laptop but something inside Steam has ruined the game for my MSI laptop and my Macbook Pro, both with RTX video cards. Seems to be a common issue with nVidia drivers getting updated and the steam redistributable not being updated to match the vender drivers. Steam is getting worse and worse since that CEO took over. Good thing all the developers are releasing their own launcher for the latest games so I can bypass steam directly and actually play my purchased games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love halo but can't play this game keeps saying to sign into xbox live even though i'm signed in, looked online for a fix did basically everything still same problem, steam has a massive problem with using 3rd party apps to connect to games had the exact same with battlefield V as well maybe it's me maybe it's not but i can play forza motorsport no problem it's anytime i have to mess about with stupid things like this, shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "now i've been a big fan of halo ever since it was introduced to me when i was a kid. halo 3 being a personal favorite of mine despite playing reach before 3. it's home to some of my warmest memories, the times that got me through the stress and struggles of the time i had as a kid and the things i had to put up with, it was halo that got me through that all.\n\nbut for the life of me, i can't say i like this game and could reccomend it when it had became the unfinished mess it is now, full of too much ambition and broken promises, and a terrible multiplayer model for a system not needed on a game meant to be a flagship title for a launching console.\n\nwe were promised many things, and many things later. they insisted to us it's the most halo they've made for halo.\nhmmmm, what did they all do?\n\nsome halo fans didnt like that the classic shotgun got replaced overall in the sandbox with a new shotgun. then they said they'll just add it in an update. we never got the classic shotgun, but we did get some stupid fucking brute shotgun that belongs in doom. it's cool, but it honestly doesnt feel like a halo weapon, if im holding it im playing fucking doom.\n\nsupport for the coop campaign got cut. they added it, but they didnt give us the other features campaign should have had. no replayable missions, no story dlc to continue the story after the cool cliffhangar we got, campaign support being cut also means no new sandbox weapons are being added to the campaign, and that's kind of stupid; it kills the replay value. i would have liked to see the weapon sandbox fit and update with the multiplayer, and even some followups for the jokes of 'seasons' they had. they eventually said fuck that and went to 'operations' because they thought fomo works or some dumb shit like that.\n\nour store was just a place of overpriced bundles and by the time we got free currency, they make any decent items too fucking grindy to get, and also made promo items grindy, and offered you to buy the free currency to get them, but im not going to fall for that shitty marketing tactic.\n\ndesync still fucking exists and will show when you load up firefight and see everyone using only rockets and turn the match into a michael bay film.\n\ngunplay, i understand that some people early on insist it's the best gunplay, and while i agree its satisfying, sometimes, compared to halo 3, it's not as smooth and way more jank than 3.\n\ni really did like the armor abilities and how they used them in multiplayer, i thought that was executed well. though i feel like the campaign should have just had you scavenge for the abilities around and just accumulate the different gadgets instead of just making them suit upgrades. after all, i would like to feel like im playing halo, and fucking not far cry spiderman gear rising revangance; reign of the big bad guy's sad bald husband, though the campaign statement can be chalked up to personal gripe and opinion.\n\nmy takeaway from the armor abilities is changing dome shield then saying amped wall from titanfall replaces it, then pretend to bring it back and give us a useless sphere that nobody will walk up to\n\nwhen promoting the hayabusa helmet coming back, they should have just made it a fucking login reward. i dont give a goddamn fuck if it said \"earn spartan points\" IN A SENTENCE AFTER SAYING IT'S FREE, THEY DIDNT SAY SHIT ABOUT HAVING TO GRIND FOR IT, I'M NOT GONNA WASTE MY TIME ON THIS DOGSHIT JOKE OF A 'HALO' TITLE\n\nnow i understand that some people feel like this is the best halo campaign but it really isnt to be honest.\n\nthere's some neat emotional tugging moments, yes, but it's done so much 343 fanfic for the story i just cant say the campaign was good. i personally fucking felt it could have been better. we could have had better battles, a better setting, but they didnt want to offend anyone from what it looks like. you scooby doo chase a villain through his various BIG IMPORTANT FORTRESS WITH ALOT OF BAD GUYS and then hear about 10 glazing atriox speeches and hear a banished bad guy go \"hello master chief i am going to fight you now, i tortured alot of the good guys\"\ni honestly would have loved an introductory mission where you're aboard the infinity, chief is geared up, and he is getting ready to approach the new halo ring. then the infinity gets into this cool space battle, but its also brought a small fleet with them as well, so a cool space battle ensues, as the banished is fighting with their ragtag group of upgraded ships, before chief then flies into a banished ship carrying atriox and starts running a crazy assault on the banished flagship, eventually destroying it from the inside and getting into a cool beefy fight with atriox before their fight goes unfinished and they separate from the ship tearing itself apart as it crashes onto the halo ring, before they eventually separate on different paths to spiral into some events like chief going to retrieve the weapon, then he's racing to get to cortana while also trying to chase the banished, chief gets support from some fellow marines but as chief retrieves the weapon, the infinity crashes, and now the spartans (and maybe some mp spartans like yours) need to defend the infinity, establish themselves on the ring fight the banished and finish the fight. idk i wanted a story to be very much halo feeling and have it come full circle where chief fights atriox, then has to deal with cortana and get her to stop oppressing the galaxy in some cool epic finale where chief has to stop her and eventually put her in some ai lockup or something. \n\ninstead, 343 fanfic comes in, and does it's ritual of mollywhopping chief yet again by space kratos who is all like \"i am atriox im the new bad guy, now im going to disappear from the rest of the game because im not actually in this game at all.\" and throws chief into space which magically freezes him for 6 months. chief wakes up and the big bad guy he fought 'died' apparently which then just gets retconned at the end. all the spartans that were with you have been reduced to setpieces, so you cant live the cool fantasy of chief leading in fellow spartans on a cool assault against the bad guys in a new fresh coat of not halo 5 paint. oh yeah, funny how our boy fernando withstood the same shit and was just a little sore for a few minutes. after a little bit of far cry spiderman gear rising revengance, you get thrown a new 343 fanfic trope, which is introducing a new bad guy, and they're called the e n d l e s s (wow) and they're fucking stupid because theyre just some aliens that withstood a halo blast and now suddenly the forerunners just dont like them because they're enabling the flood i guess. instead of that; they could have played it safe and just gave us the flood to fight again, and say we need to make sure a proto gravemind isnt made, and this thing happens again because we dont have the arbiter and the swords with us because they're stuck on sanghelios until we can deal with cortana or some plot reason until we can get some of the swords of sanghelios to help out on the ring. oh, and since we get nothing cool, mught as well get myself some special variant rockets, hand them to every marine possible, get myself a razorback, and let every rocket marine on, and just let the banished feel all the frustration i feel on what's been honestly missing from the whole game.\n\nthey held off on adding forge until it was a year and a half late. that really choked the life out of this game. they also made the forge ui just as complicated as halo 5's forge, which without the prefab structure setpieces, are absolutely useless to me. some of those prefab structures in halo reach and h2a forge were pretty integral in map making, but it also offered familiarity to where people could create interesting ideas. cant build a cool spaceship no more.\n\nidk tldr: game fuckin sucks halo infinite? nah, failo midfinite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Halo players used to show each other what \"Built not bought\" meant. Not anymore, now its \"look how much i spent on the game\" There is no incentive to play the game for any length of time because the game rewards you with nothing for doing so.\nREST IN PIECE to a titan in gaming.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Is this a joke? 2025 and this game is badly optimized for any level of recreation. Microsoft letting this franchise fail should cause them to be condemned by the Better Business Bureau.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After 202 hours on and off since launch. I can finally say I'm free. Goodbye Halo.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "343 basically took a decade to make a mid at best Halo game (both campaign and multiplayer)  after the horrendous parodies that were H4 and H5.\n\nThey just released the final update for this game. Nice 10 year plan bois.\n\nDont even bother. Halo has fallen the momment Bungie left.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Until 343 or \"The Halo Company\" and Microsoft can get their act together, I cannot recommend this. Can't even get into the game, heck, not even the paid for DLC campaign, because something is wrong with their software and it won't let me sign in. The fact I have to sign in, in order to play something I \"own\" is ridiculous.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't even get past the xbox login lmao\nEverytime i do it it asks me to do it again and then endlessly loads\nHonestly probably for the best xd",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is pretty fun but it legitemately takes over 20-30 minutes to load to the main menu everytime on an m.2 ssd.\nI don't think that should happen and it seems to be an issue for a lot of people from what I've seen, the game's support has just ended apparently so I don't think that's getting fixed lol, mp's really fun when I got to play it, singleplayer (don't own it but played on gamepass years ago when that was worth it) was painfully average, wouldn't recommend it to anyone honestly, just boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Halo Infinite's campaign is empty and without life compared to Halo 1,2,3 or Halo Reach. 343 were the problem and their own worst enemy. \r\nThe engine of Halo Infinite and gunplay is very good.\r\nThe Multiplayer PVP Servers were dogwater and the main reason people left.\r\n20-30 ping is the equivalent to 400-600 ping in a game like Destiny 2.\r\nIt took them 6 months to make changes to maps that would of taken about 30 mins from any halo player ever.\r\nMicrosoft and 343 dropped the ball and it was Leaderships fault. \r\nThe workers did a very good job delivering a really good engine and game but unfortunately the only thing left of the halo community is the community.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Match 1, fun back and forth and felt like halo\nMatch 2, died the very first second in the match from long range shot because we spawned in the open and in front of each other. At least two of them were wall hacking and aim botting, and they were teleporting behind you. Thank you kill cam.\nMatch 3 was the same as match two with multiple players cheating. everyone in my team AFKd or exited the match.\nMatch 4,, CTF died not even a second into the match, die spawn die spawn gameplay and if they get in the right position you get spawn camped.\n\nthis isn't halo. just in name only. don't try it. Don't download it. If you're looking for a pvp game to chill in... this aint it. I'm gonna go back to MCC and play there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "multiplayer is ass on PC full of loser sweats absolutely unfun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Straight up a worse halo 5, please put halo 5 on pc so we can play the only decent modern halo. also queuing up for a game makes me want to blow my brains out, what do you mean I cant do anything while queuing besides look at one screen.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve got a system that should breeze through this game, yet I’m hit with a noticeable stutter every 2–4 seconds, regardless of graphics settings.\r\n\r\nA quick look at Steam and Reddit shows dozens of users reporting the same problem, but no definitive fix yet since the games release. I can no longer be bothered to try and fix it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really can't recommend. \nHad quite rough experience. Not only me but know others who had similar issues too.  Let's see.\n\nMicrosoft Login - Pointless & People have lost all progression to this\n\nSettings Can't Be Set - Resets Every time No Workaround and Dev's Don't Care\n\nNo Fullscreen?? What, why is this even a thing now?\n\nCan't set up right resolution anyway? Alright then..\n\nWhole game is a broken mess!\n\nCrashes!!!\n\nQuests Bugged Out!\n\nYup that's at least enough for me. Game it self when it works is not that bad. Never tried multiplayer, don't really care for it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gameplay was solid and story was fine for what it was should have expanded the story more with dlc sbmm ruined the multiplayer every other lobby or so was a sweaty competative lobby in casual i guess 343 forgot what comp playlist was for either way game is a miserable hell to play and it made me hate playing pvp games altogether to sum up this rant the game should and could have been more if microsoft would get their greedy hands off this game and the incompetance of this shit studio",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please sign into your Xbox Live profile.\r\n\r\nLoads for a minute.\r\n\r\nPress ENTER to play\r\n\r\nPlease sign into your Xbox Live profile.\r\n\r\nLook online for help:\r\n(Very detailed troubleshooting steps to fix my problem)\r\n\r\nThis game is NOT worth all this work for. I want plug and play, and this MicroShag bloat is not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "INTRODUCE NEW BIG THREAT ABANDON THE PLOT NOSTALGIA BAIT RINSE REPEAT\n\nanother example of why the live service model is disingenuous, deceiving, and dangerous to the game industry. they've completely neglected their original promises in favour of milking their multiplayer base for all their sanity if not money. \n\nessentially, Infinite is an amazing foundation with so much potential - but instead became a golden plate stacked with horse shit. If you think 343 is capable of honouring Halo as a brand and legacy? you're delusional.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun game when it works, but I've been completely unable to play it lately because of Xbox Live. I am signed in and other games work, but Halo Infinite just keeps prompting me to sign in.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Halo Studios (343 Industries) Fucked it ever since Halo 4 and then never stayed true to the story of Halo. Greed destroyed this game and i'm not gonna put up with it and move on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got Stuck on the loading screen and now cannot open the game. it loads almost all the way in, then crashes. fix please Halo Studios this is my Content",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrendous loading times. Really not worth to wait that long everytime you want to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuckass game fuckass xbox and fuckass niggas who are playing this shit. Go kill yourself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Took more than several attempts to log in to finally log in, each time after excrucitatingly long start up times, only to find that I can't actaully access any private lobbies or find a multiplayer match via the quick launch multiplayer function. Absolute waste of intenet bandwidth and time downloading this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "every time I see an update? I see how it just keeps getting worse. \nas a long time fan, playing Halo CE when I was just 9 years old? \nMy memories with Halo 3 and Reach? \n\nIt is so... disappointing. \nthe current \"Halo\" team is not a Halo team, clearly. \nEvery release that comes out just gets worse. \nWhenever they make a good release once in a blue moon? They ruin it by releasing a dozen other things nobody asked for. \nThings not even tourists to the Halo franchise asked for. \n\nThe current team is just a slop team churning out trash and putting out content \"they\" want while simultaneously claiming \"everyone wants this\". \nThis humiliation ritual... is just sad. \nI have absolutely zero faith in the upcoming Halo release as well. \nThey're going to ruin it. \n\nI don't \"think\" that, I know it. They don't know or understand Halo. \nI don't know how I wanted to watch Halo die. But I didn't want to see this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I personally had fun during the times I did play it. It is a shame that this game was put into \"salvage what we can\" mode 1-2 years after launch. Most of the content comes from unreleased cosmetics turned into stand alone weapons and community forge maps. It doesn't feel like a lot of what this game has to offer is dev made. Now with closing of support for Halo Infinite, here is to hoping the next game has better care put into it, though I doubt it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Microsoft in typical fashion is completely incompetant and tries to force you to sign into your xbox account, which doesn't actually work and softlocks the game. I was actually going to buy the campaign but considering that the game literally works better if you pirate it than it does if you buy it it's not happening. Also fuck microsoft for removing WMR support for Windows 11",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash game and the forum mods are a bunch of weirdos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fucking piece of shit. Gameplay is on par with \"contra city 3d play for free from playstore\". Everyone is dressed like clowns from Fortnite. What makes me laugh the most are reviews like:\n\n\"\n👎 Not Recommended\n\nHours played: 2,000+\n\"\n\nI would rather shine a torch in my own eyes for that amount of time than play this. Not worth the time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After not playing this game after it launched. i decided to reinstall to give it a try, to my surprise i found myself reinstalling and deleting files after the game not letting me sign in because *please sign in to a xbox live profile* which i did over and over and over and over again. didnt work a single time after spending over an hour looking for any possible fixes. Cant even get into the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved infinite, played during its peak and the gameplay is the best in the series they made sprint actually fit in halo but I downloaded the game again recently and it wont let me log in I seen other people have the same problem for some reason I need an Xbox live account to play the FREE game now? im so confused on when this change was made but its utter bullshit 343 I cannot recommend this game atm I would love to recommend it but I simply cant lets hope Halo studios fixes what 343 did wrong",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "aim assist on keyboard and mouse is just cancer \nyou cant miss so its just not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Music sounds fine when the game boots up but as soon as I get into the main menu it becomes muffled and low quality. Makes the game unplayable for me unless I just want to play without sound.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The developers' splash screens, which no one gives a damn about, are not skipped and are forced to show so everyone knows who made this crap.\nAfter installing the game, post-download updates take the same amount of time.\nYou need an Xbox account to log in.\nOnline is low.\nSomehow, I'm not surprised.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's utterly disgraceful how 343 is still allowed to this day to exist as a company because of Microsoft instead of being killed off and letting the Halo franchise rest in peace. Imagine being served one of the greatest multiplayer games on a golden platter and you just shit on the legacy of Bungie studios and continue to prove time and time again your inept abilities as story writers and game developers.\nOne of the largest issues with the game is the abhorrent customization system that they didn't even bother to improve or change, the lackluster gamemodes, constant desync issues that persist since 2021 and having to wait 15-20 mins of loading screens even if you manage to quickly find a multiplayer match, not even the singleplayer itself is that interesting save for the grapling hook and you're like 'Wow, Just Cause in Halo, I should've been playing that instead of this'. Don't even bother buying or downloading this neither for the multiplayer or singleplayer aspect, just pirate it. What a waste of a once good franchise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Speaking only about the multiplayer and not the campaign because they gave up on the single player immediately with no new content or updates of any kind with our DLC being a book, now they are giving up on the multiplayer. Halo studios, 343, whatever they want to call themselves just add failures and liars to the list.  10 year plan and couldn't make it half that.  Never believe anything this company says and never prepurchase any of their games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hit Onyx in 39.2 hours (including 50 pub matches) without any prior experience in Halo multiplayer. Easy gunplay with hardly any real competition (most likely due to the game being dead atp).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't speak for the campaign as I've only played the multiplayer. Gun play is good and graphics are nice but between crashing every hour and several minute wait times (with the exception of Firefight) make it a bit harder to enjoy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Had some Fun in this game. Now it sucks. First they changed the quickplay Playlist, so it also had some Fiesta modes(wich are sometimes fun, but not always) and no i have the xbox login bug, so i can´t play. Fuck this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Story is decent, everything else is a downgrade. 3/10.\n\nHalo Infinite feels like a massive step down from what the Halo franchise used to be. The game just isn’t fun. Most of the modes feel uninspired, and there are key features missing that previous Halo titles already perfected. Even the armor designs—something that used to be a highlight of the series—look low-effort, and many don’t even feel like they belong in the Halo universe. Somehow, even returning armor sets look worse here.\n\nThe new weapons are uninteresting and don’t bring anything exciting or memorable to the sandbox. There’s no equivalent to Spartan Ops or other content that gave earlier games more replay value, making Infinite feel like “Halo Lite”—light on content, ambition, and especially the fun.\n\nThe campaign is okay and definitely better than Halo 5’s, but the multiplayer becomes boring fast, especially with how weak the progression system feels. The entire experience comes across as generic and stripped of the identity that once made Halo special.\n\nI tried going in with an open mind, hoping for something that captured even a fraction of what made the older Halo games great. Instead, I found a stale, lifeless version of a franchise that used to set the standard for FPS games. It’s crazy to see what Halo has become, and I never imagined it would end up feeling this dull.\n\nGames should improve with each installment, but Halo Infinite somehow does the opposite. I can’t recommend it. It doesn’t feel like Halo, and more importantly, it just isn’t fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's sad seeing halo turn greedy, I mean you can buy color presets for armor but yet you can't customize each armor piece. Halo reach not only has more features but it was all free, specific armor colors for each piece and so much more. The campaign is really good, might be a little open world but you get a sense on what to do and upgrade.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "broken xbox live sign in i have it it doesnt work. shouldnt have to break my system over its self to play a campain... ps get in relation microsoft. cotona. is a WEON. why does she not act like it? wtf. bad story. multiplay is bad ass when the login worked.. 2/10 staying power",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great campaign, Great cosmetics, Great firefight, but words cannot express how much I hate this reductive matchmaking system that requires for you to do team coordination with randoms at your maximum effort. Absolute dog shit drip feeding win lose system purely designed for ranked players in the casual quick play mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game released 4 years ago, i have a high-end pc, still can barely hit 120+fps on low settings, always takes 5mins to load in, half the time you can't even login, other half the time you login and matchmaking takes another 3mins\n\nin 2025 it shouldn't take 10-15mins just to start playing a game that ends up stuttering on a high end pc, terrible experience\n\njust play MCC, much better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So much wrong with this game I don't even know where to begin.\n\n1. Just opening the game and navigating the menus are extremely slow. This game's shader compilation is the longest out of all the games out there. everything has a loading screen from picking modes to just entering the multiplayer.\n\n2.  The game's lack of content for the first 2 years are unacceptable for a Halo game. There is virtually no meaningful progression and only ONE gun was added after 4 years of support. Everything else that was slightly good came out of the forge mode and not from a dev created map, and even by then the playerbase fell off significantly at that point for anyone to actually care about. \n\n3. Campaign was forgettable. Played it one Gamepass once, never touched it again.\n\nDo yourself a favor and just get MCC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nice smooth but honestly really boring lots of vehicles and spammy stuff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wanted me to do a bunch of sh*t to fixed a broken sign in loop. just uninstalled instead. devs clearly dont care about game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not work on my Steam Deck. I tried many different solutions. If you only play on the Steam Deck, don't even bother.\n\nI also was dumb and didn't try it out until beyond 2 weeks after purchase, so I can't even get a refund. Don't waste your money and time like I did.\n\nI'll go play other games that actually work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matchmaking is terrible, not enough players and someone AFK or not matched in every ranked game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played this game at launch only to try it recently after them ending support soon and I can say that this game is ultimately a disappointment the weapon variety is lame as hell the campaign is mediocre at best and the monetization sucks honestly just stick with MCC for your Halo fix because it doesn't look like its gonna get better anytime soon",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Halo is a half-baked game with texture bugs and lock-up bugs, and you can't even sign into the game half the time. After 5 years, they haven't really done much to the game. Sound quality in this game is atrocious; you can hear a teammate shooting from a mile away, but you can't hear a 1,000 lb Spartan come up from behind and backstab you. Halo's ranked scene is a joke. Between people leaving matches, players not communicating on mics, and smurfs in almost every lobby, low-ranked players are allowed to team up with high-ranked players exp: ( a  diamond is able to team up with a silver). Controller players run around with what seems to be a built-in aimbot / No Skill Aiming. The only thing KnM has on controller players is faster turnaround speed that's all.\n\nNote: If you're wanting to play this game on KnM I wouldn't recommend. I wouldn't recommend it anyway game is almost dead, and the devs have given up on the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Complete mess of a game\n\nIn ranked if you beat the enemy too hard and they leave then it won`t count towards your `matches played` rank placement\n\nThe game is also VERY poorly optimized and the guns feel bad to play with",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it keeps crashing nonstop .before it was never like this the game always ran smooth with no issue i havent played this game in awhile same settings tho so idk wtf is wrong same hardware too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent 30 minutes just to load into the game only for it to soft lock me as it refused to log me into my xbox profile. Also FOMO garbage, old Halo is dead, blah blah blah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Back in the day If anyone ever told me that the halo franchise would be ruined. I would've never believed them but here we are. Ruined by micro transaction and ridiculous skins running around. Gun play is mediocre at best. Barely recognizable as a halo game at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bunch of fuckwhits, team cabbage hard at work destroying the halo franchise. Forced log in via xbox even though I have nothing linked to xbox!!! no XBOX INSTALLED, NO ACCOUNT LOGIN CURRENTLY HAPPENING!!! but forced log in none the less.\nwtf is point in this game being on steam if i have to sign in to XBOX to play the fucking game!! \nThe festering cancer of AI..................... poisoning the world we live in all day every day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fresh install today with about 90 mins of troubleshooting: can confirm that both the web/GPU cache clear & \"Xbl[_token]|2043...\" credential fix no longer work for new players with old XBOX accounts. This is probably because until you successfully sign in for the first time, those web cookies & credentials do not exist.\n\nRefunding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Have over 1000 hours on xbox APP, game is impossible to find a game in the UK. waiting waiting waiting...... given up trying\r\n\r\nCampaign is pretty good tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even load up the menu for the game cause it keeps asking for me to sign into my xbox profile and it wont even pull up any tabs or anything for me to be able to, so the game is officially unplayable now. I haven't been able to play this for over 2 years now, hoping an update would fix this, but absolutely nothing has been fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awful game. Microsoft should be ashamed what they did to Halo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mircosoft and 343 cant make a fucking functional login feature\nUpdate: Got it to work after jumping through several tedious hoops just to get soft locked on the second mission by a kill barrier directly on top of where you pick up The Weapon",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"Next 10 years of Halo\" barely made it 3 before dropping off\r\n\r\nand still no updates to single player campaign",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had to jump on and leave a review after hearing Microsoft call this a \"massive success\". The truth is this game was dead after the first month of release. No content, terrible maps, no players and best of all, it feels like there's about 30 people left on this game so expect 200+ ping in 99% of games.\nConsidering what a massive success halo used to be back in the day, 343 and Microsoft should be beyond ashamed. \nThis game cannot die because it was never alive to begin with.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They added battlepasses, vaulting cool gear and premium currencies to fucking HALO of all things.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuckass game fuckass xbox and fuckass niggas who are playing this shit. Go kill yourself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it sucked when it launched, it sucked 2 years in, and it sucked at the end. wont miss it, see ya!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was looking to dip my toes back in after a couple years and see what has changed. The login screen is entirely broken, making the game unplayable. I tried a handful of different troubleshooting steps, including all of the options on the Halo Waypoint troubleshooting page, and nothing worked.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "faggots tell me sign in to an account but i cant sign in because of infinite loading screen, fucking fucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "every time I see an update? I see how it just keeps getting worse. \nas a long time fan, playing Halo CE when I was just 9 years old? \nMy memories with Halo 3 and Reach? \n\nIt is so... disappointing. \nthe current \"Halo\" team is not a Halo team, clearly. \nEvery release that comes out just gets worse. \nWhenever they make a good release once in a blue moon? They ruin it by releasing a dozen other things nobody asked for. \nThings not even tourists to the Halo franchise asked for. \n\nThe current team is just a slop team churning out trash and putting out content \"they\" want while simultaneously claiming \"everyone wants this\". \nThis humiliation ritual... is just sad. \nI have absolutely zero faith in the upcoming Halo release as well. \nThey're going to ruin it. \n\nI don't \"think\" that, I know it. They don't know or understand Halo. \nI don't know how I wanted to watch Halo die. But I didn't want to see this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lmao. Maintenance mode already? whatever happened to \"The next decade of HALO,\" huh?\r\n\r\nmaybe if the artstyle wasn't boring, and the customization so predatory, more people would be playing. port H5 to PC already dangit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This Halo felt incomplete. And it wasn't because of the guns. The weapons themselves were interesting, the Bulldog shotgun was a particularly interesting one trading range for fire rate, as well as the new grenade launchers, it felt like a lot of niche weapons that could've easily coincided with the rest of the weapons already abundant in the Halo universe.\n\nThe lack of these halo classics, the lack of Forge until years after release, which only surpasses the Forge in Halo 5 by the skybox manipulation, and not much else, and was not as effective nor accurate as hoped. Now I don't play on the greatest of graphical settings but I do have access to a high-end PC atm and can confirm that many reflections don't actually reflect skybox changes accurately and easily destroys the immersion when trying to push these to their limit, as the idiots like me love to do with things like this. The only workaround I could find was making extremely dark maps, which only took me so far.\n\nI haven't even dipped into the campaign, because after dropping this game for 2 full years a month after its launch, I was not compelled to spend the money on it. I'll just watch somebody else play it.\n\nCan't help but feel very disappointed as a long-time Halo fan, and long-time Forger. I really, really wanted to like this one. I just...couldn't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horribly optimized. Fps fluctuations are insane on a 5090. Can go between 14 to 250 fps whenever it wants to. Horrible gaming experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chasing industry nonsense like a battle pass is anti Halo, anti consumer. \r\nAll good things come to an end ^_^ rip Master Chief.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "do not install through Steam. Install through the Microsoft store. The Steam download does not work. You will not be able to sign in. Do not waste your time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Coop is buggy, the story is boring, so is the BBEG who doesn't have anything to say except \"I'm better ! You're dead Master Chief ! I can't wait to clash with you and prevail !\"\n\nMultiplayer is OK\n\nThe menus are shit.\n\nI'm surprised they haven't bothered splitting MP and Solo campaign as DLCs as it was the case for the MCC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unable to log in via Xbox Live. Infinite login loop. Tried Reddit, Steam, and Microsoft support.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pretty bad, ngl. waited for coop before playing the mid af campaign, not worth the wait. multiplayer grind is a joke.  Lets all sniff the copium while we wait for remakes of the originals, and pretend one day they'll make quality new content",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "steam/xbox log it loop has ruined this game for me and my friends",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Campaign always get crashes on startup",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thought you may want to know : \n- X-box is ending live service support after four years.\n- Game will go into permanent  maintenance mode\n- Operation Infinite is the last update; it becomes finite. Before you spend $20 on a sweet deal, ask why so sweet?\n\nI hope you didn't throw ten dollars toward any certain related products, as it might have been a cash grab before a plausible de-platforming. Don't put your trust on a corporation, put  it in Michael J. Caboose.\n\nB~U~Y~E~R  beware. . .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same toxic sludge pit as the COD and GTA community",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "wow holy shit this is dogsht companies really tryna squeeze money off nothing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kernel anti-cheat.\nI'm playing a game not running a bank.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sucks ass. boring. tried it for old times. killed this game in everyway possible. dont get it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was fun playing with friends but the game was only here for money and the focus on greed hurt this game, Lot of hackers, bad matchmaking and maps that spawn you in front of enemies . Bad optimization and network issues and bugs that still exist now from launch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was excited for Halo Infinite from the start, between the flights and the multiplayer previews, I was ready to hop in to a new era of Halo. I lived through the content droughts and the mixed messaging from the developer. I stuck with this game for the past 4 years as my main. When I sat down to play, it was Halo Infinite.\n\nI mainly play ranked arena, so my review is mainly coming from that of a competitive perspective. With the latest update, 343i/Halo Studios have made the game unplayable. I know there's been a lot of talk about SBMM over the past few years, but somehow Halo Infinite's is by far the most aggressive implementation I've ever seen. The game actively does not want you to progress in the ranks. Once the game has you locked into the rank that it thinks you are supposed to be at, the SBMM will do everything in it's power to make sure that you stay stuck at that rank for good. I have gone from winning a game or two, to losing upwards of ten in a row before the game will \"bless\" me with a blood and sweat induced victory that could be attributed more to luck than actual skill. The winning streaks are few and far between, and the losing streaks are abundant. Halo Infinite is one of the least rewarding games I have ever played.\n\nThis next section falls into the \"I can't prove it, but I know it's true, trust be bro\" category. \nHalo Infinite actively manipulates the way the game functions in order to suppress ranks. If the game detects that you are getting too high in rank, it actively pairs you up with your weaker game modes on your weaker maps with teammates who are also playing their weaker game modes and maps, against teams of players on their strongest maps and game types with a much higher hidden MMR ranking. The game continuously does this until you are back at the rank you are \"supposed\" to be at. The game will also do things like manipulate hit boxes, manipulate aim assist, manipulate grenade trajectory and explosion times, manipulate explosion radius, manipulate melee lunge range all in the name of keeping you at a competitive disadvantage. All of this influenced by a hidden rank that you can't see, and was set for you after the game first came out and hasn't been reset. This makes the game utterly un-fun to play.\n\nAll of this sucks, because at it's core, Halo Infinite is the most mechanically and fundamentally sound games that 343i/Halo Studios has ever released. When everything is functioning, and players are on an equal playing field, the game is fun as heck to play, but at this point, I can't recommend any attempt to get into it, or for anyone to continue playing it.\n\nThis game was supposed to be the start of a ten year live service cycle for Halo. Now, 4 years later, Halo Studios has killed it. For what, you may ask? A Halo: Combat Evolved remake that nobody asked for. I guess Halo Infinite was the last piece of the franchise's rotting corpse that could be paraded around for all to see. It would have been much better for them to bring Halo MCC to Playstation, rather than remaking a 25 year old game with new \"modern mechanics\" that drastically alters how the game functions.\n\nMy rating, 2 out of 5. It sucks what this whole thing turned into, and I'm not excited for Halo's future.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}