{
  "positive": [
    {
      "review": "Bought this masterpiece for three bucks and honestly, that might be the best financial decision I’ve made since switching to generic cereal.\r\n\r\nJurassic World Evolution 2 is peak dad gaming. My reflexes are cooked. Battlefield and Call of Duty move so fast now that I swear half the lobby is powered by Red Bull IV drips. League of Legends requires reaction time that I simply do not possess anymore. I’m at the stage of life where if something jumps at me unexpectedly, I throw out my back.\r\n\r\nThis game though. This is where washed-up former FPS players go to retire. I can sit back, build a park, watch a T-Rex ruin a tourist’s whole life, and no one yells at me for having a 0.3 K/D. The only APM check is whether I can click “add feeder” before my dinosaurs unionize.\r\n\r\nIs it relaxing? Yes.\r\nIs it chaos? Absolutely.\r\nDid my raptors escape because I forgot to hook up power for the fifth time? Also yes.\r\n\r\nBut for $3, I’ve already gotten more joy out of this than most full-price games. If your dad reflexes are gone and your competitive spirit has been permanently nerfed by adulthood, welcome home. The dinosaurs will eat you, but at least they won't teabag you afterward.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Liked it a lot but became unplayable because of \"rangers not able to find way to dino\" bug. Very annoying and really takes the fun out.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Jurassic World Evolution 2 refines the management loop of the first game by improving dinosaur behavior, park logistics, and biome diversity. The core structure stays clear. Build facilities, maintain stability, and balance guest needs with animal safety.\n\nDinosaur AI is the main upgrade. Species show distinct social rules, environmental preferences, and aggression thresholds. These systems create predictable but dynamic interactions that force planning around enclosure layout and resource flow.\n\nThe management layer expands through power grids, staff roles, medical responses, and storm mitigation. Each mechanic is direct and integrates into a stable system of risk control. Park failures usually result from ignored indicators rather than random events.\n\nMaps vary by climate and terrain. Biomes influence comfort, visibility, and building placement. This adds strategic differences to each scenario without increasing complexity. Layout planning becomes a meaningful part of progression.\n\nCampaign content is brief. It introduces core mechanics but stays secondary to the challenge and sandbox modes, where the simulation has enough room to unfold. Narrative elements provide context but do not drive play.\n\nVisuals and audio maintain clarity. Animations read well, weather effects are consistent, and dinosaur sound design supports immersion without distracting from management tasks. Performance stays stable across large parks.\n\nOverall Jurassic World Evolution 2 delivers a controlled and predictable management simulation with stronger systems and more reliable AI. It prioritizes mechanical clarity and steady pacing over dramatic storytelling.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "nice game, does get a little repetative thought with the challanges, but story is good.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun, easy to figure out/ understand, great cozy game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is definetly one of my favorite game franchises, played this entire game on my playstation, then replayed it again on my PC, fully reccomend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good graphics for a $15 game, I would reccomend this to players but I would reccomend evolution 3 better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to hate sim games like these, but for some reason the fact that the whole game is a main focus on Dinosaurs? I'm able to sit down and hyper focus on this game for hours on end. \r\nThe different dinosaurs, the fact that you can basically just set up your own personal living natural museum in the vast mountains of Washington? It's amazing.\r\nThe dinosaurs don't even give a shit when a tornado rips through their pen. It's amazing. \r\n\r\nThe jeeps hack janky physics though. Be mindful of that drift and be prepared to learn how to drive backwards a lot. \r\n\r\n10/10 game. Dinosaurs are awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This second installation is a competent improvement over the first game. There have been enough improvement in dinosaur behaviours, habitat building, park economics, and park management to make the game better, and the main difference is the addition of lagoon (aquatic) species and the refinement to flying species, making the game a much more varied park builder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was a very cool experience for me, i love the dinosaur options. But i think the dlc's we're a bit too overpriced, other than that, its pretty awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The BEST evolution game ever, the realisticness feels so real that it makes you feel like you were there in real time, plus I like the dinos :) <from a fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "even know its 60 dollars its still worth it and on black friday its defintily worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such an amazing and fun game would recommend getting for sure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros: \r\n- Creating a fun park about Dinos, and seeing them and learning about them \r\n- Getting explore fun areas\r\n\r\nIn between \r\n- Weather. I know it's part of the game play, and that I think you can turn it off, but it still slightly makes me mad about the damage it does \r\n\r\nCons: \r\n-For now, there is none. I may edit this in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a relaxing/stressful park builder that really surprised me how much I enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is great, going to buy the third installment in the franchise soon. The mechanics are fun, the dinos are great to look at and watch roam around, the game is visually stunning. However sandbox mode is the thing that most appeals to me, and with the freedom that they give you on some of the larger maps, its impossible to fill the space before the game crashes from the amount of dinosaurs. I maybe got a third of a large square map completed. Not to say the sandbox mode isnt the most fun thing in this game, 1 third of the maps in this game is absolutely massive and I have hundreds of dinos already, with tons of fun attractions and rides. There's just so much empty space I cant fill because of the games limitations. Its heartbreaking. I'm hoping the 3rd game is a bit more optimized, I'd like to actually be able to play around with some of the water and air dinos.\n\nI definitely recommend this game tho, its a ton of fun, and so adorable, can't wait to play with babies in the 3rd game. Frontier outdoes themselves with each game. Wait for the game to be on sale tho I think. Game is more of a 30-40 than a 50-60.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING GAME, I would say this is the best Tycoon/simulator there is about this besides JWE3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes. Definitely. Not only does this game force you into new playthroughs cuz you learned from previous park-ending mistakes, but it also allows you to sit back, relax, and just enjoy the view of your dinos roaming, feeding, chasing prey, and living their lives. \r\n\r\nMy only issue is that storms are definitely annoying and quite overpowered when it comes to destruction, but aint an issue since I do believe I saw an option to toggle it off so Idc. \r\n\r\nRecommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best fucking game i have ever played like wanna chill sandbox fun campain like bro  its 100000000000000000000000000000000000% worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, there is SO many ways to build your park, so much content even without DLS-s",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- Made a park\r\n-Going well \r\n-Gets 5 star\r\n- Gets Indominus Rex \r\n-Breaks out\r\n-Ratings drop \r\n-I get mad\r\n-Clone 60 Raptors with the Aggressive trait\r\n-Release them.\r\n-See it all unfold.\r\n\r\n10/10 worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like it bc I like dinosaurs and it really helps simulate jurassic world/park",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so good the graphic the animation everything  I saw this game and i fell in love with it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "es la verdad un juego que e querido jugar desde hace mucho, porque desde niño jugue al 1, y me hacia demasiada ilucion jugar el dos, aunque sea ya mayor de edad cumpli un sueño y es un juegazo <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its super fun and peopel should play it i do admit at first its kinda hard but you figure it out fast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "overall the game tests your patience a lot (and sanity). the storyline was really fun and i never really got bored from start to finish, and we're talking about story missions that took like 6 hours to finish at a time. \n\nif i were to change anything, it would just be to improve anything to do with ammenities. sometimes it doesn't say exactly what ammenity could perform better which leaves my rating ammenity at 97% which really f*cks with my ocd - games really good other than that, i had an absolute blast and will definately 100% it one day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had so much fun playing this game! It was very enjoyable and I cannot wait to play the newly released JWE 3!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing and I would definetely reccomend any dino lover to play this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and cool, love the parasaurolophus model!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really great game, especially if you want to make a choatic dinosaur park, really fun for the times you have a lot of free time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Couldnt afford 3 so I bought 2. Surprised its a 10/10 so far. Very cool dinosaurs and concepts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game made explore all of my creative ideas and have emotional connection with the Dino's like a friend i would recommend this game to every one this has brought so much joy made me feel liked i helped the Dino's in a way i want to get jwe3 but maybe just got to get money love this game you should play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "realistic and honestly really enjoyable if you like games like planet zoo but dino ver!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The controls are great. The graphics are next level, and the battles are fantastic. Easy 5 stars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's been very engaging so far and I look forward to completing the game and building my biggest/bestest Jurassic Park!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Typically sequels fall face flat. Surprisingly, I really like JWE2. It did what it was supposed to-- improve and expand on the original game. Really nothing negative to say about it, except a few glitches that are few and far between where my dinosaurs get stuck in place and become immune to sedatives, eventually starving them. I also feel that the third version of the game that is soon to be released could have just been an update for this one...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very good and I thing everything was designed to perfection. It does feel like a secound life every once in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved the game but i uninstalled it then re-installed it but that caused a bug where everything is covered by white lines does anyone know how to fix this?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the first one, really liked it. Bought this one, then slept on it until now. I really regret not playing it sooner. The campaign was quick but the chaos theory challenges add so much more to the game. The gameplay is beautiful, not a big fan of paying for content though. All round good play while I wait for the third one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good graficks good idea good gameplay good dinosaurs good good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is very good for everyone on the platform run smoothly, and the hole game is too cheep for how good it really is. For quote on quote Dino fans hungry for facts, when u do some stuff there may or may not, \r\nspoiler: there are facts, a lot of them plus realistic features like: dinosaurs can be sick, they can starve, they can dehydrate, and ect. but for new players, there is a sandbox or creative mode, in witch u have unlimited money, and can edit the settings of the save file. i wont spoil the game more, btw i cant waste my lifo on making long @ss texts, see for ur self, i hella recomend out of bounds/10 lmaooo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's so fun you get to build your own park and it has the Indominus rex and Indorapter that you have to unlock but for free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game if u are a dino lover and who doesnt like dinosaurs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like dinosaur zoo. The quests are a little funky but w/e, still dino zoo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm probably going to have a lot more hours on this game, but currently; Absolute cinema.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a very fun and addictive game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like dinos and this is my gem! Great game! altough give us more dinos for free!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its best of first franchies and then i play next game of this franchies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if your into the Jurassic franchise and dinosaurs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Release Trex into the park and let it eat all those sad people trying to run",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly love it. I've had the first one since i was a kid and i would never choose any game over it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this game on Sandbox Mode. I TOTALLY recommend this game to Dino-Lovers like me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 would definetly reccommend would rate it higher if i wasnt as laggy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it when my dinosaur breaks out and tramples a random guy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good graphics really fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has taught me many life skills on how to manage a company and take risks and more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT HATCH DINOS WITH THE INTELLIGENT TRAIT UNLESS YOU WANT TO LOSE YOUR EVERLOVING MIND",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just goated maby missing some minor details but the rest is perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like Dinosaurs. Dinosaurs are cool. Cool people will enjoy this cool game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really just wish there were more dinosaurs. That's my only complaint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may not be cheap but I have lots of fun by playing it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun game for building to your imagination!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game insane just dont buy the 3rd one they are no differant",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "makes me want to release multiple deadly animals into public :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pure creativity, i am lazy so i will stop now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great dinosaur game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that also has that 2-week Minecraft phase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its rurrasic world thats the only reason",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game if you like tycoon games or games like plant zoo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is AMASING you get to make your own JRASSIC PARK play it and  you will know what i mean",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "IT IS AN OLDER VERSION OF THE JRW 3 BUT IS BETTER WITH THE DLC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun I would absolutely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "has dinossaurs, therefore its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Who ever dreamed of created a huge dinosaur theme park where everyone is welcome? Me of course!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun buy the 3rd game same price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BIG RAWR AND THEN STEP BOOM BOOM BOOM BIGGGGG LIZARD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect game to play when you feel bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so peak and it has dinosaurs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You wanna build a dinosaur park? This is the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great tycoon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games ive ever played just expensive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool dinosaur game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like dinosaurs, and this has dinosaurs and they are cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like dinosaurs and I have autism.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good dinosaur game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I CAN  MAKE SO MANY REMAKES OF JP/W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game to play as a family.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like dinosaurs and im 53\r\n\r\nwould reccomend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game and can't get enough of it :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its the theme of my favorite movie series!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, uh... I guess life finds a way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game honestly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love being able to design the park!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "we want a bigger giganotosaurus!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE WHEN THE TREX LOAFS UP LIKE A CAT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun Really Recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like dinos so if you like dinos you will like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "younger me would have LOVED this even tho i do love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game i played",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "its a 4 year old game and it still has some awful bugs. I only played for couple of minutes but during this time game decided to ignore my inputs multiple times. I wanted to turn right, the game would force car to turn left etc. I unplugged my xbox controller and still it ignored half of keyboard or mouse inputs.\nWell done devs, I hope one day you will actually put some effort into testing your game :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jurassic World Evolution 2, jugada la campaña, es un juego más bien flojo. La idea está bien de base, pero la ejecución de la misma es demasiado simplona y aburrida. El parque tiene demasiados pocos edificios, y su gestión es super sencilla y carente de gancho. Cazar dinosaurios para meterlos en el parque tampoco aporta mucho, con una conducción mediocre y un sistema de disparo bastante aborrecible. A la investigación y mejoras tampoco le va mejor, siendo demasiado pocas y limitadas. Y el crear espacios para dinosaurios es también demasiado simplón.\r\n\r\nGráficamente es un juego pobre, se mire como se mire. El sonido cumple, en eso sin duda no hay problema. Y aunque los tutoriales son algo meh, no puedo decir que haya tenido demasiados bugs y los que ha habido han sido muy menores. \r\n\r\nEl resultado es un juego que, sin ser terrible, sin duda es olvidable. Un 4.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is pretty clunky and boring,  i normally love frontier games (like top 10 game devolpers), but this is the first one ive hated, i got this on a deep sale, like 10$ or something and its still not worth it. I will say it looks like there is a lot of depth, but who cares if it is just so boring. In my opinion, save your money, and spend it on a different frontier game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very poorly designed game. I got the game at a steep discount, and it was not worth the money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a dinosaur game, not so much a park game. It tries to be a park game and falls flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i think i stopped caring after i finished campaign and chaos theory, then i realised i was playing the same thing as the original but with less soul",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the most boring games I have ever bought.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dunno, I liked the first one more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "make baby dinos come on and i mean on this game or make a dlc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Painfully boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "• Remark : \n- I only played till Washington second mission and I'm so tired and fedup\n- i never played a game that is so boring!! 3hrs for 1 tutorial mission??\n- tutorial is not that helpful and I keep on repeating repair fence, if the fence can so easily broken, what is the use of electric fence?\n- Controlling of the ranger and helicopter is hard and AI can't find the path? WTH. \n• Graphic : realistic\n• Control : keyboard and mouse\n• Price     : Only get when it is 90% sales and if you like dinosaur  \n• Rating  : 5/10, got higher score just because of Dino, I have all DLC and I'm regretting",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "trash IA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "click Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\nclick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\nclick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\n\nGlitch where dinos break through the walls for no reason, it will never be fixed.\nUseless 1 stage auto-save\nThey try to disguise the lack of content under unnecesary grind and NO automation at all, forcing you to manually manage unnecessary things at the point you have tendinitis from clicking so much.\n\nThis is sad because I know Planet Coaster and I know what Frontier is trully capable of",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My review is quite mixed; there's a lot of good in this game but it never feels like it *quite* manages to become a proper zoo tycoon and there's a lot of missed potential as a 'disaster management' simulator. \r\nHowever. Dinosaurs.\r\n\r\nThe campaign is bad. I didn't realise until I was 80% through it that it was meant to be a campaign and not a bunch of oneshot tutorials as they were mindnumbingly easy and quick. They don't do a great job of teaching you the mechanics of the game outside of the basics either.\r\n\r\nThe actual fun part of the game is the sandbox mode and how you can craft it to be actually challenging, although in this case 'challenging' is mostly just a tornado going through every 5 mins and fixing the fences. The dinosaurs themselves don't have a lot of personality although they do look very nice. No proper pack hunting, no proper herding behaviour, no juveniles, no nesting, limited interspecies interactions (herbivores are basically walking buffets no matter the species and nearly all carnivores have to be isolated).\r\n\r\nThere's also awful bugs such as one that prevents rangers leaving their station and you have to drive them out manually. This has been an issue for years but Frontier has given up on the game and are moving on to JWE:3 so RIP.\r\n\r\nEssentially, the game isn't detailed enough to be a zoo tycoon but not bold or imaginative enough to be for disaster management. It feels very directionless and I reccommend if you're a HUGE dino lover then skip this game and wait for JWE:3. It's an ok game to turn your brain off for an hour and try to hatch your fav dinos but after that you have to content yourself with watching them walk around aimlessly into a frustratingly dense forest whilst your rangers sit in the car park having an eternal smoke break.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "The story mode was such a let down compared to the first one. It takes you through a tutorial where it 100% holds your hand and then leaves you almost no room to enjoy it. But if you want to do all of the challenge modes they are there for you. After beating the \"campaign\" I had no sense of completion. I enjoyed the first game much more.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sadly, the campaign is just a bunch of tutorials, and there's no true career mode like other Zoo Tycoons offer—unless you custom-make it in sandbox mode which takes the point away of sandbox mode vs career mode. The game is okay, but it's just shy of a couple of things and some fixes in certain areas to make it feel like a good Zoo Tycoon type game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Basically a better rendered version of the first game, with different dinosaurs, updated animations, and a few more tools. Can't wait for JWE3 to be the exact same lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried so hard to like this game. I love simulation, building and management games. This one I bought on sale and would only recommend you buy it on sale. No matter what I do the conversations in the right top corner are SO SLOW that I rage quit. It's not my favorite game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Oh another Death by DLC game great!\r\n2/10 great idea, awful execution again. no more of these games. this whole series couldve been one game that wasnt a cash cow DLC shitshow. avoid.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "main camapaign is lackluster and doesnt even introduce the majority of buildings or dinosaurs.\r\n\r\ngame is otherwise pretty boring and lacks conflict.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whatever happened to Gary Cooper? The strong silent type. \n\nThese characters wont stop talking and its tutorial this and tutorial that. LET ME PLAY QUIETLY.\n\nThey are very annoying and not funny at all.\n\nGameplay wise, why would you let me do everything manually? Tranquillise the dinosaur, missing 90% of the time, check on the dinosaur with car and binoculars. why the manual labour?  I am here to build and manage a park, what happened to that?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "first level was fun, but then path glitch killed it for me. hopefully the new game doesnt have this..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed the first game. There were mechanics here and there that weren't perfect but it was a fun and full game. However, the sequel leaves a lot to be desired. Functionally, it's a great game. But heres an example of my mechanic gripe: The ranger nodes are poorly designed. Each base gives two rangers, with 5 assignments available. Assigning one to a ranger node fills one of those slots. Over work a Ranger and things fall apart. So build another ranger station. Until you have a ranger station for every two dino pens you create. The mechanic gets too unwieldy as the park grows.\r\n\r\nOnto the missions. The main part of the game. Every single campaign story, mission, whatever they want to call it is some half baked idea. Isla Sorna: Site B is easily the least inspired addition to this game. Who ever created this \"mission\" should be ashamed of themselves. \r\n\r\nThe game does a terrible job of teaching you which dinosaurs mesh well together, and how big packs should be. When you go into dinosaurs to learn about them, they are just wikipedia exposes of the history of the fossils, and theories on how the dinosaur looked and lived. Nothing about in game mechanics, or tips on how to blend carnivores with herbivores. Over all, this game is a poorer representation of the first game, that in itself wasn't perfect either. This game has amazing bones when it comes to the \"zoo tycoon\" aspect, but the missions are boring and uninspired. The game doesn't come up with it's own story, it just rehashes story lines from the movies, which in of themselves are just rip offs of the original. Such wasted potential.\r\n\r\nOh yeah, don't forget half the game is behind a DLC paywall too. Haven't touched that stuff because I refuse to put another dime into this franchise after this experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant play the game anymore since buying a new laptop(rtx 5070). Devs havent released an update to fix yet so pretty much a NO GO on newer laptops.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It has polish but like sweets, there is only so much I could take.\n\nThe game feels like it was made to refresh the dlc run. It could use playstation controller support since Steam isn't limited to just Xbox and frame limiter options.\n\nIts fun at first but becomes a chore with each remembrance of what comes next. I'm really hoping 3 does something new or different.\n\nI recommend the first if you haven't, and this if you want more. I just didn't I guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its fun if you can get it cheap on sale but the mechanics are very shallow and its definitely not worth full price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have to be unbiased here. I'm a huge Planet Zoo fan, I love simulators and management-style games with a lot of customization. This game does hit a lot of the marks for me, even if I wish there was a flat map with a lot of space that DIDN'T require me buying a DLC for. I love the dinos, graphics, and dino behavior. \n\nHOWEVER, this game is way too glitchy and laggy for a full release nevertheless a $60 game. Are you kidding me? My computer has great specs, I use a Geforce RTX and a NIVIDIA graphics card. I can run most games on full specs, but this game STILL constantly crashes even at low settings, which made me realize it isn't my specs but some janky code in the game itself. The game is great but the crashing and bugs ruin the experience for me sometimes honestly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun but not as fun as the first game. And though there is a lot of newer content it just doesn't run well with lower lever PCs like mine but the first one ran great on mine. I like that the game is so wide and vast but the campaign tbh is boring and not as fun as the first game's. Just my take on the evolution games was I loved it being able to make dinos and make a park and manage many things. I don't really care about saving dinos i want to run a park.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same as the first part. Probably same as the third part too. Overcomplicated, confusingly, unnecessary tasks you have to do to fill the game.\nBut hey! The next part is gonna cost 60$ again! Time to buy the third clone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game looks great, the dinosaurs look great — but way too much potential was wasted when it comes to the gameplay mechanics.\nThe dinos don’t really have any personality, there’s no real social behavior or proper herd mechanics. The disease outbreak system is just annoying, and fixing fences after storms is equally frustrating.\nThe system behind the park visitors is so poorly designed that you can completely ignore it without noticing any difference at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a 4 year old game and it still has some awful bugs. I only played for couple of minutes but during this time game decided to ignore my inputs multiple times. I wanted to turn right, the game would force car to turn left etc. I unplugged my xbox controller and still it ignored half of keyboard or mouse inputs.\nWell done devs, I hope one day you will actually put some effort into testing your game :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jurassic World Evolution 2, jugada la campaña, es un juego más bien flojo. La idea está bien de base, pero la ejecución de la misma es demasiado simplona y aburrida. El parque tiene demasiados pocos edificios, y su gestión es super sencilla y carente de gancho. Cazar dinosaurios para meterlos en el parque tampoco aporta mucho, con una conducción mediocre y un sistema de disparo bastante aborrecible. A la investigación y mejoras tampoco le va mejor, siendo demasiado pocas y limitadas. Y el crear espacios para dinosaurios es también demasiado simplón.\r\n\r\nGráficamente es un juego pobre, se mire como se mire. El sonido cumple, en eso sin duda no hay problema. Y aunque los tutoriales son algo meh, no puedo decir que haya tenido demasiados bugs y los que ha habido han sido muy menores. \r\n\r\nEl resultado es un juego que, sin ser terrible, sin duda es olvidable. Un 4.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is pretty clunky and boring,  i normally love frontier games (like top 10 game devolpers), but this is the first one ive hated, i got this on a deep sale, like 10$ or something and its still not worth it. I will say it looks like there is a lot of depth, but who cares if it is just so boring. In my opinion, save your money, and spend it on a different frontier game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a dinosaur game, not so much a park game. It tries to be a park game and falls flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most boring games I have ever bought.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dunno, I liked the first one more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Left me feeling like I'd already played this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "make baby dinos come on and i mean on this game or make a dlc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Painfully boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "• Remark : \n- I only played till Washington second mission and I'm so tired and fedup\n- i never played a game that is so boring!! 3hrs for 1 tutorial mission??\n- tutorial is not that helpful and I keep on repeating repair fence, if the fence can so easily broken, what is the use of electric fence?\n- Controlling of the ranger and helicopter is hard and AI can't find the path? WTH. \n• Graphic : realistic\n• Control : keyboard and mouse\n• Price     : Only get when it is 90% sales and if you like dinosaur  \n• Rating  : 5/10, got higher score just because of Dino, I have all DLC and I'm regretting",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "trash IA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "click Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\nclick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\nclick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\n\nGlitch where dinos break through the walls for no reason, it will never be fixed.\nUseless 1 stage auto-save\nThey try to disguise the lack of content under unnecesary grind and NO automation at all, forcing you to manually manage unnecessary things at the point you have tendinitis from clicking so much.\n\nThis is sad because I know Planet Coaster and I know what Frontier is trully capable of",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My review is quite mixed; there's a lot of good in this game but it never feels like it *quite* manages to become a proper zoo tycoon and there's a lot of missed potential as a 'disaster management' simulator. \r\nHowever. Dinosaurs.\r\n\r\nThe campaign is bad. I didn't realise until I was 80% through it that it was meant to be a campaign and not a bunch of oneshot tutorials as they were mindnumbingly easy and quick. They don't do a great job of teaching you the mechanics of the game outside of the basics either.\r\n\r\nThe actual fun part of the game is the sandbox mode and how you can craft it to be actually challenging, although in this case 'challenging' is mostly just a tornado going through every 5 mins and fixing the fences. The dinosaurs themselves don't have a lot of personality although they do look very nice. No proper pack hunting, no proper herding behaviour, no juveniles, no nesting, limited interspecies interactions (herbivores are basically walking buffets no matter the species and nearly all carnivores have to be isolated).\r\n\r\nThere's also awful bugs such as one that prevents rangers leaving their station and you have to drive them out manually. This has been an issue for years but Frontier has given up on the game and are moving on to JWE:3 so RIP.\r\n\r\nEssentially, the game isn't detailed enough to be a zoo tycoon but not bold or imaginative enough to be for disaster management. It feels very directionless and I reccommend if you're a HUGE dino lover then skip this game and wait for JWE:3. It's an ok game to turn your brain off for an hour and try to hatch your fav dinos but after that you have to content yourself with watching them walk around aimlessly into a frustratingly dense forest whilst your rangers sit in the car park having an eternal smoke break.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "The story mode was such a let down compared to the first one. It takes you through a tutorial where it 100% holds your hand and then leaves you almost no room to enjoy it. But if you want to do all of the challenge modes they are there for you. After beating the \"campaign\" I had no sense of completion. I enjoyed the first game much more.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sadly, the campaign is just a bunch of tutorials, and there's no true career mode like other Zoo Tycoons offer—unless you custom-make it in sandbox mode which takes the point away of sandbox mode vs career mode. The game is okay, but it's just shy of a couple of things and some fixes in certain areas to make it feel like a good Zoo Tycoon type game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Basically a better rendered version of the first game, with different dinosaurs, updated animations, and a few more tools. Can't wait for JWE3 to be the exact same lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried so hard to like this game. I love simulation, building and management games. This one I bought on sale and would only recommend you buy it on sale. No matter what I do the conversations in the right top corner are SO SLOW that I rage quit. It's not my favorite game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Oh another Death by DLC game great!\r\n2/10 great idea, awful execution again. no more of these games. this whole series couldve been one game that wasnt a cash cow DLC shitshow. avoid.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "main camapaign is lackluster and doesnt even introduce the majority of buildings or dinosaurs.\r\n\r\ngame is otherwise pretty boring and lacks conflict.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whatever happened to Gary Cooper? The strong silent type. \n\nThese characters wont stop talking and its tutorial this and tutorial that. LET ME PLAY QUIETLY.\n\nThey are very annoying and not funny at all.\n\nGameplay wise, why would you let me do everything manually? Tranquillise the dinosaur, missing 90% of the time, check on the dinosaur with car and binoculars. why the manual labour?  I am here to build and manage a park, what happened to that?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "first level was fun, but then path glitch killed it for me. hopefully the new game doesnt have this..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed the first game. There were mechanics here and there that weren't perfect but it was a fun and full game. However, the sequel leaves a lot to be desired. Functionally, it's a great game. But heres an example of my mechanic gripe: The ranger nodes are poorly designed. Each base gives two rangers, with 5 assignments available. Assigning one to a ranger node fills one of those slots. Over work a Ranger and things fall apart. So build another ranger station. Until you have a ranger station for every two dino pens you create. The mechanic gets too unwieldy as the park grows.\r\n\r\nOnto the missions. The main part of the game. Every single campaign story, mission, whatever they want to call it is some half baked idea. Isla Sorna: Site B is easily the least inspired addition to this game. Who ever created this \"mission\" should be ashamed of themselves. \r\n\r\nThe game does a terrible job of teaching you which dinosaurs mesh well together, and how big packs should be. When you go into dinosaurs to learn about them, they are just wikipedia exposes of the history of the fossils, and theories on how the dinosaur looked and lived. Nothing about in game mechanics, or tips on how to blend carnivores with herbivores. Over all, this game is a poorer representation of the first game, that in itself wasn't perfect either. This game has amazing bones when it comes to the \"zoo tycoon\" aspect, but the missions are boring and uninspired. The game doesn't come up with it's own story, it just rehashes story lines from the movies, which in of themselves are just rip offs of the original. Such wasted potential.\r\n\r\nOh yeah, don't forget half the game is behind a DLC paywall too. Haven't touched that stuff because I refuse to put another dime into this franchise after this experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant play the game anymore since buying a new laptop(rtx 5070). Devs havent released an update to fix yet so pretty much a NO GO on newer laptops.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It has polish but like sweets, there is only so much I could take.\n\nThe game feels like it was made to refresh the dlc run. It could use playstation controller support since Steam isn't limited to just Xbox and frame limiter options.\n\nIts fun at first but becomes a chore with each remembrance of what comes next. I'm really hoping 3 does something new or different.\n\nI recommend the first if you haven't, and this if you want more. I just didn't I guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its fun if you can get it cheap on sale but the mechanics are very shallow and its definitely not worth full price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have to be unbiased here. I'm a huge Planet Zoo fan, I love simulators and management-style games with a lot of customization. This game does hit a lot of the marks for me, even if I wish there was a flat map with a lot of space that DIDN'T require me buying a DLC for. I love the dinos, graphics, and dino behavior. \n\nHOWEVER, this game is way too glitchy and laggy for a full release nevertheless a $60 game. Are you kidding me? My computer has great specs, I use a Geforce RTX and a NIVIDIA graphics card. I can run most games on full specs, but this game STILL constantly crashes even at low settings, which made me realize it isn't my specs but some janky code in the game itself. The game is great but the crashing and bugs ruin the experience for me sometimes honestly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun but not as fun as the first game. And though there is a lot of newer content it just doesn't run well with lower lever PCs like mine but the first one ran great on mine. I like that the game is so wide and vast but the campaign tbh is boring and not as fun as the first game's. Just my take on the evolution games was I loved it being able to make dinos and make a park and manage many things. I don't really care about saving dinos i want to run a park.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same as the first part. Probably same as the third part too. Overcomplicated, confusingly, unnecessary tasks you have to do to fill the game.\nBut hey! The next part is gonna cost 60$ again! Time to buy the third clone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game looks great, the dinosaurs look great — but way too much potential was wasted when it comes to the gameplay mechanics.\nThe dinos don’t really have any personality, there’s no real social behavior or proper herd mechanics. The disease outbreak system is just annoying, and fixing fences after storms is equally frustrating.\nThe system behind the park visitors is so poorly designed that you can completely ignore it without noticing any difference at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a 4 year old game and it still has some awful bugs. I only played for couple of minutes but during this time game decided to ignore my inputs multiple times. I wanted to turn right, the game would force car to turn left etc. I unplugged my xbox controller and still it ignored half of keyboard or mouse inputs.\nWell done devs, I hope one day you will actually put some effort into testing your game :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jurassic World Evolution 2, jugada la campaña, es un juego más bien flojo. La idea está bien de base, pero la ejecución de la misma es demasiado simplona y aburrida. El parque tiene demasiados pocos edificios, y su gestión es super sencilla y carente de gancho. Cazar dinosaurios para meterlos en el parque tampoco aporta mucho, con una conducción mediocre y un sistema de disparo bastante aborrecible. A la investigación y mejoras tampoco le va mejor, siendo demasiado pocas y limitadas. Y el crear espacios para dinosaurios es también demasiado simplón.\r\n\r\nGráficamente es un juego pobre, se mire como se mire. El sonido cumple, en eso sin duda no hay problema. Y aunque los tutoriales son algo meh, no puedo decir que haya tenido demasiados bugs y los que ha habido han sido muy menores. \r\n\r\nEl resultado es un juego que, sin ser terrible, sin duda es olvidable. Un 4.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is pretty clunky and boring,  i normally love frontier games (like top 10 game devolpers), but this is the first one ive hated, i got this on a deep sale, like 10$ or something and its still not worth it. I will say it looks like there is a lot of depth, but who cares if it is just so boring. In my opinion, save your money, and spend it on a different frontier game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a dinosaur game, not so much a park game. It tries to be a park game and falls flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most boring games I have ever bought.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dunno, I liked the first one more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Left me feeling like I'd already played this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "make baby dinos come on and i mean on this game or make a dlc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Painfully boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "• Remark : \n- I only played till Washington second mission and I'm so tired and fedup\n- i never played a game that is so boring!! 3hrs for 1 tutorial mission??\n- tutorial is not that helpful and I keep on repeating repair fence, if the fence can so easily broken, what is the use of electric fence?\n- Controlling of the ranger and helicopter is hard and AI can't find the path? WTH. \n• Graphic : realistic\n• Control : keyboard and mouse\n• Price     : Only get when it is 90% sales and if you like dinosaur  \n• Rating  : 5/10, got higher score just because of Dino, I have all DLC and I'm regretting",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "trash IA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "click Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\nclick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\nclick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick Research\nclick Staff Rest\nClick tranquilize Dino\nClick Fix wall\nclick Expedition\nClick Staff Rest\nClick Expedition\nClick Staff rest\nClick Expedition\nClick Staff Rest\nClick Analyse fossil\nClick Staff Rest\nClick Analyse Fossil\nClick Staff Rest\nClick Incubate\nClick Staff Rest\nStorm Click Open Shelter\n\nGlitch where dinos break through the walls for no reason, it will never be fixed.\nUseless 1 stage auto-save\nThey try to disguise the lack of content under unnecesary grind and NO automation at all, forcing you to manually manage unnecessary things at the point you have tendinitis from clicking so much.\n\nThis is sad because I know Planet Coaster and I know what Frontier is trully capable of",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My review is quite mixed; there's a lot of good in this game but it never feels like it *quite* manages to become a proper zoo tycoon and there's a lot of missed potential as a 'disaster management' simulator. \r\nHowever. Dinosaurs.\r\n\r\nThe campaign is bad. I didn't realise until I was 80% through it that it was meant to be a campaign and not a bunch of oneshot tutorials as they were mindnumbingly easy and quick. They don't do a great job of teaching you the mechanics of the game outside of the basics either.\r\n\r\nThe actual fun part of the game is the sandbox mode and how you can craft it to be actually challenging, although in this case 'challenging' is mostly just a tornado going through every 5 mins and fixing the fences. The dinosaurs themselves don't have a lot of personality although they do look very nice. No proper pack hunting, no proper herding behaviour, no juveniles, no nesting, limited interspecies interactions (herbivores are basically walking buffets no matter the species and nearly all carnivores have to be isolated).\r\n\r\nThere's also awful bugs such as one that prevents rangers leaving their station and you have to drive them out manually. This has been an issue for years but Frontier has given up on the game and are moving on to JWE:3 so RIP.\r\n\r\nEssentially, the game isn't detailed enough to be a zoo tycoon but not bold or imaginative enough to be for disaster management. It feels very directionless and I reccommend if you're a HUGE dino lover then skip this game and wait for JWE:3. It's an ok game to turn your brain off for an hour and try to hatch your fav dinos but after that you have to content yourself with watching them walk around aimlessly into a frustratingly dense forest whilst your rangers sit in the car park having an eternal smoke break.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "The story mode was such a let down compared to the first one. It takes you through a tutorial where it 100% holds your hand and then leaves you almost no room to enjoy it. But if you want to do all of the challenge modes they are there for you. After beating the \"campaign\" I had no sense of completion. I enjoyed the first game much more.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sadly, the campaign is just a bunch of tutorials, and there's no true career mode like other Zoo Tycoons offer—unless you custom-make it in sandbox mode which takes the point away of sandbox mode vs career mode. The game is okay, but it's just shy of a couple of things and some fixes in certain areas to make it feel like a good Zoo Tycoon type game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Basically a better rendered version of the first game, with different dinosaurs, updated animations, and a few more tools. Can't wait for JWE3 to be the exact same lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried so hard to like this game. I love simulation, building and management games. This one I bought on sale and would only recommend you buy it on sale. No matter what I do the conversations in the right top corner are SO SLOW that I rage quit. It's not my favorite game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Oh another Death by DLC game great!\r\n2/10 great idea, awful execution again. no more of these games. this whole series couldve been one game that wasnt a cash cow DLC shitshow. avoid.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "main camapaign is lackluster and doesnt even introduce the majority of buildings or dinosaurs.\r\n\r\ngame is otherwise pretty boring and lacks conflict.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whatever happened to Gary Cooper? The strong silent type. \n\nThese characters wont stop talking and its tutorial this and tutorial that. LET ME PLAY QUIETLY.\n\nThey are very annoying and not funny at all.\n\nGameplay wise, why would you let me do everything manually? Tranquillise the dinosaur, missing 90% of the time, check on the dinosaur with car and binoculars. why the manual labour?  I am here to build and manage a park, what happened to that?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "first level was fun, but then path glitch killed it for me. hopefully the new game doesnt have this..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed the first game. There were mechanics here and there that weren't perfect but it was a fun and full game. However, the sequel leaves a lot to be desired. Functionally, it's a great game. But heres an example of my mechanic gripe: The ranger nodes are poorly designed. Each base gives two rangers, with 5 assignments available. Assigning one to a ranger node fills one of those slots. Over work a Ranger and things fall apart. So build another ranger station. Until you have a ranger station for every two dino pens you create. The mechanic gets too unwieldy as the park grows.\r\n\r\nOnto the missions. The main part of the game. Every single campaign story, mission, whatever they want to call it is some half baked idea. Isla Sorna: Site B is easily the least inspired addition to this game. Who ever created this \"mission\" should be ashamed of themselves. \r\n\r\nThe game does a terrible job of teaching you which dinosaurs mesh well together, and how big packs should be. When you go into dinosaurs to learn about them, they are just wikipedia exposes of the history of the fossils, and theories on how the dinosaur looked and lived. Nothing about in game mechanics, or tips on how to blend carnivores with herbivores. Over all, this game is a poorer representation of the first game, that in itself wasn't perfect either. This game has amazing bones when it comes to the \"zoo tycoon\" aspect, but the missions are boring and uninspired. The game doesn't come up with it's own story, it just rehashes story lines from the movies, which in of themselves are just rip offs of the original. Such wasted potential.\r\n\r\nOh yeah, don't forget half the game is behind a DLC paywall too. Haven't touched that stuff because I refuse to put another dime into this franchise after this experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant play the game anymore since buying a new laptop(rtx 5070). Devs havent released an update to fix yet so pretty much a NO GO on newer laptops.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It has polish but like sweets, there is only so much I could take.\n\nThe game feels like it was made to refresh the dlc run. It could use playstation controller support since Steam isn't limited to just Xbox and frame limiter options.\n\nIts fun at first but becomes a chore with each remembrance of what comes next. I'm really hoping 3 does something new or different.\n\nI recommend the first if you haven't, and this if you want more. I just didn't I guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its fun if you can get it cheap on sale but the mechanics are very shallow and its definitely not worth full price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have to be unbiased here. I'm a huge Planet Zoo fan, I love simulators and management-style games with a lot of customization. This game does hit a lot of the marks for me, even if I wish there was a flat map with a lot of space that DIDN'T require me buying a DLC for. I love the dinos, graphics, and dino behavior. \n\nHOWEVER, this game is way too glitchy and laggy for a full release nevertheless a $60 game. Are you kidding me? My computer has great specs, I use a Geforce RTX and a NIVIDIA graphics card. I can run most games on full specs, but this game STILL constantly crashes even at low settings, which made me realize it isn't my specs but some janky code in the game itself. The game is great but the crashing and bugs ruin the experience for me sometimes honestly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun but not as fun as the first game. And though there is a lot of newer content it just doesn't run well with lower lever PCs like mine but the first one ran great on mine. I like that the game is so wide and vast but the campaign tbh is boring and not as fun as the first game's. Just my take on the evolution games was I loved it being able to make dinos and make a park and manage many things. I don't really care about saving dinos i want to run a park.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same as the first part. Probably same as the third part too. Overcomplicated, confusingly, unnecessary tasks you have to do to fill the game.\nBut hey! The next part is gonna cost 60$ again! Time to buy the third clone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game looks great, the dinosaurs look great — but way too much potential was wasted when it comes to the gameplay mechanics.\nThe dinos don’t really have any personality, there’s no real social behavior or proper herd mechanics. The disease outbreak system is just annoying, and fixing fences after storms is equally frustrating.\nThe system behind the park visitors is so poorly designed that you can completely ignore it without noticing any difference at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a 4 year old game and it still has some awful bugs. I only played for couple of minutes but during this time game decided to ignore my inputs multiple times. I wanted to turn right, the game would force car to turn left etc. I unplugged my xbox controller and still it ignored half of keyboard or mouse inputs.\nWell done devs, I hope one day you will actually put some effort into testing your game :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jurassic World Evolution 2, jugada la campaña, es un juego más bien flojo. La idea está bien de base, pero la ejecución de la misma es demasiado simplona y aburrida. El parque tiene demasiados pocos edificios, y su gestión es super sencilla y carente de gancho. Cazar dinosaurios para meterlos en el parque tampoco aporta mucho, con una conducción mediocre y un sistema de disparo bastante aborrecible. A la investigación y mejoras tampoco le va mejor, siendo demasiado pocas y limitadas. Y el crear espacios para dinosaurios es también demasiado simplón.\r\n\r\nGráficamente es un juego pobre, se mire como se mire. El sonido cumple, en eso sin duda no hay problema. Y aunque los tutoriales son algo meh, no puedo decir que haya tenido demasiados bugs y los que ha habido han sido muy menores. \r\n\r\nEl resultado es un juego que, sin ser terrible, sin duda es olvidable. Un 4.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is pretty clunky and boring,  i normally love frontier games (like top 10 game devolpers), but this is the first one ive hated, i got this on a deep sale, like 10$ or something and its still not worth it. I will say it looks like there is a lot of depth, but who cares if it is just so boring. In my opinion, save your money, and spend it on a different frontier game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a dinosaur game, not so much a park game. It tries to be a park game and falls flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most boring games I have ever bought.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dunno, I liked the first one more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Left me feeling like I'd already played this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "make baby dinos come on and i mean on this game or make a dlc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Painfully boring",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}