{
  "positive": [
    {
      "review": "You should join a clan as soon as you start playing. Generally, it's the game with the fewest toxic players; most clans have a good atmosphere.\n\nIt's a really good game; there's always something to do.\n\nAlthough it's very slow at first, it becomes quite entertaining once you get the hang of it.\n\nYou can progress without spending money; there are no ads. Unfortunately, there are no regional pricing options, so buying things is very expensive.\n\nIt's a very chill game-as-a-service. I only buy the paid characters (around $25 a year), which don't make much of a difference to players who don't.\n\nThe worst part of the game is creating heroes for missions, but that's awful whether you pay real money or just in-game currency.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A lot of the creation options are locked behind a paywall. But for some chill gameplay and casual clicking while working on the computer? It’s pretty decent~",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it's really fun, despite there's so many micro transaction inside the game, but so far i can assure you that u can enjoy this game for F2P, the key is to be chill and relax, the general event is kinda common and once u level up u can get the score high as u want it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been with the same guild playing this game for over 3 years. It's engaging with events, an easy pick and put down for awhile game, and has a decent slow growth with the levels. While I always want more, Shop Titans has become my favorite most played game daily just for being an easy stress free game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good for some chill gameplay and timepass.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun time waster, it always has an event to participate in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good free idle game that looks good and can be played on a potato PC. There is more things to take care of than seems at first sight. Half Tip: Utilizing more than just making everything you are gonna sell, cause it won't be enough. It took me many hours to finally find a way to not have almost always empty shelves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soulmate brought me here, and now I am hooked...!\n\nYes, it is P2P yada-yada-yada, but I play it casually on Android cause it is cross-platform.\n\nI have a guild that I am solo holding down the fort. Would manage a shop again~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play in the background while reading or watching TV. In the beginning you have to pay more attention but the further you progress the less attention you need to pay to your shop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jeu facile à entreprendre, bien expliqué tout du long, on ne voit pas le temps passer !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра \"Shop Titans\" — это увлекательный симулятор управления магазином, где вы можете почувствовать себя настоящим мастером-ремесленником. Здесь вы создаёте оружие, броню и различные предметы, которые затем продаёте искателям приключений. Процесс крафта продуман до мелочей: нужно не только выбирать правильные ингредиенты, но и следить за качеством, чтобы получить максимально ценный товар.\n\nЭкономическая составляющая игры тоже не даёт заскучать. Вы постоянно ищете выгодные сделки, расширяете свой ассортимент и улучшаете магазин, чтобы привлечь больше клиентов. Особое удовольствие доставляет наблюдать, как ваш бизнес растёт, а ваш герой становится всё более известным и успешным.\n\nКонечно, как и во многих мобильных играх, здесь присутствуют элементы таймера и внутриигровые покупки, но они не портят общего впечатления. \"Shop Titans\" отлично подходит для тех, кто любит строить, развивать и управлять, предлагая достаточно глубины и разнообразия, чтобы увлечь надолго.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun, cozy take on the fantasy adventure. Why risk your life when you can hire others to do the hard work in exchange for selling off what they find to the local community?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is fun but I think after a few extra hours it always becomes the same thing to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ALWAYS THE BEST AND THE BEST!! BEEN PLAYING IT ON MOBILE AND PC, NEVER BORED OF IT!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and they keep improving the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, both on mobile and pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good calming game if you just want to relax.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game if u have some time to kill highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this since at least 2021. Absolutely love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice game to tend after work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty valid. Wish I could pay to win more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goog game for relax",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it's quite ok for a time waster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple cozy game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun mobile game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for players who doesnt work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool beans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Soup",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lovely",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "grindyyyy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "try this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will leave the cat here, so that everybody who passes by can pet it and give it a thumbs up and awards.\n　　　 　　／＞　　フ\n　　　 　　| 　_　 _ l\n　 　　 　／` ミ＿xノ\n　　 　 /　　　 　 |\n　　　 /　 ヽ　　 ﾉ\n　 　 │　　|　|　|\n　／￣|　　 |　|　|\n　| (￣ヽ＿_ヽ_)__)\n　＼二つ",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I will leave the cat here, so that everybody who passes by can pet it and give it a thumbs up and awards.\n　　　 　　／＞　　フ\n　　　 　　| 　_　 _ l\n　 　　 　／` ミ＿xノ\n　　 　 /　　　 　 |\n　　　 /　 ヽ　　 ﾉ\n　 　 │　　|　|　|\n　／￣|　　 |　|　|\n　| (￣ヽ＿_ヽ_)__)\n　＼二つ",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome game! Run and decorate your shop and gear up your heroes to go fight for loot! Only complaint is there are quite a bit of deals to spend money but you can get there as f2p and being patient",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I've found this game to be very enjoyable with a few caveats that I'll get to. It's not an idler but it can be played as an idle-adjacent kind of game, particularly as you get further into the game. That said, I do feel the game plays best as something you pick up for 30-60 minutes at a time and set aside for a bit. \r\n\r\nWhat I like about is the long term progression and cooperative nature of the game. Everyone invests together, guilds complete events together. Everyone is contributing in ways that help everyone out and I think it's fostered an absolutely terrific community on the official Discord. \r\n\r\nThis is exactly the sort of game that I was wanting, something that was multiplayer I could play with friends and had long-term goals but also not feel like I needed to be actively grinding for hours on end. Another thing I really appreciate about this game is that all the events and co-op is asynchronous. What I mean by that is a guild event might run for four days and everyone contributes, but everyone is contributing on their own schedule. Everyone doesn't have to be online at the same time like you might find on a MMO raid or things like that. You play solo, yet everything you are doing helps towards common goals. \r\n\r\nNow for the caveats:\r\n\r\nMy absolute biggest complaint about this game is mobile-like monetization. I feel like the game is constantly throwing things in my face to spend money on and it's obnoxious. It's particularly obnoxious because while there are absolutely things you can spend money on to create shortcuts or speed things up, the game is completely playable as a F2P player, things will just progress more slowly. As this is a game that already is a marathon and not a sprint I don't find that to be problematic, but the constant attempts to reach into my wallet are a bad look for the game, IMO.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "You should join a clan as soon as you start playing. Generally, it's the game with the fewest toxic players; most clans have a good atmosphere.\n\nIt's a really good game; there's always something to do.\n\nAlthough it's very slow at first, it becomes quite entertaining once you get the hang of it.\n\nYou can progress without spending money; there are no ads. Unfortunately, there are no regional pricing options, so buying things is very expensive.\n\nIt's a very chill game-as-a-service. I only buy the paid characters (around $25 a year), which don't make much of a difference to players who don't.\n\nThe worst part of the game is creating heroes for missions, but that's awful whether you pay real money or just in-game currency.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A lot of the creation options are locked behind a paywall. But for some chill gameplay and casual clicking while working on the computer? It’s pretty decent~",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "forge and sale your items, this basic all the in-game content you gonna had in this game, there no community which is kind of lame, you need to keeping track the items in game and there no auto finish feature the game would became really repetitive in later stage.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Its okay, although I think they definitely went a bit too far with some of these building prices... and the fact that some achievements are apparently paywalled behind 70$ worth of microtransactions...\r\n\r\nBut overall, its a pretty addictive management game, I'm certainly enjoying it!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "+ The core loop is incredibly addictive. Crafting, selling, and outfitting heroes is a lot of fun. It feels great to see your little shop grow from a wooden shack into a magnificent store.\n\n+ There's always something to do. With so many item blueprints to research and heroes to gear up, you'll never be bored.\n\n+ The art style is charming and full of personality.\n\n- However, the monetization is VERY aggressive. This is the biggest downside. You will hit a hard paywall eventually. Essential features like expanding your shop inventory or recovering lost items from failed quests are locked behind a premium currency or the Royal Merchant subscription.\n\n- The game can feel like a massive time-sink if you don't pay, with progress slowing to a crawl in the late game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I play this while I work. It works as a way to break monotony. Sometimes I take a long break cause it gets repetitive and monotonous but I get back to it when I run out of other games I can play while I work.\nI haven't spent a single cent on this game nor do I intend to. If you're a casual gamer looking for a game to run in the background while you work (second screen preferably) then this is the pick. \nNot a lot of things are behind paywall, or maybe there are- idk I've never checked or been invested enough to check.\nJust make orders, fulfil orders, gather items and hoard diamonds- and maybe somehow find a way to get rid of all the items I hoard in my inventory that takes up space.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun clicker game, join an active guild for best results",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great time killer... fillling orders/quests, making items sending troops out to fight, building your perfect shop...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun shopkeeper simulation in a lively town full of adventurer customers, manufacturers, raw materials suppliers, and the King.  Not to mention you, the shopkeeper and your guild of friendly competitors.  Very good and relaxing fun for a long time.  The graphics are charming and the spirit is light.  The game does have difficulty maintaining the ease of play as you scale up the quality of your merchandise.  No need to pay if you don't want, the extras you can pay for are not necessary to continuing the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's really fun, despite there's so many micro transaction inside the game, but so far i can assure you that u can enjoy this game for F2P, the key is to be chill and relax, the general event is kinda common and once u level up u can get the score high as u want it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been with the same guild playing this game for over 3 years. It's engaging with events, an easy pick and put down for awhile game, and has a decent slow growth with the levels. While I always want more, Shop Titans has become my favorite most played game daily just for being an easy stress free game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good for some chill gameplay and timepass.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun time waster, it always has an event to participate in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good free idle game that looks good and can be played on a potato PC. There is more things to take care of than seems at first sight. Half Tip: Utilizing more than just making everything you are gonna sell, cause it won't be enough. It took me many hours to finally find a way to not have almost always empty shelves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soulmate brought me here, and now I am hooked...!\n\nYes, it is P2P yada-yada-yada, but I play it casually on Android cause it is cross-platform.\n\nI have a guild that I am solo holding down the fort. Would manage a shop again~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play in the background while reading or watching TV. In the beginning you have to pay more attention but the further you progress the less attention you need to pay to your shop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jeu facile à entreprendre, bien expliqué tout du long, on ne voit pas le temps passer !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра \"Shop Titans\" — это увлекательный симулятор управления магазином, где вы можете почувствовать себя настоящим мастером-ремесленником. Здесь вы создаёте оружие, броню и различные предметы, которые затем продаёте искателям приключений. Процесс крафта продуман до мелочей: нужно не только выбирать правильные ингредиенты, но и следить за качеством, чтобы получить максимально ценный товар.\n\nЭкономическая составляющая игры тоже не даёт заскучать. Вы постоянно ищете выгодные сделки, расширяете свой ассортимент и улучшаете магазин, чтобы привлечь больше клиентов. Особое удовольствие доставляет наблюдать, как ваш бизнес растёт, а ваш герой становится всё более известным и успешным.\n\nКонечно, как и во многих мобильных играх, здесь присутствуют элементы таймера и внутриигровые покупки, но они не портят общего впечатления. \"Shop Titans\" отлично подходит для тех, кто любит строить, развивать и управлять, предлагая достаточно глубины и разнообразия, чтобы увлечь надолго.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't really like multiplayer games but I've been with Shop Titans for a long time, have been in 3 different Guilds, and they've all been pretty positive. If you don't want to join in on Chat, you don't have to. If you do, usually there's a handful of your Guild folks that show up, whether it's chatting or just talking about the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun, casual game. You can play for a for just a few minutes or for an hour or more in a sitting. Early on, you can play for long stretches of time. Definitely recommended for a casual game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deceptively deceiving, Shop Titans may seem overly simple in the beginning stages, but as you level the game opens up to a great mix of strategy and time management. Shop Titans can be playable many different ways as there is no 'right or wrong' way to do anything -just  relax and play it at your own pace. Leave your stress behind and just lean into it for a bit, I find it to be welcoming and very relaxing. It's easily my favorite game today even though it came out a few years ago and the only game that's currently able to keep my attention.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing the game for a long time even past what my steam account lets on (mobile gaming moment) and I've got very little short of complete praise for the game. I found it through mobile first, figured I'd give it a try and it turned out less predatory* than I expected. Saw it had a steam port, and here I am. To go about it quickly; you run a shop. You hire some heroes to get special materials for you, and meanwhile you use resources from your hired workers (leveled through your cumulative progress with your guildmates) to craft and sell items.\n\nThere's a decent bit of depth on most aspects; from what furnitures you put in the shop (which give you energy to immediately craft items + affect what you can sell), to what resource caps you'll have available and how you interact with customers (discount for less gold but more energy? or surcharge for more gold but a big dip in energy). There's constant rotating events to keep you on your toes, though they're the same 4 every month round and important to progress.\n\nGiven it's a free game, it has monetisation. That comes in the form of premium workers that offer unique recipes otherwise unavailable *to craft* without having the premium package required to unlock. Although premium gear and items tend to offer higher stats, you can always buy said items from the player market which has a softcap on how high or low you can price items, so no, you're not getting milked for your money in a p2w environment. There's no PvP besides high-end guilds competing for the first spot on a leaderboard in events, and for the most part it's a blend of a single and co-op multiplayer game.\n\nThe asterisk for the less predatory practices at the start is for here however. Every few days, packs get released and the game will gently nudge you to one- the pop-ups happen, but they are not intrusive. The game will definitely remind you that premium workers exist any time you try to help your guild with their buildings, and sadly as much as I want to support the game, it's on the pricier end. The workers are one time purchases ranging at the same price as the average AAA game's minor DLCs and that's one pretty penny too much for me, unless I've gone a few months in the game without buying anything.\n\nI really like the game. I think it's charming, it's definitely got a lot (too much almost lol) to sink your teeth into, and it's a chill experience. What it isn't is a power fantasy- you play a slow and chilled marathon with optional grinds, and you get out what you put in. You're free to judge the monetisation for what it is, but I do think it's relatively fair. There's complaints to be made about QoL changes that could be made (i.e. rolling heroes later on could be easier through automation rather than manually clicking the same 7 buttons for upwards of a few hundred attempts... ahem.), and those are valid. But the game is really good for a free to play, and especially for one that's fairly heavily monetised off the cuff.\n\nGive it a shot, but if you do definitely look some stuff up online. Resources are overall few, but they're really helpful for having the most fun as soon as possible. ^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "customer comes in and pets the cat filling up my energy bar. He walks over and selects some lv1 armour and brings it up to the counter. \r\nCustomer: My i have this leather armour for 90 gold? he asks innocently.\r\nShopkeeper: Naw you dont want that. -40 energy. you want this shiny eagle helm for 15000 gold. -200 energy. Make tht 30000 gold. \r\ncustomer visibly reacts shrugging and haveing a stroke but buys it anyway and leaves. \r\nThe next victim walks in....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "**Shop Titans** is less an \"ultimate RPG shopkeeper simulation\" and more a **glorified timer management simulator** draped in fantasy aesthetic. The core loop of crafting, selling at a **markup**, and sending heroes questing quickly devolves into an egregious **free-to-play grind**. Progression, which is already simple and repetitive, hits aggressive paywalls that demand real money to unlock essential crafting specialists and accelerate absurdly long cooldowns. While there's a charming visual layer and a theoretically deep guild system, the entire experience is relentlessly hampered by its mobile-game DNA, forcing you to check in constantly or pay to circumvent the **friction** deliberately engineered into the design. It's a shopkeeping game where the true titan you're serving is the **microtransaction economy**.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would like to take a moment to say how much i love a obviously pay to \"win\" game with a bunch of huge microtransaction.\n\nso i've been playing a bunch of shop titan lately ((i clocked in about a little over 100 on steam and same on my mobile device)), and over these 200 hours of gameplay, NOT ONCE ! have i been attacked by a advert.\nNo \"watch add to skip the wait\" ads, no forced ads, no \"watch this ad before you can play the game\" ad, nothing, i wouldn't be playing anymore if i did, the only thing that would be a equivalent that you could qualify as a \"ads\" is at the start of every 14ish day period, the game will stop you from what you're doing, to show you a little fellow shopkeeper that helped you in your journey entering your shop to offer you a \"exclusive\"  deal that is always the 6 same items, 2 exclusive blueprints, 2 accessories to barbie doll your character and 2...\"stuff\" ? to put in your shop to decorate it. THAT'S IT ! IT'S THE ONLY GAMEPLAY STOPPING INTERACTION THE GAME WILL FORCE ON YOU ! ONCE ! EVERY ! 2 WEEKS ! AND YOU CAN 100% SKIP IT AND IGNORE THE DEAL ! JUST SPAM CLICK ! ((the game ask confirmation before you purchase anything so no worry if you fat finger the buy button))\n\nI am about level 44 soon 45, which is not even the end of the early game yet ((from what i've seen of the screenshot of lv 100+ shops and i want to glaze this game for a bit.\nSo alright no ads, so whats the catch then ? well the catch are these. HUGELY PRICED MICRO STRANSACTION !!!\n\nthey have \n- a 10$/month subcription ((which is nothing but a pay for extra goodies type of subcription, the kind who are like \"here what you could have gotten if you had the subcription !\"))\n- timed deal who are never princed under 10 $\n- and \"micro\" dlc who are \"exclusive\" workers that have chunk of the games paywalled\n\nand yes these are the base price, sometime they can also show up in your shop to offer a discount to there \"liscence to hire\"\nother than that, that's it !\nyou can 100% ignore the pay to \"win\" aspect of the game\nand i put win in quotation because there is no winning !\nthere is no pvp other than a guild competition every now and then !!!\nthere is a score board but nobody give a shit about it\nit's just a chill game about building the perfect little adventurer's shop\nnothing more to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for casuals, fun market mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A surprisingly engaging crafting and shop management game. Progression feels rewarding, with plenty of goals to pursue. While there is some waiting involved, it's perfect for short play sessions and slowly building up your empire. Highly recommend for casual players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its alright i guess.. I mean ive played a little and it is what is you know? Ive delved into it just a tad.. yeah... i mean.. yeah..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best phone game I have ever played. There is no play to win cause there is no winning. And if someone does put money into the game, its only a net positive for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shop Titans is an engaging shop management sim where you craft and sell items to heroes. You hire craftsmen, manage resources, and expand your shop while fulfilling orders and investing in the city.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you can play free with content to help you improve faster if you buy but it isn't necessary to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a bit pay to win but you can still play F2P, if you have money get royal merchant VIP it's good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean what more can you ask for. Its a great time killer and if you need something to do in the background and feel accomplished about, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun, cozy take on the fantasy adventure. Why risk your life when you can hire others to do the hard work in exchange for selling off what they find to the local community?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is cool for chila, you craft, sell, upgrade heroes, dress them up, go through events with gi (you still need to try to pass them), choose your own path of development (crafting, adventure, trade).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better chill games for Mobile and Steam cross play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like how there is a guild u can join and those guild members can help you with making your items upgrade shorter amount of time, i find it kinda hard to collect gold since u use them for buying and stuff is pretty expensive especially the storage chests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a type of game to pass the time an have some fun if your into like clash of clans etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is fun but I think after a few extra hours it always becomes the same thing to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ALWAYS THE BEST AND THE BEST!! BEEN PLAYING IT ON MOBILE AND PC, NEVER BORED OF IT!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and they keep improving the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have been playing this game sunce it 1st came out it was bad but they have improved greatly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great time waster, but don't spend money on it. It's not worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "need to focus, but still can play it while working so this is good.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Recommended if you get trapped in a dark room for 20 minutes with nothing but a PC with this installed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, both on mobile and pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was more engaging than the past. The new updates are good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was fun until the game glitched & I can't sell to the customers or heroes that come into the store. I even tried a uninstall/reinstall including emailing the mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game is a great way to relax and just watch numbers and stats go up. plently different ways to play the game form selling in your shop or the market place to other players to only crafting to make your heroes stronger so much more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🏪 Shop Titans – A Fun Grind Held Hostage by Monetization (5/10)\n\nShop Titans is the definition of a love–hate relationship. The core concept is great — running your own fantasy shop, managing heroes, crafting gear, sending adventurers out, and watching the gold stack up. It’s the perfect game to have running while working or chilling. A solid time-killer with addictive loops.\n\nBut… the monetization hits hard.\nSo many systems scream pay-to-play — from the royal pass to specific traders. Skip the premium perks and you lose around 50% of your rewards, making progression slow and frustrating. It constantly reminds you that your wallet could make things smoother.\n\nThere is fun here, especially if you enjoy background gaming and slow steady progress — but the aggressive gating keeps it from being as enjoyable as it could be.\n\n💰 Verdict: 5/10 — Great as a side-game and has a ton of charm, but the monetization drags the experience down. If the devs ease up on the paywalls, this could become genuinely fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game for a few years now and it's had superior quality in design and rendering compared to almost every mobile game I've played and a few of the similar-styled games out there. For comparison, the dialogue scenes are animated here, whereas most (EG Marvel STRIKE Force) still use static images for character dialogue.\r\n\r\nThe rotation for the town map and screen rotation for either landscape or portrait modes are also great additions that should be available in more games but have been conspicuously absent, so I've really enjoyed having those here.\r\n\r\nAside from the great design for characters and gear, the character cutomizations are fantastic and the 3D rendering of not just gear but crafting reagents has continued to impress me. You don't normally see the models for crafting reagents, since they only seem to be used when opening treasure chests, but the detail in their design is unparalleled for background items, even in more \"serious\" gaming. It's all really enriched beyond what I ever expected for a mobile game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game lots of stuff to craft",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great tablet game. Glad it was brought to PC as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like Shop Titans.  It is about building up your characters with equipment and weapons to succeed in quests.  I would recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best FREE games out there. There are some paid add-ons that makes the game play experience better, but it is not Pay to Win. The game is fun and interesting. You create shop items and sell them in shop or in a live market for gold or gems. You build these shop items using components and resources. Resources build up naturally with time while components are acquired by sending out heroes and champions. There is a chance the item that is crafted is of a different rarity. The higher the rarity the better it sells in the market, or the rare items can be given to heroes to buff their stats. Anyways it is a great game!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "A massive amount of basic content is locked behind paywalls that costs over double more than any AAA game out there. Maybe even triple the amount. And even more if you want all the perks with monthly/yearly subscription. This is cancer and the source of all evil in this world. Greed. And it's such a shame as it would be an amazing game otherwise. Don't bother with this one.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Game is good but the publisher is so greedy, a bunch of stuff are lock behind a paywall.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I have a bug that prevents me from playing on my account on Mobile Devices and other devices than Steam.\nI contacted the support team about 5 times, i contacted 2 different discord mods and i have been waiting since the 20th of September for a fix.\n\nI have 434.2 hours as time of review, and i would like to keep playing the game and use the webshop.\n\nBut as of now,  i can't recommand this game if the support team is that slow with helping for a bugfix.\n\nI might keep playing, but i will not spend any money since im not sure if i can access my account in the future on other devices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is ok but they tend to give you things you can never use they just sit there collecting dust and its mostly a P2P game, other than that its a ok game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know, I know ...the played time says somethingelse but keep in mind after a certain point this is more a \"afk-game\" because crafting takes 1-3 hours. \n\nNevertheless a massive amount of basic content is locked behind paywalls, without premium monthly , ingamepass, premium worker, premium receipts you miss a lot of content and it does not make fun . \n\nAlso they increased the intervals of events, this game feels like a fulltime job now. 3 events in the same time which require different strengths.. No problem for the jobless with money :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seemed fun at first but it's a massive cash grab every second behind every action.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i had a high level account for a while and havent played for a good while. I loaded in the game and i had to start from the beginning for some reason. All the microtransactions ive made are gone. dont play this game, its play to win.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "surprisingly addictive ;-;",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "12 hour unskippable gay sex cutscene",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A massive amount of basic content is locked behind paywalls that costs over double more than any AAA game out there. Maybe even triple the amount. And even more if you want all the perks with monthly/yearly subscription. This is cancer and the source of all evil in this world. Greed. And it's such a shame as it would be an amazing game otherwise. Don't bother with this one.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Hey you want x? 20$ please. No thanks ill just level up some more.. HEYYYYY I HEARD OUR LAST 20$ WORKER WASENT GOOD ENOUGH HERES ANOTHER!... uhh no thanks.. i dont think 20$ to unlock a worker that gives me 3 things is worth it.. ill pass. 5/6 more workers being shoved in my face later.. wow yippee im definitly going to drop 120$ on a mobile styled game for basically nothing...",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Game is good but the publisher is so greedy, a bunch of stuff are lock behind a paywall.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This is a mobile game first, and a PC game last. The game has a ton of problems, that the developers \"fix\" by offering to sell you a premium worker to mitigate the issue. \nYou can sit there multiple hours hiring and retiring until you get a hero who's first two skills(you also need a particular skill in the questing tree to even see the first two skills, otherwise you have to level them up). You have to then level them up to find out their 3rd and possibly 4th skill and fire them if the skill isn't very good. The developers then \"fixed\" the issue by adding a worker that people can buy which lets you replace one skill per hero with any skill they want. I doubt that fixes the issue, it'll mitigate it.\n\nAnother massive issue that I have with the game is how slow selling items is. Customers do not enter your shop while the game is off, nor do they enter your shop when you're in the city view to invest into the city, interact with the market, or anything else in there. The developers again mitigated this issue by making it so that when you ARE able to have the game open long enough for customers to enter your shop by adding a premium worker that you have to buy which speeds up their walking speed for 15 minutes or something. Selling items was so slow that I put my pets away in storage because I didn't want customers to take the extra time to go and pet my pet for a measily 60 energy(when my energy was empty, I got 800-900 energy from each successful small talk, and somewhere in the ballpark of 1000 when I discounted the item).\n\nI also have a massive issue with how much energy higher tiers cost to surcharge. I was in the bartering tree so I had more max energy than normal, Had 74 furniture that I got energy from, 72 of which were level 15+(levelling them up above level 15 costs a currency that you only get more of once a month, and I'd run out of them after a week or two). As a result I had over 9000 energy and there were still some items that I couldn't surcharge because I didn't own the premium worker for them. As a result I couldn't ascend them to reduce their surcharge cost, and I couldn't go into their research tree to reduce their surcharge cost either.\n\nThe developers take far too long to patch issues. A guild member of mine eventually quit the game because for months he couldn't see how much an item he relied on selling on the market was worth there before they finally patched it. The developers give very little information within the game so I had to rely on third-party tools to do things like recruit people, as the devs don't tell you within the game when they first started playing, what there record contribution on an event is, or anything.\n\nThe devs also banned me from their discord for expressing my sexuality in my profile picture, which plenty of other people in their discord already do and I was in there AND active for a year and a half before they did so.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I've been playing this games for around 5 years now. ( the hours don't reflect because I mostly play on mobile ) \n\nThis is your typical pay to win mobile game. HOWEVER. if you can look past that giant hurdle, the game is actually quite in depth. getting into an active guild makes the experience a bit more enjoyable, and easier. \n\nThis game is a grind to say the least. If you're going to start just know its going to take a few years to get where you want to be. The grind is why I cant recommend this game, even after playing it for this long. \n\n\npro tip; while playing on pc, have it run in the background, or on your 2nd monitor. hop back a fourth between whatever it is your'e doing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "****This will be updated regularly****\nNov 3/25\n\nSo WOW just WOW. So please be careful if you are planning to spend cash on the game. for instance in the \"special\" on the ghostbusters exclusive offer in the shop. It retails for $37.98 if you buy both things together. But if you look at the individual pack prices they are only $12.99/ pack. So I guess my question to Kabam is What do you think makes it worth the extra $11.00 if you get both at the same time? If you buy them at the same time you want 37.98. But if you buy them separately at $12.99 each that is 26.98. Please justify the $11.00 difference. Basically what I am getting at is that is not a 50% discount unless you get the packs separately. But then the combo pack should only be $26.98 NOT $37.98.\n\nOct 1/25\n\nI would not recommend this game for the simple fact that you have to pay to play or you do not get far in the game. You can only advance your characters in the city by spending the real cash for each one. They do go on sale but if not they are all over $15-$20 for each. This adds up after a short while. In fact, if you add all 33 characters up @ $15/ character it is almost $500USD. I am in Canada so tack on another 30%. Now don't get me wrong some go on sale but some not at all.\n\nThere are reasons people play free game is BECAUSE THEY ARE FREE. Please make the game free in all aspects/levels without having to pay to play and continue on. A good example of pay to play would be to have \"The Bard\" go on sale. I would never pay $25 for a character but he is needed to upgrade two items at one time. In the years I have played this game I have never seen him go on sale. All other characters just give you blueprints that you should be able to get just like the first ones when you start up the game.\n\nI get it the devs have to make a profit but make money with sugar not vinegar. Keep prices lower by a lot and maybe more will buy them. I have seriously debated getting the diamond special in game because I think it would be worth it. But the character upgrades are not worth it for 2 prints and diamonds.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game looks good, and for what it is, it's decent. The problem is that it is what it is -- a mobile-style game with a freemium and subscription-based progression system. Sure, you can play for hours and hours and eventually scrape together enough resources and have enough luck to unlock most things or maybe even everything, but unless you're intensely into the game mechanics, it'll be a slog.\n\nIf you like to play this kind of game *for fun* or you're one of the whales out there who actually have the money to spend on games like these, I'm sure you'll have a great time. For the rest of us? I can't recommend a game like this except when you're on your mobile phone in a waiting room needing to get a few minutes to pass just a little faster and you have nothing better to do.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have a bug that prevents me from playing on my account on Mobile Devices and other devices than Steam.\nI contacted the support team about 5 times, i contacted 2 different discord mods and i have been waiting since the 20th of September for a fix.\n\nI have 434.2 hours as time of review, and i would like to keep playing the game and use the webshop.\n\nBut as of now,  i can't recommand this game if the support team is that slow with helping for a bugfix.\n\nI might keep playing, but i will not spend any money since im not sure if i can access my account in the future on other devices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is ok but they tend to give you things you can never use they just sit there collecting dust and its mostly a P2P game, other than that its a ok game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like the game. its fund to have it run in background. get some trades here and there send champions on missions. build some stuff with the materials. but the fact about 50% of the crafts man are paywalled and the constant buy me now spam shit gets so annoying. just give the ppl a way to earn them otherwise. you have gems ... they are a paid currency... make them like 3-5k gems to have something to work for and ull have a positive review other ppl paid for the gems ull get with the market anway.... but for now its just a boring ass ragebait to see them daily especially for the pricepoint ... just awefull",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam should punish games like this that dont regularly fix the bugs and other issues in this game that make the game unplayable for some",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I know, I know ...the played time says somethingelse but keep in mind after a certain point this is more a \"afk-game\" because crafting takes 1-3 hours. \n\nNevertheless a massive amount of basic content is locked behind paywalls, without premium monthly , ingamepass, premium worker, premium receipts you miss a lot of content and it does not make fun . \n\nAlso they increased the intervals of events, this game feels like a fulltime job now. 3 events in the same time which require different strengths.. No problem for the jobless with money :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever, after spending over 1k on in-game purchases, they banned you for using ingame trade market because you made too many trades.....and expel you from ranking system.... what a scam， was insane！",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2] No money no fun [/h2]\n\nNo passport, no money, workers, you need much longer,\nEvery time only offers come. \n\nThat's why I don't play it anymore...is bad",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "if you wish to unlock all the crafting trees you have to buy the premium workers and it's 178$ for all of them and they also provide passives that to my understanding were issues supposed to be fixed but instead got workarounds in these workers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seemed fun at first but it's a massive cash grab every second behind every action.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I take back my last review, the desyncs make it unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There are 2 bugs I have experienced; Tower of Titan Bug, when I collect them It didn't response and later black out, and I can't purchase Opulent Chest both gold and gem, also you could say the others have experienced bug related issues too, and if these severe bug issues aren't fixed then I won't change my opinion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so many in game purchase pushing mechanics",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i had a high level account for a while and havent played for a good while. I loaded in the game and i had to start from the beginning for some reason. All the microtransactions ive made are gone. dont play this game, its play to win.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crafting without donation takes too long.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Just a mobile game on PC, lol.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "surprisingly addictive ;-;",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am not a robot but these morons keep trying to make me prove i'm not, rude as hell.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "12 hour unskippable gay sex cutscene",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A massive amount of basic content is locked behind paywalls that costs over double more than any AAA game out there. Maybe even triple the amount. And even more if you want all the perks with monthly/yearly subscription. This is cancer and the source of all evil in this world. Greed. And it's such a shame as it would be an amazing game otherwise. Don't bother with this one.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Hey you want x? 20$ please. No thanks ill just level up some more.. HEYYYYY I HEARD OUR LAST 20$ WORKER WASENT GOOD ENOUGH HERES ANOTHER!... uhh no thanks.. i dont think 20$ to unlock a worker that gives me 3 things is worth it.. ill pass. 5/6 more workers being shoved in my face later.. wow yippee im definitly going to drop 120$ on a mobile styled game for basically nothing...",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Game is good but the publisher is so greedy, a bunch of stuff are lock behind a paywall.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This is a mobile game first, and a PC game last. The game has a ton of problems, that the developers \"fix\" by offering to sell you a premium worker to mitigate the issue. \nYou can sit there multiple hours hiring and retiring until you get a hero who's first two skills(you also need a particular skill in the questing tree to even see the first two skills, otherwise you have to level them up). You have to then level them up to find out their 3rd and possibly 4th skill and fire them if the skill isn't very good. The developers then \"fixed\" the issue by adding a worker that people can buy which lets you replace one skill per hero with any skill they want. I doubt that fixes the issue, it'll mitigate it.\n\nAnother massive issue that I have with the game is how slow selling items is. Customers do not enter your shop while the game is off, nor do they enter your shop when you're in the city view to invest into the city, interact with the market, or anything else in there. The developers again mitigated this issue by making it so that when you ARE able to have the game open long enough for customers to enter your shop by adding a premium worker that you have to buy which speeds up their walking speed for 15 minutes or something. Selling items was so slow that I put my pets away in storage because I didn't want customers to take the extra time to go and pet my pet for a measily 60 energy(when my energy was empty, I got 800-900 energy from each successful small talk, and somewhere in the ballpark of 1000 when I discounted the item).\n\nI also have a massive issue with how much energy higher tiers cost to surcharge. I was in the bartering tree so I had more max energy than normal, Had 74 furniture that I got energy from, 72 of which were level 15+(levelling them up above level 15 costs a currency that you only get more of once a month, and I'd run out of them after a week or two). As a result I had over 9000 energy and there were still some items that I couldn't surcharge because I didn't own the premium worker for them. As a result I couldn't ascend them to reduce their surcharge cost, and I couldn't go into their research tree to reduce their surcharge cost either.\n\nThe developers take far too long to patch issues. A guild member of mine eventually quit the game because for months he couldn't see how much an item he relied on selling on the market was worth there before they finally patched it. The developers give very little information within the game so I had to rely on third-party tools to do things like recruit people, as the devs don't tell you within the game when they first started playing, what there record contribution on an event is, or anything.\n\nThe devs also banned me from their discord for expressing my sexuality in my profile picture, which plenty of other people in their discord already do and I was in there AND active for a year and a half before they did so.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I've been playing this games for around 5 years now. ( the hours don't reflect because I mostly play on mobile ) \n\nThis is your typical pay to win mobile game. HOWEVER. if you can look past that giant hurdle, the game is actually quite in depth. getting into an active guild makes the experience a bit more enjoyable, and easier. \n\nThis game is a grind to say the least. If you're going to start just know its going to take a few years to get where you want to be. The grind is why I cant recommend this game, even after playing it for this long. \n\n\npro tip; while playing on pc, have it run in the background, or on your 2nd monitor. hop back a fourth between whatever it is your'e doing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "****This will be updated regularly****\nNov 3/25\n\nSo WOW just WOW. So please be careful if you are planning to spend cash on the game. for instance in the \"special\" on the ghostbusters exclusive offer in the shop. It retails for $37.98 if you buy both things together. But if you look at the individual pack prices they are only $12.99/ pack. So I guess my question to Kabam is What do you think makes it worth the extra $11.00 if you get both at the same time? If you buy them at the same time you want 37.98. But if you buy them separately at $12.99 each that is 26.98. Please justify the $11.00 difference. Basically what I am getting at is that is not a 50% discount unless you get the packs separately. But then the combo pack should only be $26.98 NOT $37.98.\n\nOct 1/25\n\nI would not recommend this game for the simple fact that you have to pay to play or you do not get far in the game. You can only advance your characters in the city by spending the real cash for each one. They do go on sale but if not they are all over $15-$20 for each. This adds up after a short while. In fact, if you add all 33 characters up @ $15/ character it is almost $500USD. I am in Canada so tack on another 30%. Now don't get me wrong some go on sale but some not at all.\n\nThere are reasons people play free game is BECAUSE THEY ARE FREE. Please make the game free in all aspects/levels without having to pay to play and continue on. A good example of pay to play would be to have \"The Bard\" go on sale. I would never pay $25 for a character but he is needed to upgrade two items at one time. In the years I have played this game I have never seen him go on sale. All other characters just give you blueprints that you should be able to get just like the first ones when you start up the game.\n\nI get it the devs have to make a profit but make money with sugar not vinegar. Keep prices lower by a lot and maybe more will buy them. I have seriously debated getting the diamond special in game because I think it would be worth it. But the character upgrades are not worth it for 2 prints and diamonds.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game looks good, and for what it is, it's decent. The problem is that it is what it is -- a mobile-style game with a freemium and subscription-based progression system. Sure, you can play for hours and hours and eventually scrape together enough resources and have enough luck to unlock most things or maybe even everything, but unless you're intensely into the game mechanics, it'll be a slog.\n\nIf you like to play this kind of game *for fun* or you're one of the whales out there who actually have the money to spend on games like these, I'm sure you'll have a great time. For the rest of us? I can't recommend a game like this except when you're on your mobile phone in a waiting room needing to get a few minutes to pass just a little faster and you have nothing better to do.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have a bug that prevents me from playing on my account on Mobile Devices and other devices than Steam.\nI contacted the support team about 5 times, i contacted 2 different discord mods and i have been waiting since the 20th of September for a fix.\n\nI have 434.2 hours as time of review, and i would like to keep playing the game and use the webshop.\n\nBut as of now,  i can't recommand this game if the support team is that slow with helping for a bugfix.\n\nI might keep playing, but i will not spend any money since im not sure if i can access my account in the future on other devices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is ok but they tend to give you things you can never use they just sit there collecting dust and its mostly a P2P game, other than that its a ok game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like the game. its fund to have it run in background. get some trades here and there send champions on missions. build some stuff with the materials. but the fact about 50% of the crafts man are paywalled and the constant buy me now spam shit gets so annoying. just give the ppl a way to earn them otherwise. you have gems ... they are a paid currency... make them like 3-5k gems to have something to work for and ull have a positive review other ppl paid for the gems ull get with the market anway.... but for now its just a boring ass ragebait to see them daily especially for the pricepoint ... just awefull",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam should punish games like this that dont regularly fix the bugs and other issues in this game that make the game unplayable for some",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I know, I know ...the played time says somethingelse but keep in mind after a certain point this is more a \"afk-game\" because crafting takes 1-3 hours. \n\nNevertheless a massive amount of basic content is locked behind paywalls, without premium monthly , ingamepass, premium worker, premium receipts you miss a lot of content and it does not make fun . \n\nAlso they increased the intervals of events, this game feels like a fulltime job now. 3 events in the same time which require different strengths.. No problem for the jobless with money :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever, after spending over 1k on in-game purchases, they banned you for using ingame trade market because you made too many trades.....and expel you from ranking system.... what a scam， was insane！",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2] No money no fun [/h2]\n\nNo passport, no money, workers, you need much longer,\nEvery time only offers come. \n\nThat's why I don't play it anymore...is bad",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "if you wish to unlock all the crafting trees you have to buy the premium workers and it's 178$ for all of them and they also provide passives that to my understanding were issues supposed to be fixed but instead got workarounds in these workers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seemed fun at first but it's a massive cash grab every second behind every action.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I take back my last review, the desyncs make it unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There are 2 bugs I have experienced; Tower of Titan Bug, when I collect them It didn't response and later black out, and I can't purchase Opulent Chest both gold and gem, also you could say the others have experienced bug related issues too, and if these severe bug issues aren't fixed then I won't change my opinion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so many in game purchase pushing mechanics",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i had a high level account for a while and havent played for a good while. I loaded in the game and i had to start from the beginning for some reason. All the microtransactions ive made are gone. dont play this game, its play to win.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crafting without donation takes too long.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Just a mobile game on PC, lol.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "surprisingly addictive ;-;",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am not a robot but these morons keep trying to make me prove i'm not, rude as hell.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "12 hour unskippable gay sex cutscene",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A massive amount of basic content is locked behind paywalls that costs over double more than any AAA game out there. Maybe even triple the amount. And even more if you want all the perks with monthly/yearly subscription. This is cancer and the source of all evil in this world. Greed. And it's such a shame as it would be an amazing game otherwise. Don't bother with this one.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Hey you want x? 20$ please. No thanks ill just level up some more.. HEYYYYY I HEARD OUR LAST 20$ WORKER WASENT GOOD ENOUGH HERES ANOTHER!... uhh no thanks.. i dont think 20$ to unlock a worker that gives me 3 things is worth it.. ill pass. 5/6 more workers being shoved in my face later.. wow yippee im definitly going to drop 120$ on a mobile styled game for basically nothing...",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Game is good but the publisher is so greedy, a bunch of stuff are lock behind a paywall.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This is a mobile game first, and a PC game last. The game has a ton of problems, that the developers \"fix\" by offering to sell you a premium worker to mitigate the issue. \nYou can sit there multiple hours hiring and retiring until you get a hero who's first two skills(you also need a particular skill in the questing tree to even see the first two skills, otherwise you have to level them up). You have to then level them up to find out their 3rd and possibly 4th skill and fire them if the skill isn't very good. The developers then \"fixed\" the issue by adding a worker that people can buy which lets you replace one skill per hero with any skill they want. I doubt that fixes the issue, it'll mitigate it.\n\nAnother massive issue that I have with the game is how slow selling items is. Customers do not enter your shop while the game is off, nor do they enter your shop when you're in the city view to invest into the city, interact with the market, or anything else in there. The developers again mitigated this issue by making it so that when you ARE able to have the game open long enough for customers to enter your shop by adding a premium worker that you have to buy which speeds up their walking speed for 15 minutes or something. Selling items was so slow that I put my pets away in storage because I didn't want customers to take the extra time to go and pet my pet for a measily 60 energy(when my energy was empty, I got 800-900 energy from each successful small talk, and somewhere in the ballpark of 1000 when I discounted the item).\n\nI also have a massive issue with how much energy higher tiers cost to surcharge. I was in the bartering tree so I had more max energy than normal, Had 74 furniture that I got energy from, 72 of which were level 15+(levelling them up above level 15 costs a currency that you only get more of once a month, and I'd run out of them after a week or two). As a result I had over 9000 energy and there were still some items that I couldn't surcharge because I didn't own the premium worker for them. As a result I couldn't ascend them to reduce their surcharge cost, and I couldn't go into their research tree to reduce their surcharge cost either.\n\nThe developers take far too long to patch issues. A guild member of mine eventually quit the game because for months he couldn't see how much an item he relied on selling on the market was worth there before they finally patched it. The developers give very little information within the game so I had to rely on third-party tools to do things like recruit people, as the devs don't tell you within the game when they first started playing, what there record contribution on an event is, or anything.\n\nThe devs also banned me from their discord for expressing my sexuality in my profile picture, which plenty of other people in their discord already do and I was in there AND active for a year and a half before they did so.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I've been playing this games for around 5 years now. ( the hours don't reflect because I mostly play on mobile ) \n\nThis is your typical pay to win mobile game. HOWEVER. if you can look past that giant hurdle, the game is actually quite in depth. getting into an active guild makes the experience a bit more enjoyable, and easier. \n\nThis game is a grind to say the least. If you're going to start just know its going to take a few years to get where you want to be. The grind is why I cant recommend this game, even after playing it for this long. \n\n\npro tip; while playing on pc, have it run in the background, or on your 2nd monitor. hop back a fourth between whatever it is your'e doing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "****This will be updated regularly****\nNov 3/25\n\nSo WOW just WOW. So please be careful if you are planning to spend cash on the game. for instance in the \"special\" on the ghostbusters exclusive offer in the shop. It retails for $37.98 if you buy both things together. But if you look at the individual pack prices they are only $12.99/ pack. So I guess my question to Kabam is What do you think makes it worth the extra $11.00 if you get both at the same time? If you buy them at the same time you want 37.98. But if you buy them separately at $12.99 each that is 26.98. Please justify the $11.00 difference. Basically what I am getting at is that is not a 50% discount unless you get the packs separately. But then the combo pack should only be $26.98 NOT $37.98.\n\nOct 1/25\n\nI would not recommend this game for the simple fact that you have to pay to play or you do not get far in the game. You can only advance your characters in the city by spending the real cash for each one. They do go on sale but if not they are all over $15-$20 for each. This adds up after a short while. In fact, if you add all 33 characters up @ $15/ character it is almost $500USD. I am in Canada so tack on another 30%. Now don't get me wrong some go on sale but some not at all.\n\nThere are reasons people play free game is BECAUSE THEY ARE FREE. Please make the game free in all aspects/levels without having to pay to play and continue on. A good example of pay to play would be to have \"The Bard\" go on sale. I would never pay $25 for a character but he is needed to upgrade two items at one time. In the years I have played this game I have never seen him go on sale. All other characters just give you blueprints that you should be able to get just like the first ones when you start up the game.\n\nI get it the devs have to make a profit but make money with sugar not vinegar. Keep prices lower by a lot and maybe more will buy them. I have seriously debated getting the diamond special in game because I think it would be worth it. But the character upgrades are not worth it for 2 prints and diamonds.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game looks good, and for what it is, it's decent. The problem is that it is what it is -- a mobile-style game with a freemium and subscription-based progression system. Sure, you can play for hours and hours and eventually scrape together enough resources and have enough luck to unlock most things or maybe even everything, but unless you're intensely into the game mechanics, it'll be a slog.\n\nIf you like to play this kind of game *for fun* or you're one of the whales out there who actually have the money to spend on games like these, I'm sure you'll have a great time. For the rest of us? I can't recommend a game like this except when you're on your mobile phone in a waiting room needing to get a few minutes to pass just a little faster and you have nothing better to do.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have a bug that prevents me from playing on my account on Mobile Devices and other devices than Steam.\nI contacted the support team about 5 times, i contacted 2 different discord mods and i have been waiting since the 20th of September for a fix.\n\nI have 434.2 hours as time of review, and i would like to keep playing the game and use the webshop.\n\nBut as of now,  i can't recommand this game if the support team is that slow with helping for a bugfix.\n\nI might keep playing, but i will not spend any money since im not sure if i can access my account in the future on other devices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is ok but they tend to give you things you can never use they just sit there collecting dust and its mostly a P2P game, other than that its a ok game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like the game. its fund to have it run in background. get some trades here and there send champions on missions. build some stuff with the materials. but the fact about 50% of the crafts man are paywalled and the constant buy me now spam shit gets so annoying. just give the ppl a way to earn them otherwise. you have gems ... they are a paid currency... make them like 3-5k gems to have something to work for and ull have a positive review other ppl paid for the gems ull get with the market anway.... but for now its just a boring ass ragebait to see them daily especially for the pricepoint ... just awefull",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam should punish games like this that dont regularly fix the bugs and other issues in this game that make the game unplayable for some",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I know, I know ...the played time says somethingelse but keep in mind after a certain point this is more a \"afk-game\" because crafting takes 1-3 hours. \n\nNevertheless a massive amount of basic content is locked behind paywalls, without premium monthly , ingamepass, premium worker, premium receipts you miss a lot of content and it does not make fun . \n\nAlso they increased the intervals of events, this game feels like a fulltime job now. 3 events in the same time which require different strengths.. No problem for the jobless with money :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever, after spending over 1k on in-game purchases, they banned you for using ingame trade market because you made too many trades.....and expel you from ranking system.... what a scam， was insane！",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2] No money no fun [/h2]\n\nNo passport, no money, workers, you need much longer,\nEvery time only offers come. \n\nThat's why I don't play it anymore...is bad",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "if you wish to unlock all the crafting trees you have to buy the premium workers and it's 178$ for all of them and they also provide passives that to my understanding were issues supposed to be fixed but instead got workarounds in these workers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seemed fun at first but it's a massive cash grab every second behind every action.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I take back my last review, the desyncs make it unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There are 2 bugs I have experienced; Tower of Titan Bug, when I collect them It didn't response and later black out, and I can't purchase Opulent Chest both gold and gem, also you could say the others have experienced bug related issues too, and if these severe bug issues aren't fixed then I won't change my opinion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so many in game purchase pushing mechanics",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i had a high level account for a while and havent played for a good while. I loaded in the game and i had to start from the beginning for some reason. All the microtransactions ive made are gone. dont play this game, its play to win.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crafting without donation takes too long.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Just a mobile game on PC, lol.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "surprisingly addictive ;-;",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am not a robot but these morons keep trying to make me prove i'm not, rude as hell.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "12 hour unskippable gay sex cutscene",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A massive amount of basic content is locked behind paywalls that costs over double more than any AAA game out there. Maybe even triple the amount. And even more if you want all the perks with monthly/yearly subscription. This is cancer and the source of all evil in this world. Greed. And it's such a shame as it would be an amazing game otherwise. Don't bother with this one.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Hey you want x? 20$ please. No thanks ill just level up some more.. HEYYYYY I HEARD OUR LAST 20$ WORKER WASENT GOOD ENOUGH HERES ANOTHER!... uhh no thanks.. i dont think 20$ to unlock a worker that gives me 3 things is worth it.. ill pass. 5/6 more workers being shoved in my face later.. wow yippee im definitly going to drop 120$ on a mobile styled game for basically nothing...",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Game is good but the publisher is so greedy, a bunch of stuff are lock behind a paywall.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This is a mobile game first, and a PC game last. The game has a ton of problems, that the developers \"fix\" by offering to sell you a premium worker to mitigate the issue. \nYou can sit there multiple hours hiring and retiring until you get a hero who's first two skills(you also need a particular skill in the questing tree to even see the first two skills, otherwise you have to level them up). You have to then level them up to find out their 3rd and possibly 4th skill and fire them if the skill isn't very good. The developers then \"fixed\" the issue by adding a worker that people can buy which lets you replace one skill per hero with any skill they want. I doubt that fixes the issue, it'll mitigate it.\n\nAnother massive issue that I have with the game is how slow selling items is. Customers do not enter your shop while the game is off, nor do they enter your shop when you're in the city view to invest into the city, interact with the market, or anything else in there. The developers again mitigated this issue by making it so that when you ARE able to have the game open long enough for customers to enter your shop by adding a premium worker that you have to buy which speeds up their walking speed for 15 minutes or something. Selling items was so slow that I put my pets away in storage because I didn't want customers to take the extra time to go and pet my pet for a measily 60 energy(when my energy was empty, I got 800-900 energy from each successful small talk, and somewhere in the ballpark of 1000 when I discounted the item).\n\nI also have a massive issue with how much energy higher tiers cost to surcharge. I was in the bartering tree so I had more max energy than normal, Had 74 furniture that I got energy from, 72 of which were level 15+(levelling them up above level 15 costs a currency that you only get more of once a month, and I'd run out of them after a week or two). As a result I had over 9000 energy and there were still some items that I couldn't surcharge because I didn't own the premium worker for them. As a result I couldn't ascend them to reduce their surcharge cost, and I couldn't go into their research tree to reduce their surcharge cost either.\n\nThe developers take far too long to patch issues. A guild member of mine eventually quit the game because for months he couldn't see how much an item he relied on selling on the market was worth there before they finally patched it. The developers give very little information within the game so I had to rely on third-party tools to do things like recruit people, as the devs don't tell you within the game when they first started playing, what there record contribution on an event is, or anything.\n\nThe devs also banned me from their discord for expressing my sexuality in my profile picture, which plenty of other people in their discord already do and I was in there AND active for a year and a half before they did so.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I've been playing this games for around 5 years now. ( the hours don't reflect because I mostly play on mobile ) \n\nThis is your typical pay to win mobile game. HOWEVER. if you can look past that giant hurdle, the game is actually quite in depth. getting into an active guild makes the experience a bit more enjoyable, and easier. \n\nThis game is a grind to say the least. If you're going to start just know its going to take a few years to get where you want to be. The grind is why I cant recommend this game, even after playing it for this long. \n\n\npro tip; while playing on pc, have it run in the background, or on your 2nd monitor. hop back a fourth between whatever it is your'e doing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "****This will be updated regularly****\nNov 3/25\n\nSo WOW just WOW. So please be careful if you are planning to spend cash on the game. for instance in the \"special\" on the ghostbusters exclusive offer in the shop. It retails for $37.98 if you buy both things together. But if you look at the individual pack prices they are only $12.99/ pack. So I guess my question to Kabam is What do you think makes it worth the extra $11.00 if you get both at the same time? If you buy them at the same time you want 37.98. But if you buy them separately at $12.99 each that is 26.98. Please justify the $11.00 difference. Basically what I am getting at is that is not a 50% discount unless you get the packs separately. But then the combo pack should only be $26.98 NOT $37.98.\n\nOct 1/25\n\nI would not recommend this game for the simple fact that you have to pay to play or you do not get far in the game. You can only advance your characters in the city by spending the real cash for each one. They do go on sale but if not they are all over $15-$20 for each. This adds up after a short while. In fact, if you add all 33 characters up @ $15/ character it is almost $500USD. I am in Canada so tack on another 30%. Now don't get me wrong some go on sale but some not at all.\n\nThere are reasons people play free game is BECAUSE THEY ARE FREE. Please make the game free in all aspects/levels without having to pay to play and continue on. A good example of pay to play would be to have \"The Bard\" go on sale. I would never pay $25 for a character but he is needed to upgrade two items at one time. In the years I have played this game I have never seen him go on sale. All other characters just give you blueprints that you should be able to get just like the first ones when you start up the game.\n\nI get it the devs have to make a profit but make money with sugar not vinegar. Keep prices lower by a lot and maybe more will buy them. I have seriously debated getting the diamond special in game because I think it would be worth it. But the character upgrades are not worth it for 2 prints and diamonds.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game looks good, and for what it is, it's decent. The problem is that it is what it is -- a mobile-style game with a freemium and subscription-based progression system. Sure, you can play for hours and hours and eventually scrape together enough resources and have enough luck to unlock most things or maybe even everything, but unless you're intensely into the game mechanics, it'll be a slog.\n\nIf you like to play this kind of game *for fun* or you're one of the whales out there who actually have the money to spend on games like these, I'm sure you'll have a great time. For the rest of us? I can't recommend a game like this except when you're on your mobile phone in a waiting room needing to get a few minutes to pass just a little faster and you have nothing better to do.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have a bug that prevents me from playing on my account on Mobile Devices and other devices than Steam.\nI contacted the support team about 5 times, i contacted 2 different discord mods and i have been waiting since the 20th of September for a fix.\n\nI have 434.2 hours as time of review, and i would like to keep playing the game and use the webshop.\n\nBut as of now,  i can't recommand this game if the support team is that slow with helping for a bugfix.\n\nI might keep playing, but i will not spend any money since im not sure if i can access my account in the future on other devices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is ok but they tend to give you things you can never use they just sit there collecting dust and its mostly a P2P game, other than that its a ok game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like the game. its fund to have it run in background. get some trades here and there send champions on missions. build some stuff with the materials. but the fact about 50% of the crafts man are paywalled and the constant buy me now spam shit gets so annoying. just give the ppl a way to earn them otherwise. you have gems ... they are a paid currency... make them like 3-5k gems to have something to work for and ull have a positive review other ppl paid for the gems ull get with the market anway.... but for now its just a boring ass ragebait to see them daily especially for the pricepoint ... just awefull",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam should punish games like this that dont regularly fix the bugs and other issues in this game that make the game unplayable for some",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I know, I know ...the played time says somethingelse but keep in mind after a certain point this is more a \"afk-game\" because crafting takes 1-3 hours. \n\nNevertheless a massive amount of basic content is locked behind paywalls, without premium monthly , ingamepass, premium worker, premium receipts you miss a lot of content and it does not make fun . \n\nAlso they increased the intervals of events, this game feels like a fulltime job now. 3 events in the same time which require different strengths.. No problem for the jobless with money :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever, after spending over 1k on in-game purchases, they banned you for using ingame trade market because you made too many trades.....and expel you from ranking system.... what a scam， was insane！",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2] No money no fun [/h2]\n\nNo passport, no money, workers, you need much longer,\nEvery time only offers come. \n\nThat's why I don't play it anymore...is bad",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "if you wish to unlock all the crafting trees you have to buy the premium workers and it's 178$ for all of them and they also provide passives that to my understanding were issues supposed to be fixed but instead got workarounds in these workers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seemed fun at first but it's a massive cash grab every second behind every action.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}