{
  "positive": [
    {
      "review": "This game quickly became one of my all-time favorites. The gameplay is fun, the gunplay feels solid, and the survival aspect is satisfying. Enemy variety is also surprisingly good for a zombie game.\r\n\r\nThe graphics are impressive, and the area where the game takes place is both beautiful and diverse.\r\n\r\nBut the true highlight for me is the characters and the story. The characters are incredibly well-written, they feel real, each with their own emotions, goals, and perspectives. The story, while a bit predictable at times, still delivers plenty of strong moments and plot twists. It’s honestly a shame we never got a sequel, because I genuinely want to see more of these characters. Such a great cast… and Deacon? He’s simply hot!\r\n\r\nHordes were super fun to take on, I’d be lying if I said I didn’t panic the first time I ran into one during my playthrough.\r\n\r\nThere’s also a good variety of extra game modes if you don’t feel like doing the campaign. Some of them can be quite challenging if you’re aiming for gold medals, but I had a great time with them.\r\n\r\nOverall, it’s an amazing experience and one I’d recommend to anyone who loves story-driven action games with heart.",
      "voted_up": true,
      "votes_helpful": 69
    },
    {
      "review": "My honest review about this game after 30h of gameplay with the story completed.\n\nIm not into story games, more into online games like cs or single player like fm. I bought a new pc and wanted to try some games. My brother recommended this game to me and i bought this and started playing. The first hours were a bit boring and repetitive but, the way u keep progressing makes u wanna play more and more and more, i found a few bugs but didnt change anything on the gameplay, only some freakers stuck on the ground or the bandits literally ignoring you. The story of this game is incredible. Loved every minute i spent on this story. i really recommend to buy this and dive into this splendid history, i big map for you to travel with ur bike, with some awesome views, i... i just loved this. From now on i want to only play story games cuz this game, trasmited a special message to me and you will understand the message once u finish the story.",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "Days Gone is a fun game with an excellent story about love, brotherhood, and survival. The controls feel surprisingly good on mouse and keyboard better than a controller, which is cool. Traversing the Oregon wilderness is satisfying, and the scenery is gorgeous. \n\nThe characters are grounded and believable, each with their own struggles that add to the emotional beats. Deacon is a relatable lead, and his bond with Boozer is the heart of the game. Customizing and upgrading your bike, earning trust with camps, and taking down hordes all feel rewarding. Combat is brutal in the best way, and gunplay feels tight. Towards the end, some activities can feel repetitive, but the story ramps up hard and delivers a memorable finish.\n\nDays Gone is an excellent game with some issues and repetitiveness, but an enjoyable fun ride \n\n9/10-Definitely recommend",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "The movement system is excellent, and I recommend buying and playing it. The game gives you ample time to explore and enjoy the visual effects. You can add some modifications if you want improvements such as graphics, clothing, and more\r\n. - Aiming: 100%\r\n - Gameplay: 100% \r\n- Crafting: 100% \r\n- Driving: 80% \r\n- Story: 99%\r\nI recommend buying it.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "The review might contain SPOILERS!\n\nI've recently finished the story mode. There are still some collectibles and hordes left to clear, so I think I can write an honest review.\n\nLet's start with the story. It was a bit complicated because, toward the end of the game, I still had no clue who the main villain was. The story often shifts between camp wars and a love story — and the love story was the last thing I would expect from a zombie game. The final conversation between Deacon and O'Brien was interesting, and it's a shame that there's still no progress on Days Gone 2. If they ever decide to make a sequel, it should focus on the Freakers.\n\nThe side quests were okay, but the encounters repeat themselves and aren’t very interesting. The most annoying thing is that you can't skip the dialogue during encounters.\n\nOverall, I liked the game. It's visually stunning and has an amazing environment. The combat is cool as well. I just wish they had focused more on the Freakers than on the war between survivors.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Incredible game, and especially its story and characters. I am so stunned by the true brotherhood between Boozer and Deacon.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Days Gone is easily one of the best games out there right now great story, awesome bike rides, and nonstop action. It just pulls you in and keeps you hooked the whole way through. peak 10/10",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Good game, well balanced. Good graphics, very good gameplay, controls are responsive and fast. I recommend it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An Example for a Survival - Open World Game. Days Gone does it pretty well, I am still in the earlier stages but I'm loving it",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Motorcycles, zombies AND a good story line? Yes, please! \n\nThis quickly became one of my favorite games - for multiple reasons:\n- I love motorcycles\n- I love zombie games\n- The combat seems well balanced \n- The hordes actually made my heart go crazy (the panic was real)\n- You can play your own way: go sneaky and take down enemies one by one, or go in guns blazing and plow everyone down.\n- The story is great and you build a connection with the characters along the way. \n\nI definitely recommend you check out this game :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Discovered this game after the disappointment of The Last of Us (mainly gameplay wise) and fell in love quickly! Story is pretty good as well. It reminds me a bit off of State of Decay and GTA combined.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely amazing game with potential to have sequel, but unfortunately......... 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, story and graphics are great. It really feels like an evolution of what The Last Of Us was. It takes the same general idea of a complex/emotional story and world in the setting of a zombie outbreak, but expands on it greatly, having a large world that's fully explore-able, as well as many different factions with different ideals and values and a much longer story. There's definitely some suspension of disbelief things where you need to play within the game rules. Not a ton of legs to stand on after you complete the main story, it's a lot of repeat missions without a ton of story, but that main story is around 35-40 hours long. There were 2 or 3 mission progression bugs I ran into which were frustrating, but loading an earlier save fixed it. Unfortunately it didn't do well in sales, so we probably won't see a Days Gone 2, but it's become one of my favourite Sony titles to date and is well worth the meager price you can get it for during sales.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just beat it tonight. This was such a good game, great story that made you sad it was over. Way better than I thought it was going to be. It's a Must play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game. Reminds me a little of the Last of Us, mixed with some Left for Dead moments when the zombie hordes attack. Overall, smooth game play and decent graphics.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I've ever played and very unique to its genre. It's a slow burn but very rewarding and the story is actually quite good. Hot take but almost glad this didn't get a sequel it would be hard to match the environment and storytelling while also being amazing at handling the horde dynamic which I found quite enoyable. 10 hordes/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Days Gone is a good game, but its still flawed. I think the main problem is that it  doesn't have enough reasons to explore, other than you need clear out another freaker nest, or any of the other rinse and repeat content. It could also use some more unique settlements, interesting side characters, and maybe some side activities such as poker or chess.  I know people might argue that the characters are in a survival situation, so they wouldn't waist time gambling or playing games, but even in the hardest of times people will still find ways to to let off steam.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Solid game abit buggy and frame'y at times, but a solid game ngl",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably best exclusive that came from Playstation, big open world that you can roam in on your bike (which is really great, the MC aspect was missing is games and I really enjoyed the story and gameplay around it - customising your bike...) and the open world is not just for show, not filled with pointless collectibles but great activities and quests. The story is solid, with some really epic and emotional moments. The hordes of freaks (zombies) are challenging to wipe out. First horde I defeated was 30 freaks and I thought that it was tough to kill them, but later in the game I was able to kill hordes of size 300 and more, which was a great challenge and really fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great zombie survival game. Upgrading your bike and getting access to new weaps by gaining trust, via missions, is fun. Played all the way through on hard and took me 66.6 hours. Just started a \"New Game+\" where you start over with everything you earned and amped up the difficulty.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mostly positive review it is a good game, but the cult following of this game gives it more credit than it deserves. Story wishes it was the last of it... graphics hold up in 2025 for the most part... However no matter what anyone says it the same mission every time just the enemy or who youre working for are dressed or shaped different. Does it deserve a part 2 yes, is it one of the best games ever made, not even top 5 in the post apocalypse category. those are my thoughts, it wishes it was in the same league as tlou(either game kills it stort wise regardless of your \"wokedar\") and open world wise its gta3 good, love the game its a blast to play but dont play it with the expectation youre playing a competitor to anything thats actually top tier open world or story telling. As I said great game mechanics are good story is ok, just dont expect what the days gone Stan's say 🤷🏼♂️",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First of all, for zombie fans looking for a Walking Dead game we never got, this is the game. Sure, the zombies are different and all that but no other game will get you as invested in its world and the people who inhabit it, even though the story is cheesy to a fault at times there's simply too much good here to ignore.\n\nAs with most PS ports I've tried I found the graphics to not only hold up but to be gorgeous and the acting is incredibly good.\n\nAll in all, instant classic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's pretty good gets a little boring after someone's arm gets injured goes of rippers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great zombie apocalypes survival game would recommend it to anyone who loves those types of games.\nStory, gameplay and graphics are very good and the hoards of zombies are insane. \n\nStart from nothing and bulid yourself up for better skills and equipment and upgrade ur motorcycle to better take on the hoards and other enemys,  salvaging to craft items is also a plus in this game.\n\n I give this a 9/10 rating and a must own",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is wicked fun, looks unreal in ultrawide and has a rlly good story.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I liked the graphics of this game i also want if they make a another one like the same",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "O jogo apresenta uma ótima jogabilidade e uma boa história, por mais que poderia ser melhor trabalhada em alguns pontos. Único ponto positivo é ainda não ter conhecimento de uma continuação.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already got the platinum trophy on PS5, but I got this one during the Summer Steam Sale to experience it again on my beefy new PC. This game absolutely deserves (and will sadly never get) a second game. If you're somehow on the fence, just don't think about it and get it. The game is phenomenal! When you know a second game isn't coming, you will be furious with the ending, but damn it's so good! Full price or on sale, it's so worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story to an even better game by itself its loads of fun and they have a very long story mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoying it a lot so far. Fighting hordes are the highlight for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most underated Playstaion exclusive game ive ever played, absolutely amazing graphics for its time, excellent story line, i never actually played this game on the PS4, i started playing when i got my PS5, it came out as a monthly freebie when i first got it, and it was spectacular in graphics and fun to play, recommended for anyone liking the post apocolyptic type games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a dope game with a good story, a little repetitive sometimes when it comes to missions but the story and awesome gameplay make up for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with good graphics and beautiful story line :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Changed from negative to positive:\nNegative - \nI had high hopes for this port after playing it literally on a PS4 a few years ago, after all the patches and updates. It rarely ever bugged out and I had nothing to complain about, and after I heard about the PC release I waited expecting some fixes being needed as most ports do. Even after all this time it seems that one of my favorite games is a sheer mess on PC. I had issues literally with random stutter on the startup of the game, and in intro mission Leon's body disappeared both in the cutscene and in game, alongside the zombies that were below. This is all in addition to sever continuous stuttering that makes the game unplayable; unfortunately this game seems to continue it's trend of un-optimization.\n\nPC Specs:\nProcessor: AMD 5900X\nGPU: AMD 7900XTX\nRAM: 32 GB\nStorage: Samsung 990 Pro NVMe 2TB\n\nI don't believe my PC is the issue, my drivers are up-to-date, and I have played many other more intensive games at 4K on very high/extreme settings with minimal issues; if there were ever any it wasn't anything that couldn't be fixed by some graphics optimization and/or verifying the integrity of the game files. This is not the case here, and to say I am severely disappointed is an understatement. I will not refund this game as I am still holding out hope that these issues get fixed and would like to support the studio, but as it is even with others being able to play the game normally (I can't tell what the ratio of playability is for players), I personally cannot recommend the game.\n\nFor what it's worth, I am aware of the beta branch option but I am not interested in it solely because I wanted to play this game with it graphical updates, etc. and take full advantage of my PC, which obviously isn't the case right now.\n\nEdit:\nPositive - \nI was able to resolve the stuttering issues, main issue was v-sync so I turned it off and will just deal with any screen tearing that occurs. I would have preferred to keep it on but it is what it is; I've got nearly 20 hours on so far and can say that there are still glitches and some game breaking issues with missions not progressing and having to restart the mission or the game for it to work, etc., but at least I can experience the game now. I will change the review to a positive one but will leave the negative portion up for awareness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So I’ve only played a bit of Days Gone so far, but honestly I’m really enjoying it. The first thing that hit me was the graphics, it looks so damn good. The world looks great and feels real, if you get immersed you can feel the air. The characters feel real, their dialogues feels natural, I love the dialogues between Deacon and Boozer.\n\nGameplay-wise, it feels amazing. I love the controls and movements, Deacon's movements feel smooth and real, overall very polished. I love the mix of stealth and action keeps things interesting, you can go from quietly sneaking through some abandoned place to suddenly getting absolutely swarmed.\n\nAlso love the details when riding a bike, you can see Deacon pulling the clutch and shifting the bike.\n\n9/10 - Absolutely Recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game with amazing storyline and even better gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of my all-time favorite games. Great Story. Great mechanics. Great mix of open-world & story-driven.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story, amazing characters, terrific game play, awesome bike rides, nonstop action and great ending. My first zombie game, achievements 100% done!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game brought out the gamer in me... I easily fell into the story and found myself invested in the outcome.  I started the campaign at moderate difficulty and binged the story-line because I had to know how it ended.  After completing the story-line, I started a new game on the highest difficulty available to test my skills.  I am currently playing a new game + on Survival ll with the goal of completing everything this game has to offer.  I am BURNING to see a sequel!  Broken Road was a smart move, but it has not completely satisfied... not by a long shot!  There is SO much more that could unfold.  Day's Gone made a true gamer out of me and left me freakishly hungry for more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Days Gone may not have the best graphics out there but it sure has what many others lack, pure fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the most underrated zombie games. First few hours are a slog but after that it gets much better. Worth a shot considering how cheap you can get it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game ticks all the right boxes. Good story, great characters you get invested in and the gameplay and hoard aspect is very fun to play. Progression is perfect as initially one of two enemies feel intimidating but by the end you a mowing down thousands. Sony needs to get back to making games like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game.  I read that it had a bad reception overall which caused the makers to scrap a sequel.   The only complaint I saw was that there were repetitive missions.  Well, it's no different than AC or FC games in that respect.  It has awesome graphics.  I had to keep my turbo fan on my laptop to keep it going, but there were no graphic problems.  The story is awesome.  The voice over is awesome.  Has great music.  It's long like an AC title.  If you like The Walking Dead and Assassin's Creed games, you'll dig it just fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything in a zombie game I love and that makes them great to play. Story is entertaining and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played. It's raw, hard and sometimes unforgiving, but always exciting. It has a bunch of great characters, good guys and bad guys alike. The facial expressions, especially during cutscenes, are excellent and the same can be said for the voice acting. The landscapes and the changing weather conditions are truly amazing. And the first time you cross paths with a horde... oh, my goodness... it's the stuff of nightmares.\r\n\r\nBut regardless of how much I like the game, I do have some (mild) criticism as well.\r\n\r\nOverlapping conversations is one of them. Sometimes people talk over each other and that makes it hard to follow, even with subtitles on. Your main character, Deacon St. John, has a habit of doing this.\r\n\r\nStories from missions that update throughout your playthrough is another one. You'll get notifications when they update and I'd love to read it all, but they usually pop up at inconvenient times.  Who's going to pause the game to read them while you're in the middle of a gunfight? That just takes you out of the action. So that's badly done. Also, stories aren't always in chronological order. Some current events are logged behind past events, so if you decide to read everything later, it can get a bit confusing.\r\n\r\nThere's no way to turn off hints. They're welcome when you first start playing the game, but they still appear when you start a New Game Plus and by that time, you really don't need them anymore.\r\n\r\nLast but certainly not least, there's too much swearing in this game. I get it, Deacon St. John is a rough biker guy who's been through a lot, but I still don't appreciate it. Yes, I don't always control my emotions either and use bad language too, but no matter how you spin it, it's aggressive and unattractive. If people are constantly swearing in real life, I don't associate with them. I like my video game hero to have some manners. Bad language is a trend in modern day video games that needs to die.\r\n\r\nOther than that, to conclude it on a positive note, I had loads of fun playing, upgrading my skills and my motorcycle and taking out threats in various ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It took an army of people to make this game and you can tell.\r\nThe story line is relatable, engaging, and the ending made it all worth the effort.\r\nSimply put, this one's a masterpiece and proved worthy of my time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, story dips in the middle and missions get repetitive but remains a fun game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fix ur goddamn game, adaptive trigger and haptic feedback only work when the controller is wired on pc is an unfortunate limitation that reduces convenience for player",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had this game pre-ordered and watched the countdown as it became available. Loved it then and still love it now. First game I played on my steam deck and just fell back into it so easily def top 5 favs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10 probably the most fun I've had with a third person sandbox game in a long time (Certainly better than the crap Ubi are churning out with a bigger number before the name) though with a little bit of jank.\nUsual suspension of disbelief required for a post apoc game, because after 2 years the power infrastructure would totally still be working and you'd find fuel at gas stations...\nAnd the less said about Decon's magic ranger tracking ability the better, but this all enables game play.\n\nThere are 3 minor but persistent irritations/design over sights this game has revolving around the unique selling point of the bike.\nAnd one HUGE irritation relating to an otherwise decent story.\n\nFor the bike, in order of least to most irritating.\nYou fast travel on the bike, so why the hell do you arrive standing next to it?\nMaking me waste time to getting back on it.\n\nBeing able to sabotage other bikes is cool, but totally useless.\nI'd rather Deacon knew how to siphon their tank instead, because your bike is hellah thirsty.\n\nThe bike headlights...chances are if I've turned them off, I don't want them back on until I turn them on.\nNot every god damn time I get on the bike, especially when trying to sneak off at night.\n\nAnd the big one, it's all about character writing.\nI get it, the story you are trying to tell is that it's likely the tough fringe folk who are better suited to survive the end of the world and you want to write a game about bikers.\nAnd they don't tend to be the greatest of folks or the nicest, but Deacon is an award winning study on how to write an unlikeable character.\nHe is constantly whining and complaining, is totally self centred, petulant and arrogant.\nYou will only find him cool or badass, if you are 12 years old.\nOr, if you spend all day jerking off to 'Sons on Anarchy' or the 'Fast and Furious' films\nDeacon is a mopey little turd who needs to get over himself and Boozer his platonic life buddy is probably worse.\n\nOtherwise, great game that I heartily recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has to be one of my all time favourites.\n- Beautiful story\n- Well developed characters\n- Interesting game mechanics\n- Gets your heart beating\n- Great replayability\nI strongly recommend this game, even at full price. It really deserves a sequel!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. sometimes a bit slow but still cool! Grap are pretty great too for the year it came out. Solid!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Open-World Zombies game! The story is great and characters are amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun and a challenge great for the price id recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Voice acting didn’t always hit the mark, but the gameplay and story were good so I hardly noticed it. A damn shame Sony abandoned it. There was definitely more potential left in this ride. Also works great on the Steam Deck! Anyways, Deacon out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great! One of the best post apocalyptic/zombie games I've played in years. However, it doesn't like to play at anything above 60 FPS in my experience. So, limit your frames to 60 FPS if it is crashing and enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must play for a zombie, open world and rich-story game lovers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. It takes a bit to get into it. I was 20 hours in and wondering when the game was going to live up to the hype. Eventually the story begins to get really good and you don't want to stop. I would recommend this game 100% over and over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is king here. The story doesn't get in the way, but is nothing to write home about...The horde mechanic is really terrifying, challanging and rewarding... Great fun all around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, and bike riding is nice as well. I haven't played much of the game as of now but what I have played, I liked very much,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alright look… I wasn’t expecting this game to hit me in the damn feelings like it did. I thought it was gonna be “motorcycle + zombies = pew pew.” Nah. It’s actually kinda deep. Like… way deeper than I went in prepared for.\n\nThe world is straight-up gorgeous. Rain, fog, night time — all that atmosphere stuff actually matters. Even the bike feels like a character. You don’t just hop on it and go; you gotta maintain it, fuel it, take care of it, or you’re gonna be pushing that thing while freakers scream in the distance. Ask me how I know. 🙃\n\nThe hordes? BRO.\nThe first time I ran into one I panicked so hard I forgot every button on my keyboard. It’s pure chaos in the best possible way. When you finally take down a full horde it feels like you just wrestled a bear with your bare hands and somehow survived.\n\nThe story surprised me too. Deacon’s not some macho superhero — he’s messed up, angry, grieving, and trying to hold it together. And the game actually takes its time with that. Some missions drag a bit, but when the story hits, it hits.\n\nPerformance-wise, the PC version runs way better than it did back on console. Ultra-wide, unlocked FPS, nice visuals — feels smooth.\n\nIt’s not perfect:\n\nSome missions feel repetitive\n\nThe AI can be “questionable”\n\nInventory management is basically “hope you didn’t want to keep that, loser”\nBut honestly? It didn’t ruin anything for me.\n\nIf you like open worlds, emotional story beats, zombies that sprint at you like they’ve had twelve Red Bulls, and a bike that becomes your best friend… this game is 100% worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, great game. Still needs bug repairs, and I hope the devs continue to do so. \nCurrent bugs still exist, inclusive of the one that has inspired me to write this - where you cannot progress further into the caves (at a certain map location, later game) - because of invisible walls.\n\n9/10 - one of the best adventure games I've played in my life, overall - just requires a few further tweaks to be a 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy the game but make sure you download the classic as the 2025 update is full of bugs and inconsistent frame rates, even on high end hardware.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on the Steam Deck. Game ran well. I had a ton of fun with this game. Good story, unique characters, and riding around the map on a motorcycle was nice and relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved it , the game , the graphics and the story, hats off to bend team . Love you folks !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, stutters a little when loading new areas but no biggie, lots of content too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Days gone is the most \"Pretty Good\" game of all time. The Graphics are impressive for UE5, the gameplay is very \"generic,\" but not bad. (3rd-Person Zombie Survival Shooter) The Story is fine, don't expect anything incredibly profound, but it's serviceable enough to make you stay interested. You won't regret playing it, but you'll be left with a feeling of \"Huh, that was good - but it could have been better.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fits a sort of walking dead/mad maxy kind of feel. a bit limited due to starting ouit as a console game, but it's entertaining",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great combat, and good graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've played. Bend Studio has done a great job of story telling which keeps you engaged and wanting to find the conclusion to Deacon's story. The visuals are immersive, the bike progression feels meaningful and the zombies feel terrifying on their own at first and as you  progress, so do the zombies and you don't feel like you're facing the same ole' boring NPC over and over. \n\nI would absolutely recommend this game to anyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not a perfect game.\r\n\r\nQuite a number of bugs & glitches. \r\nEnemies spawned spontaneously in camp area that you've just cleared recently. \r\nEnemies clipped at walls, rocks, etc.\r\n\r\nSave your progress manually, do not rely so much on the quicksave option. \r\n\r\n\r\nBut nevertheless, THE GAME IS SUPER FUN!\r\nEncountering & killing a horde of freakers will get you addicted. Even on a new game plus mode.\r\n\r\nremember what i said about the game's not perfect?\r\na perfect score would be given, if the game has a sequel. 😉\r\n\r\nreme",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very beautiful game for all players who enjoy games from the open world apocalypse genre!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply amazing. One of THE best games ever. Very underrated. Loved it. Hoping Sony somehow magically changes their minds and green lights a sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've really enjoyed my time with Days Gone.  I never played it back in the day and thought I'd give it a shot.  It's showing it's age maybe a bit, but overall it looks beautiful!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the characters. The voice acting is also very good and engaging.\nThe story is fairly decent. I feel the most unique thing this game has is the huge amount of zombies that you can find many and awesome ways to kill.\nAlso who doesn't love riding bikes right??\n\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you don't want to be left with blue balls, don't play this game. Why do i say that ? It requires a Days Gone 2 game. This is a story driven game mainly, and the story leaves you with a burst of nowhere to go goo. As the studio doesn't seem able to make a continuation. Anyway great game, love how it hurts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved the game don't want to give spoilers but i love the secret ending with O'Brian.\r\n\r\nSequel? they really set it up in the cutscene. \r\n\r\np.s.  the secret ending isn't an actual ending it doesn't happen until after the credits roll>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🏍️ Deacon St. John's Second Ride is a Masterpiece\r\nA solid, must-buy recommendation from a veteran survivor.\r\n\r\nI originally played and finished Days Gone on my PS5, putting in all the hours to clear out every last horde and see Deacon's story through to the very end. I loved the game then, but playing it now on PC is a genuinely superior experience that has completely changed how I look at the game's combat.\r\n-----------------------------------------\r\nPC vs. PS5: Mouse and Keyboard Changes Everything\r\nWhile the PS5's 60fps was a huge step up from the PS4, nothing compares to the precision offered by a mouse and keyboard. The shooting mechanics, especially when dealing with the massive Freaker hordes, go from being challenging to feeling incredibly satisfying and responsive.\r\n\r\n🎯 Combat: The fine aiming control of the mouse makes landing those crucial headshots effortless. Taking down a full horde is no longer a frantic struggle with controller aiming—it's an organized, thrilling slaughter where you feel in control.\r\n\r\n🖼️ Visuals: With higher frame rates and enhanced graphic options, Oregon looks stunningly beautiful and terrifyingly bleak. I'm running the game on Ultra Max Settings, and the draw distance, detailed foliage, and massive scale of the hordes feel much better and more immersive than what the console could deliver.\r\n\r\nIf you enjoyed this game on console, this is the definitive way to play it.\r\n-----------------------------------------\r\nLooking Ahead to New Content!\r\nI am extremely excited to finally jump into The Broken Road DLC that's available on PC. It was a shame not to have that content on my PlayStation, but now I get to experience all the new modes, including the challenging Horde Assault and Permadeath mode, with the perfect control scheme.\r\n\r\n100% recommended. Re-buying this game for PC has been one of the best gaming decisions I've made all year. Now, if you'll excuse me, I have a few hundred Freakers to practice my headshots on!\r\n\r\nFinal Verdict: 10/10 (For the PC experience)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just want to say one thing they still haven’t fixed the audio problem. We’re just keeps cracking it’s annoying and it’s been a problem for a really long time and they still haven’t fixed it just please fix it. It’s it’s a really good game and I wish there was a sequel for it.just please fix the audio problem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 Hands down the best game i have ever played. I am a huge fan of the zombie genera and have basically tried them all. This is the best zombie game there is. Smooth gameplay, EPIC story. The only thing it lacks is replayability. Once you complete a playthrouigh and know how it ends, another playthrough dosent offer anything new. If Bend Studio were to make a game that had custom base building, that would immediately make the game replayable. This game is so godd in every other aspect, if that were to happen it could become a forever game, it would be so fun, you would never have to stop playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal game, top 5 best open world games I have ever played. Story is excellent, voice acting is excellent, gameplay is fun and always evolving during the game. 10/10 game imho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the combat and gameplay story not really strong but it doesnt matter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game multiple times and still enjoy it. One of the few games I have worked to Platinum, and purchased it again to p[lay on PC for DLC and re-playability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated zombie game. Is it perfect? No. Game has some problems and bugs, but overall gameplay is quite fun. Horde mechanic could use some polish but overall I had fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 65 hours in the game i think i could say that this is The is the most UNDERRATED zombie game, i don't think i can find this chill bike ride feeling in the post-apocalyptic world in other game, and if you take on all or almost every mission in the game i have to warned you it's actually a long game, the bad side is only about side mission for me it's kinda loop but not that boring, but one of the BEST part of the game is the HORDE, it's may scary at first but after you can take the first horde OH BOY! that's adrenaline rush but be warned THE HORDE IS NOT A JOKE.\r\nPS. i didn't finished the game while typing this review",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remember   playing this on ps4 , got hooked. Havent played anything else untill i finished it. Finished now on pc. Good game , optimised well. Minor bugs here and there but nothing that will impact overall gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Days Gone — 7/10\n\nDays Gone has potential, but it doesn’t fully deliver on what it promises. The world is atmospheric and the gameplay has satisfying moments, yet too many parts of the experience feel repetitive.\n\nThe mission structure quickly becomes predictable, and many encounters start to feel like variations of the same task. The voice acting is mid, it doesn’t stand out, and the story never fully grabs you — it’s there, but it doesn’t hook the way a post-apocalyptic story should.\n\nOn the positive side, the shooting mechanics feel clean and responsive, offering good weight and impact. Riding the bike is genuinely fun at first, but the kinda fades as the game cycles the same travel loop over and over.\n\nOverall, Days Gone is enjoyable in bursts, but not memorable. A solid 7/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Where do I even start? I’ve had a lifelong thing for zombies — games, TV, movies, board games, whatever. If it has the undead in it, I’m there. Blame late-night drive-in showings of Night of the Living Dead back when parents told you to go to sleep because the “late showing was for adults.” Naturally, I didn’t listen. And naturally, Romero rewarded me with years of recurring nightmares that somehow evolved into a lifelong obsession. Thanks, George.\r\n\r\nBecause of that obsession, I’ve seen every flavor of zombie media — and believe me, a lot of it is flat-out bad. So I hesitated on Days Gone. I heard the PC controls were questionable, and that there were “super zombies,” which usually means developers don’t understand that a slow, relentless horde is already terrifying when written well.\r\n\r\nThen I finally played it… for about 145 hours. And every one of those hours was worth it.\r\n\r\nYes, there are mutated “super” variants — welcome to modern zombie design — but the world is so well built that it still works. And the core idea of the undead being an endless, tireless threat is very much intact.\r\n\r\nThe graphics are excellent. Cruising around on your motorcycle never stopped being fun. The RPG-style progression was surprisingly satisfying: as the story moved forward, so did you — and your bike. Tracking down the injectors was one of my favorite parts because they forced you to think about your playstyle instead of just blindly leveling up. Add in the usual carrot-chasing — better guns, better gear — and it genuinely felt like you were becoming more capable as the story deepened.\r\n\r\nThe music? Fantastic.\r\nVoice acting? Top tier.\r\nWorld design? Easily the highlight.\r\n\r\nEven the little points of interest scattered around the map felt deliberate. And some of the challenges — like upgrading your bike just enough to make a particular jump — were fun without crossing into nonsense. (No, there aren’t zombie sharks to jump... somehow.)\r\n\r\nNow, for the frustrations:\r\n\r\nSome missions get repetitive. Not a deal-breaker, but noticeable.\r\n\r\nThe logic of certain missions is… questionable. It’s the zombie apocalypse. The world is dead. And someone wants me to dodge raiders, wolves, cougars, undead everything, just to retrieve his copy of the Bible? No. Absolutely not. Grab another one.\r\n\r\nInconsistent writing at times. A character tells you to leave and never come back… then two breaths later says they could really use you. Maybe he’s emotionally damaged. Let’s assume that, because the alternative is just sloppy writing.\r\n\r\nTiming issues. When I’m deep into Act 3 and time is literally life-or-death, I’m not stopping everything to help someone I don’t even like with some personal side errand. Nobody would.\r\n\r\nAnd finally: it ended. I genuinely loved living in this world. I bought Days Gone years ago and let it sit in my backlog, and when I finally jumped in I stayed there. It hooked me completely.\r\n\r\nIn spite of the few minor flaws — and every game has them — this climbed straight into my personal top 10. I strongly recommend it to anyone who loves the genre or just wants a well-built world to lose themselves in for a while.\r\n\r\nPS Don't be afraid to take on hordes. I avoided it for a long time and I regret it, it was a lot of fun once you got the hang of your way to handle them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a great game im hooked for sure. i hope we get a second game that is just as good soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Days Gone delivers a gripping journey through a harsh, post-apocalyptic Oregon filled with danger and emotion. Its world-building, character focus, and atmospheric tension create a memorable adventure. Centered on Deacon St. John’s personal struggle, the game blends survival, exploration, and action into an experience that stands out despite its flaws.\n\nWhat I liked:\n\n--A gripping story that unfolds through small micro-stories that feed into the main narrative, keeping things engaging without relying on the usual “main mission vs side mission” checklist structure.\n--Great character development overall, with Deacon standing out as a strong and memorable protagonist—far from the typical videogame cliché.\n--Solid gameplay with fun missions and satisfying combat.\n--The hordes are the highlight of the game—intense, challenging, and incredibly thrilling to face.\n--Technically solid: strong visuals, a great atmosphere, and very good performance throughout.\n\nWhat I didn’t like:\n\n--Missions can become repetitive over time, which can make portions of the game feel tedious.\n--The story stretches itself unnecessarily, losing some momentum in the process.\n--Gameplay, while solid, is somewhat limited and doesn’t bring much innovation to the open-world formula.\n--The hordes, despite being the main attraction, don’t fully appear until very late in the game.\n--Not much to do in the post-game, leaving the world feeling a bit empty once the main story is finished.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended, 85/100 Slow start, great writting, very good story and solid gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In short the game deserves all Cent that you spent on it\n\nGraphics is 10/10\nStory 100/10\nWorld Design 10/10\nMusic 10/10\nMain Characters 10/10\nGameplay 10/10\nEnding 9/10\nMissions 6/10\n\nThe only thing that make the game not 10/10 is the Missions is not organized well and some places in the games especially the last part of the games(I don't wanna spoiled it) is have too many glitches that make you can't see the cars any you fighting Hordes.\n\nUPDATE: there is glitch in Chemult College NERO Checkpoint the fuse is Gone so can't complete the Achievement -_-\n\nOne of the  best games i ever play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most badass zombie game, good story and hordes are scary. \r\nAt the beginning of the game hordes chase you and at the end, you chase them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2] Review for Days Gone [h2] \r\n\r\nI'll preface this by saying that I originally didn't think much of Days Gone when it was advertised and then suddenly went cold with marketing. I got it as part of PS+ back when I played on PS4. I started, stopped, and then started again because the story got me hooked. So my Tl;Dr for the review is this:\r\n\r\nBuy the game. Play it. If it's on sale, play it. It has a fun gameplay loop even if it seems like a typical zombie apocalypse game. There's an arcade-y style feel to it with the level up system too. The strongest part about the game though, is the story. I can't recommend it enough, the best aspect of it is how attached you will get to a few characters because of how well their voice actors performed. \r\n\r\n- [b] Gameplay [b]\r\n- [b] Difficulty [b]\r\n\r\n\r\n[h2] Gameplay [h2] (Crossbow is love, crossbow is life)\r\n\r\nThe gameplay is a fun, turn-your-brain off (but not too long) shooter with some light RPG elements associated with it. You get two leveling systems (maybe 4 if you count the bike and the camp trusts). You get one in the form of XP, which unlocks a skill tier for three categories: Melee, Ranged, and Survival. Melee is obvious, increasing your damage with melee weapons and focusing on stamina regen. Ranged focuses on your weapons, and deals with focus regen (this is an upgrade you [i] can [i] get in the MSQ, it's not given to you). Survival has to deal with passive abilities and making the most of surviving in the wild, and deals with health regen. No category overpowers the other--all three of them yield extremely useful skills that will help you survive in combat. Melee has an ability to instantly kill enemies after escaping a grapple, stun weaker enemies with a rock (which then sets them up for an instant kill) or instantly killing some of the more dangerous enemies in the game if you approach them undetected. Ranged gives you better stopping power, accuracy, and extended inventory space. Survival allows you take double the amount of plants, four times the animal meat to sell, and even outlining enemies a certain distance from you, even if they're behind walls. You can't sequence break early--you do have to reach about halfway into the game before you start getting tier 4/5/6 abilities to play with. The other you get in the form of NERO injectors, which permanently increase your Health, Stamina, or Focus for the rest of the game. I did beat the entire game on Hard II as of this review, the upgrades were not necessary to beat the game but they add a fair amount of quality of life to your experience. Overall I find the game very smooth to control and even aiming feel precise without upgrading (to a degree, it depends on the rank of your weapon too). \r\n\r\nOh yeah. Weapons! You start with a 9mm and Knife (Syphon Filter 2 mission 1, anyone?) and you can loot weapons off of enemies you kill, or in rare cases find them on the field. Your starting pistol is, to put it lightly, trash. No seriously, it's considered junk condition, which means you can't even modify it. Weapons come in five ranks: \r\n\r\n1. Junk\r\n2. Poor\r\n3. Average\r\n4. Military Spec\r\n5. Spec Forces\r\n\r\nJunk being the worst, and Spec Forces being the best. You will not see Spec Forces weapons until MUCH later in the game, but some weapons can still carry, like the MWS or US556. The rank determines whether or not you can modify it, and you cannot modify weapons below rank three it seems. Thing is... the \"modification\" system is almost meaningless because you have duplicate weapons with different ranks. The rank also affects the overall stats of the weapon, so the only modification you can do to them aside from a suppressor is giving an extended mag. That's it. Don't get me wrong, you will learn to appreciate having a lot of bullets in this game, because ammo is scarce for a decent chunk of it. You can loot police cars or enemy camps, but you can only hold so many bullets until you upgrade/modify. \r\n\r\nMelee weapons technically have no rank, and are instead displayed to you based on how much damage vs. durability they have. There are objectively superior melee weapons though, namely crafted ones. Don't expect something out of Dead Rising 2 though, Deacon is not skilled enough to make crazy stuff like that. They are handy to have when you want to neutralize freakers without firing your gun or using up suppressor durability, because sound is REALLY important in this game. It's a reoccurring factor throughout the entire game, to the point that the game will sometimes warn you of either more or extremely strong enemies spawning because too much noise is being made. This applies to both you and hostile human enemies. You will unlock more dangerous enemies that will start spawning in the overworld once you do specific MSQs. \r\n\r\nYou have access to a crafting system. There are some items which look like they can be interacted with, but can't be until later in the game OR when you earn the requisite recipe. Those items function as materials to craft a slew of things: from proximity bombs, to smoke bombs, to sound attractors for freakers, to molotovs, to the aforementioned crafted weapons. There's a sizable chunk here, and some of that even pertains to recovery items. I think having a small crafting list was for the best--I couldn't really think of anything that you couldn't already craft or use with the crossbow. Crossbow is love, crossbow is life. Seriously, that crossbow is so damn handy in the later half of the game. You will make friends with cedar saplings and you'll like it. 9/10 for gameplay.\r\n\r\n[h2] Difficulty [h2] (Be a chad and do a fresh Survival II run on permadeath)\r\n\r\nThe game comes with several difficulties:\r\n\r\n- Easy\r\n- Normal (1st time completion)\r\n- Hard\r\n- Hard II (2nd time completion)\r\n- Survival \r\n- Survival II \r\n\r\nGoing from Normal to Hard II is like going from playing baseball in high school to playing in the Major Leagues where if you get three strikes, your life is forfeit. Ok, it's not THAT bad, but it still is a sizable step up in difficulty. On normal enemies are like pillows. On Hard II, Freakers and their variants, along with wild animals are very tanky. It's not too obnoxious as you can line up headshots, but some enemies take more than just a few mag dump headshots. I will note that I had permanent upgrades due to challenge mode, you get patches added to Deacon's character model for every one you earn (which is a nice touch) and the efficacy of them depends on what rank you got for each sub challenge. I'll avoid going into challenge mode, but you can reap those benefits for story mode if you know what you're doing. Shame we can't use the rings, though. Getting back to enemy difficulty, on Hard II you cannot mark enemies via binoculars, and enemies are far more quick to spot you from a distance as well as flank you out of cover more often. But what really sucks about this is that enemies never dynamically scale with you, only Freakers. From beginning till the end you will still fight the same squatters and drifters using rank 1 and rank 2 weapons. Only one other faction aside from one you encounter in MSQ has access to rank 2 and some rank 3 weapons. Personally, I would have liked if enemies got stronger weapons in accordance to your level+weapons bought. Would have added a little bit of variety. 7.5-8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with good storyline.  The zombie concept is a little played out, but this game still feels fresh enough to recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While the story isn't the best thing ever it is great. Can be a bit slow especially in the beginning but it only gets better. Best zombie game by far imo. Deserves a sequel *cough*\n The show-stealer here is Deacon, great character and Sam Witwers voice acting is out of the park as per usual. They nail facial expression for the most part. What really shines though is the gameplay, which is the most important part of course. It can be a bit boring when fighting 1-5 freakers late game but the hordes are a lot of fun. Had me sweating bullets when I played for the first time on playstation. \nThe Bike is also done very well in this game, it feels just as important to level your bike as your character. Also tons of customizations for completing storylines. That's just a cherry on top though. It's also important to stay near your bike as it is the only thing keeping you alive at times and is your main way to save game files. Which in other games I think i'd dislike but the bike is just so much fun to zip around on I don't ever want to leave it to far behind anyways. It isn't anything like mx vs atv but riding is smooth and reactive, took a lil bit for me to get used to it but once I did, it felt good. Probably my favourite bike mechanics in a game. \n\nWhile the game also definitely has issues they're not frequent enough to be a bother. From my combined accounts of about 100hrs of gameplay i've only come across maybe 10 bugs accidentally. They didn't affect gameplay, just things the laugh at really.\n\nAlso It's really cool that in the main game you can get slight advantages through the cosmetic patches earned in challenge mode.\n\nP.s. I've had this want for a walking dead adaptation in the style of Red Dead Redemption 2 for YEARS. Days gone is better than that idea. Though that'd still be cool as heck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10. Great take on zombies. Love the feel of driving around on the bike. Familiar open world gameplay with fresh elements. Hope we get a sequel someday, plays relatively bug free now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Days gone in my (expert) opinion is overly judged by some and is a great zombie survival game, I absolutely love the motorcycle and the customization options it has to the point it feels like a actual character to me and i'm sad whenever I break it or have to leave it behind and run away lol. \n\nThe gameplay is fun and exciting, clearing out hordes was one of my favorite things to do while exploring the world which itself is fairly large and has lots to collect, people to help out and serums to inject that you'll have more than enough to do for hours with a great new game + awaiting you, the story however is where the game hits a wall as any twists it tries to set up are easily seen coming, the ending was incredibly anticlimactic and real character deaths aren't really emotional (except my motorcycle breaking). \n\n7.6/10 I recommend getting this on sale but if you have the money full price is still not too bad a purchase, even today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like motorcycles, guns, challenges, and zombies this is it brother.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was great. Overall, I loved the story and the game play. Below are a few pros and cons from me:\n\nPros:\n1. The story is great\n2. The characters are well written. \n3. Side quests are as good as the main missions themselves. \n4. Horde challenges were great.\n5. A game for those looking for something more tuned and with less bullshit. \n6. Did not feel repetitive.\n\n\nCons: \n\nI cant really say anything bad about it. Ya it has its moments like any game but overall it is worth the play. The only thing I did not like was in a few cut scenes, there were a few lines or moments where it is obvious that they tried to add in some message. But not so much I guess, at lest not enough to hinder the main story line.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I just cant enjoy this game i have really tried. feels empty and nothing like the trailers and what i have seen in gameplay stuff.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "This world is a graveyard and it does not care who dies next. You ride covered in blood and guts, smell death on the wind, and every step could be your last. I have seen bodies vanish into nothing, friends lost like they were never real, glitches that twist your mind, my bike stuck in mud, enemies crawling through walls, but you keep moving because standing still is a faster way to rot. Every fight leaves you raw, every shot echoes in your chest, and the forests and mountains watch like predators waiting for you to fall. It is ugly, it is endless, it is hopeless, and it chews on your soul until nothing feels real. Lives are lost, blood is spilled, nothing matters, and surviving it feels less like winning and more like dragging what is left of yourself through a world that has already died...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "awful tedious game that people pretend to like this game feels like i have been lobotomised playing this just feels like i am doing a task",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I don't know how this game has very positive reviews, maybe the story is soooooo good that it completely overshadows the terrible gunplay, stiff animations, weird sounding VA work (I do not know whether this is the VA's faults themselves, the equipment or just direction, maybe all three) and the terrible looking blood. I had just gotten past the tutorial already having massive doubts, but as soon as I walked down the stairs of the watchtower and Deacon just hovered down because there are no unique animations for walking up/down stairs and hills I immediately ALT+F4'd, requested a refund and wrote this review. I do not know if the other reviewers for this game somehow got a separate copy where the developers realised that humans do not use levitation to navigate stairwells or what because this is genuinely the worst example I have ever seen of reviews differing from reality.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i was intrigued when play station games started coming on pc and after playing the new god of war games, which i really enjoyed, i was ready to give more sony published games a chance. and since both survival horror and zombie games are genres i enjoy, i decided to start with days gone. all'n all not a horrible game, but the thing is it's barely a game, it's more like a long movie with playable cut scenes.\r\n\r\n the crafting system, if you can call it that, is lacking, half baked and redundant at the same time. the only thing that keeps you looting for things is the artificial cap on the amount of crafting components which you can carry which is btw ridiculous, like even after fully levelling up you can barely carry enough scrap to repair your melee weapon twice. speaking of levelling, its just like the crafting system, i'm certain if they would just remove levelling altogether, it would be an improvement to the game. the gun play is possibly the most generic (and i'm being kind) i have ever seen in a game ( guns have no weight, sound awful to shoot, aiming and handling are at best jank,etc); games like dead island and dying light which are meant to be primarily melee focused games, have way more engaging fire arm mechanics. and again with the artificial ammo limitation, the gun play just feels awful. like you'r telling me i can have only 5 sniper bullets at a time. and it's not like the melee is good either. honestly the only game play mechanic i liked was riding a bike, that's kinda telling that in an action adventure zombie game, that's the best quality. and to top it all off, most enemies you fight with and the majority of the story line is not even about zombies, it's all humans, to the point many time i genuinely forgot zombies even existed in the game.\r\nto sum it up, there is no game play. as i said it's for most parts a long movie. now that being said, it's not even a good movie, the sound tracks and music is serviceable and graphics i think is the highlight of the game. but you would think the \"game\" would have if not a good story, at least an engaging one. and there is a difference, i've seen plenty of movies and played games which i did not like the story of, for a variety of reasons yet still followed and engaged with. but here, it's just plain boring, and i don't mean geology documentary boring, i mean back of the math class 9 am algebra with the substitute teacher who barely speaks your language boring. like i could not even bring myself to dislike the story; i was so bored out of my mind i stopped playing at what i guess would be considered as the climax of the game, when the truth is unravelled to the protagonist and the stakes are highest. and let me tell you something, when i start a game i play it at the very least to the end of the main quest, i can not think of a single other game that i played halfway through and stopped, even if i hated it, if for nothing to at least see it end. there's more i can say about the game, like how it basically lies to you at the beginning, letting you think your choices matter with the camps or side activities like hunting are going to be a fun and rewarding part of the game, but i think i have wasted enough of my time with this game.\r\nworst part is that i got the game on a 20% discount and thought of it as a good deal. \r\nif you are looking for an extremely boring, poorly written and long zombie movie; i still would not suggest this, go watch zombie land.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☑ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☑ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☑ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is crashing often and upon starting it again it brings up only Error reporting screen. Timed my last in-game playtime to 24minutes before it crashed. My PC is not an issue, since I play other, even more resource-demanding games than this, with no problems whatsoever. It's really disappointing because I liked this game a lot when it came out. PC specs: Intel 14900K, 128 GB of DDR 5, GPU: NVidia GTX 4090.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "přivez droždí simulátor. největší mid AAA hra. Však už.\n\ntotální mid postavy\ntotální mid gameplay\ntotální mid infected\ntotální mid mise\ntotální mid crafting system\nzbytečně se natahuje hra jak natahuju kondom na čůrák\n\nnatankovat motorku a spravit je totální mrdka \npříběh omrzí jak omrzliny v mínus 20 stupních\nsaving napíču\nzabugované cutsceny\nzabugovaná hra -> mrdka\nzkurvení vlci a medvědi totální useless nic to nedává\nzkurvené hry co se natahujou jak zpomalený film\n\nradši si pusť Sons Of Anarchy\n\nStává se mi málo že nějakou hru nechci dohrát když si ji koupím. Ale tohle je ta mrdka. Tohle je ten klenot. Tohle je ten kus hovna",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is mid for a zombie game. Trailer shows battling horde of zombies, 36hrs in and still no zombie horde mission. Too many unskippable, walk for 10mins cutscenes. Progress is HELLA SLOW, can't even feel any change in gameplay for the skill/bike upgrades, weird voice acting, story pacing is WAY OVER THE PLACE. No wonder this game flopped so badly. Not worth buying full price and not worth wasting any more time with this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay-\r\n☐ Very good\r\n☐ Good\r\n☑ Nothing special\r\n☐ Okay\r\n☐ Bad\r\n\r\nGraphics-\r\n☐ Masterpiece\r\n☐ Beautiful\r\n☑ Good\r\n☐ Will do\r\n☐ Bad\r\n☐ Awful\r\n\r\nAudio\r\n☐ Amazing\r\n☑ Very good\r\n☐ Good\r\n☐ Decent\r\n☐ Not too bad\r\n☐ Bad\r\n\r\nAudience\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Everyone\r\n\r\nStory-\r\n☐ Lovely\r\n☐ Good\r\n☐ Average\r\n☑ Not great\r\n☐ None\r\n\r\nDifficult-\r\n☐ Just press a bunch of buttons\r\n☑ Easy\r\n☐ Significant brain usage\r\n☐ Easy to learn / Hard to master\r\n☐ Not so easy\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\nGrind-\r\n☐ Nothing\r\n☐ Only if you care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ A bit grindy sometimes\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ Insanity\r\n\r\nGame Time-\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ Depends on you\r\n☐ Endless\r\n\r\nPrice\r\n☐ Just buy it\r\n☐ Worth the price\r\n☐ Wait for sale\r\n☑ Maybe if you have some spare money left\r\n☐ Not recommended \r\n\r\nDays Gone is just fine, my biggest issue with it is the story. I honestly could care less about the characters, it takes some absolute bizarre choices at times and the cutscenes are so chopped together. It makes you feel like they spent all their time working on the only good part of the game; the hoardes, and 5 minutes on the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For me this was an utter disappointment. They went for a self serious tone similar to The Last Of Us but when combined with the goofy ass, borderline childish dialogue, and flimsy, unsatisfying gameplay, it just didn't work at for me at all. Even a tiny bit of self awareness would've gone a long way here. The dead pan delivery of the main character can only work in a game that is equally serious or if it is being done satirically. The game was also bug ridden as hell. Couldn't go 10 minutes without some wacky physics issue flipping my bike into the sky or some dialogue being out of sync or a character speaking too quickly over another character's dialogue.\n\nI'd list every issue with the game but honestly there are so many that I just can't be bothered to spend my time on it. I'll have spent more time on this review than the game itself. I guess one positive I can say for the game is the performance was [i]okay[/i]. Not incredible, but okay outside of a stutter here and there. And the horde mechanics (which I am yet to experience) looks pretty solid from what I've seen in trailers and in gameplay footage. In my 3 hours played I didn't get to a point where a horde came except for one in a cutscene. Outside of those few things, I really have nothing good to say about this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I was actually enjoying the game but I've just spent the last two hours trying to launch the game after turning my PC off last night. It appears the fix is to uninstall and reinstall the game every time you want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring and repetitive. Slow and makes me yawn. Tedious and the voice over is really bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought the game on sale. \r\n\r\nIt just feels like RDR2 with zombies, a worse combat system and awful storytelling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another port that feels painfully sluggish and awkward on PC controls.  This game just felt gross.\n\nAlso, developers really need to figure out that people don't play video games to watch 7 minutes of cutscene, then control the character for 30 seconds just so they can watch another 7 minute cutscene.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game-play is perfectly fun and very serviceable, but the reddit-tier, anti-human writing/dialogue (think slop that a censored AI would plop out) sours it and drags it way down.\n\nNot a yes. Not a no. An 'only on sale'.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "honest review though only written for the badge thingy.\r\ngreat game loved it until they started with the free updates that ruined audio. I seemed to have fixed my audio but still when something ain't broken don't try and fix it! \r\ngive us Days Gone 2 and stop ruining this game.\r\naside from the useless updates they did to the game breaking the audio at one point this game ia fairly solid and I used to would have suggested it but if a company is gonna break shit for no reason I ain't putting my stamp of approval on it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The forced stealth on the nero missions ruin an otherwise great game. Who thought that was a good idea?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This games fucking nero checkpoints are annoying as hell it ruined the game for me having to run around for 10 mins looking for a fucking GAS CAN",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poorly made, Buggy, mechanics are lazy, dialogue is cliche. I am refunding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got the game on sale and its okay for the $17 USD price tag. The game play loop is pretty repetitive and the missions have nearly no variance in objectives. There is a LOT of fetch quest style missions with a large amount of the game so far being just traveling the same path half a dozen times back and forth. then set a zombie nest on fire 4 to 10 times, kill small hordes and repeat. If its not on a steep discount near the price listed, I would just wait to try the game.\n\nfew issues so far:\nUnrealistic recoil on ALL automatic weapons, making them basically useless.\ncrossbow being the most useful weapon early on, not for stealth but just not suffering from the hellish recoil.\nmost weapons with reasonable recoil are slow AF... terrible time for a horde of enemies to swarm you...\nyour beating stick will break at the worst time. stay on top of repairs!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to love this game, and at it's core, it's great, but this is unfortunately, the absolute glitchiest port I've ever played. I say without exaggeration that glitches occur approximately every 5 minutes; some make the game unfun, and some absolutely ruin it. Play at your own risk, but seriously, this is a pathetic excuse for a port.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky and slow movement... if you use stamina, the game will punish you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After you have looted 20 cars and 20 drawers by holding down X you become instantly bored of it, but you have to do it, they should add an upgrade to progress to instant looting for players that hate \"time consuming\" added as added realism.\n\n5 stars otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "clunky, boring spend your dollar on something else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sadly runs at a legit 2fps on a rtx 5070ti, so I can't rec this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my bike always shuts off right after accelerating. I tried uninstalling the game, resetting my computer, and even resetting my progress, but nothing works. there was one work arounds I found, repeatedly accelerating until it the bike used to work to keep it going, but not even that works anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally the first player controlled mission ends with an NPC (Leon) that vanishes in the cutscene where Deacon ends him. \r\n\r\nCan't imagine the rest of the game is gonna be any better. \r\n\r\nTrash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Who the hell thought mandatory insta-fail stealth section were a good idea?\nI like the game for a lot of reason but that one alone makes me hate it.\nYou know what, Josh freaking Garvin, the reason your game sold like crap is NOT woke reviewers, it's you understanding crap about game design and putting stuff like that into your game.\n\nSome other things\n\n* Deacon is a cringe character. His \"codex\" of \"not killing unarmed women\" is sooo cringe wtf man\n\n* Bugs are still present. Audio triggers don't happen or happen at the wrong time\n\n* AI is just the worst. Human enemies were standing 4 meters in front of me and couldn't see me. Others spotted me from 100 meters away.\n\n* Quest and especially audio triggers are bugged as hell. Sometimes they will repeat dialog, somtimes no dialog will happen at all.\n\n* The world map is boring and looks the same wherever you are\n\n* Plot is... idk. It exists I guess?\n\n* Dialog is what I would expect from a 14 year old (Ride me like your bike)\n\n* Boring forced slow-walk sections all the time\n\n* Puts you into a mandatory horde fight without any warning and any way to switch weapons. You will have to load an autosave from 2 missions before before because upon completing the mission before they will throw you into the horde without any chance to anything.\nThis is the moment I quit. Don't waste my freaking time like that.\n\n* SOOO many more  insta-fails. \nGot detected by Neros? Insta-fail. \nGot a horde alerted in a story mission? Insta-fail. \nGot detected while sneaking into a camp? Insta-fail\nStray away too far from the mission? Insta-fail\n\nLet me play the game, ffs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "state of the art boredom and console-ware, I want my money back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash unfortunately. Deserves all the hate and not sure how it's positive reviews. Terrible cheap copycat of other games, uninspired unfinished unpolished annoying game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i was looking for an fps to play the hardcore way, this is however a controller based 3rd person mess, with more cinematics than gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "made with the best tools available, by freaks who dont know what fun is",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unable to disable tool-tips, really messes with combat when they appear.\nAwkward controls.\nInane babbling by the main character",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring and felt to slow and it ran like crap on my rtx 5080",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Leons disappear when he got shot\nfix ur game plz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is good game buried deep, deep, deep, deeeeeeeeep beneath all the BS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring and repetitive.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Third Person Misery.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its boring to me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS SUCKS Ahh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "👎👎👎",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I just cant enjoy this game i have really tried. feels empty and nothing like the trailers and what i have seen in gameplay stuff.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This was a fun game, but the core gameplay loop became repetitive FAST.\n\nI just couldnt keep playing it any more than a few hrs.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I can not understand how this game was released. This is the least thought out game i have ever played outside a beta or early access. IDK where to start. Gasoline is somehow limited in your bike, but unlimited from jerry cans in the world. You can't use gasoline in a molotov cocktail, no that has to be kerosene. You can only carry 5 rifle bullets for a hunting rifle, yet it is a 2 to 3 shot kill weapon to the head, you can not keep weapons you pick up, you have to buy them to keep them. But not just buy, you have to be allowed the privilege of buying weapons and supplies, with a moronic \"Trust System\". All while your character cries over his wife who may or may not be alive and you get very little back story about to even care. DO NOT BUY. Unless you are a mindless NPC who gets enjoyment from a story and gameplay more shallow than a puppy piss puddle.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I had high hopes for this port after playing it literally on a PS4 a few years ago, after all the patches and updates. It rarely ever bugged out and I had nothing to complain about, and after I heard about the PC release I waited expecting some fixes being needed as most ports do. Even after all this time it seems that one of my favorite games is a sheer mess on PC. I had issues literally with random stutter on the startup of the game, and in intro mission Leon's body disappeared both in the cutscene and in game, alongside the zombies that were below. This is all in addition to sever continuous stuttering that makes the game unplayable; unfortunately this game seems to continue it's trend of un-optimization.\n\nPC Specs:\nProcessor: AMD 5900X\nGPU: AMD 7900XTX\nRAM: 32 GB\nStorage: Samsung 990 Pro NVMe 2TB\n\nI don't believe my PC is the issue, my drivers are up-to-date, and I have played many other more intensive games at 4K on very high/extreme settings with minimal issues; if there were ever any it wasn't anything that couldn't be fixed by some graphics optimization and/or verifying the integrity of the game files. This is not the case here, and to say I am severely disappointed is an understatement. I will not refund this game as I am still holding out hope that these issues get fixed and would like to support the studio, but as it is even with others being able to play the game normally (I can't tell what the ratio of playability is for players), I personally cannot recommend the game.\n\nFor what it's worth, I am aware of the beta branch option but I am not interested in it solely because I wanted to play this game with it graphical updates, etc. and take full advantage of my PC, which obviously isn't the case right now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful tedious game that people pretend to like this game feels like i have been lobotomised playing this just feels like i am doing a task",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i was intrigued when play station games started coming on pc and after playing the new god of war games, which i really enjoyed, i was ready to give more sony published games a chance. and since both survival horror and zombie games are genres i enjoy, i decided to start with days gone. all'n all not a horrible game, but the thing is it's barely a game, it's more like a long movie with playable cut scenes.\r\n\r\n the crafting system, if you can call it that, is lacking, half baked and redundant at the same time. the only thing that keeps you looting for things is the artificial cap on the amount of crafting components which you can carry which is btw ridiculous, like even after fully levelling up you can barely carry enough scrap to repair your melee weapon twice. speaking of levelling, its just like the crafting system, i'm certain if they would just remove levelling altogether, it would be an improvement to the game. the gun play is possibly the most generic (and i'm being kind) i have ever seen in a game ( guns have no weight, sound awful to shoot, aiming and handling are at best jank,etc); games like dead island and dying light which are meant to be primarily melee focused games, have way more engaging fire arm mechanics. and again with the artificial ammo limitation, the gun play just feels awful. like you'r telling me i can have only 5 sniper bullets at a time. and it's not like the melee is good either. honestly the only game play mechanic i liked was riding a bike, that's kinda telling that in an action adventure zombie game, that's the best quality. and to top it all off, most enemies you fight with and the majority of the story line is not even about zombies, it's all humans, to the point many time i genuinely forgot zombies even existed in the game.\r\nto sum it up, there is no game play. as i said it's for most parts a long movie. now that being said, it's not even a good movie, the sound tracks and music is serviceable and graphics i think is the highlight of the game. but you would think the \"game\" would have if not a good story, at least an engaging one. and there is a difference, i've seen plenty of movies and played games which i did not like the story of, for a variety of reasons yet still followed and engaged with. but here, it's just plain boring, and i don't mean geology documentary boring, i mean back of the math class 9 am algebra with the substitute teacher who barely speaks your language boring. like i could not even bring myself to dislike the story; i was so bored out of my mind i stopped playing at what i guess would be considered as the climax of the game, when the truth is unravelled to the protagonist and the stakes are highest. and let me tell you something, when i start a game i play it at the very least to the end of the main quest, i can not think of a single other game that i played halfway through and stopped, even if i hated it, if for nothing to at least see it end. there's more i can say about the game, like how it basically lies to you at the beginning, letting you think your choices matter with the camps or side activities like hunting are going to be a fun and rewarding part of the game, but i think i have wasted enough of my time with this game.\r\nworst part is that i got the game on a 20% discount and thought of it as a good deal. \r\nif you are looking for an extremely boring, poorly written and long zombie movie; i still would not suggest this, go watch zombie land.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Game is crashing often and upon starting it again it brings up only Error reporting screen. Timed my last in-game playtime to 24minutes before it crashed. My PC is not an issue, since I play other, even more resource-demanding games than this, with no problems whatsoever. It's really disappointing because I liked this game a lot when it came out. PC specs: Intel 14900K, 128 GB of DDR 5, GPU: NVidia GTX 4090.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay-\r\n☐ Very good\r\n☐ Good\r\n☑ Nothing special\r\n☐ Okay\r\n☐ Bad\r\n\r\nGraphics-\r\n☐ Masterpiece\r\n☐ Beautiful\r\n☑ Good\r\n☐ Will do\r\n☐ Bad\r\n☐ Awful\r\n\r\nAudio\r\n☐ Amazing\r\n☑ Very good\r\n☐ Good\r\n☐ Decent\r\n☐ Not too bad\r\n☐ Bad\r\n\r\nAudience\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Everyone\r\n\r\nStory-\r\n☐ Lovely\r\n☐ Good\r\n☐ Average\r\n☑ Not great\r\n☐ None\r\n\r\nDifficult-\r\n☐ Just press a bunch of buttons\r\n☑ Easy\r\n☐ Significant brain usage\r\n☐ Easy to learn / Hard to master\r\n☐ Not so easy\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\nGrind-\r\n☐ Nothing\r\n☐ Only if you care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ A bit grindy sometimes\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ Insanity\r\n\r\nGame Time-\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ Depends on you\r\n☐ Endless\r\n\r\nPrice\r\n☐ Just buy it\r\n☐ Worth the price\r\n☐ Wait for sale\r\n☑ Maybe if you have some spare money left\r\n☐ Not recommended \r\n\r\nDays Gone is just fine, my biggest issue with it is the story. I honestly could care less about the characters, it takes some absolute bizarre choices at times and the cutscenes are so chopped together. It makes you feel like they spent all their time working on the only good part of the game; the hoardes, and 5 minutes on the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For me this was an utter disappointment. They went for a self serious tone similar to The Last Of Us but when combined with the goofy ass, borderline childish dialogue, and flimsy, unsatisfying gameplay, it just didn't work at for me at all. Even a tiny bit of self awareness would've gone a long way here. The dead pan delivery of the main character can only work in a game that is equally serious or if it is being done satirically. The game was also bug ridden as hell. Couldn't go 10 minutes without some wacky physics issue flipping my bike into the sky or some dialogue being out of sync or a character speaking too quickly over another character's dialogue.\n\nI'd list every issue with the game but honestly there are so many that I just can't be bothered to spend my time on it. I'll have spent more time on this review than the game itself. I guess one positive I can say for the game is the performance was [i]okay[/i]. Not incredible, but okay outside of a stutter here and there. And the horde mechanics (which I am yet to experience) looks pretty solid from what I've seen in trailers and in gameplay footage. In my 3 hours played I didn't get to a point where a horde came except for one in a cutscene. Outside of those few things, I really have nothing good to say about this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "přivez droždí simulátor. největší mid AAA hra. Však už.\n\ntotální mid postavy\ntotální mid gameplay\ntotální mid infected\ntotální mid mise\ntotální mid crafting system\nzbytečně se natahuje hra jak natahuju kondom na čůrák\n\nnatankovat motorku a spravit je totální mrdka \npříběh omrzí jak omrzliny v mínus 20 stupních\nsaving napíču\nzabugované cutsceny\nzabugovaná hra -> mrdka\nzkurvení vlci a medvědi totální useless nic to nedává\nzkurvené hry co se natahujou jak zpomalený film\n\nradši si pusť Sons Of Anarchy\n\nStává se mi málo že nějakou hru nechci dohrát když si ji koupím. Ale tohle je ta mrdka. Tohle je ten klenot. Tohle je ten kus hovna",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was actually enjoying the game but I've just spent the last two hours trying to launch the game after turning my PC off last night. It appears the fix is to uninstall and reinstall the game every time you want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring and repetitive. Slow and makes me yawn. Tedious and the voice over is really bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every time I try to open the game, it immediately errors and shuts down. My PC is a bit old, but I used to be able to play it, and everything is up to date.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game-play is perfectly fun and very serviceable, but the reddit-tier, anti-human writing/dialogue (think slop that a censored AI would plop out) sours it and drags it way down.\n\nNot a yes. Not a no. An 'only on sale'.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The forced stealth on the nero missions ruin an otherwise great game. Who thought that was a good idea?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "10/10 Voice actors\r\n10/10 Cutscenes\r\n7/10 Story\r\n3/10 Gameplay\r\n\r\nPlayed through to see the story/ending.\r\n\r\nRepeating gameplay. Slow, especially in the beginning. The hordes can be \"cheesed\".\r\nGraphics are typical modern UE5 blurriness.\r\nConsole/Netflix UI.\r\n3rd person shooting felt really janky.\r\n\r\nPersonally I have difficulties immerse myself in 3rd person games. If the game would be in first person, and the game mechanics changed accordingly, this could potentially be among my favorite games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "unfortunately the camera is way too close to the player character. it obscures way too much and even more when aiming down sights. ruins the entire game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "from all the glaze this game gets, i will say it is not what people make it out to be, theyt tried to copy the daryl dixon from the walking dead vibe but gave up halfway trough production, yes the game is 4 years old, but it comes with a lot of downsides, played my first playtrough, and i was getting dissapointed midway trough it, the game started to feel more like a go fetch this thing, bring it back, or go kill them and get a reward type of game instead of a story driven game, you would spend a shit ton of time doing something for a story questline, with the cutscene or actual story moment being like max 2-5 mins which is just irratating, and lets not get into the combat, wonky as hell, got used to it but still could of been so much better, the movement is meh, bike mechanics were ok i guess only issue i had is when you made jumps even with a maxed out bike shit would just slam into the ground and loose completely all its inertia, the only good things i can really list are the visuals for a 2021 game its pretty decent especially with reshade, but all in all the game is just a solid 5/10, the story line is meh, especially the ENDING was soooooo rushed, like i was basically pushing myself to finish it, cause i wanted to get to the ending without youtube, so decided to get to it and omg it  was dissapointing, the same thing as before cutscenes are sooo short after the amount of tedious grinding, i just cant recommend this, might just be me, but at the end of the day i do feel like the game was rushed and undercooked.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Poorly made, Buggy, mechanics are lazy, dialogue is cliche. I am refunding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to love this game, and at it's core, it's great, but this is unfortunately, the absolute glitchiest port I've ever played. I say without exaggeration that glitches occur approximately every 5 minutes; some make the game unfun, and some absolutely ruin it. Play at your own risk, but seriously, this is a pathetic excuse for a port.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky and slow movement... if you use stamina, the game will punish you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly no idea what people find interesting in this game.. Playing on hardcore the NPCs are absolute joke, i can imagine how bad it is on normal or easy mode.. Its all buggy and weird, my grandma could play this game on hardcore.\n\nIts not really what I thought it would be. This game should cost half of its price.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sadly runs at a legit 2fps on a rtx 5070ti, so I can't rec this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally the first player controlled mission ends with an NPC (Leon) that vanishes in the cutscene where Deacon ends him. \r\n\r\nCan't imagine the rest of the game is gonna be any better. \r\n\r\nTrash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't say the game is bad because the start is so slow and dull I quite literally quit before after getting back to where I hid my bike. I absolutely love open world games, and I felt the story was fine, but I've just got zero interest to actually continue this game.\n\nYou have a limit to how many of each item you can have, which is normal, but with an incredibly restrictive inventory for crafting supplies of each type it really feels like the game should have no crafting at all. Gun play? Forget it. My best weapon \"the pistol\" has such poor accuracy I honestly think if I was to go back I wouldn't ever use it. It's just that bad.\n\nHonestly, if I could have just watched this as a movie I think I would have gotten more enjoyment for my time. I'll never know whether the game is good or not because I can't stomach putting more time in as I can't find a single point that grabs me to keep me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my bike always shuts off right after accelerating. I tried uninstalling the game, resetting my computer, and even resetting my progress, but nothing works. there was one work arounds I found, repeatedly accelerating until it the bike used to work to keep it going, but not even that works anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who the hell thought mandatory insta-fail stealth section were a good idea?\nI like the game for a lot of reason but that one alone makes me hate it.\nYou know what, Josh freaking Garvin, the reason your game sold like crap is NOT woke reviewers, it's you understanding crap about game design and putting stuff like that into your game.\n\nSome other things\n\n* Deacon is a cringe character. His \"codex\" of \"not killing unarmed women\" is sooo cringe wtf man\n\n* Bugs are still present. Audio triggers don't happen or happen at the wrong time\n\n* AI is just the worst. Human enemies were standing 4 meters in front of me and couldn't see me. Others spotted me from 100 meters away.\n\n* Quest and especially audio triggers are bugged as hell. Sometimes they will repeat dialog, somtimes no dialog will happen at all.\n\n* The world map is boring and looks the same wherever you are\n\n* Plot is... idk. It exists I guess?\n\n* Dialog is what I would expect from a 14 year old (Ride me like your bike)\n\n* Boring forced slow-walk sections all the time\n\n* Puts you into a mandatory horde fight without any warning and any way to switch weapons. You will have to load an autosave from 2 missions before before because upon completing the mission before they will throw you into the horde without any chance to anything.\nThis is the moment I quit. Don't waste my freaking time like that.\n\n* SOOO many more  insta-fails. \nGot detected by Neros? Insta-fail. \nGot a horde alerted in a story mission? Insta-fail. \nGot detected while sneaking into a camp? Insta-fail\nStray away too far from the mission? Insta-fail\n\nLet me play the game, ffs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i was looking for an fps to play the hardcore way, this is however a controller based 3rd person mess, with more cinematics than gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nothing special. It gets boring very quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's less glitches in the J6 report than this fucking game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is good game buried deep, deep, deep, deeeeeeeeep beneath all the BS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to like this game. Can't put my finger on it, but it just couldn't make me care about it somehow...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't why people like this game, I did not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS SUCKS Ahh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "👎👎👎",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This was a fun game, but the core gameplay loop became repetitive FAST.\n\nI just couldnt keep playing it any more than a few hrs.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I can not understand how this game was released. This is the least thought out game i have ever played outside a beta or early access. IDK where to start. Gasoline is somehow limited in your bike, but unlimited from jerry cans in the world. You can't use gasoline in a molotov cocktail, no that has to be kerosene. You can only carry 5 rifle bullets for a hunting rifle, yet it is a 2 to 3 shot kill weapon to the head, you can not keep weapons you pick up, you have to buy them to keep them. But not just buy, you have to be allowed the privilege of buying weapons and supplies, with a moronic \"Trust System\". All while your character cries over his wife who may or may not be alive and you get very little back story about to even care. DO NOT BUY. Unless you are a mindless NPC who gets enjoyment from a story and gameplay more shallow than a puppy piss puddle.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I just cant enjoy this game i have really tried. feels empty and nothing like the trailers and what i have seen in gameplay stuff.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "While the gameplay, story and general enjoyment is decent, it is overshadowed by the attrocious oprimisation. The game stutters extremely regardless of your hardware.\r\n\r\nWould recommend purchasing it for the story should you be willing to spend the time to implement user suggestions and third party software to ensure it runs slightly better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Snagged this on sale. 19 hours in and I feel like I've seen everything this game has to offer. Better weapons are apparently when the fun really kicks in. My fault for spending too much time exploring early. Now I'm bored with the \"more of the same\" side quests and can't be bothered to grind for Iron Mike's camp trust. I missed something, somewhere, where money earned is actually just \"camp specific credit\". I hope Boozer passes away whilst I'm playing other games LOL. I'll come back to this...probably.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ONLY WORTH BUYING ON SALE AND IF YOU HAVE LITERALLY NOTHING ELSE TO DO - 4.5/10\n\nI can't express how truly disappointing this game is. Reading the reviews is honestly shocking by how many people say \"this is the best game ever\" and compare it to RDR2 or The Last Of Us. In my opinion, this doesn't even come close to those games. To be clear, I enjoy zombie games, especially ones with a good story, and motorcycle games like GTA IV's The Lost and Dammed, but I would rather replay any of the titles mentioned above rather than this game.\n\nPROS (and some cons):\nThe best part of the game is fighting the zombie hordes, it's fun to fight them and it does take some strategy to win against the larger hordes - but the zombie types (Screamer, Breaker, Runner) are uninspired and do not provoke any real challenge, besides being overwhelmed by them in the hundreds. The guns lack oomph and feel clunky to shoot, and fighting the human enemies gets old quick. \n\nRiding around on your bike is fun, but only until you're able to upgrade it enough that you can get decent speed and a fuel tank that doesn't require being refilled every five minutes. It's tedious in the beginning but will get better as you progress.\n\nThe graphics and atmosphere are good, but without missions or a main task to direct you, it feels very empty and exploring the world eventually becomes dull. Picking flowers, hunting animals, and reading memorial plaques can only keep you entertained for so long. \n\nCONS:\nThe main character (Deacon) is an emotionally stunted war veteran motorcycle loving tough-guy who can't get over his dead wife and spends all his time with his beer/shotgun loving MC buddy (Boozer) who is just as unlikable and emotionally awkward as Deacon. Throughout the story you learn that they are good guys, but they constantly act like a-holes and refuse to accept help from anyone (even each other) or talk about their emotions because they're so \"tough, hard, and badass\" that even showing a speck of weakness would be too much for them to handle. Deacon refuses to talk about his trauma and is constantly telling everyone to \"Shut up\" or \"Drop it\" when they try to talk to him about it, and the game prefers to show you pieces of his personality through flashbacks or random moments where he feels the need to save a helpless woman so he can look like a white knight.\n\nAside from the bugs and glitches, my biggest gripe is how boring, predictable and cheesy the storyline is + the AWFUL voice acting. I am a big fan of Sam Witwer and I think he does great work - but the direction they gave him was horrendous and I cringe at how some of his lines are delivered. The characters lack so much depth, making it very difficult to connect emotionally with any of them. So far, the only character I've genuinely liked is Boozer's dog (Jack). \n\nThis game is not awful, but it's decent at best. If you're looking to buy, wait until a sale and I would not pay more than $15 max. If you're looking to kill time and want to try something new, go for it, but don't expect it to blow your expectations out of the water.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This world is a graveyard and it does not care who dies next. You ride covered in blood and guts, smell death on the wind, and every step could be your last. I have seen bodies vanish into nothing, friends lost like they were never real, glitches that twist your mind, my bike stuck in mud, enemies crawling through walls, but you keep moving because standing still is a faster way to rot. Every fight leaves you raw, every shot echoes in your chest, and the forests and mountains watch like predators waiting for you to fall. It is ugly, it is endless, it is hopeless, and it chews on your soul until nothing feels real. Lives are lost, blood is spilled, nothing matters, and surviving it feels less like winning and more like dragging what is left of yourself through a world that has already died...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "awful tedious game that people pretend to like this game feels like i have been lobotomised playing this just feels like i am doing a task",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I don't know how this game has very positive reviews, maybe the story is soooooo good that it completely overshadows the terrible gunplay, stiff animations, weird sounding VA work (I do not know whether this is the VA's faults themselves, the equipment or just direction, maybe all three) and the terrible looking blood. I had just gotten past the tutorial already having massive doubts, but as soon as I walked down the stairs of the watchtower and Deacon just hovered down because there are no unique animations for walking up/down stairs and hills I immediately ALT+F4'd, requested a refund and wrote this review. I do not know if the other reviewers for this game somehow got a separate copy where the developers realised that humans do not use levitation to navigate stairwells or what because this is genuinely the worst example I have ever seen of reviews differing from reality.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i was intrigued when play station games started coming on pc and after playing the new god of war games, which i really enjoyed, i was ready to give more sony published games a chance. and since both survival horror and zombie games are genres i enjoy, i decided to start with days gone. all'n all not a horrible game, but the thing is it's barely a game, it's more like a long movie with playable cut scenes.\r\n\r\n the crafting system, if you can call it that, is lacking, half baked and redundant at the same time. the only thing that keeps you looting for things is the artificial cap on the amount of crafting components which you can carry which is btw ridiculous, like even after fully levelling up you can barely carry enough scrap to repair your melee weapon twice. speaking of levelling, its just like the crafting system, i'm certain if they would just remove levelling altogether, it would be an improvement to the game. the gun play is possibly the most generic (and i'm being kind) i have ever seen in a game ( guns have no weight, sound awful to shoot, aiming and handling are at best jank,etc); games like dead island and dying light which are meant to be primarily melee focused games, have way more engaging fire arm mechanics. and again with the artificial ammo limitation, the gun play just feels awful. like you'r telling me i can have only 5 sniper bullets at a time. and it's not like the melee is good either. honestly the only game play mechanic i liked was riding a bike, that's kinda telling that in an action adventure zombie game, that's the best quality. and to top it all off, most enemies you fight with and the majority of the story line is not even about zombies, it's all humans, to the point many time i genuinely forgot zombies even existed in the game.\r\nto sum it up, there is no game play. as i said it's for most parts a long movie. now that being said, it's not even a good movie, the sound tracks and music is serviceable and graphics i think is the highlight of the game. but you would think the \"game\" would have if not a good story, at least an engaging one. and there is a difference, i've seen plenty of movies and played games which i did not like the story of, for a variety of reasons yet still followed and engaged with. but here, it's just plain boring, and i don't mean geology documentary boring, i mean back of the math class 9 am algebra with the substitute teacher who barely speaks your language boring. like i could not even bring myself to dislike the story; i was so bored out of my mind i stopped playing at what i guess would be considered as the climax of the game, when the truth is unravelled to the protagonist and the stakes are highest. and let me tell you something, when i start a game i play it at the very least to the end of the main quest, i can not think of a single other game that i played halfway through and stopped, even if i hated it, if for nothing to at least see it end. there's more i can say about the game, like how it basically lies to you at the beginning, letting you think your choices matter with the camps or side activities like hunting are going to be a fun and rewarding part of the game, but i think i have wasted enough of my time with this game.\r\nworst part is that i got the game on a 20% discount and thought of it as a good deal. \r\nif you are looking for an extremely boring, poorly written and long zombie movie; i still would not suggest this, go watch zombie land.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☑ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☑ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☑ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is crashing often and upon starting it again it brings up only Error reporting screen. Timed my last in-game playtime to 24minutes before it crashed. My PC is not an issue, since I play other, even more resource-demanding games than this, with no problems whatsoever. It's really disappointing because I liked this game a lot when it came out. PC specs: Intel 14900K, 128 GB of DDR 5, GPU: NVidia GTX 4090.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "přivez droždí simulátor. největší mid AAA hra. Však už.\n\ntotální mid postavy\ntotální mid gameplay\ntotální mid infected\ntotální mid mise\ntotální mid crafting system\nzbytečně se natahuje hra jak natahuju kondom na čůrák\n\nnatankovat motorku a spravit je totální mrdka \npříběh omrzí jak omrzliny v mínus 20 stupních\nsaving napíču\nzabugované cutsceny\nzabugovaná hra -> mrdka\nzkurvení vlci a medvědi totální useless nic to nedává\nzkurvené hry co se natahujou jak zpomalený film\n\nradši si pusť Sons Of Anarchy\n\nStává se mi málo že nějakou hru nechci dohrát když si ji koupím. Ale tohle je ta mrdka. Tohle je ten klenot. Tohle je ten kus hovna",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is mid for a zombie game. Trailer shows battling horde of zombies, 36hrs in and still no zombie horde mission. Too many unskippable, walk for 10mins cutscenes. Progress is HELLA SLOW, can't even feel any change in gameplay for the skill/bike upgrades, weird voice acting, story pacing is WAY OVER THE PLACE. No wonder this game flopped so badly. Not worth buying full price and not worth wasting any more time with this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay-\r\n☐ Very good\r\n☐ Good\r\n☑ Nothing special\r\n☐ Okay\r\n☐ Bad\r\n\r\nGraphics-\r\n☐ Masterpiece\r\n☐ Beautiful\r\n☑ Good\r\n☐ Will do\r\n☐ Bad\r\n☐ Awful\r\n\r\nAudio\r\n☐ Amazing\r\n☑ Very good\r\n☐ Good\r\n☐ Decent\r\n☐ Not too bad\r\n☐ Bad\r\n\r\nAudience\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Everyone\r\n\r\nStory-\r\n☐ Lovely\r\n☐ Good\r\n☐ Average\r\n☑ Not great\r\n☐ None\r\n\r\nDifficult-\r\n☐ Just press a bunch of buttons\r\n☑ Easy\r\n☐ Significant brain usage\r\n☐ Easy to learn / Hard to master\r\n☐ Not so easy\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\nGrind-\r\n☐ Nothing\r\n☐ Only if you care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ A bit grindy sometimes\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ Insanity\r\n\r\nGame Time-\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ Depends on you\r\n☐ Endless\r\n\r\nPrice\r\n☐ Just buy it\r\n☐ Worth the price\r\n☐ Wait for sale\r\n☑ Maybe if you have some spare money left\r\n☐ Not recommended \r\n\r\nDays Gone is just fine, my biggest issue with it is the story. I honestly could care less about the characters, it takes some absolute bizarre choices at times and the cutscenes are so chopped together. It makes you feel like they spent all their time working on the only good part of the game; the hoardes, and 5 minutes on the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For me this was an utter disappointment. They went for a self serious tone similar to The Last Of Us but when combined with the goofy ass, borderline childish dialogue, and flimsy, unsatisfying gameplay, it just didn't work at for me at all. Even a tiny bit of self awareness would've gone a long way here. The dead pan delivery of the main character can only work in a game that is equally serious or if it is being done satirically. The game was also bug ridden as hell. Couldn't go 10 minutes without some wacky physics issue flipping my bike into the sky or some dialogue being out of sync or a character speaking too quickly over another character's dialogue.\n\nI'd list every issue with the game but honestly there are so many that I just can't be bothered to spend my time on it. I'll have spent more time on this review than the game itself. I guess one positive I can say for the game is the performance was [i]okay[/i]. Not incredible, but okay outside of a stutter here and there. And the horde mechanics (which I am yet to experience) looks pretty solid from what I've seen in trailers and in gameplay footage. In my 3 hours played I didn't get to a point where a horde came except for one in a cutscene. Outside of those few things, I really have nothing good to say about this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I was actually enjoying the game but I've just spent the last two hours trying to launch the game after turning my PC off last night. It appears the fix is to uninstall and reinstall the game every time you want to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring and repetitive. Slow and makes me yawn. Tedious and the voice over is really bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought the game on sale. \r\n\r\nIt just feels like RDR2 with zombies, a worse combat system and awful storytelling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another port that feels painfully sluggish and awkward on PC controls.  This game just felt gross.\n\nAlso, developers really need to figure out that people don't play video games to watch 7 minutes of cutscene, then control the character for 30 seconds just so they can watch another 7 minute cutscene.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game-play is perfectly fun and very serviceable, but the reddit-tier, anti-human writing/dialogue (think slop that a censored AI would plop out) sours it and drags it way down.\n\nNot a yes. Not a no. An 'only on sale'.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}