{
  "positive": [
    {
      "review": "Just played this game today with a bunch of friends and omg it was insanely fun. I haven't laughed this hard to where it aches my stomach to this extreme. I HIGHLY RECOMMEND if you're wanting a good friendly game to play with friends and family. EVERYONE WILL ENJOY IT!!!!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is an absolutely hilarious masterpiece of a party game that I feel like will stay hilarious for hours upon hours. Even as I'm writing this at 50 hours in I am still laughing my ass off even hopping in with even just one friend. The A.I. Computer players can sometimes go insane which just leads to more comical interactions. The Sound Effects are the right amount of goofy yet impactful which is also a small plus for me. Will definitely keep playing for as long as I can.\r\n\r\nP.S. Feesh",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I waited so long for this game to finally come out… but all my friends who promised to play with me are gone now. I don’t regret buying it, though. I’m still waiting for them.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Good with friends, many different game modes to choose from, pretty casual and random but has some stuff you can definitely learn. \nThe different game modes are:\n- Team PvP maps.\n- Team objectives (football, hockey, fuel train, etc).\n- Smash mode, consisting of 6 rounds with one PvP map per round, where each team is 2 players and there is modifiers, so you can make a quick build.\n- A few singleplayer maps.\n- Racing Nemo Kart with good mechanics and different cars even tho kinda disbalanced, and it seems to be in eternal beta since release.\n- Lobby games (\"Among Us\" like, infection, naval fight, etc).\n- Multiplayer cabin to hang out with friends while playing tabletop games, fishing, drinking, having fun, chillin, etc.\n\n\n     Generally the game gets constant updates with new maps, game modes, animals, skins, events (Halloween, Christmas, Easter, custom, etc), Battlepasses (were mostly free), etc. There is lots of different animals, their skins, cars and other stuff that you can obtain in the in-game shop or vending machine with in-game currency, also from achievements, codes, events, collabs, physical collectible cards that come with skin codes and other methods.\n\n     The devs' communication can be lacking at times, and some modes need updates. The game is pretty casual but has very known tryhards in the community who seems all they can do in their life is as a team beating low level players. Also not great matchmaking tho, matching against same players, or worse, always giving you a random low level against a full team of max levels if you are not searching as a full 4 player team.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "funny and silly animals, and its more even more fun with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Colosseum of wobbly super cute violent plushies. Trust no one! \r\n\r\nLove the game, I've been playing it since day one, still going strong. They have added a lot more games and events; I wish they add more Nemo Cart maps, though!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i highly recommend this game its very addicting although sadly there are more bad people on this game than good people but otherwise good fighting game and good game to chill",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is great when you get back from work and just want something quick to play that actually makes you laugh. It's fun and cute❤️",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Funny game to play with some friends. In addition, I can mention very good racing mini games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love how the characters look so cute and fluffy with cute outfits/IP collabs! Even the new game modes being added from time to time is super fun. The only thing that is a drag about this game is how long a single game can be when I just want to get my dailies done. My thumbs hurt!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really love how competitive this game can be, but its not as stressful as other competitive games. The physics are goofy and cartoony, so it feels like I can have fun. \r\nThe only complaint I have is that there isn't enough maps, and we need new content. The only stuff they constantly change is the animals and their outfits. I'd really love to see more maps and games available soon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fall guys but make it cute + w+ having fun+ 0 disapointment + totally worth+ ty mtd + gigachad",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very funny with friends, easy to play, can only recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I just left a thumbs up cause there's no in between option but my opinion. The game itself is great but I mainly gotta say, don't play this game unless you're playing with your friends. I had the opinion before but now it's really more my opinion cause around when I'm writing this, it's been a WHOLE WEEK of random players(different ones at different times mainly) that I'm on their team but they keep knocking me out and tossing me into pits or off edges that k.o me every single round.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game but plz let friend pass players buy stuff in the fishing shop",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "could use some more mods and customization options in a custom lobby but its fun! and silly core",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love being cabbage in a game, an i love beatin people up. so fun. 420 hours. awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun Co-op game with mic and chat!!! love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "originally played this via gamepass but purchased on steam  not long before it left as i knew it was a good fun brawler..\nonly gripe is that i wish they'd add  more multiplayer maps for last stand  (fingers crossed!) instead of game modes no one really plays.. , once you get past the initial skill issues for controls it's a good fun romp with others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really great, there are many different game modes to play with your friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with friends! Many diff game modes, from brawler to kart racing to team games to among us to fishing or just playing card games in the cabin, and more.. there's something for everyone! (and devs keep adding new modes!) Constantly adding new animals and outfits / skins and seasonal events too! Highly recommend, fun for all!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Party Animals combines Human Fall Flat and Gang Beasts, but overall features more content than both of those games. It might be jank at times, but's that's apart of the charm. This is one of the few games that has a developing team that legitimately listens and engages with its community, and it puts a smile on my face to see.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a very, very, very cute animal, you're gonna have to fight nail and tooth and be a jerk to win, but it's okay... sometimes you just gotta <3\n\n(Jokes aside, I'd definitely recommend this game! It's very chaotic and fun, action goes on everywhere no matter what mode your playing (last stand, duos/squads/teams, smash, Nemo kart, etc etc). By playing, you can progress through levels and earn certain awards like outfits and in-game currency, and yeah... you're either gonna meet pretty sweet people (it's a good feeling) or others that are extremely competitive, but I'd say it's good overall! Buy the game for the sweet dog Nemo... I don't think you're gonna regret it. This game has me in a chokehold, aha)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game ive been playing for a long time and its fun would reccomond five star review",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun with friends and fun to play alone if you dont have any friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's such a nice little game! all the characters are cute and I have soooo much fun playing with friends, as well as playing alone. highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an awesome game to play with friends. Includes very creative levels and game modes that will make you laugh non stop. I really wish the debs create new levels more often instead of skins. Highly recommended anyway!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fun. Playing this with friends will have you competitive and laughing for hours. I recommend this for anyone who loves cute animals/is a collector of skins. LOVE IT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun to play with friends, stay away from celebrity twitch streamers and you're going to be okay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend this game as provides a lot of hours for fun and I can share with so many people arround the globe.\r\nThe experience of fighting with cute animals is simply amazing and funny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WARNING: If you want to laugh till you roll of your chair, play this game with your friends!!\n\nAll the different modes along with those cute ragdoll physics, Party Animals is certainly one of the best party games out there....🤣😂",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really fun game! gives off human fall flat vibes... well obviously! the controls are hard to get used too but it isn't too difficult! overall I really enjoy it and I love the characters but I feel like there should totally be more outfits available especially for the new characters!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its gang beasts but if gang beasts had mario kart, among us, furries, a battlepass, gambling and steroids. very good 8.5 out of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best couch co op/ multiplayer games to have senseless fights ! The devs are amazing adding other game modes! Smash game mode have been my go to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is hilarious. Whenever I need a good laugh, I just play Party Animals!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funny game to play with some friends. In addition, I can mention very good racing mini games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "es un juego didactico y muy divertido para jugar con familia y amigos, les recomiendo jugar con chat de voz es muy divertido y gracioso quiero jugarlo todos los dias porfavor ponganlo gratis para mis amigos gracias por leerme.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The perfect casual game. Just beat the living snot out of your cute fluffy selves, then go go karting and end it off with some board games. If I was to buy one game to play for an entire year, it would be this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the funniest and best games for play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this silly little aminal game. it's changed so much from the concept and in the best of ways. there are so many new game modes and just adds to the silliness of everything. love love love.\n\nedit: The friend pass sucks though. only one friend can join the game on the friend pass at a time. Which makes sense, cost-wise. It would help a lot if the store page was more descriptive of the limitations with the friend pass.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's hard to get your friend around for a game as you grow older so always appreciate the time when yall having fun and enjoy the moment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is hilarious! I also love the fishing. It’s very calming and relaxing with the right people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is pretty much that \"funny, bit over the top\" party game you think it is unfortunately it can get quite repetetie. It has a few modes but most of them are just variations so if you are already tried of the main game mode it can be pretty dissapoiting. Fortunatley there is also an \"Among Us mode\" but that also already has more or less a variation and a Mario Kart clone .... I mean \"run racer\" mode which is fine but not enough maps, overall it seems like they have good ideas but have a hard time to stay with something and really refine it which is quite unfortunate. Ohhh and of course a little cozy side mode where you can play some minigames and now fishing. I suppose overall you can say it's wide but not that deep, something to play from time to time but nothing that really keeps you comming back unless you are into endless grind for new costumes/characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute game to play with your friends while still being a little on the competitive side.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a great game to play with friends on a couch, only to part ways as sworn enemies.\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funky physics, Great game, Cute outfit. 10/10 would buy for a friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good solid fun game for online and co-op play with easy to follow but hard to master mechanics and decent variety. I wish there were no restrictions to the number of modes where couch co-op is allowed, but this is a minor inconvience. Overall, very positive experience with this product and would recommend to others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game fun with or without friends its funny overall a very great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's very fun with friends and AI i bought PJ Fluffy and had a great time with a blast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While certainly not the first to do this? This game is fun just about for anyone be they seasoned gamers or novices like myself. If you're looking for a game you can kill some time to with some god friends? This is the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun silly game where you can play as different animals to beat up your enemies. What more could you possibly want?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you want to make your girlfriend happy after you've been gaming for 8 hours and (ignoring her) buy this game and play with her and she'll forgive..... maybe... hopefully..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a game where gordon freeman can kill darth vader on a submerine. pretty cool.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A true masterpiece, great when playing with randoms, amazing when playing with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun for friends! Absolutely fantastic and funny!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is always a good time when you dropkick your friend of a jet or a mountain or even \"try\" to work together for the big gummy bear",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Punch friends and proceed to yeet them to their deaths, 10 stars would buy again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute animals ✅\r\nChaotic fights ✅\r\nBrain cells not needed ✅\r\nFriendships tested ✅\r\n\r\n10/10 would punch a panda again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS IS MY 1ST GAME TO PURCHASE IN STEAM BECZZ MY MOST FAVOURITE PC GAME.WHEN I GOT STRESS AND DEPRESSED I USED TO PLAY THIS GAME VERY ENJOYABLE,CALMEST,RELAXING GAME IN MY LIFE TIME. THANK U...🔥💯❤️♾️",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Roadhouse, but with animals and less McGregor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun to play with friends and partner. Need to add more game quest heheh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute and silly casual game to play with your friends :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really cool game, i killed my family then laughed after i installed party animals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even loosing is fun in this game! There are soooo many skins and game modes :D you should get this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "highly recommended! fun, chaotic, and addictive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game was somehow too hard for the people I was with. They gave up instantly, otherwise it's good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game but it makes you break your keyboard. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really nice game, there is so many mode you can play in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Since demo I played until official version, it’s more fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very fun to be a fat cow that kills other animals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game love how it hooks line and sinctors you in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the pig in this is funny and rad its cos it has that dog in it like 67 labubu",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for friends or solo! A more refined gang beasts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has a cute animals and that's all it matters",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "id recomend not playing this if you dont like sweats but across from that this game is AMAZINGGGGG!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "LMFAO I CAN'T BREATHE, OH SEND HELP I HAVEN'T LAUGHED THIS MUCH IN YEARS!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best PvP time-killer if you are looking for some addictive and funny and challenging gameplay!\nThe only disadvantage - hard to stop trying \"one more round\"..\nP.S. Fishing season just ended.. yes, fishing different creatures also possible here along with collecting different pets and their costmes, not obvious but each cratue has its own weight/strength/stamina/health, very fun to discover",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Heck of a good time with friends. And for legal age drinking adults...a great game to play while drinking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games inside of games and they are all fun solo or with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes i would recommend this game to other players because its just a fun party game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is peak it can be a lot of things in good way there's mode to chill and fish there's among us like mode,hide and seek,mario kart,and a lot other fun fighting modes the animals are cute and the skins are cool a little bit expansive you know how gaming it is these days also it needs more maps other than that its cool and clean game 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is a bit complicated than I expected but once you know it, its pretty addicting. The only concerns I have is that the default key-binds suck ass on the controller. Game is also regularly updated too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, especially with friends. Only problem is these errors on logging in is a problem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive just to throw punches around. I like that its actually fun to play not just playing for cosmetics. Funny moments",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really fun game for those times you wanna break your mouse",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game that you can play with your friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "친구랑 하는데 드롭킥 한 대 잘못맞으면 살려달라고 애처롭게 빌어야 함...\r\n제발 한 번만 살려주세요 형님",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i lov this game its so silly give me headache from laugh too much... recommend yes yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute n fun. it would be good if u make a house. i wanna decorate a house and stay there in my resting time. 🌝",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing game to play with friends! takes skill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ever had some shrooms and walked outside to pet ur cat, this is that cranked up to 11",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goofy but gang beasts is still baller",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good,good good good good good good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very funny with friends, easy to play . i like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, it’s cute and fun! Love beating my friends up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun to play with friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is fun to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "threw a child into boiling lava as he yelled at the top of his lungs over open mic 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to play with friends",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I appreciate the idea and generosity of the friend pass but I would have liked to know that only one friends pass player can be 'referred' into a lobby at once. Instead you get a vague connection error that doesn't explain anything when you try to join. Finding out after wasting me and my friends time trying to diagnose our own PCs that its actually part of the monetization scheme feels kinda disrespectful. I'm sure its unintentional, since it would just be better if I was told upfront that its a friend pass issue.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Unfortunately over half of the content doesn't support local multiplayer. Modes such as racing and many other are not available for whatever reason. Racing actually is available... just only for 2 people at once..???",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the combat sucks,\nthe knock of mario kart game is painfully underdeveloped\ni feel its trying to be to many things and not doing any of it all that well",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just waiting forever in matchmaking and then rage quitting the game after waiting 15 minutes for no matches.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cute character designs.\r\n\r\nI don't like the cash shop/store where you can't unlock the animals you want unless they happen to come up at the time you are checking out the store, and you have the funds for them. My favorite animal, the Raven, has no outfit/skin options compared to other animals. There should be care put into every possible character and they should all have equal amounts of outfits/skins. I would have to wait for a maximum possible two weeks to have the animal I want possibly show up again in the store. I don't have time to be checking in constantly. I want to play the character I want from the start.\r\n\r\nI don't like how you're forced to play the Corgi animal in the tutorials and can't choose your character. I don't like how the loading screens don't have your chosen character, and default to animals you might not really care for.\r\n\r\nI don't like the controls. They're really clumsy and frustrating and confusing. The UI is a console-oriented, side-scrolling mess. Clicking around and trying to find certain areas was really unintuitive.\r\n\r\nI found myself wanting my Quick Match multiplayer games to be over far sooner. They were tedious and un-fun. \r\n\r\nI returned the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Always online requirement and no way to pause in a couch multiplayer session are really killing my enjoyment of this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It may look like a chill game but it's actually infested with sweat slimy dorks that abuse the constant lag. Want a real chill funny exp? go for Human Fall Flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mmmm one of the most greedy games out there. The gameplay its good.. but the past year the halloween skin were free to get with missions and and now each one cost 6k cookies and the new halloween eggs thing started for the same price (1coin) like the normal egg machine. and then they added an extra 120 cash price (1coin+120cash each try) at the second half of duration of the halloween egg machine event.\nI love halloween events and i hate greedy shit like this so i just vent out that i cant respect the devs with this behaviour.. \n\nPlus the game have long term periods searching for matches on all servers, it shouldnt be more than 1 minute... put me with bots please.. you already do but at least i dont have to wait more than 4 minutes, its disrespectful the amount of time we have to wait..\n\nALSO THE BOTS SHOULD BE ABLE TO VOTE WTF!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda mid. \n\nNothing much to say. Its not bad but not good either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't get skins from past battle passes.  Means you have a predatory must buy everything now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is terrible.\n\nIt's filled with microtransactions, loot boxes (gambling in a family friendly game), and it is riddled with FOMO. \n\nI purchased it assuming it would be a \"party\" game as the name implies. Something simple, cute, and fun to enjoy with friends. \n\nHowever, if you want to unlock any skin or cosmetic for fun. You're forced to play with random people in \"Quick Play\", or buy it as a microtransaction. \n\nPlaying with random people is miserable, and in general it makes the game extremely unpleasant. Almost nothing can be unlocked through just playing with friends.\n\nOverall, it feels awful how heavily this game pushes you to spend real money to purchase skins. With the only other way to unlock things being leveling up very slowly. Which mainly happens in the \"Quick Play\" mode. With bad teammates, terrible game-modes/maps/mechanics, and poor balance (goofy physics shouldn't be made competitive).\n\nIt could've been a great game to play among friends, but only if you could unlock things, and complete achievements with that group of friends. Instead of having to rely on random players in \"Quick Play\".\n\nNot recommended.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "快跑！\nRun!\n逃げろ！\n도망쳐!\nLauf!\nRen weg!\nCours !\n¡Corre!\nCorre!\nCorri!\nSpring!\nLøp!\nLøb!\nБеги!\nБіжи!\nBiegnij!\nUtíkej!\nاِهْرُب!\nKoş!\nभागो!\nদৌড়াও!\nبھاگو!\nหนีไป!\nChạy đi!\nLari!\nΤρέξε!\nFuge!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Friend pass is so limited, the Lab games suck (besides the Mario Kart clone), I want this game to be so much better but it just isn't right now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Weird liveservice stuff in a party game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont get it for your girlfriend its all she'll ever want to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "rigged to play. only fun for 20 ,ims",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Party Animals Review: Who Asked for More 4v4?!\r\n\r\nParty Animals, I love you, but why do you keep making decisions that feel like they came from a committee of overcaffeinated pigeons?\r\n\r\nLet’s talk about the newest “brilliant” idea: wildly increasing the rate of 4v4 matches in Fight Mode while burying 2vs2vs2vs2 games like they’re some ancient relic nobody asked for. Who thought this was the move? Who woke up and decided, “You know what people definitely want? Less chaos, fewer teams, and more lopsided steamrolls!” Because it sure wasn’t the players.\r\n\r\nThe entire charm of Party Animals' Fight Mode is the carnage. The mayhem. The feeling that at any moment your so-called teammate might throw you off the map, whether by accident or straight-up betrayal. In 2vs2vs2vs2, every match is a swirling mess of alliances, backstabs, and split-second chaos. It’s unpredictable. It’s hilarious. It’s the reason people hit “Play Again.”\r\n\r\nBut now? Matchmaking feels like it’s forcing us into an endless loop of generic 4v4 teamfights where half the lobby disconnects the moment they see their team is losing by more than one point. It’s slower, more sweaty, more one-sided, and honestly… just less Party Animals. It’s like taking Mario Kart and replacing half the items with bananas. Technically still fun, but c’mon.\r\n\r\nIf the devs wanted to “fix” anything, maybe they could fix hit registration, server stability, or that timeless classic: randomly ragdolling into the stratosphere. But no—let’s adjust the ratio of fun modes downward. Genius.\r\n\r\nBring back the chaos. Bring back the party. Bring back the 2vs2vs2vs2 fights that make this game what it is. Until then, Fight Mode is starting to feel a lot less like a party… and a lot more like a committee meeting.\r\n\r\nDo better, Party Animals. We believe in you. Don’t make us believe ironically.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Long matchmaking",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BIG SHIT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many bugs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This shit fell off so hard bro. This game used to be so fun and they removed everything silly about it.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "I appreciate the idea and generosity of the friend pass but I would have liked to know that only one friends pass player can be 'referred' into a lobby at once. Instead you get a vague connection error that doesn't explain anything when you try to join. Finding out after wasting me and my friends time trying to diagnose our own PCs that its actually part of the monetization scheme feels kinda disrespectful. I'm sure its unintentional, since it would just be better if I was told upfront that its a friend pass issue.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "I RECOMMEND IT, but here I marked it negative to alert you to problems.\n\nI play through GamePass, here I only play the demo.\nBut the amount of cheaters and macro players in this game is bizarre. It seems like the more casual the game, the more these losers there are.\nWhat's worse is that it will soon be free and the situation will get even bad",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I want to like this game I really do. It's cute and funny but absolutely everything is server sided, making it's near unplayable in anything that consists of fighting or racing. Especially the nemo kart. Racing games just can't work if kart controls are server sided for people with high ping. I came back to give the game a try again after a very long time and even still I have disconnects and those lag issues persist. I'm sure for players who live relatively close to servers will have a fantastic time but I honestly can't recommend this game for people at 150ms+",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Unfortunately over half of the content doesn't support local multiplayer. Modes such as racing and many other are not available for whatever reason. Racing actually is available... just only for 2 people at once..???",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This was a good game like 2 years ago, but now it's gotten worse\nThis game gives me HIGH PINGS, which makes it slow and unplayable\nwith high pings you can't jump far, punch faster, fling and so on, but your opponents can do all that, UNFAIR is a small word\n\nALSO THIS GAME REMOVED BLOCK FEATURE, so you have to play with stoopid people even though you don't want to, BRUH>>>\n\nAlso you'll find very toxic people in this game, mostly form countries like korea and china, playing with ping advantage, and dare to make fun of other gamers, shame of you if you are that person, let people enjoy their game, keep your toxicity at home\n\nEven with ping advantage if you spam punches and headbutts, and flex, please make a SPAMMER tattoo on your forehead, make your parents proud :)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the combat sucks,\nthe knock of mario kart game is painfully underdeveloped\ni feel its trying to be to many things and not doing any of it all that well",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just waiting forever in matchmaking and then rage quitting the game after waiting 15 minutes for no matches.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cute character designs.\r\n\r\nI don't like the cash shop/store where you can't unlock the animals you want unless they happen to come up at the time you are checking out the store, and you have the funds for them. My favorite animal, the Raven, has no outfit/skin options compared to other animals. There should be care put into every possible character and they should all have equal amounts of outfits/skins. I would have to wait for a maximum possible two weeks to have the animal I want possibly show up again in the store. I don't have time to be checking in constantly. I want to play the character I want from the start.\r\n\r\nI don't like how you're forced to play the Corgi animal in the tutorials and can't choose your character. I don't like how the loading screens don't have your chosen character, and default to animals you might not really care for.\r\n\r\nI don't like the controls. They're really clumsy and frustrating and confusing. The UI is a console-oriented, side-scrolling mess. Clicking around and trying to find certain areas was really unintuitive.\r\n\r\nI found myself wanting my Quick Match multiplayer games to be over far sooner. They were tedious and un-fun. \r\n\r\nI returned the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They removed the feature that allowed adding multiple friends who use the Friends Pass in the game. L game👎",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is everything that is wrong with the video game industry.\nmicrotransactions. live service. gambling / gacha. shamelessly copying a multitude of other original games. trying to be a \"this is the only game you'll ever need to play!\" but it's all so much worse.\na ragdoll physics engine is the worst framework to put all of this stuff in. it feels like the game just ignores half of my inputs. there are awful game design decisions everywhere. and yet this game gets a multi-million dollar budget and an advertising spot at the summer game fest.\nall this game needed to be was a decent party game. but it's bland, underbaked, and repetitive. rounds last too long. it feels like half of your button inputs are ignored. mechanics stop working for no discernable reason. you'll instantly die in areas where you should have a buffer time to recover. everything is just janky in a way that is so much more frustrating than fun.\nplease just save yourself time and money by playing gang beasts, webfishing, mario kart, duck game, and buckshot roulette. those games actually have a vision and strive to execute on their ideas flawlessly. with party animals, all you'll ever get is disappointment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is really fun with friends and we have a great time every time we play.\n\nMy one and only issue are the excruciatingly long matchmaking times. We just sat in the queue for over 5min and got bored.\n\nEDIT:\nAs of today 13/09/2025 the matchmaking is still painfully long. 5-10mins. Additionally I got thrown out of a game session due to a server issue or something and the game decided to punish me with a 2min matchmaking ban.\n\nMy friends also got 2min bans each earlier today. But in their case they received their bans one at a time. Friend A had their 2 min ban first, then friend B got theirs after friend A had suffered their ban.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Always online requirement and no way to pause in a couch multiplayer session are really killing my enjoyment of this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It may look like a chill game but it's actually infested with sweat slimy dorks that abuse the constant lag. Want a real chill funny exp? go for Human Fall Flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mmmm one of the most greedy games out there. The gameplay its good.. but the past year the halloween skin were free to get with missions and and now each one cost 6k cookies and the new halloween eggs thing started for the same price (1coin) like the normal egg machine. and then they added an extra 120 cash price (1coin+120cash each try) at the second half of duration of the halloween egg machine event.\nI love halloween events and i hate greedy shit like this so i just vent out that i cant respect the devs with this behaviour.. \n\nPlus the game have long term periods searching for matches on all servers, it shouldnt be more than 1 minute... put me with bots please.. you already do but at least i dont have to wait more than 4 minutes, its disrespectful the amount of time we have to wait..\n\nALSO THE BOTS SHOULD BE ABLE TO VOTE WTF!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda mid. \n\nNothing much to say. Its not bad but not good either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yall need listen more to the community and add more game modes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game crashes often, often errors, servers gets unavailable time to time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dead game, zero updates or any type of new maps etc. seems as if the devs only care about micro transactions and not gameplay. fun for one round and then the same map rotation every other time. LIterally the most greedy dev team ive ever seen. EA level greed.  I gave this game MONTHS since the last time i played and came back to NOTHING but \"skins\" yikes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't get skins from past battle passes.  Means you have a predatory must buy everything now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is terrible.\n\nIt's filled with microtransactions, loot boxes (gambling in a family friendly game), and it is riddled with FOMO. \n\nI purchased it assuming it would be a \"party\" game as the name implies. Something simple, cute, and fun to enjoy with friends. \n\nHowever, if you want to unlock any skin or cosmetic for fun. You're forced to play with random people in \"Quick Play\", or buy it as a microtransaction. \n\nPlaying with random people is miserable, and in general it makes the game extremely unpleasant. Almost nothing can be unlocked through just playing with friends.\n\nOverall, it feels awful how heavily this game pushes you to spend real money to purchase skins. With the only other way to unlock things being leveling up very slowly. Which mainly happens in the \"Quick Play\" mode. With bad teammates, terrible game-modes/maps/mechanics, and poor balance (goofy physics shouldn't be made competitive).\n\nIt could've been a great game to play among friends, but only if you could unlock things, and complete achievements with that group of friends. Instead of having to rely on random players in \"Quick Play\".\n\nNot recommended.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "快跑！\nRun!\n逃げろ！\n도망쳐!\nLauf!\nRen weg!\nCours !\n¡Corre!\nCorre!\nCorri!\nSpring!\nLøp!\nLøb!\nБеги!\nБіжи!\nBiegnij!\nUtíkej!\nاِهْرُب!\nKoş!\nभागो!\nদৌড়াও!\nبھاگو!\nหนีไป!\nChạy đi!\nLari!\nΤρέξε!\nFuge!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Friend pass is so limited, the Lab games suck (besides the Mario Kart clone), I want this game to be so much better but it just isn't right now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Weird liveservice stuff in a party game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont get it for your girlfriend its all she'll ever want to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "rigged to play. only fun for 20 ,ims",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Party Animals Review: Who Asked for More 4v4?!\r\n\r\nParty Animals, I love you, but why do you keep making decisions that feel like they came from a committee of overcaffeinated pigeons?\r\n\r\nLet’s talk about the newest “brilliant” idea: wildly increasing the rate of 4v4 matches in Fight Mode while burying 2vs2vs2vs2 games like they’re some ancient relic nobody asked for. Who thought this was the move? Who woke up and decided, “You know what people definitely want? Less chaos, fewer teams, and more lopsided steamrolls!” Because it sure wasn’t the players.\r\n\r\nThe entire charm of Party Animals' Fight Mode is the carnage. The mayhem. The feeling that at any moment your so-called teammate might throw you off the map, whether by accident or straight-up betrayal. In 2vs2vs2vs2, every match is a swirling mess of alliances, backstabs, and split-second chaos. It’s unpredictable. It’s hilarious. It’s the reason people hit “Play Again.”\r\n\r\nBut now? Matchmaking feels like it’s forcing us into an endless loop of generic 4v4 teamfights where half the lobby disconnects the moment they see their team is losing by more than one point. It’s slower, more sweaty, more one-sided, and honestly… just less Party Animals. It’s like taking Mario Kart and replacing half the items with bananas. Technically still fun, but c’mon.\r\n\r\nIf the devs wanted to “fix” anything, maybe they could fix hit registration, server stability, or that timeless classic: randomly ragdolling into the stratosphere. But no—let’s adjust the ratio of fun modes downward. Genius.\r\n\r\nBring back the chaos. Bring back the party. Bring back the 2vs2vs2vs2 fights that make this game what it is. Until then, Fight Mode is starting to feel a lot less like a party… and a lot more like a committee meeting.\r\n\r\nDo better, Party Animals. We believe in you. Don’t make us believe ironically.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Long matchmaking",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BIG SHIT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many bugs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This shit fell off so hard bro. This game used to be so fun and they removed everything silly about it.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "I appreciate the idea and generosity of the friend pass but I would have liked to know that only one friends pass player can be 'referred' into a lobby at once. Instead you get a vague connection error that doesn't explain anything when you try to join. Finding out after wasting me and my friends time trying to diagnose our own PCs that its actually part of the monetization scheme feels kinda disrespectful. I'm sure its unintentional, since it would just be better if I was told upfront that its a friend pass issue.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "I RECOMMEND IT, but here I marked it negative to alert you to problems.\n\nI play through GamePass, here I only play the demo.\nBut the amount of cheaters and macro players in this game is bizarre. It seems like the more casual the game, the more these losers there are.\nWhat's worse is that it will soon be free and the situation will get even bad",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I want to like this game I really do. It's cute and funny but absolutely everything is server sided, making it's near unplayable in anything that consists of fighting or racing. Especially the nemo kart. Racing games just can't work if kart controls are server sided for people with high ping. I came back to give the game a try again after a very long time and even still I have disconnects and those lag issues persist. I'm sure for players who live relatively close to servers will have a fantastic time but I honestly can't recommend this game for people at 150ms+",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Unfortunately over half of the content doesn't support local multiplayer. Modes such as racing and many other are not available for whatever reason. Racing actually is available... just only for 2 people at once..???",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This was a good game like 2 years ago, but now it's gotten worse\nThis game gives me HIGH PINGS, which makes it slow and unplayable\nwith high pings you can't jump far, punch faster, fling and so on, but your opponents can do all that, UNFAIR is a small word\n\nALSO THIS GAME REMOVED BLOCK FEATURE, so you have to play with stoopid people even though you don't want to, BRUH>>>\n\nAlso you'll find very toxic people in this game, mostly form countries like korea and china, playing with ping advantage, and dare to make fun of other gamers, shame of you if you are that person, let people enjoy their game, keep your toxicity at home\n\nEven with ping advantage if you spam punches and headbutts, and flex, please make a SPAMMER tattoo on your forehead, make your parents proud :)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the combat sucks,\nthe knock of mario kart game is painfully underdeveloped\ni feel its trying to be to many things and not doing any of it all that well",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just waiting forever in matchmaking and then rage quitting the game after waiting 15 minutes for no matches.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cute character designs.\r\n\r\nI don't like the cash shop/store where you can't unlock the animals you want unless they happen to come up at the time you are checking out the store, and you have the funds for them. My favorite animal, the Raven, has no outfit/skin options compared to other animals. There should be care put into every possible character and they should all have equal amounts of outfits/skins. I would have to wait for a maximum possible two weeks to have the animal I want possibly show up again in the store. I don't have time to be checking in constantly. I want to play the character I want from the start.\r\n\r\nI don't like how you're forced to play the Corgi animal in the tutorials and can't choose your character. I don't like how the loading screens don't have your chosen character, and default to animals you might not really care for.\r\n\r\nI don't like the controls. They're really clumsy and frustrating and confusing. The UI is a console-oriented, side-scrolling mess. Clicking around and trying to find certain areas was really unintuitive.\r\n\r\nI found myself wanting my Quick Match multiplayer games to be over far sooner. They were tedious and un-fun. \r\n\r\nI returned the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They removed the feature that allowed adding multiple friends who use the Friends Pass in the game. L game👎",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is everything that is wrong with the video game industry.\nmicrotransactions. live service. gambling / gacha. shamelessly copying a multitude of other original games. trying to be a \"this is the only game you'll ever need to play!\" but it's all so much worse.\na ragdoll physics engine is the worst framework to put all of this stuff in. it feels like the game just ignores half of my inputs. there are awful game design decisions everywhere. and yet this game gets a multi-million dollar budget and an advertising spot at the summer game fest.\nall this game needed to be was a decent party game. but it's bland, underbaked, and repetitive. rounds last too long. it feels like half of your button inputs are ignored. mechanics stop working for no discernable reason. you'll instantly die in areas where you should have a buffer time to recover. everything is just janky in a way that is so much more frustrating than fun.\nplease just save yourself time and money by playing gang beasts, webfishing, mario kart, duck game, and buckshot roulette. those games actually have a vision and strive to execute on their ideas flawlessly. with party animals, all you'll ever get is disappointment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is really fun with friends and we have a great time every time we play.\n\nMy one and only issue are the excruciatingly long matchmaking times. We just sat in the queue for over 5min and got bored.\n\nEDIT:\nAs of today 13/09/2025 the matchmaking is still painfully long. 5-10mins. Additionally I got thrown out of a game session due to a server issue or something and the game decided to punish me with a 2min matchmaking ban.\n\nMy friends also got 2min bans each earlier today. But in their case they received their bans one at a time. Friend A had their 2 min ban first, then friend B got theirs after friend A had suffered their ban.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Always online requirement and no way to pause in a couch multiplayer session are really killing my enjoyment of this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'll be so real. The game is fun, but the controls are so unresponsive and janky that many games often come down solely to ping. If you have a history of heart attacks, strokes, or The Rage, I recommend staying FAR away from this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It may look like a chill game but it's actually infested with sweat slimy dorks that abuse the constant lag. Want a real chill funny exp? go for Human Fall Flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mmmm one of the most greedy games out there. The gameplay its good.. but the past year the halloween skin were free to get with missions and and now each one cost 6k cookies and the new halloween eggs thing started for the same price (1coin) like the normal egg machine. and then they added an extra 120 cash price (1coin+120cash each try) at the second half of duration of the halloween egg machine event.\nI love halloween events and i hate greedy shit like this so i just vent out that i cant respect the devs with this behaviour.. \n\nPlus the game have long term periods searching for matches on all servers, it shouldnt be more than 1 minute... put me with bots please.. you already do but at least i dont have to wait more than 4 minutes, its disrespectful the amount of time we have to wait..\n\nALSO THE BOTS SHOULD BE ABLE TO VOTE WTF!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda mid. \n\nNothing much to say. Its not bad but not good either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yall need listen more to the community and add more game modes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game crashes often, often errors, servers gets unavailable time to time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dead game, zero updates or any type of new maps etc. seems as if the devs only care about micro transactions and not gameplay. fun for one round and then the same map rotation every other time. LIterally the most greedy dev team ive ever seen. EA level greed.  I gave this game MONTHS since the last time i played and came back to NOTHING but \"skins\" yikes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't get skins from past battle passes.  Means you have a predatory must buy everything now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is terrible.\n\nIt's filled with microtransactions, loot boxes (gambling in a family friendly game), and it is riddled with FOMO. \n\nI purchased it assuming it would be a \"party\" game as the name implies. Something simple, cute, and fun to enjoy with friends. \n\nHowever, if you want to unlock any skin or cosmetic for fun. You're forced to play with random people in \"Quick Play\", or buy it as a microtransaction. \n\nPlaying with random people is miserable, and in general it makes the game extremely unpleasant. Almost nothing can be unlocked through just playing with friends.\n\nOverall, it feels awful how heavily this game pushes you to spend real money to purchase skins. With the only other way to unlock things being leveling up very slowly. Which mainly happens in the \"Quick Play\" mode. With bad teammates, terrible game-modes/maps/mechanics, and poor balance (goofy physics shouldn't be made competitive).\n\nIt could've been a great game to play among friends, but only if you could unlock things, and complete achievements with that group of friends. Instead of having to rely on random players in \"Quick Play\".\n\nNot recommended.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "快跑！\nRun!\n逃げろ！\n도망쳐!\nLauf!\nRen weg!\nCours !\n¡Corre!\nCorre!\nCorri!\nSpring!\nLøp!\nLøb!\nБеги!\nБіжи!\nBiegnij!\nUtíkej!\nاِهْرُب!\nKoş!\nभागो!\nদৌড়াও!\nبھاگو!\nหนีไป!\nChạy đi!\nLari!\nΤρέξε!\nFuge!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Friend pass is so limited, the Lab games suck (besides the Mario Kart clone), I want this game to be so much better but it just isn't right now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Weird liveservice stuff in a party game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont get it for your girlfriend its all she'll ever want to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "rigged to play. only fun for 20 ,ims",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Party Animals Review: Who Asked for More 4v4?!\r\n\r\nParty Animals, I love you, but why do you keep making decisions that feel like they came from a committee of overcaffeinated pigeons?\r\n\r\nLet’s talk about the newest “brilliant” idea: wildly increasing the rate of 4v4 matches in Fight Mode while burying 2vs2vs2vs2 games like they’re some ancient relic nobody asked for. Who thought this was the move? Who woke up and decided, “You know what people definitely want? Less chaos, fewer teams, and more lopsided steamrolls!” Because it sure wasn’t the players.\r\n\r\nThe entire charm of Party Animals' Fight Mode is the carnage. The mayhem. The feeling that at any moment your so-called teammate might throw you off the map, whether by accident or straight-up betrayal. In 2vs2vs2vs2, every match is a swirling mess of alliances, backstabs, and split-second chaos. It’s unpredictable. It’s hilarious. It’s the reason people hit “Play Again.”\r\n\r\nBut now? Matchmaking feels like it’s forcing us into an endless loop of generic 4v4 teamfights where half the lobby disconnects the moment they see their team is losing by more than one point. It’s slower, more sweaty, more one-sided, and honestly… just less Party Animals. It’s like taking Mario Kart and replacing half the items with bananas. Technically still fun, but c’mon.\r\n\r\nIf the devs wanted to “fix” anything, maybe they could fix hit registration, server stability, or that timeless classic: randomly ragdolling into the stratosphere. But no—let’s adjust the ratio of fun modes downward. Genius.\r\n\r\nBring back the chaos. Bring back the party. Bring back the 2vs2vs2vs2 fights that make this game what it is. Until then, Fight Mode is starting to feel a lot less like a party… and a lot more like a committee meeting.\r\n\r\nDo better, Party Animals. We believe in you. Don’t make us believe ironically.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Long matchmaking",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BIG SHIT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many bugs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This shit fell off so hard bro. This game used to be so fun and they removed everything silly about it.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "I appreciate the idea and generosity of the friend pass but I would have liked to know that only one friends pass player can be 'referred' into a lobby at once. Instead you get a vague connection error that doesn't explain anything when you try to join. Finding out after wasting me and my friends time trying to diagnose our own PCs that its actually part of the monetization scheme feels kinda disrespectful. I'm sure its unintentional, since it would just be better if I was told upfront that its a friend pass issue.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "I RECOMMEND IT, but here I marked it negative to alert you to problems.\n\nI play through GamePass, here I only play the demo.\nBut the amount of cheaters and macro players in this game is bizarre. It seems like the more casual the game, the more these losers there are.\nWhat's worse is that it will soon be free and the situation will get even bad",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I want to like this game I really do. It's cute and funny but absolutely everything is server sided, making it's near unplayable in anything that consists of fighting or racing. Especially the nemo kart. Racing games just can't work if kart controls are server sided for people with high ping. I came back to give the game a try again after a very long time and even still I have disconnects and those lag issues persist. I'm sure for players who live relatively close to servers will have a fantastic time but I honestly can't recommend this game for people at 150ms+",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Unfortunately over half of the content doesn't support local multiplayer. Modes such as racing and many other are not available for whatever reason. Racing actually is available... just only for 2 people at once..???",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This was a good game like 2 years ago, but now it's gotten worse\nThis game gives me HIGH PINGS, which makes it slow and unplayable\nwith high pings you can't jump far, punch faster, fling and so on, but your opponents can do all that, UNFAIR is a small word\n\nALSO THIS GAME REMOVED BLOCK FEATURE, so you have to play with stoopid people even though you don't want to, BRUH>>>\n\nAlso you'll find very toxic people in this game, mostly form countries like korea and china, playing with ping advantage, and dare to make fun of other gamers, shame of you if you are that person, let people enjoy their game, keep your toxicity at home\n\nEven with ping advantage if you spam punches and headbutts, and flex, please make a SPAMMER tattoo on your forehead, make your parents proud :)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the combat sucks,\nthe knock of mario kart game is painfully underdeveloped\ni feel its trying to be to many things and not doing any of it all that well",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just waiting forever in matchmaking and then rage quitting the game after waiting 15 minutes for no matches.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cute character designs.\r\n\r\nI don't like the cash shop/store where you can't unlock the animals you want unless they happen to come up at the time you are checking out the store, and you have the funds for them. My favorite animal, the Raven, has no outfit/skin options compared to other animals. There should be care put into every possible character and they should all have equal amounts of outfits/skins. I would have to wait for a maximum possible two weeks to have the animal I want possibly show up again in the store. I don't have time to be checking in constantly. I want to play the character I want from the start.\r\n\r\nI don't like how you're forced to play the Corgi animal in the tutorials and can't choose your character. I don't like how the loading screens don't have your chosen character, and default to animals you might not really care for.\r\n\r\nI don't like the controls. They're really clumsy and frustrating and confusing. The UI is a console-oriented, side-scrolling mess. Clicking around and trying to find certain areas was really unintuitive.\r\n\r\nI found myself wanting my Quick Match multiplayer games to be over far sooner. They were tedious and un-fun. \r\n\r\nI returned the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They removed the feature that allowed adding multiple friends who use the Friends Pass in the game. L game👎",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is everything that is wrong with the video game industry.\nmicrotransactions. live service. gambling / gacha. shamelessly copying a multitude of other original games. trying to be a \"this is the only game you'll ever need to play!\" but it's all so much worse.\na ragdoll physics engine is the worst framework to put all of this stuff in. it feels like the game just ignores half of my inputs. there are awful game design decisions everywhere. and yet this game gets a multi-million dollar budget and an advertising spot at the summer game fest.\nall this game needed to be was a decent party game. but it's bland, underbaked, and repetitive. rounds last too long. it feels like half of your button inputs are ignored. mechanics stop working for no discernable reason. you'll instantly die in areas where you should have a buffer time to recover. everything is just janky in a way that is so much more frustrating than fun.\nplease just save yourself time and money by playing gang beasts, webfishing, mario kart, duck game, and buckshot roulette. those games actually have a vision and strive to execute on their ideas flawlessly. with party animals, all you'll ever get is disappointment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is really fun with friends and we have a great time every time we play.\n\nMy one and only issue are the excruciatingly long matchmaking times. We just sat in the queue for over 5min and got bored.\n\nEDIT:\nAs of today 13/09/2025 the matchmaking is still painfully long. 5-10mins. Additionally I got thrown out of a game session due to a server issue or something and the game decided to punish me with a 2min matchmaking ban.\n\nMy friends also got 2min bans each earlier today. But in their case they received their bans one at a time. Friend A had their 2 min ban first, then friend B got theirs after friend A had suffered their ban.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Always online requirement and no way to pause in a couch multiplayer session are really killing my enjoyment of this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'll be so real. The game is fun, but the controls are so unresponsive and janky that many games often come down solely to ping. If you have a history of heart attacks, strokes, or The Rage, I recommend staying FAR away from this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It may look like a chill game but it's actually infested with sweat slimy dorks that abuse the constant lag. Want a real chill funny exp? go for Human Fall Flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mmmm one of the most greedy games out there. The gameplay its good.. but the past year the halloween skin were free to get with missions and and now each one cost 6k cookies and the new halloween eggs thing started for the same price (1coin) like the normal egg machine. and then they added an extra 120 cash price (1coin+120cash each try) at the second half of duration of the halloween egg machine event.\nI love halloween events and i hate greedy shit like this so i just vent out that i cant respect the devs with this behaviour.. \n\nPlus the game have long term periods searching for matches on all servers, it shouldnt be more than 1 minute... put me with bots please.. you already do but at least i dont have to wait more than 4 minutes, its disrespectful the amount of time we have to wait..\n\nALSO THE BOTS SHOULD BE ABLE TO VOTE WTF!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda mid. \n\nNothing much to say. Its not bad but not good either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yall need listen more to the community and add more game modes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game crashes often, often errors, servers gets unavailable time to time.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}