{
  "positive": [
    {
      "review": "Well, with almost 1,200 hours logged on Steam and probably hundreds more in the web browser before migrating to Steam. Would I recommend this game? It depends. Do you value your time? Yes? Run, flee, and live a full life. If you like number go up until your dopamine levels are capped out? Congratulations, your home son. Melvor Idle is *basically* OSRS if OSRS took away all the reasons to play OSRS. No walking. No waiting. No \"brb gotta bank rq.\" Just pure, autistic concentrated \"what if I clicked this rock for 6 hours\" energy. So, do you like OSRS? You'll like this. Do you like spreadsheets? You'll love this. Do you like starting at a screen while pretending it's just \"running in the background.\" Come on brother, step right up into the ring. 10/10.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "oddly addicting and I like that I purchased on steam and also can play the mobile version.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Addicting the first time you see the numbers go up up up. \nI really enjoy the game — the management is fun and I enjoy the simple visuals very much. Still on the road to 100% completion but i am looking forward to part 2! Until then, I will have the game open while I do other things on my PC and enjoy checking it once in a while.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best idler around. Has a lot of depth without being a boring, hard to read wall of numbers. Plus, the ability to cloud sync to a mobile app means I can fiddle at work without missing a thing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I used to spend my weekends raiding until 4 AM and min-maxing complex builds. Now, I have a mortgage, lower back pain, and about 30 minutes of free time a day.\r\n\r\nMelvor Idle is the perfect answer to the \"I want to game, but I'm too tired to actually play\" dilemma.\r\n\r\nIt captures all the dopamine of watching XP bars fill up and damage numbers hit the millions, but it respects your time. I can spend 10 minutes setting up my tasks over morning coffee, go to work, handle the kids, and come back 12 hours later to find I’ve chopped 40,000 logs and gained three levels.\r\n\r\nIt is Runescape without the walking, the grinding, or the need to ignore your family.\r\n\r\nPros:\r\n✔️Number go up (very high, very fast).\r\n✔️No microtransactions or \"pay-to-win\" nonsense.\r\n✔️Runs in the background while you do adult things like \"taxes\" and \"laundry.\"\r\n✔️Incredibly deep progression system that scratches the RPG itch.\r\n\r\nCons:\r\n❌ You will check your phone during meetings.\r\n\r\n10/10 - The ultimate Dad Game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Imagine if someone took RuneScape, removed all the parts where you actually have to play the game, and left you with pure, distilled number-watching satisfaction. That's Melvor Idle, and I've sunk 146 hours into it like a proper numpty.\n\nThis game is basically a legal form of gambling with your time. You set it up, walk away, come back, and suddenly your character has mined 47,000 iron ore while you were at work pretending to be productive. It's like having a very dedicated virtual employee who never asks for a raise or takes a sick day, eh?\n\nThe skill system is absolutely massive - 20+ skills to max out, and each one feels like climbing Mount Logan in your underwear during February. The combat is deceptively deep for an idle game, and I've died to bosses I thought I had figured out more times than I care to admit.\n\nPublished by Jagex (yes, THE Jagex), so you know there's some proper RuneScape DNA in here. If you've ever played OSRS, you'll feel right at home, except you can finally go outside while still making progress.\n\nPerfect for anyone who wants to feel like they're accomplishing something while actually doing absolutely nothing. 10/10, would leave running in the background forever again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to run it on the background and see numbers go up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No money after purchase. It's fun and a great little thing to mess with in the background. I think anyone could enjoy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a chill little idle game to keep you occupied. Lots of stuff to do, lots of unlocks to find!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As on OSRS player that stopped with Jagex in 2009 - I'm glad to have found this game. I can play it across platform on my phone and computer - totally worth the money!!! My favorite thing about the developer is that there are no micro transactions. Just play the game and no need to throw away your money more than just paying for the game at the start.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for a good amount of time, and it's been a really good experience overall. Nothing much else to say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is essentially the idle version of Oldschool Runescape and I've had a lot of fun so far.\nIf you like idle games that are spreadsheet friendly, this is a game you need to try.\n\nPros:\n- It'll keep progressing even while offline.\n- Cross platform support (you can play on steam, mobile, browser, etc) with account sync\n- Plenty of content (it will take 1+ year to complete the game and DLCs)\n- Good mod support if you want to change how you play the game with cheats, QOL mods, etc.\n- Great Discord to chat with other players\n- Great wiki with plenty of game guides for different game modes and self-imposed challenges\n\nCons:\n- It might be a bit too addictive, I find myself logging in at all different times of day because the task my character was doing will be finished and I don't want to \"waste\" time before I move on to the next task.\n- Some of the content is kinda confusing as to why we're doing something, or what benefit it'll give. Especially with some of the DLC content (can be skipped though).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For when you get tired of clicking on the same agility course in OSRS lol\n\nGreat lil runescape inspired game I like to run on my second monitor when not watching anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "有点无聊但是还挺好玩的...\r\n起初着迷到挂机到半夜醒来检查...\r\n后来就只会用加速刷咯",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great semi-idle game. Easy to learn, lots to do. Lots of challenges and many ways to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started. It seems fun and a bit addictive. Maybe I will play a bit more. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One year later and I finally 100% completed the base game! Definitely satisfies the RuneScape itch with a good mix of active and full idle fun! \r\n\r\nAlready can't wait for the 2nd one!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a journey. I 100% it (and all DLCs) today, after 1 year and 348 days. Nearly 2 years of my life, oh my god.\n\nA true journey, and as in all true journeys there are the good moments and the bad. It is the best idle game I've played, so many different types of resources, skills to level, items to collect and ways to progress. It was also extremely annoying at parts, frustrating, and I almost gave up multiple times. Sometimes I wonder if it was all just sunk cost fallacy or some type of Stockholm syndrome.\n\nBut I persevered, through the infinite grinds, the important items lost through deaths, accepting that I would need mods to see this through, through countless hours browsing the wiki to discover how to find an item, or testing in Combat Simulator whether I could idle a dungeon, through the joys of finding an item earlier than I expected, or exploring the new mechanics I just unlocked.\n\nAnd now I'm on the other side. I am, for better and for worse, free. I would never start another game, and I would never not have started this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best Idle game i've played, still far from finished. If you love rpg, looting type games and idle then this is perfect.\r\n\r\nNot a good review from me but i suck at this xD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Progressing through the combat areas is where the fun is, don't make the mistake of trying to 'finish' non-combat skills before engaging with higher level combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Melvor Idle is one of the best Idle games out there. \r\n\r\nIt is a very different kind of idle game, and not an incremental one, but its deep game mechanics and huge content will keep you playing for a very long time. \r\n\r\nI cannot say much except if you like idlers and want a break from incremental ones, it is absolutely a must !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "- Playtime: idled 8 months, 100+ hours of actual interaction\n\n- Played: 2025\n\n- Expectation: None.\n\n[b]Intro[/b]\n\nIdle games are a type of management game in which you assign a task to complete and in some cases choose equipment, bonuses, etc. for your agents. Melvor Idle is (apparently) based on the MMORPG Runescape. But instead of enduring grinding and enjoying combat, you just sit back and give orders.\n\n[b]Review[/b]\n\nSo, here's the thing. Who is this for? All you do is click \"Mining\" and select something to mine. Or you click \"Crafting\" and click something to craft. The most engaging thing is combat, and even that can be automated almost entirely. There's also not a lot of depth to this. The only options in combat are melee, ranged and magic, and the barrier and abyssal variants of those. You don't really need to think about the right equipment, spells, prayers, etc. because almost always you just pick the \"best\" stuff you have.\n\nStill, i had some fun with this. With minimal effort you can grow a character and a town. There are all kinds of items, skills and enemies to engage with. Mostly i just like to see the systems and elements game designers come up with. And Melvor has a ton of those. It's niche but it's nice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just a wonderful game. Why can't I think of ideas for games like this!?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing RuneScape themed idle game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good second monitor game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Time Killer, Hyped For The Second Game To Come Out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runescape but better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah its pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is crack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Idle Gaming Goodness",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really great time killer!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "trust me the numbers go up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yaşlı albionu",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best idle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is satisfying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PEAKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I read an online review saying that this game would ruin your life. I saw the game was on sale and I bought it. That review online was true.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Well, with almost 1,200 hours logged on Steam and probably hundreds more in the web browser before migrating to Steam. Would I recommend this game? It depends. Do you value your time? Yes? Run, flee, and live a full life. If you like number go up until your dopamine levels are capped out? Congratulations, your home son. Melvor Idle is *basically* OSRS if OSRS took away all the reasons to play OSRS. No walking. No waiting. No \"brb gotta bank rq.\" Just pure, autistic concentrated \"what if I clicked this rock for 6 hours\" energy. So, do you like OSRS? You'll like this. Do you like spreadsheets? You'll love this. Do you like starting at a screen while pretending it's just \"running in the background.\" Come on brother, step right up into the ring. 10/10.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Essentially a text-based, more chill (as in a lot less clicking) Runescape, I love it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I was so invested i forgot to ever write a review, if you're reading this, i've lost my mind already and just completed 100% base game completion (70% complete if you include DLC's) Can't wait for Melvor Idle 2.......",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "If Runescape is like addicting cigarettes, Melvor Idle is like vaping. You have similar dopamine hits, but instead of sitting there all day jumping from rooftop or rooftop, clicking on regenerating trees over and over, or moving periodically so the crabs can continue beating on you and you don't get caught by the AFK timer, you can simply let Melvor Idle run in the background. So it's a lot less destructive to your actual time and maybe even your health.\n\nIf you're a fan of the Idle genre, just know that this isn't a traditional idle game. There isn't a huge progression curve where numbers grow outrageously out of control. Or prestige mechanics. etc. Basically this game is exactly how it is advertised: a distillation of Runescape down to its core elements. \n\nI'm enjoying my playthrough so far. I highly recommend the Ancients Relic mode that comes with one of the DLC, as it's the kind of gameplay mode that offers extra challenge (the skill cap), but you end up with better rewards (the relics). You can't just over train everything, the mode forces you to engage with the game mechanics and systems and gives you actual walls to overcome. In compensation you get crazy good bonuses you wouldn't be able to get if you played it in normal mode.\n\nMy only criticism of the game 400 hours in, is that inventory space and gold gate the early game too much. I feel like early-game you are too limited by inventory space and the gold costs of everything. And then suddenly when you get your thieving system setup in the right way, that problem literally can disappear overnight, as you find yourself with hundreds of millions... even billions of gold and are buying inventory upgrades at cap price like your daily morning Starbucks coffee.\n\nThe game is very well tuned. Getting +50 HP when you have like 800, or an extra 3% damage reduction doesn't seem like much, especially if you are used to other Idle games prostituting exponential and and multiplicative increases to you. But it DOES makes a difference and sometimes that difference means being able to idle a dungeon with no effort to franctically sitting there for 12 minutes clicking on your food like a sweaty gamer exactly the moment your auto attack timer rolls over. I always appreciate when a game is tuned so that small upgrades can make the world of difference.\n\nI do think skills like Astrology and Cartography should have been passive skills like township and farming, as these are both things that take incredibly amounts of time, offer very little game play other than waiting for the skill to train, yet are necessary because they tie into so much other stuff. \n\nJust my two cents. Melvor Idle 2 is coming out, so I'm interested to see how the dev iterated on the systems they put in place here.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I've played a bunch of idle games. This one is the best hands down. It takes the heart of what makes an MMO fun, and distills it down to it's most basic level. There's no 3D world, there's not character, but you still have the level/collect/quest grinds. That satisfaction of increasing your skills, and using them to craft items that feed into your combat and quests is just as satisfying. There's a good mix of more active and passive tasks you can do, so if you want to sit down and play for a bit there's some things to micromanage, and when you don't have as much time you can just click on a skill and leave it to idle. \n\nBest of all, there's no pay to win or \"speed up\" boosts. You pay once and get the whole game. Because of this they don't burden you down with artificially slow grinds to push you to pay. The game is balanced around fun with reasonable goals (unless you want to 100% in which case look at my play time >.>).",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Just a great in-depth game, that is awesome to have running on a second monitor whilst playing your main game or working!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's basically text-based Runescape. It's cheap and enjoyable. Good for osrs addicts like me that need something to scratch the itch without completely taking over my life",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "oddly addicting and I like that I purchased on steam and also can play the mobile version.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Swietna gra idle. Najlepsza w jaką grałem. Naprawde można zrobic wszystko gdy gra działa w tle. Nigdy nie grałem w RuneScape mimo to bardzo podoba mi się ta gra. Jest tyle możliwości",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Addicting the first time you see the numbers go up up up. \nI really enjoy the game — the management is fun and I enjoy the simple visuals very much. Still on the road to 100% completion but i am looking forward to part 2! Until then, I will have the game open while I do other things on my PC and enjoy checking it once in a while.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Everything I want in an idle/incremental type game. Plus clod saves so I can nerd it up on my phone and carry my progress wherever I am. Can't wait for Melvor II!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm not going to sugarcoat it, the game is good if you like Runescape.\nI personally have an addiction to Idle games, and this feeds that very well. I played for a while in Beta, then forgot it existed until 2 was announced, and then I got it on Steam. I'm excited for 2 to come out.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I like this game more than I like spreadsheets and [i]really[/i] like spreadsheets. If you are nostalgic for Farmville, this game is probably for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best idler around. Has a lot of depth without being a boring, hard to read wall of numbers. Plus, the ability to cloud sync to a mobile app means I can fiddle at work without missing a thing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I used to spend my weekends raiding until 4 AM and min-maxing complex builds. Now, I have a mortgage, lower back pain, and about 30 minutes of free time a day.\r\n\r\nMelvor Idle is the perfect answer to the \"I want to game, but I'm too tired to actually play\" dilemma.\r\n\r\nIt captures all the dopamine of watching XP bars fill up and damage numbers hit the millions, but it respects your time. I can spend 10 minutes setting up my tasks over morning coffee, go to work, handle the kids, and come back 12 hours later to find I’ve chopped 40,000 logs and gained three levels.\r\n\r\nIt is Runescape without the walking, the grinding, or the need to ignore your family.\r\n\r\nPros:\r\n✔️Number go up (very high, very fast).\r\n✔️No microtransactions or \"pay-to-win\" nonsense.\r\n✔️Runs in the background while you do adult things like \"taxes\" and \"laundry.\"\r\n✔️Incredibly deep progression system that scratches the RPG itch.\r\n\r\nCons:\r\n❌ You will check your phone during meetings.\r\n\r\n10/10 - The ultimate Dad Game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, nice loop! I like building up characters. Game can run and play in the background.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Imagine if someone took RuneScape, removed all the parts where you actually have to play the game, and left you with pure, distilled number-watching satisfaction. That's Melvor Idle, and I've sunk 146 hours into it like a proper numpty.\n\nThis game is basically a legal form of gambling with your time. You set it up, walk away, come back, and suddenly your character has mined 47,000 iron ore while you were at work pretending to be productive. It's like having a very dedicated virtual employee who never asks for a raise or takes a sick day, eh?\n\nThe skill system is absolutely massive - 20+ skills to max out, and each one feels like climbing Mount Logan in your underwear during February. The combat is deceptively deep for an idle game, and I've died to bosses I thought I had figured out more times than I care to admit.\n\nPublished by Jagex (yes, THE Jagex), so you know there's some proper RuneScape DNA in here. If you've ever played OSRS, you'll feel right at home, except you can finally go outside while still making progress.\n\nPerfect for anyone who wants to feel like they're accomplishing something while actually doing absolutely nothing. 10/10, would leave running in the background forever again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to run it on the background and see numbers go up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No money after purchase. It's fun and a great little thing to mess with in the background. I think anyone could enjoy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a chill little idle game to keep you occupied. Lots of stuff to do, lots of unlocks to find!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As on OSRS player that stopped with Jagex in 2009 - I'm glad to have found this game. I can play it across platform on my phone and computer - totally worth the money!!! My favorite thing about the developer is that there are no micro transactions. Just play the game and no need to throw away your money more than just paying for the game at the start.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for a good amount of time, and it's been a really good experience overall. Nothing much else to say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is essentially the idle version of Oldschool Runescape and I've had a lot of fun so far.\nIf you like idle games that are spreadsheet friendly, this is a game you need to try.\n\nPros:\n- It'll keep progressing even while offline.\n- Cross platform support (you can play on steam, mobile, browser, etc) with account sync\n- Plenty of content (it will take 1+ year to complete the game and DLCs)\n- Good mod support if you want to change how you play the game with cheats, QOL mods, etc.\n- Great Discord to chat with other players\n- Great wiki with plenty of game guides for different game modes and self-imposed challenges\n\nCons:\n- It might be a bit too addictive, I find myself logging in at all different times of day because the task my character was doing will be finished and I don't want to \"waste\" time before I move on to the next task.\n- Some of the content is kinda confusing as to why we're doing something, or what benefit it'll give. Especially with some of the DLC content (can be skipped though).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For when you get tired of clicking on the same agility course in OSRS lol\n\nGreat lil runescape inspired game I like to run on my second monitor when not watching anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "有点无聊但是还挺好玩的...\r\n起初着迷到挂机到半夜醒来检查...\r\n后来就只会用加速刷咯",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great semi-idle game. Easy to learn, lots to do. Lots of challenges and many ways to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started. It seems fun and a bit addictive. Maybe I will play a bit more. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One year later and I finally 100% completed the base game! Definitely satisfies the RuneScape itch with a good mix of active and full idle fun! \r\n\r\nAlready can't wait for the 2nd one!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game.  It’s really addicting, it’s basically RuneScape without being able to walk around and explore, it’s all about upgrading skills.   but for the 2nd game I hope they add sound effects and some more visuals just to make it a bit more interesting and cozy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good idle game, mostly play it on mobile then load up Steam to get the achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really good yet simple idle game that can be both actively played, or just let it grind in the background. Gives me the good feelings of general accomplishment. Strategic and satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looking for the perfect game that you can ACTUALLY play and have running while working from home? Look no farther. This is an amazing idle game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so incredibly good. Never thought I'd like an idle game this much. The resource management, the combat, the \"number go up\" gameplay, it's all amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The fact that I can play on the phone app while im out is awesome. The save cloud is awesome. The leveling takes forever and the combat system took me a while to understand but I find it fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I consider Melvor Idle to be the best idle game I have ever played, by far. It simply delivers so much compared to the classic numbers go big format, which only gets hidden by layers of systems. Melvor takes different approach with you choosing completel what to do, jumping between anything and everything and knowing you are going closer and closer to finishing the game. \n\nThe game also offers different modes with ancient relics being my absolutely favourite bringing so much more to already amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This idle has a lot of components and fun avenues to play that keep me engaged and thinking!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well thought out and can be idled in the most part. Certain things require a little more input than i would ideally require. Lots of content! A bit overwhelming with all the expansions to begin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Melvor is Runescape, but if you made it an idle game instead of an MMORPG. If you don't like having to actively grind RS, but enjoy planning for the grind, this game is essentially that. There is not much story to speak of, but that's not the point. This is a numbers game, and if you enjoy number goes up, then you'll get something out of this.\r\n\r\nIt isn't a terrible time sink, either - if you want, you can just check in once a day - or you can keep it open in the background and check every now and then while you do something else.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like most others say it's a text-based Runescape where instead of clicking for every action you just let it ride and get gains over time. There's mods and different Game Modes for those of you who might want alts. Quite frankly the game has been one of the best bangs for my buck I've had in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! It helps me while I draw in the background like a personal timer for taking breaks to upgrade myin-game skills and go back to work <3 Looking forward to the future updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Study, come back to the game, kill the boss, go back to studying, best game to be productive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a journey. I 100% it (and all DLCs) today, after 1 year and 348 days. Nearly 2 years of my life, oh my god.\n\nA true journey, and as in all true journeys there are the good moments and the bad. It is the best idle game I've played, so many different types of resources, skills to level, items to collect and ways to progress. It was also extremely annoying at parts, frustrating, and I almost gave up multiple times. Sometimes I wonder if it was all just sunk cost fallacy or some type of Stockholm syndrome.\n\nBut I persevered, through the infinite grinds, the important items lost through deaths, accepting that I would need mods to see this through, through countless hours browsing the wiki to discover how to find an item, or testing in Combat Simulator whether I could idle a dungeon, through the joys of finding an item earlier than I expected, or exploring the new mechanics I just unlocked.\n\nAnd now I'm on the other side. I am, for better and for worse, free. I would never start another game, and I would never not have started this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best Idle game i've played, still far from finished. If you love rpg, looting type games and idle then this is perfect.\r\n\r\nNot a good review from me but i suck at this xD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't an idler. If you click fish it fishes for 30 seconds and then you have to click it again. Left it on all night to fish, and it caught 3 fish and stopped.\n\nSo I cant return this because it was 8 hours, but I'll just charge it back on my card and say I was lied to, since I was.\n\nIt's okay when you get it working",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game if you like min max everything\ndont buy this game is you looking for active game (well there is mods to change the speed and multitasking)\nits an idle game that take what runescape offer into idle its i just love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an addiction that cannot be satisfied!! 100% one of my best purchases on Steam!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Progressing through the combat areas is where the fun is, don't make the mistake of trying to 'finish' non-combat skills before engaging with higher level combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got no time to grind RS anymore. This is super chill idle game. Deep, satisfying, and perfect to run in the background while working. Numbers go up, happiness go up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Idle RS, very fun aside from the inventory management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I opened it “just to check it out.”\r\n1,000 hours later… I’m still checking.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "nice little game to have on the side. dlc is good too",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Lacks the appeal of both Runescape and idle games.\n\nI haven't played much RS but I'm under the impression that most players are initially hooked in by completing quests and exploring the world, and only find themselves obsessively grinding firemaking levels after they've already become invested in the game. Melvor doesn't have any content like that, and it expects you to start grinding for grinding's sake as soon you finish the short tutorial. I probably wouldn't have played this for more than a few hours if I hadn't spent money on it - sunk cost fallacy and all that.\nSome people might think that all idle games are just grinding for grinding's sake. That's not entirely wrong, but as someone who's spend an embarrassing amount of playing idle games the good ones typically have other features that make them interesting, such as \"unfolding\" systems, complex buildcrafting, and really big numbers. Melvor doesn't have anything like those. There's also a few annoying decisions (like not being able to idle combat during the early game and having to manually swap between crafting intermediate items for fletching) that probably only exist because Melvor wasn't designed from the ground up as an original idle game but rather as an idle clone of RS.\n\nMelvor feels less like RS [i]reimagined[/i] as an idle game and more like RS [i]stripped down[/i] into an idle game - without anything being added in the process. That would be fine, except RS is free(-ish) and Melvor isn't. I wouldn't recommend Melvor unless you already like RS but don't want to actually play it for whatever reason.\n\nP.S: This game makes you log into an external account to play it, but has no online features. This is pretty crappy, and I'd consider leaving a bad review over it even if the game was decent.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Interesting take on runescape by making it into a super detailed idle game, there's really no fun except for some tiny satisfaction of seing a number slowly go up as you do nothing, way to complex with intertwining systems to be fun, despite being an idle game the combat actually requires constant attention and gets super boring, there's literally no sound at all and extremely basic graphics, essentially just like watching numbers change on a spreadsheet with a basic GUI, also several of the achievements didn't unlock when I met the requirements",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think my issue with this is at a certain point I might as well just be playing osrs, I also contend that idle games may not be for me but this seems extra tedious because the source material is inherently a slog (but an enjoyable one)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i bought this game and played for 10 hours on adventure mode without knowing cause there was a bug that when i clicked standard mode it automatically put me in adventure mode, i tried making a new account in standard mode but it always put me in adventure no matter how hard i tried , fix your game jagex....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun for a while, but I don't think I would play again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sign-in page is f*cking stupid and makes me not want to open the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is too idle, just set a skill running and then check back once a day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please i wanna go home my kids are starving no more please",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A peculiar game. Melvor Idle is all about \"numbers go up\" combined with an progression system that offers various small bonuses to different areas of the gameplay. \r\n\r\nIn the beginning, your first decision will be what skill you want to start with. Chop trees to gather wood for crafting, mine ore for smithing or go fish for cooking? There are quite a few strategies to get your character off the ground, make some money and get those bonuses going. \r\n\r\nIn the late game, all those potions you brewed, summoning tablets you crafted, agility obstacles you build and astrological constellations you studied will give you quite a productivity boost in whatever skill you're practicing at that point.\r\n\r\nBut to reach that point is just... so... tedious. \r\n\r\nWhen you train a skill, you select a single task and your character... will repeat that task. Over and over. Unless you're specifically micro managing your crafting steps to create a specific item, the majority of Melvor Idle is just... well, idle.\r\n\r\nBut, not in a particularly interesting way, if that makes sense?\r\n\r\nIt's an \"idler's idle game\", for lack of a better term. It's not a game that you can play [i]choosing[/i] to run it on a second screen and see a smooth progression when you shut down your PC two hours later. Rather, those two hours will have barely made a dent into the time you need to invest into it. The game features offline-progression for up to 24 hours, but if your character ran out of resources during that time, then you get interrupted and whatever progression you would have made is lost. So when you're crafting bows, better make sure you have stockpiled enough of the specific kind of wood you need to not run out. After that, you need to buy enough bowstring to complete the bows you started, but using a different crafting task.\r\n\r\nAnd that's just in one skill. There are about a dozen skills with at least a dozen items to craft each. There are many monsters to fight, many items to loot and many small steps to progress. Which is impressive, in the grand scheme of things. If you like spreadsheeting your games and planning your progression, then I can imagine you can draw quite some enjoyment out of it, if you can get used to the sometimes clunky UI.\r\n\r\nBut for me, the game quickly began to feel like work rather than play. A daily grind. Log in one to two times to collect my offline progression, check what my current goal is and what items/stats I need to reach it, maybe switch the skill I'm currently training. Repeat the next day.\r\n\r\nThe friend who initially recommended the game to me lasted about a month before unceremoniously dropping it, having only completed the first two of about a dozen dungeons. Meanwhile I, probably being a bit too tenacious for my own good, have been progressing through the game for two years now. At least I can write this review after having seen everything the game has to offer. \r\n\r\nExcept the DLCs, which would dump even more skill levels, items and empty progression logs on my plate. No thanks, I'm good.\r\n\r\nTo think that Melvor Idle is an idle version of Runescape. I know what game I will never touch with a ten foot pole.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Lacks the appeal of both Runescape and idle games.\n\nI haven't played much RS but I'm under the impression that most players are initially hooked in by completing quests and exploring the world, and only find themselves obsessively grinding firemaking levels after they've already become invested in the game. Melvor doesn't have any content like that, and it expects you to start grinding for grinding's sake as soon you finish the short tutorial. I probably wouldn't have played this for more than a few hours if I hadn't spent money on it - sunk cost fallacy and all that.\nSome people might think that all idle games are just grinding for grinding's sake. That's not entirely wrong, but as someone who's spend an embarrassing amount of playing idle games the good ones typically have other features that make them interesting, such as \"unfolding\" systems, complex buildcrafting, and really big numbers. Melvor doesn't have anything like those. There's also a few annoying decisions (like not being able to idle combat during the early game and having to manually swap between crafting intermediate items for fletching) that probably only exist because Melvor wasn't designed from the ground up as an original idle game but rather as an idle clone of RS.\n\nMelvor feels less like RS [i]reimagined[/i] as an idle game and more like RS [i]stripped down[/i] into an idle game - without anything being added in the process. That would be fine, except RS is free(-ish) and Melvor isn't. I wouldn't recommend Melvor unless you already like RS but don't want to actually play it for whatever reason.\n\nP.S: This game makes you log into an external account to play it, but has no online features. This is pretty crappy, and I'd consider leaving a bad review over it even if the game was decent.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It leans too heavily on being like runescape, while completely missing the sense of satisfaction that comes from accomplishing anything. Instead of feeling rewarding, it just turns into a chore with no real payoff",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "starting up the game requires either login or double confirmation that you do not want to login.   it's annoying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting take on runescape by making it into a super detailed idle game, there's really no fun except for some tiny satisfaction of seing a number slowly go up as you do nothing, way to complex with intertwining systems to be fun, despite being an idle game the combat actually requires constant attention and gets super boring, there's literally no sound at all and extremely basic graphics, essentially just like watching numbers change on a spreadsheet with a basic GUI, also several of the achievements didn't unlock when I met the requirements",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Got it to let it run in the background while i'm working. \nI usually enjoy to leave Adventure Capitalist and check numbers go up, click a few things and let it roll for a while.\nBut there's too many micro management in this to play while working.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrid lag and im on a great pc with task manager shwoing nothing even close to maxing out, ive tried twice now and im just refunding it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think my issue with this is at a certain point I might as well just be playing osrs, I also contend that idle games may not be for me but this seems extra tedious because the source material is inherently a slog (but an enjoyable one)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is frustratingly slow, and I'm not talking about the idle part. I love idle games but every time I click something on this game I have to wait 5 to 10 seconds for the game to register that I clicked. Hopefully this isn't an issue in Melvor 2. It's also passed the time to refund so I'm stuck with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought this game and played for 10 hours on adventure mode without knowing cause there was a bug that when i clicked standard mode it automatically put me in adventure mode, i tried making a new account in standard mode but it always put me in adventure no matter how hard i tried , fix your game jagex....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible. Tutorial is utter trash. Doesn't teach you how to play at all. I'm constantly just spamming random crap on my screen, not knowing what to do or click because the game can't simply say \"click here\". UI is pretty awful and confusing. Severe lack of tool-tips to explain what the heck something is or what something does or what will happen if you click something. There's no \"stop/cancel\" button to stop doing actions which is just god awful game design. In just 30 minutes the game frustrated me to quit and refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I used to play this for long time when it was still free, and then came back to it. There are big issues i should mention:\r\n- The offline idle time is limited to 24 hours. This is the killer move that makes me stop playing, Idleon among others lets you be off many years.\r\n- Restricted to 1 active action at the time. This again goes against \"standards\" of all other idle games and makes this game annoying.\r\n\r\nWith both points combined, how is it possible the developer would still limit it only to 24 hours when there is only 1 thing to calculate/estimate? That's very little CPU time needed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Deleted character multiple times by accident. cool.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was fun for a while, but I don't think I would play again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sign-in page is f*cking stupid and makes me not want to open the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I didn't find this fun and the tutorial didn't help very much.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Big ol ron is bugged for years and not fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is too idle, just set a skill running and then check back once a day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's just,,,,, too stale?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "please i wanna go home my kids are starving no more please",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A peculiar game. Melvor Idle is all about \"numbers go up\" combined with an progression system that offers various small bonuses to different areas of the gameplay. \r\n\r\nIn the beginning, your first decision will be what skill you want to start with. Chop trees to gather wood for crafting, mine ore for smithing or go fish for cooking? There are quite a few strategies to get your character off the ground, make some money and get those bonuses going. \r\n\r\nIn the late game, all those potions you brewed, summoning tablets you crafted, agility obstacles you build and astrological constellations you studied will give you quite a productivity boost in whatever skill you're practicing at that point.\r\n\r\nBut to reach that point is just... so... tedious. \r\n\r\nWhen you train a skill, you select a single task and your character... will repeat that task. Over and over. Unless you're specifically micro managing your crafting steps to create a specific item, the majority of Melvor Idle is just... well, idle.\r\n\r\nBut, not in a particularly interesting way, if that makes sense?\r\n\r\nIt's an \"idler's idle game\", for lack of a better term. It's not a game that you can play [i]choosing[/i] to run it on a second screen and see a smooth progression when you shut down your PC two hours later. Rather, those two hours will have barely made a dent into the time you need to invest into it. The game features offline-progression for up to 24 hours, but if your character ran out of resources during that time, then you get interrupted and whatever progression you would have made is lost. So when you're crafting bows, better make sure you have stockpiled enough of the specific kind of wood you need to not run out. After that, you need to buy enough bowstring to complete the bows you started, but using a different crafting task.\r\n\r\nAnd that's just in one skill. There are about a dozen skills with at least a dozen items to craft each. There are many monsters to fight, many items to loot and many small steps to progress. Which is impressive, in the grand scheme of things. If you like spreadsheeting your games and planning your progression, then I can imagine you can draw quite some enjoyment out of it, if you can get used to the sometimes clunky UI.\r\n\r\nBut for me, the game quickly began to feel like work rather than play. A daily grind. Log in one to two times to collect my offline progression, check what my current goal is and what items/stats I need to reach it, maybe switch the skill I'm currently training. Repeat the next day.\r\n\r\nThe friend who initially recommended the game to me lasted about a month before unceremoniously dropping it, having only completed the first two of about a dozen dungeons. Meanwhile I, probably being a bit too tenacious for my own good, have been progressing through the game for two years now. At least I can write this review after having seen everything the game has to offer. \r\n\r\nExcept the DLCs, which would dump even more skill levels, items and empty progression logs on my plate. No thanks, I'm good.\r\n\r\nTo think that Melvor Idle is an idle version of Runescape. I know what game I will never touch with a ten foot pole.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Lacks the appeal of both Runescape and idle games.\n\nI haven't played much RS but I'm under the impression that most players are initially hooked in by completing quests and exploring the world, and only find themselves obsessively grinding firemaking levels after they've already become invested in the game. Melvor doesn't have any content like that, and it expects you to start grinding for grinding's sake as soon you finish the short tutorial. I probably wouldn't have played this for more than a few hours if I hadn't spent money on it - sunk cost fallacy and all that.\nSome people might think that all idle games are just grinding for grinding's sake. That's not entirely wrong, but as someone who's spend an embarrassing amount of playing idle games the good ones typically have other features that make them interesting, such as \"unfolding\" systems, complex buildcrafting, and really big numbers. Melvor doesn't have anything like those. There's also a few annoying decisions (like not being able to idle combat during the early game and having to manually swap between crafting intermediate items for fletching) that probably only exist because Melvor wasn't designed from the ground up as an original idle game but rather as an idle clone of RS.\n\nMelvor feels less like RS [i]reimagined[/i] as an idle game and more like RS [i]stripped down[/i] into an idle game - without anything being added in the process. That would be fine, except RS is free(-ish) and Melvor isn't. I wouldn't recommend Melvor unless you already like RS but don't want to actually play it for whatever reason.\n\nP.S: This game makes you log into an external account to play it, but has no online features. This is pretty crappy, and I'd consider leaving a bad review over it even if the game was decent.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "It leans too heavily on being like runescape, while completely missing the sense of satisfaction that comes from accomplishing anything. Instead of feeling rewarding, it just turns into a chore with no real payoff",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "starting up the game requires either login or double confirmation that you do not want to login.   it's annoying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting take on runescape by making it into a super detailed idle game, there's really no fun except for some tiny satisfaction of seing a number slowly go up as you do nothing, way to complex with intertwining systems to be fun, despite being an idle game the combat actually requires constant attention and gets super boring, there's literally no sound at all and extremely basic graphics, essentially just like watching numbers change on a spreadsheet with a basic GUI, also several of the achievements didn't unlock when I met the requirements",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Got it to let it run in the background while i'm working. \nI usually enjoy to leave Adventure Capitalist and check numbers go up, click a few things and let it roll for a while.\nBut there's too many micro management in this to play while working.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrid lag and im on a great pc with task manager shwoing nothing even close to maxing out, ive tried twice now and im just refunding it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think my issue with this is at a certain point I might as well just be playing osrs, I also contend that idle games may not be for me but this seems extra tedious because the source material is inherently a slog (but an enjoyable one)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is frustratingly slow, and I'm not talking about the idle part. I love idle games but every time I click something on this game I have to wait 5 to 10 seconds for the game to register that I clicked. Hopefully this isn't an issue in Melvor 2. It's also passed the time to refund so I'm stuck with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought this game and played for 10 hours on adventure mode without knowing cause there was a bug that when i clicked standard mode it automatically put me in adventure mode, i tried making a new account in standard mode but it always put me in adventure no matter how hard i tried , fix your game jagex....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible. Tutorial is utter trash. Doesn't teach you how to play at all. I'm constantly just spamming random crap on my screen, not knowing what to do or click because the game can't simply say \"click here\". UI is pretty awful and confusing. Severe lack of tool-tips to explain what the heck something is or what something does or what will happen if you click something. There's no \"stop/cancel\" button to stop doing actions which is just god awful game design. In just 30 minutes the game frustrated me to quit and refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I used to play this for long time when it was still free, and then came back to it. There are big issues i should mention:\r\n- The offline idle time is limited to 24 hours. This is the killer move that makes me stop playing, Idleon among others lets you be off many years.\r\n- Restricted to 1 active action at the time. This again goes against \"standards\" of all other idle games and makes this game annoying.\r\n\r\nWith both points combined, how is it possible the developer would still limit it only to 24 hours when there is only 1 thing to calculate/estimate? That's very little CPU time needed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Deleted character multiple times by accident. cool.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was fun for a while, but I don't think I would play again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sign-in page is f*cking stupid and makes me not want to open the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I didn't find this fun and the tutorial didn't help very much.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Big ol ron is bugged for years and not fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is too idle, just set a skill running and then check back once a day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's just,,,,, too stale?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "please i wanna go home my kids are starving no more please",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A peculiar game. Melvor Idle is all about \"numbers go up\" combined with an progression system that offers various small bonuses to different areas of the gameplay. \r\n\r\nIn the beginning, your first decision will be what skill you want to start with. Chop trees to gather wood for crafting, mine ore for smithing or go fish for cooking? There are quite a few strategies to get your character off the ground, make some money and get those bonuses going. \r\n\r\nIn the late game, all those potions you brewed, summoning tablets you crafted, agility obstacles you build and astrological constellations you studied will give you quite a productivity boost in whatever skill you're practicing at that point.\r\n\r\nBut to reach that point is just... so... tedious. \r\n\r\nWhen you train a skill, you select a single task and your character... will repeat that task. Over and over. Unless you're specifically micro managing your crafting steps to create a specific item, the majority of Melvor Idle is just... well, idle.\r\n\r\nBut, not in a particularly interesting way, if that makes sense?\r\n\r\nIt's an \"idler's idle game\", for lack of a better term. It's not a game that you can play [i]choosing[/i] to run it on a second screen and see a smooth progression when you shut down your PC two hours later. Rather, those two hours will have barely made a dent into the time you need to invest into it. The game features offline-progression for up to 24 hours, but if your character ran out of resources during that time, then you get interrupted and whatever progression you would have made is lost. So when you're crafting bows, better make sure you have stockpiled enough of the specific kind of wood you need to not run out. After that, you need to buy enough bowstring to complete the bows you started, but using a different crafting task.\r\n\r\nAnd that's just in one skill. There are about a dozen skills with at least a dozen items to craft each. There are many monsters to fight, many items to loot and many small steps to progress. Which is impressive, in the grand scheme of things. If you like spreadsheeting your games and planning your progression, then I can imagine you can draw quite some enjoyment out of it, if you can get used to the sometimes clunky UI.\r\n\r\nBut for me, the game quickly began to feel like work rather than play. A daily grind. Log in one to two times to collect my offline progression, check what my current goal is and what items/stats I need to reach it, maybe switch the skill I'm currently training. Repeat the next day.\r\n\r\nThe friend who initially recommended the game to me lasted about a month before unceremoniously dropping it, having only completed the first two of about a dozen dungeons. Meanwhile I, probably being a bit too tenacious for my own good, have been progressing through the game for two years now. At least I can write this review after having seen everything the game has to offer. \r\n\r\nExcept the DLCs, which would dump even more skill levels, items and empty progression logs on my plate. No thanks, I'm good.\r\n\r\nTo think that Melvor Idle is an idle version of Runescape. I know what game I will never touch with a ten foot pole.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Lacks the appeal of both Runescape and idle games.\n\nI haven't played much RS but I'm under the impression that most players are initially hooked in by completing quests and exploring the world, and only find themselves obsessively grinding firemaking levels after they've already become invested in the game. Melvor doesn't have any content like that, and it expects you to start grinding for grinding's sake as soon you finish the short tutorial. I probably wouldn't have played this for more than a few hours if I hadn't spent money on it - sunk cost fallacy and all that.\nSome people might think that all idle games are just grinding for grinding's sake. That's not entirely wrong, but as someone who's spend an embarrassing amount of playing idle games the good ones typically have other features that make them interesting, such as \"unfolding\" systems, complex buildcrafting, and really big numbers. Melvor doesn't have anything like those. There's also a few annoying decisions (like not being able to idle combat during the early game and having to manually swap between crafting intermediate items for fletching) that probably only exist because Melvor wasn't designed from the ground up as an original idle game but rather as an idle clone of RS.\n\nMelvor feels less like RS [i]reimagined[/i] as an idle game and more like RS [i]stripped down[/i] into an idle game - without anything being added in the process. That would be fine, except RS is free(-ish) and Melvor isn't. I wouldn't recommend Melvor unless you already like RS but don't want to actually play it for whatever reason.\n\nP.S: This game makes you log into an external account to play it, but has no online features. This is pretty crappy, and I'd consider leaving a bad review over it even if the game was decent.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "It leans too heavily on being like runescape, while completely missing the sense of satisfaction that comes from accomplishing anything. Instead of feeling rewarding, it just turns into a chore with no real payoff",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "starting up the game requires either login or double confirmation that you do not want to login.   it's annoying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting take on runescape by making it into a super detailed idle game, there's really no fun except for some tiny satisfaction of seing a number slowly go up as you do nothing, way to complex with intertwining systems to be fun, despite being an idle game the combat actually requires constant attention and gets super boring, there's literally no sound at all and extremely basic graphics, essentially just like watching numbers change on a spreadsheet with a basic GUI, also several of the achievements didn't unlock when I met the requirements",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Got it to let it run in the background while i'm working. \nI usually enjoy to leave Adventure Capitalist and check numbers go up, click a few things and let it roll for a while.\nBut there's too many micro management in this to play while working.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrid lag and im on a great pc with task manager shwoing nothing even close to maxing out, ive tried twice now and im just refunding it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think my issue with this is at a certain point I might as well just be playing osrs, I also contend that idle games may not be for me but this seems extra tedious because the source material is inherently a slog (but an enjoyable one)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is frustratingly slow, and I'm not talking about the idle part. I love idle games but every time I click something on this game I have to wait 5 to 10 seconds for the game to register that I clicked. Hopefully this isn't an issue in Melvor 2. It's also passed the time to refund so I'm stuck with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought this game and played for 10 hours on adventure mode without knowing cause there was a bug that when i clicked standard mode it automatically put me in adventure mode, i tried making a new account in standard mode but it always put me in adventure no matter how hard i tried , fix your game jagex....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible. Tutorial is utter trash. Doesn't teach you how to play at all. I'm constantly just spamming random crap on my screen, not knowing what to do or click because the game can't simply say \"click here\". UI is pretty awful and confusing. Severe lack of tool-tips to explain what the heck something is or what something does or what will happen if you click something. There's no \"stop/cancel\" button to stop doing actions which is just god awful game design. In just 30 minutes the game frustrated me to quit and refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I used to play this for long time when it was still free, and then came back to it. There are big issues i should mention:\r\n- The offline idle time is limited to 24 hours. This is the killer move that makes me stop playing, Idleon among others lets you be off many years.\r\n- Restricted to 1 active action at the time. This again goes against \"standards\" of all other idle games and makes this game annoying.\r\n\r\nWith both points combined, how is it possible the developer would still limit it only to 24 hours when there is only 1 thing to calculate/estimate? That's very little CPU time needed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Deleted character multiple times by accident. cool.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was fun for a while, but I don't think I would play again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sign-in page is f*cking stupid and makes me not want to open the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I didn't find this fun and the tutorial didn't help very much.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Big ol ron is bugged for years and not fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is too idle, just set a skill running and then check back once a day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's just,,,,, too stale?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "please i wanna go home my kids are starving no more please",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A peculiar game. Melvor Idle is all about \"numbers go up\" combined with an progression system that offers various small bonuses to different areas of the gameplay. \r\n\r\nIn the beginning, your first decision will be what skill you want to start with. Chop trees to gather wood for crafting, mine ore for smithing or go fish for cooking? There are quite a few strategies to get your character off the ground, make some money and get those bonuses going. \r\n\r\nIn the late game, all those potions you brewed, summoning tablets you crafted, agility obstacles you build and astrological constellations you studied will give you quite a productivity boost in whatever skill you're practicing at that point.\r\n\r\nBut to reach that point is just... so... tedious. \r\n\r\nWhen you train a skill, you select a single task and your character... will repeat that task. Over and over. Unless you're specifically micro managing your crafting steps to create a specific item, the majority of Melvor Idle is just... well, idle.\r\n\r\nBut, not in a particularly interesting way, if that makes sense?\r\n\r\nIt's an \"idler's idle game\", for lack of a better term. It's not a game that you can play [i]choosing[/i] to run it on a second screen and see a smooth progression when you shut down your PC two hours later. Rather, those two hours will have barely made a dent into the time you need to invest into it. The game features offline-progression for up to 24 hours, but if your character ran out of resources during that time, then you get interrupted and whatever progression you would have made is lost. So when you're crafting bows, better make sure you have stockpiled enough of the specific kind of wood you need to not run out. After that, you need to buy enough bowstring to complete the bows you started, but using a different crafting task.\r\n\r\nAnd that's just in one skill. There are about a dozen skills with at least a dozen items to craft each. There are many monsters to fight, many items to loot and many small steps to progress. Which is impressive, in the grand scheme of things. If you like spreadsheeting your games and planning your progression, then I can imagine you can draw quite some enjoyment out of it, if you can get used to the sometimes clunky UI.\r\n\r\nBut for me, the game quickly began to feel like work rather than play. A daily grind. Log in one to two times to collect my offline progression, check what my current goal is and what items/stats I need to reach it, maybe switch the skill I'm currently training. Repeat the next day.\r\n\r\nThe friend who initially recommended the game to me lasted about a month before unceremoniously dropping it, having only completed the first two of about a dozen dungeons. Meanwhile I, probably being a bit too tenacious for my own good, have been progressing through the game for two years now. At least I can write this review after having seen everything the game has to offer. \r\n\r\nExcept the DLCs, which would dump even more skill levels, items and empty progression logs on my plate. No thanks, I'm good.\r\n\r\nTo think that Melvor Idle is an idle version of Runescape. I know what game I will never touch with a ten foot pole.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Lacks the appeal of both Runescape and idle games.\n\nI haven't played much RS but I'm under the impression that most players are initially hooked in by completing quests and exploring the world, and only find themselves obsessively grinding firemaking levels after they've already become invested in the game. Melvor doesn't have any content like that, and it expects you to start grinding for grinding's sake as soon you finish the short tutorial. I probably wouldn't have played this for more than a few hours if I hadn't spent money on it - sunk cost fallacy and all that.\nSome people might think that all idle games are just grinding for grinding's sake. That's not entirely wrong, but as someone who's spend an embarrassing amount of playing idle games the good ones typically have other features that make them interesting, such as \"unfolding\" systems, complex buildcrafting, and really big numbers. Melvor doesn't have anything like those. There's also a few annoying decisions (like not being able to idle combat during the early game and having to manually swap between crafting intermediate items for fletching) that probably only exist because Melvor wasn't designed from the ground up as an original idle game but rather as an idle clone of RS.\n\nMelvor feels less like RS [i]reimagined[/i] as an idle game and more like RS [i]stripped down[/i] into an idle game - without anything being added in the process. That would be fine, except RS is free(-ish) and Melvor isn't. I wouldn't recommend Melvor unless you already like RS but don't want to actually play it for whatever reason.\n\nP.S: This game makes you log into an external account to play it, but has no online features. This is pretty crappy, and I'd consider leaving a bad review over it even if the game was decent.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "It leans too heavily on being like runescape, while completely missing the sense of satisfaction that comes from accomplishing anything. Instead of feeling rewarding, it just turns into a chore with no real payoff",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "starting up the game requires either login or double confirmation that you do not want to login.   it's annoying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting take on runescape by making it into a super detailed idle game, there's really no fun except for some tiny satisfaction of seing a number slowly go up as you do nothing, way to complex with intertwining systems to be fun, despite being an idle game the combat actually requires constant attention and gets super boring, there's literally no sound at all and extremely basic graphics, essentially just like watching numbers change on a spreadsheet with a basic GUI, also several of the achievements didn't unlock when I met the requirements",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Got it to let it run in the background while i'm working. \nI usually enjoy to leave Adventure Capitalist and check numbers go up, click a few things and let it roll for a while.\nBut there's too many micro management in this to play while working.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrid lag and im on a great pc with task manager shwoing nothing even close to maxing out, ive tried twice now and im just refunding it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think my issue with this is at a certain point I might as well just be playing osrs, I also contend that idle games may not be for me but this seems extra tedious because the source material is inherently a slog (but an enjoyable one)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is frustratingly slow, and I'm not talking about the idle part. I love idle games but every time I click something on this game I have to wait 5 to 10 seconds for the game to register that I clicked. Hopefully this isn't an issue in Melvor 2. It's also passed the time to refund so I'm stuck with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought this game and played for 10 hours on adventure mode without knowing cause there was a bug that when i clicked standard mode it automatically put me in adventure mode, i tried making a new account in standard mode but it always put me in adventure no matter how hard i tried , fix your game jagex....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible. Tutorial is utter trash. Doesn't teach you how to play at all. I'm constantly just spamming random crap on my screen, not knowing what to do or click because the game can't simply say \"click here\". UI is pretty awful and confusing. Severe lack of tool-tips to explain what the heck something is or what something does or what will happen if you click something. There's no \"stop/cancel\" button to stop doing actions which is just god awful game design. In just 30 minutes the game frustrated me to quit and refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I used to play this for long time when it was still free, and then came back to it. There are big issues i should mention:\r\n- The offline idle time is limited to 24 hours. This is the killer move that makes me stop playing, Idleon among others lets you be off many years.\r\n- Restricted to 1 active action at the time. This again goes against \"standards\" of all other idle games and makes this game annoying.\r\n\r\nWith both points combined, how is it possible the developer would still limit it only to 24 hours when there is only 1 thing to calculate/estimate? That's very little CPU time needed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Deleted character multiple times by accident. cool.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was fun for a while, but I don't think I would play again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sign-in page is f*cking stupid and makes me not want to open the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I didn't find this fun and the tutorial didn't help very much.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Big ol ron is bugged for years and not fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is too idle, just set a skill running and then check back once a day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's just,,,,, too stale?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "please i wanna go home my kids are starving no more please",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A peculiar game. Melvor Idle is all about \"numbers go up\" combined with an progression system that offers various small bonuses to different areas of the gameplay. \r\n\r\nIn the beginning, your first decision will be what skill you want to start with. Chop trees to gather wood for crafting, mine ore for smithing or go fish for cooking? There are quite a few strategies to get your character off the ground, make some money and get those bonuses going. \r\n\r\nIn the late game, all those potions you brewed, summoning tablets you crafted, agility obstacles you build and astrological constellations you studied will give you quite a productivity boost in whatever skill you're practicing at that point.\r\n\r\nBut to reach that point is just... so... tedious. \r\n\r\nWhen you train a skill, you select a single task and your character... will repeat that task. Over and over. Unless you're specifically micro managing your crafting steps to create a specific item, the majority of Melvor Idle is just... well, idle.\r\n\r\nBut, not in a particularly interesting way, if that makes sense?\r\n\r\nIt's an \"idler's idle game\", for lack of a better term. It's not a game that you can play [i]choosing[/i] to run it on a second screen and see a smooth progression when you shut down your PC two hours later. Rather, those two hours will have barely made a dent into the time you need to invest into it. The game features offline-progression for up to 24 hours, but if your character ran out of resources during that time, then you get interrupted and whatever progression you would have made is lost. So when you're crafting bows, better make sure you have stockpiled enough of the specific kind of wood you need to not run out. After that, you need to buy enough bowstring to complete the bows you started, but using a different crafting task.\r\n\r\nAnd that's just in one skill. There are about a dozen skills with at least a dozen items to craft each. There are many monsters to fight, many items to loot and many small steps to progress. Which is impressive, in the grand scheme of things. If you like spreadsheeting your games and planning your progression, then I can imagine you can draw quite some enjoyment out of it, if you can get used to the sometimes clunky UI.\r\n\r\nBut for me, the game quickly began to feel like work rather than play. A daily grind. Log in one to two times to collect my offline progression, check what my current goal is and what items/stats I need to reach it, maybe switch the skill I'm currently training. Repeat the next day.\r\n\r\nThe friend who initially recommended the game to me lasted about a month before unceremoniously dropping it, having only completed the first two of about a dozen dungeons. Meanwhile I, probably being a bit too tenacious for my own good, have been progressing through the game for two years now. At least I can write this review after having seen everything the game has to offer. \r\n\r\nExcept the DLCs, which would dump even more skill levels, items and empty progression logs on my plate. No thanks, I'm good.\r\n\r\nTo think that Melvor Idle is an idle version of Runescape. I know what game I will never touch with a ten foot pole.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Lacks the appeal of both Runescape and idle games.\n\nI haven't played much RS but I'm under the impression that most players are initially hooked in by completing quests and exploring the world, and only find themselves obsessively grinding firemaking levels after they've already become invested in the game. Melvor doesn't have any content like that, and it expects you to start grinding for grinding's sake as soon you finish the short tutorial. I probably wouldn't have played this for more than a few hours if I hadn't spent money on it - sunk cost fallacy and all that.\nSome people might think that all idle games are just grinding for grinding's sake. That's not entirely wrong, but as someone who's spend an embarrassing amount of playing idle games the good ones typically have other features that make them interesting, such as \"unfolding\" systems, complex buildcrafting, and really big numbers. Melvor doesn't have anything like those. There's also a few annoying decisions (like not being able to idle combat during the early game and having to manually swap between crafting intermediate items for fletching) that probably only exist because Melvor wasn't designed from the ground up as an original idle game but rather as an idle clone of RS.\n\nMelvor feels less like RS [i]reimagined[/i] as an idle game and more like RS [i]stripped down[/i] into an idle game - without anything being added in the process. That would be fine, except RS is free(-ish) and Melvor isn't. I wouldn't recommend Melvor unless you already like RS but don't want to actually play it for whatever reason.\n\nP.S: This game makes you log into an external account to play it, but has no online features. This is pretty crappy, and I'd consider leaving a bad review over it even if the game was decent.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "It leans too heavily on being like runescape, while completely missing the sense of satisfaction that comes from accomplishing anything. Instead of feeling rewarding, it just turns into a chore with no real payoff",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "starting up the game requires either login or double confirmation that you do not want to login.   it's annoying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting take on runescape by making it into a super detailed idle game, there's really no fun except for some tiny satisfaction of seing a number slowly go up as you do nothing, way to complex with intertwining systems to be fun, despite being an idle game the combat actually requires constant attention and gets super boring, there's literally no sound at all and extremely basic graphics, essentially just like watching numbers change on a spreadsheet with a basic GUI, also several of the achievements didn't unlock when I met the requirements",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Got it to let it run in the background while i'm working. \nI usually enjoy to leave Adventure Capitalist and check numbers go up, click a few things and let it roll for a while.\nBut there's too many micro management in this to play while working.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrid lag and im on a great pc with task manager shwoing nothing even close to maxing out, ive tried twice now and im just refunding it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think my issue with this is at a certain point I might as well just be playing osrs, I also contend that idle games may not be for me but this seems extra tedious because the source material is inherently a slog (but an enjoyable one)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is frustratingly slow, and I'm not talking about the idle part. I love idle games but every time I click something on this game I have to wait 5 to 10 seconds for the game to register that I clicked. Hopefully this isn't an issue in Melvor 2. It's also passed the time to refund so I'm stuck with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i bought this game and played for 10 hours on adventure mode without knowing cause there was a bug that when i clicked standard mode it automatically put me in adventure mode, i tried making a new account in standard mode but it always put me in adventure no matter how hard i tried , fix your game jagex....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible. Tutorial is utter trash. Doesn't teach you how to play at all. I'm constantly just spamming random crap on my screen, not knowing what to do or click because the game can't simply say \"click here\". UI is pretty awful and confusing. Severe lack of tool-tips to explain what the heck something is or what something does or what will happen if you click something. There's no \"stop/cancel\" button to stop doing actions which is just god awful game design. In just 30 minutes the game frustrated me to quit and refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I used to play this for long time when it was still free, and then came back to it. There are big issues i should mention:\r\n- The offline idle time is limited to 24 hours. This is the killer move that makes me stop playing, Idleon among others lets you be off many years.\r\n- Restricted to 1 active action at the time. This again goes against \"standards\" of all other idle games and makes this game annoying.\r\n\r\nWith both points combined, how is it possible the developer would still limit it only to 24 hours when there is only 1 thing to calculate/estimate? That's very little CPU time needed.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}