{
  "positive": [
    {
      "review": "Good game, i think there needs to be a freebuild mode, where you can plan your own job and use placeable items to create your own jobs to build, then when the plans are ready you work through the different build stages, like the contracts or campaigns.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Had some good time with the game, but it's very repetitive and time-consuming. On the other hand - quite unique and much better than previous editions. Yes, it's worh it, but be prepared to spend some time digging holes, or moving steel poles for hours ;)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game to come home from a stressful day at work and unwind. Great for those who love playing with machines",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Value, lots of content in base game. I hope they create another iteration of this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was looking for a game that let me operate an excavator like God intended - with HOSAS controls and finally found it. i'm obsessed",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is a really cool game very relaxing to play the vehicles do not strap loads which i miss but the graphics and terrain are awesome very easy to start and work your way up in the game looking forward to many hours playing this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game. Its the only game Astragon has ever published that wasnt a broken cash grab.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game, though there are some things to be fixed\n#1 the dump truck dumping then immediately put itself down, it's annoying \n#2 the equipments weight. For example I could've gotten my bobcat stuck in a trench and try to pull it out with my excavator, the excavator can't, for whatever reason.\nI hope the next one has some more US style equipment and a more rural map for the next installment!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If I could give this game a neutral review, I could. It's a fun game at it's base, you do exactly what you bought the game in order to do. There are a few glaring issues and massive inconveniences/immersion breakers which honestly need to be addressed. \r\n\r\nFirst and foremost the graphical issues, I have a relatively high end rig and there's no reason why my PC should be running hot, it's clear the developers have failed to properly optimise the game, there's a lot of stuttering, ghosting etc.\r\n\r\nNext is the gameplay itself. I'll be speaking from a Single player only perspective. Whilst it is fun and I'd say it is indeed a construction sim, there's a lot of things that just seem unnecessarily tedious. Starting with the lack of any AI helper. Just simple tasks such as milling or concreting you're forced to either do yourself, or just 'skip' the job entirely. Why has nobody thought that perhaps it would be more fun to have stages of the job be AI managed whilst you do supply runs, machine transport etc, just an idea. And on the topic of machine transport, if you do a job that required 4-6 machines, whilst you can transport some together using a truck and a trailer, some you can't and sometimes you just can't be bothered, and if you cant be bothered then you literally have to jump in each machine and fast travel to the job site individually. That includes transitioning from the game, to a loading screen, 8-12 times. Extremely annoying, why isn't there an option to just move all machines to the site at once? The jobs can become repetitive, and at that point you just want certain elements to be done by an AI rather than just skipped outright.\r\n\r\nThere's also the controls which are unnecessarily overcomplicated, mainly looking at the track machines. Why not have an option to go from using Q,E/Z,C to WASD?\r\n\r\nThe progression system and the economy I have no gripes. But on the topic of machines, whilst you can get certain machines in larger sizes, some you can't like the compactors for example, why are there no Heavy Rollers in the game? The DLCs don't address this either.\r\n\r\nTLDR, it's a fine game, but there's a lot of quality of life mechanics missing which just make aspects of the game extremely tedious. There also is no automation, you just have the option to skip parts of a job. If you're happy to want to do everything including the menial tasks by yourself (Unless you're playing with others) then this game is for you, if not then you'll quickly find yourself burnt out to a point you just can't be bothered anymore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far the best construction sim on the market at the moment. It has licensed brands, a good economy, and fairly solid digging physics—only really rivalled by Out of Ore. The blend of machinery works well. However, it lacks the manual-labour side that it could really benefit from.\n\nThey previously teased a demolition-focused DLC or future update, along with more attachments that would be interchangeable for excavators. Unfortunately, only a couple of machines actually got bucket-swap functionality, and both are lacklustre. In my opinion, neither of them hold their worth, so you’ll rarely use them.\n\nThe game also lacks consequences. There’s no real tipping over or getting properly stuck, which would add much-needed challenge. Roadcraft handles both of these elements well while keeping the Construction Simulator 2015 approach to loading physics for cargo and machinery. Meanwhile, this game has a very rigid and restrictive loading system which—while sometimes more realistic—ends up feeling tedious. I’ve seen some dodgy loads in real life that this game would never allow.\n\nSome machines are also missing features you’d expect: excavators with blades that don’t move, dozer blades that can’t tilt properly, buckets that can’t heap material, and the inability to stockpile excess material to remove at the end of a job. Instead, it’s “load it now or lose it.” DLC with friends also locks out some options. Certain machines can hold more material, cover more width, or just do the job better, but there’s no clear way to tell this without trial and error.\n\nThe last thing I’ll mention is probably why the latter half of this review sounds less positive. The game’s roadmap made it seem like it would receive longer-term support. As someone who’s been here since announcement, it was disappointing when support was suddenly cut—especially considering how much potential the game still had. Adding Steam Workshop support for machines, missions, and maps alone would have given the game massive longevity (technically that’s three features, but who’s counting).\n\nAlso, seeing them drop the pocket editions onto PC feels like a desperate move, which hurts to say because I really do like this game a lot.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A word of advis is not to play this game on pc if you do not have a controler like one of xbox,playstashon or even nitendo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD BRANDS ,ALSO THEY CAN ADD MORE BRANDS,GOOD DETAILS IN CONSTRUCTION",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game, realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please add a komatsu excavator",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great fun with a friend or two",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beste bauen seit zwei Jahren ein Hotel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun if your really into the trade",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gargaus game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recomended game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "YOU CAN DO WHAT YOU WANT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interactive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Construction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IDK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool machines",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shnack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting paid for real construction work: HELL NAH\nSitting on your ass excavating for 4 hours only to get virtually scammed of your virtual money, and getting reminded how video games can be a real time waste: HELL YEAH!",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "I've been hacking at this game from its beginning. As usual, there's always a bit of a learning curve, especially since I'm using an Xbox One controller as well as the mouse to accomplish certain tasks. I'm 72 going on 40 and my grand-kids run circles around me when they play ANY type of games, including this one. I really like this one even with the few glitches I came across, i.e. using the controller left and right switches are very sensitive when choosing features by pressing the X button, almost kinda panicky. working the flatbed truck crane proved to be quite a challenge in itself. But otherwise, and in time, I'm sure the devs are gonna work their magic and keep improving it. I play many trucking games and TBH this one is fast becoming one of my favourites. I recommend it because it supplies a lot of help as you go along doing the requested jobs. This will definitely be one to watch 👍🏻",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "if you ever dreamed of pushing dirt in a dozer as a kid or digging huge pits then this game is absolutely for you. i love this game. there is no time pressure and it does not count days (even though there is a day and night cycle).\r\n\r\na good game to unwind to after a stressful day at work. unless you are already in construction.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Game good. Bad reviews = no dopamine rush every 3.2 seconds, and bad at easy game. Yes lot of digging but should be expected in a construction game for god sake, and yes it is tiring so take break every once in awhile not hard.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Go from working a blue-collar job to working a blue-collar job in-game when you get home, gets my stamp of approval.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Good game, i think there needs to be a freebuild mode, where you can plan your own job and use placeable items to create your own jobs to build, then when the plans are ready you work through the different build stages, like the contracts or campaigns.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It's a really fun simulator as long as you aren't expecting it to be like a Microsoft Construction Simulator. It's got a ton of issues, but is still enjoyable. With all the issues I have with the game, a recommended review sounds odd. I often prefer negative reviews over positive ones as they tend to give you a better idea of what you can expect than short \"this game is great\" anyone who likes a game would put up.\n\nSome of the biggest issues would be the optimization isn't great and struggles to run smoothly with graphics turned up to see all the detail the game has to offer. This heavily impacts first person views where adding reflections to the mirrors risks heavy frame drops. First person machine operation has a few other issues, but as long as you aren't using the starter Backhoe Loader, you'll be fine without the ability to adjust your seating position to the sides or forward to see better.\n\nAnother issue would be that vehicles have basically zero weight. This is most noticeable if you try to drive up on dirt piles or simply... drive a Skid Steer. Your vehicle will be flung around like a rag doll. Under regular operation, you will probably not notice the weightlessness of the vehicles. My problem just stems from habits of actual construction work and things you can do in real life that aren't simulated. But for me, that's fine. It just sadly makes the Skid Steer a useless machine for me.\n\nThose are all the issues I can really gripe on, the rest is just how neat it is to decide what vehicles you want to use for a job outside the recommended machines. You are able to rent machines to complete jobs if need be. The ability to use a single machine for multiple tasks at times is a bonus. This mainly comes down to the excavators being able to lift materials for placements. \n\nThe game is not-sim enough to be forgiving for many of the required tasks like leveling dirt or digging a trench. Even if you don't dig the straightest line or proper depth, once you complete the required area, the next phase will automatically shape it for you as needed. No need to get frustrated over a crooked line. \n\nThe machine types all have very customizable controls. Though it took me a while to set up a few machines to mimic the feel of the machines I'm used to operating in the field, but it's definitely doable.\n\nOn another note as an actual construction worker, it is a bit sad that machines like smaller excavators do not allow use of the blade or swing arm. But that is another minor gripe.\n\nOverall, sans experience with multiplayer, I've definitely enjoyed this game for it's simplicity in the tasks despite all it's faults.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is like Tonka Construction got a massive overhaul. The game is fun for the most part and enjoyable, Its probably the best construction Sim out right now 10/23/2025. It hits allot of marks you would want in a Construction sim. The negatives are easily overshadowed by the Pro's and enjoyment in it. Plenty of missions to do and can see the region you build change over time. Do i wish there was more? sure but for what the game offers I think its good enough.\n\nPro's:\n* Volumetric soil, gravel, sand, Cement, Asphalt.\n* Numerous Types and brands of Construction Equipment\n* Three Regions with numerous missions and campaign missions\n* Mechanics of the game are easy to learn and play with flexibility of most controls\n* Allot of quick options from skipping objectives to fast travel and quick item load ups onto transport\n* Dev's watching discussion on Steam support board for game\n* V Key to see areas for leveling and seeing what is missed\n\nCons:\n* Track vehicle gameplay mechanics not great but better than it was\n* Wish there was even more vehicle types and brands\n* No detail on various vehicle's to see what scoops more or holds more.\n* Controls for keyboard require you have a keyboard with num pad (not a problem for me).\n* Still some bugs in the game but nothing deal breaking plenty of work around's if ran into. Dev's still actively working to improve game so not that big of an issue.\n\nOverall its a great Cons. Sim game and has plenty of room for improvement if not more to look forward to when/if they do a 2nd one. I look forward to see how this game or the future iteration plays out!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Had some good time with the game, but it's very repetitive and time-consuming. On the other hand - quite unique and much better than previous editions. Yes, it's worh it, but be prepared to spend some time digging holes, or moving steel poles for hours ;)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's good for what it is. One of the better simulator style games I've played. Doesn't match up to Farming Sim, but it's up there! Only thing that I'd like to see, is them release a newer version for PC and not just nintendo or mobile",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I must say, this game is truly exceptional — the hours slip away effortlessly before you even realize it. And when you’re playing with friends, the experience becomes unforgettable: filled with laughter, energy, and those golden moments you’ll carry with you long after the game is done🐎🐴😊",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I didn't know i needed. Every vehicle is unique and the game flow is fantastic. Sit back, relax and build, dig, carry, lift, push, roll, pour until the sun comes up",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very good and realistic game, but it would be good to add some more things to show this realism, for example, machines getting dirty because on every construction site they look as if they had just been bought now.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game to come home from a stressful day at work and unwind. Great for those who love playing with machines",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Value, lots of content in base game. I hope they create another iteration of this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic. Very enjoyable. Highly recommend if you like this type of sim experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was looking for a game that let me operate an excavator like God intended - with HOSAS controls and finally found it. i'm obsessed",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is a really cool game very relaxing to play the vehicles do not strap loads which i miss but the graphics and terrain are awesome very easy to start and work your way up in the game looking forward to many hours playing this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game. Its the only game Astragon has ever published that wasnt a broken cash grab.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game, though there are some things to be fixed\n#1 the dump truck dumping then immediately put itself down, it's annoying \n#2 the equipments weight. For example I could've gotten my bobcat stuck in a trench and try to pull it out with my excavator, the excavator can't, for whatever reason.\nI hope the next one has some more US style equipment and a more rural map for the next installment!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If I could give this game a neutral review, I could. It's a fun game at it's base, you do exactly what you bought the game in order to do. There are a few glaring issues and massive inconveniences/immersion breakers which honestly need to be addressed. \r\n\r\nFirst and foremost the graphical issues, I have a relatively high end rig and there's no reason why my PC should be running hot, it's clear the developers have failed to properly optimise the game, there's a lot of stuttering, ghosting etc.\r\n\r\nNext is the gameplay itself. I'll be speaking from a Single player only perspective. Whilst it is fun and I'd say it is indeed a construction sim, there's a lot of things that just seem unnecessarily tedious. Starting with the lack of any AI helper. Just simple tasks such as milling or concreting you're forced to either do yourself, or just 'skip' the job entirely. Why has nobody thought that perhaps it would be more fun to have stages of the job be AI managed whilst you do supply runs, machine transport etc, just an idea. And on the topic of machine transport, if you do a job that required 4-6 machines, whilst you can transport some together using a truck and a trailer, some you can't and sometimes you just can't be bothered, and if you cant be bothered then you literally have to jump in each machine and fast travel to the job site individually. That includes transitioning from the game, to a loading screen, 8-12 times. Extremely annoying, why isn't there an option to just move all machines to the site at once? The jobs can become repetitive, and at that point you just want certain elements to be done by an AI rather than just skipped outright.\r\n\r\nThere's also the controls which are unnecessarily overcomplicated, mainly looking at the track machines. Why not have an option to go from using Q,E/Z,C to WASD?\r\n\r\nThe progression system and the economy I have no gripes. But on the topic of machines, whilst you can get certain machines in larger sizes, some you can't like the compactors for example, why are there no Heavy Rollers in the game? The DLCs don't address this either.\r\n\r\nTLDR, it's a fine game, but there's a lot of quality of life mechanics missing which just make aspects of the game extremely tedious. There also is no automation, you just have the option to skip parts of a job. If you're happy to want to do everything including the menial tasks by yourself (Unless you're playing with others) then this game is for you, if not then you'll quickly find yourself burnt out to a point you just can't be bothered anymore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good simulator game, if you're into this kind of thing definitely try it.\r\nIt can get repetitive at times but that's part of the genre, plus you can skip practically anything if it gets annoying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty nice as a game and a simulator even tho u need friends to get the full experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a civil engineer, this game is a great way to scratch the itch to lead and actually construct your own projects. I like how the high priority contracts take significantly longer. 100% worth the money in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game lots of missions great fun with friends online well worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played demo version. Pretty good game, accurate controls, decent tutorial, nice vehicle physics, mechanics are intuitive, pleasant graphics and also potato-PC friendly!  \nTasks are voiced (no need to read them) and if you stuck on the road as I did you can simply teleport to any location you've visited previously. \nDefinitely worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Construction Simulator is a really well-made game. The varied and exciting missions are especially fun and ensure that it never gets boring. I really like the versatility, as you can take on different tasks and challenges. Overall, it’s a great gaming experience that I would definitely recommend – both to fans of simulators and to anyone who just wants to try something new.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing and realistic it even lookes great with my bad computer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to just play and relax , could be better optimazed but good game overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Where's the news? Where are the updates? The company just dropped the game. It's been over 10 months since they last released content.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "By far the best construction sim on the market at the moment. It has licensed brands, a good economy, and fairly solid digging physics—only really rivalled by Out of Ore. The blend of machinery works well. However, it lacks the manual-labour side that it could really benefit from.\n\nThey previously teased a demolition-focused DLC or future update, along with more attachments that would be interchangeable for excavators. Unfortunately, only a couple of machines actually got bucket-swap functionality, and both are lacklustre. In my opinion, neither of them hold their worth, so you’ll rarely use them.\n\nThe game also lacks consequences. There’s no real tipping over or getting properly stuck, which would add much-needed challenge. Roadcraft handles both of these elements well while keeping the Construction Simulator 2015 approach to loading physics for cargo and machinery. Meanwhile, this game has a very rigid and restrictive loading system which—while sometimes more realistic—ends up feeling tedious. I’ve seen some dodgy loads in real life that this game would never allow.\n\nSome machines are also missing features you’d expect: excavators with blades that don’t move, dozer blades that can’t tilt properly, buckets that can’t heap material, and the inability to stockpile excess material to remove at the end of a job. Instead, it’s “load it now or lose it.” DLC with friends also locks out some options. Certain machines can hold more material, cover more width, or just do the job better, but there’s no clear way to tell this without trial and error.\n\nThe last thing I’ll mention is probably why the latter half of this review sounds less positive. The game’s roadmap made it seem like it would receive longer-term support. As someone who’s been here since announcement, it was disappointing when support was suddenly cut—especially considering how much potential the game still had. Adding Steam Workshop support for machines, missions, and maps alone would have given the game massive longevity (technically that’s three features, but who’s counting).\n\nAlso, seeing them drop the pocket editions onto PC feels like a desperate move, which hurts to say because I really do like this game a lot.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A word of advis is not to play this game on pc if you do not have a controler like one of xbox,playstashon or even nitendo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "короче игра такова копаешь заливаешь бетон ставишь стены потом бетон потом стены и так страдаете с ваши другом 24.7 спросите меня стоит ли игра своих денег конечно стоит так как тут можно провести всю вашу оставшиюся жизнь вы за это время успеете наверное сделать все компания в каждой стране итог советую попробовать",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD BRANDS ,ALSO THEY CAN ADD MORE BRANDS,GOOD DETAILS IN CONSTRUCTION",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you've ever operated machinery this can be really addicting i love the excavation and selling soil. loader and moxys are also fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very detailed construction management simulation, from operating machinery to build structures and repair civil works, to managing a company including vehicles, machinery, materials, and finances. Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its def a fun game but without a few flaws... for one the camera system is f****ed in this game do not understand how in 2025 this even possible? but def watch some youtube videos and buy the game on sale and not full price...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun, and has has bot easy and somewhat harder chalenges. I enjoy the game a lot.\r\n\r\nPROS:\r\n- Realistic tasks\r\n- Fun using the different machines\r\n- Many contracts\r\n- The campaigns are great\r\n- Multiplayer up to 4 players\r\n- Play on Console\r\n\r\nCONS\r\n- The GUI takes a bit getting used to. The keys are not following the standards we are used to.\r\n- Day/night sycle. Some like it, some don't, but it should be a posibility to turn it off, in stead of doing it  manualy all the time\r\n- Some tasks can get a bit tedious, like filling concrete. It's in the nature of the game i guess, but i found it a bit boring after a while.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "laid 10m of road and instantaneously made another 50m.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I thoroughly enjoyed several hours of play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and addicting",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty good game, realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please add a komatsu excavator",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great fun with a friend or two",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistic and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent game when theres people to play with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NOT A GAME ITS A JOB SO O/10 SINCE IM NOT GETTING PAID",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a nice and fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beste bauen seit zwei Jahren ein Hotel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun if your really into the trade",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "certified bollocks game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game to play with your friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "soooooooooooooooo good but also expenceve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth the try! Love this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fucking good feel like some polish alcoholic trynna make money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gargaus game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game I love this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recomended game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Nice Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "YOU CAN DO WHAT YOU WANT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This is a fantastic game that doesn't work very well. Don't know what I paid for it, and cost is not the issue. While it worked, it was quite like using the actual equipment. It provides the user with an in game mentor who guides you, and all the projects you could ask for. It's clever, well scripted and not too technical. Unfortunately, about 50 hours into the game, the controllers stopped working for no apparent reason. (They work with my other games.) I tried the support options a couple of times, but they were a waste of time and keystrokes. As best as I can tell, no one provides any kind of support for it. Not Steam, the developers, or anyone on Steam. There's no help, and no fix.  \r\nThere isn't even an interface for selecting controllers. None that I could find. No one on Steam seems to have any useful suggestions. Maybe I'm a dummy, but I didn't build an elaborate searchlight with no on/off switch; Or a three-story chalet with no stairs; Or a greenhouse with a tin roof and no windows. This is a technological contradiction, a fabulous game that gradually withdraws features and options that you know it has, until you give up in frustration.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game looks great. The story is interesting. The NPCs help a lot with the immersion. Driving the wheeled vehicles (except the Bobcat) is a charm. So why the thumb down? A few important (for me) reasons. First, there is a problem with spreading gravel. None of the vehicles, be it the dozer, the loader, the backhoe or the grader, will help you finish that task on contracts. I tried all of them, and although they should handle such a job without problems, none of them does it properly. The grader is actually not bad at it, but for some reasons, it has little to no effect on the percentage of the task. So, even if it does a decent job at spreading the gravel, it won\"t help you complete that task. The only vehicles that will allow you to complete those tasks are the dumpers. And good luck for figuring out how to do it. I\"ve been playing for 54 hours, and I am still looking for another machine that could do it right.\r\n\r\nSecond reason: driving the tracked vehicles. Those vehicles are a nightmare to drive, mostly because of the delay in their response to input (in my case, the keyboard/Tartarus keypad). Also because you need two keys to move them forward or backward. I didn`t try the tracked Bobcat for this reason. Instead, I rented the wheeled Bobcat... for about 5 minutes. This vehicle is a joke. Much worse than the tracked vehicles. I could hardly managed to get out of the yard with it. Even though it has wheels, you drive it the same way you would drive a vehicle equipped with tracks (like a tank).\r\n\r\nThird reasons: towing the trailer dumper. The physics don`t look right to me. I drove a lot of lories and farm tractors in games, and I backed up a lot of trailers. Farm trailers, which are attached to a standard receiver hitch, are a pain in the butt to back-up. Even farmers have a problem backing them up. Lorie trailers, on the other end, which are attached to a the lorie through a  gooseneck (of fifth-wheel) device, are much easier to back up. It takes some times to get used to it, but when you  get the hang of it, it`s a piece of cake. However, in the game, the dumper trailer, which attaches to the lorie with a simple ball, should be easy to back up, but it ain`t. It behaves more like a farm trailer than a lorie trailer, and is thus a pain in the butt to back up.\r\n\r\nI was going to buy the DLC, but han, han, not anymore. Too bad, this game would be a great game without those issues. I remember playing it two years ago. It was crappy then. So this game improved a lot in the last two years. Not enough though. It still has major issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Disapointing graphics\nControls are horrible.\n\nBased on Unity game engine which has massive graphics limitations and known to have massive problems with game controllers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "need to add some more turck some with workin jake breaks and some peterbuilt to the game other then that game is dope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's mostly cranes, cementing, and pushing dirt around. To be fair, it's some of the best dirt manipulation I've ever seen in a video game, but the rest of the game feels empty. There are no consequences to swinging items around too fast on the crane, there is no sandbox option, no hand tools only heavy machinery. The speed of the crane will make you question your life choices. Which kinda sucks because it's all basically cranes and driving. Filling up the dump truck every two feet will also make you go broke very fast (Why does it cost an arm and a leg for some dirt?!)\n\nIt's a decent looking game with a day/night cycle, but I kind of wish there was a weather system. Could be interesting to have to deal with unexpected problems like the rain screwing up your cement.\n\nThe only real reason I can't recommend this game is that it doesn't really allow the player to be creative in what they build and how. It's not a simulator. It's a crane game with contracts. Even the walls are prefabricated.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Tried returning to Construction Simulator 22 after not playing since launch. Unfortunately, the same issues remain for me:\n\nControls: imprecise and unintuitive.\n\nCamera: frequently behaves unpredictably.\n\nPerformance: consistent microstutters every second on a 5070 Ti / 64 GB / Ryzen 9 / M.2 setup.\n\nGiven how long it’s been out, it’s disappointing. It looks like energy went into license-driven DLC rather than making the core game feel good to play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a fantastic game that doesn't work very well. Don't know what I paid for it, and cost is not the issue. While it worked, it was quite like using the actual equipment. It provides the user with an in game mentor who guides you, and all the projects you could ask for. It's clever, well scripted and not too technical. Unfortunately, about 50 hours into the game, the controllers stopped working for no apparent reason. (They work with my other games.) I tried the support options a couple of times, but they were a waste of time and keystrokes. As best as I can tell, no one provides any kind of support for it. Not Steam, the developers, or anyone on Steam. There's no help, and no fix.  \r\nThere isn't even an interface for selecting controllers. None that I could find. No one on Steam seems to have any useful suggestions. Maybe I'm a dummy, but I didn't build an elaborate searchlight with no on/off switch; Or a three-story chalet with no stairs; Or a greenhouse with a tin roof and no windows. This is a technological contradiction, a fabulous game that gradually withdraws features and options that you know it has, until you give up in frustration.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game looks great. The story is interesting. The NPCs help a lot with the immersion. Driving the wheeled vehicles (except the Bobcat) is a charm. So why the thumb down? A few important (for me) reasons. First, there is a problem with spreading gravel. None of the vehicles, be it the dozer, the loader, the backhoe or the grader, will help you finish that task on contracts. I tried all of them, and although they should handle such a job without problems, none of them does it properly. The grader is actually not bad at it, but for some reasons, it has little to no effect on the percentage of the task. So, even if it does a decent job at spreading the gravel, it won\"t help you complete that task. The only vehicles that will allow you to complete those tasks are the dumpers. And good luck for figuring out how to do it. I\"ve been playing for 54 hours, and I am still looking for another machine that could do it right.\r\n\r\nSecond reason: driving the tracked vehicles. Those vehicles are a nightmare to drive, mostly because of the delay in their response to input (in my case, the keyboard/Tartarus keypad). Also because you need two keys to move them forward or backward. I didn`t try the tracked Bobcat for this reason. Instead, I rented the wheeled Bobcat... for about 5 minutes. This vehicle is a joke. Much worse than the tracked vehicles. I could hardly managed to get out of the yard with it. Even though it has wheels, you drive it the same way you would drive a vehicle equipped with tracks (like a tank).\r\n\r\nThird reasons: towing the trailer dumper. The physics don`t look right to me. I drove a lot of lories and farm tractors in games, and I backed up a lot of trailers. Farm trailers, which are attached to a standard receiver hitch, are a pain in the butt to back-up. Even farmers have a problem backing them up. Lorie trailers, on the other end, which are attached to a the lorie through a  gooseneck (of fifth-wheel) device, are much easier to back up. It takes some times to get used to it, but when you  get the hang of it, it`s a piece of cake. However, in the game, the dumper trailer, which attaches to the lorie with a simple ball, should be easy to back up, but it ain`t. It behaves more like a farm trailer than a lorie trailer, and is thus a pain in the butt to back up.\r\n\r\nI was going to buy the DLC, but han, han, not anymore. Too bad, this game would be a great game without those issues. I remember playing it two years ago. It was crappy then. So this game improved a lot in the last two years. Not enough though. It still has major issues.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it could have been a great game but the devs abandoned it in a sorry state. you can also tell it was made by someone who has no experience with construction or machinery",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the controls are terrible on both keyboard and controller. I couldn't even get past the first tutorial mission that's how jarring it was",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "feels like the first game from 2014 and is very unoptimized the controls are awful  i palyed this on free weekend but decided to make review ITS AWFUL JUST BUY FARMING SIMULATOR INSTEAD AND MOD IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play the dozer can become broken being able to be unmovable which hard locks the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disapointing graphics\nControls are horrible.\n\nBased on Unity game engine which has massive graphics limitations and known to have massive problems with game controllers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Be a better game if you can hire help on projects without getting in a lobby with full of yahoos . Really boring game and wish there was more appeasing transport trailers. I'm not spending another dime on these games where they give you bare minimum when there is so much more potential. Be cool if there was a season of building refineries,pipelines, Water & Wastewater facilities tons of other construction based \"projects\" out there but will not hold my breath from the developer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "These guys never heard of optimization for sure. My fans sound like a jumbo jet taking off even with very low settings with a PC that runs FS2020, X-Plane 11 and 12. Elden Ring and RDR2 with mid/high settings without any issue. My mouse keeps centering in the menus and map and I'm running dual joysticks and G29, same as in Farming Simulator 22 in which I have zero mouse centering issue. TrackIR 5 is weird when turning head to the left and right, it kind of gives you an angled view rather than a horizontal view and I get headaches with that. I really want to play the game as the excavator controls are very good but I cannot. Uninstalled to get 10 Gb of better usage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no ai helper for single player not as fun as 2015 for the coast of this game with all dlc on sale is a rip off unless you are into multi player  fells rushed and incomplete .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bought this game back in 2022 for like 50 dollars or 35 or sum this game is shit and is so fuckin bunz dont get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Low graphics (I recommend a more realistic game called roadcraft)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "need to add some more turck some with workin jake breaks and some peterbuilt to the game other then that game is dope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-First mission in tutorial\n-Speak with guy\n-Get objective \"Enter flatbed truck\"\n-Flatbed truck is buggy and nowhere to be seen\n-Uninstall game and refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT BUY I GOT IN A DIGGER AND IT LAUNCHED ME TO ANOTHER UNIVERSE, IM A PRO AT THIS IRL THIS GAME IS SO SHIT, THIS NEEDS TO BE TAKEN OF STEAM IT DOSENT DESERVE TO BE ON THIS AMAZING GAMING MARKETING PLATFORM.   DO NOT BUY!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was fun while it lasted. I only did a road job and house job and would of done the stadium but the game seems to almost like not be difficult but the controls are very weird. I know you can probably change them but it's long and time consuming which is normal but not ideal. If I have more time in the future and want to get the game on sale again then I will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a lot and lot of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a coop game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too complicated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's mostly cranes, cementing, and pushing dirt around. To be fair, it's some of the best dirt manipulation I've ever seen in a video game, but the rest of the game feels empty. There are no consequences to swinging items around too fast on the crane, there is no sandbox option, no hand tools only heavy machinery. The speed of the crane will make you question your life choices. Which kinda sucks because it's all basically cranes and driving. Filling up the dump truck every two feet will also make you go broke very fast (Why does it cost an arm and a leg for some dirt?!)\n\nIt's a decent looking game with a day/night cycle, but I kind of wish there was a weather system. Could be interesting to have to deal with unexpected problems like the rain screwing up your cement.\n\nThe only real reason I can't recommend this game is that it doesn't really allow the player to be creative in what they build and how. It's not a simulator. It's a crane game with contracts. Even the walls are prefabricated.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Tried returning to Construction Simulator 22 after not playing since launch. Unfortunately, the same issues remain for me:\n\nControls: imprecise and unintuitive.\n\nCamera: frequently behaves unpredictably.\n\nPerformance: consistent microstutters every second on a 5070 Ti / 64 GB / Ryzen 9 / M.2 setup.\n\nGiven how long it’s been out, it’s disappointing. It looks like energy went into license-driven DLC rather than making the core game feel good to play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a fantastic game that doesn't work very well. Don't know what I paid for it, and cost is not the issue. While it worked, it was quite like using the actual equipment. It provides the user with an in game mentor who guides you, and all the projects you could ask for. It's clever, well scripted and not too technical. Unfortunately, about 50 hours into the game, the controllers stopped working for no apparent reason. (They work with my other games.) I tried the support options a couple of times, but they were a waste of time and keystrokes. As best as I can tell, no one provides any kind of support for it. Not Steam, the developers, or anyone on Steam. There's no help, and no fix.  \r\nThere isn't even an interface for selecting controllers. None that I could find. No one on Steam seems to have any useful suggestions. Maybe I'm a dummy, but I didn't build an elaborate searchlight with no on/off switch; Or a three-story chalet with no stairs; Or a greenhouse with a tin roof and no windows. This is a technological contradiction, a fabulous game that gradually withdraws features and options that you know it has, until you give up in frustration.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game looks great. The story is interesting. The NPCs help a lot with the immersion. Driving the wheeled vehicles (except the Bobcat) is a charm. So why the thumb down? A few important (for me) reasons. First, there is a problem with spreading gravel. None of the vehicles, be it the dozer, the loader, the backhoe or the grader, will help you finish that task on contracts. I tried all of them, and although they should handle such a job without problems, none of them does it properly. The grader is actually not bad at it, but for some reasons, it has little to no effect on the percentage of the task. So, even if it does a decent job at spreading the gravel, it won\"t help you complete that task. The only vehicles that will allow you to complete those tasks are the dumpers. And good luck for figuring out how to do it. I\"ve been playing for 54 hours, and I am still looking for another machine that could do it right.\r\n\r\nSecond reason: driving the tracked vehicles. Those vehicles are a nightmare to drive, mostly because of the delay in their response to input (in my case, the keyboard/Tartarus keypad). Also because you need two keys to move them forward or backward. I didn`t try the tracked Bobcat for this reason. Instead, I rented the wheeled Bobcat... for about 5 minutes. This vehicle is a joke. Much worse than the tracked vehicles. I could hardly managed to get out of the yard with it. Even though it has wheels, you drive it the same way you would drive a vehicle equipped with tracks (like a tank).\r\n\r\nThird reasons: towing the trailer dumper. The physics don`t look right to me. I drove a lot of lories and farm tractors in games, and I backed up a lot of trailers. Farm trailers, which are attached to a standard receiver hitch, are a pain in the butt to back-up. Even farmers have a problem backing them up. Lorie trailers, on the other end, which are attached to a the lorie through a  gooseneck (of fifth-wheel) device, are much easier to back up. It takes some times to get used to it, but when you  get the hang of it, it`s a piece of cake. However, in the game, the dumper trailer, which attaches to the lorie with a simple ball, should be easy to back up, but it ain`t. It behaves more like a farm trailer than a lorie trailer, and is thus a pain in the butt to back up.\r\n\r\nI was going to buy the DLC, but han, han, not anymore. Too bad, this game would be a great game without those issues. I remember playing it two years ago. It was crappy then. So this game improved a lot in the last two years. Not enough though. It still has major issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it could have been a great game but the devs abandoned it in a sorry state. you can also tell it was made by someone who has no experience with construction or machinery",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the controls are terrible on both keyboard and controller. I couldn't even get past the first tutorial mission that's how jarring it was",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "feels like the first game from 2014 and is very unoptimized the controls are awful  i palyed this on free weekend but decided to make review ITS AWFUL JUST BUY FARMING SIMULATOR INSTEAD AND MOD IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play the dozer can become broken being able to be unmovable which hard locks the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Be a better game if you can hire help on projects without getting in a lobby with full of yahoos . Really boring game and wish there was more appeasing transport trailers. I'm not spending another dime on these games where they give you bare minimum when there is so much more potential. Be cool if there was a season of building refineries,pipelines, Water & Wastewater facilities tons of other construction based \"projects\" out there but will not hold my breath from the developer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "These guys never heard of optimization for sure. My fans sound like a jumbo jet taking off even with very low settings with a PC that runs FS2020, X-Plane 11 and 12. Elden Ring and RDR2 with mid/high settings without any issue. My mouse keeps centering in the menus and map and I'm running dual joysticks and G29, same as in Farming Simulator 22 in which I have zero mouse centering issue. TrackIR 5 is weird when turning head to the left and right, it kind of gives you an angled view rather than a horizontal view and I get headaches with that. I really want to play the game as the excavator controls are very good but I cannot. Uninstalled to get 10 Gb of better usage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no ai helper for single player not as fun as 2015 for the coast of this game with all dlc on sale is a rip off unless you are into multi player  fells rushed and incomplete .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bought this game back in 2022 for like 50 dollars or 35 or sum this game is shit and is so fuckin bunz dont get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Low graphics (I recommend a more realistic game called roadcraft)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "need to add some more turck some with workin jake breaks and some peterbuilt to the game other then that game is dope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-First mission in tutorial\n-Speak with guy\n-Get objective \"Enter flatbed truck\"\n-Flatbed truck is buggy and nowhere to be seen\n-Uninstall game and refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT BUY I GOT IN A DIGGER AND IT LAUNCHED ME TO ANOTHER UNIVERSE, IM A PRO AT THIS IRL THIS GAME IS SO SHIT, THIS NEEDS TO BE TAKEN OF STEAM IT DOSENT DESERVE TO BE ON THIS AMAZING GAMING MARKETING PLATFORM.   DO NOT BUY!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was fun while it lasted. I only did a road job and house job and would of done the stadium but the game seems to almost like not be difficult but the controls are very weird. I know you can probably change them but it's long and time consuming which is normal but not ideal. If I have more time in the future and want to get the game on sale again then I will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a lot and lot of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a coop game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too complicated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crash every 5 mins",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's mostly cranes, cementing, and pushing dirt around. To be fair, it's some of the best dirt manipulation I've ever seen in a video game, but the rest of the game feels empty. There are no consequences to swinging items around too fast on the crane, there is no sandbox option, no hand tools only heavy machinery. The speed of the crane will make you question your life choices. Which kinda sucks because it's all basically cranes and driving. Filling up the dump truck every two feet will also make you go broke very fast (Why does it cost an arm and a leg for some dirt?!)\n\nIt's a decent looking game with a day/night cycle, but I kind of wish there was a weather system. Could be interesting to have to deal with unexpected problems like the rain screwing up your cement.\n\nThe only real reason I can't recommend this game is that it doesn't really allow the player to be creative in what they build and how. It's not a simulator. It's a crane game with contracts. Even the walls are prefabricated.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Tried returning to Construction Simulator 22 after not playing since launch. Unfortunately, the same issues remain for me:\n\nControls: imprecise and unintuitive.\n\nCamera: frequently behaves unpredictably.\n\nPerformance: consistent microstutters every second on a 5070 Ti / 64 GB / Ryzen 9 / M.2 setup.\n\nGiven how long it’s been out, it’s disappointing. It looks like energy went into license-driven DLC rather than making the core game feel good to play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a fantastic game that doesn't work very well. Don't know what I paid for it, and cost is not the issue. While it worked, it was quite like using the actual equipment. It provides the user with an in game mentor who guides you, and all the projects you could ask for. It's clever, well scripted and not too technical. Unfortunately, about 50 hours into the game, the controllers stopped working for no apparent reason. (They work with my other games.) I tried the support options a couple of times, but they were a waste of time and keystrokes. As best as I can tell, no one provides any kind of support for it. Not Steam, the developers, or anyone on Steam. There's no help, and no fix.  \r\nThere isn't even an interface for selecting controllers. None that I could find. No one on Steam seems to have any useful suggestions. Maybe I'm a dummy, but I didn't build an elaborate searchlight with no on/off switch; Or a three-story chalet with no stairs; Or a greenhouse with a tin roof and no windows. This is a technological contradiction, a fabulous game that gradually withdraws features and options that you know it has, until you give up in frustration.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game looks great. The story is interesting. The NPCs help a lot with the immersion. Driving the wheeled vehicles (except the Bobcat) is a charm. So why the thumb down? A few important (for me) reasons. First, there is a problem with spreading gravel. None of the vehicles, be it the dozer, the loader, the backhoe or the grader, will help you finish that task on contracts. I tried all of them, and although they should handle such a job without problems, none of them does it properly. The grader is actually not bad at it, but for some reasons, it has little to no effect on the percentage of the task. So, even if it does a decent job at spreading the gravel, it won\"t help you complete that task. The only vehicles that will allow you to complete those tasks are the dumpers. And good luck for figuring out how to do it. I\"ve been playing for 54 hours, and I am still looking for another machine that could do it right.\r\n\r\nSecond reason: driving the tracked vehicles. Those vehicles are a nightmare to drive, mostly because of the delay in their response to input (in my case, the keyboard/Tartarus keypad). Also because you need two keys to move them forward or backward. I didn`t try the tracked Bobcat for this reason. Instead, I rented the wheeled Bobcat... for about 5 minutes. This vehicle is a joke. Much worse than the tracked vehicles. I could hardly managed to get out of the yard with it. Even though it has wheels, you drive it the same way you would drive a vehicle equipped with tracks (like a tank).\r\n\r\nThird reasons: towing the trailer dumper. The physics don`t look right to me. I drove a lot of lories and farm tractors in games, and I backed up a lot of trailers. Farm trailers, which are attached to a standard receiver hitch, are a pain in the butt to back-up. Even farmers have a problem backing them up. Lorie trailers, on the other end, which are attached to a the lorie through a  gooseneck (of fifth-wheel) device, are much easier to back up. It takes some times to get used to it, but when you  get the hang of it, it`s a piece of cake. However, in the game, the dumper trailer, which attaches to the lorie with a simple ball, should be easy to back up, but it ain`t. It behaves more like a farm trailer than a lorie trailer, and is thus a pain in the butt to back up.\r\n\r\nI was going to buy the DLC, but han, han, not anymore. Too bad, this game would be a great game without those issues. I remember playing it two years ago. It was crappy then. So this game improved a lot in the last two years. Not enough though. It still has major issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it could have been a great game but the devs abandoned it in a sorry state. you can also tell it was made by someone who has no experience with construction or machinery",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the controls are terrible on both keyboard and controller. I couldn't even get past the first tutorial mission that's how jarring it was",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "feels like the first game from 2014 and is very unoptimized the controls are awful  i palyed this on free weekend but decided to make review ITS AWFUL JUST BUY FARMING SIMULATOR INSTEAD AND MOD IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play the dozer can become broken being able to be unmovable which hard locks the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Be a better game if you can hire help on projects without getting in a lobby with full of yahoos . Really boring game and wish there was more appeasing transport trailers. I'm not spending another dime on these games where they give you bare minimum when there is so much more potential. Be cool if there was a season of building refineries,pipelines, Water & Wastewater facilities tons of other construction based \"projects\" out there but will not hold my breath from the developer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "These guys never heard of optimization for sure. My fans sound like a jumbo jet taking off even with very low settings with a PC that runs FS2020, X-Plane 11 and 12. Elden Ring and RDR2 with mid/high settings without any issue. My mouse keeps centering in the menus and map and I'm running dual joysticks and G29, same as in Farming Simulator 22 in which I have zero mouse centering issue. TrackIR 5 is weird when turning head to the left and right, it kind of gives you an angled view rather than a horizontal view and I get headaches with that. I really want to play the game as the excavator controls are very good but I cannot. Uninstalled to get 10 Gb of better usage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no ai helper for single player not as fun as 2015 for the coast of this game with all dlc on sale is a rip off unless you are into multi player  fells rushed and incomplete .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bought this game back in 2022 for like 50 dollars or 35 or sum this game is shit and is so fuckin bunz dont get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Low graphics (I recommend a more realistic game called roadcraft)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "need to add some more turck some with workin jake breaks and some peterbuilt to the game other then that game is dope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-First mission in tutorial\n-Speak with guy\n-Get objective \"Enter flatbed truck\"\n-Flatbed truck is buggy and nowhere to be seen\n-Uninstall game and refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT BUY I GOT IN A DIGGER AND IT LAUNCHED ME TO ANOTHER UNIVERSE, IM A PRO AT THIS IRL THIS GAME IS SO SHIT, THIS NEEDS TO BE TAKEN OF STEAM IT DOSENT DESERVE TO BE ON THIS AMAZING GAMING MARKETING PLATFORM.   DO NOT BUY!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was fun while it lasted. I only did a road job and house job and would of done the stadium but the game seems to almost like not be difficult but the controls are very weird. I know you can probably change them but it's long and time consuming which is normal but not ideal. If I have more time in the future and want to get the game on sale again then I will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a lot and lot of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a coop game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too complicated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crash every 5 mins",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's mostly cranes, cementing, and pushing dirt around. To be fair, it's some of the best dirt manipulation I've ever seen in a video game, but the rest of the game feels empty. There are no consequences to swinging items around too fast on the crane, there is no sandbox option, no hand tools only heavy machinery. The speed of the crane will make you question your life choices. Which kinda sucks because it's all basically cranes and driving. Filling up the dump truck every two feet will also make you go broke very fast (Why does it cost an arm and a leg for some dirt?!)\n\nIt's a decent looking game with a day/night cycle, but I kind of wish there was a weather system. Could be interesting to have to deal with unexpected problems like the rain screwing up your cement.\n\nThe only real reason I can't recommend this game is that it doesn't really allow the player to be creative in what they build and how. It's not a simulator. It's a crane game with contracts. Even the walls are prefabricated.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Tried returning to Construction Simulator 22 after not playing since launch. Unfortunately, the same issues remain for me:\n\nControls: imprecise and unintuitive.\n\nCamera: frequently behaves unpredictably.\n\nPerformance: consistent microstutters every second on a 5070 Ti / 64 GB / Ryzen 9 / M.2 setup.\n\nGiven how long it’s been out, it’s disappointing. It looks like energy went into license-driven DLC rather than making the core game feel good to play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a fantastic game that doesn't work very well. Don't know what I paid for it, and cost is not the issue. While it worked, it was quite like using the actual equipment. It provides the user with an in game mentor who guides you, and all the projects you could ask for. It's clever, well scripted and not too technical. Unfortunately, about 50 hours into the game, the controllers stopped working for no apparent reason. (They work with my other games.) I tried the support options a couple of times, but they were a waste of time and keystrokes. As best as I can tell, no one provides any kind of support for it. Not Steam, the developers, or anyone on Steam. There's no help, and no fix.  \r\nThere isn't even an interface for selecting controllers. None that I could find. No one on Steam seems to have any useful suggestions. Maybe I'm a dummy, but I didn't build an elaborate searchlight with no on/off switch; Or a three-story chalet with no stairs; Or a greenhouse with a tin roof and no windows. This is a technological contradiction, a fabulous game that gradually withdraws features and options that you know it has, until you give up in frustration.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game looks great. The story is interesting. The NPCs help a lot with the immersion. Driving the wheeled vehicles (except the Bobcat) is a charm. So why the thumb down? A few important (for me) reasons. First, there is a problem with spreading gravel. None of the vehicles, be it the dozer, the loader, the backhoe or the grader, will help you finish that task on contracts. I tried all of them, and although they should handle such a job without problems, none of them does it properly. The grader is actually not bad at it, but for some reasons, it has little to no effect on the percentage of the task. So, even if it does a decent job at spreading the gravel, it won\"t help you complete that task. The only vehicles that will allow you to complete those tasks are the dumpers. And good luck for figuring out how to do it. I\"ve been playing for 54 hours, and I am still looking for another machine that could do it right.\r\n\r\nSecond reason: driving the tracked vehicles. Those vehicles are a nightmare to drive, mostly because of the delay in their response to input (in my case, the keyboard/Tartarus keypad). Also because you need two keys to move them forward or backward. I didn`t try the tracked Bobcat for this reason. Instead, I rented the wheeled Bobcat... for about 5 minutes. This vehicle is a joke. Much worse than the tracked vehicles. I could hardly managed to get out of the yard with it. Even though it has wheels, you drive it the same way you would drive a vehicle equipped with tracks (like a tank).\r\n\r\nThird reasons: towing the trailer dumper. The physics don`t look right to me. I drove a lot of lories and farm tractors in games, and I backed up a lot of trailers. Farm trailers, which are attached to a standard receiver hitch, are a pain in the butt to back-up. Even farmers have a problem backing them up. Lorie trailers, on the other end, which are attached to a the lorie through a  gooseneck (of fifth-wheel) device, are much easier to back up. It takes some times to get used to it, but when you  get the hang of it, it`s a piece of cake. However, in the game, the dumper trailer, which attaches to the lorie with a simple ball, should be easy to back up, but it ain`t. It behaves more like a farm trailer than a lorie trailer, and is thus a pain in the butt to back up.\r\n\r\nI was going to buy the DLC, but han, han, not anymore. Too bad, this game would be a great game without those issues. I remember playing it two years ago. It was crappy then. So this game improved a lot in the last two years. Not enough though. It still has major issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it could have been a great game but the devs abandoned it in a sorry state. you can also tell it was made by someone who has no experience with construction or machinery",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the controls are terrible on both keyboard and controller. I couldn't even get past the first tutorial mission that's how jarring it was",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "feels like the first game from 2014 and is very unoptimized the controls are awful  i palyed this on free weekend but decided to make review ITS AWFUL JUST BUY FARMING SIMULATOR INSTEAD AND MOD IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play the dozer can become broken being able to be unmovable which hard locks the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Be a better game if you can hire help on projects without getting in a lobby with full of yahoos . Really boring game and wish there was more appeasing transport trailers. I'm not spending another dime on these games where they give you bare minimum when there is so much more potential. Be cool if there was a season of building refineries,pipelines, Water & Wastewater facilities tons of other construction based \"projects\" out there but will not hold my breath from the developer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "These guys never heard of optimization for sure. My fans sound like a jumbo jet taking off even with very low settings with a PC that runs FS2020, X-Plane 11 and 12. Elden Ring and RDR2 with mid/high settings without any issue. My mouse keeps centering in the menus and map and I'm running dual joysticks and G29, same as in Farming Simulator 22 in which I have zero mouse centering issue. TrackIR 5 is weird when turning head to the left and right, it kind of gives you an angled view rather than a horizontal view and I get headaches with that. I really want to play the game as the excavator controls are very good but I cannot. Uninstalled to get 10 Gb of better usage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no ai helper for single player not as fun as 2015 for the coast of this game with all dlc on sale is a rip off unless you are into multi player  fells rushed and incomplete .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bought this game back in 2022 for like 50 dollars or 35 or sum this game is shit and is so fuckin bunz dont get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Low graphics (I recommend a more realistic game called roadcraft)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "need to add some more turck some with workin jake breaks and some peterbuilt to the game other then that game is dope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-First mission in tutorial\n-Speak with guy\n-Get objective \"Enter flatbed truck\"\n-Flatbed truck is buggy and nowhere to be seen\n-Uninstall game and refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT BUY I GOT IN A DIGGER AND IT LAUNCHED ME TO ANOTHER UNIVERSE, IM A PRO AT THIS IRL THIS GAME IS SO SHIT, THIS NEEDS TO BE TAKEN OF STEAM IT DOSENT DESERVE TO BE ON THIS AMAZING GAMING MARKETING PLATFORM.   DO NOT BUY!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was fun while it lasted. I only did a road job and house job and would of done the stadium but the game seems to almost like not be difficult but the controls are very weird. I know you can probably change them but it's long and time consuming which is normal but not ideal. If I have more time in the future and want to get the game on sale again then I will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a lot and lot of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a coop game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too complicated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crash every 5 mins",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's mostly cranes, cementing, and pushing dirt around. To be fair, it's some of the best dirt manipulation I've ever seen in a video game, but the rest of the game feels empty. There are no consequences to swinging items around too fast on the crane, there is no sandbox option, no hand tools only heavy machinery. The speed of the crane will make you question your life choices. Which kinda sucks because it's all basically cranes and driving. Filling up the dump truck every two feet will also make you go broke very fast (Why does it cost an arm and a leg for some dirt?!)\n\nIt's a decent looking game with a day/night cycle, but I kind of wish there was a weather system. Could be interesting to have to deal with unexpected problems like the rain screwing up your cement.\n\nThe only real reason I can't recommend this game is that it doesn't really allow the player to be creative in what they build and how. It's not a simulator. It's a crane game with contracts. Even the walls are prefabricated.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Tried returning to Construction Simulator 22 after not playing since launch. Unfortunately, the same issues remain for me:\n\nControls: imprecise and unintuitive.\n\nCamera: frequently behaves unpredictably.\n\nPerformance: consistent microstutters every second on a 5070 Ti / 64 GB / Ryzen 9 / M.2 setup.\n\nGiven how long it’s been out, it’s disappointing. It looks like energy went into license-driven DLC rather than making the core game feel good to play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a fantastic game that doesn't work very well. Don't know what I paid for it, and cost is not the issue. While it worked, it was quite like using the actual equipment. It provides the user with an in game mentor who guides you, and all the projects you could ask for. It's clever, well scripted and not too technical. Unfortunately, about 50 hours into the game, the controllers stopped working for no apparent reason. (They work with my other games.) I tried the support options a couple of times, but they were a waste of time and keystrokes. As best as I can tell, no one provides any kind of support for it. Not Steam, the developers, or anyone on Steam. There's no help, and no fix.  \r\nThere isn't even an interface for selecting controllers. None that I could find. No one on Steam seems to have any useful suggestions. Maybe I'm a dummy, but I didn't build an elaborate searchlight with no on/off switch; Or a three-story chalet with no stairs; Or a greenhouse with a tin roof and no windows. This is a technological contradiction, a fabulous game that gradually withdraws features and options that you know it has, until you give up in frustration.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game looks great. The story is interesting. The NPCs help a lot with the immersion. Driving the wheeled vehicles (except the Bobcat) is a charm. So why the thumb down? A few important (for me) reasons. First, there is a problem with spreading gravel. None of the vehicles, be it the dozer, the loader, the backhoe or the grader, will help you finish that task on contracts. I tried all of them, and although they should handle such a job without problems, none of them does it properly. The grader is actually not bad at it, but for some reasons, it has little to no effect on the percentage of the task. So, even if it does a decent job at spreading the gravel, it won\"t help you complete that task. The only vehicles that will allow you to complete those tasks are the dumpers. And good luck for figuring out how to do it. I\"ve been playing for 54 hours, and I am still looking for another machine that could do it right.\r\n\r\nSecond reason: driving the tracked vehicles. Those vehicles are a nightmare to drive, mostly because of the delay in their response to input (in my case, the keyboard/Tartarus keypad). Also because you need two keys to move them forward or backward. I didn`t try the tracked Bobcat for this reason. Instead, I rented the wheeled Bobcat... for about 5 minutes. This vehicle is a joke. Much worse than the tracked vehicles. I could hardly managed to get out of the yard with it. Even though it has wheels, you drive it the same way you would drive a vehicle equipped with tracks (like a tank).\r\n\r\nThird reasons: towing the trailer dumper. The physics don`t look right to me. I drove a lot of lories and farm tractors in games, and I backed up a lot of trailers. Farm trailers, which are attached to a standard receiver hitch, are a pain in the butt to back-up. Even farmers have a problem backing them up. Lorie trailers, on the other end, which are attached to a the lorie through a  gooseneck (of fifth-wheel) device, are much easier to back up. It takes some times to get used to it, but when you  get the hang of it, it`s a piece of cake. However, in the game, the dumper trailer, which attaches to the lorie with a simple ball, should be easy to back up, but it ain`t. It behaves more like a farm trailer than a lorie trailer, and is thus a pain in the butt to back up.\r\n\r\nI was going to buy the DLC, but han, han, not anymore. Too bad, this game would be a great game without those issues. I remember playing it two years ago. It was crappy then. So this game improved a lot in the last two years. Not enough though. It still has major issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it could have been a great game but the devs abandoned it in a sorry state. you can also tell it was made by someone who has no experience with construction or machinery",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the controls are terrible on both keyboard and controller. I couldn't even get past the first tutorial mission that's how jarring it was",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "feels like the first game from 2014 and is very unoptimized the controls are awful  i palyed this on free weekend but decided to make review ITS AWFUL JUST BUY FARMING SIMULATOR INSTEAD AND MOD IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play the dozer can become broken being able to be unmovable which hard locks the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Be a better game if you can hire help on projects without getting in a lobby with full of yahoos . Really boring game and wish there was more appeasing transport trailers. I'm not spending another dime on these games where they give you bare minimum when there is so much more potential. Be cool if there was a season of building refineries,pipelines, Water & Wastewater facilities tons of other construction based \"projects\" out there but will not hold my breath from the developer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "These guys never heard of optimization for sure. My fans sound like a jumbo jet taking off even with very low settings with a PC that runs FS2020, X-Plane 11 and 12. Elden Ring and RDR2 with mid/high settings without any issue. My mouse keeps centering in the menus and map and I'm running dual joysticks and G29, same as in Farming Simulator 22 in which I have zero mouse centering issue. TrackIR 5 is weird when turning head to the left and right, it kind of gives you an angled view rather than a horizontal view and I get headaches with that. I really want to play the game as the excavator controls are very good but I cannot. Uninstalled to get 10 Gb of better usage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no ai helper for single player not as fun as 2015 for the coast of this game with all dlc on sale is a rip off unless you are into multi player  fells rushed and incomplete .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bought this game back in 2022 for like 50 dollars or 35 or sum this game is shit and is so fuckin bunz dont get it",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}