{
  "positive": [
    {
      "review": "I absolutly love this game. Its well worth the price and is just a great time to play.\nThere are guides to help you in the community section that helps with getting your players set up for your first playthrough.\nMy personal favorite champ is Lan because if you focus on her you do some crazy damage.\n\nI really hope they come out with another champion pack to increase your choices.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A pretty finely crafted management game mixed with a solid card-based combat for the matches.\r\n\r\nEsport Godfather in its management side combine a lot of mini games of sort which manage to not overstay their welcome while all remaining mostly relevant as you progress. The learning curve can be a bit steep, but once you start knowing your way around the mechanics and the heroes, you start to put all the pieces together, and that's when it really becomes fun. The game is easily customisable in a lot of aspects, meaning you can choose to engage or not with some mechanics, and make the experience as challenging as you wish it to be. Two new modes were also recently added, offering new ways to play, including a roguelike mode for people who want to focus on the matches more than the management.\r\n\r\nWhile being a fun and mostly well put together game, however, it's not without flaws:\r\nThe heroes aren't balanced well, and while some are very potent, others are real stinkers, and some seem to only exist fo the AI to annoy you with because while annoying they aren't exactly strong. The stats decay mechanic is only there to make you use the transfer system, yet it's totally possible to win all the cups with your starting five atheletes. The recently added world cup is really really unbalanced with the opposing teams having over inflated stats making playing against them a really unfair and unfun experience. And while the leagues and playoffs give you breaks to train, the world cup locks you out of a lot of trainings, so you're stuck mostly with what you have. No scrims, no intensive training, no regular training when you reach the quarter of finals. In addition to that the english translation is mostly serviceable, but certainly not good, having been translated from the original chinese. Some choices make absolutely no sense so it's difficult to piece what the games means.\r\n\r\nStill if you can endure all that, there is a rough gem of the game underneath, and it's good enough to get you hooked even if you know nothing about MOBAs, or very little. That's saying something.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game, but to have a smooth performance should play with mid range spec pc, The game is just simulation as esport manager. But need to works on gender pronouns because i used female avatar but the dialog keep use 'him'.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Esports Godfather is a good management deck-building game that offers plenty of variety and focuses on strategic planning.\nIt has high replay value with numerous different mechanics and various game modes.\nThe mod community also adds further replayability, depth and variety to the game in additional ways.\n\nAll in all, it's a very good game, also in terms of value for money.\n\nThe DLCs are not essential purchases and only add more heroes to the already large base offering of possibilities. However, the DLCs allow you to continue supporting the developers and give you a new gaming experience with additional strategies thanks to the new heroes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just to get the disclaimer out of the way: Yes, the game uses generative AI for character portraits and some card artwork (I think). No, I don't think this is equal to other big companies, such as Activision using it.\n\nThe game is really, really solid, to the point I wish more people would take inspiration in this formula:\nYou have 5 players, each with 3 cards in their pool, in each game you pick 5 champions, which each have 2-5 cards in their pool, you mix them together and that's your deck. This formula makes for very customizable decks and strategies, and depending on your setting, very unique and niche ones, which is what I like in deckbuilders.\nThe soundtrack is very catchy, even though it's nothing special.\n\nBesides that, they already put some free DLC content besides the 2 paid ones, with more champions available, new leagues and they're always looking to improve, listening to the community in all aspects, showing not only that they care, but they're always looking to deliver a better experience.\n\nI surely recommend this game today, because there's been a lot of bug and translation fixes that improved the game feel since launch and would've recommended on launch, even with the issues mentioned before.\nIf you like deckbuilders, you should give it a try\nIf you like deckbuilders and the MOBA environment, you must try it. You won't regret it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Esports game out there. A few bugs here and there (Premier League teams are demoted randomly instead of by record if you make it to Worlds), but other than that, one of my most played games on Steam that I'll keep coming back to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting mix of MOBA drafting, auto-battler, sports manager, and roguelike deckbuilding. 10/10 highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredible mix of team management and card battler with the wrapping of legally distinct MOBA paint. Absolutely a case of \"Just one more week\" until it's 3am. I recently jumped back into it to see the newest version updates, and currently impressed with some of the new ways to shake up the leagues. \n\nIf you're even mildly a fan of card battlers or management sims, pick this one up. It really scratches that itch for bringing a team from zero to hero.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The translation still isn't great and it suffers from the same problems that a lot of sims do- you're either behind the 8-ball or rolling to victory (though the new campaign variation helps this). It's still an entirely unique game with some adorable graphics and that great strategy pop of making you feel clever when you gank Bot Lane, or have you cheering for your Mid when they get away at 5 HP and be like, \"I trained you to do that!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Esports Godfather was surprisingly good. Time seems to flow faster while you work out your strategies and build your teams. The developer has been putting out additional content for no extra cost and there's loads of mods available to cater to your needs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun. The games themselves are great! It's exciting to find broken combos in the pick & ban phase and I always enjoy when my farmed team gets into the late game fights, hopefully destroying the other team, haha.\r\n\r\nYes, some parts are repetitive and not very meaningful to me, e.g. the interviews and many of the generated comments around the game. But that's fine. They do evoke the feeling of an Esports Coach. \r\nTranslation is not always on points and sometimes even wrong. But I can live with that, too. \r\n\r\nWell-rounded package that draws me in every once in a while, either to win the championship or now for the rogue run. \r\n\r\nDLCs recommended, but not needed when you start. You anyway begin the game with not all heroes available since the game introduces elements over time. \r\n\r\n150 hours in and still enjoying it big times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "teamfight manager game but probably 3 or 4 times better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FM 4 MOBA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't felt giddy playing a video game in a long time; playing this is addicting from the moment the music starts to the selection of the wacky coach to the scuffed team icons to the ridiculously bad translation errors on the level of ye ol' all your base are belong to us: it's just fundamentally charming on every level...\n\nAnd that is quite apart from the genuinely deep, intellectually involved, management sim behind it. The stakes are... pretty much nonexistent, in that you can win with bad comps but good stats/game strategy; it has the Arknights choose-your-own-difficulty factor: yes, you can bust out hypereffective supermeta team comps that don't care what the enemy builds at all because they'll have you effectively victorius before you even get the chance to play; but 'winning' for winning's sake isn't 'fun', just as you don't need Wis Adel in Arknights to play *any* map: nearly the entire game can be beaten using the cheapest units in the game effectively.\n\nThe same holds true here. Yes: Frank is a top beast... but as a mid you can run Kid up top, and funnel everything into the final teamfight. Yes: Felyn+Blocker will obliterate towers, as Elmi+Bart will obliterate towers, both cannot be stopped... but protecting vulnerable supergankable Elmi mid pushing with a dedicated global support network makes victory 100 times sweeter... and every game's mix of bans/picks means you get to construct creative winning strategies on the fly that are so idiosyncratic to your current Players and their Pools and the state of the Balance Patches and currently available Items that:\n\nI can't expect any two games to ever be alike, unless I very carefully cookie cutter my way to victory. Without a doubt, I want more DLC for this game, because I love it and I genuinely hope that the developers are able to keep working on it for a long time.\n\nMy infinite love, and highest recommendation. as a person who loves Binding of Isaac, Hades, Slay The Spire, Monster Train, and everything to do with a good management sim (though this element is still pretty lite: the aesthetics of a good management game are 100% here; and as no stranger to Animal Crossing? A good aesthetic is a good experience).",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Solid MOBA-like strategy game. Good character variety, strategic depth and replay value. Some AI usage, but minimal with valid explanations given. Devs are surprisingly good on communicating with player base despite being Chinese.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Amazing game!!! if you like MOBAs, autobattlers, management sims, and card games, this game does a great job of incorporating these genres together. The MOBA characters have unique kits with lots of room for creativity and strats for combos. Dev is really active as well, if you look at comments at patch notes that mention bugs, they address it within a day or 2, never seen a game treated with such care. \n\nOnly recommendations I would like to see Dev add is a way to speed up enemy AI turns, less ingame patch during world tournament (after every match is overkill imo), and better team stats/history features",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Cannot recommend this game enough!!  I love autobattlers and I love Slay the Spire, Monster Train, etc.  I've never been a huge fan of the MOBA team simulators because they just seem so random and luck based - but this game fixes that by giving you cards to play, different talents to unlock, deck-building, base-building, exciting draft picks, events where choices give you different perks, relationship/emotional changes to juggle, and so much more depth than those other games!  This is my new addiction and completely worth the price of the DLCs!  Get it all for a low price and enjoy throwing your days away due to \"just-one-more-turn\" syndrome...",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Many games usually fails due to their shallow-ness. Nice \"hyper-realistic\" or eye-pleasing and clean graphics but the average person gets bored of the gameplay in an hour, for that game is similar to hundreds of others already.\n\nEsports Godfather is the one and only game I've encountered where the problem mentioned above is flipped, it has a decently fleshed-out Esport team management and around 40 UNIQUE CHARACTER your athletes can control with charming pixel graphic to them. Each match is not just simulated by a click of a button, but you play it out, with the outcome influenced by your character matchup, combos, counters, map-modifiers, etc.\nOn the flip-side, the first thing you see visually upon starting a new game is AI-art for you to customize the logo and the athletes...\n...Which I completely understand that a small team needs this so they can concentrate on the fun game they have made here, and I hope that you can tolerate this too if you are interested in this title.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I absolutly love this game. Its well worth the price and is just a great time to play.\nThere are guides to help you in the community section that helps with getting your players set up for your first playthrough.\nMy personal favorite champ is Lan because if you focus on her you do some crazy damage.\n\nI really hope they come out with another champion pack to increase your choices.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Dev is really active despite the language barrier.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is an amazing game. Much deeper than you would expect from screenshots. I am playing it for weeks already. It combines many aspects that I search for in games like deep tactics, character customization and mechanical growth. And it also poses a challenge! Especially interesting part of the game are random rules changes! You have to adapt to these changes and you can get into a situation where the tactic you were successfully spamming all the time no longer works due to new rules! Heroes change too. And there are a lot of interesting aspects of managing your team. All in all it is a great game. If you are fond of card battlers and tactic games you should definitely try it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A pretty finely crafted management game mixed with a solid card-based combat for the matches.\r\n\r\nEsport Godfather in its management side combine a lot of mini games of sort which manage to not overstay their welcome while all remaining mostly relevant as you progress. The learning curve can be a bit steep, but once you start knowing your way around the mechanics and the heroes, you start to put all the pieces together, and that's when it really becomes fun. The game is easily customisable in a lot of aspects, meaning you can choose to engage or not with some mechanics, and make the experience as challenging as you wish it to be. Two new modes were also recently added, offering new ways to play, including a roguelike mode for people who want to focus on the matches more than the management.\r\n\r\nWhile being a fun and mostly well put together game, however, it's not without flaws:\r\nThe heroes aren't balanced well, and while some are very potent, others are real stinkers, and some seem to only exist fo the AI to annoy you with because while annoying they aren't exactly strong. The stats decay mechanic is only there to make you use the transfer system, yet it's totally possible to win all the cups with your starting five atheletes. The recently added world cup is really really unbalanced with the opposing teams having over inflated stats making playing against them a really unfair and unfun experience. And while the leagues and playoffs give you breaks to train, the world cup locks you out of a lot of trainings, so you're stuck mostly with what you have. No scrims, no intensive training, no regular training when you reach the quarter of finals. In addition to that the english translation is mostly serviceable, but certainly not good, having been translated from the original chinese. Some choices make absolutely no sense so it's difficult to piece what the games means.\r\n\r\nStill if you can endure all that, there is a rough gem of the game underneath, and it's good enough to get you hooked even if you know nothing about MOBAs, or very little. That's saying something.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game. Biggest strengths are how fun both the management sim and the \"in game\" games are. Biggest weakness for me was the English translation, which is only so-so.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the exception! and it is brilliant.\r\n\r\nI've always been interested in esports sim games where you manage a team and make them the best at \r\ntheir field by putting in strategies and make players unique and strong in their own way.\r\n\r\nI'd argue 99% of all games like this one are nothing but a money grab that offer very little outside of hopes and dreams.\r\n\r\nThis game not only offers the full package of what you can do as an esports team manager but has also continued to update frequently throughout the years to the point where returning to the game now gave me 20+ hours of discovering the game again as if it was a brand new game.\r\n\r\nIf you are into the idea of this type of game then THIS is the game.\r\n\r\nHaving tried many variations this is hands down the best by far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, but to have a smooth performance should play with mid range spec pc, The game is just simulation as esport manager. But need to works on gender pronouns because i used female avatar but the dialog keep use 'him'.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Esports Godfather is a good management deck-building game that offers plenty of variety and focuses on strategic planning.\nIt has high replay value with numerous different mechanics and various game modes.\nThe mod community also adds further replayability, depth and variety to the game in additional ways.\n\nAll in all, it's a very good game, also in terms of value for money.\n\nThe DLCs are not essential purchases and only add more heroes to the already large base offering of possibilities. However, the DLCs allow you to continue supporting the developers and give you a new gaming experience with additional strategies thanks to the new heroes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just to get the disclaimer out of the way: Yes, the game uses generative AI for character portraits and some card artwork (I think). No, I don't think this is equal to other big companies, such as Activision using it.\n\nThe game is really, really solid, to the point I wish more people would take inspiration in this formula:\nYou have 5 players, each with 3 cards in their pool, in each game you pick 5 champions, which each have 2-5 cards in their pool, you mix them together and that's your deck. This formula makes for very customizable decks and strategies, and depending on your setting, very unique and niche ones, which is what I like in deckbuilders.\nThe soundtrack is very catchy, even though it's nothing special.\n\nBesides that, they already put some free DLC content besides the 2 paid ones, with more champions available, new leagues and they're always looking to improve, listening to the community in all aspects, showing not only that they care, but they're always looking to deliver a better experience.\n\nI surely recommend this game today, because there's been a lot of bug and translation fixes that improved the game feel since launch and would've recommended on launch, even with the issues mentioned before.\nIf you like deckbuilders, you should give it a try\nIf you like deckbuilders and the MOBA environment, you must try it. You won't regret it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Esports game out there. A few bugs here and there (Premier League teams are demoted randomly instead of by record if you make it to Worlds), but other than that, one of my most played games on Steam that I'll keep coming back to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredible mix of team management and card battler with the wrapping of legally distinct MOBA paint. Absolutely a case of \"Just one more week\" until it's 3am. I recently jumped back into it to see the newest version updates, and currently impressed with some of the new ways to shake up the leagues. \n\nIf you're even mildly a fan of card battlers or management sims, pick this one up. It really scratches that itch for bringing a team from zero to hero.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The translation still isn't great and it suffers from the same problems that a lot of sims do- you're either behind the 8-ball or rolling to victory (though the new campaign variation helps this). It's still an entirely unique game with some adorable graphics and that great strategy pop of making you feel clever when you gank Bot Lane, or have you cheering for your Mid when they get away at 5 HP and be like, \"I trained you to do that!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Esports Godfather was surprisingly good. Time seems to flow faster while you work out your strategies and build your teams. The developer has been putting out additional content for no extra cost and there's loads of mods available to cater to your needs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun. The games themselves are great! It's exciting to find broken combos in the pick & ban phase and I always enjoy when my farmed team gets into the late game fights, hopefully destroying the other team, haha.\r\n\r\nYes, some parts are repetitive and not very meaningful to me, e.g. the interviews and many of the generated comments around the game. But that's fine. They do evoke the feeling of an Esports Coach. \r\nTranslation is not always on points and sometimes even wrong. But I can live with that, too. \r\n\r\nWell-rounded package that draws me in every once in a while, either to win the championship or now for the rogue run. \r\n\r\nDLCs recommended, but not needed when you start. You anyway begin the game with not all heroes available since the game introduces elements over time. \r\n\r\n150 hours in and still enjoying it big times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean, it looks very simple the graphics, but it is a very catchy game!\nIt is a MOBA manager game, and it is kinda interesting, because you are in charge of managing the team and you are the coach at the same time, you have to know what heroes are suitable for the player, have to select the patches (yes, you have to select what changes from one patch to another), select academy players and get players from the window transfer post-season..\nIt has a lot of details, and they are consistently updating the game, so it has a lot of potential",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The presence system in it's current state can be frustrating. The DLC is expensive for what it actually adds.\n\nBut overall it's very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite what I thought going in not being a fan of card battlers usually, I find this game incredibly charming. It has a lot of that \"just one more\" energy, and I'm glad that it focuses on delivering a specific experience of being a coach, rather than just some manager. It really helps to highlight that as a coach, there's things you can and can't change. Preparing a team for success is not the same as succeeding, and I think that's a crucial and important distinction.\r\n\r\nI keep finding myself stumped. frustrated, elated, and determined all at once, and I can honestly say that this is going right into my favorites.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is quite addicting and has a lot of tactical depth. Still learning but it's been a blast so far.   Overall if you like the MOBA genre, this is going to be a game you should give a square go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Русский/English\n\nДовольно интересный симулятор тренера киберспортсменов, но, привыкайте к тому, что перед файтом за дракона у ии будут бафы на ману и 10 карт инициации файта и вас разнесут в слюни. \nНужно дать тычку по ддшеру или хилу врага? Нет, твоим юным faker'ам нужно побить танка. \nУ твоего второго лайна мало хп? конечно же враг будет бить их, аналогичная ситуация у врага? черт возьми, посмотри какой вкусный фулловый танк врага, скинемся по тычке в него и промахнемся.\n10/10 переигровок с тимой с последнего места в таблице.\n\nQuite an interesting simulator of an eSports trainer, but get used to the fact that before the fight for the dragon, AI will have mana buffs and 10 cards to initiate the fight and you will be blown to pieces. \nDo you need to give a poke to the enemy's damage dps or heal? No, your young fakers need to beat up the tank. \nIs your second line low on HP? of course the enemy will beat them.\nIs the enemy in a similar situation? damn bro, look at how tasty the enemy's tank is, let's poke him and miss.\n10/10 replays with team from last place in the table.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It can be overwhelming at the beginning, especially if you don't know much about playing a MOBA yourself (lucky you), but it's a real pleasure to learn and win difficult games with well thought out plans.\r\n\r\nI recommend taking it slow, don't rush to get promoted, or you'll get showered with new champions and new features faster than you can learn them!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "anything that makes me spend 50 hours below the 15$ is a must buy. totally worth the price for what your are given. if you like esports and moba strats then its a must buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A truly unique and addicting card game and management game that has continuously gotten better over time due to the hard work of the devs, who have already released two major updates to the game incorporating community feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good management game with deck-building + autobattle gameplay. I really recommended it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite fun and unique game. Some of the translation and mechanics are a bit rough but there is plenty to love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game to play while unwinding at the end of the day and watching videos on the other monitor. Music gets a bit repetative, so I play w/ music muted. Combines deck building with team management and an esports theme. Think LoL or DOTA. The battles are all automatic, so think TFT w/o the unit placement. There's a threat system to make it not just random. Players get their own stats and cards. The hero they play gets their own cards which get combined w/ the player cards to be combined w/ all players cards for a deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and addictive game.\n\nDevs deserve huge credit for constantly updating and releasing fresh content for FREE!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Card battler MOBA with some management elements, enough said. All the stats got my tism stimming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have never sent an email due to bugs but I did for the first time, they saw it in 30 minutes and replied me back just to say they fixed it. I do not care if it was only a slight fix but how fast they respond is admirable especially when I assume we have the same time zone (Philippines and China) when I sent it at around 11 pm already.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Highly recommend for my fellow strategy enjoyers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Moba manager, only wish there was no AI art, and I hope if they make enough money, they may take the time to hire artists",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game, cool management, small ai use, neat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting mix of MOBA drafting, auto-battler, sports manager, and roguelike deckbuilding. 10/10 highly recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very good idea, mixing a management game with a card-based strategy and an autobattler, works quite well and is a ton of fun. The English translation is very wonky, the UI could be clearer and some mechanics are not that well explained, and I generally dislike using AI to generate graphics (although paying for some art and then training the AI to generate derivatives of what was bought is one of the less awful ways to do it). However, as far as I'm aware, there's no game in existence that does e-sports as well as this one. Recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Suprisingly in-depth and addicting even after long hours of play. Highly recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very cool simulation/management game. The card system blends managing a team and being involved in moment-to-moment gameplay really well. It lets you directly influence games enough to make those big, game-changing moments feel incredibly rewarding (or disappointing, depending on the result). The heroes are interesting and well designed. The way in which athletes improve and decline, the transfer market, and developing your home arena; they're all interesting systems to play and tinker with between games. I guess they do become somewhat tedious at times, but that comes with the territory. Regular changes to heroes, items, and gameplay patches keep things interesting from season to season.\n\nSome advice for those people starting the game: You don't need to read every single hero ability, card, player passive skill, etc. straight away. Just go into your first match! You'll come to read and understand these gradually over time. Focus on your team first, perhaps even pick the same team composition for the first handful of games. Read one or two heroes' abilities and cards per game. You don't need to read and know everything at the beginning!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a great E-Sports management game. Small team that really puts forth the effort. Keep up the great work!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The strategic and management aspects of this game are surprisingly deep with a learning curve that is easy to learn but difficult to master.  I'm working on beating Esports Godfather on the highest difficulty for the achievements, which is challenging yet reasonably possible.  The devs updated the game with 2 new game modes recently and I am still genuinely surprised at the level of strategic gameplay depth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can play Dota without play Dota 10/10\r\n\r\nJust play 1 Strat JUSTICE MID = AUTO WIN, if it ain't justice iam reloading till they dont ban my girl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played through the game on each difficulty. Every few months, I notice they've added something new, and I get hooked again. Great management game. Hard to explain exactly what the main gameplay is since it feel unique. It's like turn based league of legends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For some players there was too much micromanagement between matches, for some too little, so the devs made three separate versions of the game. I wish every company catered to their community the same way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So before I get into the review I just wanna preface; eSports Godfather uses a lot of AI 'art'. The player portraits, the hero portraits, and probably more are built out of an AI model. For people vehemently against the use of AI, I just want it out there. That said for me, AI art is an immediate con, but it won't keep me from liking the game.\n\nOther things of Note:\n> Lots of events between games.\n> Some of the translations are a bit ambitious.\n> The in-game system is effectively a TCG.\n\nCons:\n------AI Art\n--Lots of downtime between auto saves, and no manual save feature.\n- I wish the game made an effort to make it's MOBA 'world' feel more cohesive then it does to me, but I suppose if you just think of it as Final Fantasy it works well enough.\n- Patch system feels like a MOBA then I would like, with champiosn effectively being reworked randomly and items removed and added with no connection to their relative strength.\n-Fights between teams are just auto attacks back and forth.\n\nPros:\n++Gameplay is more involved then the original Teamfight Manager outside of draft.\n++Learning the item and champion METAs feels rewarding.\n++The deck-building system between drafted champions and the cards attached top your players is actually quite in-depth, though some cards feel like direct upgrades.\n++You can use your original team for longer periods of time then other eSports managers.\n++Their is a gook mix of management and game-running.\n\nOverall: \nWith marks against it for AI use, I have fallen in love with this game as an evolution of Teamfight Manager, and while it may fall by the wayside for me when the second Teamfight comes out, the game is in-depth and sucks me in for extended periods. I wish the game had a more Teamfight Manager esque patch and fight system, but those desires are made up for me when it comes to learning the item metas and how to make an effective deck between the heroes and players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Posting this before I play with the new stuff of 3.1.8. and DLC 2. This is a deep game. Daunting. I enjoy the game even if my friends are disgusted with the use of A.I.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't played this since release, and it was already super fun. My point is, props to the devs for continuously adding new things and features, when it would be all too easy to just stop after the initial success.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would literally sell my mother for a LoL manager game anywhere close as good as this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "teamfight manager game but probably 3 or 4 times better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Teamfight manager but better in every way",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Surprisingly addicting, truly a hidden gem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really fun and does feel like a a real team when your players run it down :V",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "such a good game that i got the dlc for support more than wanting them. :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally, a decent \"Manager\" game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 nearly as addictive as dota",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really unique game. super fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for its niche",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very very great game actually @@",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We need more games like this in the world.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "nothing like this game...yet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a game 🙏",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Why do people keep picking Monkey mid?\"",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun moba card game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "很耐玩！",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FM 4 MOBA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "insane bot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waaah",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't felt giddy playing a video game in a long time; playing this is addicting from the moment the music starts to the selection of the wacky coach to the scuffed team icons to the ridiculously bad translation errors on the level of ye ol' all your base are belong to us: it's just fundamentally charming on every level...\n\nAnd that is quite apart from the genuinely deep, intellectually involved, management sim behind it. The stakes are... pretty much nonexistent, in that you can win with bad comps but good stats/game strategy; it has the Arknights choose-your-own-difficulty factor: yes, you can bust out hypereffective supermeta team comps that don't care what the enemy builds at all because they'll have you effectively victorius before you even get the chance to play; but 'winning' for winning's sake isn't 'fun', just as you don't need Wis Adel in Arknights to play *any* map: nearly the entire game can be beaten using the cheapest units in the game effectively.\n\nThe same holds true here. Yes: Frank is a top beast... but as a mid you can run Kid up top, and funnel everything into the final teamfight. Yes: Felyn+Blocker will obliterate towers, as Elmi+Bart will obliterate towers, both cannot be stopped... but protecting vulnerable supergankable Elmi mid pushing with a dedicated global support network makes victory 100 times sweeter... and every game's mix of bans/picks means you get to construct creative winning strategies on the fly that are so idiosyncratic to your current Players and their Pools and the state of the Balance Patches and currently available Items that:\n\nI can't expect any two games to ever be alike, unless I very carefully cookie cutter my way to victory. Without a doubt, I want more DLC for this game, because I love it and I genuinely hope that the developers are able to keep working on it for a long time.\n\nMy infinite love, and highest recommendation. as a person who loves Binding of Isaac, Hades, Slay The Spire, Monster Train, and everything to do with a good management sim (though this element is still pretty lite: the aesthetics of a good management game are 100% here; and as no stranger to Animal Crossing? A good aesthetic is a good experience).",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Solid MOBA-like strategy game. Good character variety, strategic depth and replay value. Some AI usage, but minimal with valid explanations given. Devs are surprisingly good on communicating with player base despite being Chinese.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Amazing game!!! if you like MOBAs, autobattlers, management sims, and card games, this game does a great job of incorporating these genres together. The MOBA characters have unique kits with lots of room for creativity and strats for combos. Dev is really active as well, if you look at comments at patch notes that mention bugs, they address it within a day or 2, never seen a game treated with such care. \n\nOnly recommendations I would like to see Dev add is a way to speed up enemy AI turns, less ingame patch during world tournament (after every match is overkill imo), and better team stats/history features",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Cannot recommend this game enough!!  I love autobattlers and I love Slay the Spire, Monster Train, etc.  I've never been a huge fan of the MOBA team simulators because they just seem so random and luck based - but this game fixes that by giving you cards to play, different talents to unlock, deck-building, base-building, exciting draft picks, events where choices give you different perks, relationship/emotional changes to juggle, and so much more depth than those other games!  This is my new addiction and completely worth the price of the DLCs!  Get it all for a low price and enjoy throwing your days away due to \"just-one-more-turn\" syndrome...",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Many games usually fails due to their shallow-ness. Nice \"hyper-realistic\" or eye-pleasing and clean graphics but the average person gets bored of the gameplay in an hour, for that game is similar to hundreds of others already.\n\nEsports Godfather is the one and only game I've encountered where the problem mentioned above is flipped, it has a decently fleshed-out Esport team management and around 40 UNIQUE CHARACTER your athletes can control with charming pixel graphic to them. Each match is not just simulated by a click of a button, but you play it out, with the outcome influenced by your character matchup, combos, counters, map-modifiers, etc.\nOn the flip-side, the first thing you see visually upon starting a new game is AI-art for you to customize the logo and the athletes...\n...Which I completely understand that a small team needs this so they can concentrate on the fun game they have made here, and I hope that you can tolerate this too if you are interested in this title.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I absolutly love this game. Its well worth the price and is just a great time to play.\nThere are guides to help you in the community section that helps with getting your players set up for your first playthrough.\nMy personal favorite champ is Lan because if you focus on her you do some crazy damage.\n\nI really hope they come out with another champion pack to increase your choices.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Dev is really active despite the language barrier.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is an amazing game. Much deeper than you would expect from screenshots. I am playing it for weeks already. It combines many aspects that I search for in games like deep tactics, character customization and mechanical growth. And it also poses a challenge! Especially interesting part of the game are random rules changes! You have to adapt to these changes and you can get into a situation where the tactic you were successfully spamming all the time no longer works due to new rules! Heroes change too. And there are a lot of interesting aspects of managing your team. All in all it is a great game. If you are fond of card battlers and tactic games you should definitely try it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A pretty finely crafted management game mixed with a solid card-based combat for the matches.\r\n\r\nEsport Godfather in its management side combine a lot of mini games of sort which manage to not overstay their welcome while all remaining mostly relevant as you progress. The learning curve can be a bit steep, but once you start knowing your way around the mechanics and the heroes, you start to put all the pieces together, and that's when it really becomes fun. The game is easily customisable in a lot of aspects, meaning you can choose to engage or not with some mechanics, and make the experience as challenging as you wish it to be. Two new modes were also recently added, offering new ways to play, including a roguelike mode for people who want to focus on the matches more than the management.\r\n\r\nWhile being a fun and mostly well put together game, however, it's not without flaws:\r\nThe heroes aren't balanced well, and while some are very potent, others are real stinkers, and some seem to only exist fo the AI to annoy you with because while annoying they aren't exactly strong. The stats decay mechanic is only there to make you use the transfer system, yet it's totally possible to win all the cups with your starting five atheletes. The recently added world cup is really really unbalanced with the opposing teams having over inflated stats making playing against them a really unfair and unfun experience. And while the leagues and playoffs give you breaks to train, the world cup locks you out of a lot of trainings, so you're stuck mostly with what you have. No scrims, no intensive training, no regular training when you reach the quarter of finals. In addition to that the english translation is mostly serviceable, but certainly not good, having been translated from the original chinese. Some choices make absolutely no sense so it's difficult to piece what the games means.\r\n\r\nStill if you can endure all that, there is a rough gem of the game underneath, and it's good enough to get you hooked even if you know nothing about MOBAs, or very little. That's saying something.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game. Biggest strengths are how fun both the management sim and the \"in game\" games are. Biggest weakness for me was the English translation, which is only so-so.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Moba gameplay is cool, but there is not a good gameplay loop around it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not really a sim, more like a deck builder. The simulation of a moba is missing a lot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is begging me to have fun with it, but I don't feel like I'm learning or understanding what's going on inside the actual MOBA. On top of that, between every match there are 10+ popups for random events, dialogs, trainings, leveling up your trainings, placing seating/decorations in your stadium, discussions with your players, random events, letting your players stream, etc. etc. \r\n\r\nI just... don't get it and the game is not for me. But it seems and looks like I would really like playing it - I did enjoy teamfight manager.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game was alot of fun but now its just not, the devs focused releasing lackluster DLCs and forcing game settings that should be sandbox settings that are setup pre-run instead of doing any game balance or bugfixes for bugs that have been around for awhile, instead all their bugfixes are bugs caused by these new DLCs.\r\n\r\nthey just took zero steps forward and multiple steps backwards while releasing DLC that they want us to buy? no way\r\nthey could revert all the changes done in the past month and it would be a huge step forward.\r\nit almost seems like they dont care if the game dies and they're just trying to get one last cash grab with these DLCs\r\n\r\ndoesnt feel good to FINALLY see one update since ive owned the game and its just bugfixes caused by a cash grab and no ACTUAL update other than forced settings when their pre run sandbox settings are lackluster to begin with and now even more useless since they FORCE SETTINGS ON PEOPLE anyways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs More Updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While it's a fun game, I can't support games with AI art. They are also releasing 5 heroes costing 10€, created with AI.\r\nTranslation is also poor in a lot of places.",
      "voted_up": false,
      "votes_helpful": 11
    }
  ]
}