{
  "positive": [
    {
      "review": "Calamity mod + magic storage + recipe browser + boss checklist = fun times",
      "voted_up": true,
      "votes_helpful": 63
    },
    {
      "review": "Modded Terraria is fun, sure — but none of its bosses, biomes, or mods compare to the real challenge of my playthrough:\n\nMy friend, a human embodiment of Chaos Mode with permanent negative stats in Patience and Self-Awareness.\n \nThe moment I launch the game, he materializes out of thin air like some cursed modded NPC.\n\n He treats every second I’m not in his world as a personal attack. According to him, if I’m not rushing bosses at his command, the universe is collapsing. \n\n I swear mods like Calamity or Thorium were balanced around difficulty, but he plays like someone replaced his brain with a speedrun timer.\n\n He has exactly two emotional settings during gameplay:\npanicked urgency and aggressive disappointment.\n\nHonestly, calamity death mode isn’t hard.\nHe is.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "tModLoader is the *free*, officially-supported mod loader DLC for Terraria that takes a perfectly good game and says:\n\n> “What if we added 400 bosses, 8000 items, 6 new biomes and 0 self-control?”\n\nIt’s an open-source, community-driven mod framework that lets you *make* and *play* mods. In practice, you will:\n\n* Install Calamity “for a bit more content”\n* Add 12 QoL mods “to save time”\n* Spend the next 3 weeks configuring your load order instead of actually playing\n\n---\n\n### Pros\n\n* **Free DLC on Steam**, blessed by Re-Logic themselves, so your mod addiction is now canon.\n* Built-in Mod Browser & Steam Workshop support: click button, receive chaos. No more shady zip files from 2015… mostly.\n* Lets you play solo or with friends, with one mod or fifty—*as long as everyone’s running the same pile of nonsense*.\n* Massive mod ecosystem: overhauls like Calamity & Thorium, QoL like Recipe Browser, Magic Storage, Veinminer, and “I don’t ever want to mine a single ore block again” packs.\n* Open-source and community-maintained, with regular updates so your bad decisions stay compatible with the latest bad decisions.\n\n---\n\n### Cons\n\n* “Let’s keep it light this run” – says you, installing 30 content mods and wondering why Slime King now has four phases and a bullet-hell enrage.\n* Mod conflicts turn your world selection screen into a crash test site.\n* Multiplayer night: 2 hours playing, 1 hour explaining to Dave that yes, he also has to install tModLoader. And the same mods. And the same versions.\n* Vanilla Terraria will feel weirdly empty afterward, like you’re playing the tutorial of your own game.\n\n---\n\n### Peak tModLoader Moments\n\n* Loading a world and getting 15 angry error messages, hitting “Ignore All,” and playing anyway like a true professional.\n* Installing a “small balance tweak” mod that secretly turns every boss into an MMO raid.\n* Telling yourself you’ll try “just one big content mod,” emerging weeks later having memorized 40 new NPC names and 12 crafting trees.\n* Trying to explain to a new player that *technically* Terraria ends at Moon Lord… unless you have mods… in which case that was Act 1.\n\n---\n\n10/10\nIf Terraria is a game, tModLoader is a lifestyle choice.\nWould break my save with incompatible mods, fix it, then immediately subscribe to three new overhauls “for variety” again.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Genuinely fun game once you get the hang of it. You may need the wiki most of the time, but you'll learn soon enough, especially with all the mods you can install, and ik there'll be some you wont be able to play without",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "So you've beaten the Moon Lord.  You have seen everything Terraria has to offer.  Then it is time to get this on your PC.\n\nMy recommendation is, if you are looking for \"MORE\" then install Thorium mod, the DLC you never knew you needed,  It adds the Healer, the Bard and the Thrower classes, plenty of bosses and equipment to work towards.\n\nLooking for a challenge then play Calamity.  A complete overhaul on existing content, plenty of new (and difficult) bosses, so much more equipment.\n\nOr of you don't want to stray too far from the base game look at QoL mods like Magic Storage, Fargo's Mod, NPC mods and so on.\n\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The Calamity mod and the Fargo... If you enjoyed terraria as much as I, you probably would enjoy this masterpiece mods as well.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I used to think meh about terraria, then I actually got lost in it and it is really something awesome. Adding Mods to it, especially some of the content mods found here like Calamity just make it one of the best games of all time imo.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Im only 51 hours in but i tottaly reccomend this to EVERYONE out there, Terraria is one of the BEST games you could ever touch and get into. Much much love, and i hope there will be another mod like Calamity or Fargo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the vast amount of mods and support throughout the entire game. Terraria is already an amazing game and support mods like the high fps mod make it even greater.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nothings more better then taking a good game and adding to it and who isn't up for a harder challenge anyway",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "tModLoader is basically the real endgame of Terraria. Once you install it, the base game feels tiny compared to what the modding community has built. It turns Terraria into a sandbox of endless content new bosses, biomes, weapons, QoL tweaks, and full-on expansions like Calamity and Thorium.\r\n\r\nWhat I like most is how smooth it feels. It runs inside Terraria like it’s meant to be there, updates through Steam, and the built-in mod browser makes downloading stuff stupidly easy. You just search, click, and boom, a whole new game.\r\n\r\nPerformance can dip if you stack too many big mods, and sometimes updates break things, but that’s the price of having basically infinite content.\r\n\r\nIf you love Terraria and feel like you’ve done everything already, tModLoader is the best way to make the game feel brand new over and over again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Terraria is my single most played game ever on most devices, but being able to play the same game I love with different premises, challenges and vibes is incredible. The work the team has put into Tmod truly a work of love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily the best modded community and game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The definitive best way to play Terraria. The depth of gameplay that can be gained from using mods is infinite, and a blast to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Calamity and Thorium and Wrath of the Gods, OH MY!\r\n345h later... wait... where did my time disappear to?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Modded Terraria may be the best multi-player gaming experience I've ever had",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "fun has a lot more stuff to do and its free if you alr have terraria",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Due to its overwhelming fun catalog of mods, and fun quests",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the most replayable game ever and i also love all of the mods that the community creates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fucking peak game, fun ass game and i can sink hours into it easily with no struggle. calamity makes it MUCH more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing especially the calamity mod there are so many things to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is Terraria can cool but with mods so you dont get bored so its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super good addon for terraria mods! theres a ton of options made by real people, allows for resource packs, even new music. plus it runs really easily! compared to my minecraft mods terraria runs significantly cooler on my laptop despite both games having the same large number of mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is the best mod manager ive found for terraria. it works great on my old computer and ive never seen any actual problems myself. It recieves monthly updates and while i dont check the list of small fixes, i think it speaks volumes that they put so much effort to make this manager so accessible and up to date. Itd be a lie for me to rate this less than an easy 9/10 for anyone wanting to add mods to terraria",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, tough for beginners maybe, but to be expected in all games, never gets boring especially with mods and I have never had problems with this mod loader, great game to run through by yourself or with friends (pray for cross platform) and has a great building system, good luck not using the wiki lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just better with mods. Calamity - definitly the most enjoyable mod that i ever played!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely peak gameplay, and you can play it on a toaster as long as you don't go too crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TModLoader has single handedly made my favorite game ever even better, and I didn't realize it was possible until I started calamity. \r\n\r\nIf you enjoy Terraria, You are going to love playing around with different mods that add: Weapons, Classes, biomes and bosses. And if you're not looking for a huge change in the terraria gameplay, the quality of life mods make playing the game alot less of a grind.\r\n\r\nThere are so many great things Tmodloader adds, and I believe, that anyone who has ever played terraria, should play terraria with mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love the type of mod's the community offer's for example Wrath of The Gods, one of my favorite mods to play in my terraria playthroughs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best way to expand Terraria with endless mods, new content, and quality-of-life features. It’s easy to use, stable, and opens up limitless replayability. A must-have for any Terraria fan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its okay to try playing calamity\ngameplay 100/10\nmods 1000/10\nspend time 10000/10\n\nresults\nthe game makes u a loser",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing a little bit, beating infernum, wraith of the gods etc I can say that i've only just begun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The progression is challenging and the combat is just oozing with possibilities for higher and higher damage and the bosses good lord the bosses are incredible. I know it says I've only played for like 3 hours but I finished the game on a separate device last month",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Terraria but with ten times the stuff and it can lag my computer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun alone, more fun with friends! The community that's formed around this game is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game no matter what mod you wanna play, Calamity, Thorium, The Stars Above, Starlight River, Spirit, Fargos Souls Mod, and of course the best for last, Pih in Dis Bih",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best mod managers ever. Amazing community, great dedication to the making of mods. Literally something for everyone here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man, I am so happy that that Re-Logic team decided to officially support tModLoader. The amount of new mods and old mods alike being readily available is such a convenience and makes new playthroughs so enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game both single and multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best and most stable modloaders of any game tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This brings the base game to another level. Amazing work by TML Team and all the mod creators.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This should be paid. I don't think Terraria would be my favorite game if it weren't for the community and modders. Holy SHIT they are good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for modding terraria, tons of mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love playing terraria again and dying 2000 more times just to beat the first boss after moonlord",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "terraria is one of the best games ever and with mods is even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love when u put 20 mods on a world them beat it and then u have so much stuff in the magic that u cant join back in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute masterpiece, one of the best games ive ever played and just so replayable, even dying and not getting past a boss is still fun and you can play with so many players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Terraria’s tModLoader is one of the best things to happen to the game because it expands Terraria far beyond its vanilla limits. Instead of just replaying the same bosses, biomes, and gear progression, tModLoader turns Terraria into a customizable platform where you can tailor the entire experience to how you want to play.\n\nWhy tModLoader Is So Good:\n\n1.Huge Amount of Community Content\ntModLoader lets you install hundreds of community-made mods. These aren’t tiny add-ons—many of them feel like full expansions. You can add new bosses, biomes, weapons, classes, soundtracks, difficulty modes, and even overhauled progression systems.\n\n2.Massive Replayability\nTerraria is already replayable, but tModLoader multiplies that. You can run different mod packs, try new classes introduced by mods, or play with friends using completely different game setups each time.\n\n3.Seamless Integration\nIt installs and runs directly through Steam and feels like a natural extension of Terraria. The interface for loading mods, enabling/disabling them, or updating them is easy and accessible even for new players.\n\n4.Free and Community Supported\ntModLoader is completely free and supported by an active community that constantly updates content. It extends the life of Terraria indefinitely without needing paid DLC.\n\nWhy Mods Like Calamity Add So Much More:\n\n1.A Full Game Expansion\nCalamity isn’t just a mod—it's practically Terraria 2. It adds dozens of new bosses, hundreds of weapons, new biomes, new classes like Rogue, and an entirely new soundtrack.\n\n2.Harder, Better, More Structured Progression\nCalamity introduces new difficulty modes like Revengeance and Death Mode, along with post-Moon Lord content that dwarfs the original endgame. It gives players a challenging, rewarding sense of progression far beyond vanilla Terraria.\n\n3.Amazing Lore and Atmosphere\nCalamity adds lore, characters, and a darker, more intense tone. The soundtrack alone completely changes the vibe of the game and makes boss fights feel legendary.\n\n4.Builds and Playstyles You Can’t Do in Vanilla\nRogue class, new accessories, and mod-specific mechanics open up entirely new ways to play that don’t exist in the base game.\n\n-------\nI Love Terraria",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "es un buen juego ademas de que algunos mods son buenisimos como el calamity, thorium y otros mods para acoplementar y solo dire que es arte este juego Bv",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The huge content mods and quality of life mods breathe fresh air into the already great game that is terraria, just be prepared to become an expert wiki searcher and reader.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Command prompt and such popping up always scares me but I appreciate being able to mod my favorite pixel game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game just improves what's already perfect\r\n\r\nthere is a ton of mods which are constantly getting updated and it's super easy to instal them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak! Calamity mod is insanely good unfortunately the game doesnt start on my arch laptop for some reasen...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the greates modding platform of all time, for one of the greatest games of all time, with some of the best mods of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dont like this game but I need to beat calamity Revengence. Its not fun and I cant feel happy until I have beat it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow, this is amazing theres  mods for everyone in here. new classes? yup, new bosses?, yup, Theres overhauls, theres game balancing, theres QOL mods. just amazing. If you like terraria play with these mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is the modded platform for terrira, so already a great game, getting mods? makes it even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was the catalyst of why I wanted a pc in the first place like 9 years ago... this game is goated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely extremely cool for a game to have officially-endorsed mod support based based based",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing addon to an already amazing game. I just love mods and having an entire workshop full of them is heaven.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☑ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☑ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☑ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☑ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☑ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☑ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oh my gawd this game is so good, its really fun to be able to have add-ons and mods to your world and explore it the way you want it,,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Absolutely fucking adore the amount of time and effort the community of this game has impacted my life in the sense of stimulation <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game on other akkount i have like hundreds of hrs its very good get and play very good indeed buy it is fun get is good fun play very useful review yay play game it good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Terraria is one of my favorite games, and this breathes new life into it.  The fact that it's on steam now and is so much easier to use than going to a site is much appreciated.  It is very user friendly and good if you want to get more life out of the game but not wade through a bunch of setup since the mods are on the workshop now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game. just saying, if you've played vanilla terraria, tModLoader is the next step in fun. I beat base terraria so many times, it kinda got boring. But after I ot tModLoader, man my eyes opened up. There are so many people with so many different crazy ideas. It stupid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "adds fun to Terraria after completing the whole game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The tModLoader expansion for Terraria is honestly one of the best ideas ever made. I haven’t explored it too deeply yet (about 150 hours), but what I have played \"the Calamity Mod Pack\" is simply phenomenal. This expansion fills the game with so much extra content that it can feel like a completely new game.\n\nAnd these mod packs are really well made: I’ve encountered almost no bugs, and the design and presentation are excellent. If you enjoy the base game, you will absolutely love this.\n\nApart from that, there are also many smaller but very practical mods, like the MPC mod, which adds a bunch of new NPCs who sell you rare gadgets. There’s even a mod that gives you a dedicated wing slot. (These kinds of mods that expand your accessory slots are especially useful in Calamity, since it can get incredibly difficult.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its like a better version of minecraft especially with the calamity mod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jogar com mods é bom demais, seja você querer mais bosses, elementos 3D, mais exploração, caos, qualquer coisa, centenas de horas ou até milhares seram perdidas facilmente jogando com mods, recomendo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tModLoader is such a good mod tool that it makes it hard to play vanilla Terraria after experiancing some of the best mods avalible in tMod. While Terraria can give you hundreds of hours, it's tMod that makes it infinately replayable and with the ease of switching mods, disabling or even adding more, it feels like there is always a new way to play and can be very hard to get bored. The biggest fault of tMod is sometimes a person can feel overwhelmed with the amount of mods to pick and add, hence I reccomened not adding to many large game changing mods at once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The base game of terraria is already my favorite game in existence and i used to mod it back in the day when you had to go download tmod from a specific website online and do it externally. I recommend tmod not only for the fact that the devs love the community so much that they made it an official app but because tmod allows you to take a game that you can already sink thousands of hours into and make it have even more options to sinks even more time into",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the official mod loader for Terraria (My all-time favorite game), and I'm glad it is.\r\n\r\nIt's run well for me the entire time I've played modded Terraria and even when I played on an older device.\r\n\r\nThe mods are on both the Steam Workshop and an in-game menu, meaning you get easy access before, during, and after playing to find new and exciting mods to play.\r\n\r\nAlso, I made this because Steam wanted me to write a review for a game to get something in the game of the year awards, so...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good and seamless modification to the base game. Keep it up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mods make a already replayable game even more repleayable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The locally local peak game that everyone plays locally because it is local and peak\r\n\r\nHonestly im suprised alot of players of this game get made fun of, its a good game to say the least..\r\n\r\nFREE AMERICA BITCHEZ!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uses an already amazing game to create a base for limitless coolness",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game if you like to play terraria and need a bit more of a challnge or more items",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the slayer of titans is a pre-bingus summoning weapon unlocked post-scrungle. its base summon damage is 43. using it activates the scimblo status effect which increases your yoinky stat. its eeby deeby counterpart is the legendary fuck-upper. it has a 1/16 (6,25%) chance of dropping by defeating Michael.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is why Terraria is so good. It has great modding support, with the biggest modding community of any game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always played Terraria on/off for years. When i get bored or start playing other games, its there, waiting to be played once more. The amount of content increases as time passes, so its kinda always a fresh experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I already love Terraria, but being able to use mods and make the game 10x more fun? Count me in!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun but there is a chance for it not to load in if you have 2 mods (enabled or not) that are partial opposites to each other.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive played only a tiny bit but also the game is just really fun play the calamity mod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You already know you can't go back to playing without magic storage and recipe browser. You also get peak replayability with these high-quality content mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Calamity mod + foxy jump scare is horrible. My friend made me get this and I learned stuff I should have learned playing the non moded game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the fact that i can play terraria with mods as it makes the game feel longer and more progressive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just good mod gang, and they are very fun\r\nlike calamity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imagine playing Terraria with mods.\n\nYes, you get it now.\n\n\n\nThis is a mod loader for Terraria and if you like Terraria and think about trying out some mods, this is what you are looking for. Easy to use, after getting around the new menu, and a great library of mods to choose from.\nWord of advice: Some larger mods that greatly change the world or mechanics of the game might not together. Smaller ones, including quality of life improvements like a search bar, to search the nearby chests for items instead of manually looking for them, can work well with one or to bigger ones, for example Calamity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This sandbox masterpiece is more than a game to me; it's a vessel carrying the weight of my childhood and those treasured memories of a bygone era. Now, a decade later, it continues to stand as an enduring milestone in the annals of pixelated gaming. I eagerly await the arrival of version 1.5, hoping this unforgettable journey continues to unfold！",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally the best game ever. Progressing through bosses is fun, exploring is fun, building is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game supeer fun, wide range of difficulties, challenges and playstyles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play it. now. like actually this is the best addition to terraria ever. theres endless things to do its insane",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a classic and a must have for any Terraria players looking for a harder challenge or just a quality of life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love terraria, glad they officially added tModLoader to steam and it works great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun as is terraira me and my friends are absolutely clapping calamity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless content, replayability, and customizable Quality of Life added onto one of the greatest games ever made. This might be the closest thing we ever get to *the* perfect game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally the pinnacle of gaming 10/10 absolute cinema\n\nalso 1/10000 Chance for Withered Foxy Jumpscare Every Second so actually 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played Calamity and Fargos together, best worst experience of my life, would do it again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's good if you like long progression based games. if you more want to speed run the game it is still pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I CANT PLAY THIS GAME CALAMITAS is too distracting 0/10 do not buy ts my right arm is 80kg alone after 5 playthroughs of calamity.also remodel queen bee",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "brimstone elemental put me into cardiac arrest as she spear tackled her humongous, jiggly, and bouncy balloons into my unfortunate, innocent soul causing me to dry hump my laptop before my projectile shit propels me into the air just for a humming bird to win king of the nest type shii.\r\nDo not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most frustrating multiplayer experience ever. Completely random on different days whether it will allow me to connect or just get stuck on one of the many processes in joining such as \"found server\" or \"syncing mods\", and also cannot detect an enabled mod matching but being outdated compared to the server.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really like all the features. but i was trying to get my character that was saved to cloud in terraria in tmod loader. so, I was trying to import it. I accidently overrode all the new progress on all my other characters with the old versions from terraria doing this, losing all my progress. where was no big warning stopping me. I also couldn't find a way to restore it because it also overrode the backups with the old backups from terraria. in the end i didn't even get the character I originally wanted to import. i just lost everything. plz fix, maybe don't override backups or smth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "thanks for messing up my entire modlist updating ur launcher again when it was perfectly fine...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant launch it, cant even install it, it says there is an error and no license..etc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i've had nothing but trouble from this pile of dogwater of an app. It's premise is convenient sure, but it's constant micro updates completely break mods and worst of all, broke calamity. which requires you to either do a bunch of complicated BS to revert versions to fix or wait for the mod authors to fix it. unless this trash app will build an in-app way to revert versions for situations where their BS micro updates ruin mods, im gonna keep this negative review up and stick with nexus.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "we beat moon lord and micah doesnt wanna fight daytime empress cuz hes pussy bitch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "updates every week with minor fixes that effect nothing except not letting you join servers not on the same version. so if your friend isnt on and he owns the server i guess your pretty much fucked. but hey, \"FIXED PLAYER CHAT BUBBLES IN REVERSE GRAVITY\"? right?.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is DOGWATER and its mean and I play too many calamity runs >:(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my game crashed after spawning 2000 paladins and now i want to end my suffering",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck you tModLoader, fuck your name, fuck your game, fuck your millions, fuck your billions, fuck your computers, fuck your developers, fuck the water you are fucking drinking, fuck the food you are fucking eating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wiped my calamity save and made me have to download cheats no i am sad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "steam would not let me refund\nso ynezihfbzehf e fr frfhrgfjgfz ehgf zeyfygze fyigtef e",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jσζε keeps pressing alt f4. give me his account info so i can delete wait no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh, its mid, not worth the price",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks please never play calamity revengence mode",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "МЕНЯ ЗАБЕАЛО ПЕРЕПОДПИСЫВАТЬСЯ НА ВСЕ МОДЫ. Я ДРОПАЮ НАХУЙ. РОМА ИЗВИНИ ТЫ СОЛО ИГРАЕШЬ",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i keep getting kicked off of worlds. ts is bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much crashing terrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shits ass cant join a fucking lobby",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "200 fucking hours of no clue what im doing in calamity",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Supreme Helper Minion. Nothing else needs to be said.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it has no content",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Reg terraria is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All my friends play this garbage instead of playing good games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1/10\nforced to play this trust",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is horrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most boring person u know plays this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this game very hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate ts game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bogo di mo open muklo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tbot said I was ugly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its tehrrable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk i just felt like saying its bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terraria is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck calamity bosses",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i fucking hate the great sand shark",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jungle bat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "theres no jenny mod",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Plaugebringer goliath.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This gave me a botnet. Not much more needs to be said.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i think its foog",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "moss hornet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "knock off mc lowk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "QWEG BJK;WRG Ynjkl'WERG HM T",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "is too easy :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "me no like, is bad ):",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE TMODLOADER",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "world small",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "made me nut",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit of piece",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infernum DoG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "booooo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infernum",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "😟",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ":p",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kid67",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sdcc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "46kjlthidutahi89etgsdbgi5ytur g",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They have had a security vulnerabiity for YEARS that would download mods (even non-Steam workshop ones) onto the person who joins the server. This is a security risk and can lead to people using it for malicious purposes as we have seen in the past few days. It doesn't even matter if it is a random server or even a trusted one, you don't 100% know what non-Steam mods they are using and even if it is a Steam mod I don't see why it couldn't hack your computer as well. Given the fact that Steam has had games that had malware in them. \n\nThe TModloader devs gave a band-aid fix and not solving the real issue. What should happen is entirely disabling downloading the host mods when joining the server.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "glitches out and cant join friends for no reason. fucking sucks!!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I CANT PLAY THIS GAME CALAMITAS is too distracting 0/10 do not buy ts my right arm is 80kg alone after 5 playthroughs of calamity.also remodel queen bee",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "brimstone elemental put me into cardiac arrest as she spear tackled her humongous, jiggly, and bouncy balloons into my unfortunate, innocent soul causing me to dry hump my laptop before my projectile shit propels me into the air just for a humming bird to win king of the nest type shii.\r\nDo not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most frustrating multiplayer experience ever. Completely random on different days whether it will allow me to connect or just get stuck on one of the many processes in joining such as \"found server\" or \"syncing mods\", and also cannot detect an enabled mod matching but being outdated compared to the server.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really like all the features. but i was trying to get my character that was saved to cloud in terraria in tmod loader. so, I was trying to import it. I accidently overrode all the new progress on all my other characters with the old versions from terraria doing this, losing all my progress. where was no big warning stopping me. I also couldn't find a way to restore it because it also overrode the backups with the old backups from terraria. in the end i didn't even get the character I originally wanted to import. i just lost everything. plz fix, maybe don't override backups or smth.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "thanks for messing up my entire modlist updating ur launcher again when it was perfectly fine...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant launch it, cant even install it, it says there is an error and no license..etc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i've had nothing but trouble from this pile of dogwater of an app. It's premise is convenient sure, but it's constant micro updates completely break mods and worst of all, broke calamity. which requires you to either do a bunch of complicated BS to revert versions to fix or wait for the mod authors to fix it. unless this trash app will build an in-app way to revert versions for situations where their BS micro updates ruin mods, im gonna keep this negative review up and stick with nexus.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "we beat moon lord and micah doesnt wanna fight daytime empress cuz hes pussy bitch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "updates every week with minor fixes that effect nothing except not letting you join servers not on the same version. so if your friend isnt on and he owns the server i guess your pretty much fucked. but hey, \"FIXED PLAYER CHAT BUBBLES IN REVERSE GRAVITY\"? right?.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is DOGWATER and its mean and I play too many calamity runs >:(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my game crashed after spawning 2000 paladins and now i want to end my suffering",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck you tModLoader, fuck your name, fuck your game, fuck your millions, fuck your billions, fuck your computers, fuck your developers, fuck the water you are fucking drinking, fuck the food you are fucking eating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wiped my calamity save and made me have to download cheats no i am sad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "steam would not let me refund\nso ynezihfbzehf e fr frfhrgfjgfz ehgf zeyfygze fyigtef e",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jσζε keeps pressing alt f4. give me his account info so i can delete wait no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh, its mid, not worth the price",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks please never play calamity revengence mode",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "МЕНЯ ЗАБЕАЛО ПЕРЕПОДПИСЫВАТЬСЯ НА ВСЕ МОДЫ. Я ДРОПАЮ НАХУЙ. РОМА ИЗВИНИ ТЫ СОЛО ИГРАЕШЬ",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i keep getting kicked off of worlds. ts is bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much crashing terrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shits ass cant join a fucking lobby",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "200 fucking hours of no clue what im doing in calamity",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Supreme Helper Minion. Nothing else needs to be said.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it has no content",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Reg terraria is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All my friends play this garbage instead of playing good games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1/10\nforced to play this trust",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is horrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most boring person u know plays this",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}