{
  "positive": [
    {
      "review": "Would recommend the whole game except for the cube mission. Whoever designed that, I wish steps on a pile of legos everyday.",
      "voted_up": true,
      "votes_helpful": 82
    },
    {
      "review": "Remnant 2 is the kind of game that makes you lose track of time. It’s tough, unpredictable, and sometimes frustrating, but every bit of struggle pays off once you get into the rhythm.\r\n\r\nOn PC the gunplay feels tight and satisfying. Every shot has weight and every dodge matters. I played mostly Hunter with a touch of Gunslinger and that setup felt perfect to me. The balance between precision and speed kept every fight exciting. The Merciless became my absolute favorite weapon. The way it looks, sounds, and hits never gets old.\r\n\r\nThe campaign is an experience from start to finish. Every world feels alive in its own strange and haunting way. The atmosphere tells the story more than the dialogue does, and it works. You can feel the history and the loss in every corner.\r\n\r\nThe boss rushes were my favorite part. They push you to your limits and make every victory feel earned. Beating a boss after several tries feels like a real accomplishment.\r\n\r\nThere are some frustrating parts. The difficulty can spike without warning and the random elements sometimes make progress slower than it needs to be. But those rough moments make the wins that much sweeter.\r\n\r\nRemnant 2 mixes tension, chaos, and satisfaction in a way few games do. It challenges you to stay calm under pressure and rewards you for sticking with it.\r\n\r\nIf you like games that test you but make every success feel meaningful, Remnant 2 is an easy recommendation.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "Great game, it is a Soulslike but with guns. \r\nIf you care about the lore you should play through the first game before starting this one since you get spoilers very early otherwise.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I got this game as a Christmas gift from a friend of mine back in 2023, and despite some nitpicks or frustrations, Remnant 2 has become one of my favorite games in recent years.\nI'll admit, this review has been a long time coming.\n\nNow, I'm not too familiar with Souls-likes as this and the previous game are my main introduction, but it's a seamless blend of TPS, Action RPG, Rougelite and of course, Souls-like. The main source of replayability comes from re-rolling either the campaign or adventure mode (With boss rush on the side since the Dark Horizon update) as many events are randomized on each world. Admittedly, this does run the risk of getting repetitive (or annoying if you're trying to roll a certain dungeon or event), but the gameplay loop is too much fun for me to get too bored.\n  Another element I love is the variety weapons and weapon mods available, the game takes it's premise of traveling across various, radically different worlds to give you stuff like a gun that spams lightning and leaves electric stakes or a discus thrower that bounces off targets, or you have mods you attach to more \"normal\" guns like corrosive rounds or deploy space bugs to harass enemies. Combine this with the flexible Archetype system for setting up your class, different relics, hundreds of rings and amulets (You'll have a jewelry store's inventory sooner or later) and mutators you can equip onto your weapons... if you love trying out different character builds, be they optimal or unorthodox, you're in for a treat.\n  Remember too, that if an item (say a ring for example) doesn't seem useful, setting it up with other items to synergize can make certain \"Gimmicky\" items viable options. \n\nOne also can't talk about this game without making mention of the bosses, because honestly, the worst I have to say about some of them is \"Heh, it was alright\" as most of them, between the presentation, the music and the challenge are top-tier. I also have to point out that even if I had to lower many graphical settings to run this game, it still looks amazing and I love how different each world is, even if I get lost here and there.\n\nRegarding the story, the gist is that twenty years have passed since the last game and the Root, the main villians' of the series have lost their chokehold on earth, allowing the human race to begin rebuilding. However the rest of the universe is still at risk, thus what begins as a simple misadventure becomes a quest to save the worlds from annihilation, leading you to navigate the blighted jungles of Yaesha, the grim Victorian style streets and extravagant Fae palaces of Lossom and the haunting desolation of N'Erud. So, right away I'm just gonna say that the story isn't anything to write home about, they put more effort into it than in the last game, but gameplay comes first and foremost here. Despite that however, I did find myself remembering various characters you encounter (Maybe re-rolling had something to do with that) and I do enjoy the little touch of your character having a voice, blank slate for the player they may be.\n  Now while the story itself may not win an award anytime soon, there is tons of lore snippets you can find, mostly by inspecting items you find or the rare journal left behind or by talking with the characters you run across. As an Elder Scrolls fanboy, I love reading lore and gobbled up any scrap of information I could on this setting.\n\nIn terms of critiques for the game, I do admit there are a few. The chief one I think that comes to mind is some of the puzzles. I have nothing against puzzles but I must warn you, in your quest to find Archetypes, armor sets or weapons there are a few that are far from simple and some things folks only learned thanks to datamining. The good news is if your stuck, a web search will help as many players have shared their findings over the years. Another nitpick which may boil down to preference is that armor no longer gives special bonuses (beyond defensive values) like they did in the first game. I get it, the archetypes and the recent prism system fill that void but I can see people viewing it as a downgrade. Another thing to note is that while I love the combat and the different worlds, when traveling through most dungeons and general biomes, you're bound to fight LOTS of the same enemy over and over, which some may find repetitive. It's ironic really, so much variety but they'll spam the same dude in mass depending on the locale.\n\nHowever, these nitpicks are just that, nitpicks. Remnant 2 is an amazing game and one I recommend, both for solo and co-op. I do admit, co-op isn't something I did much of, but man oh man was it fun! My only regret was that I didn't do more of it.\nThis game has been wonderful, I even got all the achievements and finished a hardcore run! But I believe it's time for this Traveler to put his guns down, let the ashes settle and rest.\n\nThanks again to my friend who gifted me this game! See y'all at the next Worldstone!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "if anyone likes a souls game with hours of puzzles and secrets to explore with challenging bosses and a unique world to discover, check out remnant 1 and 2 (and chrono for the whole collection). 100s of hours or more if you wish to explore without the wiki and discover everything. even more fun with friends. hope they make another. one of my fav series to play",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Good game. The execution is a little odd, and at times it all feels a bit [i]too[/i] open world. It also doesn't run the best. But for all those flaws, it more than makes up with art direction, atmosphere, vibes and generally good gameplay.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "So much fun.  Amazing coop experience, wonderful art direction, loads of interesting weapons and builds.  I loved this game!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Big recommend. good, challenging gunplay, beautiful environments and interesting story(s)",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "If you're looking for a game to get lost in, this is the game for you. It's a beautifully polished souls-like filled with interesting worlds and tons of secrets. I would describe it as Alice in Wonderland in the best way.  It has just enough RPG mechanics to keep it fresh and invite you back after long breaks.\n\nThis is one of my all-time favorite \"comfort\" games and I can't recommend it enough.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely one of the best recent games I’ve played with a friend. Remnant 2 just keeps surprising me, kudos to the devs. The secrets feel endless, every time you think you’ve seen it all, the game throws something new at you and you end up diving deeper and deeper.\n\nyou'll keep saying “one last run” and suddenly be farming for hours in Apocalypse boss rush like addicts. The loop is insanely fun, the exploration is rewarding, and discovering hidden stuff together is honestly the best part!!\n\nIf you’re looking for a coop game that keeps giving, this is it. Solid 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, personally this game was the best random purchase I made in my life. Not a fan of souls like games but a fan of shooter and challanges, this game fullfilled it all. Great stuff. Just the emptyness of the unknown if there is gonna be a Remnant 3.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "dark souls with guns returns in this new remnant game. it has much better gameplay but the story is kinda lacking. overallthough i've played 600 hrs between ps5 and steam and i highly recomend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes, love it. It's beautiful, some fun co-op game play. Really enjoyed the first one, this one is even better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "me and the Fae goddess are going to send Clementine to the Nightmare Dimension alongside the writing team and then we can enjoy the improved gameplay unbothered",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9/10 game, 10/10 if they had ever implemented true Survival Mode from the first game, but hey, that's what Remnant: From the Ashes is for. always scratches that itch for a third person action game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'll start by saying I really disliked the first game. I thought it was boring and a drag to finish. \nHowever, they really improved on the second game. I loved the music and art direction. The class system allowed for some more abilities. Leveling up was not too hard. The difficulty was on point with fights with it being the right amount of challenging. The only gripe was it was a bit annoying to find certain classes and they needed to make finding these hidden items easier and not going completely out of the way to find them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely adore this game. There are very few games I could play over and over and over again - helping other players complete sections and bosses. I would buy a remnant 3 immediately. Please make it come soon!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loved the first one and this is a complete improvement on that one. The guns feel impactful and they sound amazing. Im enjoying myself!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i loved remnant from the ashes and i would love to play this game at stable 20fps with upscaling, but my pc says no (i have a funny 1050ti)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game on a diff platform for awhile, but after finally getting it for myself on here i can def say this is 100% worth your money. This is a non biased review.\r\n- The DLCs def add onto the expierence, but you dont have to get them to enjoy the game. Its just something that adds to it and gives a new expierence\r\n- Youll have a different run every single time, even if you join friends. Theres no room to get bored here.\r\n- Youll get different items every single run its not the same things over n over even in the DLCs\r\n- On top of there being over 50 hours of just normal gameplay, theres so many secrets in the base game that you wouldnt even think to look for until you look it up\r\n- The game is actually quite challenging with harder difficulties, and even the starting one is difficult if you run into the wrong boss. \r\n- the puzzles are quite clever\r\n- some bugs are annoying, but so far i havent seen any game breaking ones. Just disconnecting from games a lot, and some of my shots not hitting enemies.\r\n- some maps are confusing, and if you want specific items sometimes you have to reroll your entire world just to get it\r\nThats all. If you want to try something new with guns and fun gameplay i recommend. I do not recommend for people with lower end devices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Voice acting and char. creation is quite cringe early on. But game very quickly ramps up.\r\nHas some flaws, but I am surprised at how smooth it runs/plays. Very trippy experience, feels like RE/Dead Space/Intelligent Qube and Borderlands got thrown in a blender, add some \"Souls\" spice and that's Remnant II",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far most of the gameplay is quite simple, and only one boss has proven to be a bit of a difficult foe. Overall fun game to play w/ friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HUGE improvements since the first one but still has some issues that are annoying, but its so much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok further in the game I've realized that completing the game is like 30% of the actual game. There are so much secrets and items and replayability, that you could sing in maybe 150 hours in it. I think it's a lot more than Remnant From the ashes. If you are into darksouls with guns and love to find every secret everywhere, then this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how hard and indepeth the games  is. Great replayabilty  and endless serecits throw each play through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros:\n- Weapon Variety\n- Build Variety\n- Class System\n- Co Op System\n- Bosses (mostly)\n\nMixed:\n- DLC\n- Area Traversal \n\nCons:\n- Vague Puzzles\n- Enemy Ganks\n- Story\n- ‘Detailed Shadows’ graphical option stutter\n\nThis game is better in just about every way over the first Remnant. Weapons feel better, the story starts out promising, the class system is straight up better with greater depth, and the build variety is just as great, if not better. It really feels like a AA game with a solid budget behind it. Boss quality is generally good even if it is fairly easy outside of a few. Graphically, with it being one of the first UE5 titles, it's actually well-made from a technical perspective, even if it can be lacking in color in the base game.\n\nAs for issues, there are a few to point out. The game is much better with friends as playing solo, particularly in the dlc, the enemy ganks that the game can throw at you can be tedious at times. You walk into a room and 5-6 enemies can sometimes attack and so certain classes that give a free revive almost seems needed just to reduce the tediousness of the game design. Traversal, just like the first game, is still an issue. It feels like the areas are too large with not enough to do in them. General enemy design isn’t too engaging as you can kill most enemies without them even getting close to you so ganks are needed to give challenge. The 'Detailed Shadows' graphical setting produces stutter when pressing start or opening the map so keep it off (tested on Radeon 9070 XT gpu and 9800X3D cpu). The story itself, much like the first Remnant, isn't very good but in 2, it takes itself more seriously with more of it and as a result, falls flat hard by the end. \n\nThe dlc is solid but it’s more of the same. The Awakening King is generally good all around as I found it had the most interesting story, solid level design, and an interesting concept from a lore perspective. The Forgotten Kingdom is rough and is by far my least favorite due to the final boss and story but it does have nice visuals. The Dark Horizon has a great final boss and solid story for that world but I found the level design to be frustrating to explore. \n\nOverall, it’s a good soulslike and I enjoyed it but struggled to finish it due to the dlc. Buy when on sale and I highly recommend to play with friends as the game is much better with friends than solo. Also, don’t enable ‘Detailed Shadows’ as this created stutter every single time I opened the menu or map. 7.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game for friends to go in blind and play together, then get committed to and look into what specific things to unlock and collect together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "''very goods'' I say but king say I scary and he no trusts me so I adventures to kills him whilst doing boring tasks of completing 100's of random dungeons with loads of hostile creatures whilst completing the long and content packed side quests and main story line quests, and obviously I used the selection of unique and game changing weapons but I found cube we no talk about cube lest we set off to slaughter the root. you should buy this game its beautifully made and works smoothly in terms of mechanics. unfortunately no men kissing homosexually is a concern and hopefully the dev's get back to the game that actually matters and implement homosexuality! [seriously buy this game its hours and weeks and even months of content let alone replayability have fun and I'm rooting for you]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow a really amazing game. Has a nice difficulty to it. Only thing I want to give a warning when you guys start playing is to ( if you have it) deactivate the DLC, before playing the campaign.\r\nOnce you enter a world, its picks randomly where you start off, and to my luck It made me start at a DLC map lol, the final boss was so ridiculous I was certain there had to be a mistake with the power spike. Until I googled how the random world works.\r\n\r\nOther than that, this is a great third-person shooter, souls like game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have spent days now with friends trying to do something in this game but none of us have a clue where to go or how to find anything in this game. There are no directions, at all, none. You are running around at random hoping to find a way to progress the campaign. Extremely frustrating.\n\nIts sad because if there were some directions in this game it really seems like it could be fun. But as it is right now we simply cant play the game since we cant progress it forward. We have no clue where to go!\n\nUPDATE: We now understand the game is designed this way because every playthrough is supposed to not be the same.\n\nEven though the game is/was confusing and frustrating as hell im changing my recomendation to Recommended because the gunplay and athmosphere is so awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remnant II thrives the most when it embraces its randomized campaign, but suffers when it hides swathes of its content behind obtuse puzzle design and random chance. This makes it extremely satisfying and worthwhile to play through several times, but an absolute nightmare to 100% complete. \r\n\r\nRemnant II tells a patchwork story of three worlds and their struggles against an eldritch evil, The Root. For those unfamiliar with Remnant 1's unique approach to storytelling, this story is composed of randomized maps, encounters, enemies, and story choices. Each world has three unique, but interconnected stories to be told, and hundreds of encounters and loot to find. This can be a bit confusing for first time players, and some storylines have significantly stronger writing and storytelling techniques than others. \r\n\r\nSome more positives: gunplay is varied, with some really unique and satisfying guns (or bows) to use. Active skills, passive abilities, and weapon mods are varied and impactful, opening up for lots of cool archetypes. Rings and amulets could have used some creative love, but they did their job of opening up more build options. The music is great, the world design is impactful, and the environments are huge and beautiful.\r\n\r\nThere's a slew of negatives that prevent Remnant from reaching its full potential. The puzzle design (if you can call if that) is poor, usually with no indication that a puzzle is even present. Developers fully intended on players data-mining solutions, and rerolling campaigns over and over again until they get the correct set of events for rare and powerful items. Some of the randomized events are poorly done, locking you out of rewards unless you reroll the ENTIRE game again. You cannot change difficulty during a campaign, so if you started and it's too easy, you just have to suck it up until your next playthrough. Level scaling is poorly thought out, where enemies scale with you. This means upgrading your weapon often makes your enemies deal more damage and take less. \r\n\r\nPlayer-character voice acting is really rough, with some really cringey voice lines. Audio logs are poorly done, forcing you to stand next to them doing nothing in order to listen. There's an audio bug in the final area that kills your ears, kind of ruining the climax of the narrative. Menu navigation is slow, especially when attempting to fast travel or use checkpoints. \r\n\r\nAll that being said, I still really REALLY enjoyed Remnant II. There's nothing else out there that executes on randomized storytelling like it, and the annoyances I had were rather minor in comparison to how much I enjoyed it. Highly recommended to fans of the first, or to",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the few games that are so good in long and replayable co-op games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome, and it also looks amazing. It feels like dark souls with guns and it delivers on that, with interesting worldbuilding yet the story takes a second place (Thank god as the main one is bad) just for the visuals and vibes. I recommend it for a solo player without a doubt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun multiplayer experience, gun play feels great.\r\nDefinitely worth the 20$ i paid for it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute one of my favorites!!\nThe amount of content and replay value this game has is nuts.\n\nBoth 1 & 2 are fantastic.\n\nBuy it while it's on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay with interesting world-building and a decent story. With different worlds, everyone is bound to have their favorite. I recommend having friends to play with. It’s not a “try-hard” game, but with increased difficulty it can be challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's more Remnant for better or worse. Though it is more better since there are QoL changes. But I hate the UI experience on controller because it's cursor-style. So overall it really is just more Remnant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really sold game very fun but it has so much, secrets specifically its completely overwhelming. It would a lot less overwhelming if I had someone to lay the game with and the game was a bit more clear about things (one character was hidden in the files and the community had to dig to unlock it for everyone).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i recomend it.. I finish it in 32hrs +/- in easiest mode.. Because to lazy to dye 1000000 times. So if you like normal FPS the easiest version is chill and you can have you fun and loot around. The skill tree is not wow.. Guns are fun but i spend the hole game with the first gun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Put about 100 hours into it when it was on Gamepass and then picked it up on Steam. The difficulty to me is a perfect balance between tough and fair. I never felt like any of the boss fights were just unreasonable or unwinnable. Granted I haven't done much on higher difficulties.  I really appreciate all the build varieties you can do with trinkets, mods, weapons, and rings. The class system is a ton of fun with the different skills and combos you can play with on the fly. and the secrets omg the amount of secrets and hidden stuff in this game is just relentless. Archon class anyone?  If i was going to knock it for anything it would be the lack of an in game chat or voice system of some sort. You can get into really good co-op games but have no way to communicate or friend each other efficiently.  The emote system is functional but it just lacks that part to boost co-op over the top.  If you have some buddies to get into this with, i'd say go for it, pick up the DLC, support these DEVS, its such a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun. Definitely harder when you're a solo player like me but fun regardless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game with lots of build variety and replayability. DLC is well worth it too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game gave me subtle flashbacks to Destiny 1, and I genuinely enjoyed the sense of progression and grind it offered. However, I somewhat regret playing online, as many overpowered players joined my sessions and easily defeated the bosses I was attempting to fight, which diminished the overall challenge and experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, wish they would have added some kind of in-game chat as there is no way to communicate with others. game is kinda of confusing with no journal to tell you what to do or where to go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best souls like games out there\n\nbuy this even when its not on discount, totally worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some bugs, but bareable.\nGood effort but for long time, the game is too easy. Come on. Why is the loot so powerful so soon? What is gonna come next? I feel like I have end-game gear already from half of the first world. And I haven't allocated any trait points and my long weapon is level 2 in the second world. And it's all still too easy on veteran difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great bosses,fun gunplay and truly peak build potential,amazing multiplayer and not too expensive.However,i feel the bosses are a hit or miss,with a lot of them being really difficult or too easy.9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remnant is a really great horror-lite story driven RPG.... The art style is amazing. The gameplay is pretty good and can be very challenging (solo) on higher difficulty levels. The co-op with friends is pretty fun. The story is a bit too linear and the quasi-randomization a bit too limited for replayability. Instead the slightly random variability of locations of things helps to defeat *some* of the Internet-ification, where everyone can look everything up on youtube.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Puzzles are a little confusing, occasionally no hints to the solution are given, but game is overall pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay i played the first Remnant 2 times one time by myself and the other with friends, both times i sunk many many many hours into it. I loved that first game a ton.\nThe second game is a worth successor. It is different but not bad. In fact it actually has more replay value than the first as now if you want certain classes you \"unlock\" them. Which would be terrible, if you classes were not now just another equipable item. So now you can fuse classes into what ever you like. \n\nOne. Massive. Drawback. \nThe story. Oh it is awful. In the previous Remnant game the story wasn't really there, but it was in the background. It connected all the random regions. And it was interesting. There was a mystery. You wanted to know who the root were. Where they came from. All that Jazz. \n\nWell some of those questions get answered, but the real main character is a girl from the previous game. A dremear from the ice world.  Well she and the new McGuffin are going to stop the root and you are going to help. Its so stupid. She isn't likable. She isn't a big bad boss babe but shes annoying enough. \n\nAlso DLCs are worth it. Fun. Snag them when you can. \n\nIf you've never played Remnant 1:\n3/5 : snag it on sale \n\nIf you've played Remnant 1: \n4/5: snag it when you can",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Firstly it is a bit horror and hard , but after u play some hours it becomes a lot more interesting and funny in the same time . \nIn my opinion this game is 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The genre isn't for me. I personally always found Souls-like games appealing, but I simply lack the skill to be good enough to enjoy them playing. And even though many will say, this isn't a Souls-like, it still shares many mechanics with the genre. It is a genre mix. I again fail to dodge roll at the right time, and fail to read the enemy moves. Don't get me wrong, this is a very forgiving Souls-like, but still enough to annoy me. I hate repeating the same section multiple times, which happens way too often.\n\nI assume this would work much better in coop, and I will keep playing this for a bit longer, but this is my initial thought about the game. I eyed with it for quite a while and even played it a bit while it was available on Game Pass. Didn't enjoy it back then much, but still wished I did, and though I maybe get better later.\n\nBut for now it isn't just a skill issue, I suppose. The world is weird, which is good and bad. Weird in the wrong ways, which I can't describe. It just doesn't click. Then the levels are sooo empty, that it almost feels like a bug. Then a few trash mobs come along and I have fun for like 1-2 minutes. Then the long walk continues, till I find more enemies. I sure don't expect action around every corner, but I feel like proper Souls games did this much better. Also the map design is just weird. Many ways lead to nothing. You can go left finding no enemies or loot, or you can go right finding no enemies or loot, which then merges into the same road anyway. And this happens very often. Why even split, when there is nothing?\n\nAnyway, it is what it is for now. I will update once I feel like I have more to say or even to correct myself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, but the first (Remnant from the ashes) is better in my opinion.\nStill very good, 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely better than previous game\nThere's no infinite gank bosses\nAdds are bare minimum and majority of boss fights are skill focused 1v1 fight\nDON'T BUY FTA, BUY THIS GAME FIRST",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "real fun game and unique from other souls likes i have over like 120 hours across both steam and ps aswell as clearing apoc difficulty and hardcore and so on def worth playing even more so with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want a shoter multiplayer RPG sousl like, there is no match on how much fun you can have with your friends.\r\nwhatever gunfire games is gonna cook in the future i`ll be hype about for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Pretty good. all the gear is earned through bosses, encounters, exploration, or solving interesting puzzles. once you beat the game for the first time, you unlock a class specifically designed to help you find secrets. some of the best music and boss fights ive experienced in gaming. 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark souls with guns? nah. Puzzle game involving guns? yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally bought the game on steam on sale. \n\nOne complaint has developed over time in this game such as having FOV instead of a distance slider. Have cranked the FOV to full (2.0) just to see how it would look. Oh man, kill me now. Or not. I was still able to improve one boss fight, which told me that a distance option would have been a better version without the caveat of turning the view into a fish bowl. \n\nAnyhow, the game is certainly fine. Graphicly sure, fidelity not so much. I finished it once and am playing the second run casually.  Content has been added that I haven't seen, but then that's how the game works here. You don't get to see everything on the first run. Only that on the second run the variety of guns that I've encountered has been lessened somehow. I know that's rather RNG and not being true, but that's how it is.  \n\nShort co-op runs are a treat. You take a look at others builds from the outside and make notes for your build as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Idk why people have such low scores.\r\nThe gameplay is fun, the progression is fun, the story is fine.\r\nare people mad that some stuff is super hard to find without a guide?\r\nWelcome to souls-like stuff n00bs.\r\ngit gud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Satisfied my RPG needs and being quite difficult is what I like. Boss fights are a definite highlight but normal mobs are pretty boring unless you are on the hardest difficulty. I wish the progression system was a bit more unconventional as I think it would bring the game up quite a lot, but hey, that's the world we live in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun dungeon dive game, lots of different builds, and just fun to explore, die, and then go again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, but add a voice chat and text chat since i can't communicate with people",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have played Remnant 1 & 2 for some time, love this game! I am seventy-eight, and just finished my third machine! I slough my way through and a grandson handles the Bosses! What a hoot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1. Its an Elden Ring clone 100%\r\n2. Considerably more enjoyable and survivable than Elden Ring\r\n3. Great solo and coop gameplay!  Easily recommend, great battles and memorable bosses!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fantastic game and largely a hefty improvement over the already good first game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Changing my review to positive after putting in more hours. There are things that make this game fun, and there are things that make this game not fun. \n\nMy biggest issue that kills this game for me is that enemies scale off of your power level. You will feel more powerful in the beginning of the game and feel weaker and weaker as the game goes on. Your weakpoint sniper headshots that used to one shot enemies now take two, or more. Its rediculous.\n\nThis all leads to second biggest issue. Unlocking things. The classes, weapons, and armor are locked behind some secret you have to use a guide to figure out or even know existed. This games secret secrets have secrets. I think its a stupid design choice.\n\nOther issues include: Extremely boring grind for player power. Some of the boss battles feel overly difficult in an unfun way. Weapon balancing isnt even close. Procedural generated levels get old fast. The story sucks. The characters are boring. The weapons are boring. This game punishes you for wanting to try new things because the grind is so bad.\n\nThat isnt everything bad and there are some good things here also. The bad just stands out like a sore thumb.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Впечатляющий прогресс на фоне первой части. Из недорого \"соулс-лайка с пушками\" серия превращается в богатую, нелинейную, разнообразную, крайне стильную приключеньческую игру с интересными врагами и боссами. В игре высокая степень реиграбельности, множество секретов и большой простор для билдостроение. Из минусов стоит отметить имеющиеся проблемы с производительностью и уж слишком сильный акцент на генерацию в локациях. Если в следующей части авторы сделют больше усилий в проработку уровней и локаций и их разнообразии то мы получим идельный проект. 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't let the HRS fool you, I have this on PS5 and PC and been have swapping between the two and trying different builds from the PS5 to PC. Have clocked WAY to many HRS and felt the need to post something since I play this more then Dark Souls. And yes it's exactly as it says \"Souls with guns\". Pick up the first to get a feel and then play this. You won't get lost cause most, if not all of the secrets have been found, so can watch a quick clip online and get the items/gear you want or need. CO-OP is quick get in and out without interruption to the other players but be careful of the speedrunners if your new or someone looking for a certain item and they jump in only to leave once the item is found. If this bothers you, you can always change this to offline or friends only. Compared to other soulslike, I give this two thumbs up. See you in Ward 13!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the Remnant serious just wished they ( the devs) would show it more love. I was hoping for new areas but you can't be completely upset with how well they listened to player feedback and system upgrades.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game - as long as you’re young, rich, and have way too much free time. \nThe puzzles and hidden gear are so insane you’ll be Googling everything like it’s homework.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DLC's are good, they have a one-shot option, where its ONLY the dlc content, ignore the mixed reviews",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can play with friends, Amazing Graphic, Amazing Story and etc. : D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a well made game, i remember playing it a year or two ago and highkey my relationship ended cause of this game. like i remember i played this game for like 12 hours straight and gave her like 0 attention one day. W game though, L ex girl.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remnant 2 is an astounding improvement over remnant 1 in every way I can think of, a game which was already something I recommended to friends.\n\nI only had one problem with Remnant 1 that I thought should be improved: the level design.\n\nLevels in remnant 1 were mostly boring hallways, a split in the middle, and a shortcut. Very little verticality, and the verticality that does exist it just going up and down ramps\n\nDungeons were similar, hallways with 30-second side paths that have like a chest or something in the end.\n\nStill, I loved remnant 1, its gunplay, enemy design, visuals, all impressed me.\n\nRemnant 2 fixes the level design problem with great exploration. Each corner can lead to the best dungeon you’ve ever seen, an amazing boss fight, a side quest, or beautiful sights.\n\nIf that’s all Remnant 2 did, it would already be an A tier game. It’s everything else that Remnant 2 does which impresses me even more.\n\nThe music is better, the boss fights are mechanically and visually better, the sights are better, the combat and enemy design is better, the weapons are cooler, the mods are more interesting, and the regional main quests evoke so much curiosity.\n\nRemnant 2 succeeds massively the one place I thought Remnant 1 failed, and that would have been enough. But Gunfire games went even further, improving what was already B-tier passable, creating one of my favorite games of all time. I can’t wait for whatever Gunfire Games does next",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great fun! This is how you make a unique souls like while still keeping its feels! Got it on sale with DLC's and so far I am really finding it a lot of fun and very challenging!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are a great many \"builds\" undiscovered by the community, even as far as what the wiki knows. I use one such build, and I'm having an absolute blast.\r\n\r\nThis game started out at \"dark souls\" difficulty. Now I'm the boss. And I love it. I can see what makes hardcore difficulty passable on veteran, long as one gets a little lucky and finds the right gear first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only on 4 hours but can safely say this is better than the 1st one. Therefor, if you liked the 1st one get this one ! If not, might still look into it as it's a more well rounded game as the first one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Darksouls with Guns. And Fists. And Drones. and Minions. And Dogs. and Turrets. And Swords. And Scythes. And Robots. And so much more...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A proper sequel in every way. \nThis is a no-brainer to pick up with a friend or two. \n\nThe same charms from the previous title still shine bright here, with an even larger amount of custom builds, gear, collectables and story. The puzzles are more prevalent and random zone encounters are a bit more meaningful, so this one might even be more replayable than the first. \n\nI enjoyed the endless hunt of the perfect build so I could do a hardcore, hardest playthrough to make the ultimate character. I believe my final form was from hunting down the story clues of a main protagonist and becoming a god of lightning prowess- no longer needing guns, simply melting everything in avatar form and tapping the power of my gear. \n\nSuch a fun experience and fond memories for all of is involved, have one for yourself and see.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with a lot of replay value its a shame they didn't bring back the roguelike game mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't know how it took me so long to pick up this game. 9/10. One note: It needs more story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "some of the randomness was tedious to get certain things like the badges etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was a fun game and I met a alot of cool people playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shooting and rolling. Never been a fan of Souls likes (Last one I played was Demon Souls). However, having a good time here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game Good fun loads of replayablity. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game but could have been better with the potential.\r\n7.1/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm just a casual gamer.  This is perfect for unwinding.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Classic Soulslike game with guns, super fun to play with friends or join randoms games as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Remnant 2 is definitely a solid improvement over the first game.  A more engaging story, overall better combat and interactions, as well as more interesting level design and boss fights.\n\nThe biggest problem I had with the game is that I settled very easily into a very strong build that just... didn't work for the final boss fight.  It's easy enough to switch to a different piece of gear, but it's also incredibly infuriating to feel like you HAVE to make that switch, just for one final fight.  Is it beatable with any gear?  Sure.  But the challenge level of the build I was using was clearly above what it would be for many others.\n\nIt's definitely a game worth playing, but be aware: the final fight requires a lot of movement, and slow firing weapons are not the right call.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In hope that one day my friends will see this and are inspired to try it. If you can get it on sale it’s easy money well spent. \nGreat game. X",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot of fun! lots of guns, good endgame and the areas are randomly generated through each run, the story is not to bad, gunplay is tuns of fun,  This game is also WAY more fun with friends, the music is INCREDIBLE! atmosphere is amazing and very immersive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really good game\n\nLike Dark Souls, but good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful co-op experience. not very optimized tho",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not even 2 hrs into the game and I just know its peak. Please make remnant 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but too many fucking elevators",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dark Souls with GUNS, super good game try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard and fun with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yes, is great game very good!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100%ed the game, 0/10, not enough knives.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Both times I have played this game it has reverted my save file back to zero progress into the tutorial, judging by that and the game not being updated for a year now, I cannot recommend this game. That is a massive bug to leave in the game. 3 hours tonight and zero progress, uninstalled. Wont be playing again.\n\n\nEdit: Found via a Reddit thread that deleting the character and starting fresh resolved my above issue. Have since played about 30 hours more, content is pretty short. But the game seems alright. Still cannot recommend the game as the devs have seemed to have dropped all support for it.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I feel like devs did everything in their power to make this game not fun and terrible experience. The locations are designed in such a way that the player never knows where they are or where they should go, and the map doesn't help much in this regard. Combat is mediocre at best and the only positive thing about this game is that you can struggle with your friends instead of alone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ran great when it first came out but after the dlc's came out I can't even get it to run now",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "a strong focus on replayability without the incentive or motivation to play more than once, if at all. i am completing this game out of spite for the $15 i spent on it, id suggest waiting for an even cheaper sale if you really want to try it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Decided to play tank, thought through the whole campaign I'd get something better than the starting equipment for my class. That day never came, went through the entire game, never getting a set of armor that wasn't significantly less armor than the starting equipment, never found another shotgun or handgun that fit the class. I legit went through the entire game, not even having maxed out class starting equipment because that was the only possible equipment for the tank class. Then the game just suddenly ends, the entire story was wack as all fuck and out of nowhere it's just over. Short ass campaign that left any enjoyment from the gunplay null and void. If you do install just play the crit class, every weapon and armor set is apparently only fine tuned for that class and that class only.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Remnant 2 feels more like RE4 if it was a mediocre looter shooter than a Souls-like. Bought the Ultimate Edition and regretted it. If you want to try the game, it’s better to start with the base version first.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just kind of mid. Some bland and repetitive level designs, overdone grind compared to the first. Randomized maps feel better, but pacing feels off. Gimmicky bosses. Melee feels better, but ultimately the first is a better game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a game that makes you want to play it, but the bosses are just terribly designed, not fun at all. Besides, there are frequent crashes during boss fights.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Visual this game is better than the first one. \nThis game lacks intresting bosses, storyline and ending ontop of the maps being bland and repetative and the DLC's are dissapointing. \n\nI am very dissapointed with the DLC's just being a copy and past of the orginally main maps and im also disapointed that in order to do them I have to reset my campain and play again when in the first one there was a clear set layout and the re roll changed the dungeons and interactions. \n\nIt was fun at first playing with freinds but thats only what carried me through playing the game, I normally like to compelte the games achivments but I dought i will. \n\nI cannot recomend this game, If you wanna enjoy a remanant game then go for the first one. Remanant 2 is very disapointing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is a lot of fun, but the friends list doesn't show up and the cross-play is so bugged you can't actually play with friends. So as long as you don't mind playing with the public or solo, it's fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Story is soo random, boring and illogical its frustrating. No immersion no cool back story and lore like it was in the first Remnant. Half the boses are just annoying no fun, half the maps are too big and uninteresting to explore and the worst insult is the ending just awful and stupid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "piece of trash game with terrible final boss and questiionable playtime, if you dont do mediocre dungeons you are done in a couple hours",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really tedious, really clunky. Also these characters are terribly written. \r\n\r\nThere's some nice world design & combat builds here, but this is insanely grindy and crammed with filler. The main problem is that the combat, the heart of this game, is mindnumbing. Every area has to replayed over and over to farm XP or materials. It's endlessly respawning trash mobs, followed by spongey boss fights built around spamming healing items and dogderolling to exploit i-frames. Something as simple as jumping and tossing melee weapons never feels responsive. Melee combat is rudimentary hack and slashing, but as dull as it is, it's more effective than most weapons in my experience since you are constantly running out of ammo. \r\n\r\nMaybe this will appeal to Dark Soul fans. But it's not for me and it's not built for fans of third person shooters in general since the AI is painfully basic, either ambushing you or able to be cheesed around corners. Which is odd considering its arsenal is mostly guns. What a weird bait and switch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’m an older adult gamer and have really been enjoying Remnant 2 overall – the atmosphere, guns, and builds are great.\r\n\r\nHowever, the Proving Grounds area is basically a brick wall for me. The combination of super-tight platforming, small pedestals, and rapid-fire traps feels tuned for perfect reflexes. For players with slower reaction times, this isn’t “hard but fair”; it’s just not realistically playable.\r\n\r\nI’d love to see some accessibility options here – things like slower trap timing, reduced trap damage, or an alternate safer route after a certain number of deaths – so older players and those with mild physical limitations can still progress and enjoy the rest of the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the worst games I have ever played. Whoever did the level design for this should find a new career.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This seemed to have some serious potential, building on the last game\n\nThen, an hour and a half in, there's a platforming section with traps that down you instantly and drops that kill you if you miss the jumps. After 5 deaths I managed to make the first two jumps and landed on a pressure plate that triggered the next arrows that instantly downed me before I could reasonably react and I alt f4'd out.\n\nGame devs, this is the fastest way to make someone who wants to play an action-shooter-soulslike absolutely despise you as a company.\n\nEdit: And after 10 deaths I made it through, did a brief bit of gunplay then was put into a chamber where vision was blocked and pressure plates activated more and more instant down arrow traps... This is the single worst fucking introduction to a game I've ever had and I do not think I'll be playing further.\n\nEdit 2: 30 more minutes of crouching (the game did not tell me how to crouch or that it would work) under the arrow room, I got through... INTO AN INSTANT DEATH SAW HALLWAY\n\nAnd at this point I realized that it was wasting my limited time and patience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a 50:50 review, honestly. My main issue is ... why does this even exist? It doesn't really do anything better than Remnant 1. Yet it is a quite expensive undertaking, and the DLCs can actually make the initial campaign A LOT harder if you happen to roll them. Why? Because for some reason the devs decided that each campaign would be randomized. More on that later.\n\nThe good stuff out of the way:\n- It's not ugly (but also not super impressive)\n- The worlds are different both in optics and in layout\n- Decent enemy variety\n- The 2-class system is neat, sort of, but nothing new in this genre\n\n\nNow for all the stuff I didn't really like:\n\n- Each world has 2 different \"chapters\" (3 with the addition of the DLC), yet the campaign chooses one at random, breaking up their individual stories. Not that it matters much, because those stories aren't all that interesting, for the most part, but it just is a bit strange to basically defeat the \"final boss\" before you even get to actually experience the story of that particular world. And like I said above, stumbling upon a DLC campaign (IF that is possible and they're not excluded from the pool) would mean stumbling upon more powerful enemies and bosses.\n- The story itself is forgettable and skippable, I wish there were an option to just ... not have to click through endless dialogue. If the devs don't care about the story, why should I?\n- Tutorial with a forced companion, who you will probably never interact with again in the future. Nice.\n- Weapon variety is ... not all that impressive. You have \"Long Guns\" and \"Handguns\" and \"Melee\". The latter is completely forgettable in this game, unless you specifically build your character around that ... and even then, most bosses are not melee friendly at all. And unfortunately, you can't simply pick and choose which weapons you want to use, no you HAVE to use a small gun and a big gun, no way to just pick a sniper rifle and an AR, not that there are many sniper weapons to begin with. Most single shot weapons feel underpowered to me. You will not use them in boss fights, I imagine. They're just there to pick off far-away targets with headshots, yet if you have no viable alternative weapon or you just wanted to use another \"long gun\" you're shit out of luck.\n- Weapon mods are similar. Some are neat, others feel pointless, and yet they all cost a lot to craft before you know it. Then you get actual good weapons and you can't use them anymore, since those all have UNIQUE weapon mods!!! I shit you not, I have like 20 weapons (including the garbage rusted ones you get from the beginning) and I can maybe install mods in only a few of them. I guess the game wants you to buy the other classes' weapons for variety, and they're probably even competitive if you upgrade them, so there's no real power imbalance I could see, but it just felt a bit disappointing.\n- The trait system seems somehow worse than I remember it from Remnant 1, at least I didn't really feel compelled to invest in any of them ... More HP and Stamina are a given ... but it just doesn't feel rewarding to get 1% damage reduction, up to 10% ... it feels like an outdated mechanic.\n- The main draw here is not the campaign, but rerolling the maps endlessly in adventure mode to find all the different stuff. Luckily, there is a 3rd party tool out there that actually let's you see what you rolled before you spend 5 hours in a world that has nothing you need. Not really sure about this design.\n- Solo play basically forces you to be very defensive. The Handler class is a given, because the pet's healing and resurrection is almost mandatory, even on the easiest difficulty the enemies and bosses can hit like absolute units and soak a lot of damage. And then I got the Warden and focussed on shielding, which also saved my bacon more than once.\n- Gameplay loop is rather boring. Once you've seen everything there's not a lot of incentive to keep playing for playing's sake. It's a rather mediocre 3rd person shooter. You walk/run, you shoot, you dodge. There is literally nothing more to it. You get 2 abilities and your weapons' abilities, so 4 to 5 in total, if you want to count the melee weapon, which you probably shouldn't. The character abilities are on a timer, mostly, and the weapon mods need to be charged by shooting ... The view is very restrictive, the dodge, even a normal dodge, very slow, meaning you often get caught in the follow-up attack anyway if you manage to dodge anything while aiming down sights. The bosses are a damage race, healing with your \"estus flask\" (the heart) takes forever and every hit staggers you out of the animation. I didn't find it particularly enjoyable, I'm afraid. There are better games of each genre out there. This is probably more fun if you play it with friends (not randoms, I can't see how THAT would be enjoyable with everyone rushing through the maps and doing whatever the fuck they want).\n- There are supposedly armor sets in the game. I found ... two. In almost 30 hours. Yes, again, you can buy the starting armor of each class, but still ... that's not the same as finding stuff.\n- Exploration is mid as well, it's trying to be \"soulsy\", but completely misses the mark here. It's more annoying than anything. Heck, the game might be better by just being a corridor or arena shooter ... and that's saying something.\n- That annoying dog yowling and barking all the time.\n- Bosses are mostly just spam and dodge fests ... hard to see anything.\n- Instant death trap dungeons like in Super Fucking Meatboy ... in my 3rd person shooter (NO idea how to actually complete these).\n- Puzzle rooms in my 3rd person shooter.\n\nAll in all, maybe get this on sale if you have 1 to 3 friends and you want some 3rd party shooting action. More characters can actually mean more character personalization. A lot more options to mess around with. Otherwise, I'd actually skip this one if you're in it just for the solo experience. I got it via Humble, bought the DLC for cheap, got my money's worth from it, but I'm not ... elated. Will finish the remaining 2 Losomn maps, because \"sunk cost fallacy\" ... and that's it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very great game, so sad that the performance is so shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very poorly balanced. Horrible instant death boss fights ruin the game. How am I supposed to beat high level bosses if materials to upgrade my weapons don't spawn in any available area? Could not have been more frustrating.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Needlessly repetitive; almost every door is locked; necessary pathways are obscured under time constraints; one of the games with the most potential and most missed opportunities to be great.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Basic controls and movement is the true difficulty of this game, it's super slow and clunky\r\nand that's just the start of the game\r\nI can't imagine trying to play this when things get hectic",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a downgrade from the first.\r\n\r\nFirstly the worlds. In the first the worlds were short, sweet, and randomized with random loot and bosses. Which I am not a big fan of in the first place but never mind.  The maps in this one, with the exception of 2 maps, were dull, real dull. Also some maps just have platforming which sucks.\r\n\r\nNext the gameplay. In the first there was a common enemy type, and a unique to the world enemy. In this one, it is the same, but worse. Why? Because half the enemies have super small critical hit boxes, or not critical box that I could even find. The loot, also now sucks. In the first, there was a lot of fun rings and guns with fun mods to attach to them and you could get really silly with some builds. In this one, there isn't enough. Boss guns? What boss guns. Out of 4 worlds, we only got 1 boss gun out of around 10 bosses. And the gun was meh.\r\n\r\nThe story is just bad. The first wasn't great, but this one just sucks. So, it starts with you fighting the Root, somehow. Which if you never played the first game, you killed the root, the core of it, the source. Yet somehow, they are still around. Also you go after some of your friends that are pulled into the crystal, but if you have the DLC, you could be left really confused, because 1 of 2 things can happen. One, you are teleported to the first map of the game and progress the story by following the trail of your friends. Two, you are teleported to a DLC area where there is not a single reference to the main story. And out of 6 tries only 1 got option one. The others got teleported to the same DLC planet, which I might add, is the worst map, with the worst loot.\r\n\r\nThe cherry on top of all of this, is that the multiplayer is buggy, and it is the bad bugs. Like my friend being unable to obtain a key item that unlocks an entire subclass, just because they were dead when we randomly picked up a random item in a cave that required strict platforming.\r\n\r\nHowever there are some positives. The maps look cool, the new boss systems are cool. Also I really like the multiclass system.\r\n\r\nA disappointing follow up game. It has some highs, but they are much lower than the first game, and much fewer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "How have they still not fixed the terrible mouse control in this game. jesus christ these guys are terrible. and you cant really just blame unreal 5, cause fortnite works just fine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks the unwashed asses of 10,000 homeless vagrants, it ran like shit and after playing for a couple hours it wasn't even a fun experience. Gunplay felt like shit, the enemy design was annoying and overly tanky for how early in the game it was, levels were janky and I fell through and glitched in multiple locations, all in all it was dogshit. The first remnant was great game but that was before gearbox sunk their claws into another promising franchise and ruined it. Worst 15 dollars I've ever spent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall a very mediocre game.\r\n\r\nThe PC performance is abysmal for how the game looks.\r\n\r\nGameplay is boring and tedious.\r\n\r\nMap layouts are awful.\r\n\r\nStory is bad.\r\n\r\nEasy skip.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I am unsure to why people give this game so many good reviews. The movement is sluggish, the combat doesn't feel impactful, the graphics are from 2009, the characters are a bunch of goodie goodies and the list can infinitely go on.  The game is also poorly optimized. I am running a 4060 and I am barely running the game downscaled from native resolution to 1080p on quality settings with Frame gen on at 60-80 frames in close places, and 60 or below in open spaces. (Recommended being 2060) Lord forbid you destroy those gas tanks. Your frames will die instantly, and you have to quickly move to another room while lagging and choking on gas. \n\nThis game is not what I was expecting it to be. I am at least happy some of you are enjoying it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Utterly miserable game. I've tried on three separate occasions to like this game and I just can't.\n\nI love shooters, I enjoy souls-likes and have 100%'d every FROMsoft game (of which this game borrows heavily from) since Demon's Souls arrived in my lap as a Japanese import after word of mouth on /v/.\n\nThis game is hideous looking. It looks like trash, and it runs even worse. Every single optimisation guide on Youtube recommends DLSS or FSR: all I can ask is how and why? Crowds are not dense, models are not detailed, draw distances are not far - so why does this run even worse for me than Ninja Gaiden 4 on Ultra, worse than Space Marine 2 on Very High, MGS Delta on High, Oblivion Remastered on Ultra, et. all? \n\nMy PC is good, it can run the latest games at well over 120+ without framegen or any kind of upscaling. It is insulting a game this bland, ugly and hideous essentially mandates you turn that latency-ridden trash on. \n\nThe characters are dull, the writing is 2016 latté drinking millenial tripe, and the story is so clichéd it would make the Barnes and Noble discount YA novel section blush.\n\nThe music is generic hymns and thuds for combat. The gun sounds are whimpers in an ocean of mediocrity.\n\nGenuinely, what am I missing? The combat is easy, the world is boring and bland, and the performance is terrible.  I have a three strikes rule with a game where I give it three separate occasions to grip me. Remnant 2 has failed three times in a row across a year and a half, during which time the performance hasn't improved whatsoever, even after my CPU upgrade to a 9800X3D. I'm the first to blame UE5, but the reality is, most of the UE5 games that run like ass at least look good. This looks like my cat's vomit after she's eaten her food too fast.\n\nThe real stinger is I bought this game in the 2023 winter sale, so by the time I had given it it's first of three tries, my refund window expired.\n\nThey seemingly want to waste your time as much as possible, with animations so long-winded they wouldn't look out of place in Red Dead Redemption 2. Not only are they slow, they look terrible too. I get Gunfire is what we call \"AA\" and normally, AA games have an intrinsic charm that makes them enjoyable, but this is so soul-less, which is ironic given its very clear inspirations.\n\nAnd miss me with the \"it gets good 10 hours in\", yeah, so does playing in traffic because eventually I'll get an adrenaline high that makes dodging between cars worthwhile. If a game cannot grip the player in its opening hour, it fails as a videogame. I expected better from the devs of Darksiders and worry about how DS4 will be if these incompetent, lazy devs make it. \n\nAbsolute trash.\n\n(also my playtime is misleading. After trying to refund it twice, it seems to reset my playtime each time. I've clocked in ten hours at minimum.)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Horrendous. Even at $15 I feel jipped. Whoever thought this was worth $50 is zooted out of their gourd.\n\nStory: shit\n\nDialogue: shit\n\nGameplay: clunky and unresponsive\n\nBoss design: uninspiried\n\nArea design: decent (too bad theres *only* 4 of them)\n\nI have never felt the sting of the illusion of player choice harder in my life. It took 14 hours to actually beat this game but oh my god it felt like an eternity. If you're gonna make a game that's based around \"replayability\" you should probably make sure it's at least fun the first time. Save yourself some cash or buy anything else, trust me. If you must play this game buy it on a sale so cheap it doesn't run you more than a coffee.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm sorry, but for me this is a extremly useless game...everywhere i try to doge the shiter knight hits me....i lost time and money on this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Keyboard support is bad, expecially with key that show up on screen, even worse if you're not QWERTY (yes we exist ). I can't recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is kind of strange, it looks nice, have some potential but I can't enjoy it, I have no idea where to go and what to do most of time so I push forward until I reach end of map and hope something is gonna be at the end or what I missed. Combat is also strange. it is not fun to play, even cheating doesn't make it more fun or easier",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "developers just hate gamers. Solo - its hell, where you playing  just for a bit to reduce the pain  and stressful immersive difficulty, for nor a reason!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't start a game without linking your EPIC account . What a load of bullshit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is good, but writing is bad, game is too short (just finished it), enemies are often same-y, world isn't polished (most of the environment is bland and repeated 100X)... AAA price but without polish. I would recommend this game if it was 20 bucks, but at 40, not worth for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this game if you intend to play it solo. It is impossible. You get oneshot by bosses you can only challenge once duo to the fucking great design choices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first game was so good, so well-crafted, that I gave it 9/10 and even placed it into my masterpiece category.\r\nThis one is just a pile of UE5 trash.\r\n\r\nQ: Would I recommend?\r\nA: No. Just play the first game and that's it.\r\n\r\n[+]\r\n1) Stylized high-quality textures\r\n\r\n[-]\r\n1) Unoptimized UE5 trash\r\nFPS all over the place, cannot get constant 4K 120 FPS on native even with custom settings.\r\nHigh dependence on upscalers and frame generation,\r\nlatency issues, control responsiveness issues, stutters...\r\n2) Massive FPS swings\r\nOne moment you have 4K 120 FPS on native, the other you are looking at a fountain and getting 4K 50-60 FPS.\r\nIn open areas you get 4K 90 FPS on native, in closed 120+ FPS...\r\n3) Cutscenes are locked to 60 FPS\r\nIf you can even get 60 FPS...\r\n4) They/them nonsense\r\nDevs even managed to insert wokeness into the game...\r\n5) A lot of yapping NPCs\r\nNon-stop monologues of almost every NPC you encounter...\r\n6) Stutters\r\nNot much as I initially expected from the UE5 game, but they still present and ruin the experience.\r\n7) The most annoying jump-to-the-side mechanic\r\nThe most annoying thing devs have ever created.\r\nI think the same mechanic was in the first game, too, but not that annoying as this one.\r\nEven some bosses do this jump-to-the-side thing...\r\n8) Badly-written story\r\n9) Ugly female characters\r\n10) Most of the action is in the last chapter/map\r\n11) Devs only know how to make rings\r\nNo, seriously, in a shooting game, the only items you ever find are rings...\r\n12) Some freezes\r\n13) Constant, periodic freezes if GPU is overclocked\r\nNo matter how small the GPU overclock is, in about an hour the game freezes.\r\n14) Unresponsive controls\r\nThe first game had perfect, I repeat - perfect, keyboard & mouse controls.\r\nThis game has regressed so much, that switching weapons with a wheel is so painful, you have no other choice but to use keyboard.\r\nAnd the latency is just awful.\r\n15) Overall, this is just a bad, unoptimized copy & paste of the first game into the UE5\r\n\r\nI was so excited to play the second installment of the perfect first game, but was utterly disappointed...\r\n\r\nConclusion: 4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, BIGGEST disappointment of a sequel I've experienced in a LONG time. Other games have shitty sequels, but this one was just SUCH a disappointment after its first game that to this day, I am just so annoyed about it...AND I GOT THIS GAME ON LAUNCH DAY!\n\nI'm sorry, but when it came to innovating on each part, they chose either something minimally better or the worst decision you could make. One of the main things is the AWFUL story. The first game, you learned through environmental storytelling, and I got lost in the world. It was fun! This game, they tell one and it is so damn lame. Then, there is that AWFUL ending! They try to claim there is stakes with what the \"chosen one\" chick \"has\" to do or what they could do, but it is pretty much the same result no matter what they decided to do for you with how the story is told for you. Idgaf about spoilers, so I'm just gonna say it. The ending is the final boss can't be actually killed and the \"chosen one\" girl has to wipe the universe and reset it somehow? So, after the bossfight that you don't actually win, it basically Thanos snaps everyone, briefly shows the guy mentioned at the beginning of the game (he went on some kind of journey and gets back to camp just in time to be snapped from existance), then in the after credits which are SO DAMN LONG shows the world come back without the infection? Thats it. No further explanation. Everything is just supposedly fine now?\n\nAlso, what you need to do to get unique items to get the special guns has you constantly resetting your game to get the right world, but if you didn't get the right dungeons within that world, you gotta reset again after checking. Trying to get what you want specifically will take HOURS and is not worth it.\n\nJust...I'm done. Also, if you are playing solo, you will be miserable. It is a MUST to a 3 man squad. There is fun to be had scattered through it, but it is not worth it, especially with that terrible ending. 3/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I get that the game can be fun... it's Remnant after all. But you can play a game and have fun without having to get cucked first in order to do so.\nThe agenda showss\nVirtue signaling/10.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Horrendous. Even at $15 I feel jipped. Whoever thought this was worth $50 is zooted out of their gourd.\n\nStory: shit\n\nDialogue: shit\n\nGameplay: clunky and unresponsive\n\nBoss design: uninspiried\n\nArea design: decent (too bad theres *only* 4 of them)\n\nI have never felt the sting of the illusion of player choice harder in my life. It took 14 hours to actually beat this game but oh my god it felt like an eternity. If you're gonna make a game that's based around \"replayability\" you should probably make sure it's at least fun the first time. Save yourself some cash or buy anything else, trust me. If you must play this game buy it on a sale so cheap it doesn't run you more than a coffee.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Combat sucks ass in this game. Worst I've ever experienced in 30+ years of gaming",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was one of the worst games ever to play. I've played this game for 4 hours, and 99% of it has been riding escalators and opening AAA loading doors and running around pointlessly with shit direction. \r\n\r\nThe gameplay isn't even that great or fun, it's just ok, not worth it at all for this torturous waiting type game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am in the second zone. I have encountered an error where the Labrynth Colosseum is bugged and the path isn't open. Since August of 2023 at least this has been an issue and has never been fixed. There's a solution to get someone in co-op to 'high 5' glitch you through the door.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a very good shooter. No Co-Op saved progress either.\nDon't bother.\n\n*shrug*\n\nFor more truth bombs, check out my [url=https://store.steampowered.com/curator/45205161/l] curator.[/url]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Network connection lost\" every single time when trying to play with a friend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "2 minutes in and I have to listen to ridiculous talk from some teenage smarmy little sht character that I seemingly have to babysit, naw , refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downvote until delete or make doable 3 unobtainable achievements in Chronos: Before the Ashes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's alright, combat is a little too tedious for me and not rewarding enough. But I do see the appeal and respect the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's disgusting to have 25+ fps on the 4090. Can't play such slideshow.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my save file got delete yippe lost 6 hours garbge game don't buy this trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "some of the worst bosses in a souls like ive seen",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Werid ass story",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ничего не ожидал от игры, получил ещё меньше",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "playing this game is reminiscent to eating **** from a butt",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game keep crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Co-op keeps crashing when i try to play with my friend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the very bestest game of the dekad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No 4 player booooo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "waste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "actual garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "не зацепило",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "killme",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game has good 'combat feel', fun boss fights, interesting weapons and great atmosphere. Sadly it's heavily dragged down by 'wiki-checklist' styled secrets that hide a lot of content. Exploration is just not rewarding when so many things require Einstein levels of IQ to uncover.",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "Asylum Floor Key 3 softlock, 11 hours in, cannot continue have to restart the game.  A key item is known to not spawn, google it. No way around it, confirmed online.  Years after release. absolutely unacceptable and looking forward to never supporting a release from this company.  For shame.",
      "voted_up": false,
      "votes_helpful": 96
    },
    {
      "review": "Now, I try to stay positive, but this game has made me the most aggressive I have ever been. \"Video Game logic\" is 90% of the mechanics in the game. 15ft drops kill you while 50ft don't sometimes. Fuck whoever is in charge of this game, you have fun mechanics, but make them extremely rare to deal with. You make 60% of the enemy types fly, just to fuck melee users, you make puzzles and events last too long to the point where going to fast fucks you, and going to slow fucks you and every single thing is just another way to make your game less enjoyable. I love the level up system and the dual class system, but my fragments never save what I have on, and are fucking randomised every fucking cut scene, death, launch of the game, and every fucking thing that I do makes me think \"Man, I wish the game devs could think further than they can piss!\". They should know exactly how far they can piss considering they speant the whole time pissing all over the only fun parts of this game.\n\nOver all, this game has some fun mechanics, and I would recomend it to casual gamers who just like to fight and leave. The puzzles in this game are great half the time. But the other half of puzzles are just \"Walk here, open door, walk to other door, get key, walk to another door, repeat.\" \n\nPart of this rant is the fact that you can easily soft lock yourself out of a puzzle area, and part of this is due to the fact that I keep dying to random bullshit. Walking down a long hallway just to see a pit, and I think \"Maybe this one is here for a reason\" but they just kill you. Never use the tamer class, your dog will not help in boss fights, since most of them fly.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "yeah lets randomly generate this ugly grey wasteland and make players run around slop land aimlessly searching for some bullshit that were not gonna explain anything about but at least we will give them the least helpful map indicator ever created",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "The procedural generation and lack of guidance leads to a lot of back tracking.\r\nThis would be fine if there was actual enemy variety and a good movement system.\r\nThis game has neither.\r\nThe movement is inconsistent, with my character getting caught on geometry while exploring, unreliable ledge grabbing, and not enough consistency in terms of what ledges can be grabbed/what walls can be climbed over.\r\nAlthough there are a myriad of classes, most players will be pigeon holed into using to Tank as one of their slots in order to just survive. This severely limits customization.\r\nI typically like souls-likes and RPGs, but the chronic inconsistency makes losses feel more luck based than skilled based. When coupled with the fact that the meta only allows for a tiny subset of builds to be viable, this game felt more like a chore than entertainment.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Both times I have played this game it has reverted my save file back to zero progress into the tutorial, judging by that and the game not being updated for a year now, I cannot recommend this game. That is a massive bug to leave in the game. 3 hours tonight and zero progress, uninstalled. Wont be playing again.\n\n\nEdit: Found via a Reddit thread that deleting the character and starting fresh resolved my above issue. Have since played about 30 hours more, content is pretty short. But the game seems alright. Still cannot recommend the game as the devs have seemed to have dropped all support for it.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I am extremely happy to be done with this game, and not in a good way at all. This game is a masterclass in terrible game design. I don’t feel like digging back to the deep chasms of my mind to list all of the poor game design and mechanics, but here are a few:\n\na)\tGimmicky bosses (Not actual soul-like bosses, i.e. giant cubes that crush you)\nb)\tGimmick trap rooms that one tap you\nc)\tHaving to constantly consult the wiki or else you get stuck\nd)\tGod awful story\ne)\tNearly all interactable NPCs are annoying\nf)      God awful optimization (game runs horribly)\n\nUnfortunately, for me, that just scratches the surface of what I found to be bad game design....\n\nThis game is a major downgrade from the first, which is really sad because it had ideas that could have been worth something. Even then, the first game is really mediocre at best too. The only true redeeming quality about this game was the final boss, which actually was quite interesting and challenging. However, the rest of my 20 or so hours of gameplay was absolutely not worth the price. In truth, I would hesitate to play this game again even if I was paid good money to play.\n\nThere are simply too many pain points to actually enjoy this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I have waited AWHILE for this review. I love R1, recently started a new playthrough with some mods, remembering why I love the series, come back to R2. I struggle to pinpoint exactly what it is, but this game makes me so mad. It SHOULD be amazing. It, in theory, adds lots of new content, and yet, when I sit down to try this game again it feels like I'm met with endless little annoying bugs, performance issues and game play that feels like it went through so much QA on being balanced it's bland with very little fun or life to the game play. The first time I played the game and it should have felt new the game had abhorrent issues that made certain maps unplayable, so my initial memories of the game are negative. As time has gone on my issues changed. Got a better PC plus they optimized so now I can play normally, they also proceeded to nerf anything remotely fun and focused on making the game seem like it was made for hardcore players only. Then they started adding infinate ammo necklaces and things that give you lots of bulwark stacks making it seem like they were backtracking on the hardcore stance. Then they started doing the most ANNOYING modifiers to red enemies and bosses. Trapper; now that we've made a game all about dodging attacks, let's randomly penalize players for playing the way we have conditioned them to play. Hexer; what if the boss was constantly attacking in every direction with all status effects all at once on top of their normal move set? These just feel like pulling teeth and with the wrong combination of boss plus modifer the enemies feel so cheaty like I'm running Remnant from Hell or something. \r\n\r\nIt just doesn't feel to me like the devs made a fun game with varied challenges. It's like they made a bunch of specific builds internally found that these builds crushed certain challenges then made specific things to counter all of them and now have flooded the game with the nonsense. Everything is sanded down and anything that they for some reason didn't think out and the players started swarming around they came out the gate with the nerf hammer like this is LoL, Dota or some other super competitive game. This is like if DS1 nerfed magic because it was op. It's op because people that suck at dodging need a build. I enjoy hitting my head against a brick wall in a souls like game, but when the brick wall grows spikes as I hit my head against it poking out my eye so I move to a different spot and it stabs me in the gut before I can hit my head, it's just frustrating. \r\n\r\nThen there is character building. In a vacume this games character building is ok. Comparing it to R1, it sucks. R1 you get 2 weapon mod slots, no mutator and no class skills, and yet, when I sat down and played it, I very quickly found myself having fun and feeling like I had a solid arrsenal. Everything in this game feels... muted. Sure they added Classes with a class skill, but half the class skills are weapon mods from the first game, so instead of any character using these skills now they are locked into one specific character with a specific play style. They gutted and destroyed all the defense mods from the first game or didn't add them at all, RIP flicker cloak. Now only specific classes can be defensive and only in the ways the devs want you to. On top of this as your power rating increases the game gets harder... not you getting stronger, and unlike the first game where you had 100% control over your power rating, the devs have once again decided to take this out of player hands. Your classes level up and contribute to your passive \"power rating\", where as before it would be entirely when you chose to upgrade your gear. This system sucks because upgrading yourself if actually detrimental, but then removing the ability to control this from players feels terrible. Sure a lot of games work that way, but I didn't like Remnant because it was \"just another one of those games\" I like it because it had it's own feeling to play. \r\n\r\nAs you can see from time played I've given this game so many chances to suprise me and really tried to come at it with new eyes. Now, years after release, I'm still finding some of the same bugs that were a little annoying when I first picked it up, all the builds feel like they have to be in the boxes the devs want them and just over all lacking some kind of heart and soul the first had. They put in hard work and there are cool concepts but the execution leaves me frustrated every time I play.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This review is primarily for those who do not like or are inexperienced \"souls\" gamers. \r\n20 hours into a \"looter shooter\" still using most of the starter weapons and armor. The characters and story are uninteresting, although the world design is beautiful. I would recommend this game to anybody who is single without kids as this game can not be paused. The enemies can spawn behind you. Bosses are always aggressive and can insta kill you in tiny battle areas with enemies spawning all around all while destroying bits of the shifting map and forcing you into aoe damage or falling to death. Healing items are time consuming and you will often be attacked before consuming, cancelling the effect. Some of the puzzles, items, and game effects will need to be externally researched along with boss fight attack sequences and map shifting, etc; as descriptions are vague or missing. There is no compass on the mini map so you will constantly be checking the map/menu in unexplored areas, and there is no option to place markers on your map (frustrating in a game with labrynths, mazes, etc)\r\nI really did and still do kind of enjoy this game but coming home from a long shift at work just to be stuck at the last part i died hoping i can get through it without dying another 15 times has turned this \"break from life\" into an unforgiving chore.\r\nCould be a better/different experience playing co-op but that is not for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Empty zones feels like im just jogging around and a lot of the bosses aren't even fun to fight either.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "This is not a good game when you play solo. Tedious and boring, it's just not good. I shouldn't have bought it...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I cannot in good faith recommend this game in its current state.\r\n\r\nThis is one of my favorite games. the gameplay, builds, enemies, bosses are all awesome. The only thing about the game itself I don't like is the convoluted puzzles to get items. Id recommend just looking them up because there is no way you would get over 80% of the items without.\r\n\r\nThat being said... the reason I can't recommend this game is because they updated the game a while ago and now I have a hard time running the game. Before I was able to reach 80 fps at medium to high settings with no crazy frame drops. Now I'll be lucky to reach 45 fps on the lowest settings possible. Most of the time it will float at 30 and lower. For reference I have a i7-11800h and a RTX 3070 laptop GPU. I'm not looking to run everything maxed out at 240 but this is just ridiculous and unacceptable.\r\n\r\nIf the devs optimize the game and fix it I'll be glad to change my review.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Movement feels bad, I don't know how else to describe it. Not being able to swap shoulders without aiming down sights in a 3rd person game is lame. Keymapping is a mess as well, but that can be sorta fixed with some trial and error. Its a shame, because I really enjoyed the first game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Last section of the game is still bugged.\nMaking game completion depend on a post-credits scene is idiotic.\nI am stuck with a broken character, that has no chance to properly end the game.\nThis bug has been known for years as i can see.\nMajor disappointment.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "We ran into too many technical issues with multiplayer to get past the one hour mark. Complete non-starter of a game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just wanted a fun co-op game to play. Could count the weapons we found on captain hook's bad hand but Literally had rings for days. Love the look and feel of the game, But its just not fun dying in 2 or 3 hits from EVERYTHING. Enemies are way over-tuned, Not much enjoyment to be found. £14 was worth it, But full price I would've cried like a baby. Update tried again. Awful game. £14, I would've rather eaten the money. Honestly. Awful.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’m an older adult gamer and have really been enjoying Remnant 2 overall – the atmosphere, guns, and builds are great.\r\n\r\nHowever, the Proving Grounds area is basically a brick wall for me. The combination of super-tight platforming, small pedestals, and rapid-fire traps feels tuned for perfect reflexes. For players with slower reaction times, this isn’t “hard but fair”; it’s just not realistically playable.\r\n\r\nI’d love to see some accessibility options here – things like slower trap timing, reduced trap damage, or an alternate safer route after a certain number of deaths – so older players and those with mild physical limitations can still progress and enjoy the rest of the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the only game that actually made me feel sick while playing. The enemies are repetitive ,like those small flying annoyances that are hard to hit but appear in every single area. The gameplay feels dead and mechanical, especially in the boss fights, which are mostly repetitive and dull, aside from a few that had interesting ideas. The characters are flat, lifeless, and empty. Playing this game felt like being trapped in purgatory.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the games great but I keep having issues with my cursor not showing up at all in game and that becomes very annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel like devs did everything in their power to make this game not fun and terrible experience. The locations are designed in such a way that the player never knows where they are or where they should go, and the map doesn't help much in this regard. Combat is mediocre at best and the only positive thing about this game is that you can struggle with your friends instead of alone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Start the game to be met with some dog poop diversity hire team straight out of some liberal New World city, complete with cringey dialog",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I'm sure at some point it might be good, but the game does not help you get there. I have no clue what is going on and no I am not looking up guides on what to do. The game should be far more instructional than whatever this is.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Ran great when it first came out but after the dlc's came out I can't even get it to run now",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "a strong focus on replayability without the incentive or motivation to play more than once, if at all. i am completing this game out of spite for the $15 i spent on it, id suggest waiting for an even cheaper sale if you really want to try it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Decided to play tank, thought through the whole campaign I'd get something better than the starting equipment for my class. That day never came, went through the entire game, never getting a set of armor that wasn't significantly less armor than the starting equipment, never found another shotgun or handgun that fit the class. I legit went through the entire game, not even having maxed out class starting equipment because that was the only possible equipment for the tank class. Then the game just suddenly ends, the entire story was wack as all fuck and out of nowhere it's just over. Short ass campaign that left any enjoyment from the gunplay null and void. If you do install just play the crit class, every weapon and armor set is apparently only fine tuned for that class and that class only.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Remnant 2 feels more like RE4 if it was a mediocre looter shooter than a Souls-like. Bought the Ultimate Edition and regretted it. If you want to try the game, it’s better to start with the base version first.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I have tried fix after fix after fix after fix after fix after fix after fix i cant get the game to stop crashing I have constant network issues Ive been trying for weeks Ill get days ill get 3 hours no issues then all of the same issues are back I love the game and would love to fucking play but i cant get the game to run smoothly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is bug city.. constant frame drops and stutters, which I acknowledge might be because of my hardware. But, big issue is I play on controller and think this was meant to be played on mouse and keyboard as the selection circle in the menus doesn’t show up until I activate the mouse at least once. Dialogue can be advanced midstream of other dialogue, constantly getting caught in the terrain. \n\nThe biggest issue though is I completed the objective in the woods, got the notification and everything but still has it marked as not completed. As far as gameplay goes, it was alright.. I’ve never been a fan of shooters but I thought I’d give this a try because it’s touted as a souls like with guns. Alas, anyone looking for a souls like should look elsewhere as precise combat, strategy and challenging bosses in this game equals spam all the things and see if the player survives. It just ends up as a frustrating experience and not one that feels good to overcome. The big tree boss had rolley polley’s that would instantly stun lock you while an elite takes you down from behind and archers pilfering you from all angles. I could barely see at times because of all the things that were being thrown on me. If that sounds like a good time to you, this is your game. It is first and foremost a shooter with a stamina system.\n\nEdit: maybe I just didn’t go the right direction? Found the flautist.. and not softlocked? so continuing, but that is very confusing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just kind of mid. Some bland and repetitive level designs, overdone grind compared to the first. Randomized maps feel better, but pacing feels off. Gimmicky bosses. Melee feels better, but ultimately the first is a better game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game play is absolutely incredible, the world and everything inside of it is creative and well designed. Everything about this game is cool and fun with friends. The ending is so ass that it ruined the entire thing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a game that makes you want to play it, but the bosses are just terribly designed, not fun at all. Besides, there are frequent crashes during boss fights.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "First game was better then this.\n\nThe only thing that Ive liked about this is locations and monster design. The rest of the game is just like the first game or worse.\n\nI dont realy like the plot, I dont know what happened to Ford and the ending wasnt goon.\n\nIm simply dissapointed",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Thought the game would be better this time around, after starting to play 2 years after I bought this with a friend this time. We beat the story campaign and decided to try to get all achievements after beating the first game. This game fixed a lot of problems the old one had while making new ones that are horrible changes. \r\n\r\nSTORY: The people in the story besides a select few have no bearing on anything in the game and are just there to serve as random people to talk to, or as merchants. Everything in the story does not matter except for the old man being older, and the magic storyline plot point woman doing her magic storyline points for about 3 parts in the game. I never got any real excitement from talking to any person outside of bosses.\r\n\r\nEQUIPMENT: Variety is very good. The guns have lots of different choices and a lot of them feel good to shoot. The rings are a hot mess where I have to sort them using filters because I have about 50 of them and I use maybe 15. Necklaces are powerful and I enjoy finding a new one. Armor is mostly just for looks compared to the first one, with heavy armor reducing marginally more damage. Mods are distinct and fun to use. Mutators are also a nice touch to the game that I like.\r\n\r\nMELEE: Melee is actually insanely fun. Being able to tank and attack many enemies at once and enjoying the carnage you cause makes this game very positive. The problem however, is that most boss fights are IMPOSSIBLE to beat by melee only. You are forced into a position of using your gun for half the fights to do either gimmick bosses, or flying bosses. This is horrible since a good portion of equipment is focused around melee and doing different effects with charged attacks. You can only really play true melee in multiplayer where you are target dummy while your friends kill the boss.\r\n\r\nECONOMY: Scrap is much less plentiful, relying on selling random things you forget are in your inventory. Leveling up a gun to max isn't too painful, if you don't mind having a 50% scrap increase necklace on the whole game (if you find it). You need scrap for literally everything to level it up and by 30+ hours I have not leveled up more than a few weapons to max. The downgrading is a very good feature but It really should award you all the scrap you used. I don't mind losing materials to downgrading, but the scrap loss makes me hesitate and decide on whether its worth it.\r\n\r\nARCHETYPES: The archetypes should be able to be found a lot easier so you can experiment more early on. They are objectively the best part in the game and the skills are really great. Having to unlock them is tedious. I never found more than the starting classes in the whole game, because the other ones you have to find some hidden randomized points in the game to even unlock them.\r\n\r\nMAP: The 3D map would be good if I didn't have huge areas that block out the whole mini-map. The maps are so winding and have so many directions I get lost in them easily and have had to backtrack more times than I'd like to count to try to fill it out and then find the normal way back.\r\n\r\nWORLDS: The puzzles in these worlds are awful. I hated doing the water harp and the clockwork puzzle. Some of these items I don't understand how I would find naturally. Losomn is a decent area that doesn't make me too angry to go through. N'Erud is a awful wasteland that makes me dread walking through the massive area to try to find dungeons. Yaesha is not nearly as fun as it used to be, being a twisting path of branches and random drops to your death. The skyboxes for every map are very good though, and the art design is what carries the game.\r\n\r\nENEMIES: Every enemy in the game is not too bad. The elite enemies will ignore most of your damage and proceed to just beat you over and over and not stagger at all. Meanwhile, their attacks will stagger you almost every hit. I have been stun-locked to death many times from just one enemy or boss. In the first game you could put on heavy armor to mitigate it, now you have to use special rings and skills to fix it, which you may not find easily unless you look them up in the wiki, or level a prism to 50, which I still have not done.\r\n\r\nOverall, the game runs decently well, but not all the time. I've had several instances of changing my archetype that have caused my computer to freeze.\r\n\r\nThings I truly hated: Not being able to melee every boss. If you're gonna add melee rings, amulets, and mutators, let me melee every boss. Being stun-locked by enemies that I can one-shot. Having to do horrible puzzles when I just want to shoot things. There's like 4 items for every decision you make, how am I supposed to reliably do them when I have to take at least 30 minutes to search the whole map and then the place I want doesn't spawn? Why are half the rings in the game utterly worthless? Why does the 3 boss rush not give me a single item?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring and the controls feel like someone cut your power steering and then put you in a Dark Souls game. Not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much shit locked behind puzzles and reading and walking and some more reading with walking, maybe more puzzles u get it\r\ni dont like think i like big number and goin fast\r\nbad gaem, nice assets tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has good bones gameplay wise. Story wise, absolute trash, its short and the voice actors are terrible its all over the place with plenty of plot holes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't believe I paid 80 bucks when this game came out. It's so short and the story is so bad.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}