{
  "positive": [
    {
      "review": "I've been playing this game since very early access. I have watched how its grown and improved over time and how they listened to what they're community was saying and requesting. I remember sending a request report asking for co-op, a few months later they made it work. I got my friends to start playing with me and our only real complaint was the time it took to get from one end of the map to the other. They listened to the community and added teleporters and a vehicle. The community wanted a bit more endgame, they added the portal generator and the free DLC moons that you can go too after beating your planet. They've just released a 2nd paid DLC for even more planets to explore and they made the non-greedy decision to make it so only host has to have DLC. This game and community is loved and cared for by the developers and I'm beyond proud to recommend this game to anyone and everyone.",
      "voted_up": true,
      "votes_helpful": 234
    },
    {
      "review": "IMO Planet Crafter feels like a laid-back Subnautica -- the emphasis is on exploration and progression, not combat.  There's even enough of a story to make the progression interesting apart from unlocking great new gear.  Looks great, the music is nice & relaxing... I was really surprised.\r\n\r\nBut don't take my word for it -- there's a demo version available (that's a bit less polished & performant than the full version of the game).  I installed, immediately lost 2 hours of my life, bought the full game, & suddenly it was 2:30am.  Highly recommended -- a true indie gem.",
      "voted_up": true,
      "votes_helpful": 63
    },
    {
      "review": "Love this game. Ok, there are a couple of visual quirks. But over all the game is brilliant to play as my play time shows, can't recommend enough.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "A great chill game to relax with. No enemies, nothing jumping out at you. Just a peaceful survival against the elements while reclaiming the planet to make it hospitable.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I would say it's a simplified Subnautica, with less danger and more crafting. Sometimes it's a bit \"grindy\" but the science/terraformation pace is quite good. Not the best game I played, but it is fair.\r\n\r\nI need to remark here that it has some very annoying bugs, like falling though rocks into \"nothingness\" and some pools you swim takes you to that same nothingness too.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "This game is somewhat similar to Subnautica.\r\nIt's very addictive and fun.\r\nThe downsides are the vehicle controls and that the planet stays full of ore, even if you don't need them anymore",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "If you want to chill out while base building, crafting, exploring and if you want discovering clues and solving some puzzles, you will love this game.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Planet Crafter was awesome! The attention to detail is astonishing. Small animations, environmental hazards, and watching the planet develop and change was truly amazing. The audio and graphics elevate the game constantly. It’s rare to see a game deliver this much fun for such a low cost.\n\n100% worth trying it out if you want a really fun and chill survival game that lets you develop the entire planet.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game continues to amaze me. Over and over my jaw drops on new bioms and planets. So much creativity and love by the devs is felt in every detail of the game. I'm looking forward to what to come",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Absolutely gorgeous game. \n\nThe Planet Crafter is full of eye candy, satisfying features and mechanics, and the sound design and soundtrack are just [i]chef's kiss[/i]. I fell in love with this game the moment I started playing it. It's very comfy and rewarding, and the whole process of terraforming planets is immensely satisfying - as well as exploring them, and uncovering all the hidden lore on them. There's so many cool and beautiful things to see, and to see the landscapes surrounding you change from barren to beautiful and full of lush nature as you shape and terraform them, is absolutely terrific. Plus, building your base and managing it is very satisfying as well. I especially like how you're able to build and decorate your bases with great care, and how you can make them quite cozy and visually appealing. IMO the game is really enjoyable in single player because it'll feel very serene and easy-going, but playing it with friends definitely adds even more to the enjoyment.\n\nAs for the less than great stuff: sometimes you'll stumble upon a bug or two, or venture out into a part of a map where you can clearly see there has been an oversight in modeling the environment, or reach places where you walk or fall through the terrain. But this doesn't detract from the enjoyment of the game at all. The devs even included a way for you to unstuck your character and your vehicle! So these somewhat quirky bugs can be totally forgiven. Plus, driving under the base of a friend of mine in the rover and abusing the unstuck key to make it clip into the base made us lose our shit.\n\nSpeaking of the rover, this is probably the one thing I wish felt a little more polished. Driving the rover can be pretty janky. I've had situations where I'd get stuck in spots which were hard to get out of with it. But again, not something which actually detracted from my enjoyment, just a minor irritation which was quickly forgotten. And besides, the devs thought of situations where the rover is unable to get out of a spot as well, since you can simply recall the rover to your vehicle station.\n\nOne last mini complaint, which I recognize is purely because I struggle with sensory disorders (namely, autism and misophonia): some of the menu/interaction sounds in this game can be a little sharp and/or grating. My solution to this is simply setting the menu sounds to 50% volume. Easy fix. This likely won't be a problem for a large majority of the players, but since these sounds are something that didn't sit well with my aforementioned conditions, I feel like it's going to help out at least someone when pointing them out.\n\nAll in all, I love this game. Highly recommended for fans of comfy games, as well as space/sci-fi themed games. You're going to sink many hours into this and not regret it. Grab the DLCs while you're at it. At this time of writing, I haven't been able to buy the Toxicity DLC yet, but all the other DLCs have been a great addition, and the reviews of the Toxicity DLC so far have been absolutely glowing, so I'm excited to get it in a few days. Part of me feels like the Humble DLC could've been a little bigger and better though, but playing it has been really enjoyable regardless. Miju Games has definitely got something great going on with this game. 10/10",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Planet Crafter is an excellent adaptation of the survival-craft genre, incorporating environmental transformation by way of terraforming into the gameplay experience. An excellent, pretty, casual and satisfying (if dependent on how much you like unlocking new tiers of tech) game either alone or in online co-op.\n\nNote: highly habit-forming. Note 2: building your survival hut in the center of a valley at altitude zero is probably not a good idea prior to atmospheric seeding. Note 3: jetpack. Note 4: hold your eggplants and squash under the local Tier 3 drill's beam for a rapid cooking process. Never get tired of raw veggies again!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Planet crafter can be considered a glorified idle game with a bit of exploration on the side and a annoying thirst/hunger system.\n\nThe start of the game require a lots of active playing to start building everything, but mid to late game, once you've explored everything and build a lots of stuff, you're mostly waiting for the stuff you've build to give you enough points to unlock the next thing that will give you more points per minute.\n\nThe exploration was fun and finding the secret around the map was cool. Seeing the map go from a barren land to a land full of life, water and other was also pretty cool.\n\nThe optimisation machine is janky and doesn't reach every machine nearby since the ground isn't flat, and some building cannot be build on concrete which would have fixed this complaint. The hunger and thirst quickly become annoying since you easily get the ressource needed to full them and only need to remember to use them. The place where the game put you at the start became full of water so we've had to move the entire base at that point which sucked. And the craft 1k thing doesn't work for the non host of the world.\n\nThe game can be cool at the start, but become a lots of idling toward the end so keep that in mind while purchasing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great adventure game with some mechanics akin to the popular Minecraft, collect items, and craft new structures and items to progress",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Planet Crafter is loads of fun, in particular in its cooperative multiplayer mode. It's expertly made, with unlocks at just the right times to keep you engaged, and there's always something new over the horizon. The graphics are decent and colourful. It starts off with you just struggling to survive. Going outside is dangerous, the planet inhospitable. Then, slowly, you can go out for longer, build more, and then start terraforming. When you think the loop might go a bit stale, it flips the whole thing on its head by introducing drones, which combined with some other systems lets you automate a lot of the refining of resources, kind of like an automation game.\n\nIt's fantastic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing Planet Crafter for 5k hours.  Great fun!  The beginning is intense to get stable on whichever Planet your on, Prime Humble, Selena or Aqualis.  Now the long awaited Toxicity.  Mid game is great also - go from being stable to getting mature and terraformed.  The End-game, after terraforming, I still play while going around the map building.  Hey I am still finding things on the maps that I missed.  I wish somehow I could invite \"tourists\" to visit my maps and enjoy my hotels, waterfronts, animal wildlife, eagles nest lookouts and more.\r\nThank You Creators of this game\r\nMichael",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love the progression through the stages. The option to play with friends is great and so much more fun. If you like a calm base builder with survival elements this is the game for you. The addition of the other planets that you can either start from or travel to once you finish a planet has been a great addition that I look forward to getting to every time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best terraforming sims ive played, Devs seem to constantly produce new content. Overall 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very good indie gem. Strong Subnautica vibes. Recommend avoiding spoilers for full experience. Great game progression system, encouraging use of new technologies and continuous exploring into new areas. Good fun with friends while still being an enjoyable experience solo. Really fun watching a barren wastland of a planet slowly become inhabited with plants and wildlife. Being able to see your hard work come to life throughout the gameplay is very rewarding. It also has a demo you can try out to see if you're sold on the concept. \n\nOverall, if you're looking for an open-world survival craft with Subnautica sci-fi vibes, I highly recommend Planet Crafter. Excuse me while I get back to my terraforming.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Had to make a review for nominations,  \n\nGood game, played with family\nOnly got to 2nd planet in 1 save ATM.\nQuite fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Planet crafter fopr nerds that love space, terraforming and being a prisoner to a corporation and enslaved to survive and build eden or die all alone... or with friends!!! I got this game when it was brand new and was still early access. I have watched it grow and while I may have some issues with certain things as well as desires the team is small and do a great job. they constantly add new features and improvements, take feedback and continue releasing reasonably priced full content expansions nae cash grab micro dlc's.  With humble DLC i was delighted to see how far they had advanced over Prime and the little changes that occur as you terraform.  More than simple reskinning or plants appearing as you terraform the worlds themselves change entirely.  At first it seems make warm melt ice gain access to areas but it goes much deeper than that and I refuse to provide spilers but blink and the world will suddenly be a new world when you were nae looking.\n\nThe graphics tend to be mixed, gameplay loop can at times feel like well time to leave it on idle and wait but you can also just constantly work to accelerate the terraforming faster and faster... the major key is use rockets over and over to rapidly bring in iridium and uranium but also to multiply every gain in every aspect of the terraforming... you can build infinitely and be slopw but fire off onrocket and boom you will see things chabnge very quickly.  And every future building you add is also gonna be multiplied so rockets are never a waste. Then while ya wait explore, find storylines hidden way, see little easter eggs, go around to different areas and marvel at how the world is reshaping.\n\nWith recent  additions you cna now even do all the worlds on one save by building trnasport rockets and going to the other planets. And for multiplayer they did it right. A rare thing for devs to do but nae entirely novel... when playuing multiplayer only one friend needs the DLC and then all friends playing can enjoy it... this is anti greed. sure they wanna make some money for their work but they also want their work to  e shared and enjoyed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game super fun, really cool story line, and a good game for couples",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've nominated this game for the Labor of Love reward.  It's a pleasant experience playing it.  I recommend playing the game even if your not a survival game enthusiast.   I play it solo, but there is a multi-player option.  I enjoy watching the environment morph and the music egging me on as progress is made in terraforming.  Whatever issues a player may have are quickly addressed by the developer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Early game difficult but fun, mid game better but needs a lot of exploring and end game is try hard af. If you played factory games like satisfactory or factorio you should give the game a try cause mid to late game is basically farming simulator.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Subnatica but without being attacked by the animals, good story line, great game\r\nkeep you wanting to play different ways so very re-playable, dlc's look great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Genuinly enjoy terraforming the planets and seeing what we do reflected in the game instead of just being numbers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an engaging survival crafting story with a VERY satisfying visual change as the planet is terraformed. Really cool and fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am 12 hours into the game and it has a fairly addictive survival loop.  The survival portion can get a little tedious. but the game looks good and runs well even on my linux laptop with a 1050ti",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, relaxing, sci-fi explore/craft game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a real hoot.  My kids and I just run around exploring and finding new things.  You see multiple different biomes and have to survive.  First it's water and oxygen, then quickly food.  Once you set up a small base and start converting ice into water you need to scrounge for what you can find.  Upgrade the things you need to terraform the planet and receive the benefits of it.  It's a fun game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best survival game I have played in a long time. The progression keeps me interested, while the ability to add mods to the game makes it even more fun! There are a few areas where I clipped out of the map and had to let my player die to respawn at a base, but that was more of my fault trying to push the boundaries of the map.\n\n\nI would definitely recommend this game to anyone!\n\nP.S. DLCs are worth it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its nice and relaxing with a decent backstory. I've had a blast playing it. If you like this genre you would appreciate it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Planet Crafter is the ultimate chill-out game. It's got this incredibly relaxing vibe where you can just take things at your own pace—no monsters, no stress, nothing rushing you. I love watching the empty planet slowly transform as I build, explore, and terraform. The soundtrack is super ambient and makes it even more peaceful. If you want a cozy, satisfying experience that’s all about creativity and calm progression rather than pressure and combat, this is absolutely the game for you. Perfect for unwinding after a long day! Highly recommended to anyone who wants a soothing and meditative gaming session.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is addictive, and I love it. Its got great pacing but doesn't hold your hand and everything is up to you at the end of the day.\nI love the drones as they really help speed things up.\n\nIv played on both Prime, humble and Selenia, and each one has its own story with enough to keep you playing. \nMy favorite stage is when water bodies start showing, and my favorite place to build a base is by the big waterfall on Prime.\n\nThere are a few small bugs but they are miscible and not enough to affect the game.\n100% recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Planet Crafter has become one of my unexpected comfort games. The loop of gathering, building, and watching a dead world slowly transform into something alive is incredibly satisfying.\r\n\r\nHowever, Aqualis Moon felt like a HUGE missed opportunity. The concept is amazing but it doesn't quite reach the same depth or creativity. I found myself wishing for more exploration, more mysteries, or more unique mechanics to make the area feel fully realized.\r\n\r\nOn the other hand, Selenea Moon was a pleasant surprise. Terraforming this moon felt fresh, engaging and rewarding. I really enjoyed spending time there.\r\n\r\nOverall, Planet Crafter is fantastic and deeply satisfying to play :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game, I've owned it since it released but only played about an hours worth of it. Then about 2 weeks ago I decided to actually dive into it. Best decision I could of made with this game. The grinding mechanic of the terraformation is spaced out perfectly. It has kept me busy for days on end at this point. HIGHLY RECOMMEND.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was seriously and positively surprised by Planet Crafter. It turned out to be so much more than I expected. The game is an incredibly fun and varied co-op experience where multiple players can jump in and each take on their own tasks. Whether you're gathering resources, building the base, exploring new areas, or managing production, there’s always something meaningful to do and it all comes together in a really satisfying way.\n\nWhat impressed me most is how well the game blends adventure, base-building, and progression. Watching the planet slowly transform because of your teamwork feels amazing, and the co-op aspect makes every session engaging and unique.\n\nThe only downside is that the person who owns the world needs to be online for everyone else to play together on that world. It’s not a big issue, but it can be inconvenient sometimes.\n\nOverall, I genuinely recommend this game to anyone looking for a great co-op title with exploration, creativity, and long-term development. Planet Crafter delivers far more than you’d expect  in the best possible way.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game, or the team behind it surpassed my expectations.\n\nAt first it seemed like yet another 'space-inspired open world survival craft' simulation game; but the addition of multiplayer, the continues updates and expansions, the really good DLCs, the very nice price point and all the fun to be had in multiplayer made it grow on me.\n\nIt's janky in places and developed by a small team, but if you manage to see through that then there are a lot of small (and a few big!) surprises to be discovered. Great game to chill with and much better co-op.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great co-op game about exploration on an alien planet while trying to bring it to life through terraforming multiple aspects of the planet. With DLC there are 3 different planets, each with their own challenges. I'd highly recommend playing this with friends as it feels very rewarding seeing the planet slowly come to life. Good stuff!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of my favorite games of all time so much so I played for ten hours on my birthday.  A top tier survival game that makes resource management not so stressful and has a great multiplayer option that is well designed. The DLC is just as immersive as the game and priced affordably. I hope it comes out on consoles soon because that would make it more accessible to play more with friends. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game. Sit back, relax, enjoy watching how the planet changes around you as you terraform it. There's some pressure at first to find food, water and to build shelter, but soon afterwards (in a few hours) you should be able to grow your own food and collect your own water. From that point you can explore the planet in greater detail and look into the story.\r\n\r\nI wouldn't call this a breakthrough or masterpiece, it's just a pleasant and cozy game to relax, and I love it. Addition of vehicle made it much more entertaining, imho. I also enjoyed randomly generated wrecks from portals.\r\n\r\nI hear its even better with friends, but I only played solo. It took me 200 hours to play Prime (main planet, I played in early access), Humble (twice, from scratch), and two moons on the same save as Humble. I plan to play Toxicity soon.\r\n\r\nI'd recommend this to people who want a place to explore with light survival/crafting elements. Note that there aren't any enemies to fight, no bosses, and \"building a base\" or a \"factory\", while possible, is not the main goal. Base building and automation is kind of limited and it rewards your efforts with extra resources that can speed up terraformation, but you can skip it completely and still do just fine. You can also find a lot of rare resources in randomly generated portals (in randomly generated bases, just be aware that the game doesn't feature any maps, and large bases can feel like mazes sometimes, I recommend drawing your own maps if you're into that).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a very fun and interesting game, I recommend playing with friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome game, easy to spend hours alternately exploring for new materials, expanding the base, and making everything more efficient as you unlock automation.\nMy daughter and I played together, and she enjoyed when we could start building a butterfly farm and designing our own creatures.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game just continues to get better over time. The fine folks at Miju Games continue to put out both free and paid dlc that expands on the original (and very good) concept that they started with. A PvE survival game based around exploration and base building. \nSeeing your planet transform as you progress is satisfying. Progressing your tech level and unlocking new tools, new machines, new areas just feels good.\nHighly recommend for a good old base building, world traveling, item hoarding time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Picked up this game again after early access and its great to see how its grown. Played 42 hours recently and loving it. I think what makes this game different is how while the map is only a set size because you develop it over time things open up and you get to explore parts again which I haven't seen before. Its a great game to not think about story and just focus on building your base and making the planet lush. Def pick it up if its on a sale or if you like games like 7days to die, standard crafting game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was looking for a game to start playing with my wife. She hates combat and stress gaming, and weblove building a base. This game has so luch potential at base building and the map has you going back every day to your base wich makes it worthy!\n\nThe planet terraformation process is amazing and lovely to see!\n\nI think more story events or quests or similar would be incredible.\n\nAfter all it’s a super cool game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxing and fun. Watching the transformation of the planet is satisfying and the game play is engaging. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Be carefull for you file geting lost or curupted but with out that is very fun and adintive i love that there are other worlds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game don't get me wrong, but at times you don't know what to do and just have to wait to unlock new things. So far I have spent a lot of my time just afk, waiting to reach a certain terraformation level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fantastic game I love the exploration and lore discovered through the world as you explore the former expeditions and caves",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IMHO, this is one of the most chill survival games on Steam at the moment (yes, I know, you think \"X\" is better, but this is my opinion). Really a fantastic game from such a small studio. If you haven't checked out the DLCs, I would highly recommend doing so.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Subnautica in space; just as fun and just as addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watched a play-through on evanandkatelyn gaming uncut, and thouhgt there would be no point in me playing it myself - little did I know!\n\nStared a game with one of the new moons/planets that were added, and having a lot of fun with it, with the mechanics being the same as the playthrough but with different environments and some other key changes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like cookie clicker with exploration\n\nSo I'd say pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fantastic game if you are new to survival/crafting games. My son and I play this and we have such a good time exploring and building our home base. I am a veteran in these type of games and it has been such an awesome bonding experience. I cannot wait to see what the devs do next (hopefully).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is relatively simple and easy to understand, but very satisfying in outcome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Survival + base building + exploration. Fun with unique unlocks. Definitely a time sink. Noticeable progress. Planet physically changes as you advance. Selectable difficulty so you can play at your level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing this game since its early-access release and have logged over 300 hours so far. It has become one of my absolute favorites. There’s so much to do and explore, and I really enjoy the unique stories on each planet. I also love that the game doesn’t rely on combat, it’s the perfect chill experience for when I just want to relax.\n\nMy only complaint is the occasional lag when loading certain areas of the map. During the Toxicity DLC, I even got stuck under a large rock because of it. Thankfully, the unstuck button fixed the issue quickly, so it wasn’t a game-breaking moment for me.\n\nI also have to give huge credit to the small dev team. They’re clearly passionate about the game and release not only paid DLC but also generous free updates with new content. They’re truly fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. It's really fun. Very relaxing but the vehicle... Utter d*g*shit... The \"view\" from 3rd person - the movement - literally made me sea sick and I had to stop playing. I'll try it again from first person view....and you can't control movement through the mouse - it's all keys so it's very unfriendly turns and controls. Hard to steer.\r\n\r\nThere are invisible boundaries as well that you'll run into so beware of that...\r\nBut it's an awesome game. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice game.  Really easy to figure out.  Reading is fundamental.  Don't get frustrated like Derrick.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i will say i have been playing this game for a good min now and i love how the game never gets borning i love the art in the future can you add a few more vehicles mabey some flying aircraft but thats just me nit picking lol love the game keep up the good work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a very fun and amazing game with lots of play time and replay ability . no run is the same which is the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun, meditative game that plays wonderfully on the steam deck. Every time you think you've seen everythign the game has to offer, something else opens up for you to explore. Seeing the world change around you is so fun. At the price point of 30$ id say its pretty worth it and if you nab it on sale? oh man, get ready for this to suck you in!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so good, i wanted it for ages and then i got my gaming laptop to get it, only 3 hours in and im addicted, 10/10 game i do recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite nice gather, build, and afk game, with the devs adding many automations and new world dlcs they have put a surprising amount of attention into the game. Luci Approved",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes a good amount of time to compelte but every second of it is worth it,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well done game. Some paid dlc and some free dlc given by the developers. Just a fun, addictive game to spend some time with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game for the times you want to spend a few days doing something that feels rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing Planet Crafter for a long time. I did take a break from it for a bit, hence why the low hours played for the length I've owned the game. I just LOVE this game though! It's such a relaxing, chill game that promotes exploration, crafting, and building. I love that about a lot of games, but they have combat which induces anxiety. My favorite thing about this game is no combat. The way each place changes as you terraform and make it your own is so beautiful. The fact that it's multiplayer as well is a big plus. My boyfriend and I have solo files and one we play together. It's so interesting to see how differently people play the same game. The new DLC adds in fun mechanics like the tram. I hope they do more with travel as they keep updating. The other nice thing about this franchise is that only one player is required to have the DLC. I can host a game that my friends can join and enjoy the DLC as well. That's a huge plus in my eyes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and was so excited for the newest DLC. it's like the Sims meets Minecraft meets space exploration. The whole story line in game continues to be intriguing and I always end up playing for hours on end because this game is great at sucking you in with new discoveries and terraformation points. the devs are top notch when it comes to attention and really keeping in the know of what fans like and want ingame",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a great game, a little slow but that could just be me, but it has janky vehicle mechanics for, example if you spam unstuck you will fly backwards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you decide to go to the moons or any other planet, BRING ITEMS THAT WILL HELP YOU. I went to Aqualis with nothing so I had to rawdog my way through. Other wise that the game is really fun. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Put off buying this game even though I've been following it from early access because I didn't want to take on the time commitment.  Now, look, 10 hours in, feel like I'm barely scratching the surface and I'm make excuses to come back and play more.  Easily a recommend for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice game to just chill out with, especially if you don't get hung up on maximizing efficiency. Take some time to walk around and see the sights at the different stages of terraforming and just let the numbers tick up slowly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Okay, there are a couple of visual quirks. But overall the game is great to play alone or with friends. As my playtime shows, I can recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Planet Crafter has been fun to play. Was a bit different then your factory building games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great survival game. Not too hard but can get a bit tedious at times. Still, devs are constantly on it to improve. Excellent!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful and Fun, I have put plenty of hours into this game. There is a fine balanced blend between exploration, grind, and over all just enjoying the different features the game has to offer. Between expanding your base, decorating your base, , terraforming grind, or traveling to the additional planets and moons, this game provides hours of play for either just you, or your group of friends. \nEach world I have found stunning and unique and exciting to see the new biomes involved, with some of them each coming with a twist on their challenges. \nI will continue to adore this game and suggest it to anyone I can.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun, goal oriented, never lost interest, great graphics, the music is a bit annoying could cahange or be more developed, the end was very chaotic, but hands down a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't say this lightly: The Planet Crafter is, quite possibly, the best computer game I have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game. I find it has great replayability, it's great playing solo or with friends, and the visuals are beautiful! 10/10 reccommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic game to play with friends! i love base building and my friend loves exploration, so its like this game was built for us, i build the base whilst he explores and gathers resources! Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an amazing game with a TON of work put into it by very hard working devs! it's been really cool to see how far it's come from early access and i'm looking forward to every update the team puts out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool open world game i absolutely love it and i am also excited for the other maps to play on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a very good balance of survival, exploration and building.  I think its best as a multi-player game but still great in single player.  I like a game that doesn't have fighting, I'm just not good at it and jump scares are not my thing.  But balancing terraforming heat, pressure and oxygen is fun.   Just don't forget to plant food!  And have a stockpile of water for when the ice melts but you maybe don't have the atmospheric water collector yet.  Love the butterflies, frogs, fish and animals.  Have had way too much fun with the different animals.  And the trees!  Flowers are good in the beginning but then get annoying because you have so many seeds but I'm a hoarder and I don't like trashing things so my stockpile gets ridiculous.  I like the customization at game creation; so if the asteroids are too annoying you can reduce or eliminate them entirely.  Or if you don't mind them and want the resources then up the frequency.  It's a great game, I've played an intimidating number of hours at this point.  I've enjoyed all the expansion/DLC's.  I'm going to keep playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like a zen garden but with planets.  \r\n\r\nThe only threats are suffocation, dehydration, and starvation- everything else is about space gardening and it's magnificent.\r\n\r\nSlow burn but once the planet starts changing it clicks and it's beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a more casual Subnautica. graphics are admittedly worse, but I like the scenario and more relaxed gameplay better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 highly recommend\n* 7/10 story--not super story driven but lots of little tidbits to find\n*8/10 mechanisms--not too difficult to figure out and gets more involved with higher stages\n*7/10 repeatability--I could understand how some people would find it redundant, but the developers are constantly improving the game and there are always new things to do\n*9/10 ambiance--great music and visuals for the price\n*10/10 price\n\n\nHonestly one of my favorite games. It's super chill and pretty easy to pick up, but because of all of the intricate mechanisms and the (very affordable) DLCs with their new mechanisms, it doesn't get boring. My husband and I play it together every night. I definitely recommend playing it with someone because it makes it both more fun and easier with one person finding resources and the other setting up bases and machines. If you start to get stuck or if things seem to be taking forever, there are a lot of online resources, and if nothing else, shooting off a rocket or two and watching them freak out because they're connected always helps lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When Let's Game it out played this game, I knew I had to play it. The game is a delight. The pace and scaling allow for multiple styles of game play while keeping you motivated to explore. It's polished where it needs to be and quirky in the exact same way.  The passion in this game shows through in every detail and the player is only rewarded for creativity.  The base building is easily one of the best I've ever played and allows for creative construction and limitless design choices in base layouts without overwhelming the player in its scope. Perfect for long sessions or brief forays. The team continues to develop, support, and refine their product, and each time I'm excited to see what they will do next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely will listen to the soundtrack while I play other games... then want to play Planet Crafter. \r\nThis game is very relaxing and entertaining. I enjoy base building and annoying my husband when he goes away on a collecting mission only to find I have completely changed the base.... for the 100th time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if you love exploration, building, and resource gathering games.  I'm glad that they are still providing substantial DLC updates, both free and paid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was fun but I started to feel like after one playthrough I'd quit.  Now after 34 hours I'm enjoying a lot more.  After I finish the first one I'll be getting the DLC for the others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m going to recommend this game but with a caveat. To put it shortly the intended gameplay of Planet Crafter is about slowly terraforming a planet, collecting resources and building a base while managing oxygen, food and thirst which are slowly depleting. The difficulty bar is low and even more so when the player has progressed in the technological tree. Death is also not very punitive. I think the intent of the developers was to create a relaxed game for players who like building things. I’m not however one of these players, construction games bore me. So why do I still recommend it?\n\nI didn’t play Planet Crafter the way most players have played it (or at least I assume so). This game incorporates various difficulties changing the speed with which the planet reaches new levels of terraformation and the speed with which oxygen, food and water deplete. The hardcore difficulty is the most interesting for players who are not so interested in the building aspect. In this mode, death is permanent and the speed of depletion is very fast. The spawn point at the beginning of the game is also changed to a location with fewer resources to collect.\n\nHere is what the gameplay looks like (in hardcore mode). You are trying to scrap some resources as fast as possible, move to another place where you hope to find the adequate resources and so on. Every move on the map must be carefully planned (and quickly at that). The resources you collect are used to build small structures or for oxygen, food and water. You are constantly under pressure to find new resources. This makes for a very exciting gameplay. It will take several attempts before reaching a point where you can stabilize the situation (a point only reached after several hours). Death will happen after 3 hours of frenzy gameplay but you will learn how to better plan your next try.\n\nAfter having reached the point where the situation is stabilized, the game resumes into building and collecting resources. I continued for several hours before realizing it was becoming too repetitive and boring for me. Overall good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Planet Crafter is a masterpiece. I love the exploration, I love that they keep updating things to further improve the interfaces, and I love the fact that they keep innovating in a way that makes the game compelling to return to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An outstanding example of what I have always dreamed of for a terraforming game. I have been mindblown by the innovation yet simplicity of the game. The dev team has been so good to us and listens to feedback and suggestions, making it so enjoyable and often updating. I have gotten 2 of my siblings completely addicted to this game as well and being able to play with them due to a mere suggestion from another player for co-op shows that responsiveness from the team. The progression is as fast or slow as you want, allowing you to focus on different portions like exploring the map, relaxing base building, or terraforming progression. I couldn't be happier for a game like this. The graphics and design of the map, buildable objects are stunning and aesthetic. There are so many easter eggs and a treasure hunt type of adventure but I won't spoil it here. I am excited to see what else the dev team can come up with and I will continue to support every step with much love.  Overall, extremely impressed with this game <3 go plants!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really great game, you can spend many hours on it, you can play it alone or invite your friends and have a lot of fun while terraforming the planet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill game about exploration and crafting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply wonderful. It's super rewarding to watch the world around you change as you progress through the game, and return to old areas to see how they've developed. Late game gets a little grindy as the numbers get so huge, but that's expected of any game that uses idle-type mechanics. Scratches the Subnautica itch as well, so for anyone upset about that game getting postponed, this is a great alternative.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great time waster! Very slow grind at the beginning but if you stick with it, the game becomes rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite fond of this game, to a point. It's essentially vegetarian Subnautica. \r\n\r\nPersonally, I played on Relaxed mode, because I find that's where the sweet spot is. You have basic O2, health, and H2O requirements you have to keep an eye on. But beyond that, there's no 'right' way to play the game. There are no hostile enemies or animals. \r\n\r\nThe degree of life in the world is essentially up to you. You can speed-run by building things as efficiently as possible, or you can take your time to make things pretty, or anything in between. The music is calm and soothing (similar to Subnautica style), and everything is crafted/built instantly (like Rust), so there's no artificial waiting like some games (SCUM). \r\n\r\nHowever, it can get grindy at times, particularly in the end-game. At the beginning you're progressively unlocking more and more ways to craft the planet, but that drastically slows down near the end, and in some areas you stop being able to unlock things ridiculously early. And in general, it's essentially a request/fetch game in terms of how resources work. Also, I recommend downloading the most popular mods, but they are not required. Mostly just for QoL reasons. \r\n\r\nTook me about 70hrs to complete 100% (played twice now), without the DLC (which has no achievements FYI). Some of that was just tabbing out to let the game progress. Probably could've been way faster if I wanted, but like I said, I played in on Relaxed. There are more aggressive modes if you prefer that. \r\n\r\n7/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of the most well-balanced survival crafting games I have ever played, and I have played a whoooole lot of them. In many of these types of games, you have to spend a lot of time collecting resources in order to craft anything. You do need to collect resources in Planet Crafter, but the resource collection isn't odious and boring. It's fairly easy to find and get enough items, but not too easy.\n\nThe tech tree pacing is also superb. As you unlock new tech, and terraform your planet, the gameplay  changes enough to keep things interesting. Moving from survival to exploration to customization.\n\nThe lack of eneimes might seem boring, but I haven't missed them.\n\nThe most annoying thing is the vehicle. Driving it is cumbersom and awkward, but that's a minor complaint. \n\nOverall, this is a great game, with a well-developed crafting system, and many hours of fun to be had. Two very enthusiastic thumbs up.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "So- to be clear, I do actually enjoy Planet Crafter and I do really want to recommend it, it's exactly the kind of game I love. However, there are a few things that prevent me from recommending it. The TL;DR is that there are a few clunky and at times frustrating things that need to be adjusted before I can recommend it.\n\nFirstly, this is a game about building things to terraform the planet. However, building a base is rather difficult. The first thing you'll run into is the fact that foundations don't snap or align to buildings- at least, not automatically. However, this is honestly more of a minor gripe, this doesn't cause that much of an issue other than minor frustration with some foundation placement- but perfectionists beware, the foundations and buildings are hard to align and it's hard to get a good camera angle to make sure they are aligned.\nBut the big issue is the act of building itself. One speed bump (literally) is how the small inventory and ability to find iron in early game is rather limiting for building a base. The iron issue does eventually get resolved, however, building a large structure can still be rather limited by even the late-game inventory size- you'll be running around a LOT (this isn't super bad, but it can make building more of a chore than fun). Secondly, I actually find it unironically interesting that the devs decided to make it where many things can just be built in the air at a preset distance from the player- rather than, for example, having to build them off of other buildings or the ground (though you can still do both here). I've always wondered how such a building mechanic might work, and honestly, it does work... with a lot of frustration at times. The problem being that buildings like to snap from one particular preset wall- in particular, the indoor stairs are two levels tall and want to snap from the bottom. This can make it difficult to build down. I spent a LOT of time trying to build a staircase down from my base- admittedly, I shouldn't have built it so high up, but it was also unreasonably frustrating to place indoor stairs down from it (which I had to do because indoor stairs are unlocked around mid game- had to use outdoor stairs before that).\n\nAnother issue is movement. The first issue is that gravity is always unreasonably strong and you plummet to the ground the second you step off a platform (would be neat if the gravity changed over time, btw!). Hunger and health are the same resource bar (drains over time)- which is an odd choice but I respect the simplicity- but it's really easy to die by falling. There is something to help though- a jetpack that you can make pretty early on. It hovers a certain exact distance from the ground- though you can make it fly higher or lower extremely briefly (it's based on where you're looking, which is a little odd, and kind of interesting actually, but sometimes annoying). The problem is the plummeting issue. You can save yourself from falling with the jetpack, but it's difficult to tell if the jetpack is working after an accidental fall because you still plummet until you're at the preset distance above the ground where you would float. By the time you can tell it's not working, you've already taken damage or died. If you were already jetpacking before you went off a ledge, you will still drop rather rapidly down to whatever the appropriate hovering distance above the ground is, which means it's very easy to lose your altitude. The reason this is a major problem is because the jetpack is very useful but very frustrating to use for building. If you move, your altitude will change based on the terrain and that can totally throw you off of where you were trying to build. It also changes your height based on where you're looking while jetpacking which can really jimmy things up for building. You can be hovering but not moving and you will bob around a bit- I assume this is because I'm changing the angle of the camera, which changes the altitude of hovering. On that note, I can respect the simplicity of the jetpack- but man, it makes for clunky building. \n\nReturning to building, the buildings that you will need to attach to your base can vary in shape widely (as in, come in non-standard sizes) and can be difficult to attach to your base. This may be an intentional design- to which I say, neat puzzle, but it can be hard to see where or how a building attaches to a building. There are a lot of buildings that can be difficult to tessellate with a base. But this is mostly a minor gripe.\n\nFor being a crafting game, it's a bit clunky to craft en masse. The problem I have is that multi-crafting is an optional setting and not the default. You have to hold CTRL to craft multiple items or build multiple buildings- if you don't, it makes one and kicks you out of the menu or takes away the building hologram. This makes base building clunky- having to hold CTRL while you try to find the right snaps for your buildings (remember the jetpack problem!). Multi-craft and multi-build should really be the default, and this game could learn a lot from the way Satisfactory handles buildings.\n\nAnother problem I do have with Planet Crafter is a lack of organization. In the late game, it can be difficult to sift through the long list of buildings or supply/demand request lists and they really need more categories. In addition, this game desperately needs an in-game wiki that can at least tell you at which crafting station or building you can build a certain item, if not also the recipe for that item. You will unlock something out of the blue and you'll want to make it, but in order to do that, you'll have to run around and go through every crafting station you own to see where it's built. You may not even have the crafting station yet or didn't know something even was a crafting station and you'll find yourself confused for a long while until you figure it out or google it. I didn't have as much of an issue with this problem though because I played with someone who has played the game before and he could tell me where to look- but I can imagine that I or an inexperienced player might get frustrated with that. If you're okay with using the wiki (which is unfortunately a Fandom wiki, be sure to use an adblocker), this isn't an issue.\n\nAnother gripe I have is also that the numbers are laughably low and it kind of breaks the immersion.\nYour temperature starts at 0 K which simply isn't possible. Even in my late game playthrough now (past the \"complete terraformation\" stage), I'm at 2,000 mK (yes, it still reads it as mK) which means it's at a whopping 2 K. There's no way anything living would survive at that temperature even if it were possible for the temperature to be that low. You also achieve a liquid water stage long before that. Just as a reminder, 0 degrees C / 32 degrees F (freezing point of water at standard pressure) is about 273 K.\nYou also start at 0 ppq oxygen, which is maybe plausible, but you can get to a \"breathable atmosphere\" stage at very low ppm of oxygen. I'm long past that, and I'm at about 5,000ppm oxygen (yes, it does read ppm instead of ppt) which is 0.5% oxygen. You need a bare minimum of 19.5% oxygen to breathe.\nAnd you start at 0 nPa pressure, which is impossible. Even if it were possible, that means the planet wouldn't have enough gravity to hold on to any gasses, which makes creating oxygen rather moot- it would just go off into space. In my current game, I'm at 1,600 Pa, which is ridiculously low. Earth's standard pressure is about 100,000 Pa.\nIf we were to align these numbers more to reality, it would feel more believable, immersive, and even educational while still being entertaining. And yes, I know there's a system terraformation index, but the numbers can be changed to make that work properly. \n\nThere's fun to be had here- but it needs more polish. Things were created in a simple manner but lazily implemented, which I think is my biggest issue with the game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "fisher-price no man's sky, but without procedural generation, only on one planet. dry subnautica, without hostile lifeforms. starfield-esque, huge barren hellscape, no vehicles. minecraft without caves, resources are evenly distributed, and scattered all around the surface. astroneer without the fun sound effects or cute character. planet crafter borrows so many things from other games, i wish it had even an ounce of their whimsy.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "A fantastic game - but horribly optimized. If you play it on Steam Deck or a mediocre PC, expect the endgame to be entirely unplayable with 10 FPS not abnormal at all. Also, their community support is absolute trash, banning people from their Discord server for calling out obvious problems with the app *that their own team admits to* even when *you* are the one being harassed. \n\nI was such a huge fan of this game and this company and their absolute piss-poor attitude and complete disregard for their community has 100% turned me off.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "This game is simply relaxing. Or at least is should be. Until you run into the onslaught of bugs, graphical glitches and just god awful optimization. It's a really cool premise and I love being able to actually make something better than how I found it. This game could've been more but it just fell short and I can't suggest you spend more than the base game on a discount. I won't buy the DLC. It's obviously just another game scam where they put out the bare minimum and drop DLC to bleed us for more money instead of making a game feel good and make you want to play it and come back. Bugs like losing your death box, water being gone after dying only to die immediately after, falling through map or getting stuck in rocks... The list is endless. If you don't mind that then go ahead and buy it at the risk of your sanity!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At the time of this I have 165 hours, all in one game/save file.  It's a good game, but I just couldn't get all the blueprints, and after a million hours of searching for how to get all the blueprints, I have discovered that it is random, and there are many many people that have spare blueprints and many, many people that can't get enough blueprints.\n\nI just got to the beginning of tier 10 at 164 hours.  I liked the game, but it is unreasonable to be at this level and no tbe able to finish the game.  I don't have all the blueprints, and I can't even make explosives which are needed for getting more chests from the wrecks, which are needed for more blueprints which are needed so I can discover explosives so that I can make explosives, so that I can get more chests which give me blueprints...so that I can get through the wrecks which I need explosives for... \n\nSo I can't finish the game.  It's a long game, and I just don't feel like it's worth replaying just for a random chance on a different save to get the blueprints that I need, and it really stings that other people have gotten them with no sweat.  I feel a little cheated.  So I'll downvote this game, because it was fun throughout all the many hours but I felt really bitter at the end: I have no sense of accomplishment and that is a big deal to me.  In the end, I am unhappy.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is nothing but fetching resources and placing them down as structures. You get upgrades to fetch faster and build more expensive structures to fill the number-go-up bar. Bored me to tears.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Look this game is great but Now i see all this Paided DLC is coming i'd say run devs just cash grabbing at this point instead of expanding the base game that could use a few more zones and more systems additional resources for more complex builds",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Greatly overrated IMO.\nPretty, and the planet develops, but no immersion.\nSilly things, like you have tech to synthesize machines to terraform a planet, but not to provide food/oxygen/water for the survival of the human terraformers? No. So you have to race around madly grabbing matts and building stuff to open up the tech tree several levels, so that humans can survive in a shelter. Who would sign up for this job LOL.\n\nAlso I like playing games like this in Hardcore mode, including every Diablo game, Grim Dawn, Subnautica and many more. Hardcore of course just means permadeath, so it makes it more immersive for many players including myself. Hardcore can usually be selected for any difficulty as it's not actually a 'difficulty' setting. It's just permadeath. \n\nUnfortunately in Planet Crafter Hardcore means permadeath AND extreme difficulty. The game expects you to know the map so well already that you know where all the crash sites are, where all the crates are, what all the techs are and what order you'll unlock them, etc. So you can't play Hardcore as a new player and expect any reasonable chance to survive it. Even after many attempts. \n\nWhich is a shame. I played Diablo 3 for example on Hardcore to max level, first playthrough. I played Subnautica to the end on second try. Not remotely possible here, because the devs don't know what Hardcore has always meant- permadeath. That's all. Not ALSO extreme difficulty.\n\nToo bad. It looks like a good game. I just can't get immersed in it without some more reasonable tech tree decisions (food/water/oxygen at the bottom) and a 'Hardcore mode' which actually means 'Hardcore mode' playable from the beginning.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you can get this game for about 5 bucks and a few friends will pick it up too, it's fine. The dlc was for sure not worth it. It seems like they're just reskinning the same game over and over and changing very little to make money. C tier at best.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While this is a good game it quickly gets repetitive and boring, especially with the latest updates being locked behind paid dlc. I recommend an initial playthrough but don't expect something super epic and amazing. Get it on sale if you can get the whole game at once. Otherwise I recommend passing on this game. I hate when you buy in to early access to support a game you want to play as it is finished and a dev decides to lock new game content behind paid dlc like buying the game in early access is not enough. Greedy devs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game is beautiful. Interesting craft system and area to explore, BUT there is no end to crashing and logs. Tons of reasons and a lack of  information provided.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game to start, but as I progressed my base became submerged under a lake. That was frustrating enough for me to give up - I'm not going to spend hours moving my whole set-up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall its a functioning game. the gameplay is number go up with fun little late game additives that make the grind at least more enjoyable. There are a lot of basic QOL things missing, a decent building system for one. It, much like the game, functions at a basic level, but the forced grid system mixed with there be no real center point or even a consistent scaling. Basic box house and Basic box supports not only are two different sizes, but also operate on their own snap points. \r\n\r\nLong short of it, it works as a game, but don't get into the building if you hold any sort of need for perfection or symmetry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just a boring game where you constantly grind for resources to not die. Just didn't do it for me. Maybe if it had better visuals or something, but I found the game more annoying than anything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun game but would have been great if they add more content in the game instead of selling overpriced dlcs. So many other games adds content first before selling dlcs but this game sell you another planet type dlc almost same price as the base game when on sale. Horrible monetization method.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While this is a good game it quickly gets repetitive and boring, especially with the latest updates being locked behind paid dlc. I recommend an initial playthrough but don't expect something super epic and amazing. Get it on sale if you can get the whole game at once. Otherwise I recommend passing on this game. I hate when you buy in to early access to support a game you want to play as it is finished and a dev decides to lock new game content behind paid dlc like buying the game in early access is not enough. Greedy devs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Constant crashes. Constant. It would be fun but the random crashes makes this game impossible to enjoy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game is beautiful. Interesting craft system and area to explore, BUT there is no end to crashing and logs. Tons of reasons and a lack of  information provided.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Relasing DLC'S while the game is unfinished/shitty ?\nNot updating the main game (small updates) ? \nHigh costs no fun ? \nIf yo wanna all those 3 things in one this is the game 4 u",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is crashing quite often and corrupting save file. fix it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't begin to imagine how this has Overhwlmingly Positive reviews. Like it's not awful or anything but it's not nearly as great as others pretend it to be.\n\nUi is terrible, animation and physics feel super scuffed and the way ressources are just random nodes scattered literaly everywhere on the planet surface feels like such an odd decision instead of like designated zones and outcrops. I usually like hunger/thirst but this game makes it feel more like an annoying side thing to worry about than a core mechanic. \n\nThe game does NOT feel polished at all and I feel like everyone saying so have insanely low standards. I'm sorry, I know it's mostly an indie studio working on this but for the asking price it's just not that great.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "not quite my cup of tea. Somewhat spoiled by other 3D factory builders where building feels more impactful and satisfies the engineering mindset. Building in this game feels a bit more like checking off a box in a spreadsheet that just \"works\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have played all the other content and really enjoyed the  game. I was very much looking forward to the Toxicity DLC. Sadly, Toxicity is totally unbalanced in the start. I have tried 3 times, with different strategies to start the game fresh and in Standard mode and each time I starve to death because there is insufficient food resources in the game before you get the food grower. Maybe its the luck of the draw, maybe I'm just a dope, but I see others in the forums having the same issue. It\"s just not fun. I will probably start again from Prime and bring a bunch of stuff on the interplanetary shuttle but that is not how I wanted to play this DLC. I really hope the Devs fix this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was cool but the moons you unlock after the main planted is done make for a really boring and unsatisfying ending.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While the game is good and it has a few flaws i cannot play it anymore.\r\nAbout a year ago they brought out a update which makes the game unplayable for me, my windows version is not the same as they suddenly required alongside my graphics card.\r\n\r\nWhile i did contact support the issue whas never resolved, if you have a new pc and you are ok with intrusive windows then it wont be a issue, but if you are a bit more privacy oriented then you will have to put in a lot of effort to make this game work.\r\n\r\nIm very sad because i bought this game for my friends as well",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is just a worse Cookie Clicker game, except you press W and Space most of the time instead of clicking on a cookie.\r\n\r\nYou build machines that make Number Go Up, and the further you get into the game the more convoluted the steps to make Number Go Up gets. Later on you can send up satellites that have modifiers like \"increase heat by 1000%\". That's the entire game in a nutshell, except you have a lot of travel distance to cover to obtain everything you need.\r\n\r\nThis game feels like it's still in early access due to its many flaws.\r\n\r\nI should let this be a lesson to not buy games when sleep deprived. My time would have been better spent catching up on a tv show or something.\r\n\r\nI played on Intense because I wanted to raise the stake a little, it didn't really matter. I only died two times, and both times it was because I forgot to bring along extra oxygen, and thought I had.\r\n\r\nThe initial hours of the game is alright. Crash on a \"hostile\" planet, gather up materials & build an initial base while making sure you don't run out of oxygen, food or water.\r\n\r\nThe survival aspect is extremely trivial, to the point that it feels tacked instead of thought through. You'll have to be very inactive to run out of any of  the \"survival meters\".\r\nThe sense of danger is so low, that astroids crashing around you is just a mild nuisance as they make the screen shake.\r\nI got directly hit by an astroid, and I only realised because I got an achievement for it.\r\nIt did no noticeable damage to me, and it doesn't damage the area around you or the buildings you make.\r\n\r\nWhich stands in stark contrast to the story elements, which say you were forced on this \"deadly\" planet to make it liveable - and that the survival rate of planet crafters is absymal (probably dying from tedium).\r\nYou'll get messages from both the corporation that sent you here, and some unknown ally who tries to help you - at one point the corpo even says \"we're always watching you, so no hidden messages\" - or what? The game's empty, what threat could the corpo possible throw at me.\r\n\r\nThere's some subplot about a race that arrived on the planet before us, but it feels meaningless. \r\n\r\nThe most exciting point of my playthrough was when I mistakenly thought my new main base would get flooded, and I could have realised my mistake by simply looking at one of the monitors I crafted really early on.\r\n\r\nOnce the inital hours was over, it started to dawn on me that all I was doing was travelling from point A to B for up to minutes at a time, gather a few materials for a few minutes, and return and quickly build something - realise that I needed more and repeat ad naseum.\r\n\r\nIt started to get real tedious, but I knew I had a vehicle to look forward to, imagine how much faster it'll be then!\r\nOnly to realise that the rover vehicle is atrocious. Driving it makes my ears & head hurt, it's default speed is slower than just travelling with my legs & jet pack, you still lose oxygen in it and the only upgrade for oxygen requires materials that took many hours to get access to. Once I had the 3rd speed upgrade, I foolishly thought it might be useful at last, but no it's just too awful to use and the sound problem is unchanged. So I always travelled \"on foot\".\r\n\r\nBy the time I got to the insect phase, and nearing breathable atmosphere, the material cost for making Number Go Up was getting really high, which made more tedious walks for materials.\r\n\r\nThere's also zero \"structual integrity\" or gravity to care about when building. So if you want, you can make giant floating bridges, or a floating base. I started climbing over invisible walls as shortcuts just so I could spend less time on tedious travel - feels weird having so many invisible walls in a game that gives you a jet back.\r\n\r\nThe game just feels really hollow, with surface level mechanics and a barebone story that just gives \r\nludonarrative dissonance as what's being told doesn't fit the game experience at all.\r\n\r\nThe pacing feels bad, and tips from the messages would always arrive late (i.e. I was already doing what I'm being advised to do). Tech that would make the game less tedious is extremely far away, and you could probably bypass a lot by just standing AFK in your base, but I play games to be engaged by what's happening, not find ways to avoid it. I might have played longer had I obtained drones earlier, but despite unlocking a satelitte that helps keep track of drones early on - I was still hours and hours away from actually having drones. By the time I got breathable atmoshpere, and teleporting unlocked, I just couldn't be bothered any more.\r\n\r\nJust to bring the cookie clicker analogy home, my last achievement was \"Cookie Factory\". On that note, Cookie Clicker has a better story.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "bought it in 2023, bad performance and expectations too high because of satisfactory.\r\nbought again recently and the gameplay loop isn't satisfying. Collecting of resources manually is repetitiive and performance isn't good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All three possible official endings are horrible and feel like a punishment. I play games for fun, not to be disheartened and depressed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Go-fetch simulator. \n\nBarren scattered resource collecting busywork with time-based sequential unlocks.\n\nBase building is extremely simplistic and barely qualifies for the genre.\n\nThis is honestly the worst game I've played this year. Insane level of positive reviews for such a basic mediocre, almost nothing of a game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Driving sucks.  Worse than the Mako.  You get stuck all the time and waste more time spamming F4 than actually crafting anything.  Lost all my resources stuck in some ridiculous hole, and all of your finite  resources just lost because they were in your vehicle and there's just no getting it out.  Frustrating waste of time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In my opinion, The Planet Crafter becomes repetitive fairly quickly. While the core idea of terraforming a barren world is exciting, the gameplay loop often settles into the same routine: gather resources, place machines, watch the numbers climb, and move on. After some time, this cycle starts to feel more like waiting than meaningful progression.\n\nThe building system also leaves a lot to be desired. Construction doesn’t feel smooth, and the game doesn’t offer much creative freedom when designing bases. Interiors often look awkward and disconnected. Decorative objects are hard to place nicely, frequently ending up misaligned, something that can be especially irritating for players who care about symmetry or aesthetics. Inside bases, the appearance of multiple structural pillars makes rooms look cluttered or visually unpleasant, breaking the sense of immersion instead of enhancing it.\n\nCo-op gameplay has its own immersion-breaking issue: when a friend dies, there’s no option to revive them. They simply disappear in front of you, which removes emotional impact and eliminates interesting gameplay opportunities, like emergency rescues or support-based mechanics.\n\nInventory management also becomes frustrating. Items don’t stack, so your inventory fills up extremely quickly when gathering materials. Instead of creating a meaningful limitation, this system often just interrupts the flow of exploration. A more interesting alternative could be a weight-based system, forcing players to decide whether to gather more resources at the risk of running out of oxygen because they move slower or take longer to return.\n\nOn top of that, although exploration is pleasant at first, many areas follow a similar pattern: visit a wreck, loot what you can, bring it home, and repeat. Even as new biomes emerge during terraformation, the core experience doesn’t evolve as much as it could.\n\nDespite all these shortcomings, the game genuinely has a lot of potential. Watching the world gradually transform can be incredibly satisfying, and the slow, atmospheric pace can be quite relaxing. The developers are active, and the community often praises their commitment to improving the game. However, for me, the repetitive nature of the progression and the limitations in building and inventory eventually wore me down. I ended up getting tired before reaching the phase where the planet becomes fully alive.\n\nOverall, The Planet Crafter is enjoyable for players who like slow-paced survival and incremental progress. But if you’re looking for deep building mechanics, varied exploration, or more dynamic co-op systems, you might find it getting repetitive sooner than expected.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game has potential, but it honestly doesn’t feel finished. It plays more like an early access title than a complete release. Multiplayer is disappointing, for example, when a friend dies you can’t revive or help them in any way, they simply disappear, which removes any sense of actual cooperation. Building also feels unpolished, I noticed that when you connect base rooms, the inside of your base just creates pillars all over the place because the game automatically adds these random support pillars that look terrible and completely break immersion.\n\nThe core idea of terraforming a planet is great, but the execution isn’t there yet. Animations feel stiff and unpolished, the UI is clunky and not intuitive, and the lack of tutorials makes the early game frustrating instead of engaging.\n\nInventory management is absolutely terrible. Storage feels limited, crafting menus are messy, poorly organized, and navigation feels like a chore. Items don’t stack, so you will end up spamming a bunch of boxes to store the immense amount of resources you’ll gather.\n\nAll of these problems together and probably some more I haven’t experienced because I couldn’t bear to play more of it, make the game feel far less polished than it should be. The foundation is good, and the concept has a lot of potential, but the current state doesn’t justify the price. I bought Planet Crafter on sale for 11,99€ and still didn’t feel like it was worth it, so I refunded it. Hope this review helps!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "keeps locking up, or shutting down does not start....played great yesterday this morning wont even start...tried starting from steam screen and still does the same thing....very frustrating since i was at the end\r\nof this planets???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Planet Crafter is rated Overwhelmingly Positive on Steam. It's not that good. It's probably \"fine\" for a lot of people, not amazing for anyone.\r\nLots of people compare it to Subnautica. It's like an off-brand Subnautica imitation at best. It has visual and gameplay elements in common, but the atmosphere is way simpler.\r\nThe progression feels very forced. In Subnautica the progression was smooth as butter and very fun.\r\nProgression was also very unbalanced. At times, we had a dozen upgrades to build, but had to spend hours gathering resources to build them. At other times we had to sit around for hours waiting for research to unlock. The pendulum swung so constantly and so far on this that it feels like the developers must be too busy/overwhelmed to actually tweak and balance this.\r\nThe fact that items don't stack is such an unbelievable tedium. We finally installed a mod that allowed for stacks of 10, and it felt better. Stacks of 3 or 5 might be \"tight but manageable\"... but stacks of 1 was just outright a waste of our time, walking back and forth over and over again. I'd estimate that we saved 50-75% of game time by being able to stack items. What took us 12 hours would've taken us 40 hours of running back and forth... not more fun, just more back-and-forth.\r\nThe exploration is disappointing, with only 10-20 things to find in the entire world. Subnautica felt like every few inches was something interesting to see.\r\nThe story was limited enough to feel like it was an afterthought. There are probably 5 pages of total text that we've uncovered so far, and the entire story could be summarized in about 5 sentences. Subnautica felt like it existed in a world, rather than having a story tacked on.\r\nGraphics leave something to be desired. The tiling of textures was glaringly obvious, and some textures had noticeably lower fidelity than others.\r\nAlso, not much to do besides grind resources and wait for unlocks. Unimpressive base building (worse than Subnautica, which isn't the most impressive base-building system I've seen. Exploration exists and was a little fun, but ulimately limited in fruitfulness.\r\n\r\nWhat this game does best is have the state of the world respond to your terraforming efforts. Not perfect, but quite good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very grindy game with little to look at and do. Don't waste your money, subnautica is cheaper and far more enjoyable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is Ookaaayyy. Got kind of grindy and some of the unlocks didn't make much sense in the order you get them. My group of 4 players beat the game to just finish it but it felt like a real grind at the end. We hit a few bottlenecks that just felt like we had to grind rockets to speed up the victory points. By the time we got to late game we no longer cared about the other unlocks and just wanted to beat main story line. It's a cool concept but felt like a less good version of Satisfactory.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was going to give this game a good review , but i got \"shamed\" by a moderator in the Discussion forums on steam here .. \"akarnokd\"  , i made a post about how i liked the game so much i bought it after trying it via high seas.. he lost his mind in a comment and locked the post .. i would not recommend buying this game as thats the type of \"help\" or moderators on the discussion forums ..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Super Casual and tedious. \r\n\r\nНудный гринд и больше в игре нет ни чего.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only got about 15 minutes in but it was a clunky bad subnautica. (And I mean real clunky and robotic.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Preface: all achievements, skipped any portal activity or secondary planets. used my factorian nature to economize for the eco win.\r\nTLDR - Still very under cooked and under polished.\r\nGenre: Explorer with light factory, themed to Terraforming with no terraforming.\r\nPros:\r\nGraphics are decent.\r\nLots of cases of shouting: \"Not the BEES!\"\r\nLots of things for physics nerds to be displeased with.\r\nLots of things for neat and tidy types to be displeased with.\r\nCons:\r\nlack of a item-sink made storage kinda cumbersome.\r\nlack of storage options made storage kinda cumbersome.\r\nMixed Progression schema often left me confused about what i'm under producing.\r\nFauna and Flora appearing before i unlock any, slight-confuse.\r\nrelated note, fauna/flora appearing that i don't use, mid-sad.\r\nThe plot.. exists. if you're going to put so little effort into it, why even bother?\r\nProducers don't default to export, minor-niggle.\r\nCouldn't even get to double digits of animal types.\r\nI can't explode all these dumb rocks in my way.\r\nChain building needs to not be on a button hold: my pinky+ring is 'killing me'.\r\nWhen/how building parts are unlocked is, a decision.\r\n\r\nEnding Note: I feel like i've been bamboozled by brickyOrchard8",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, i watched a video on this game, it looked pretty cool, sure maybe some issues on the graphical side of things but overall pretty cool. i looked on the store page 25 dollars?!?!? i was shocked, but I bought it anyway, played the game fro 1 hour, thought it was cool, later i realized what am i paying for?! 25 DOLLARS FOR A MOBILE GAME if i didn't know this was being played on steam it could honestly be mistaken for a game on the app store.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "multiplayer doesnt work, just boots the joining party to title screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The concept is intersting, but the graphics are poor, and there is really no customization in the game. You get 1 type of square platform, 1 type of stairs, 1 type of room, 1 type of window. The entire game is mostly about spamming buildings of the same type to boost index multiplyers, and then just wait for the planet to (very) slowly become hubitble.... get it at a discount of at least 50%, it doesnt worth more then that",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have never actually played this game. Those 4.4 hours of play time on record were spent waiting for the game to load. I took a long nap and it still hadn't finished loading. I can't recommend a game like this to anybody.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gets boring pretty quick, like watching the grass grow.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The first planet is solid. You feel that you are terraforming. After that, there is a \"difference\" but nothing new. There is no real progression past the first planet. no real content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LATES UPDATE COMPLETELY SCREWED IT. DO NOT BUY UNTIL FIXED. COMPLETELY UNPLAYABLE. NO CONTROLS WORKING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What’s So Damn Bad About It\n\n1. Graphics Are Garbage\nThe visuals look like someone told a toddler to build a planet with crayons and a cheap 3D engine. And guess what happened? Floating textures, hollow geometry, and collision that’s so broken you fall through the planet like you're in some half-assed haunted house. Players have reported serious Unity-related graphical bugs. \n\n If you crank up the graphics thinking you’ll get something pretty, you’ll probably just be mistaken\n\n2. UI Is Brain-Damaged\nThe user interface is an abomination. It’s not just ugly — it’s actively working against you. Menus overlap, important data is off-screen, and crafting navigation feels like dragging windows around in Windows 95. On some hardware (like the Steam Deck), the biomass display doesn’t even show right. \nReddit\n The filter in the crafting/menu screen is trash, too. And placing buildings? Forget it — the snapping grid doesn’t line up, so your base looks like a drunken Lego set. \n\n\n\n3. Game-Breaking Bugs Everywhere\nRandom crashes, floating structures, and misaligned base parts are the norm. Some players build stuff and then watch it float off the ground. \n\n\n\n4. Repetitive, Shallow Gameplay\nYeah, you terraform. Big deal. The whole thing basically boils down to “gather → build → wait for a number to go up → repeat.” According to user reviews, the automation is weak, inventory sucks, and there’s no real reward for grinding. \n This isn’t deep simulation — it’s a glorified resource-hoarding treadmill.\n\n5. Design Confusion = Bad Design\nThe game doesn’t tell you how much biomass or atmospheric pressure you need to hit the next terraforming milestone. \n\n That’s not “mysterious design”; it’s lazy. And the jetpack? It’s wonky — you don’t truly fly, you hover weirdly based on where you’re looking.\n\nVerdict — This Game Is a Joke, and It Should Cost Pennies\n\nThe Planet Crafter is wildly overhyped. It’s unstable, ugly, poorly optimized, and has the design sense of someone who launched this without ever doing a reality check. The only people who might dig it are those with nothing better to play — but even then, you’ll be pissed off more than you’ll be impressed.\n\nRealistically? This game’s full price is a rip-off. At best, it should cost five bucks. More than that, and you’re paying premium for a broken toy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is unfinished trash get out of my head.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just a sci-fi cookie clicker.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a lot of waiting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "IT BECOMES REALLLY BORING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A good game until you hit about 50% and explored the map by the time being. After that it is just a bland grind to reach stage terraformed. I was hoping for some awesome twist in the second half of the game or a nice ending which rewards you for what have been made. Thing is, you will get a rushed second half of the game, a two liner and thrown to the menu. I should have stopped playing when the vehicle was introduced. Driving around in that thing was a nightmare. The mindless grind afterwards leaves me thinking why in hell this has a overwhelming rating.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Rating after 11 hours of play: 6/10. Subnautica has been my favourite modern video game, so the obvious similarities lead me to The Planet Crafter, and it does feel like a \"low budget Subnautica\" in a lot of ways. I played Subnautica in the mode that doesn't require eating and drinking because I hate having to perform repetitive tasks on a time limit, so the dangers I faced in that game had to do with not running out of oxygen and not getting killed by creatures. However in The Planet Crafter, while there is a similar mechanism with oxygen, the primary tension comes from those hated time limits of eating regularly rather than physical/environmental danger. Then when you start creating your own food and you've upgraded your techs, there isn't much tension at all. And while there's certainly some satisfaction to be found in upgrading those techs and slowly terraforming the planet, most of the game play involves running around doing boring \"busy\" work in the form of collecting resources. I generally prefer these sorts of chill video games to very intense ones, but even I found this one to be too boring. I can see how some people would enjoy doing simple, repetitive tasks and watching their environment gradually transform, but it just wasn't for me.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Maybe I haven't given it enough of a chance, but the scattered resources combined with the seemingly arbitrary crafting requirements and the unrealistic resource utilization/supply just don't feel \"right\" in a way that makes the game difficult to enjoy for me.\nI got it on sale, but even so... I wish I had saved that money for something else.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "fisher-price no man's sky, but without procedural generation, only on one planet. dry subnautica, without hostile lifeforms. starfield-esque, huge barren hellscape, no vehicles. minecraft without caves, resources are evenly distributed, and scattered all around the surface. astroneer without the fun sound effects or cute character. planet crafter borrows so many things from other games, i wish it had even an ounce of their whimsy.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The game is just super easy. Zero threats or challenge. Abundance of resources. After you terraformed prime and two moons, you are rewarded with the most crappiest ending of all time, with just few words and end credit.  That's it.  If you are looking for zen garden experience and build stuff with your friends with zero challenge, then this game is definitely for you.  Stuff like beds, exercise equipment, and etc are completely useless and unusable either way.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "So- to be clear, I do actually enjoy Planet Crafter and I do really want to recommend it, it's exactly the kind of game I love. However, there are a few things that prevent me from recommending it. The TL;DR is that there are a few clunky and at times frustrating things that need to be adjusted before I can recommend it.\n\nFirstly, this is a game about building things to terraform the planet. However, building a base is rather difficult. The first thing you'll run into is the fact that foundations don't snap or align to buildings- at least, not automatically. However, this is honestly more of a minor gripe, this doesn't cause that much of an issue other than minor frustration with some foundation placement- but perfectionists beware, the foundations and buildings are hard to align and it's hard to get a good camera angle to make sure they are aligned.\nBut the big issue is the act of building itself. One speed bump (literally) is how the small inventory and ability to find iron in early game is rather limiting for building a base. The iron issue does eventually get resolved, however, building a large structure can still be rather limited by even the late-game inventory size- you'll be running around a LOT (this isn't super bad, but it can make building more of a chore than fun). Secondly, I actually find it unironically interesting that the devs decided to make it where many things can just be built in the air at a preset distance from the player- rather than, for example, having to build them off of other buildings or the ground (though you can still do both here). I've always wondered how such a building mechanic might work, and honestly, it does work... with a lot of frustration at times. The problem being that buildings like to snap from one particular preset wall- in particular, the indoor stairs are two levels tall and want to snap from the bottom. This can make it difficult to build down. I spent a LOT of time trying to build a staircase down from my base- admittedly, I shouldn't have built it so high up, but it was also unreasonably frustrating to place indoor stairs down from it (which I had to do because indoor stairs are unlocked around mid game- had to use outdoor stairs before that).\n\nAnother issue is movement. The first issue is that gravity is always unreasonably strong and you plummet to the ground the second you step off a platform (would be neat if the gravity changed over time, btw!). Hunger and health are the same resource bar (drains over time)- which is an odd choice but I respect the simplicity- but it's really easy to die by falling. There is something to help though- a jetpack that you can make pretty early on. It hovers a certain exact distance from the ground- though you can make it fly higher or lower extremely briefly (it's based on where you're looking, which is a little odd, and kind of interesting actually, but sometimes annoying). The problem is the plummeting issue. You can save yourself from falling with the jetpack, but it's difficult to tell if the jetpack is working after an accidental fall because you still plummet until you're at the preset distance above the ground where you would float. By the time you can tell it's not working, you've already taken damage or died. If you were already jetpacking before you went off a ledge, you will still drop rather rapidly down to whatever the appropriate hovering distance above the ground is, which means it's very easy to lose your altitude. The reason this is a major problem is because the jetpack is very useful but very frustrating to use for building. If you move, your altitude will change based on the terrain and that can totally throw you off of where you were trying to build. It also changes your height based on where you're looking while jetpacking which can really jimmy things up for building. You can be hovering but not moving and you will bob around a bit- I assume this is because I'm changing the angle of the camera, which changes the altitude of hovering. On that note, I can respect the simplicity of the jetpack- but man, it makes for clunky building. \n\nReturning to building, the buildings that you will need to attach to your base can vary in shape widely (as in, come in non-standard sizes) and can be difficult to attach to your base. This may be an intentional design- to which I say, neat puzzle, but it can be hard to see where or how a building attaches to a building. There are a lot of buildings that can be difficult to tessellate with a base. But this is mostly a minor gripe.\n\nFor being a crafting game, it's a bit clunky to craft en masse. The problem I have is that multi-crafting is an optional setting and not the default. You have to hold CTRL to craft multiple items or build multiple buildings- if you don't, it makes one and kicks you out of the menu or takes away the building hologram. This makes base building clunky- having to hold CTRL while you try to find the right snaps for your buildings (remember the jetpack problem!). Multi-craft and multi-build should really be the default, and this game could learn a lot from the way Satisfactory handles buildings.\n\nAnother problem I do have with Planet Crafter is a lack of organization. In the late game, it can be difficult to sift through the long list of buildings or supply/demand request lists and they really need more categories. In addition, this game desperately needs an in-game wiki that can at least tell you at which crafting station or building you can build a certain item, if not also the recipe for that item. You will unlock something out of the blue and you'll want to make it, but in order to do that, you'll have to run around and go through every crafting station you own to see where it's built. You may not even have the crafting station yet or didn't know something even was a crafting station and you'll find yourself confused for a long while until you figure it out or google it. I didn't have as much of an issue with this problem though because I played with someone who has played the game before and he could tell me where to look- but I can imagine that I or an inexperienced player might get frustrated with that. If you're okay with using the wiki (which is unfortunately a Fandom wiki, be sure to use an adblocker), this isn't an issue.\n\nAnother gripe I have is also that the numbers are laughably low and it kind of breaks the immersion.\nYour temperature starts at 0 K which simply isn't possible. Even in my late game playthrough now (past the \"complete terraformation\" stage), I'm at 2,000 mK (yes, it still reads it as mK) which means it's at a whopping 2 K. There's no way anything living would survive at that temperature even if it were possible for the temperature to be that low. You also achieve a liquid water stage long before that. Just as a reminder, 0 degrees C / 32 degrees F (freezing point of water at standard pressure) is about 273 K.\nYou also start at 0 ppq oxygen, which is maybe plausible, but you can get to a \"breathable atmosphere\" stage at very low ppm of oxygen. I'm long past that, and I'm at about 5,000ppm oxygen (yes, it does read ppm instead of ppt) which is 0.5% oxygen. You need a bare minimum of 19.5% oxygen to breathe.\nAnd you start at 0 nPa pressure, which is impossible. Even if it were possible, that means the planet wouldn't have enough gravity to hold on to any gasses, which makes creating oxygen rather moot- it would just go off into space. In my current game, I'm at 1,600 Pa, which is ridiculously low. Earth's standard pressure is about 100,000 Pa.\nIf we were to align these numbers more to reality, it would feel more believable, immersive, and even educational while still being entertaining. And yes, I know there's a system terraformation index, but the numbers can be changed to make that work properly. \n\nThere's fun to be had here- but it needs more polish. Things were created in a simple manner but lazily implemented, which I think is my biggest issue with the game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A fantastic game - but horribly optimized. If you play it on Steam Deck or a mediocre PC, expect the endgame to be entirely unplayable with 10 FPS not abnormal at all. Also, their community support is absolute trash, banning people from their Discord server for calling out obvious problems with the app *that their own team admits to* even when *you* are the one being harassed. \n\nI was such a huge fan of this game and this company and their absolute piss-poor attitude and complete disregard for their community has 100% turned me off.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "At the time of this I have 165 hours, all in one game/save file.  It's a good game, but I just couldn't get all the blueprints, and after a million hours of searching for how to get all the blueprints, I have discovered that it is random, and there are many many people that have spare blueprints and many, many people that can't get enough blueprints.\n\nI just got to the beginning of tier 10 at 164 hours.  I liked the game, but it is unreasonable to be at this level and no tbe able to finish the game.  I don't have all the blueprints, and I can't even make explosives which are needed for getting more chests from the wrecks, which are needed for more blueprints which are needed so I can discover explosives so that I can make explosives, so that I can get more chests which give me blueprints...so that I can get through the wrecks which I need explosives for... \n\nSo I can't finish the game.  It's a long game, and I just don't feel like it's worth replaying just for a random chance on a different save to get the blueprints that I need, and it really stings that other people have gotten them with no sweat.  I feel a little cheated.  So I'll downvote this game, because it was fun throughout all the many hours but I felt really bitter at the end: I have no sense of accomplishment and that is a big deal to me.  In the end, I am unhappy.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "What a lazy and poorly optimized Subnautica asset flip. I quickly noticed just how bad it was in the first hour, but I wanted to see it all the way through hence the 62 hours.\r\n\r\n- assets, how do they work? The developer doesn't know, everything is bought! (except for the map, which is made with the cheapest geometry tool), and more often than not, assets are placed for decoration without any use for the player; lockers and doors you can't interact with, furniture only sometimes functions, pristine vehicles just sit there (can't recycle/deconstruct them either), and compartments with zero purpose! Why can I operate only ONE vehicle when there are clearly more?!\r\n- meteorites, how do they work? The developer clearly doesn't know. Meteorites never hit your base or equipment, they don't make any craters, they fully recolor your screen (for some reason) and they always contain some mcguffin you need. Moronic.\r\n- exponentials, how do they work? I really wish the developer knew! If you make a tree planter, trees begin to grow around the planet. Do they supply you with more Oxygen and more trees? NO. Same story with everything else! Nothing multiplies, not even the animals! A simulator that simulates nothing.\r\n- elements, how do they work? Just make up some colorful crystals that do everything! Can't mine the big ones though, those are just for decoration! At least Subnautica had some understanding of physics, this game is void of any of that, don't go looking for any kind of realism.\r\n- story and plot? Why even bother? Just run Subnautica through ChatGPT, make it legally distinct, copy and paste that and voila! Garbage.\r\n- optimization? That's when you DON'T have memory leaks, developer, just wish you knew. Its genuinely an accomplishment with how bad the game looks and how bad it runs, I thought you installed a bitcoin miner onto my PC. I've had many hard crashes during my playthrough and abysmal framerate drops.\r\n\r\nThis is an early alpha and you are already milking it with DLC drops. Shame on you developer, you could have had something good. Everyone saying it has \"PoTenTiAl\" when its just a stream of slop. 2/10",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Same stuff different planet's and moons. The fact you can't build your own ship and personally go to each of these planets is a big let down. It's the same boring stuff over and over. Get to 5-10 TTI and rocket over to another planet to do it all over again. What is the point? Why bother terraforming what is the goal? Do we not get a roleplay story line somewhere? It's just the same mindless terraforming with no goals.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game likes to waste your time. At various points I had nothing to do but wait. The unlock system is terrible and partially random. Often you will work towards unlocking a technology only to find out that it requires an input you wont unlock for many hours. Some crafting materials are finite. Mechanics, options, and opportunities are so very opaque Planet Crafter is one of those games that you eventually give in and play with the wiki open to understand what to do next or how what you have built works.\r\n\r\nWhat finally got me to give up is trying to make progress on microchips which unlock randomish new technologies you need to progress, but these are found through a semirandom loot table system. The game puts barriers in your face from the beginning which require unlocks from this microchip system that you might or might not get and some of the unlocks you need early on can only be had at the latest stages of the game depending on your luck.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Look this game is great but Now i see all this Paided DLC is coming i'd say run devs just cash grabbing at this point instead of expanding the base game that could use a few more zones and more systems additional resources for more complex builds",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I think this game is better played by watching a timelapse of the terraforming process on youtube or something.\r\nThe game was clearly built around the premade gradual change of the map from barren wasteland to jungle paradise, but the actual game around it is rather uninspired and dull.\r\nThe changing environment doesn't really add any challenges or effort, just more busywork and some pretty pictures to look at.\r\nThe other planets... even more so. A bit more challenging because not everything you need can be found there, but if you follow normal progression and go there after the first planet is done, you can just import whatever stuff you need to plop down more number-go-up machines.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is nothing but fetching resources and placing them down as structures. You get upgrades to fetch faster and build more expensive structures to fill the number-go-up bar. Bored me to tears.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is simply relaxing. Or at least is should be. Until you run into the onslaught of bugs, graphical glitches and just god awful optimization. It's a really cool premise and I love being able to actually make something better than how I found it. This game could've been more but it just fell short and I can't suggest you spend more than the base game on a discount. I won't buy the DLC. It's obviously just another game scam where they put out the bare minimum and drop DLC to bleed us for more money instead of making a game feel good and make you want to play it and come back. Bugs like losing your death box, water being gone after dying only to die immediately after, falling through map or getting stuck in rocks... The list is endless. If you don't mind that then go ahead and buy it at the risk of your sanity!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Greatly overrated IMO.\nPretty, and the planet develops, but no immersion.\nSilly things, like you have tech to synthesize machines to terraform a planet, but not to provide food/oxygen/water for the survival of the human terraformers? No. So you have to race around madly grabbing matts and building stuff to open up the tech tree several levels, so that humans can survive in a shelter. Who would sign up for this job LOL.\n\nAlso I like playing games like this in Hardcore mode, including every Diablo game, Grim Dawn, Subnautica and many more. Hardcore of course just means permadeath, so it makes it more immersive for many players including myself. Hardcore can usually be selected for any difficulty as it's not actually a 'difficulty' setting. It's just permadeath. \n\nUnfortunately in Planet Crafter Hardcore means permadeath AND extreme difficulty. The game expects you to know the map so well already that you know where all the crash sites are, where all the crates are, what all the techs are and what order you'll unlock them, etc. So you can't play Hardcore as a new player and expect any reasonable chance to survive it. Even after many attempts. \n\nWhich is a shame. I played Diablo 3 for example on Hardcore to max level, first playthrough. I played Subnautica to the end on second try. Not remotely possible here, because the devs don't know what Hardcore has always meant- permadeath. That's all. Not ALSO extreme difficulty.\n\nToo bad. It looks like a good game. I just can't get immersed in it without some more reasonable tech tree decisions (food/water/oxygen at the bottom) and a 'Hardcore mode' which actually means 'Hardcore mode' playable from the beginning.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I actually really like the premise of this game. The first few hours are pretty cool. The world changing around you is pretty sick, genuinely.\r\n\r\nBut the rest of this is allright...got it kind of cheap at 50% but i still kind of regret it. I had a lot of expectations for a 96% positive review on steam. But what I got was mostly just boring. Very similar systems to subnautica (inventory, base, energy, materials) minus any of the immersion/intensity/world exploration. The ui is very bad and the game generally feels very clunky. Honestly felt like playing a roblox game most of the time.\r\n\r\nHere are some of the gripes I have.\r\n\r\nBuilding system sucks, foundations don't snap to bases. Not a lot of creativity in base design compared to subnautica.\r\n\r\nInf. air/water is easy but you can't have unlimited food bar.\r\n\r\nBuildings are sometimes required to be indoors but then upgraded versions not. \r\n\r\nYou get a car but your jetpack is faster than it + it can get unlimited oxygen upgrades at the same time that you have a breathable atmosphere.\r\n\r\nLackluster crafting system. Game seems to have a focus on automation (thank god I love factorio) to a degree but the systems are so unintuitive for automation(too bad I love factorio). Autocrafter comes much later in the game, costs too much power. No way to automate delivery of stuff until at endgame (sucks for making things like super alloy rods). Most factories make byproducts that stall your automation(Miners1&2/Gas Extractor). Resource locations are totally hidden, your cooked if you didn't find the uranium/salloy mines.\r\n\r\nDrinking lake water doesn't fill my water all the way. Why not, the water is infinite?\r\n\r\nDNA/seed crafting takes like 2 minutes, literally no other craft has a timer. Just why?\r\n\r\nGame goes from heating/drilling/rockets to just endless fauna. IDK the crafting time + the amount of animals required + dna harvesting + farm setup + fertilizer/mutagen factory + larva collecting. Is. So. Tedious.\r\n\r\nSo yeah, cool game with a lot of friends maybe if it goes on sale for $5 but im going to be honest 96% positive on this game is nuts.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you can get this game for about 5 bucks and a few friends will pick it up too, it's fine. The dlc was for sure not worth it. It seems like they're just reskinning the same game over and over and changing very little to make money. C tier at best.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I loved this game to start, but as I progressed my base became submerged under a lake. That was frustrating enough for me to give up - I'm not going to spend hours moving my whole set-up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall its a functioning game. the gameplay is number go up with fun little late game additives that make the grind at least more enjoyable. There are a lot of basic QOL things missing, a decent building system for one. It, much like the game, functions at a basic level, but the forced grid system mixed with there be no real center point or even a consistent scaling. Basic box house and Basic box supports not only are two different sizes, but also operate on their own snap points. \r\n\r\nLong short of it, it works as a game, but don't get into the building if you hold any sort of need for perfection or symmetry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just a boring game where you constantly grind for resources to not die. Just didn't do it for me. Maybe if it had better visuals or something, but I found the game more annoying than anything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun game but would have been great if they add more content in the game instead of selling overpriced dlcs. So many other games adds content first before selling dlcs but this game sell you another planet type dlc almost same price as the base game when on sale. Horrible monetization method.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While this is a good game it quickly gets repetitive and boring, especially with the latest updates being locked behind paid dlc. I recommend an initial playthrough but don't expect something super epic and amazing. Get it on sale if you can get the whole game at once. Otherwise I recommend passing on this game. I hate when you buy in to early access to support a game you want to play as it is finished and a dev decides to lock new game content behind paid dlc like buying the game in early access is not enough. Greedy devs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Constant crashes. Constant. It would be fun but the random crashes makes this game impossible to enjoy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game is beautiful. Interesting craft system and area to explore, BUT there is no end to crashing and logs. Tons of reasons and a lack of  information provided.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Relasing DLC'S while the game is unfinished/shitty ?\nNot updating the main game (small updates) ? \nHigh costs no fun ? \nIf yo wanna all those 3 things in one this is the game 4 u",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is crashing quite often and corrupting save file. fix it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't begin to imagine how this has Overhwlmingly Positive reviews. Like it's not awful or anything but it's not nearly as great as others pretend it to be.\n\nUi is terrible, animation and physics feel super scuffed and the way ressources are just random nodes scattered literaly everywhere on the planet surface feels like such an odd decision instead of like designated zones and outcrops. I usually like hunger/thirst but this game makes it feel more like an annoying side thing to worry about than a core mechanic. \n\nThe game does NOT feel polished at all and I feel like everyone saying so have insanely low standards. I'm sorry, I know it's mostly an indie studio working on this but for the asking price it's just not that great.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "not quite my cup of tea. Somewhat spoiled by other 3D factory builders where building feels more impactful and satisfies the engineering mindset. Building in this game feels a bit more like checking off a box in a spreadsheet that just \"works\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have played all the other content and really enjoyed the  game. I was very much looking forward to the Toxicity DLC. Sadly, Toxicity is totally unbalanced in the start. I have tried 3 times, with different strategies to start the game fresh and in Standard mode and each time I starve to death because there is insufficient food resources in the game before you get the food grower. Maybe its the luck of the draw, maybe I'm just a dope, but I see others in the forums having the same issue. It\"s just not fun. I will probably start again from Prime and bring a bunch of stuff on the interplanetary shuttle but that is not how I wanted to play this DLC. I really hope the Devs fix this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was cool but the moons you unlock after the main planted is done make for a really boring and unsatisfying ending.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While the game is good and it has a few flaws i cannot play it anymore.\r\nAbout a year ago they brought out a update which makes the game unplayable for me, my windows version is not the same as they suddenly required alongside my graphics card.\r\n\r\nWhile i did contact support the issue whas never resolved, if you have a new pc and you are ok with intrusive windows then it wont be a issue, but if you are a bit more privacy oriented then you will have to put in a lot of effort to make this game work.\r\n\r\nIm very sad because i bought this game for my friends as well",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is just a worse Cookie Clicker game, except you press W and Space most of the time instead of clicking on a cookie.\r\n\r\nYou build machines that make Number Go Up, and the further you get into the game the more convoluted the steps to make Number Go Up gets. Later on you can send up satellites that have modifiers like \"increase heat by 1000%\". That's the entire game in a nutshell, except you have a lot of travel distance to cover to obtain everything you need.\r\n\r\nThis game feels like it's still in early access due to its many flaws.\r\n\r\nI should let this be a lesson to not buy games when sleep deprived. My time would have been better spent catching up on a tv show or something.\r\n\r\nI played on Intense because I wanted to raise the stake a little, it didn't really matter. I only died two times, and both times it was because I forgot to bring along extra oxygen, and thought I had.\r\n\r\nThe initial hours of the game is alright. Crash on a \"hostile\" planet, gather up materials & build an initial base while making sure you don't run out of oxygen, food or water.\r\n\r\nThe survival aspect is extremely trivial, to the point that it feels tacked instead of thought through. You'll have to be very inactive to run out of any of  the \"survival meters\".\r\nThe sense of danger is so low, that astroids crashing around you is just a mild nuisance as they make the screen shake.\r\nI got directly hit by an astroid, and I only realised because I got an achievement for it.\r\nIt did no noticeable damage to me, and it doesn't damage the area around you or the buildings you make.\r\n\r\nWhich stands in stark contrast to the story elements, which say you were forced on this \"deadly\" planet to make it liveable - and that the survival rate of planet crafters is absymal (probably dying from tedium).\r\nYou'll get messages from both the corporation that sent you here, and some unknown ally who tries to help you - at one point the corpo even says \"we're always watching you, so no hidden messages\" - or what? The game's empty, what threat could the corpo possible throw at me.\r\n\r\nThere's some subplot about a race that arrived on the planet before us, but it feels meaningless. \r\n\r\nThe most exciting point of my playthrough was when I mistakenly thought my new main base would get flooded, and I could have realised my mistake by simply looking at one of the monitors I crafted really early on.\r\n\r\nOnce the inital hours was over, it started to dawn on me that all I was doing was travelling from point A to B for up to minutes at a time, gather a few materials for a few minutes, and return and quickly build something - realise that I needed more and repeat ad naseum.\r\n\r\nIt started to get real tedious, but I knew I had a vehicle to look forward to, imagine how much faster it'll be then!\r\nOnly to realise that the rover vehicle is atrocious. Driving it makes my ears & head hurt, it's default speed is slower than just travelling with my legs & jet pack, you still lose oxygen in it and the only upgrade for oxygen requires materials that took many hours to get access to. Once I had the 3rd speed upgrade, I foolishly thought it might be useful at last, but no it's just too awful to use and the sound problem is unchanged. So I always travelled \"on foot\".\r\n\r\nBy the time I got to the insect phase, and nearing breathable atmosphere, the material cost for making Number Go Up was getting really high, which made more tedious walks for materials.\r\n\r\nThere's also zero \"structual integrity\" or gravity to care about when building. So if you want, you can make giant floating bridges, or a floating base. I started climbing over invisible walls as shortcuts just so I could spend less time on tedious travel - feels weird having so many invisible walls in a game that gives you a jet back.\r\n\r\nThe game just feels really hollow, with surface level mechanics and a barebone story that just gives \r\nludonarrative dissonance as what's being told doesn't fit the game experience at all.\r\n\r\nThe pacing feels bad, and tips from the messages would always arrive late (i.e. I was already doing what I'm being advised to do). Tech that would make the game less tedious is extremely far away, and you could probably bypass a lot by just standing AFK in your base, but I play games to be engaged by what's happening, not find ways to avoid it. I might have played longer had I obtained drones earlier, but despite unlocking a satelitte that helps keep track of drones early on - I was still hours and hours away from actually having drones. By the time I got breathable atmoshpere, and teleporting unlocked, I just couldn't be bothered any more.\r\n\r\nJust to bring the cookie clicker analogy home, my last achievement was \"Cookie Factory\". On that note, Cookie Clicker has a better story.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "bought it in 2023, bad performance and expectations too high because of satisfactory.\r\nbought again recently and the gameplay loop isn't satisfying. Collecting of resources manually is repetitiive and performance isn't good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All three possible official endings are horrible and feel like a punishment. I play games for fun, not to be disheartened and depressed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Go-fetch simulator. \n\nBarren scattered resource collecting busywork with time-based sequential unlocks.\n\nBase building is extremely simplistic and barely qualifies for the genre.\n\nThis is honestly the worst game I've played this year. Insane level of positive reviews for such a basic mediocre, almost nothing of a game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Driving sucks.  Worse than the Mako.  You get stuck all the time and waste more time spamming F4 than actually crafting anything.  Lost all my resources stuck in some ridiculous hole, and all of your finite  resources just lost because they were in your vehicle and there's just no getting it out.  Frustrating waste of time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In my opinion, The Planet Crafter becomes repetitive fairly quickly. While the core idea of terraforming a barren world is exciting, the gameplay loop often settles into the same routine: gather resources, place machines, watch the numbers climb, and move on. After some time, this cycle starts to feel more like waiting than meaningful progression.\n\nThe building system also leaves a lot to be desired. Construction doesn’t feel smooth, and the game doesn’t offer much creative freedom when designing bases. Interiors often look awkward and disconnected. Decorative objects are hard to place nicely, frequently ending up misaligned, something that can be especially irritating for players who care about symmetry or aesthetics. Inside bases, the appearance of multiple structural pillars makes rooms look cluttered or visually unpleasant, breaking the sense of immersion instead of enhancing it.\n\nCo-op gameplay has its own immersion-breaking issue: when a friend dies, there’s no option to revive them. They simply disappear in front of you, which removes emotional impact and eliminates interesting gameplay opportunities, like emergency rescues or support-based mechanics.\n\nInventory management also becomes frustrating. Items don’t stack, so your inventory fills up extremely quickly when gathering materials. Instead of creating a meaningful limitation, this system often just interrupts the flow of exploration. A more interesting alternative could be a weight-based system, forcing players to decide whether to gather more resources at the risk of running out of oxygen because they move slower or take longer to return.\n\nOn top of that, although exploration is pleasant at first, many areas follow a similar pattern: visit a wreck, loot what you can, bring it home, and repeat. Even as new biomes emerge during terraformation, the core experience doesn’t evolve as much as it could.\n\nDespite all these shortcomings, the game genuinely has a lot of potential. Watching the world gradually transform can be incredibly satisfying, and the slow, atmospheric pace can be quite relaxing. The developers are active, and the community often praises their commitment to improving the game. However, for me, the repetitive nature of the progression and the limitations in building and inventory eventually wore me down. I ended up getting tired before reaching the phase where the planet becomes fully alive.\n\nOverall, The Planet Crafter is enjoyable for players who like slow-paced survival and incremental progress. But if you’re looking for deep building mechanics, varied exploration, or more dynamic co-op systems, you might find it getting repetitive sooner than expected.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game has potential, but it honestly doesn’t feel finished. It plays more like an early access title than a complete release. Multiplayer is disappointing, for example, when a friend dies you can’t revive or help them in any way, they simply disappear, which removes any sense of actual cooperation. Building also feels unpolished, I noticed that when you connect base rooms, the inside of your base just creates pillars all over the place because the game automatically adds these random support pillars that look terrible and completely break immersion.\n\nThe core idea of terraforming a planet is great, but the execution isn’t there yet. Animations feel stiff and unpolished, the UI is clunky and not intuitive, and the lack of tutorials makes the early game frustrating instead of engaging.\n\nInventory management is absolutely terrible. Storage feels limited, crafting menus are messy, poorly organized, and navigation feels like a chore. Items don’t stack, so you will end up spamming a bunch of boxes to store the immense amount of resources you’ll gather.\n\nAll of these problems together and probably some more I haven’t experienced because I couldn’t bear to play more of it, make the game feel far less polished than it should be. The foundation is good, and the concept has a lot of potential, but the current state doesn’t justify the price. I bought Planet Crafter on sale for 11,99€ and still didn’t feel like it was worth it, so I refunded it. Hope this review helps!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "keeps locking up, or shutting down does not start....played great yesterday this morning wont even start...tried starting from steam screen and still does the same thing....very frustrating since i was at the end\r\nof this planets???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Planet Crafter is rated Overwhelmingly Positive on Steam. It's not that good. It's probably \"fine\" for a lot of people, not amazing for anyone.\r\nLots of people compare it to Subnautica. It's like an off-brand Subnautica imitation at best. It has visual and gameplay elements in common, but the atmosphere is way simpler.\r\nThe progression feels very forced. In Subnautica the progression was smooth as butter and very fun.\r\nProgression was also very unbalanced. At times, we had a dozen upgrades to build, but had to spend hours gathering resources to build them. At other times we had to sit around for hours waiting for research to unlock. The pendulum swung so constantly and so far on this that it feels like the developers must be too busy/overwhelmed to actually tweak and balance this.\r\nThe fact that items don't stack is such an unbelievable tedium. We finally installed a mod that allowed for stacks of 10, and it felt better. Stacks of 3 or 5 might be \"tight but manageable\"... but stacks of 1 was just outright a waste of our time, walking back and forth over and over again. I'd estimate that we saved 50-75% of game time by being able to stack items. What took us 12 hours would've taken us 40 hours of running back and forth... not more fun, just more back-and-forth.\r\nThe exploration is disappointing, with only 10-20 things to find in the entire world. Subnautica felt like every few inches was something interesting to see.\r\nThe story was limited enough to feel like it was an afterthought. There are probably 5 pages of total text that we've uncovered so far, and the entire story could be summarized in about 5 sentences. Subnautica felt like it existed in a world, rather than having a story tacked on.\r\nGraphics leave something to be desired. The tiling of textures was glaringly obvious, and some textures had noticeably lower fidelity than others.\r\nAlso, not much to do besides grind resources and wait for unlocks. Unimpressive base building (worse than Subnautica, which isn't the most impressive base-building system I've seen. Exploration exists and was a little fun, but ulimately limited in fruitfulness.\r\n\r\nWhat this game does best is have the state of the world respond to your terraforming efforts. Not perfect, but quite good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very grindy game with little to look at and do. Don't waste your money, subnautica is cheaper and far more enjoyable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is Ookaaayyy. Got kind of grindy and some of the unlocks didn't make much sense in the order you get them. My group of 4 players beat the game to just finish it but it felt like a real grind at the end. We hit a few bottlenecks that just felt like we had to grind rockets to speed up the victory points. By the time we got to late game we no longer cared about the other unlocks and just wanted to beat main story line. It's a cool concept but felt like a less good version of Satisfactory.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was going to give this game a good review , but i got \"shamed\" by a moderator in the Discussion forums on steam here .. \"akarnokd\"  , i made a post about how i liked the game so much i bought it after trying it via high seas.. he lost his mind in a comment and locked the post .. i would not recommend buying this game as thats the type of \"help\" or moderators on the discussion forums ..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Super Casual and tedious. \r\n\r\nНудный гринд и больше в игре нет ни чего.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only got about 15 minutes in but it was a clunky bad subnautica. (And I mean real clunky and robotic.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Preface: all achievements, skipped any portal activity or secondary planets. used my factorian nature to economize for the eco win.\r\nTLDR - Still very under cooked and under polished.\r\nGenre: Explorer with light factory, themed to Terraforming with no terraforming.\r\nPros:\r\nGraphics are decent.\r\nLots of cases of shouting: \"Not the BEES!\"\r\nLots of things for physics nerds to be displeased with.\r\nLots of things for neat and tidy types to be displeased with.\r\nCons:\r\nlack of a item-sink made storage kinda cumbersome.\r\nlack of storage options made storage kinda cumbersome.\r\nMixed Progression schema often left me confused about what i'm under producing.\r\nFauna and Flora appearing before i unlock any, slight-confuse.\r\nrelated note, fauna/flora appearing that i don't use, mid-sad.\r\nThe plot.. exists. if you're going to put so little effort into it, why even bother?\r\nProducers don't default to export, minor-niggle.\r\nCouldn't even get to double digits of animal types.\r\nI can't explode all these dumb rocks in my way.\r\nChain building needs to not be on a button hold: my pinky+ring is 'killing me'.\r\nWhen/how building parts are unlocked is, a decision.\r\n\r\nEnding Note: I feel like i've been bamboozled by brickyOrchard8",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}