{
  "positive": [
    {
      "review": "My experience so far in Guild Wars 2. \n\nGuild Wars can be overwhelming once you hit level 80 but if you pick a couple of goals to work towards its actually quite refreshing. There is no gear treadmill in Guild Wars which effectively allows players the freedom of doing whatever activity they actually enjoy doing without pressure to \"gear up\". I felt a FOMO a total of ZERO times so far in the X hours I've played. There is no RUSH to end game like other certain games in the same genre. The end game is pick your poison.  \n\nOne of the biggest draws to the game for me is the open world in particular - meta events. These events attract a large amount of players all committed towards a common goal, usually a boss.  The open world content is top shelf to say the least which attributes to the game feeling very much \"alive\". That's just one of the many elements of Guild Wars 2 that players can participate in, there are also fractals ( mini dungeons ), Raids, Strikes, PVP, World V World, World Bosses, Mount collection, Achievment hunting and legendary gear crafting to name a few. I probably missed some stuff. \n\nSome things to note: \n\n- This is not a theme park MMORPG, meaning all the old expansions and zones are still active and have players running around doing all sorts of things. Old content = still relevant. \n\n- If you don't like the story then getting through the MSQ can be a drag. With unskippable dialogue it can be an absolute ball drag at times.\n\n- You can play for free but also remember as F2P you are gated out of a tremendous amount of content which they have strategically placed behind, imo, fair pay walls. Keep a look out for sales. \n\n- Is Guild Wars Pay to Win? \nNo, but it is pay for convenience, as you can buy gold directly from the cash shop.  \n\n- The GW2 wiki is your friend.\n\n- There is no subscription fee. \n\n- Get yourself a good mount as one of your first priorities ( I got Skyscale ). It is a necesary quality of life improvement that will impact your whole playing experience. I'm constantly saying to myself \" Thank *&^% I've got Skyscale.\"\n\nThanks for reading,",
      "voted_up": true,
      "votes_helpful": 54
    },
    {
      "review": "Been playing GW2 for about 8 years, 5 on the ANet client, now on Steam and it’s still the most well-rounded MMO I’ve ever played.\n\nWhat keeps me here is the freedom. There’s always something to do. I can chill with world events, jump into PvP or WvW, or just wander and enjoy the atmosphere. The community’s very supportive, the game never forces a grind, and it always feels rewarding whether I play for 30 minutes or 3 hours.\n\nGW2 isn’t just content, it’s a world that still feels alive every time I log in",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "The only thing I do not like about this game is that you have to certain achievements to complete items. I dislike PvP and WvW, yet you are forced to play in order to get items for crafting. There should be alternative means to get these items for crafting if pvping is not your thing. These items should be available for pve through meta events. Just my opinion.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "as someone who comes from WOW i have to say the questing is quite fun, the game allows you to explore on your own accord while also giving you direction to whats closest to you. main story missions are check pointed after every 10 levels so if you complete the main story fast you are forced to explore the word, do world events and make relations with key npcs for EXP. this is by far the best aspect of the game for me. it really allows me to explore the ins and outs of the map and be rewarded for it. as opposed to accepting a quests from random npcs you dont know or realy care about. i am still in this early leveling stages only at level 62 for my 3rd day in, but the leveling stage is important for a new player and the game so far has kept me entertained.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Runs and feels better polished than most MMORPG's on the market right now. Even without exitlag.\n\nA plus is the Spanish translation which is almost 95% correct so it helps people on South America.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Very good MMO, Community is super friendly and now i can finally  play on steam with -provider Portal and its so fun on the on the steamdeck!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Having logged over 3000 hours on my main (non-steam) account thus far I would have to say that Guild Wars has been a boon and a curse over the past 10+ years. Here is the recap:\n\nFirst off I was delighted when it got released on Steam as well - a second wind for the game and a new playerbase able to visit tyria (& experience the wonderful soundtrack - kudos to the composers!)\n\nInvestment 1: From a money perspective -> well-spent. No subscription. Buy the base game+add-ons and you get hundreds of hours of content. Want to take a break? No problem, return in a few months and you will see many improvements (without paying a dime during the time you were gone - devs are doing a good job in that regard)\n\nThe map design has overall always been very nice and I really appreciate the paint-brush aesthetics utilized in all parts of the game. The concepts and artwork in general is beautiful (look it up online)\n\nAs with many MMORPGS, it distracts you just fine from the everyday stressors of life. Maybe too much at times. Or it stresses you in other ways. If I am tired of chores in real life, Guild Wars presents me with new chores and new to do lists... makes you finish collections, achievements of all kinds & play the story chapters more often than you want to (depending on the expansion, even playing it once could be considered one too many). At least the underlying lore was always interesting. \n\n\nThe end-game. Well... instead of buying new clothes in real life, you hunt for skins in the game. 'Fashion Wars'. Also, instead of going to the convenience store you play 'Convenience Wars' and pay hundreds of gold for things just to have them easily available on all the other characters as well (even if you hardly play them, you start to 'need it, just in case..'). So you keep grinding... for things you wanted yesterday, or things you might want to want at some point... which brings me to:\n\nInvestment 2: From a time-perspective -> your results may vary. I know of guys who study the (trading) market and have excel sheets - this is where I draw the line. I already have an office job.\n\n\n9/10 escape reality wars, 9/10 fashion wars, 8/10 sunk cost fallacy wars, 5/10 story wars, 10/10 soundtrack wars\nAveraging at 8.2 - so. yeah. recommended",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game is great , really fun MMO. But I would only recommend it if you have DLC. As a FTP player , the games is extremely limiting especially with no mounts , makes the game excruciatingly annoying to travel.During my first experiance travelling and unlocking waypoints, I have spend more time cursing the dev for not giving a permanent basic mount.\r\nIts a great game, but please get it with DLC or your not gonna get the full experiance.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Delivers exactly what I wanted from Guild Wars after playing GW 1 for so long. A strong addition to a series which was already fun to play.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A classic experience with a friendly community.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "9/10 [⭐⭐⭐⭐⭐⭐⭐⭐⭐ - ]\n--------------\nLeave WoW and blizzard behind and come join a game that actually respects your time and wallet.  \nThe game is VERY active with a world full of people and events, no way near behind dead in any aspect. \n--------------\n🗺️ A World That Actually Feels Alive\nTyria is one of those rare MMO worlds where you don’t feel like the chosen errand-runner following glowing exclamation marks. You walk into a zone and the zone is already doing stuff: villages getting attacked, NPCs fighting back, massive bosses spawning, random players rallying together. The world doesn’t wait for you — you join it. And that makes exploration insanely satisfying.\n\n⚔️ Combat That’s Fast, Fluid, and Fun\nThis isn’t tab-target snooze-fest combat. GW2’s fights feel active: dodging matters, positioning matters, combo fields make you feel smart, and every class has real personality. Switching builds and elite specs can completely change how the game feels, so experimenting stays exciting even after hundreds of hours.\n\n🎯 Dynamic Events > Quest Checklists\nInstead of “kill 10 boars,” you get dynamic events that spiral into full-on map-wide moments. An escort turns into a siege, which turns into a boss fight, which turns into a celebration with loot raining everywhere. It creates natural momentum and makes the game feel like an adventure instead of a to-do list.\n\n🧭 Progression That Respects Your Time\nNo sub fee. No endless gear treadmill. You don’t get invalidated every expansion. GW2 leans into horizontal progression: mastery systems, mounts, new ways to play, quality-of-life unlocks, cosmetics, builds. You can step away for a month and come back without feeling punished. That alone makes it stand out.\n\n🤝 A Community Built for Cooperation\nThe game is designed so helping others feels normal, not like you’re losing efficiency. Shared loot, open tagging, easy revives, big metas where everyone benefits — it naturally pushes players to work together. And it shows. World bosses and map metas often feel like friendly chaos in the best way.\n\n📖 Expansions That Keep Getting Better\nEach expansion doesn’t just add content — it adds game-changing systems. Gliding, mounts with unique movement mechanics, elite specs that reinvent classes, gorgeous maps, and some of the most cinematic MMO encounters out there. The game keeps evolving instead of repeating itself.\n\n🎨 Fashion Wars Is Real Endgame\nCalling it a meme is unfair. The customization here is wild: dyes, skins, gliders, mounts, legendaries, outfits — and because gear power doesn’t reset every patch, looking cool becomes a real long-term goal that’s actually fun to chase.\n\n✅ Pros\n\nGorgeous, living world that rewards exploration\n\nBest-in-class dynamic event system\n\nCombat feels modern, responsive, and flexible\n\nNo subscription + chill progression model\n\nFriendly, cooperative community\n\nExpansions add meaningful new gameplay\n\n❌ Cons\n\nYou may accidentally play for 6 hours “just doing one more event”\n\nInventory management can get spicy if you hoard everything (guilty)\n\nThe game is so packed with systems it can feel overwhelming at first\n\n🏁 Verdict\nGW2 is the kind of MMO that makes you log in because you’re excited, not because you’re behind. It’s epic without being exhausting, social without being stressful, and full of moments that feel genuinely alive.\n\nIf you like exploration, action combat, big co-op battles, or just want an MMO that respects your time: play this. ✅",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Guild Wars 2 is above and beyond my favorite video game that I have played for thousands upon thousands of hours across multiple accounts since 2012. This game provides so many different opportunities for people to enjoy the game in a wide variety of different ways. From a more casual open world adventure to more intense team centric competitive content and everything in between. \n\nYou can play most of the game by yourself should you choose with the easy ability to casually begin playing with others and joining in on any activity taking place across the world. But should you decide that you want to become more social and play with lots of people, the opportunity is there as Guild Wars 2 has a massive community with so many different people playing it and many smaller communities built within the game.\n\nThis game has so much content from the original launch of the game and the large amount of updates and expansions that followed afterwards. While I have played for such a long time, there is still constantly more that I can do. Anybody who enjoys playing through a content rich game would definitely enjoy diving deep into Guild Wars 2 just because of how much quality content there is. And this may seem overwhelming for many people, but the game is incredibly simple and easy to get into and you should you decide you want to dive deeper... you can.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very nice game, i enjoy it a lot even as an mmo newbie.\r\nthe fact that i don't need any subscription to play is also nice, i can just buy whichever extension i like permanently.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So much content to explore, great graphics and keeps you interested.\r\nfree basic account and only extra content and builds are to be paid for once.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best MMOs these days. You get tons of content to chew through, and no subscription fee... not even an \"optional\" one like ESO.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Logged in to try the game , 5 minutes later realized I've been playing for 7 hours. Last time I had a feeling like this was Vanilla WoW, huge world-solid story to follow, very very interesting combat mechanincs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I played the OG Guild Wars as a kid and likely sunk 1000s of hours into it.  Later on I played the Guild Wars 2 beta and played at launch (not recorded in steam).  So needless to say i have been a HARDCORE fan of the Guild Wars games. That being said I have played this game on and off since then.  I just recently came back after craving a MMO game, and within a few mins of playing it instantly put a smile on my face.\r\n\r\nThis is the MMO that pioneered what it means to be a modern MMO, and by that I mean a MMO in the post WoW world.  The ability to dodge, use cover, move around, use skill combos in real time makes combat fast pace and fun.  There is a high skill cap for this game, which makes it different from most other MMOs. But its also one of the few MMOs where you are encouraged to work together with whoever is running around in the open world.  Most of the best moments i have had in this game have come from joint meta events across Tyria. Add the wide range of gear, leveling, skills, classes (and sub classes).  Theres so much there to keep a average and even a hardcore fan going for thousands of hours. \r\n\r\nGo enjoy the free version for a bit, then do yourself a favor and buy the full version.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game! It contain open world experience with main story line and side quests, along with PvP and WvW experiences.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "honestly i remember playing when i was younger on my dads pc so seeing it still alive is great and now having a pc again the nostalgia is hard carrying this for me and i am all here for it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After playing Osrs for 15 years and enjoying it a lot I needed a refresher. I love MMO's with my life and after Destiny 2 slowly died I needed a replacement. I have strictly only had a desire to play this game sense I got it about 3 weeks ago or so. Me and my best friend have had a blast and solo its been a blast. The community is so welcoming and willing to help with anything you would ever want. While I still do play osrs I can confidently say this is one of the best games I have ever decided to spend my time on. I plan on spending thousands more hours in Tyria and I cant see how I can quit!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My first proper try on an MMORPG and it genuinely has done what World Of Warcraft couldn't for me. It can be overwhelming but if you focus on getting through the main mission, the game starts to really make sense, and its a really big world with so many different things to do. Its a grind done well. \r\n\r\nDownside tho, I had to spend 150£ on all the DLC, which is insanely worth it for what you get but again, its 150£. It does say f2p but its more free to try. No sub tho :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its fun to play, so many player help me as newbie, like.. in this game, so farr so good i meet the peoplee :D",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Most MMO's have a short life, but there is a reason while Guild Wars 2 has lasted so long and honestly it deserves more credit. Great game, has everything you need to have fun PvE, PvP, Open World, Story, collectables, achievements and the world map is huge and detailed no P2W junk, just buy the expacs if you want the new specs and story thats it. In a time where there are VERY few MMO's to choose from Guild Wars 2 has to be at the top of your list.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "so far really fun, graphics suck but this game came out 16 years ago what do you expect",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a Goated MMORPG. No sub required and all content stays relevant (and populated!) throughout expansions.\r\nDon't expect a WoW clone. GW2 makes its own path through the genre.\r\n\r\nThe good (incoming wall):\r\nNo empty zones\r\nBig PVE and PVP scene\r\nLife-like mounts\r\nFun combat with toggle between tab-targeting and action camera\r\nBuild versatility\r\nNo pressure to do certain activities\r\nCustomisable dailies\r\nFriendly community\r\nNo in-your-face cash shop popups\r\nMTX is cosmetic and QoL\r\nCan convert in-game gold to MTX currency\r\nF2P model is more than fair\r\nCrafting is actually useful\r\nJump in any expansion at level cap\r\nCan be as casual or hardcore as you make it\r\nTry out full builds and elite specs in the PVP lobby from level 1\r\n\r\nThe bad:\r\nAddictive\r\nLoot management\r\nSome older story content can feel a bit clunky/unpolished but not enough to be a deal breaker\r\n\r\nThe different:\r\nSome systems take a bit of getting used to, but once it clicks you're golden\r\n\r\nSteam or ANet?\r\nANet 100% - Some bundles are only available there, plus gifted MTX currency cannot be used through Steam account, among others\r\n\r\ntl;dr\r\nGo play it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I regret not trying this game before. One of the most interesting art-styles/environments in any MMORPG. Especially Divinity's Reach. Everywhere you go there is players and events. It never feels empty.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Been playing since launch, will keep playing until the servers stop.\n\nThis game never stops improving, and the community is incredible.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've tried this game a few time and quit every time. The problem is, changing mmo's is like a break up. I needed some time between my few year journey through with another mmo to really appreciate this one. \r\n\r\nWith that being said, this game is dope. \r\n\r\nTo start its completely free to try and no monthly subscription, so worst case your'e only missing out on \r\nthe time invested in the download if you really hate it. \r\n\r\nThe diversity in this game is crazy with many different play styles being perfectly viable. The world around you feels alive, npc dialogue, random events, large meta events, instanced content, challenge modes etc.\r\n\r\nThe devs respect your time. This game is perfect for someone that cant sink tons of hours into a game to stay competitive. The gear/loot hamster wheel that many games rely on to keep you coming back is non existant. Once you earn good gear, you have good gear. \r\n\r\nThere is no pay to win. You can pay for convenience or cosmetics but its not required to enjoy the game. \r\n\r\nThe community in my experience has been nothing but pleasant with literally one or two exceptions here or there. Overall everyone has been helpful. Some so much so as to group up with me one on one and answer any and all questions i had in the game.\r\n\r\nTLDR: Hit the download button and give it a fair shot with an open mind, ( Its literally free ) This game does things different and comparing it to another mmo does everyone a disservice.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a Great MMO, You just Chill end enjoy ! Good for people with jobs and busy professionnal life !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's closer to 4000 hours, and is one of the few games that is just a game and not a job. Every time you log on there is something fun to do",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't play this on steam I play on the actual client, but just wanted to say I really enjoy how laid back this mmorpg is. There's no rush to gear up get to end game. You just login when you feel like it and explore.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "To call this game an MMO does it a bit of a disservice. This game is every bit as fun and rewarding as any singleplayer game. You just get a ton more game for your money(Free).\r\n\r\nThe sense of wonder and adventure you can get from this game is the best in the genre. The zone maps are dense and packed with fun content. The story is engaging and respects your decisions, and the world feels alive. The exploration and sense of discovery is incredible. \r\n\r\nThe 9 Classes offer a ton of replayability, and can be tweaked endlessly to suit your playstyle. It's not just a meme. You can play a warrior who shouts at his friends to make them feel better, and with a few adjustments make him a conquering hero who plants battle standards that break enemy morale and help turn the tide of battles.\r\n\r\nMy absolute favorite thing about this game is how well it treats roleplayers. Every non-story quest is handled in a way that lets you tackle one objective multiple ways. So if your character is more of a pacifist there is a method that lets you complete a quest(Known in this game as a \"renown heart\".) that is catered to that playstyle. While all classes are designed for combat, there are still ways to get things done without ever killing an enemy. This can make for difficult leveling challenges, like playing the game with only crafted items, or leveling to 80 without killing a single enemy.\r\n\r\nAnother big part of my enjoyment comes from the exploration and zone design. There's the adage \"If there is a chest behind that waterfall the game is good.\" and it really sings here. Every map is multifaceted and littered with \"moments\" of exploration. From underwater cities where orca people live, to following a cliffside to a vista collectable that earns you a nice chunk of experience, to swimming into a small barely noticeable hole in a lake bed and finding yourself parkouring a bomb through a griffon nesting ground to explode a chest at the end.  Every map in the game has at least one big secret that isn't even remotely hinted at and gathering everything is super satisfying. There is even a tracker that takes stock of all of the collectibles on a map and rewards you handsomely for finding and completing everything.\r\n\r\nThis is a super basic primer of the content that is just in the base game, I have not even played the expansions yet. This is just the core base game experience.(It's a free game btw.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i'm fairly early on in the game, I have a bad tendency to make a character play for a bit, quit then come back delete my old character and start fresh.\n\nSo I'll spare you the details and tell you what sets it apart from other MMO's.\n- Base game is free, give it a try and see how you feel. The only thing you'll lose is your time and storage space.\n- The style is phenomenal with a painterly look to it. It is showing it's age now a days but what's underneath is what's important.\n- What's underneath is a great action combat MMO akin to Tera [rip] and a lot of polish on the core mechanics.\n- Big open world boss events, even in 'starter' areas.\n- Race choice puts you into a multi hour zone where your backstory affects the narrative, more involved than even OG WoW.\n- Buy once, subscribe never. Insane business model, but the mad lads have done it somehow.\n- Jump puzzles and random events keep things interesting. \n- Classes have so much diversity, changing weapons changes skills, then you have specs which can be multi classed with other skill trees.\n- Permanent progression. Practically the holy grail of MMO's, off the top of my head only runescape and adventure quest do this. You can leave your character and not play for years, come back and you'll be right where you left off and not behind the curve at all. A stark contrast to modern MMO's like wow where you miss the first few months and you're rushing to catch up or give up entirely until the next patch 5 months later. \n- Mount movement so great that Blizzard stole it. \n\nThe core idea behind this game and why people love it so much is how fair to the player it is and how despite not playing for long periods of time it's always there just waiting for you to come back and doesnt punish you for being away. The focus on horizontal progression where it's discovering things, doing jumping puzzles, fighting world bosses completely sets it apart from games that have a loot chase scene like wow. \n\nAs gamers we all know that we grind for months to get gear to do big numbers and then the mmo company rip it away from us, only to bump it progressively higher until they cant anymore. Then they squish everything down and repeat. This just feels bad. Guild Wars 2 has been drip feeding me gear, but it feels impactful on my character and I can rest easy knowing that if i stop for 6 months, at least when i come back I dont have to race to grind. I can just pick up where I left off and slowly make my character stronger, permanently. \n\nTL;DR\nGame gud. If want bigger number item, not for you. Like explore, game for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've heard about this game over the years as a casual MMO player but never really played until recently, so far I'm impressed with just the size and scope of the game and how much you can do. The gameplay is great and feels just right and not too World of Warcraft-like if WoW isn't your thing, every race in game has its own personal story that you have (some) shape over which comes up every 10 levels progressed (10, 20, 30 etc.) and adds an insane amount of replay value and options, but it has voice acted scenes so it is a silver lining. Another thing I've noticed was the community for the most part pretty welcoming and helpful if you have any questions. Personally, recommend buying this when it's on sale with just the base game and see if you like it first before fulling jumping in, although if you do, there is a pretty good amount of content to go through. One last thing is that the game respects the amount of time you put into the game, so far I haven't personally seen many instances of micro-transactions unless I actually go and look for it which is nice if you appreciate that. \n\nAll in all I'd say try it out if you want a pretty engaging MMO to sink some time into and just do everything at whatever pace you want without your hand held all the time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well developed game, you always have what to do in it , even if it is repeatable - you need it for something else. Community of the game is also very friendly :) love it. By far the greatest game I have ever tried.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "100% worth downloading! I used to play GW1 back in the day for hours on end, only recently downloaded GW2 as i was bored playing other games, im addicted already after 1 hour gameplay!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My actual hours are much greater than Steam says, as I only recently began tracking my hours for it with Steam.\r\n\r\nThis is the only MMORPG I have ever really enjoyed.\r\nIt boasts an interesting open world, well-written characters, engaging combat, and a horizontal progression system that means older content remains relevant, and there is no endless gear/level treadmill.\r\nOh, and no subscription fees, which means I can jump in and jump back out without feeling pressured into playing more when I don't really want to.\r\n\r\nIf you're scared off by most MMOs, give Guild Wars 2 a shot.\r\nI think you'll fall in love with it too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can say that it is the best game in the MMORPG genre. One of the most masterful games in terms of content. The map is very large and completely different from each other, and the charm of the world bosses is unparalleled. The most chill and friendly MMO game. In my opinion, it is even better than Warcraft. The story is extremely captivating and interesting.\n.میتونم بگم بهترین بازی تو سبک ام ام او ار پی جی. یکی از شاهکارترین  از نظر محتوا .مپ خیلی بزرگ که کاملن با هم فرق میکنن و جذابیت ورلد باس ها بی نظیره .چیلترین و فرندلی ترین بازی ام ام او .از نظر من از وارکرفت هم بهتره .داستان به شدت گیرا و جذابی داره",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a new player to Guild Wars 2, I've been really enjoying the experience. I've not had chance to explore the crafting or dungeons yet but the story and the combat feel really good and something I'm enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been a long time player, veteran. It may have older looking graphics and it takes a ton of your CPU but it's mainly the story and all of the other experiences that encourage me to keep playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played it before it was on steam. For anyone who wants to have that ONE game, this is it.\nA seperate World to sink in and forget real life.\n\n- A PvE enjoyer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from a WOW game, i absolutely love this game right now, its have best pvp and alive not like WOW i could find a pvp match for 30 minutes, best community and questing, rich in interaction with other players and constant map event you definetly dont feel alone here !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a pretty good MMORPG focused on horizontal progression\r\n\r\nIf the useless power grind with resets in WoW and FF14 annoy you and you are also tired of pure grind and/or p2w games, then this might be your game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I keep coming back to Guild Wars 2 over and over again. The world is beautiful and fun to explore. The story is great and keeps you going throughout the entire game. Also no monthly fee, so you can take your time and get lost in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came to this game form FFXIV and have been having a blast! Def would recommend it to anyone looking for a new MMORPG to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first mmo and this is amazingg frfr got some dlc to yyuh i want grindy game and this is perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game and an all time great of the MMORPG genre.\nThe best open world and exploration feeling I ever got, fantastic maps with things to find at every corner, challenging encounters and casual encounters to be found.\nA thriving and helpful community and just a great time to be had, no matter if you plan to play it a little or a lot. \n(I am at about 4000 hours played outside of Steam I believe, and I keep coming back to this)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After wandering through various MMORPG for a long time, I finally made my way to Guild Wars 2. And I have to say, it’s a breath of fresh air, even though the game is over ten years old.\n\nTo be honest, I’m still a complete beginner and haven’t reached the endgame yet, but my first impressions have been overwhelmingly positive. The most important, and perhaps key difference from other games in the genre is the lack of that frantic gear score race and endless grind. Sure, you won’t get those unforgettable thrills of being one of the first on the server to clear a dungeon or take down a world boss. But Guild Wars 2 isn’t about that. This game is about leisurely and thoughtful exploration of a vast, living world, about collecting, about variety. It gives you a sense of immersion in its story and gradually eases you into everything that’s happening, without unnecessary rush.\n\nWhat’s great is that nearly all the content remains relevant, and you can always find people heading to the same places you are. Oh, and the mounts—I just have to mention them separately—they are implemented on a whole other level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I tried playing this gane once for about an hour and felt overwhelmed by everything that was flashing at me on the screen.\nI came back to it this week and have had an absolute blast. I love this game. It's a lot of fun. I picked the Sylvari as my first race and the sassy gnome lady (I'm not good with names) keeps calling me various different houseplants 🤣 priceless. \n\nBonus: There is no monthly subscription. Those always make me feel obligated to play and then I get burned out. \n\n10/10 would recommend. It was worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing since 2012. The class design, gear, and play keep me coming back. I'm grateful that you can take breaks and come back without \"falling behind\". The living seasons were the best. My only complaint is that the story gets more woke by the year. ArenaNet, please keep your politics to yourself. Other than that, I love the game.\n\nI play on Linux using Proton without issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played this game for 15 minutes. I've played it for 12 years, actually. And this is the only MMO that I never put down for long enough to not pick it back up again. While it's not true that there was never a day when I haven't played this game, I don't think there was ever a month since its launch. This was and always will be the perfect online game for me, and I keep loving it and the day the servers shut down will be the last day I play a live-service game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've got 1100 hours in FFXIV. I thought THAT game was good (admittedly dying), but then I played GW2. My god. Players actually doing quests outside of town and NOT being a ghost world MMO, wayyy better story (imo), and significantly more ways to enjoy the game. Like, I genuinely want to run around and map complete everything because other random players are there doing the same things with me. \n\nTo give you my best memory yet, I was just running around completing a region map when I saw a random portal entrance with NO POI marker, so naturally I ran in and it turned out to be an event quest that involved pitch black jumping puzzles with monsters and traps. You had to essentially hold torches and use them to scare off the shadow monsters while navigating through the puzzle. I decided it was probably a little too much for me but when I went to turn around, another player walked in, and started spam jumping. We then spent 30 min dying to blind pitfall jumps, and after being gored by countless traps and horrifying enemies, we finished the puzzle and killed the dungeon boss. When we left the instance, we both /cheered and went on our separate ways. I felt like I had finally seen the light of what an \"social\" MMO SHOULD be. That was just ONE instance of the player interaction I've had in GW2 so far. There's so many others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With over 1,000 hours poured into the world of Tyria, Guild Wars 2 isn't just an MMO—it's one of my all-time favorite gaming experiences. From the moment I stepped into this vibrant world, I knew I had found a true gaming masterpiece that continually draws me back.\r\n\r\nWhat truly sets GW2 apart is its revolutionary approach to progression. The horizontal progression system is a breath of fresh air; unlike many other MMOs, you never feel like you’re miles behind the veterans. Once you hit the gear cap, your focus shifts to cosmetic achievements, alternative builds, and mastery points, ensuring that the time invested always feels meaningful, not obsolete. This system lets you truly enjoy the ride rather than rush to max level, though the leveling process itself flows quickly and naturally.\r\n\r\nThe community is genuinely one of the friendliest I've ever encountered in an online game. Time and again, I've met kind, helpful people who are always eager to assist new or returning players, making every interaction a pleasure. This helpful culture is central to the game's cooperative atmosphere.\r\n\r\nBeyond the friendly faces, the game’s core features are exceptional. I've fallen in love with the compelling story arcs and the sheer joy of traversing the landscape with the game-changing mounts. Even more engaging is the Structured Player vs Player (SPVP) system, which offers an exciting, competitive environment that feels perfectly balanced for quick, intense matches.\r\n\r\nFor a player like me, who takes regular breaks due to other games and real-life commitments, Guild Wars 2 is the perfect anchor. I always find myself returning, and thanks to the horizontal design, I never feel penalized for the time away. It’s a beautifully crafted world that respects your time and is a delight to come back to. If you’re looking for an MMO that’s competitive, welcoming, and endlessly fun, look no further—this is it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun if your into games similar to world of war craft. has a nice story line. might be a bit confusing at first but is easy to learn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun so far, but REALLY in need of accessibility options, which as far as I can tell it has none of, besides increasing the size of the entire interface, and increasing (suuuuper slightly) the size of chat text to less teeny but still hard to see. FFXIV has more accessibility features, and it has nearly none itself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "more open world nice gameplay, graphics nice! not too repetitive great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool locations to explore, fun mechanics, awesome mounts and decent storyline to follow. Fun and convincing enough for me to invest time and justified amount of money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I write this review with over 1700 hours on the clock (played it well before it was released on Steam).\nThis is a game, that respects your time - the grind is there, but you never lose what you have grinded for. It is not invalidated by a new patch and a wave of new ilvl items, making your current gear obsolete. You can take a two year break from the game, then just pick it up at exactly the same moment you left it. Just jump back in and have fun.\n\nGuild Wars is a franchise super close to my heart. Over the years I've grown accustomed to the world and the characters. First with the OG Guild Wars and now with Guild Wars 2. The game is definitely not perfect, but it is a solid MMO experience, with a really good story, mechanics and art style. The gameplay is exploration driven - not quest based, unlike other MMOs - which is in my opinion very well executed and holds its position on the MMO market even up to this day.\n\nArenaNet still continues to support the game with new expansions and I believe it is a worth title to pick up and play - especially with core game completely free to play ^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good mmo has the best world events of any mmo I have played. Story and pve content are developed very well, WvW is some of the funniest pvp you will play which compliments gw2 combat system over all a solid mmo if you looking for a good mmo to call home",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game and the fact you dont have to be subbed to it just buy it and get access to a lot of content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing. I have been looking for a game like this for ages. Questing around the world, lots of content, great music, so many different classes and builds. Loving it, give it a try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, really love the live event style of missions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game sets a new gold standard for MMOs. I cannot bring myself to play any other major MMO because I feel like I've been spoiled with this game. They all just feel outdated by comparison. Even newer ones that have come out after this one. I don't see why they don't copy more from this game. 99.8% server uptime since launch. No server maintenance due to a patch or expansion launch. No kill stealing, everyone gets exp and loot. Horizontal progression, you can new abilities instead of just becoming strong at max level. Evergreen content everywhere, meaning every expansion is still worth buying and playing, none of it is obsolete or can be soloed because you're over-leveled. Open world bosses that bring hundreds of players together. Skill based PvP without worrying about gear. Huge open world full scale warfare like PvP, capturing castles and forts, securing supply lines and cutting off the enemies. NO SUBSCRIPTION! You can stop playing for years and come back right where you left off, no having to grind for new gear! Plus, even though there's a cash shop, you can exchange in-game gold into cash shop currency meaning you can buy these items without spending real world money.\n\nCertainly, the game is not without its faults. The cash shop can be excessive in some areas (the game is not pay to win, just some pay for convenience things like inventory slots or infinite use items). Some balance issues and long waits between major patches. There's a long list of things that I could complain about, but they're smaller compared to how much this game gets right. Most of these complaints are out of love, not hate for this game. I want to see this game succeed.\n\nI have yet to find an MMO that does the Massively Multiplayer better, than Guild Wars 2, and I hope more people will see this game's success and learn from it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a former WoW player of about 10 years, I found this game to be a lot of fun in the same realm of WoW but much for affordable.  I am still learning about the game and the way it works but I am finding it familiar in a good way.  After 48 hours I am finding it very addictive and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated MMO imo, lots of content, no endless vertical progression or reset or fomo, just hop on and play whenever you want, quit for years come back and not have to regrind for new gear. Game has an extensive cash shop with cosmetic or convience items, but you can buy and earn everything in it for free by trading gold for cash currency, events, and daily/weekly rewards. \r\nGame can be overwhelming with amount of activies but once you learn everything its rewarding. Its a good as a casual mmo, but also offers stuff for pvpers or raiders, world pvp reminds of planetside 2, skill based arena pvp. Exploring world is fun finding random caves with chests and puzzles. This is probably the best mmo for people who dont have alot of time to play games. i think in the long run, guild wars 2 will outlast most mmos just from the way its designed. Even if they release guild wars 3 eventually, guild wars 1 is still getting support and i imagine guild wars 2 will as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highest Recommendation! \n\nHaving a blast in this game. Very similar to World of Warcraft but different races and lore. \n\nI will say, the gameplay is more engaging since there is a dodge roll. I died probably 10-15 in my 100 hours during PvE content. (loads more in PVP!) Dying isn't a big deal usually, just need to respawn at a checkpoint or warp stone nearby, no penalty really. I wouldn't say it's a lot harder than other MMORPGs, but you will need to focus a little more than just spamming auto-attack and standing there like I've experienced in other similar games. \n\n+The jump puzzles are very fun\n+The mounts feel great to ride (they have movement abilities) \n+Good, campy fantasy story that made me look forward to the expansions.\n+Level-balanced 5v5 PVP from level 1 of the game! (World.vs.World PvP at level 80 is gear-dependent) \n+Gems (in-game premium currency) can be purchased with Gold (in-game regular currency)\n+At 100 hours, I feel like I'm just getting started, with 6 more DLCs of MSQ to play through and lots of fun stuff to unlock. \n\nMONETIZATION:\nA big draw for me is that there are no subscription fees, not even optional ones. Progression feels good and it isn't tied to whether you have an active sub or not, as is the case in many MMORPGs.   \n\nThe free-to-play content is pretty big, took me about 50 hours to get through the base game MSQ with one character.\n\nI bought the 2-pack DLC (the Thorns and Fire one) because it unlocks mounts permanently. If you play on the free version, it's going to give you a mount for 10 hours then you have to walk it if you don't get the DLC. There is fast travel and abilities that make you get temporary speed boosts, but the mount is much more efficient and keeps things moving along. \n\nThere is very limited bag space, so you likely eventually want to purchase more inventory slots if you play longer. There is a shared bank tab which is cool. \n\nAll together, the game would cost you about $230 to get all the DLC expansions and \"Living Worlds\". (*At FULL Price. ~$160 on sale) The Living Worlds are story expansions in between the core Expansions that contain vital info to cover the gaps.  This would be everything you would need to play the past decade of story content and likely thousands of hours across several alts.  \n\nBuying the DLCs will also get you some extra character slots as well. They have also given me 1 level 80 boost for each expansion I purchased, so I now have 1 level 80 main and 3 lvl 80 alts. \n\nConvenience costs... There are several of these that can definitely be frustrating but not prohibitive. Inventory space is extremely limited if you don't get any of the starter packs in the store. I spent and extra $55 get all three of these (a $10, $25, and $30) These aren't completely necessary but they make my bag and bank space feel much less claustrophobic. It includes a unbreakable tool kit and unlimited salvager that eliminated the annoying chore of resupplying those items. \n\nSO, $300 total (assuming full price) and I'd say you never need to spend another dollar in the game. This is pretty good imo considering how much there is in it and no subscription fees.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "May have TTV in the name, but thats only because I stream one of my 6 accounts for Guild Wars. \nOk besides that my hours alone across the 6 differ, I like to say my numbers would possibly be in 10k+ over since beta of GW2. \nI even used to make build guides for Guild Wars 1, ran people through missions, ran people to towns they needed for FREE because why? I am a nice guy who thought people who sold their services were over confident in themselves. Each run I've done on that game was deathless\n\nAlright back to point of this review. The core game is one massive Tutorial. The Real fun begins with Living World 1(aka Scarlet's War). Yes the story took dives but that's what makes it fun to play. Guild Wars 2 actually caters to casuals and hardcore people alike. Sometimes there's FOMO, but not every time. So Play it now for an hour or two to even see if you like it. If you don't have an interest in it now, that's fine. There will be an itch to try something new in an old game. with that being said #AshDoesNotForget",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unsure how to word it. old and getting older.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game does get boring after playing for to long, its more fun in short stretches. Good content great story lines. thoughtful grinds not always worth doing if not for the feeling of achievement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game and lots of depth to even the base game!  Devs clearly spent a lot of time creating the game from each environment to quests its very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming back to the game after many years. Super generous with the free content in the game and doesn't require a subscription to play. I'm impressed by this in this day in age of MMOs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can believe i spent 6 years of my childhood playing warcraft when this game exists. Absolute PEAK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best MMO I've played to this point. Special respect to world designers, what they done is just stunning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guild Wars 2 has honestly become one of my favorite games. There’s just so much to do that I never feel bored. Every time I log in, I end up finding something new — a map I haven’t fully explored, a collection I forgot about, a meta event happening somewhere, or just random players doing stuff together.\n\nWhat I love most is that the game doesn’t stress me out. I can play at my own pace, try different builds, roam around, or jump into big fights when I feel like it. The world feels alive, and the combat is fun without being overly complicated.\n\nEven after years of updates, the game still has a ridiculous amount of content, and it keeps getting better. If someone wants an MMO that respects your time and gives you freedom in how you play, Guild Wars 2 is honestly one of the best you can pick up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New to MMO.  14 hours in and having a blast. The free to play seems to have a ton of content.  Of course, Its the week of Thanksgiving so the bundle for Heart of Thorns and Path of Fire went on sale for $12.  I bought it in anticipation that I will be spending a lot of time on this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is more than 10 years old and still a lot of fun ! The game is really complete and there comes regularly new updates and extensions. A must play :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took me a couple of times to understand the style of MMO GW2 is but other then that GREAT game. Would def say play this game! Just be aware it's not like MOST MMORPGs with it progression. Which I think is one of it's main strengths.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game that just respects your time and money. No chasing after gear that is made worthless every 3 months and a story that rivals the other big story MMO's. The devs are not afraid to try new things in their expansions and learn from their mistakes. \r\nGreat community and great for players that maybe not have the most time to play but still wanna play a MMO.\r\nI played it since launch outside of steam and I can only say 10/10 recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best MMORPG game i have ever played. After quitting WoW this game rekindled my love for this type of games. It gives the the exact experience that i am looking for from an MMORPG. Immersive story with rich character building. And the horizontal progression compliments the entire game by making it not sweaty for grinding, not making me race for time to grind the best gear now, cuz after half a year i would have to do it again. I played for 200 hours then quit for 2 months and have been doing it like a couple of times now and i never felt like i was falling behind. I never felt being weaker because of time away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some of the best open world gameplay in the MMO genre. On top of that every single thing you do basically gives progress to your entire account - not just a single character.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Based game story is alright nothing to exciting, map exploration is great there are so many secrets to be found and jumping puzzles to do; and the expansion are very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Beautiful environments, love the progression style in this. Great for casual mmo players!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Started playing in 2025, been more than half a year of engaging MMO experience. Amazing open world play, easily join many other players in World Bosses and events. Visually beautiful for its level of graphic technology. Environments are well designed, compact and don't feel too empty between spaces. Having played FFXI, WoW and FFXIV before, Guild Wars 2 is the most engaging and fun for me. Older maps are still active due to events and achievements for players to complete. The community is great too! Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had a hard time finding a game that's easy on the eyes especially since I'm over 60, some graphics make me sick. Very smooth and easy to comprehend the approach of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.  Lots of activities to keep you busy chasing carrots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just overall a great experience. Find myself coming back to it time and again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like it so far , it seems structured where if i get busy with work i can come back to it later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played GW2 in the early days and I just couldn't get the hang of it. Now its a great game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried this game out recentaly and it is really good, especialy with how crap more MMORPGs are nowdays this is a nice change of pace for me to play and enjoy that is not money hungry. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game that doesn't invalidate your progress or purchases every 4 to 6 months like every other MMO.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only MMO I come back too. Love the world, love the community. Great game. Have 1000s of hours outside of Steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So, what can i say that has not already been said, the game its different, i had multiple attempts at playing it throughout its life, it never stuck to me. Now i've reach max lvl on one character, really one hard decision as classes are not so conventional. But what im trying to say its that the game seems to be relevant, and i enjoyed my time with it, even at max lvl without spending a anything on it it feels good to play, community seems nice and helpful. And i can just say im waiting for tomorrow to play again, which is a feeling i have not had in a long time. Alot to collect alot more to discover, so im overall happy with my experience and looking for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bestest of the best MMORPG out there. Huge varieties of content for solo and community gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game with so much to do and so much fun, a must play 100%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying this MMO. First played Guild Wars 20 years ago and finally came back. Great storytelling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great people, fun community to join and explore with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who casually plays MMO's but doesn't have the time to really dedicate endless hours this is perfect. Play as you go, years worth of content to sift through. The combat is good. Set your own goals. What else could you ask for",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Approaching 80 and the expansion content with five characters. Looking forward to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, played it over 8 years ago when it first launched and started again recently this year and it has exceeded my past expectations way beyond how i previously remember the game.\r\n\r\nThe overall progression is great with plenty of things to keep you busy, dungeon systems are solid with good dailies, DLC maps are some of the best ive ever played especially HoT with its tricky but rewarding terrain.\r\n\r\nComing from playing WoW this feels so much more engaging and progression feelins meaningful whilst also being relaxed and not to sweaty constantly chasing bigger numbers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, limited character customisation but great game only for people that have a lot of time to spare aka being unemployed. Graphics aren't bad but could be better i know this is a decade old game. Great voice soundtracks.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Didn't even know what the fuck living worlds is until hours into the game. \r\n\r\nBought the Starter Expansion Pack (HoT PoF), thought it would have money waived off from the Elder Dragon Saga pack. \r\n\r\nSteam tells me you gotta buy the Elder Dragon Saga pack full price, doesn't waive off the money from something I already bought. \r\n\r\nWas not aware complete living worlds seasons can be bought in Elder Dragon Saga, and buying it there saves you $10 compared to buying it through gems in game.\r\n\r\nWhy is no one talking about this trap???? Not a single content creator talked about this????",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "No one ever talks about the monetization of this game. It tries to have it's premium expansion-model cake AND a slice of free-2-play pie at the same time.\n\n\"B-buh No Subscription\" you probably hear repeated ad-f$$king nauseum. And that's all you ever hear people talk about. No mention of the huge array of pay-for-convenience features in the cash shop, like infinite gathering tools, bank and inventory and crafting ingredient inventory expansions, etc, etc...\n\nAnd especially no one ever mentions the Living World Seasons, which any other MMO would include under the patches for a given expansion. You'll note that they're not shown for sale here on steam. Nah, you have to get 100hrs deep and hit level 80 before you realize that to continue the story in the proper order that it was told, your expansion/DLC purchases mean nothing, shell out for the individual season as a separate $$$ purchase. Or you could skip it and miss out on swathes of content as well as story.\n\nApparently the LW seasons were given for free to people who were there when they released, which I'm sure was nice if you didn't Miss Out. Funny how people say this game has no FOMO.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I used to love this game, but year-over-year cash grab for mediocre expansions that never drop in price leave me feeling like monetization is now more important than player satisfaction.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is fun and has really good mech and specs for pve it is very fun and balanced. But the UI and some of the lack of customization for how you want to see health bars and boons and conditions ( Buffs and Debuffs  ) is really bad. If you come from wow it will drive you crazy, but if you can look pass that then its a really fun game. PVP is really not as good as GW fan boys will say, just to use a specific weapon or spec you need to pay for it, and of course  if you like the game and want to buy the expansions for some elite specs and the spear go ahead but playing core specs like corer Elementalist you have no chance in PVP especially against some of the Paid for Elite specs, also way to much CC ( crowed control ) and one shotting. overall game is beautiful but if you want it for PVE its amazing but PVP its a no for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The interface is crazy compared to other games and I was unable to find a way to make it so I could read the objectives or anything else even with the interface set to \"larger\" (as large as it goes) and text set to \"large\" -- needs to be able to make text more legible on high res monitors!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is super smooth and fun to play. Mounts in the game are also amazingly done and overall style of the game is beautiful. \nBut...\nthe main story, including the expansions stories are just the worst I have had to endure in any game I have played.\nBasiclly character you meet are making there own problems and it is you job to babysit a group of idiots contiunesly, and dialogs are just to long... plenty of times has the game wasted my time but just doing nothing but listen to some idiot talk for 10-20min without any gameplay. and then you do walk for 15sec and another 10min rant about something or another... I Think guild wars 2 would have been a much better game if they just remove the main story all thoughter. And last bosses are allways just some gimic slob, no challenge or difficulty. \nIt is a shame, because the gameplay is super fun and really good, do bad that game wants to be a walking simulator with garbage story about characters that nobody cares about.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would not recommend playing this game on Steam simply because you cannot redeem any codes for your account. Instead, download the client and play through the launcher.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck you and your fucking \"account verification\" basically ruining the game till 5 days after buying expansions for no reason. The worst thing i have ever seen in any game ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not even work. This is one of those games that although you mange it through steam, it has it's own game client. That game client seems to hate steam. I couldn't get the game to even launch - the client would get stuck signing into steam and then if it somehow got past that it would just sit there indicating there was a still a bunch of files to download but downloading nothing. Maybe this is something you can troubleshoot but for me it's a turn off if you start encountering technical issues like this before you even get into game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hours i have played on steam do not reflect the hours i have played this game for, adding steam was a fairly recent thing for me, and its only counted the hours since i linked steam to the game. im an early player, i still have a CD of gw2 in a pc game hard case, i have been playing this game for absolutely ages and i can say with no doubts that the most recent DLC to purchase (VoE) gave the guardian class the most uncreative content i have seen since Tera and its gear treadmill. the new subclass is so bad i have decided to play something else, arenanet does not care about how you feel or your opinion, and its sad because they use to care about how their game is, or was. now its just a place to exist while they ignore you 100% of the time and then on the forums they will ask for your opinion, then ignore your opinion too. luminary eliite spec for guardian is trash and arenanet 12 years ago would have never let garbage be paid for. but times have changed and the age of MMORPG games is coming to an end. the creative employee's clearly got fired from arenanet and it shows.  this game has continued to stay as popular as it is for as long as it has because the original teams in arenanet cares about the players, those days are gone and people come to play this game for the 10+ year old content. once people reach the newer stuff they stop playing. and now its my turn.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just got the game and I can't even play. Finally got it installed so i go load it up launcher pops up and its updating. Got the update to 100% and when i click on ready nothing happens so I type in a display name i would like to use within rules for name click the submit button nothing happens. Close launcher and restart same issue. Uninstall and reinstall? Same issue. Nothing works for a work around. Finally decided to make an account on their website just to find out you cant link accounts so now to play this stupid game i have to for the windows version to install to see if i have better luck there. DO NOT BUY FROM STEAM!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game however there's long standing bugs (I'm talking years) like disconnects during long story missions that resets all the progress and blocks story progression completely. I'm now stuck on content I've paid for. Absolutely embarrassing behaviour from Arena Net to not fix something like this after 7 years. I can't recommend a game with such blatant technical problems no matter how much fun it can be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really old looking game. Too many confusing menu's to operate and unexplained things. The game tries to teach as you went, but you are flooded with so many things you don't know about it is very frustrating to deal with. I really like'd the first game but something about this one is just kind of meh. Like one of those free to play games I downloaded as a kid, bombarded with store items, flashy cosmetics and really simple game play. Would probably be more inclined to get invested if the game didn't already have so many systems, objectives and features. I'm sure the current player base enjoys all these things but as a new player I cannot and will not. I have similar issues like this when it comes to FF14 and now WoW. I'm sure there are thousands of hours worth of content for a good price, but it doesn't feel fun to play catchup for a couple thousand hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i just dont understand this game,i cant even build characters...too hard for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The pvp down system is the dumbest thing I’ve ever experienced idk what idiot thought it would be competitive to damage people while you’re downed, and self revive, no wonder this game is just full of PvE players the Pvp system is a joke and just full of the top players who have thousands of hours \n\nDont play this game for PvP unless you plan to zerg with 100 people or spend thousands of hours in the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am someone that doesnt care much about the story, I skip most of it, but I find the game to be pay to win in the PvP, ritualist is one of them, but there is always one guy in a game that you wonder \"how the fck do they do so much damage\" or \"how does he do that\", tentatively hover over their class and notice, that they have a paid DLC class.\n\nLastly, I dont care how much copium this community is on, if you pay and win because you pay, it's pay to win, yes it's not as egregious as other games, but a piece of turd is still a piece of turd, even if you baked it well. \"You should buy the dlc too\" and join said pay to win, no amount of mental gimnastics can explain the brain lobotomy that one has to undertake to even say that, yet some people say that, it's sets bad example for the game dev to release more and more broken classes, and milk the player for incremental or substantial power creep, hidden behind a pay wall, which is pay to win.\n\n\"Maybe git gud and learn to play the game, noob\" I would, if I could play the class and see what the combos are, so I can think of a counter in that combo, but that still requires for me to pay for the expansion, to unlock the said class, so I can even have access to that information.\n\nThe combat seems responsive and despite my prior statement, I do enjoy the PvP 5v5, but it doesnt inspire much confidence to buy further expansions.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't play this for pvp. Classes are super unbalanced and devs listen to who is crying the loudest on the official forums. Some classes are played by the devs themselves and are therefore immune to any nerfs while other classes get obliterated (multiple skills nerfed by 60%+ and additional utility nerfs etc.) literally one week after the new expansion released. Nice bait and switch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kinda old, Looks graphically outdated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game play was honestly to generic, button binds wouldn.t change, and the graphics were rough,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Living season 1 is set to impossible difficulty, the rest of the content is fine. Rott in hell non communicative with the community developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont mean to hurt anyone but even the first Guild Wars Graphics were better- instantly uninstalled\nfelt like a complete waste of my time wouldnt spend any cash on it, Glad some people found a liking to it but you can cross me out BAH! anyone looking for a better graphic MMO Great combat and storyline- >BDO the game is grindy and just as good as it looks I would give them money just for looking good and giving me the chance to look like a super hero kicking butt, Installed GW2 just to get disappointed. Just saying, you could have worked on the graphics from GW upgraded it hard and you would have people knocking on your door just to upload another skin, kept the same concept of GW skill usage 1-8 and worked on a more interesting story line which was a pretty strong storyline to begin with even with the releace of Nightfall/Nord expantion, than making a whole new game that looks like World of Warcraft on meth. Absolute waste of my 77mins ingame byeee- hope you will look better in the future wait for Gw5 at this rate Damn! even BDO is out earlier than 2022 still upgrading and earining people by the second! god knows what the whole hype about this game is I just dont see it! even World of Warcraft is worth re-playing as p2p or runescape thats saying something!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game needs an expansion to play comfortably, you'll got a free trial mount but mounts is needed for this game as the map is so huge.. NOT RECOMMENDED FOR PLAYERS WHO LIKES FREE TO PLAY.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont forget the character names of the specific character you made otherwise you will never be able to play your game again without making a brand new email address to use to play the game. Evil trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Selling items are difficult via market. There are a lot of wasted items that cannot be sold anywhere. That causes to get less money for buying other stuff in game. Others are good. Auto target lock on is annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is so dumb to purchase parts of game or maps inside of it while there's hundreds of mmorpg that are totally free. Cosmetics should be the only thing you must pay to access them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "after a certain point you get a notification that pops up demanding you spend a mastery point that you are trying to save for what you want. this pop up blocks chat and pops up with any earned xp point. this broke gameplay for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Guild wars 1 was one of the best games that I have ever played. Guild wars 2 has shown the companies true colors. They create a huge map (good thing), give you a mount that you can use to traverse the map to get between your missions (which usually take 5-10 minutes using your mount to get to. CATCH! The mount is only temporary and then is locked behind a $40-ish paywall. Leaving you with the only option of spending 20 minutes WALKING between your missions. Nothing like having 30 minutes to play, spending 10 minutes updating the game before getting in and then 20 minutes to your mission, then not having time to play since you spent 30 minutes just bored holding down the w button. Nice colors GW2. You are definitely not out to exploit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah am good , this game is stupid and not fun and paywall like i have to get dlcs and some are just lock it in stupid way ftp are not going to have fun after they know , what a waste of time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It has been awhile and I'm not even sure I want to play GW2 again. \n\nIf it has changed for the better and not the same old same old...well enuf said.\n\nLettuce C?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2]= Wasted Potential =[/h2]\n\n[b](Note; My total playtime across Steam and the ANet launcher is somewhere between 3,000-4,000 hours.)[/b] \n\nThis game is a very mixed bag; There’s a lot that GW2 does well, some that it does very poorly, and most that it doesn’t do anywhere near as well as it should.\n\nI’d like to delve deeply into each topic, but due to Steam’s odd character limit, I’ll have to condense some 60 pages of thoughts into just a couple.\n\nLet’s get into the list:\n\n[h3]The Good;[/h3]\n[b]+ Amount of Content[/b] - There’s a lot of it, even if you don’t buy any of the expansions. Months to years worth.\n[b]+ Sense of Progression[/b] - In most MMORPGs the sense of progression comes from your character becoming stronger, meaning that you’re essentially watching numbers go up. In GW2, progression takes place mainly through the unlocking of masteries, which open up functions, abilities, movement types etc. Everything from a gryphon doing its best impression of a F-16 fighter jet, to a beetle that really wishes it could be in a Need For Speed game - masteries unlock some truly awesome stuff that simply change how you play the game.\n[b]+ Aesthetics[/b] - Everything from the gear you wear, to the architectures of the different cultures, is very well-designed. This doesn’t mean that there are no occasional oddities, but the vast majority of the time, things look great.\n[b]+ Audio[/b] - The OST is awesome, the voice work (audio quality-wise) is stellar and the SFX is likewise great.\n[b]+ Quality of Life Features[/b] - You can save builds for your characters, as well as gear loadouts to match them. Auto-sort for better inventory management. Shared bank space. Account-wide masteries. Account-wide friend/block-lists. On and on the list goes.\n[b]+ UI[/b] - It has a few issues, granted, which mainly pertain to the low visibility of some procs - but outside of minor stuff like that? The UI is perfectly fine. GW2’s UI does not  require any significant fixing on the player’s behalf, unlike some other MMOs I could mention.\n[b]+ Meta Events[/b] - These are a lot of fun and, by far, the best in the genre. Not that there is much competition out there.\n[b]+ World vs World[/b] - This is a “open-world”-ish PvP mode, where three factions duke it out on large open maps. This mode is by far the best PvP I have experienced since the Hillsbrad Foothills era of Vanilla WoW. I’ve spent months doing nothing but playing WvW endlessly, day after day. And I’m not even a PvPer at heart. \n\n[h3]The Bad;[/h3]\n[b]- Writing[/b] - It’s positively fucking atrocious. Several magnitudes worse than “decent”. From character motivations, to the lore presented to you, to the voiced dialogue - Almost all of it sits somewhere between insufferable, illogical, brain-dead and annoying. Why people do what they do makes no sense, why you’re told to do what you’re doing makes no sense, why most of the situations in the game even arise to begin with makes no sense. Even your character - the Commander - makes no sense; You give no commands, have no say in the decision-making, or strategy, or tactics of any given scenario. Exceptions? Few and far between. You’re not playing a commander - You’re playing a slave. Put simply; This is a game that waterboards you with nonsense as a reward for caring to read and listen to what it has to say.\n[b]- Story[/b] - The Personal Story (Base Game) part of the story is tolerable. Not great, but tolerable. That stuff is from 2012. So, as you play through it, you’ll think to yourself; “Wow, this is pretty good for something that's 13 years old! All the newer stuff must be even better!” Dead wrong. Post base game, GW2 has - by far - the worst story I have ever had to play through. Worse than FFXIV, ESO, and even WoW. The story content of GW2’s expansions should be classified as cruel and unusual punishment by the UN, forced upon only the most evil of human beings as a form of torture. Every hour you spend playing through this absolute garbage, you’ll feel like the game hates you for playing it, hates you for having bought it, hates you for even bothering to pay attention to it. It’s painful to such a degree that I ended up having to take week-long breaks from it, before I could stomach doing another chapter.\n[b]- Community[/b] - People will tell you that GW2 has one of the nicest communities in the MMO genre. What they won’t tell you, is that most of the time said “niceness” is fake, that honesty is scarce, that the overwhelming majority of the people in this game can’t handle criticism and thus are either unable or unwilling to improve. Most Meta Event leaders are on some kind of a power trip, most serious WvW squad leaders are paranoid Discord cultists, and most of the playerbase in general consists of remarkably fragile people. It’s a very strange sort of ecosystem.\n[b]- Combat[/b] - The targeting is weird beyond belief, no matter how you customize it. Several builds rely on procs/buffs that you can barely see or pay attention to, mid-combat. Content, story or otherwise, is designed to ensure that one of two states is almost always true; Either you are crowd controlled/debuffed, or; Things go invulnerable/teleport out of reach. Skills can have very strange hitboxes at times, especially in situations where the Y axis is involved. In short; Combat, in this game, feels like an inconvenience designed to piss you off at nearly every turn.\n\n[h3]The Ugly Conclusion;[/h3]\nGW2 is simultaneously the MMO that has impressed me more than any other, while also being the greatest disappointment I’ve ever experienced in this genre.\n\nThe core issue is that the things that GW2 fails to do well, makes no sense for it to fail at. There’s no reason why the story has to be written like trash, year after year. There’s no reason why targeting has to remain an illogical mess. There’s no reason for why characters must be insufferable and annoying. There are no good reasons that I can think of, even in an abstract hypothetical, for why these things must necessarily be of such low quality.\n\nWhereas the 13 years after its release should have seen GW2 steadily improve at everything that it does, this has not been the case; Some things have been improved (QoL, Masteries, Specs), some things have gotten worse (Writing, Story, Wold Building), and some have been flat out neglected and ignored (Threads filled with people asking for fixes to technical issues that have gone ignored for over a decade).\n\nGW2 is a mess - A statement that applies to pretty much every MMO out there, yes, but one that has never been so bitter a thing to say about an MMO until GW2.\n\nI'd ([i]generously[/i]) rate this game a 5.5/10 - A solid 7/10 when it's at its best, and an abysmal 3/10 when it's at it's worst. A tremendous waste of exceptional potential.\n\nIf Steam ever increases the character limit tenfold, I’ll be more than happy to come back here and add the dozens - if not hundreds - of details that these topics, good and bad, deserve.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Id rather play either ESO or WOW. It's alright but not my cup of tea",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is not good for pvp. trash af meta that dont get balanced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope. Childish. Not my sort of thing. Recommended by someone who said it's amazing. Not for me it isn't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Arenanet support is an absolute joke. fuck them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just not my cup of tea. It's a lot like World of WarCraft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bought one xpac got exactly what i wanted bought another one got lied to... 50/50 trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cmc is a hack, game is held back by his trash tier balance choices",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lack of native controller support is deal breaker for me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT USE STEAM VERSION IF YOU WISH TO LOGIN USING ARENANET ACCOUNT.\r\nIF YOU USE -PROVIDER PORTAL, THE GAME WILL FORCE DOWNLOAD THE ENTIRE GAME\r\nThat mean you will have to download in total 146 GB, NOT 73 GB.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to enjoy Guild Wars when there were people to play with, I left for a few years and when I came back I tried to join a guild which took forever and then when I finally got accepted into a guild I was kicked overnight so they could make room for one of their friends, it now seems to be very clique-ish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "steam deck guild wars 2 has encountered an error...... what is the problem",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "40-50fps at the start of the game on a 5950x, no thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The skimmer's Slipstream Nerf was the last straw.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "esta plagado de jugadore con cronus",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stupid main story quest",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "You might like it, it's just not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just seems like your typical like MMORPG.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring beyond all comprehension.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its ok",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "does not work on deck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So let me start by saying I would recommend this game despite giving it a thumbs down. I'm only giving it a thumbs down cause I would not recommend buying it through STEAM. I played Guild Wars 2 years ago, and decided to pick it up again when I realized it was added to STEAM. I was excited when I realized I could use my old account. However, I realized that is a huge problem when it came to buying the DLCs. I bought the Path of Fire and Heart of Thorns bundle. Eager to experience new parts of the game since I hadn't ever played any of the DLCs before. However, if you are playing Guild Wars 2 through steam with an account you originally made through Arenanet, yet buy the DLCs through STEAM they you will be screwed. You will not be able to access the content. You need to buy the DLCs through Arenanet to be able to play them. STEAM will not refund it for me cause I have played the game more than 2 hours. I had made a new character, and so obviously I didn't get to the point where I would experience the new content within two hours before I realized this mistake. I had to buy the DLC AGAIN through Arenanet to play it. So for those who come after me, if you are playing with an old Arenanet account but playing on STEAM. DO NOT BUY DLCS ON STEAM FOR THIS GAME, YOU WILL GET SCREWED.",
      "voted_up": false,
      "votes_helpful": 189
    },
    {
      "review": "I played on the ANet launcher.\n\nI enjoyed certain aspects of the game like the world itself, jumping puzzles, and all the mounts. I found the combat, story, pvp, recent expac content, and instanced content bad or mediocre. No one really talks about the QoL problem that ANet has created here though, and it's what ultimately made me shelf GW2.\n\nWhy do I only get 5 character slots after spending $180 dollars on all the expansions and living world seasons? I can't even make one character per class with that, as there's 9 classes in the game. GW2 is constantly throwing hundreds of crafting materials, event items, and random trash at you, so why is my inventory, material storage, and bank space so Infinitesimally small? \n\nSo they can annoy you into spending money in the cash shop.\n\nBag slots, bank slots, extra material storage, shared inventory slots, mistlock pass, reusable salvage machines, reusable teleport devices, unbreakable gathering tools, account services, boosters, build templates, lootboxes, mountains of cosmetics (with way more effort put into them than the free cosmetics), and more, are all available on rotation in the FOMO inducing cash shop. A lot of this stuff is only bound to the character you bought it on, btw.\n\nYES you can buy these items by converting ingame gold into gems, though working at McDonald's and swiping your card to buy gems is going to be 1000% more time efficient. Spending your $1 an hour amount of gold you farmed on the cash shop means that you're going to hinder your legendary weapon progress just so you can buy QoL. GW2's endgame made me feel like my ultimate goal was just grinding gold to get account features, which isn't what I want to be working towards in an MMO. It's all a gold sink.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "Didn't even know what the fuck living worlds is until hours into the game. \r\n\r\nBought the Starter Expansion Pack (HoT PoF), thought it would have money waived off from the Elder Dragon Saga pack. \r\n\r\nSteam tells me you gotta buy the Elder Dragon Saga pack full price, doesn't waive off the money from something I already bought. \r\n\r\nWas not aware complete living worlds seasons can be bought in Elder Dragon Saga, and buying it there saves you $10 compared to buying it through gems in game.\r\n\r\nWhy is no one talking about this trap???? Not a single content creator talked about this????",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This game started out amazing but just kept progressively getting worse with terrible story writing. Janthir Wilds was the final straw. Absolute trash.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "No one ever talks about the monetization of this game. It tries to have it's premium expansion-model cake AND a slice of free-2-play pie at the same time.\n\n\"B-buh No Subscription\" you probably hear repeated ad-f$$king nauseum. And that's all you ever hear people talk about. No mention of the huge array of pay-for-convenience features in the cash shop, like infinite gathering tools, bank and inventory and crafting ingredient inventory expansions, etc, etc...\n\nAnd especially no one ever mentions the Living World Seasons, which any other MMO would include under the patches for a given expansion. You'll note that they're not shown for sale here on steam. Nah, you have to get 100hrs deep and hit level 80 before you realize that to continue the story in the proper order that it was told, your expansion/DLC purchases mean nothing, shell out for the individual season as a separate $$$ purchase. Or you could skip it and miss out on swathes of content as well as story.\n\nApparently the LW seasons were given for free to people who were there when they released, which I'm sure was nice if you didn't Miss Out. Funny how people say this game has no FOMO.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "while playing i keep getting notifications on the side and when i look it is just ads trying to sell me the expansions.  I would by them when ready but i detest being pestered about it when playing.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I used to love this game, but year-over-year cash grab for mediocre expansions that never drop in price leave me feeling like monetization is now more important than player satisfaction.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Everything is almost locked behind a paywall, even if you buy all expansions you will still need to buy some episodes which is fucking insanity. You can have some fun leveling tho. However what killed the vibe and the game for me is their pathetic and retarded customer support service, the GM's handling support requests are a fucking joke too.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Game is fun and has really good mech and specs for pve it is very fun and balanced. But the UI and some of the lack of customization for how you want to see health bars and boons and conditions ( Buffs and Debuffs  ) is really bad. If you come from wow it will drive you crazy, but if you can look pass that then its a really fun game. PVP is really not as good as GW fan boys will say, just to use a specific weapon or spec you need to pay for it, and of course  if you like the game and want to buy the expansions for some elite specs and the spear go ahead but playing core specs like corer Elementalist you have no chance in PVP especially against some of the Paid for Elite specs, also way to much CC ( crowed control ) and one shotting. overall game is beautiful but if you want it for PVE its amazing but PVP its a no for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The support is a joke. No matter what you write, you always get the same pre-written reply that doesn’t fit your issue at all.\nIt’s like talking to a wall — they don’t even bother to check your case properly.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Uninspired everything. Boring art style, horrible dialogue. Stupid opening. Spent two hours running around being everyones bitch and I couldn't even ask for proper payment. I don't care about your wasp problem, why am I cleaning your stupid tower, who even are you why do I care? So dull, unbelievably boring. If that is the best they can do to draw me in, that is bloody pathetic. At least it was free. I would never pay for this.\nDon't recommend. Find a better game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Look, PvP in this game is beyond trash.\nCompared to WoW:\n1. Instead of class-specific buffs, debuffs, there are so-called \"boons\" and \"conditions\" - the same across all classes! You have no clue who, what, when cast.\n2. Awful UI. Few-to-none settings. Names, nameplates are small and color palette is poor. You take time to understand what even your target is - Is it a player, a downed player, a pet or even a mob - Is it a player you want to target or one that is behind?! You click on an enemy player and you aren't even sure what the hell you just selected.\n3. No mods to replace this garbage.\n4. WvW, compared to WoW's BG, is a mount simulator. There are no cemetries and you have to run across whole massive battleground again. The more ground you gain, the more time you waste on travel in case of death.\n5. Weapon swap and different stances are pain because there is no way to see what abilities are ready. You only see abilities for your current weapon or stance.\n6. Turning circle of a mount - An in-game horse simulator. What a brilliant idea!\n7. Action bars are laggy. Sometimes when casting a sequence of spells, it turns out that some spells haven't been used.\n8. Unlocking talent (skill) tree requires you to complete Hero challenges. They are easy but scattered all over the game map and aren't account-wide. Each time you create a new hero, you have to visit them all again. It is a microtransaction bait as they sell them in the store.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have 2,000 hours on their official launcher, not on steam. The positives are combat (the best of all mmos), pve content (mainly open-world), and transmutations/cosplay stuff.\n\nAnyways this game is quite bad and frustrates me with the amount of potential it wastes at every turn. The multiple problems this game has include:\n\n- A lot of content is fine but all of it is just farming simulators and becomes boring real quick. You eventually stop caring about the content and just want gold to buy more shit like gems to buy store items (some of which are really god damn stupid like build templates that aren't account wide, just for that character), shit to make more money, gen 1 legendaries, etc. It ends up feeling like you are making money to EVENTUALLY have fun...\n\n- Gem store prices are garbage (sales make it not as bad but still). $5 for 400 gems, with 500 being for that specific character's equipment template meaning you have to buy 100 more gems/exchange gold for gems JUST FOR 1 template. Also build templates, inventory slot increase as well (inventory can be increased like with the quickplay fractal event) and character slot which cost 800 gems. You can farm gold into gems, but you will burn yourself out/get bored on gold farming methods.\n\n- Gem store prices for cosmetics/skins is not only bad, they are also time-gated, meaning you have to wait months to a year for them to reappear. Also something I hate is armor being sold as a set. If I want a hat from a set, you have to buy the whole thing. It sucks when I'm trying to make my own sets.\n\n- Half-baked and abandoned content. Dragon response missions, pvp and ESPECIALLY wvw are abandoned. WvW is one of their best and most unique gamemodes, and yet they have done NOTHING with it for more than a decade. And when they did add to WvW like world restructuring and nerfs (while leaving stealth untouched and completely cancerous), it did not help the gamemode and even made it worse in some regards.\n\n- Continuing with WvW, you have toxic players and guilds running around making the game unenjoyable, insufferable professions/elite specs, Bm asshats, griefers/trolls, garbage mechanics (defending is completely worthless/pointless), god damn spawn camping, etc. Players have asked for changes for a decade and the devs ignore it... \n\n- Community is fairly toxic, though early game it's good. Part of it is due to timed events, sweaty tryhards and devs that don't give a shit about scummy players/guilds (which is why in-game reporting does nothing. Tickets seems to do more? But still). Expect drama, politics, trash-talking/bm, toxicity, weirdos, trolling, etc.\n\n- Not being able to move skills around. You can bind keys/buttons, but not skills. For example on Gun warrior, the 4 skill evades backward. I despise it and wish I could place it on 5 WITHOUT screwing up my other skills with other weapons.\n\nMore minor problems include: \n\n- Bugs that range from funny (animation glitches) to annoying (builds not switching during wvw, having to use a skill to get out of combat, texture glitches)\n\n- Story, characters and voice acting. Sometimes it's ok/good (not great), other times it's complete garbage. Drizzlewood for example has god awful voice acting/direction, and Secrets of the obscure's story is just weird and bad (mainly the 2nd half). The rest I'm not invested in/don't care.\n\n- Characters are kind of ugly/lack choices (unless you use gems and even then the selection isn't great). And weird proportions like male Norns being freaks, or human legs are scrawny even when you choose a bulky look.\n\n- Maps can be frustrating like enemy placements/enemy attacks. PoF expansion has enemies that will knock you off your mount a lot, HoT has high damage enemies, etc.\n\n- Wiki. All of it. Event timers, where to get items, how to get to different areas/maps, explaining wvw, etc.\n\n- Item variety. Only a few modern caps/hats, pants being based on specs (light has cloth-based leggings, medium being just tight pants, heavy has mostly plated skirts), the selection is so bad even with so many damn armor pieces.\n\nOverall there are just so many problems that you will feel after awhile. And WvW absolutely pisses me off and showed me the devs don't really care about the game outside of pve, which is boring at times. They throw so many ideas at the game then drop them immediately. It frustrates me as it could be so good/the best but it does everything it can to ruin itself. \n\n\nAt least it's f2p/doesn't have a subscription so if you are on the fence about it you can play it. But man it has so much garbage aspects that start to wear down my enjoyment of the game. Devs do better god damn it",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Combat with elite specs is too much busy work that lacks intuitiveness.  \n\nWay too many currencies and varying types of vendors.  Quite confusing.\n\nCrafting is pointless and expensive.   There seems to be no rewards for doing such a laborious activity.  Might be the worst crafting I have experienced in these types of games since you don't use anything you make unless you have maxed out the profession.  (which will likely take real money to convert gems into gold to do so)  (it's also much cheaper to just buy the same items with gold than it is to actually craft them...which is weird)\n\nOverall atmosphere of the game is great.  Some elements seem fun and original.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "PROS:\n\n- The game is kinda fun when you hit level 10 and get a free mount trial, although it's short-lived since it's taken away 10 hours later and you're hit with \"Spend $25.99 on an expansion to continue riding your mount.\", so I guess this is technically not a pro.\n\nCONS:\n\n- Saying the customer support is F tier is an understatement.\n- Constant barrage of microtransactions at every turn.\n- Uses all the popular manipulative tactics like FOMO and pay-for-convenience traps.\n- Several features are broken, abandoned, or unfinished.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The interface is crazy compared to other games and I was unable to find a way to make it so I could read the objectives or anything else even with the interface set to \"larger\" (as large as it goes) and text set to \"large\" -- needs to be able to make text more legible on high res monitors!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is super smooth and fun to play. Mounts in the game are also amazingly done and overall style of the game is beautiful. \nBut...\nthe main story, including the expansions stories are just the worst I have had to endure in any game I have played.\nBasiclly character you meet are making there own problems and it is you job to babysit a group of idiots contiunesly, and dialogs are just to long... plenty of times has the game wasted my time but just doing nothing but listen to some idiot talk for 10-20min without any gameplay. and then you do walk for 15sec and another 10min rant about something or another... I Think guild wars 2 would have been a much better game if they just remove the main story all thoughter. And last bosses are allways just some gimic slob, no challenge or difficulty. \nIt is a shame, because the gameplay is super fun and really good, do bad that game wants to be a walking simulator with garbage story about characters that nobody cares about.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would not recommend playing this game on Steam simply because you cannot redeem any codes for your account. Instead, download the client and play through the launcher.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck you and your fucking \"account verification\" basically ruining the game till 5 days after buying expansions for no reason. The worst thing i have ever seen in any game ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not even work. This is one of those games that although you mange it through steam, it has it's own game client. That game client seems to hate steam. I couldn't get the game to even launch - the client would get stuck signing into steam and then if it somehow got past that it would just sit there indicating there was a still a bunch of files to download but downloading nothing. Maybe this is something you can troubleshoot but for me it's a turn off if you start encountering technical issues like this before you even get into game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hours i have played on steam do not reflect the hours i have played this game for, adding steam was a fairly recent thing for me, and its only counted the hours since i linked steam to the game. im an early player, i still have a CD of gw2 in a pc game hard case, i have been playing this game for absolutely ages and i can say with no doubts that the most recent DLC to purchase (VoE) gave the guardian class the most uncreative content i have seen since Tera and its gear treadmill. the new subclass is so bad i have decided to play something else, arenanet does not care about how you feel or your opinion, and its sad because they use to care about how their game is, or was. now its just a place to exist while they ignore you 100% of the time and then on the forums they will ask for your opinion, then ignore your opinion too. luminary eliite spec for guardian is trash and arenanet 12 years ago would have never let garbage be paid for. but times have changed and the age of MMORPG games is coming to an end. the creative employee's clearly got fired from arenanet and it shows.  this game has continued to stay as popular as it is for as long as it has because the original teams in arenanet cares about the players, those days are gone and people come to play this game for the 10+ year old content. once people reach the newer stuff they stop playing. and now its my turn.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just got the game and I can't even play. Finally got it installed so i go load it up launcher pops up and its updating. Got the update to 100% and when i click on ready nothing happens so I type in a display name i would like to use within rules for name click the submit button nothing happens. Close launcher and restart same issue. Uninstall and reinstall? Same issue. Nothing works for a work around. Finally decided to make an account on their website just to find out you cant link accounts so now to play this stupid game i have to for the windows version to install to see if i have better luck there. DO NOT BUY FROM STEAM!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game however there's long standing bugs (I'm talking years) like disconnects during long story missions that resets all the progress and blocks story progression completely. I'm now stuck on content I've paid for. Absolutely embarrassing behaviour from Arena Net to not fix something like this after 7 years. I can't recommend a game with such blatant technical problems no matter how much fun it can be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really old looking game. Too many confusing menu's to operate and unexplained things. The game tries to teach as you went, but you are flooded with so many things you don't know about it is very frustrating to deal with. I really like'd the first game but something about this one is just kind of meh. Like one of those free to play games I downloaded as a kid, bombarded with store items, flashy cosmetics and really simple game play. Would probably be more inclined to get invested if the game didn't already have so many systems, objectives and features. I'm sure the current player base enjoys all these things but as a new player I cannot and will not. I have similar issues like this when it comes to FF14 and now WoW. I'm sure there are thousands of hours worth of content for a good price, but it doesn't feel fun to play catchup for a couple thousand hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i just dont understand this game,i cant even build characters...too hard for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The pvp down system is the dumbest thing I’ve ever experienced idk what idiot thought it would be competitive to damage people while you’re downed, and self revive, no wonder this game is just full of PvE players the Pvp system is a joke and just full of the top players who have thousands of hours \n\nDont play this game for PvP unless you plan to zerg with 100 people or spend thousands of hours in the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am someone that doesnt care much about the story, I skip most of it, but I find the game to be pay to win in the PvP, ritualist is one of them, but there is always one guy in a game that you wonder \"how the fck do they do so much damage\" or \"how does he do that\", tentatively hover over their class and notice, that they have a paid DLC class.\n\nLastly, I dont care how much copium this community is on, if you pay and win because you pay, it's pay to win, yes it's not as egregious as other games, but a piece of turd is still a piece of turd, even if you baked it well. \"You should buy the dlc too\" and join said pay to win, no amount of mental gimnastics can explain the brain lobotomy that one has to undertake to even say that, yet some people say that, it's sets bad example for the game dev to release more and more broken classes, and milk the player for incremental or substantial power creep, hidden behind a pay wall, which is pay to win.\n\n\"Maybe git gud and learn to play the game, noob\" I would, if I could play the class and see what the combos are, so I can think of a counter in that combo, but that still requires for me to pay for the expansion, to unlock the said class, so I can even have access to that information.\n\nThe combat seems responsive and despite my prior statement, I do enjoy the PvP 5v5, but it doesnt inspire much confidence to buy further expansions.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't play this for pvp. Classes are super unbalanced and devs listen to who is crying the loudest on the official forums. Some classes are played by the devs themselves and are therefore immune to any nerfs while other classes get obliterated (multiple skills nerfed by 60%+ and additional utility nerfs etc.) literally one week after the new expansion released. Nice bait and switch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kinda old, Looks graphically outdated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game play was honestly to generic, button binds wouldn.t change, and the graphics were rough,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Living season 1 is set to impossible difficulty, the rest of the content is fine. Rott in hell non communicative with the community developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont mean to hurt anyone but even the first Guild Wars Graphics were better- instantly uninstalled\nfelt like a complete waste of my time wouldnt spend any cash on it, Glad some people found a liking to it but you can cross me out BAH! anyone looking for a better graphic MMO Great combat and storyline- >BDO the game is grindy and just as good as it looks I would give them money just for looking good and giving me the chance to look like a super hero kicking butt, Installed GW2 just to get disappointed. Just saying, you could have worked on the graphics from GW upgraded it hard and you would have people knocking on your door just to upload another skin, kept the same concept of GW skill usage 1-8 and worked on a more interesting story line which was a pretty strong storyline to begin with even with the releace of Nightfall/Nord expantion, than making a whole new game that looks like World of Warcraft on meth. Absolute waste of my 77mins ingame byeee- hope you will look better in the future wait for Gw5 at this rate Damn! even BDO is out earlier than 2022 still upgrading and earining people by the second! god knows what the whole hype about this game is I just dont see it! even World of Warcraft is worth re-playing as p2p or runescape thats saying something!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game needs an expansion to play comfortably, you'll got a free trial mount but mounts is needed for this game as the map is so huge.. NOT RECOMMENDED FOR PLAYERS WHO LIKES FREE TO PLAY.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont forget the character names of the specific character you made otherwise you will never be able to play your game again without making a brand new email address to use to play the game. Evil trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Selling items are difficult via market. There are a lot of wasted items that cannot be sold anywhere. That causes to get less money for buying other stuff in game. Others are good. Auto target lock on is annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is so dumb to purchase parts of game or maps inside of it while there's hundreds of mmorpg that are totally free. Cosmetics should be the only thing you must pay to access them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "after a certain point you get a notification that pops up demanding you spend a mastery point that you are trying to save for what you want. this pop up blocks chat and pops up with any earned xp point. this broke gameplay for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Guild wars 1 was one of the best games that I have ever played. Guild wars 2 has shown the companies true colors. They create a huge map (good thing), give you a mount that you can use to traverse the map to get between your missions (which usually take 5-10 minutes using your mount to get to. CATCH! The mount is only temporary and then is locked behind a $40-ish paywall. Leaving you with the only option of spending 20 minutes WALKING between your missions. Nothing like having 30 minutes to play, spending 10 minutes updating the game before getting in and then 20 minutes to your mission, then not having time to play since you spent 30 minutes just bored holding down the w button. Nice colors GW2. You are definitely not out to exploit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah am good , this game is stupid and not fun and paywall like i have to get dlcs and some are just lock it in stupid way ftp are not going to have fun after they know , what a waste of time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It has been awhile and I'm not even sure I want to play GW2 again. \n\nIf it has changed for the better and not the same old same old...well enuf said.\n\nLettuce C?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2]= Wasted Potential =[/h2]\n\n[b](Note; My total playtime across Steam and the ANet launcher is somewhere between 3,000-4,000 hours.)[/b] \n\nThis game is a very mixed bag; There’s a lot that GW2 does well, some that it does very poorly, and most that it doesn’t do anywhere near as well as it should.\n\nI’d like to delve deeply into each topic, but due to Steam’s odd character limit, I’ll have to condense some 60 pages of thoughts into just a couple.\n\nLet’s get into the list:\n\n[h3]The Good;[/h3]\n[b]+ Amount of Content[/b] - There’s a lot of it, even if you don’t buy any of the expansions. Months to years worth.\n[b]+ Sense of Progression[/b] - In most MMORPGs the sense of progression comes from your character becoming stronger, meaning that you’re essentially watching numbers go up. In GW2, progression takes place mainly through the unlocking of masteries, which open up functions, abilities, movement types etc. Everything from a gryphon doing its best impression of a F-16 fighter jet, to a beetle that really wishes it could be in a Need For Speed game - masteries unlock some truly awesome stuff that simply change how you play the game.\n[b]+ Aesthetics[/b] - Everything from the gear you wear, to the architectures of the different cultures, is very well-designed. This doesn’t mean that there are no occasional oddities, but the vast majority of the time, things look great.\n[b]+ Audio[/b] - The OST is awesome, the voice work (audio quality-wise) is stellar and the SFX is likewise great.\n[b]+ Quality of Life Features[/b] - You can save builds for your characters, as well as gear loadouts to match them. Auto-sort for better inventory management. Shared bank space. Account-wide masteries. Account-wide friend/block-lists. On and on the list goes.\n[b]+ UI[/b] - It has a few issues, granted, which mainly pertain to the low visibility of some procs - but outside of minor stuff like that? The UI is perfectly fine. GW2’s UI does not  require any significant fixing on the player’s behalf, unlike some other MMOs I could mention.\n[b]+ Meta Events[/b] - These are a lot of fun and, by far, the best in the genre. Not that there is much competition out there.\n[b]+ World vs World[/b] - This is a “open-world”-ish PvP mode, where three factions duke it out on large open maps. This mode is by far the best PvP I have experienced since the Hillsbrad Foothills era of Vanilla WoW. I’ve spent months doing nothing but playing WvW endlessly, day after day. And I’m not even a PvPer at heart. \n\n[h3]The Bad;[/h3]\n[b]- Writing[/b] - It’s positively fucking atrocious. Several magnitudes worse than “decent”. From character motivations, to the lore presented to you, to the voiced dialogue - Almost all of it sits somewhere between insufferable, illogical, brain-dead and annoying. Why people do what they do makes no sense, why you’re told to do what you’re doing makes no sense, why most of the situations in the game even arise to begin with makes no sense. Even your character - the Commander - makes no sense; You give no commands, have no say in the decision-making, or strategy, or tactics of any given scenario. Exceptions? Few and far between. You’re not playing a commander - You’re playing a slave. Put simply; This is a game that waterboards you with nonsense as a reward for caring to read and listen to what it has to say.\n[b]- Story[/b] - The Personal Story (Base Game) part of the story is tolerable. Not great, but tolerable. That stuff is from 2012. So, as you play through it, you’ll think to yourself; “Wow, this is pretty good for something that's 13 years old! All the newer stuff must be even better!” Dead wrong. Post base game, GW2 has - by far - the worst story I have ever had to play through. Worse than FFXIV, ESO, and even WoW. The story content of GW2’s expansions should be classified as cruel and unusual punishment by the UN, forced upon only the most evil of human beings as a form of torture. Every hour you spend playing through this absolute garbage, you’ll feel like the game hates you for playing it, hates you for having bought it, hates you for even bothering to pay attention to it. It’s painful to such a degree that I ended up having to take week-long breaks from it, before I could stomach doing another chapter.\n[b]- Community[/b] - People will tell you that GW2 has one of the nicest communities in the MMO genre. What they won’t tell you, is that most of the time said “niceness” is fake, that honesty is scarce, that the overwhelming majority of the people in this game can’t handle criticism and thus are either unable or unwilling to improve. Most Meta Event leaders are on some kind of a power trip, most serious WvW squad leaders are paranoid Discord cultists, and most of the playerbase in general consists of remarkably fragile people. It’s a very strange sort of ecosystem.\n[b]- Combat[/b] - The targeting is weird beyond belief, no matter how you customize it. Several builds rely on procs/buffs that you can barely see or pay attention to, mid-combat. Content, story or otherwise, is designed to ensure that one of two states is almost always true; Either you are crowd controlled/debuffed, or; Things go invulnerable/teleport out of reach. Skills can have very strange hitboxes at times, especially in situations where the Y axis is involved. In short; Combat, in this game, feels like an inconvenience designed to piss you off at nearly every turn.\n\n[h3]The Ugly Conclusion;[/h3]\nGW2 is simultaneously the MMO that has impressed me more than any other, while also being the greatest disappointment I’ve ever experienced in this genre.\n\nThe core issue is that the things that GW2 fails to do well, makes no sense for it to fail at. There’s no reason why the story has to be written like trash, year after year. There’s no reason why targeting has to remain an illogical mess. There’s no reason for why characters must be insufferable and annoying. There are no good reasons that I can think of, even in an abstract hypothetical, for why these things must necessarily be of such low quality.\n\nWhereas the 13 years after its release should have seen GW2 steadily improve at everything that it does, this has not been the case; Some things have been improved (QoL, Masteries, Specs), some things have gotten worse (Writing, Story, Wold Building), and some have been flat out neglected and ignored (Threads filled with people asking for fixes to technical issues that have gone ignored for over a decade).\n\nGW2 is a mess - A statement that applies to pretty much every MMO out there, yes, but one that has never been so bitter a thing to say about an MMO until GW2.\n\nI'd ([i]generously[/i]) rate this game a 5.5/10 - A solid 7/10 when it's at its best, and an abysmal 3/10 when it's at it's worst. A tremendous waste of exceptional potential.\n\nIf Steam ever increases the character limit tenfold, I’ll be more than happy to come back here and add the dozens - if not hundreds - of details that these topics, good and bad, deserve.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Id rather play either ESO or WOW. It's alright but not my cup of tea",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is not good for pvp. trash af meta that dont get balanced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope. Childish. Not my sort of thing. Recommended by someone who said it's amazing. Not for me it isn't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just not my cup of tea. It's a lot like World of WarCraft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Arenanet support is an absolute joke. fuck them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bought one xpac got exactly what i wanted bought another one got lied to... 50/50 trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cmc is a hack, game is held back by his trash tier balance choices",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lack of native controller support is deal breaker for me",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}