{
  "positive": [
    {
      "review": "[h1]Review After 100% Completion[/h1]\n\n[h2]Recommendation: Recommended[/h2]\n\n[h3]What I Liked (Pros):[/h3]\n+ Movement and gunplay are phenomenal, grapple hooking, gliding, sliding, and chaining it all together feels buttery smooth. It’s easily the best-feeling Borderlands game to date. Even spawning your vehicle and riding through the open world feels awesome, fast, responsive, and reminiscent of Destiny’s Sparrow in the best way.\n+ Open world and sandbox design are a huge win. The verticality, traversal options, and sheer scale make exploration genuinely fun.\n+ Skyboxes are jaw-dropping, especially in the second half of the game. The celestial vistas in zones like Dominion and Terminus Range are unforgettable, [spoiler] especially the moment you ride the sky lift into orbit, and the haunting beauty of the area where you find Lilith. [/spoiler] Those visuals were next-level.\n+ Gun customization is wild. Mixing and matching manufacturer parts creates an insane amount of weapon variants to chase, it’s loot heaven.\n+ Customization is excellent. Tons of skins and colour options for your character, guns, vehicle, and Echo (your little personal robot). Unlocking them through challenges and mission completions feels earned and rewarding.\n+ Side quests are surprisingly excellent. There’s a ton of them, and most feel meaningful. Some even outshine the main missions. Standouts include:\nEscape Room – A puzzle-heavy mission that rewards observation and lateral thinking.\nMeat Is Murder – A twisted culinary mystery in The Fadefields.\nVend of the Line – A noir-style investigation in Carcadia Burn.\nAbduction Injunction – Alien conspiracy meets bureaucratic chaos.\nNo Place Like Home – Emotional and eerie, set in a shifting dreamscape.\nClaptrap’s Contractual Crisis – Classic humour and surprisingly heartfelt moments.\n+ Story is solid. It’s second only to Borderlands 2, and let’s be honest, nothing’s ever going to top Handsome Jack.\n+ Villains like Calous and Vile Lictor are far more memorable than the main antagonist, Timekeeper. They steal the show.\n+ Faction design is a big step up. The Outbounders and Electi are way more interesting than anything we got in Borderlands 3.\n+ Boss mechanics are genuinely impressive. Some fights rival Destiny 2 in complexity, it’s not just “stand on a plate.” You’ve got multi-phase encounters, environmental hazards, and puzzle-like mechanics that keep you on your toes. It’s a huge step forward for the series.\n+ No in-game shop. No microtransactions, no premium cosmetics, everything is earned through gameplay. It’s refreshing and makes progression feel meaningful.\n\n[h3]What I Didn’t Like (Cons):[/h3]\n- Performance issues crop up way too often, especially in high-density combat zones and open-world traversal. For how the game looks, which, yes, is a visual step up from Borderlands 3, it still shouldn’t be running at 40–60 FPS. It’s a cel-shaded game, and the frame drops are brutal. Spawning your vehicle and riding through the open world causes massive dips, especially after long rides.\n- Endgame content is thin. Once the story wraps, there’s not much to keep you grinding beyond loot.\n- Timekeeper is forgettable. As the main villain, they’re overshadowed by stronger side antagonists.\n- UI and inventory management still feels clunky, especially when sorting through hundreds of weapon variants.\n- Multi-character progression is a mess. You can boost a new character to level 30, sure, but everything else? You’re stuck redoing the same grind. Map fog doesn’t carry over, so you have to re-explore every zone. Gun manufacturer challenges and faction reputation, none of it is account-wide. It’s exhausting. If you want to experiment with builds, the game punishes you for it.\n\n[h3]Wishlist – Things I’d Love to See Added:[/h3]\n[list]\n[*] Endgame Raids or Dungeons – High-level co-op challenges with unique loot and mechanics would give players a reason to stick around. \n[*] Performance Optimization – The game should run better without relying on AI upscaling tools like DLSS or whatever Randy suggested — especially since those features are only available on 4000-series GPUs and above. A cel-shaded Borderlands game shouldn’t need cutting-edge hardware to maintain stable frames. \n[*] Expanded Faction Systems – Reputation, perks, and faction-specific gear could deepen engagement. \n[*] More Traversal Challenges – Parkour puzzles or time trials using the movement system would be a great addition. \n[*] Account-Wide Progression – Map fog, challenges, and reputation should carry across characters. Let us grind once, not five times.\n[/list]\n\n[h3]Achievements:[/h3]\nMost achievements are pretty manageable and can be earned just by playing through the game and exploring thoroughly. There’s a bit of grind if you’re going for 100%, but nothing outrageous, except for one: getting all Vault Hunters to level 50 and unlocking their vehicles. That one takes serious time.\n\nThere are also two missable achievements to watch out for:\n[list]\n[*] All Things Vend – Can be missed if you don’t follow the correct steps during the “Vend of the Line” side mission.\n[*] Rift Incompatible – Requires interacting with Oddman’s frozen body at the end of “Exit Through the Rift Shop.” You only get one shot at it — no replay.\n[/list]\nAnd yes, difficulty-based achievements exist. Reaching Ultimate Vault Hunter Rank 5 (UVH5) is one of them. It’s tied to post-game progression and requires pushing through increasingly tough enemies and bosses. It’s not brutal, but it’s definitely a challenge. The grindy ones are listed below.\n[list]\n[*] Catch-A-Ride - Collect all personal vehicles, to get these you will need to reach level 50 on all vault hunters.\n[*] Area of Expertise - Complete any Gear Challenge category.\n[*] Grassroots Campaigner - Complete all side missions.\n[*] Brand Equity - Complete any Manufacturer Challenge category.\n[/list]\nThe rest of the list is pretty chill, you’ll knock out most of them naturally as you complete zones, finish missions, and collect along the way.\n\n[h3]Memorable Quotes:[/h3]\n[list]\n[*]“Well if it isn’t my favorite…… it’s you”\n[*]What? Oh, yeah! Followed the safety manual for flinging people over the void to the letter, I did!\n[*]\"wait, why am I buying your shite\"\n[*]\"Tips welcome - money, not advice.\"\n[*]\"You'll never get me plucky arms!\"\n[*]\"You keep talkin' to me - you know I'm a HOLOGRAM, right?\"\n[*]\"Oh, what a mighty Vault Hunter! ...and you're here too.\"\n[*]\"One man's junk is another man's... junk. But hey - CREDITS!\"\n[/list]\n\n[h3]Final Thoughts:[/h3]\nBorderlands 4 is the most mechanically refined game in the series. The movement system alone, with its grapple, glide, and slide, makes traversal and combat just feels really fun. It’s the first time I’ve felt truly free in a Borderlands game, and the open world complements that beautifully.\n\nThe story doesn’t quite reach the heights of Borderlands 2, but it’s close. Timekeeper is a weak link, but Calous and Vile Lictor more than make up for it. The factions are richer, the world more alive, and the side quests are genuinely some of the best content in the game.\n\nPerformance issues and a lacklustre endgame hold it back from perfection, but the core experience is so strong it’s easy to forgive. That said, the multi-character grind is a real buzzkill. If they want players to experiment with builds and alts, they’ve got to make that process smoother. Right now, it feels like punishment for wanting to try something new.\n\nStill, Borderlands 4 proves the franchise has evolved in all the right ways. If they build on this foundation, the next entry could be legendary.",
      "voted_up": true,
      "votes_helpful": 219
    },
    {
      "review": "The game is really fun, lot of stuff to do, but... it kinda doesn't feel like a borderlands game.",
      "voted_up": true,
      "votes_helpful": 107
    },
    {
      "review": "Hands down, the best Borderlands since BL2 and the best shooter this year.\n\nI was super skeptical before release, cringed hard at their marketing campaign, and had zero plans to touch this game. But an empty November for new releases pushed me to buy it, and I haven't regretted it for a second.\n\nThe main thing is the upgraded movement and gunplay - it's just freaking fantastic. Zipping around arenas is lightning-fast and lets you pull off wild tricks with double jumps, dashes, and slides mid-fight. I absolutely adore combat systems like this (similar to what you find in Echo Point Nova and Doom Eternal).\n\nThe new gun randomization system so cool. It's not just random guns from one manufacturer anymore; there's a deep parts system where a component from one manufacturer, like a reloading system, can end up on a gun from another manufacturer. This is fire! You can get completely insane combinations, and it's awesome.\n\nThe loot drop system is still too random and doesn't take your character or class into account, dumping tons of useless gear on you. You can definitely run into the classic problem humanity created back in the Diablo 2 days, where enemies get noticeably stronger as you level up, but you don't get any decent gear. I struggled a bit around level 42+ until I stopped and intentionally farmed a boss for the gear I needed.\n\nThe open world itself feels like a mix of Diablo 4 and Far Cry. Yeah, it's an open world with points of interest, and the map is completely packed with content, but there are also world events - a boss can spawn, or a global event with better rewards can kick off.\n\nThere is an extreme amount of content in this game. Most of the side quests, and there's a shit-ton of them, are written well. Yeah, most of them are comedic and reference old memes. The main story campaign tries for serious drama but flies right past your ears because of how cliche it is.\n\nOverall, my impressions are only positive. The game is low-stress and doesn't demand heavy time investment. You can easily drop it for a week and then just as easily pick it back up and continue.\n\nAs for optimization, not sure what the problem was, it was probably worse at launch, but on mid-tier hardware, I have no issues. Over 100 FPS on high settings, and the game looks damn good. I don't know if it uses hardware RT, but the lighting in the game looks absolutely magnificent.\n\nCons:\n1) No option to set Claptrap's volume to 200%.\n2) Upcoming DLC with new regions, THE MAP IS ALREADY BLOODY HUGE",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "Is Borderlands 4 worth the price?  Yes, I believe so based on the value of cost versus hours played so far.  But, because of Pitchford's pre-release comments about the cost and his comments after release in reference to the (obviously) poor game optimization, blaming gamers and their computers for that, I almost didn't buy the game.  The weekly patches and optimizations have the game running much better.   In my opinion the end game was suffering from lack of content and things to do, but the recent patch adding daily challenges (Vault Cards), etc., will help for sure.  For me, I feel that I definitely got great value from the game for the hours that I have played so far, 625 hours and counting.  Above everything else, did I have fun playing the game - absolutely!  Is there enough new added content and future content that will be added to keep me playing the game?  We'll see...",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "I quite enjoyed BL4, gunplay and movement is the best in the series. I enjoyed the open world but with SDU's being linked with collectibles it gets repetitive with new characters. The story is inoffensive, like a 7/10 but has a few plot holes. \nIf you are able to run this game (it has terrible performance currently) I would recommend either getting this game on sale at least 50% or wait a while for dlcs and updates to come out, as post story content is very dry at the moment.",
      "voted_up": true,
      "votes_helpful": 42
    },
    {
      "review": "I'm a big fan of Borderlands, but this Borderlands is a bit weak at the moment.\r\n\r\nThe game has potential, but it still needs work, especially in terms of optimization. Even after the latest update, the game only runs on low settings, considering that I have a computer with the required specifications.\r\n\r\nI recommend the game, but not at the price they're selling it for. Wait for a discount or a price drop (which seems impossible).",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fun game to play solo or with Friends, I love everything about it honestly it's just straight up Fun.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Ok, I have had and played all the Borderlands Games. I have enjoyed them all, my favorite was Borderlands 2. I am starting to really think Borderlands 4 is going to be my favorite of the series. They have really stepped it up (more is needed). Two things will definitely make it my favorite, 1. Optimization this game takes a very very good GPU to run above 1080P. 2. Loot drops are to RNG and major missions do not have a good loot drop. \nThere are many BOSSES and lots to do, the world is very large with many places to look for things to do. The ENDGAME is a little Underwhelming.\nAll these can and should get fixed soon, If that happens this will be a great Game. Right now it is just a Good game. Even in this state it is crazy Fun with good co-op, the mechanics are good and the game is worth your purchase.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "✅ Finally the story is so good, thank God they made it so much better after the disastrous story of BL3. I'm so glad they scrapped the existence of that stupid Ava girl\n✅ Massive open world to explore. I really loved this direction they've taken. No more traversing multiple areas and looking at loading screens\n✅ Gameplay is really fun. Hard mode gives you more reward with more challenge\n✅ Tons of collectibles to find\n✅ World Boss has been an excellent feature\n✅ Can summon vehicle anytime. A huge QOL feature they added\n✅ UI design is the best\n✅ Lots of challenges to complete\n✅ Movement is simply the best for an FPS game. Double jumping, Dashing, Air Dashing, Gliding, Slamming, Vaulting & Sliding - you name it and it's there. It can't get any better than this for an FPS game\n✅ So much more content than previous games\n✅ Sidequest are so good (although I hope they do more sidequest from other game like the Witcher they did)\n✅ Game is being constantly updated and a lot of things have been planned for release in future roadmap\n\n❌ ECHO-4 can get in the way of your firing scope when showing routes\n❌ A lot of progression system (example like the challenges) should be synced with other vault hunters to make it more enticing to play with other vault hunters\n❌ Comparison system needs an overhaul\n❌ Alt fire mode should not be automatically changed when empty (the reason is that I want to use that mode immediately when cooldown is over and it was extremely annoying trying to constantly change to it)\n❌ UI mods (from Nexus mods) like 'Always visible firmware' https://www.nexusmods.com/borderlands4/mods/172 and 'Directly display the module skill's maximum level and description as well as the weapon's secondary attribute' https://www.nexusmods.com/borderlands4/mods/171 should've been part of the game as I feel like these are an extremely useful feature\n❌ Respec should be free of cost, a lot of modern games have now moved to a flexible system that encourages to try out different things easily\n❌ Melee damage from weapon is not shown so there's no way to tell which gun has melee damage bonus\n❌ Needs more post-game content\n\nThis game is just a phenomenal improvement from previous entries, and I highly recommend to any fan of FPS games. There's no other game that can really compare with a looter shooter game like Borderlands",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The Borderlands pattern continues. The fourth installment has far and away they best mobility, gun play and characters. Each vault hunter has at least 2 meta builds, and playing them feels powerful and is very fun. The open world is a neutral topic for me, but I am surprised this trend isn't dead yet. Overall, I am recommending this game on it's gameplay solely.\r\n  The notoriously poor writing of the third game is not it fact gone, but simply shoved into the side quests. Playing a few and listening to the NPC dialogue instantly summons the \"white noise, power drill, swarm of bees, all at the same time\" feeling. It is not really present in the main story which is nice, but the writing there is by no means good. It honestly could have been written by almost anyone/anything. Most likely no one plays these games for the story/dialogue, but be aware that it is still bad and grating, if a little more scarce.\r\n  Honestly, the biggest downside to buying this game is supporting Randy and Gearbox. They'll be back to their same old tricks, you can be sure of that. If you don't care, grab a pal, slide that voice volume down to zero, and have a blast.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best gameplay in the series by far. It's a lot of fun and the story is solid. Already 460 hours in, as a casual...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I loved Borderlands 3, and hoped 4 would live up to what I came to expect. First impressions was that the game was extremely slow, lacking engaging story, empty environments with no depth or storytelling. Weapons were extremely disappointing, I couldn't believe that even after a fairly good chunk of gaming and farming I wasn't really blown away by the performance of any of the weapons. Although the Steam achievements look like a paltry 35 there is hundreds of challenges stuffed in there, some of which have proved to be extremely difficult (How can I play a world event that never shows up?) Even worse, these sometimes excruciating achievements don't even show up when completed! Not cool. I started out with Amon looking for a heavy playstyle but instead it took about 100 hours to even put together something satisfying to play. Now despite all this, it was still entertaining to see familiar faces like Moxxi, Zane, and all the hilarious NPC dialogue. It's a perfect co op game. I will say that the characters have their endearing sides, but the weapons drops are abysmal. It is nowhere near as enjoyable and fun to grind like BL3 but I'll keep playing in the hopes the bugs get ironed out.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's Borderlands 3.5, in all the best ways. Gunplay is even tighter than the previous, with \"quirkier\" weapons in gameplay terms. It is remarkably good in shaking up the act of clicking a mouse. So far no cringey characters Looks great and runs fine on my pc. Awesome game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's unfortunate that there's so many technical issues - because other than that, BL4 is a lot of fun.\r\n\r\nThe world is beautiful, the Vault Hunters are great, the tone of the game is more serious etc etc. It def doesn't deserve to get crap for things unrelated to it's performance, but I also won't be surprised if it won't be people's fav BL game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "https://steamcommunity.com/sharedfiles/filedetails/?id=3587023659 \n\n\n[h2]Borderlands 4 :\n[/h2]\n\n\nI have been waiting for a very long time and with hype Borderlands 4. In fact this is the first time pre-ordering an rpg game. \n\nWell first I didn't get the Gilded Glory Pack for pre-ordering, and I'm not the only one my husband didn't either.\nI still have the same co-op issues has before which means being disconnected for no reason in co-op I've always had this issues with all borderlands. Yet if I play any other game in co op it works perfectly.\nWe finally get some answers regarding certain characters, maybe more in future dlcs.\n\nI really like playing as siren on this one compared to BDL3, we finally get to fly and get a vehicule whenever we need to, you can also teleport to your co-op partner easily.\nThe bot tracker can be improved sometimes the way is not showing but this is definitely a bit more helpful that before. \nThe game run smoothly on my set up. \n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3586750662",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a very good game that fixes a lot of stuff about Borderlands that is quite lame, but you will want to wait for it to be on sale, because screw the base price.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun game, has some performance issues but since release is a lot better. Dialogue is a bit annoying; many instances where It's quite, then they put important dialogue in when there's a ton of shooting / loud noise. Also, sometimes I'll be listening to an echo dialogue which will then be interrupted by other dialogue; very annoying. \r\nStill fun all in all.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, lots of content even if it starts slowly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Now I’m going to compare Borderlands 4 with the other games in the series. I think it’s good that they’re moving more in the direction of an open world. It makes the world feel more connected than in the previous games. It’s fun to play through the main story and the various side missions. I also feel there’s more endgame content in the fourth game than before, even though some people say there isn’t enough to do once you’ve collected everything. I can partly agree with that.\nAnother issue is that much of what you collect with one character has to be collected again with a new one. Because of that, it feels like you get stuck with a single character if you want to complete everything. The world can also feel a bit empty once you’re done with the content.\nBut overall, it’s a very enjoyable game to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the best borderlands gameplay wise, story wise it's at least better than 3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Huge fan of the series, I really enjoyed the new installment and the features it brings.\n\nGameplay is well implemented. The movement is the most noticeable change for me. Combat feels more fluid with the new movement mechanics. Weapons with manufacturer/licensed parts are a nice bonus too, offering some great combinations.\n\nI was a little perplexed at first about the open map, but it fits the gameplay well. A good change.\nSDU mostly bind to collectibles is a bit annoying for new characters.\n\nMany improvements have been made to the UI, inventory management, and boss replayability, which are much appreciated.\n\nStory-wise, I like it. The main protagonist could have been a bit more badass, but it’s fine.\n\nPerformance-wise, it’s improving, but it does require a beefy setup :(\n\nThere are still a few improvements to be made here and there, but overall, I recommend this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am not sure what others are complaining about, but this is the game in the franchise that I am thoroughly enjoying (apart from BL1 and BL2 obviously). To put things into perspective I have already spent nearly 170 hours, and am yet to complete all activities and missions in my first Vex playthrough - and I intend to do that for all VHs.\n\nGranted, I am running a system with a 4090 and a 13900K, making performance issues unnoticeable, but the open world and the additional activities are keeping me hooked to this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah It's fun. \r\nPerformance is rough, the UI is probably worst in the entire franchise, the way loot is presented is not the best, but the gameplay is top notch. The story and writing is also the best since BL2 imo. The game isn't afraid to take itself seriously at times and it's refreshing. The departure from focusing on the corporations and typical borderlands-verse is a bit jarring at first, but welcome. \r\n\r\nPlays better than BL3 imo, but I wish the game was a little bit less 'open world'. That's just my preference, I feel this is the most MMO world feeling borderlands out there, with limited timed events, little raid dungeons, etc. I'm currently playing through the Endgame UVHM stuff and I feel like the game gets better the more you play it. \r\n\r\nIt's something wholely new for Borderlands and I think it's a good thing, because it's super fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Borderlands 4 delivers exactly what fans expect: chaotic gunfights, over-the-top humor, and an endless hunt for better loot. While the story follows the familiar Borderlands formula, the game shines through its fast-paced combat and impressive variety of weapons. The updated skill trees and improved enemy AI make encounters more dynamic, especially during boss fights.\n\nAlthough the game is fully playable solo, Borderlands 4 clearly performs at its best with friends. Cooperative play not only makes tougher encounters more manageable but also enhances the overall fun combining abilities, sharing loot strategies, and coordinating attacks truly elevates the experience. The multiplayer scaling system is smoother than ever, rewarding teamwork with better drops and more efficient progression.\n\nDespite a few pacing issues and occasional technical hiccups, Borderlands 4 remains a highly enjoyable looter-shooter. It’s not a complete reinvention, but it’s a confident step forward for the series best enjoyed with a squad by your side.\n\nOverall Score: 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wonderful Looter Shooter, decent story, easy to sink 100 hours and more into - If your PC can run this mess of 'optimization'",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This Borderlands has been a blast so far, the best gameplay out of the series.\n\nThe story and dialogue aren't as bad as the previous game, I'd say it's on a similar level as the first one, nothing super memorable, but gets you from place to place killing stuff.\n\nThe whole atmosphere has been toned down compared to the over the top zaniness from borderlands 2 and 3 which is a great plus, I still think the first game had the best atmosphere, but this one comes in second.\n\nI'd recommend this one if you liked the gameplay from the previous games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I know opinions vary, but if you enjoy the whole Borderlands experience this is a terrific game.  \"You ever think about how many people we've killed? How many lives we've snuffed out, removing all hope for redemption? Condemning our victims to eternal judgment because of our petty whims and desire for loot and glory?\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wonderful game! I have played all of them in the franchise and they only have gotten better as they have moved on. Borderlands 2 and 3 were excellent. Borderlands 4 is exceptional. If you like looter shooters this great!\nI read it would take 25 hours to do the main missions only, 100 hours to do everything. I am into now for 108 hours and am 56% done! Great replayability as well with the different characters!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So, I've played a bit here n there figuring out what were the best settings for this game for my pc and it really is just a case of this games got dogshit performance\n\nBUT\n\nwhen I fought the first main story boss, whose name I already forgot, I did actually enjoy fighting him. Like the gameplay would be even better if they figured out how to make the game run without needing frame gen to reach 100 fps.\n\nI am playing on a 5080 with a ryzen 9 7900x at 2k. that should be fine for literally everything but ive had fps as low as 39 in the game. Frame gen is MANDATORY but the input delay is disgusting. the games dialogue is... underwhelming, although i do not mind the good guys of this story at all, i think they do a good enough job, even claptrap got a laugh outta me, but you really gotta make that performance better to make the game enjoyable. Im giving it a thumbs up because i do believe theyre trying to make the game run better and they are updating it with new content, but take this review as like a 7/10, not a 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun, but still runs worse than it has any right to in my opinion",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is still the best part of the series, and tbh the story wasn't bad either but I wouldn't say it was anything crazy. But I think it has a lot of work to do for endgame content since there isn't much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun and enjoyable, performance isn't as awful as people make it out to be but also not the best. Gameplay feels great and is a lot of fun, the open world feels slightly empty but still a really good game nonetheless",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game looks good and runs okay on older hardware.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "60fps with upscaling from 240p and inserted fake AI frames that visuals that make it look like you need glasses and smears all over the screen during motion... peak modern gaming I thoroughly enjoyed it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than Borderlands 3.\r\nNot as good a story as Borderlands 2.\r\nBest gunplay of all the titles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So far, this is the best game in the series for me. Borderlands 4 feels more alive with a world that feels packed with things to do. I felt this in Spider-Man Remastered where I barely touched the fast-travel and I am glad this one is the same. The gameplay and gunplay especially feel great, with a smoothness that I really expect from a modern shooter. The game itself is massive and in the 30something hours I put into it I only managed to complete 6/35 achievements. I got stuck in doing side-quests more than I wanted to see where the story goes. I already know I will miss this game when I'm eventually done with it.\r\n\r\nThe storyline is a throwback to the first Borderland games, with dark and smart humor combined with trashy jokes and characters that grow on you over time. I play as Rafa and I love his witty commentary, while the background characters manage to make you feel for them. Don't except storytelling mastery of sorts, but it is solid after the cringe-fest that was Borderlands 3.\r\n\r\nI can't ignore the fact that the optimization is lacking big time here, but playing on a high-end system I encountered zero issues. And I need to use DLSS in order to get over 60FPS at 4K with a GeForce RTX 5080, so make of that what you will. Sound design is nice, guns sound fine, the voices are nice and fit the atmosphere of the game.\r\n\r\nOverall, Borderlands 4 is a great experience if you want a good looter shooter... or a good FPS in general. The game doesn't take itself too seriously, and that hits the perfect spot. It's fun, but not necessarily stupid. It's fast paced, but not overwhelming. And after a long time, Borderlands feels a bit more difficult than usual and I am sure a lot of players will love this; I certainly do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\nGreat gunplay, better story. great visuals\n\nCons:\nPoorly optimized, lack of endgame, bland open world",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For me Borderlands 4 is the best part of the series! It feels less repetitive than the other ones.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even though the game was buggy and the performance was definitely [b] below [/b] acceptable standard, after a bunch of updates, it was even smooth for me (my specs were for 30fps low, but later I somehow got it to 60fps low). The story was good, but for me, it lacked some surprise elements that I liked in bl2, for example, but in general, it was pretty fun to play, and the bosses were amazing! The movement and gun play is just an upgrade from bl3, also very fluid, but I hate that the ground slam is somewhat useless, besides using it for missions and descending faster in the air. My personal overall experience was like 8/10, and I definitely recommend giving it a try and forming your own opinion, and not following the herd like some people.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I had an incredible time playing Borderlands 4! The gameplay is fast-paced and endlessly fun, with so many ways to customize my loadout and dive into chaotic battles. What really stood out to me was the humor—every line and character had me laughing while I looted. It’s the perfect mix of action and comedy, and I can’t wait to jump back in once DLC's will release.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Story is a step in the right direction. More involvement from the time keeper would have been better. Gameplay is better from last instalment. Endgame is boring so far. Dedicated legendary enhancement drops are non existent which sucks. BL2 story still clears, BL3 guns clears. Rafa is goated. Open world is nice and something different. Not a formula for everyone of course. Moxxi's big encore machines are a great addition. The vaults are cool but not enough of them. The bosses are plenty, but endgame isn't challenging. I like the serious tone, but the humor is far better than BL3.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is good fun and looks really great. I fire it up to play a session every now and then. There's a large world to explore with lots of missions. Shooting feels good and there's tons of weapons to experiment with.\r\n\r\nIt's a Borderlands game - and a pretty good one. Thumbo go up!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very similar feel to BL2 which was my favorite in the series. Runs decent on Steam. Got deluxe edition on sale for $103. totally worth it so far. #misshandsomejackrhetoric",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game has massive potential to be great and takeover Borderlands 2. But they need to start adding endgame options and more replay value. As of right now what plagues this game the most is giving players a reason to keep farming for the things they want and giving players a reason to make new characters. There is no variety in content that makes runs interesting and the legendary drop rates on new game characters make it not worth to stop and farm. So, players just end up forced to just get to level 50 first before deciding to farm for the gear they want for 200 hours then have nothing exciting to kill with said gear other than just to speedfarm bosses for the shiny weapon variants. The vault card system is interesting at least but the challenges leave something to be desired and seem to be a cop out to keep players playing and stall until the invincible comes out. But other than that the game is absolutely a step up in the series at the moment. Builds are plentiful and fun to work with. Unique weapons and class mods to use. Respawnable bosses, replayable missions. Everything is there to make this game perfect. Once more content is released and takedowns and raids are added this game will be near perfect and be what Bl3 wanted to be but better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great improvement story and gameplay wise over Borderlands 3, but with performance issues that make the game crash or stutter somewhat frequently. Additionally, legendary loot is a bit more rare than I'd like but that could just be a matter of preference.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's good but weighed down be its bad performance. I would have already beaten the game had it been playable on steam deck. Still waiting for an update that'll make it playable on deck.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Borderlands 4 absolutely slaps. Gunplay feels great, movement is way more fun this time, and the build variety keeps you constantly tweaking your setup to melt enemies faster. The pacing is solid, there’s always something to shoot and loot, and it nails that “one more mission” feeling.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good gameplay and story. Story better than Borderlands 3. Needs work on endgame.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played alot of Borderlands over the years and love the franchise. Gameplay is great, story was ok, enjoyed the open world aspect to the map and the mission replay feature but.....\nThe game is far too easy, I managed to get all the achievments (the only game I've ever done that in), if this can happen, your game is too easy.\nWeapons are all a bit meh.....only really used wombo, slugger and complex root on 4 playthroughs. \nAs for ripper/order guns, nobody likes guns that have to charge, get rid of them.\nNo end game and not enough side missions, There is nothing to do once you've collected everything.\nQuite possibly the worst dlc ever. Rush is a terrible character, would have prefered Ava to have made a return.\nNot saying its a bad game, had a great time with it and I've more than got my moneys worth but al in all just a bit lackluster.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'll start by saying I've been a fan of the mainline series since the original Borderlands, which was probably my first First Person Shooter on PC. I've played all the FPSs in this franchise (except Wonderlands, which actually ran worse for me than this game does). Given this perspective, people familiar with the series will probably get the most out of this review.\n\nFrom what I've seen around, the majority of the criticism for this game is story and performance related. Both of these complaints are pretty well founded, but in my opinion the story in this game is the best post-Borderlands 2. Granted, that it isn't saying a lot. But to give credit where its due, I found the humor actually enjoyable rather than cringeworthy, and the side quests were thoughtful instead just being a cheap laugh. We get actual character growth in some of the NPCs. The writing quality is there in this game, but it suffered under some poor pacing decisions that likely are a result of The Open World design. There are plenty of reviews on the storytelling, so I'm going to focus on other things.\n\nThe class design has gotten better with each game. The potential build diversity is definitely the greatest its ever been, and I'm happy to see that there are plenty of skills that additionally benefit your team. I'm all for incentivizing teamwork in a co-op game. Not a lot to say here, just that if you've liked the design direction of the classes as they've evolved over across the series, this is building further upon that.\n\nFor the guns, we've got the same high quality we've come to expect from the franchise, with a few improvements. We're getting mashups of manufacturer gimmicks on weapons now, called Licensed Parts, which is great. Atlas homing bullets and Jakobs ricochet on crit on the same gun? Amazing. We've gotten a bunch of new underbarrel attachments now too, including laser beams, homing rockets, flame throwers and more. In Borderlands 3, I don't think I found a single one that was worth using, but most of the ones I've tried in this game have been something I look forward to using once they are off cooldown. As a side note, the new Ripper manufacturer is designed to look like kitbashed guns, like they took several guns from different manufacturers and slapped them together, sort of like how the new Liscensed part system works.\n\nI think a lot of the issues with the story can actually be traced back to one core game design choice: The Open World. This has not been the franchises strong suit, with the open maps tending to be a bunch of nothing you drive your car through as quickly as possible, and the vehicle combat has never been good, so this was a big concern of mine going into the game. What we got, I have mixed feelings on. The story was obviously chopped up to fit The Open World design, which sucks. But we did get double jumps, a glide pack, instant summon vehicles almost anywhere, and a (albeit not well implemented) grapple grabber. These can mostly be combined for some pretty fun movement options, like jumping off your vehicle as its jumping to reach great heights, or doing so while boosting to glide great distances. The world is littered with little things to find, from secret chests to a measly Marcus Bobblehead, and all these new movement options make it fun to explore, rather than tedious. Thankfully, and ironically, the game with The Open World has no forced vehicle combat segments. My biggest let-down is the grapple grabber. It can only be used as a grapple at specifically designated spots, and they come in two varieties: the Spiderman Swing, and the ledge jump. The Spiderman Swing type lets you carry your momentum into your air jumps and a bit of your glide pack, making for some really fun and fast travel around the areas that have them. They're unfortunately rather rare. The second type is the most common, and they yoink you up to a ledge and drop you on the platform above them. Some of them allow you to carry momentum beyond the landing point, but most of them abruptly stop you mid air over the landing spot. These are as common as they are disappointing. The grabber part of the grapple grabber lets you pick up throwable explosives around the map (and is sometimes used for quest MacGuffins, too). For some reason, the grabber uses the same keybind as your melee attack, so if you're approaching an explosive and decide to pick it up, you might find yourself suddenly punching the damn thing and blowing yourself up. Or you might go to punch a baddy in the face and find yourself holding an explosive instead. My last complaint is that the world collision geometry was not always designed with all the freedom of movement the player has access to in mind. You'll find ledges you should clearly be able to stand on, but you just can't, and slide in the air or even right through the surface instead. Also you can use your bike and glide pack together to climb most walls that aren't completely vertical, which is silly.\n\nAll in all, I'd say this is a game with great gameplay that took some risks trying new things, some of which didn't pay off this time around. In my opinion, the good outweighs the bad, because at the end of the day the game is still fun to me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a difficult game to review and recommend because it is such a mixed bag. The gameplay is WONDERFUL in the improvements they made to the loot and farming loop. Being able to keep farming the same boss without having to save and exit to the menu then rejoin your friends in co-op is really nice, and they fixed the over abundance of legendaries that plagued Borderlands 3. Now farming and getting that perfect drop from a boss is extremely satisfying and i wouldn't be surprised if i spent 10 hours in farming alone on my first (and only for now) playthrough. Being able to dash, glide, and double jump also makes the farming feel fast and efficient, not to mention its just a very fun way to play the game and feels wonderful.\n \nHowever, Borderlands 3's backlash for an awful story has made Gearbox resort to very safe, bland writing. The writing is overall an improvement, with some funny moments, and less cringe overall. There are no blatantly offensively annoying characters like BL3 but instead all of the characters are just slightly annoying at best. The game tries to set up some emotional moments but is too scared to set up any significant events to care about, and doesnt set you up to care about any of the characters in the game so nothing feels impactful. \n\nThe Timekeeper unfortunately does not live up to the likes of Handsome Jack. I wouldn't have wanted them to try to imitate Jack but i think why Handsome Jack works so well in BL2 is because he is a constant threat to you and is constantly mocking, and getting in your way, and hurting the people you are close to. The Timekeeper is not this way, you rarely hear from him within the main 3 sections of the game, and have no reason to worry about him while you're going through 85% of the game. And none of the other 3 leaders are particularly intimidating or have a significant presence. I think if you heard from the leaders and the time keeper move often while doing the main missions it would make a big difference. Or if you heard from the timekeeper when you did a propaganda speaker or take over a bunker would do a lot to making him more present in the story, but I just didn't ever really think about him during most of the game. \n\nAnother issue with the game is the lack of enemy variety, youll be fighting the same order soldiers and rippers for most of the game with some wildlife here and there. Maybe it would be enough enemies if it was a shorter game but the game took me 80 hours to beat and it got pretty tiring fighting the same enemies the whole time. I hope the DLCs don't have the Order in it and mixes up the game significantly so youre not just looking at Order architecture and enemies the whole time. \n\nIf you're looking to play the game, I wouldn't recommend clearing out every objective and side activity. I think the bunkers and mines are fun with a small mini-boss within, but most of the other side content doesnt provide anything significant, and SDU tokens aren't extremely helpful since ammo drops are weighted to how much ammo you have in your guns. If you just run through the story and doing some side content here and there as you come across it i think youll have a good time. I am looking forward to replaying to interact with the other vault hunters i havent played as, Vex was a very fun and satisfying vault hunter, but i am not looking forward to fighting the same Order enemies and driving through the fairly bland environments over and over.\n\nAs for the end game, it seems fairly lackluster for now but they are planning more content. I am not a borderlands player that really interacts with the end game content very much but the lack of takedowns and raid bosses for now at launch is pretty unfortunate. \n\nI am excited to revisit the game sometime in 2026 to see how the DLC and new bosses and pearlescents feel but until then I don't want to play the game anymore, i'm burnt out and tired.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Outstanding game. Can't recommend enough, it's a ton of fun. Looking forward to playing the DLCs when they launch with more content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Here’s my review focusing only on the game itself — I’m leaving the PR drama and CEO controversies aside.\n\nThis was my first Borderlands game, and I was drawn in by the idea of an FPS with RPG mechanics. The movement looked fluid and snappy, almost reminiscent of DOOM (2016).\nSo, was the game fun? Yes — fun enough to keep me engaged despite the crashes and performance issues. And for me, that’s the core purpose of a game: to be enjoyable. On that front, it succeeds just enough to earn a positive review.\n\nDo I regret my purchase? Also yes.\nThe overall experience didn’t feel worth the price, and I never felt motivated to convince friends to join me. When a game is this expensive, I expect something more than just basic entertainment — I expect an experience. Unfortunately, the story and characters have the depth of a puddle, the soundtrack is so forgettable I’m not sure the audio was even on, and the jokes land with all the grace of a bad medical diagnosis.\n\nVisually, the environments are quite nice — though not the character models — but good visuals alone aren’t enough.\n\nFinal thoughts:\nMaybe give it a try during a deep sale. As for me, that’s what I’ll do next time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game definitely has its issues, but overall I've gotten my moneys worth out of it.\n\nThe multiplayer has some desync/network issues, along with items falling through the floors. Some of the weapons and vault hunters have been poorly balanced, though they've been working on buffing what needs to. That being said they're not perfect with it.\nSome of the bosses are definitely less engaging than others abut when it comes down to the grind you go for efficiency anyway, which you don't have to do.\nI've also had other issues occasionally with performance but overall after the first few minutes after a patch, my game runs completely fine with no issues on medium-high settings.\n\nThe story is mediocre, but that's not really the selling point for the franchise anymore imo. The sauce of this game is the character abilities, cool weapons and farmable/mission related content. The ultimate end goal is to find items to make a build for your character that basically blows up the whole screen.\nIf you're looking to be constantly engaged by the story or ridiculously difficult boss fights all of the time then this probably isn't the game for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "HATE:  every update 10-15 min compiling shaders just to get into the game pick a vault hunter and then same amount of time to....   compile shaders....   \r\nLIKE: \r\n-Each character feels unique to play, each has entertaining random mid combat commentary and generally fun to play, experiment with different skill sets\r\n-Variety in gear and weapons and how it can drastically change play style\r\n-Gear drops overall - always get something, most times at least something extra, sometimes it does feel like RNG hates you but that is every single looter shooter these days\r\n-Cosmetics - just wish had more variety and additional colour choices (not everyone likes flashy and flamboyant) \r\n\r\nLOVE:  \r\nactual cross play, can play with friends on console, very much appreciated\r\nand that while playing with friends I am fighting at my level and they are at their level so everybody can progress at their own speed and not needing to worry about being too high or low level to play with friends.  \r\n\r\nAreas of improvement: \r\n-the shader issue obviously\r\n-more variety, more loot, more....  everything...  and more claptrap (last one may just be me)\r\n\r\nOverall really fun game!   Would recommend to anyone",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, not so great performance issues, workable with mods but like I shouldn't need mods just to make the game WORK, and even with 3 separate performance mods I still drop to like 10 frames sometimes, and I'm just slightly below recommended specs, would recommend but only if you're near or above recommended and willing to install mods lol",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun and just challenging enough to have to engage your brain while not being impossible. Love the art style",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I loved the game, my friend got it for me. I only have a few complaints is, I wish I could redo story progress without resetting any collectibles. So story missions are you can't redo. Would love an updated New Game+ system, and being able to keep all the collectibles we got. Same with vehicle drives too. All and all enjoyed the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Runs like ass most of the time, but it's pretty fun when it runs good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Huge world, great weapons, chaotic combat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Performance issues aside this is, in my opinion, the best borderlands game to date.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best Bordelands game since 2 when it runs well. Super buggy and a lot of stuff I feel they could've fixed and optimized before releasing to the public",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. I believe this is my favorite of the 4. Decent main story. Great features on weapon farming. Great weapons with crazy features. Decent repeatability. Post game content is ok but not overwhelming. Highly recommend this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a fan of the borderlands series and TTW, i think the game itself is awesome. Big enough to crank out campaign if i have a few hours or if i only have 20-30 minutes after work i can do a sidequest or grab some echo logs before bed. the guns felt sick when i first began the game and overall im stoked on the game. However the menu is wild. so many bugs including when you go to filter weapons, change customization things, and others it just feels like its impossible and i end up saying eff it. i would assume some of that will get fixed in future patches but with the state of games these days i could see them not bothering too so oh well. i give it a biased 8.8/10 cause i like the series",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly the most fun I've had on a game in ages, the story was pretty impactful and the gameplay felt so satisfying besides the whole graphics part, but honestly I can look past that, everything about the game makes up for that and more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Need to have all the DLC released before this becomes a masterpiece of a game ngl. Needs substantial work on the engine",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun for the first playthrough as it is all new and exciting. Farming for legendaries is a factor of the game, and you still get a buzz when one drops . \nI want to start all over again with a new character, but I know I have to listen to a lot of talking and then a lot of driving around.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Except its very rough optimization ,game is made very well. It is very fun game with huge game world to explore, good storyline ,nice humor and very good gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got 2 characters to level 50 before i felt like putting the game down. I honestly don't understand all the hate this game is getting. Yeah, the performance was definitely spotty at launch, but (for me anyway) the updates helped fix this alot. As someone who has played every borderlands game since the OG, I can confidently say that this is one of the very few franchises where each new game in the series is even more fun to play than the last, and Borderlands 4 is no exception. I've already put tons of time into this game, and plan to put in even more once there is more content to explore. If you truly felt like this game was bad, then I'm sorry for you, but personally I loved it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Love the graphics and all the gun and equipment.  highly recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After all the hype and pre launch promos the game ended up being almost unplayable and is a let down after the previous borderlands games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "All good, love the game and the history",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Runs smoothly on my mid tier AMD rig. If you are using nvidia... good luck. Those cards typically suck on UE5. \n\n9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "+ Gameplay is fun\r\n+ Guns and loot feels great\r\n+ Character customisation and skill trees \r\n\r\n- Lack of min-map hurts player experience\r\n- Very boring NPCs and dialogues. Worse the dialogue is un-skippable\r\n- Walking around huge distances early game is very annoying. Manageable once you get  access to vehicles. \r\n\r\nOverall would recommend, but I feel it is too pricey for a game with so many blatant flaws.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "We wont know for sure the full quality of the game until the final DLC releases but as of now I would put it around Borderlands 3 or Wonderlands tier. I feel like Borderlands 4 continues the decline of the franchise. On its own its an acceptable title I suppose but It doesnt live up, in my eyes to the heights of the older Borderlands games.\n\nThe gunplay and combat is great but the openworld feels like a detriment, and the repeatable quests add nothing to the experience. Overall in trying to make a bigger game I feel like they made the game feel like the most shallow borderlands of all.  The story lacks the cringe overly comedic nature of the third game, but I find that to be mostly a symptom of there just being less plot in general. \n\nI enjoyed my time with the game but at the same time it felt shorter and emptier than and borderlands I have played since the very first. I hope we see real improvements over time with the dl drops over the next year.  Anyone that picks this up will have a really mixed experience in my opinion so I would only recommend this to big borderlands franchise fans.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am 72 today and still love playing Borderlands. Please don't tell my wife that I have spent more than a week of my life on this game. I love that it's the same format as the other games. It's a big world and there are multiple possibilities. I have just played the Christmas add on and I think that adds real value to the game. I am not a very good gamer, so the easy mode allows me to play alone and actually beat the end of level baddies.  If I can't beat them, I can go away and get better weapons. All in all a ballbuster of a game. Can't wait for five.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Needs lots of QoL to make it even better. Also we need proper endgame content",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am not a bot sent to give a good review. I have had ZERO issues with this game. No lag, FPS is good, runs a little warm but its fine. That being said I'm playing alone. I'm not sure how it is with multiplayer but solo its good and the game over all is a lot of fun. Plus I got to see Moxxi again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is engaging and has a bright future for endgame content.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the games fun, it suffer from ubisoft open world but i turned off my brain and kill homeless people with my friends and i really enjoyed it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing the series since Borderlands 2 and my only expectations towards new chapters was to have as much fun as B2 gave me. \n\nI really enjoyed playing B4 becouse it brought some new ideas, new activities and stayed fun game at the same time. It is debatable whether the main story and characters were as good as in B2 but still it has great gameplay and for me this is all about in the games. \n\nMaybe the graphics isn't much differnet when compared to B3 (tho imo it wasn't most important in the series) and the optimazation could be better but still you can have some fun time playing this game.\n\nJust to be fair, at first I runed this game on Ryzen 5 2600x and GTX 1660 Ti setup, way under minimal requirments and still managed to play it for about 70-80 hrs and still have fun playing it on lower settings and low FPS (playing 1080 P only). Now playing on upgraded CPU and GPU I have way more fun.\n\nI can understand that players can have their own expectations how the games should be, how they should work and if they are properly priced or not but I feel like this game got way too much hate. \n\nIf you are fan of the series you should definitely give this game a shot !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it runs fine, pushing 50$ dlcs on a game that does not run fine for >50% of players is actually crazy though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing Borderlands since the first one back in 2009. The franchise has had some strong titles, and then ones that weren't. I would rate this game neither. It's about midway in terms of the best Borderlands title in my opinion. The writing and storytelling just aren't the same as it was back on 2. I am still having a blast in terms of collecting items and killing things. I will keep playing these titles as long as they keep making 'em!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite of all issues with the performance and such, the game is quite dope and fun to game on with ! sadly i havent experienced co op yet , but i do recommend the game despite of the state it is in !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Borderlands 4 pros: 110 hours, played every game, AMD Ryzen AI9 375 RTX 5090\r\n~ I prefer the one map setup far over multi world back and forth\r\n~ The boss fights feel unique to the boss not just slapped together like 3 (don't even get me started on pre sequel)\r\n~ Unique loot feels very borderlands and each gun has it's identity again\r\n- UVHM feels way better than borderlands 3 OP levels (joke of a name for those modes compared to 2)\r\n- It is fun to roam the map and see small details or fun side missions again, there is tiny jokes and references all over the map\r\n- Classes feel fun but all feel usable in high DPS situations not just one broken character\r\n- Graphics are great and don't take away from the borderlands style feel\r\n- Gun customization and character customization has far more variety than before\r\n- Summoning your vehicle seems way more effective than the catch-a-ride system (RIP scooter)\r\nCons\r\n- unless your an achievment hunter or phosphene collector end game is a bit empty right now\r\n- UVHM modes however a good idea feel totally unnecessary as they don't bring much in terms of damage or health to the table, I would love to see a more borderlands 2 style system made where the OP levels drastically made a difference on game play and each OP level required you to regrind your gear as the stats were far different (sometimes comically which made it fun)\r\n- I am sure we will see more raid bosses brought into the game but I am looking for the hours spent grinding just to get pearls let alone just to try and beat the boss, we want a real challenge as the bosses in the game are quite easy to beat and don't pose much challenge\r\n- I have more things to add i'm sure but I am out of time\r\nWorth the money for avid borderlands lovers but as a first time borderlands player at this time borderlands 2 still holds the crown. Looking forward to future updates!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As you can see from my play time, I enjoy this game. It has its pitfalls but overall it's a decent lootershooter. I've gotten all the current vault hunters to max and some of the builds you can use are borderline broken (looking at you, blade Rafa), but it doesn't take away from the fun for me. It does get boring if you're the one being carried by an overpowered build as you just stand there and wait for the loot shower. \n-Pros\nFast gameplay\nDecent graphics\nDialog? (if you're into that)\nThe tried and true BL formula of loot farming\n\n-Cons\nIf you want good framerates on Badass graphics settings, I hope your system is up to the task\nDEI/LGBT stuff forced into the game\nIf your child wants to play, be sure to create a new account with an adult age on it, otherwise GearBox will ban the child's account from playing\nSame tried and true BL formula gets stale after a 30 minute session. best in short bursts of play once you reach max level\nNO END GAME CURRENTLY\n\nMy gripes are minor and easily fixed. I'm sure in a year or so this game will be top notch like all the other games in the series. It is a departure from the norm, what with the open world aspects. I didn't seem to mind or notice too much of a change. I didn't care for the forced LGBT stuff being shoved in my face with one of the side characters. Overall I would recommend this game to anyone who likes looter shooters, RPGs, or GearBox in general.\n\nALSO DO NOT INSTALL MODS!!!!! I had only one mod installed that simply pulled loot to my character because some of the bosses would go flying upon death and sometimes the loot would get stuck in inaccessible areas behind invisible walls. With the latest major patch, my game completely broke and I had to use ChatGPT to figure out the problem to get my game back working. 100% my fault and not at all the fault of GearBox. Do yourself a favor and do NOT install mods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not for full price, its fun with friends but it dosent feel like borderlands with borderlands story feels more like far cry game thats gone a bit crazy, still had fun but needs endgame content farming is pretty boring",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The quests and story are hilarious, and the gunplay is fantastic. The only flaws are that the inventory is sometimes slow to update, and a few quests are buggy, but re-entering usually fixes those issues.\n\nOh... did I mention the Hex-appeal weapon skin that utters rather erotic cheers while you fight?\n\nTruly a masterpiece!\n\nEdit: Cheers for the italian dubbing... it's execptional! i never laughted so much in a game! :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "STORY – 7 Vaults out of 10\nIt feels like a big link, tying the last game to a potential future game, a spin-off.\nIt’s a standalone story about different people with different problems. The few cameos from characters of earlier games unfortunately don’t create the feeling that you’re playing Borderlands — more like something from this universe, but not quite the main thing.\n\nGAMEPLAY – 8 XP points out of 10\nMovement is MUCH more convenient now — you get a grappling hook for pulling yourself up, instant transportation, a jetpack — you can climb basically anywhere.\nAs for the skill tree (for me personally), there’s no point in mixing the branches; you can just invest in one of the three and you won’t lose (or gain) much. Shooting hasn’t really changed, except that the grenade slot now holds various rocket launchers (and machine guns) which used to be a separate weapon type.\n\nCHARACTERS – 5 fingers out of 10\nBack to the character topic — most of the negative points come from the story bosses. They’re forgettable and bland (except for one — and it’s not the main villain).\nFriendly NPCs... well, they’re there. They exist to tick a box, but they don’t evoke any emotional response. Returning heroes from previous games are VERY few — you can count them on one hand. This isn’t BL3, where they even managed to bring up Rhys and Salvador. But hey, Moxxi is here — and that’s something.\n\nGUNS / SHOOTING – 6 bullets out of 10\nApparently, after BL3 with its gazillion guns, the devs slowed down and... tightened the supply of good ammo (purple and orange; pearlescents won’t arrive until spring 2026). Don’t expect guaranteed legendaries from killing bosses — if you get a couple of purples, consider yourself lucky.\nWhoever came up with the Order weapons this time — there’s a special slow-boiling cauldron waiting for you in hell.\n\nGRAPHICS – 9 rainbow colors out of 10\nA very beautifully crafted world. I liked the biomes — distinct parts of the map — as well as the overall color palette. It genuinely feels like a living world, not a washed-out something (like in BL1 and BL2). If BL3’s visuals satisfied you, this one won’t disappoint.\n\nOPTIMIZATION – 4 shader compilations out of 10\nHOW. TIRED. I AM. OF. COMPILING. SHADERS. EVERY. SINGLE. TIME.\n\nFinal score: 6.5 Borderlands out of 10\n\nWaiting for the rest of the DLCs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite the mixed reviews, I actually really enjoyed this game. The story is actually really good, at least until the end, which is pretty anticlimatic. I loved the world and exploring (as you can tell from my 100 hours) and I tried to complete as many side quests as made available to me. I also believe the graphic issues are somewhat resolved as I could play on my laptop and a slow, school provided desktop. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is exactly what I wanted from this game.\n\nPros\n* open world even better than in BL2\n* can choose hard difficulty from the start\n* no intrusive markers\n* rare items are rare\n* animation is gorgeous\n* gore is there\n\nCons\n* [strike]the nature of open world implies there will be no vistas like in BL2. Will see.[/strike]\n* inventory could be more classic\n\nFew more hours of play:\nPros\n* vistas are alright!\n* density of the world is at least BL2 level!\nCons\n* not every gun has a cause-effect feeling. For some guns, you trigger, nothing happens, then the enemy dies from a crit.\n\nWill add more on this as will play it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I absolutely see where people are coming from saying this doesn't feel like the previous Borderlands games. I would counter by asking, is that a bad thing? There are so many new combinations of gear, in depth skill trees, unique storylines that tie into everything we love (and hate) about the Borderlands universe. A whole new take on the concepts established in this game's predecessors. [b]TLDR[/b] If you loved the previous Borderlands games, odds are you'll at least appreciate this one too; but even if you weren't the biggest fan of 2 or 3, it might be worth giving 4 a shot with how much new functionality has been added. Definitely a little expensive as with everything nowadays; so with the apparent length of the story from what I've seen so far, I'd recommend waiting for 15-20% discount to feel like you got a decent value regardless of what I've said so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun, wait for it to go on sale. It isn't as fun as BL1/2 and the open world concept feels tired. Definitely worth playing, though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Games good.\nBad optimization.\nKinda mid main story.\nGreat side missions.\nGreat boss fights(most of em).\nOpen world format is bad compared to instance based.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I was skeptical at first but BL4 has been pretty fun so far. The gameplay is similar to BL3 but there are various quality of life improvements and the story is actually good. If you enjoy Borderlands, then this one is worth your time as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It feels like one of the best Borderlands games so far with classic Borderlands formula and open world instead of dozens semi-open locations\r\n\r\nObviously, the game also has its drawbacks such as:\r\n- Character levelling feels way too rapid for me\r\n- Hard difficulty could be more punishing\r\n- Ranting of the cultists from the \"optimisation\" sect",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "bad on launch, waiting till its playable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Once I figured out how to use Frame Generation and put the game into Full Screen mode, It turned into a very great game. Since I turned those two options on, zero crashes, zero lag and the game is smooth as silk. The content is pretty amazing to be honest. A lot to do and am loving it so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Positives:\r\n– The gameplay of Borderlands 4 is a blast — fast-paced, chaotic and just plain fun.\r\n– Loot remains a core joy: blasting enemies and watching cool guns and gear drop never gets old.\r\n– Enemy variety is solid — different enemy types and combat styles keep fights fresh and unpredictable.\r\n\r\nNegatives:\r\n– Performance can be rough: without DLSS or Frame Generation, you’ll likely struggle to get smooth frame rates.\r\n– And while there are plenty of foes, the “vile” enemies feel disappointingly dull — to me they’re just boring loot pinatas rather than engaging challenges.\r\n\r\nOverall: a fun, loot-heavy shooter with good variety — but you’ll want DLSS/Frame Gen support for the best experience, and some enemy design feels a bit lazy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When it works(big emphasis), its the best the series has to offer tbh. bl2 has it beat in the villian department fs. But this game pretty much has it everywhere else.\n\nCautious recommendation, if you have the rig for it go ahead. But beware of the abysmal optimization.",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "If it weren’t for Randy, the insane price, the awful performance, and all the baffling decisions made along the way, this would just be another underwhelming game, mediocre at best. But with everything taken into account, this isn’t just disappointing, it’s a full on dumpster fire.",
      "voted_up": false,
      "votes_helpful": 533
    },
    {
      "review": "!!DO NOT BUY THIS GAME!!\n\nLost more thank 70 euros and 36 hours of my life on this\n- Played more than 36 hours\n- Game crashes (on a computer way more powerful than minimum requirements)\n- After the crash the game deleted all the local saves on its own\n- The game overwrote steam backup, making it impossible to retieve the saves\n- Most probably never going to play this again due to the risk of losing even more time (problem also happened to many people online)\n\nI'm a fan of the franchise, with hundreds of hours on it but i never felt so fooled by an awfully made game.\n\n\nEDIT:\n1) The problem above could be solved but only with some modification to save files. Still, an unacceptable problem for a 70+ game which claims to be AAA.\n\n2) after finishing the game i confirm the advice: DO NOT buy it. Main storyline is heavily unfinished and everything is left unexplained. It feels like i played to a demo that has to continue the storyline in a finished product. Not really how eventual DLCs (which one would have to pay) should work. \n\nDISAPPOINTING ON SO MANY LEVELS...",
      "voted_up": false,
      "votes_helpful": 393
    },
    {
      "review": "Waiting 1h for shaders to preload and have the shaders preload again and exit the game for patching, to have a game run this bad just make me want to play anything else. (repeat the experience everytime a theres a driver update.)  A 5080 doesn't even crack 40 fps and that is months after realease.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "I have a 9800x3d, 5090, and 96 GB of 6600 ram on a 1440p ultrawide... Even I have been waiting on performance improvements because this game runs like crap. Randy P. must have sent out a memo to not make the game run any better. Clearly his comment saying that this is a \"premium game made for premium gamers\", means nothing when I cannot get any more premium of a setup yet it still runs like trash. BTW I am fine with DLSS in single player games, but even with it this game looks and runs staggeringly worse than many modern titles. I keep it installed in the hope that they will fix some of the issues, but so far they have updated the game with more cosmetics and other useless garbage. If it ran on par with how it looked, I'd be happy to finish the story. I don't mind the open world too much, and the gameplay/story/and dialogue are all fine for a Borderlands game. It just makes my computer scream, has stutters and crashes, and doesnt even look that good.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "Opinions in my review are my own.\n\nI do genuinely love this game. It's still really fun to play as Borderlands games always have been, and the gameplay is just as great as 3's. However, in the game's current state, I just cannot recommend it.\n\nTo put it simple, this is not a finished product. The unfortunate truth about most AAA games nowadays.\n\nPerformance is the main issue this game seems to have, according to most people. Which they are actually right. I own a 3080Ti and a Ryzen 9 5900x. Both are still pretty solid specs to have to this day, not to mention it's slightly above the recommended. I have the 32GBs of RAM. I have the game installed on an m.2 drive. Yet, despite all that, I cannot run the game above medium settings. Not even with DLSS set to \"Ultra Performance.\" I barely get a solid 60 FPS half the time with the settings on medium-low. Typically the recommended specs allow the game to run fine on high settings, yet that's ... not the case for me. I think most of it is due to the engine: Unreal Engine 5. That engine forces the use of the lumen lighting system, or in some cases, raytracing/RTX. A lot of older GPU's (typically below the RTX 50 series for example) do not have the best support for such a thing, especially since both Lumen and Raytracing are being updated, causing issues for people with older GPU's. They're built for the older versions of ray tracing during the time they were released and being fully supported. Now, being forced to use the newer system, it's not going to end well.\n\nThe game itself has it's issues too, not just performance-wise. I have been playing the game a lot with one other person who lives on the opposite side of the planet. Let me tell you, no Borderlands game has ever handled latency well ... at all. I am used to the delay, but it's still often unbearable. Having to aim way ahead from where the enemy will be due to the delay and the time the bullet takes to reach the target. It's a lot worse with torgue weapons or anything else that shoots slow bullets. Movement on foot is fine otherwise, but there's a lot of jank trying to mantle or often times gliding. The game randomly would make me glide around despite pressing space bar once. I'm just stuck floating slowly around, having the game twitch me around violently. Driving is so much worse and practically unbearable, and I'm a little bummed out there's no option to just spawn one car that 4 players can sit in. Playing the older games with the same person, I would always sit in the back of the car and let them drive due to the delay, but now in this game, I'm forced to drive. Turning is really delayed and floaty, and I'll suddenly just bounce back aggressively, sometimes even teleport all the way back to when I first mounted, then the game re-adjusts me back into the right position.\n\nThe performance issues, the delay, and now just general bugs that were game-breaking. The most common bug I would get, and I don't know how I constantly did it, but I think it was when I would start a reload and immediately try to swap weapons or use the underbarrel attachment, the gun bugs out. It plays the shooting animations and audio, yet I'm not shooting any bullets at all. Swapping weapons does nothing, yet it says on the bottom right of the screen that I switch weapons, but no animation plays, and I still cannot shoot my gun at all. Dropping my gun and picking it back up would often fix it, but that was a 50/50 chance it'd fix it or not. This was definitely super frustrating when this would happen during boss fights.\n\nJust as often, I would notice suddenly all of my skill points would reset and unequip everything. I'm having to pause the game and try to remember what I had before, or just use it as an opportunity to try a different build. This bug is just both an upside and a downside. Either way, it really shouldn't happen.\n\nSometimes the icons and rarity with certain items would get mixed up. To the point where an \"unequipped\" item would actually be equipped. I try to tag it for junk and sell it, but it doesn't work. Then I finally manage to sell it, and suddenly I realized I sold my equipped weapon. I have to buy it back, while this ghost item in my backpack is still there and I cannot sell or get rid of it, as it's apparently my equipped item. I know the game is supposed to warn you about selling an equipped item, but this bug does not make that warning pop up.\n\nThe game does have charm to me still. The humor at times made me giggle out loud. But ... there's too much of it. I don't know why they'd include so much modern slang, jokes and memes. Before you worry or panic, no, none of that horrid gen alpha stuff. No forbidden toilet (as far as I've seen at this point). Before the game was coming out, devs stated the game would have way less \"toilet humor\" yet it's not entirely true. Some of the genuinely funny bits of the game are some things I've heard Rafa say, such as referencing Pokemon or Star Wars (yes this game has soooo many references). His character is actually funny. Harlowe has some silly things to say too. Some of her one liners are great but there's always the weak ones. I don't know much about Amon or Vex since neither me or my friend has played them all that much. Though, if I have to say one thing with Vex, regarding practically every damn siren character in these games, Vex doesn't seem to be as ... self-centered? Amara in 3 was so often talking about how amazing she was, yet from what little bits of Vex I've heard, she's not talking like that as much. Yet, nearly all the characters in the game suffer from having ... too much modern slang to say. That includes the Rippers.\n\nDespite everything though, I still have hope for this game. I still love it. It's really fun to play. The guns in the game can get really crazy, which only makes it much more enjoyable. I really hope this game gets more updates and patches, eventually turning into a fully finished, and enjoyable product with little to no bugs.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I love Borderlands. I love aspects of Borderlands 4 too. I am just not yet convinced if it will reach the potential it has and therefore ask you to wait for more content and fixes to come out before making a decision. I hope to change this review to a positive one sooner rather than later.\r\n\r\nTo Randy: I believe people are most critical of the things that they love. Please, do not view people's criticism towards BL4 as hate, and instead, as love for the potential it has.\r\n\r\nIn many ways, Borderlands 4 has the best base game in the franchise. Still, it has some very bad problems with performance and UI/UX. This is just expected with a Borderlands release at this point and it is a shame that we have to deal with these shortcomings again and again. They end up being incredibly disruptive since you are constantly interacting with these aspects and it is especially disheartening after having similar experiences with previous games.\r\n\r\nPeople like Borderlands for different reasons. For me, I love the build crafting and endgame aspects of the games. BL4 released with absolutely no endgame or endgame gameplay loop at all. You will spend hours building your character and have no challenging content to test out your builds. Please bring back Takedowns. Again, like performance and UI/UX problems, this is yet another Borderlands game to release with an endgame problem. It is hard to excuse these shortcomings when many previous games also had them and the community continues to advocate for improvements to no avail.\r\n\r\nThe recent Halloween event is just sad. No new dungeon, boss, activity, or anything really. Just doing the same world bosses from the base game with a color filter on screen. Insane downgrade from BL3's Halloween event and incredibly worrying with what is to come.\r\n\r\nI hope Borderlands 4 becomes the best it can be by fixing its many technical issues and lack of endgame. At this point in time, I am not too sure if I fully trust Gearbox to deliver on these things.\r\n\r\nIf you want an incredibly fun and hectic campaign/open world experience that you can be done with in a few weeks, I highly recommend BL4. \r\nIf you want to sink your teeth into a masterfully crafted looter shooter with challenging content, comprehensive endgame, and tightly designed systems, I fear you may have to look somewhere else for now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "- Game was fun until story ended\n- End game is meh\n- Can't ride around in vehicles with friends due to cringe Destiny \"Sparrow\" spawning of vehicles\n- Performance is trash on highest quality systems....cough....RANDY\n\nBuy Borderlands 2, pretend 3 doesn't exist, and then wait for this one to go on sale with all the DLC in one package when it actually runs worth a s**t. \n\n3/10",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "this game is unreasonably mid. Open world sucks, 2nd characters suck. Builds are boring af. \n\nWish i didnt play it as much as i did or id refund it. i kept waiting for it to get good and it never did. what a shame",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Gameplay is badly optimized for any hardware thats not brand new. 30-40 fps on an rtx 3080 with dlss is a joke.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Non existing end game. If you buy this game you are buying the story and they dotn even have new game+.  Wtf were they doing developing this for years. what a joke.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I always loved the Borderlands games, but this is The End of the Line.\n\nBorderlands 4 is a boring, bland and dull game. I could not bond with any of the characters. At some point i just wanted it to be over. The npc's (and the player) are talking way too much and I could not care less.\nThe open world does not work for me in this game either. I barely had any motivation to explore or finish some side quests.\nThis is just a personal opinion, but the weapons suck. Only the Jacobs guns are fun to play with. The other manufactured weapons look terribly odd and the handling is dreadful.\nThere is so much going on but somehow the game manages it to get nothing done. Many of the features feel kinda senseless. \n\nThe magic is gone.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Borderlands 4 has some really nice quality-of-life improvements, like being able to summon your vehicle anywhere, which makes getting around way less annoying. The gunplay and general combat still feel good, and the game has its moments of fun chaos. Unfortunately, the story is just boring, and the endless fetch quests make the whole open-world experience feel more like a chore than an adventure. Half the time I wasn’t even sure why I was doing anything besides padding out playtime. World events also barely spawn, which kills a lot of the excitement you'd expect from a big open world. On top of that, performance issues pop up constantly, shader compiling every time you launch, random drops, and even skill trees resetting in multiplayer. The endgame is also pretty underwhelming, with nothing that really motivates you to stick around. It’s maybe a bit better than BL3 in a few small ways, but overall it still feels disappointing. In the end, it’s hard not to walk away thinking this series deserves better.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This is by far the worst Borderlands game to date unfortunately.  Everything from the lack of story, to incredibly bad hitbox around characters (many a time that resulted from self death from splash damage), very empty environments overall....just to name a few things.  Every mission that requires you to recover an item like for examples \"capsules\" need to be removed from the game entirely.  Once the item is picked up, you no longer can use vehicles, aim your gun, pick up any other item, use ordanance, use a skill, use grapple,  climb.....lol. You basically can't play the game until the item is put down.  If the item is put down for to long a time it dissappears and returns to its original spawn point.  This is absolutely ridiculous to keep this in the game.  lol.  If you are looking for a Borderlands game, this is not the one to spend your money on.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A progression system in conflict with itself.\n\nThe biggest problem with this game is that it's meant to be a grind-fest.  It's meant to be replayable and a sandbox, but its core systems of progression are tied to very specific tasks.  The open world is great, but you're limited on how to maximize your gains from it.  So you end up in situations where you feel like you're in this massive world but tied down by your nose from one specific thing to the next with very little gain from doing it.\n\nThe end result is a boring, pointless experience, because the story is not really all that particularly fascinating and it's the only thing that holds the entire grind together, since there's very little sandbox progression to justify its sandbox structure.\n\nThere's a lot to be impressed by from a technical and build variety stance but overall the game still manages to be a step back from its progression/endgame from Wonderlands, which is a massive statement to its regression as a series.  And you get all of that regression for a massive price tag on top of that.\n\nThe only thing that got me through the boring campaign was the promise of endgame potential, and the second I hit endgame the desire to continue absolutely flatlined because there's almost no substance to it.\n\nHonestly, I went in with very light expectations and yet still walked away highly disappointed, considering its potential is so high with the open world setting.  It's like they learned absolutely nothing from successful open world games, or the issues with their endgame as a franchise.  An endless grind is not enough to justify the time investment if the world is painfully and unsustainably lacking in interest.  If they work to open up the world and not make progression so tied to repeat events and give the game more reason to explore it, it could go somewhere, but it's highly unlikely that will be the direction the game takes as in almost every case Borderlands DLC is almost always minimal.  Collectables are a lazy way to add interest to a game world, and this game is loaded with them, and expect to do them on all your alt characters because they're not account shared.\n\nSpeaking of alts, there's a reason the game allows you to insta-level alts to 30 once you complete the campaign, because the game would be an absolute slog without it if you have any interest in alts at all.  The thing is, it doesn't help.  Because the open world is so boring, so unrewarding, so repetitive that I lost interest in alts almost immediately after trying them out.  Not to mention this cast of vault hunters are easily the worst they've ever been.  None of them are really relatable or worthy of any emotional investment.  They've sucked all the cool out of vault hunters in this one, sad to report. \n\nSo once you hit the point where the game is supposed to open up, you only end up hitting a wall.  It does everything in it's power to drive you away and suck all its potential out the window, only to give you a \"well, maybe with some DLC it won't suck?\" vibe to linger in all its time investment.\n\nYou're going to need a top end machine to get past the technical requirements, anyways, which on top of everything I've already mentioned makes the whole thing a very tough game to recommend to anyone other than the absolute biggest Borderlands addicts.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "In some ways, this is a game for the die hard Borderlands fans. In others, it's a game for everyone.\n\nAnd by that I mean that they've made a generic copy and paste nothing of a game and the only reason to play it is if you absolutely need something with the Borderlands logo on it. It's the 2025 season of Bachelor in Paradise of Borderlands games: some c-suite fuckstick drilled the \"make more money\" screws into everyone's eye sockets and they spent two years market researching every little nugget that they could tape together into something vaguely resembling the original product.\n\nAnd the saddest thing is you can see there were people who really wanted to make a fun Borderlands game. I've spent a stupid amount of time in this series. I really, really wanted to like this - I was hankering so bad for another Borderlands game when this came out. There's a lot of what I loved about the previous games, and a lot of stuff that they've improved. I really believe that they did listen to feedback in a lot of areas. And then there's everything else.\n\nThere's a lot of things to be mad at here. Here's a couple that bother me the most.\n\n - No uniques. I'm talking about blues with red text, usually given as mission rewards. Not a one. Missions just give you generic useless gear which has a capped rarity. I've only seen a couple mission rewards that even had a chance of giving a legendary. Guns with freaky bullshit are the lifeblood of this game. It really kills the excitement to do a side mission when it tells you up front the best you could possibly get is a purple you won't use.\n\n - The vaults. The entire plots of previous games revolve around getting into these vaults and the consequences of opening them. In Borderlands 4, you literally find vault keys laying around on bandits' patio furniture. And then you get into a vault and fight through a mini dungeon, with the same enemies you fought right outside. And at the end you get a pathetic stat bonus. All throughout the vault the creepy bug from TPS is telling you you're getting a piece of the timekeeper's power. Am I supposed to believe he gained control over an entire planet by maxing his fucking glide pack regeneration speed?\n\n - The skill trees. Barely any have a solid unifying theme, but the worst part is the lack of capstones. I mean, yes, there are things called capstones, but they aren't at the dang cap of the tree! This is more of a UI complaint than anything. But I look at the skill trees and they don't stand out as anything special, they're at the same level as like +15% fire damage. So lame. You're also not really encouraged to put points in different trees, since the most exciting bonuses only apply to the action skill from that tree. I've never by choice put an extra point in a finished tree in another BL game because I was always excited to get to a cool skill from another tree but like... what's the point.\n\n - The open world. If you're gonna copy a game, why would you copy Far Cry when you could have copied Breath of the Wild? This is the kind of open world where instead of giving you a world full of things to explore, you get the same game it would have been but with a bunch of filler and empty nothing, with more tools to run into the same invisible walls.\n\n - Surveillance. Anti-cheat on single player games, such a transparent scam. And I soo hate being forced to go online when I want to play on my own. \n\n - Randy. I mean, let's be honest, on the scale of shitheel CEOs in 2025 he barely even rates. But what an insufferable prick. I hate so much that I made him any money.\n\nHere's some of the things I liked:\n\n - The minute to minute gameplay is pretty fun. I like how the guns feel, I like Vex's ghost clones. But they made the Mayhem modifiers from BL3 apply to any enemy with no in world explanation, which means the things that most change the fight are modifiers that apply the same to a big cow as a techno super soldier. Once you've had a couple minutes you've kinda had them all. I get what they were saying about \"fun over realism\" but this isn't it.\n\n- I like the movement. It's like they say, make the player move more, make the enemies move more. Well, they at least gave the player the ability to move more, but there's not all that much reason to do it. And every game is of course made better by a grappling hook, but I thought we all agreed to stop doing contextual buttons. They've taken something so beautiful and made me hate it. Why on earth would you make one button that either grapples a bomb to your hand or if you're slightly too close blows it up in your face? It's not like it was even worth my time to be throwing it in the first place, I just thought it was a fun move, but way to kill the vibe. And by god stop doing platforming. You can't half-ass a 3d platformer. If that's what you wanted the game to be then do that 100%, but don't put that garbage in front of me with these finicky asf grapple points and crapshoot mantling. It sucked ass in BL3 and it didn't need to be here.\n\n - The game looks pretty good on low settings. Of course, that's the only settings I can reasonably play at, despite spending way too much money on a fancy computer just last year. And maybe this is just taste but all that trash that they put in the higher settings just makes it looks worse even if could show enough frames. I hate the super washed out gray of these new unreal games. \n\n  - The enemies. I love the design of the order and the rippers. Two sides of the same freaky body modification coin. And I've fought some fun, good looking bosses. But the creatures. Borderlands has a history of sick as hell creature design. Stalkers, threshers, kraggons, spiderants, so many iconic beasts and I can't believe I haven't already been stealing them for tabletop games. The whole first section of this game you fight two creatures: a buffalo that runs at you and hits you... and a cat that runs at you and hits you. The critters are where they could get real creative with freaky biology and it's just lame.\n\n\nWell, I couldn't even get through the pros without whining some more. If there's one thing they did unequivocally succeed at, it's finally making the lovable claptrap as insufferable as the NPCs have always claimed he is. Congrats.\n\nIf you want a Borderlands game and you haven't played Tiny Tina's Wonderlands yet, give it a try. That game sure ain't perfect but it's so much better than this. So many little things that they got right there that they could have brought here... like vending machines selling uniques and using money for SDUs (where instead in BL4 money and vending machines are once again worthless). Or collectibles that increase your loot luck! I looved that. I loved having a reward for exploring, and I'm happy with a high legendary drop rate if it feels like i worked for it and I earned it. Finding secrets in this game is back to giving you a negligible amount of XP, which is just so insane, to make it open world and make exploration even less worth your time. And the environments in that game are so gorgeous. Just beautiful. Not the washed out two-color ten-asset collage of BL4. Okay no more wonderlands talk.\n\n\nI spent way too much time and effort on this, my first negative review, and I've already spent too much time in this game. But that's my mistake, and it doesn't have to be yours.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is so terrible that I'd rather go back and play Borderlands 3. 7 hours in, I have no idea what the plot it, everything is a slog, all the enemies feel like a bullet sponges, the menu barely works, my skill tree has reset several times by itself, and the amount of lag/clipping is insane. It's so buggy that's it's pretty much unplayable. Going to wait for maybe a year and see if it's in a state that's playable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The endgame is such a massive L for lacking anything to do. This game came out too early, don't pay full price for it. Don't blame the devs but the higher ups that pushed this out too fast",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've spent hundreds of hours having fun with the previous Borderlands titles, including every single DLC. Loved this series ever since BL1 back in 2009!\r\nBut this time – especially for this amount of money – it honestly feels like a rip-off. I’ve never played a game that feels this unfinished.\r\n\r\nI’d recommend waiting until the price drops and the major performance issues and bugs are fixed.\r\n\r\nSincerely, a Borderlands fan since hour Zer0.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Gargantuan hardware requirements for a game that doesn't look much better than its predecessor. Terrible optimization, boring storyline, even the gameplay was monotonous, which had always been the strongest point of these games. Despite having no expectations, I am disappointed",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I did not like it. I actually depised the story, it's even worse than the 3rd game.\n\nI hated Eden-6 in borderlands 3 because of how big it was. The whole game is nothing but Eden-6 times three. The world is huge but it has nothing to do, nothing about it is memorable. I don't like the alternatives they have over the slaughters or raids.\n\nThis game's halloween event was god-awful as opposed to the one in BL3, which gave you a whole ass map with a raid-like boss and GOOD weapons. And honestly I won't even bother to check the DLC (or PLC like the masterpiece that is Wonderlands, where you paid 15$ to get a map that lasted maybe 5 to 10 minutes) or future events.\n\nI don't like the characters, I don't like how they act like half life 1 NPCs even though this game's 30 years older by this point. Nothing is funny and nothing is interesting. Classic characters are genuinely zombified flanderizations of prior. At least they have a they/them character!\n\nThe guns are cool. That's it, I don't like the skills.\n\nDon't buy this. This sounds lame but games nowadays are genuinely worse",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Alright, I guess I'm doing this.\nMe and my fiance have been playing Borderlands together through our entire relationship, going on fifteen years at this point. We've played the entire series all the way through multiple times. We've both played nearly every character to max level, and have always enjoyed playing the game together. When Borderlands 4 came out, people kept saying it wasn't good, but we were skeptical- we heard people ask the question: if it's just another borderlands game, is that enough? Our answer was yes. \n\nOur answer is still yes. \n\nBut there's no easy way to say this: this doesn't meet that standard. And I'll take the time to go into depth for why.\n\nFirst, expectations. Most assessments we saw before getting the game were negative. We didn't expect this to rival Borderlands 2. We expected, at best, something more on par with 3. We heard there was a darker tone to this game, and that was actually a welcome idea. Taking the series in a new direction could be a good thing, leaning a little away from the cornball humor might be good for things. So while we weren't expecting anything amazing, there was optimism. \n\nThen, the tone- the prologue shows you a villain who takes people's free will and does some pretty horrible things. You see, for instance, a man forced to murder all his friends with his bare hands before snapping his own neck, and another man forced to stab himself to death. This villain comes off as very serious, very dangerous. It'd be like if they actually showed you Handsome Jack gouging a man's eyes out with a spoon instead of just mentioning it. But literally the next scene is Claptrap singing some nonsense song about collecting beach trash for change, and we spend time palling around with him as he's his wacky self. What happened to the darker tone? It's a jarring shift. Even the scenery shifts suddenly- the prologue is dark and dreary, fitting with the dark tone, but it suddenly shifts to a vibrant coastal mountain range that almost looks like something out of fortnite. In game, it hardly even looks like Borderlands. The comic book aesthetic is downplayed compared to previous entries.\n\nNext, the gameplay. There are three issues- the guns, the enemies and the player characters. \nCompared to other entries in the series, the guns are HORRIBLY bland and boring. The \"boring\" manufacturers- that is, the ones that just make \"ordinary\" weapons- seem to be the best for the chunk of the game i played. Gone are the chargeable Maliwan weapons, the Tediores that sprout legs and chase enemies down when reloaded, the Atlas smart bullets. An assault rifle or a pistol from a given manufacturer will behave pretty much the same as another one- you don't see the variety of effects. Borderlands 3, by comparison, had the guns down. Every manufacturer felt different- a Jakobs felt like a cannon, Tediore felt like something someone 3D printed, Dahl like you were playing CoD... Of all the things to screw up, making the guns feel samey in a Borderlands game is unfathomable, but they did it. \n\nThe enemies lack variety and don't do interesting things. In BL3, Maliwan soldiers moved from cover to cover and fought tactically, COV fought with abandon. It feels like enemies all fight the same in this game- and beyond that, you run into the same kinds over and over. You have Rippers, Timekeeper Minions, and animals- and none of them seem to have unique AI, when they even HAVE functioning AI. The amount of times an enemy will just lock in place and let you shoot them to death is staggering. Beyond that, they're SUCH bullet sponges- a normal enemy of your level should not require you to empty several magazines to take out.\n\nFinally, the characters- this is a weird complaint to have to say, but... you get your toys too fast. In Borderlands, by the end of the game, things get silly- you have a Fire Kreig in BL2 shooting homing exploding fireballs at anyone that hits him, and healing for all the elemental damage he does... but you get this at the end of the game. Similarly, my maxed out Ice Zane in BL3 has permanent action skills because the durations reset every time I freeze something. Things GET silly... but here, my gravitar can delete an entire camp of enemies  with one shot of her action skill by level 10. Without depth, and with guns being so weak in comparison, this gets very boring very fast. \n\nFinally, the world and characters... they don't fit with this villain at all. You have a villain literally enslaving a planet and forcing people to kill themselves in brutal and horrifying ways, and the first chunk of the game is a sun drenched beachfront paradise brimming with color and characters acting silly. What happened here? Was there some kind of rift in the writing team? The first town is populated by a pack of what I can only call goofy goobers, not a single one of which looks like they're having anything other than the time of their lives. Sure, they SAY they're oppressed, but when you have your alleged resistance leader literally always wearing a huge grin, \"anxiety baking\" and busting out the star shaped cookie cutters... and the civilians sitting around eating TV dinners in the open while commenting offhandedly that they're not even hungry, they're just eating because they're bored... the town not having a single armed guard, wall or even lookout tower...\n\nWell, I just can't believe that these people are the resistance fighting against the villain you showed me earlier. No.  These people have an overabundance of food, and are apparently so secure that they live in an open town on the road with no means to defend themselves. Were there soft civilians in borderlands 2? Yes, they lived in a walled town full of guards. Were there quirky weirdos hanging around in borderlands 3? Yes, but they were armed and would fight when prompted. \n\nYou might think, some of these reasons to not like it are kinda petty. Well, unfortunately, when your gameplay loop isn't fun, these things really stick out. And this gameplay loop isnt fun. The world is big and empty- like a dead server on an MMO, the enemies are samey, the guns are boring and ineffective, the action skills are cartoonishly imbalanced, the tone is all over the place, and the NPCs don't fit the villain. \n\nBottom Line? We both paid over $100 for this game, and it's pretty bad. I don't know if my fiance feels the same, but I feel like I got suckered. In it's current state, HEAVILY not recommended.\n\nThis is your bread and butter series, Gearbox. \nDo better.",
      "voted_up": false,
      "votes_helpful": 459
    },
    {
      "review": "Game is mediocre.\nGood thing about the game is the level design. Even more remote areas clearly had a lot of work put into it, the layout is creative and the environment well detailed. The designers include a lot of verticality, and with the new movement options the game is actually pretty fun to navigate. I would even argue that this features the best level design in the series by far. \n\nUnfortunately, there isn't really anything to do in these spaces. It's clear that the game suffers from [i] very [/i] poor direction. The game makes no attempt to make use of any of the interesting spaces they've sunk massive amounts of their budget into. \n\nThe writing. Some side quests and characters are well written and memorable. Surprisingly for a borderlands game, I would put some of the dialogue from your playable character in that category. But the writers are much too comfortable borrowing lines, tropes and character archetypes from other sources, so the writing rarely feels inspired. The decision to separate the world into different zones results in a large number of shallow characters and antagonists, as there just isn't enough room to introduce them.\n\nThe side quests and activities. Probably the worst aspect of the game. Only a handful of side quests introduce unique mechanics, require you to interact with the game differently, or otherwise require you to use your brain in any way. Most rely on the \"kill all the enemies\" into \"press E\" gameplay loop. Despite how easy this is to implement, there are many interesting areas that are unpopulated even with this lazy game design, and instead feature maybe a handful of trivial enemies. A shame.\n\nAlso, anyone who has played borderlands 4 probably has the line \"MAYBE THERE IS A SWITCH/HACKABLE CONSOLE SOMEWHERE NEARBY\" burned into their lobes. The developers have this strange belief that forcing the player to periodically interact with a grate, button or CRT monitor in order to progress somehow makes the player feel more engaged. It doesn't. It makes the game feel, you guessed it, repetitive. \n\nThe gameplay. It's actually pretty fun. The skill trees are quite well designed, you can build your character in a bunch of different ways and still feel effective. Gunplay sounds good, and can be pretty satisfying. Sadly, there's only maybe 30 enemies in the game, bosses usually pan out as \"go stand over there or take damage\" and most of the weapons are way worse than a minority of effective ones. So you are fighting the same guys with the same guns, fun at first, but gets stale fast.  \n\nTLDR, playing this game feels like walking through downtown Paris past all the beautiful buildings,\nbut there's no one on the streets just ammo boxes. And as it turns out your quest marker is pointing to a sewer grate and a guy says \"WOAH CAN YOU FIGURE OUT SOME WAY TO GET DOWN TO THE SEWERS\". So you press E on your keyboard and slide down a 45° slope to fight [JIM ROBOT] that's just a reskin of [JOHN ROBOT] so that you can get back to standing around and listening to couples bickering.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It is a fun game, possibly the best Borderlands of all...however..\nI do not recommend it until Denuvo is patched out, it does have real performance issues and having Denuvo removed will improve it",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Cool guns and ideas, poor execution and rushed release.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I used to joke with friends about saving during a loading screen such that the game would load into loading.  It was funny because it wasn't true or possible.  This game takes that nightmare a reality as it stacks \"shader\" compilation repeatedly.  To nobody's surprise, it is not funny.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "if i could refund it i would. The only saving grace this title offers is its gameplay when the game doesn't randomly stutter; adding onto the stuttering part, if the consumer has to download a patch to fix the performance issues a week into launch are you truly ready for a early release randy? My question is what were the specs the devs tested this game on? Because it sure as **** wasn't any new gen card because the 5090 can't even run this game above 60fps+ on 1440p without frame gen. If we're relying on framegen to carry your product into the 60fps+ god forbid the 30fps+ on a fast paced fps, you might be more braindead than the psycho's in-game. Goodluck trying to enjoy the fast paced gameplay when your game randomly stutters at 90+ fps, Unity 5 can work but holy **** when it fails it fails horribly; This game needed more time in the oven.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Still runs like a goat with no legs \r\n\r\nWish I didn't spend so long tweaking settings so I could get a refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[b] BEFORE ANYTHING, I'M NOT TALKING ABOUT BUGS OR GLITCHES, NOR ABOUT GAMEPLAY DIFFICULTY. [/b]\n\nI've played Borderlands before, it was amazing, so I've played the entire franchise and enjoyed it A LOT, decided to pay this absurd price for Borderlands 4 just for the hype and instantly regreted it. The only reason for me not to ask for a refund is the fact that I bought this key on third-party websites for the lower price.\n\nAllow me to explain myself: throughout the franchise you met several relevant characters, all of them were unique, with fun dialogues and interactions that make me laugh the entire gameplay. So now I've been playing Borderlands 4 thinking I must have missed something and the game isn't that bad, I'll just keep playing and the game will just go back to it's pace, but no.\n\nThe game is basically a mix of generic stuff that nowdays games have, the map, the interface, the gameplay, the movement, the story, EVERYTHING. It's not funny, it's simply annoying, I'm still playing whatever the fuck this is while waiting for the old characters to come back with a funny joke or something, but since the beginning it's the same fking thing. The only interesting interactions involved Claptrap being Claptrap. It's simply AWFUL how the game just forces you to related somehow with a generic \"I must keep everyone alive at all costs\" character, a dictator villain that simply doesn't do anything during the story and keep fighting generic enemies that don't have a single unique fun quote. Killing the so called \"Rippers\" doesn't show me any funny voices, jokes, reactions. \n\nFor several times during the gameplay I've killed dozens of enemies just to wonder why the f*ck I am doing it? The boss fights are basically an attempt to make some generic \"learn their pattern\" fights, Borderlands used to have unique bosses with their own presentations, showoffs, dumb moments, but no, most bossfights are basic generic enemies with some huge shield and a huge hp bar and that's it. Notice how I keep using the words GENERIC and FUN because what differs Borderlands from others games WAS the fact that the game had this joke vibe where nothing is truly serious even when it is. \n\nBorderlands 4 show how desperate the company to try bringing in new players using EVERY. SINGLE. ASPECT of every single popular games. While the previous games had their own ways of doing stuff, this game is a mix and a copy of everything you'll see in any other games. The map is HUGE because gamers love HUGE maps with A LOT of activies to do. The interface is super CLEAN and MINIMALIST because gamers love this. You now have the common fast travel methods, the generic skins for your ECHO-4 (and I'm not even going to start yapping about how useless and irrelevant this robot is) that also applies to your vehicle which obviously you can call from any place because every game has this feature, a LOT of collectibles and a LOT of enemies for you to kill and kill and kill again until you're satisfied. Even the compass and radar are a generic common feature from other games.\n\n[i] Just because your map is always full of activities, doesn't mean your game is full of enjoyable content. [/i]\n\nThe old characters are non existent, which minimal to none reference to them. The jokes are almost not present anymore. The interface has changed to fill the entire and screen and does a pretty lame job at telling you're being attacked. The movement mechanics copy every aspect of sliding, double jumping, dashing and climbing that EVERY SINGLE GAME HAVE. You now not only have a map that's filled with bullshit, but also has a line showing you the path to your missions, and you're too f*cking stupid don't worry because this brand new echo-4 can also SHOW YOU A LINE TO YOUR MISSION AND GUIDE YOU INTO FOLLOWING IT like you don't have a enourmous compass in your screen. Even the weapons are not what they're supposed to be! Every weapon vendor had it own personallity, take Bandit (a.k.a. Rippers) for example: they used to be hand made improvised weapons, with junk metal, but now they have alien tech to reload weapons? Jakobs has this western aspect of cowboy guns, but now they also are chargable weapons with purple alien tech.\n\nI've bought the SUPER ULTRA MEGA WHATEVER DELUXE EDITION just to get the additional story and characters and I HOPE this at least give me something better because the game itself it's almost making me give up, it's not hard, it's not easy, it's simply not relevevant. Not to mention the skins, OH THE GLORIOUS SKINS that are generic, not even close to the Borderlands 3 skins, just way too boring for me to even bother speaking about them, except for Firehawk skin, thanks a lot for providing me a moving flame GIF skin for my weapon. The same skins apllies for literally every customizable items in the game, Borderlands 2 had unique skins, Borderlands 3 had unique skins, but THIS?!\n\n[b] I don't know what happened to Gearbox, but you guys need to stop it. I woundn't be yapping about the game if you simply just named this game like it's a new one instead of using Borderlands reputation just to ruin it. This game won't ever live in the shadow of his predecessor.  [/b]\n\nYou guys understand how easy would it be to just name this game anything else? \"Oh, it's a new game with Borderlands inspiration and several references, that's awesome!\"\n\nCalling this game Borderlands is a shame, honestly. It just looks like you don't give a damn about the franchise and are just trying to be another run and gun game just like all the other FPS available. I choose this game because it WAS and still is special to me, but I guess I'll just go back to the old games whenever I feel like having some real fun. I don't even know if I'm ever going to play this again ngl.\n\nFINALLY: CONGRATULATIONS, GEARBOX. BORDERLANDS 4 IS THE SPECIAL KID, YOU'VE MADE IT!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is an unoptimized and boring mess.\nGunplay is actually more than decent but drowned in an open world without any level design and in a story with dull characters and unfunny jokes.\nPlaying it in coop is always resulting in the question [i]\"Why do we play this game instead of something else ?\"[/i]\nI wish I could say more positive things about this game but everything feels just average at best or reeks incompetent developers at worst\nUpdate : Playing without any sound is actually more enjoyable",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The Juice is definitely NOT worth the squeeze... \n\nI've played Borderlands since its inception. The good, bad, and ugly, not necessarily in the order of game release. This is by far the worst of the bunch. \n\nPlot and story aside for a moment (because really... who plays Borderlands for its deep story?) Borderlands has always been a looter/shooter. Heck, it invented the concept really with the first rendition. \n\nYet in this game, it's gone so far as to become a walking simulator - particularly with the 'fetch' missions - where you must cut off your left hand to carry the item - preventing you from using your grapple, or grenades, or even aim/zoom. \n\nAnd the other missions are no better - from one in which the items you need to use in the game are blocked from view by the hazard that kills you in seconds if you don't find it- to arbitrary timers... (Yes, I know those showed up as side missions in other games in the series - including Tiny Tina's). They have drifted from the core of the game to do this... and used what I like to think of as 'Petulant Development'. \n\nThis is where every task, from using the map, to navigating the menus... to using equipment in game and even walking (Because: Invisible walls) to even completing a task, are carried out to such a frustrating degree that it seems deliberate. Every quest destination is as far from any fast-travel location as possible. Every quest has not one or two things to chase down, but 4 and five and six (or more) locations to travel to i n order to complete what should be a simple side quest. Each ensuring you travel as far as possible. \n\nThe devs have no respect for the players time in this game. After all the tedium and slog of going to location after location (Sometimes for no reason than to then go to another location) or every button or device needed for a quest failing to work unless part X is obtained (Which is always clear across the map) first... This is fine if there's a reward afterwards... \n\nBut, there's a reason they added a keyboard mapping for picking up junk - everything that drops, is.  (I have hundreds of hours of play time and yet maybe 20 legendary items to show for it) makes every chest, every boss, every trash mob, simply not worth the time spent killing them, let alone, wasting time farming them on repeat. \n\nThere's a reason fewer than 40% of players have even reached max level yet... and it's not merely 'Performance issues' that are the root cause. It's because no one has the time to spend doing what is arguably fun (The game still and always has great gun play) only to find all your time yielded notta for a reward. When combined with all the tedium the game offers up on the way to what should be a decent reward only to find it's 2 sticks and a piece of pocket lint instead, it adds to the frustration. Not because the gunplay itself is 'hard'... but because the game is over-the-top needlessly tedious. \n\nYour mileage may vary - and I'm not suggesting it's not a step in the right direction for the franchise in some respects (Summon vehicles anywhere/gliding/teleport to friends)- but this is the first time I've ever felt like not playing a game due to the petulant way in which the developers curtail the fun by removing the rewards, and gleefully think that's a good thing. When It actually leaves a blemish on the series as a whole. \n\nUPDATE AFTER  \"FREE\" CHRISTMAS DLC\n\nI played for several hours after this dropped... Not a single legendary to be seen from any mob/chest/boss... I've also played the entire new 'Christmas' quest - the free DLC.  Takes about 2-3 hours to complete depending on whether you're killing every trash mob along the way like I did. \n\nTotal number of legendary items for this investment of time? \n\nZero. \n\nTotal number of items I could equip due to being in any way useful:\n\nZero. \n\nAs I said at the start - for me, the juice (The time invested) just isn't worth the squeeze (the rewards in game for that time investment).   Factor in the tedium ad-nauseum in the quest structure, the widespread performance issues, the quest bugs, the invisible walls, the random hit boxes, and the \"Gee, isn't running around the map, fun?\" and the game renders itself as 'unfun', and delves into 'anti-fun' for far too much of its runtime. \n\nAnd most galling of all for me? That outcome was so 'intentional' it was approved at multiple levels with countless meetings and crunch time pains - prior to launch.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Its cool that Gearbox decided to do an open world Borderlands, but this game isn't cool at all. \n\n- Unoptimized\n- No content after story completion\n- Copies Destiny 2 with a weekly gear vendor (still crap)\n- No real grind\n- Loot is trash\n- Grinding doesn't feel rewarding\n- Aimlessly wonder around doing repetitive crap and forget there is even a story (in a bad way).\n- etc\n\nI am honestly not happy about this purchase.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "wait until this game is at least under $20 in a year's time. \n\nspend your $70 plus tax on something better, please.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "*The game’s checkpoint‑based save system is clunky and outdated.\r\n*Items and vault hunters can vanish due to corrupted files and cloud sync conflicts, even when exiting properly.\r\n*Playing on multiple PCs often leads to mismatched cloud data, wiping progress.\r\n*This is a AAA game with a massive budget, yet Gearbox failed to invest in the infrastructure needed to support its ambition.\r\n\r\nI lost so much gear today, that's what's mostly motivating my review. The game is fun, but has multiple problems like textures missing from items; bosses getting frozen or becoming immortal; there is frequent disconnections and failed matchmaking across different platforms; enemies and items can clip through the terrain; bosses can lag off the side of the boss arena; while in co-op, the guest will lose items if they teleport out of the boss fight and then renter. \r\n\r\nThe most fun part of the game for me is completing the story hardest setting and speed running. The satisfaction slows down once you get all your god loot and lack hard encounters to challenge the builds on. The gaming loop they have could be improved vastly, the open world needs more activity and it doesn't really match the oppression the story tells. There isn't any stimulating ways to farm Eridium currency other than vile bounties. The turrets on the vehicles are also pretty underwhelming, I really miss the old vehicle catch a ride system they had.\r\n\r\nLack of end game, it was strange they didn't include a raid or takedown at launch. With how they boast that most players may never see a pearlescent, not sure why they just didn't release them on launch. I'm conflicted because I do want to still keep playing, but the aforementioned problems are demotivating \r\n\r\nQuotes from CEO Randy Pitchford:\r\n“Real fans will find a way to pay $80 for Borderlands 4.”\r\n\r\n\"Why ya’ll crying, this is a premium game for premium gamers.\"\r\n\r\n“We just don’t worry about the hate online because that’s actually a different form of love. If someone’s commenting, they’re invested, man.”\r\n\r\n“If you’re a real fan, you’ll make it happen.”",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fix the performance, it shouldn't be required to have frame gen on regardless of specs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It pains me to write this negative review as a HUGE borderlands fan.\n\nBorderlands 4 has the potential to be GREAT, but currently it falls short in many aspects.\n\nI wouldn't recommend it at all.\n5/10\n\n- Terrible Performance\n- Horrible UI & Inventory system\n- No mini-map\n- Broken ECHO-4 navigation system\n- Empty boring open world\n- Lack of diversity of environments\n- Vibe isn't \"borderlands\"  \n\nHonestly, making Borderlands 4 open world was a HUGE mistake. The linear map design of previous titles allowed for a wide variety of atmosphere and different environments.\n\nI have also re-played previous borderlands throughout the years resulting in thousands of hours. I have 70HRs in BL4 and I am completely bored of it. I have no desire to play different vault hunters and min-max like I have in previous titles.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Words cannot describe how unpleasant this game was. At first it seemed like an average Borderlands game with interesting gunplay and a possibly interesting environment. However, halfway through the story I realized that the available weapons were uninteresting and the enemies were always the same. I played the game in coop on the hardest difficulty. Towards the end of the game the enemies started to be higher level than us and the game became an unpleasant shooter where the enemies were walking, or rather flying bulletsponges, who had an unacceptable amount of spamming attacks that could oneshot you with one wave. We didn't do any side quests because I was already fed up with the game and just wanted to finish it. During the entire game I didn't drop a single legendary from any of the main bosses, just a sad pile of blue and green useless weapons. I played as Forgeknight, my skill points kept resetting throughout the game, for some reason I was two levels behind my teammate and my fist attacks didn't work half the time. I've never experienced a worse game glitch. I got the game for free with my graphics card. I wouldn't buy the game with my own money. I won't comment on the main story because it practically didn't interest me at all. I don't know what the developers were thinking when creating this game, but they weren't good ideas. I don't recommend the game at all, it's better to play the third or replay the second.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Do you like stutters? Crashes? Shaders constantly compiling? Updates being applied outside of the Steam UI? A game that makes the COD series look innovative? If you answered yes to any of these questions, Borderlands 4 is the game for you! Remember vehicle combat? That's gone. God awful writing has been replaced with terrible writing with story content that has to have been generated with an early iteration of AI. Enemies are bullet sponges and offer no challenge. Simply hold the left mouse button down until the enemy dies, then move the cursor to the next enemy. Once all the enemies are dead you will get a pop culture reference, then more enemies will spawn, another pop culture reference and you can turn in the quest. I have just described all of the quests in the game. Don't even bother with this if it is on sale. There are so many other games that are worth your time. You deserve more than this. You deserve better.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Boring characters with no personality, story is incredible boring and feels like endless fetch quests, lost its sense of humour from previous games. Weapons are kinda sucky and takes like an hour to kill enemies....\n\nBig borderlands fan, so really sucks this is a terrible direction the teams taken...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Not much to say. It's Borderlands... except this one failed to really capture my attention. Normally I don't really care about the story for this series, but I REALLY didn't care about this one. I can't even recall a single event that happened in this game and I sure as hell couldn't tell you what was going on. I hardly remember any of the characters outside of the established ones like Moxxxi. It's just so damned boring. After a while, playing this game felt like a chore.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Empty open world with loads of filler travelling, bland and boring world, Worst guns in a BL game so far.\r\n\r\nJust pick it up when it's complete in a couple years for £15.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Performance has only got worse, had to compile shaders 3 times to get into gameplay, then had to compile shaders again every time I fast travelled. Each time was anywhere between 2 and 20 minutes.\n\nAt launch I didn't have many performance issues, but now the game struggles to hit 30fps.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nerfing content in a PVE game. Are we Serious right now? If you're one of the people that thinks some weapons are too OP, then dont use them. It's that simple.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For the price it's a complete rip off! It's just a revamped version of borderlands 3 A complete waste of money, I use to be a borderlands fan but this pile of junk has turned me off of the franchise and I'll stick to the best ever version of borderlands and that is B2",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "How are you going to release a $70 game and still have bugs that stops you from completing missions. Literally unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As a casual Borderlands player (beat BL2 twice, BL3 once, Tiny Tina 50%), it does many things right (world events, SDU upgrades) but overall its just boring compared to BL2 & 3. Side quests are long, locations are not memorable, your home base is not something cool like a city or ship & overall had a hard time getting into it.. Will re-review once I beat the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so unoptimized I can't get a solid 60 frames with a pc I've built and put $3k into. Every time I launch the game, \"Compiling Shaders\" for 5 minutes. You aren't compiling shit because the game doesn't work.\nI can't even get a refund at this point.\nThis company is shit.\nFire randy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No sir, its not borderlands.\n\nThe open world just killed it.  Gone are the days of going into a dungeon and here are the days of the outpost (crawler) checklist.  They poo'd out a bunch of Points of interest on a map that all look the same, go do the same thing at every location between three boring areas.\n\nThe main Villain feels like he could be something awesome, but sadly, you barely hear from him.  Instead, you just take care of three completely unrelated bosses in the three areas.  Do it in any order you want!  Freedom!  Yea, hard to tell a story with any impact out of order.  Imagine reading the last Harry Potter or LOTR before the first?  When the entire story is made in this way, the isolated elements really don't feel like they come together well.\n\nThe loots is horrible, the new gun manufacturers might fit someones game play (both are basically hold the trigger mechanics, one being hold the trigger is Required and the gun doesn't shoot right away the other being hold the trigger is optional to charge a shot).  The whole \"cross manufacturer\" thing was novel in the beginning but Borderlands didn't need that, and it really just added MORE RNG in an already tiring system.\n\nPerformance wise, I didn't see any issues BUT I am playing on GForce now with access to the best graphics cards.  I don't doubt others are having issues, but I just wanted to say overall, this doesn't feel like a Borderlands at all.\n\nBoring loot (which that is broken too, I keep getting class mods for other classes STILL), boring world with soulless content, potentially good Villain wasted.  Dont get it, especially at 70 bucks...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Disappointing PC Port with Fundamental Design Flaws\nThis game feels like a rushed console port to PC, suffering from bad performance and technical instability. It's simply not worth playing in its current state; consider waiting for a major sale or holding off entirely.\n\nVoice Communication: The game restricts communication to voice chat only, lacking a typing option, which is a major accessibility and preference issue for PC players.\n\nCo-op Misunderstanding: The current development team seems to fundamentally misunderstand what a \"real coop game\" requires.\n\nLack of Depth Feedback: Unlike previous titles, the ability to compare builds or power level among players has been removed. No duel or any pvp option.\n\nPoor Vehicle Design: Vehicles are poorly implemented, specifically lacking multi-seat functionality (like a turret seat), which further limits cooperative team play.\n\nConclusion: The current team appears to have missed the mark on delivering a true co-op experience. unacceptable when you consider it`s a veteran studio and it`s not they first game and they poured hundreds of millions of dollars and many years of development on this project.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A Destiny game in a Fortnite map with Borderlands characteristics.\n\nAlso runs horribly.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've always loved borderlands and while I still liked the third installment for its mechanics its story was terrible. Borderlands the Fourth tries to recover on the story front but here's the thing.\n\nIt tries to be Destiny, It tries to be FO76. It tries to be another FOMO weekly play for 10 minutes scheduling point in your life. With the ridiculous drop rate reduction to almost zero - that they tried to display as something the community wants - alarm bells should've already went off. So now were here, nothing feels rewarding but at least we've got the \"weekly activities\" bulletin and a vending machine that acts like Xur. Drip feeding you the stuff you bathed in playing the previous titles.\n\nThe story is fine, the games performance is mid bordering on bad. The characters are decent and some cool builds can be made but the road is paved with white and blue items and none of it feels as exiting as it did in earlier titles.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Two words are sufficient to give you the most important bit of information you might need:\n\n[b]Buyer beware![/b]\n\n\nBorderlands 4 comes with [i]severe[/i] bugs and crashes. As of writing you are [u]guaranteed[/u] to encounter issues during your playthrough. I played the game together with several friends, all of whom are tech savvy hardcore gamers. All of us had played the previous titles as well and each of us had constant and repeating problems with Borderlands 4. This game should not have been released in this state.\n\nI don't like to speculate on whether or not any issues will be addressed by the developer (if at all) but previous Borderlands titles (despite all their massive problems around launch) were not in nearly in as sorry a state on release. Save yourself the disappointment and just wait this one out.\n\n\nBeyond that, if you come from the previous titles in the series, you might want to know this:\n\n- No LAN support anymore.\nBorderlands 4 is a typical \"always online\" game experience. You will get disconnected every once in a while, even if you are sitting in the same room and the rest of the internet keeps on working on your machines. Could be their servers, could be the ISP but either way it's a free dose of frustration coming you way regularly. We all know there's no need to be always-online for a co-op game you want to play with friends. It creates a miserable and frustrating experience - welcome to modern gaming.\n\n- Optimization is atrocious.\nPeople are not making this up. You can not get stable frametimes on a 4090, nor on a 5090, nor on a 5070 on lowest settings. No matter if you use the latest drivers or run DDU to try stable drivers from over a year ago, your frametimes will be all over the place. We are fairly tech savvy but each of us suffered without caving in and enabling DLSS or frame gen (which causes us to suffer in return - I'll spare you my musings here).\n\n- Crashes at random intervals.\nThe game will crash on every system at some point if you play longer sessions. We have a sample size of 4 hardcore no-lifer gamers who can play 10 hours every day without a single hiccup or crash, yet Borderlands 4 will have issues regularly for every single one of us. It's not tied to specific in-game content, it's not tied to hardware, it's just broken code that needs fixing. If you can't handle missing out on loot or progress from having a crash happen at the worst of timings, then please spare yourself the frustration.\n\n- Lots of bugs.\nThe game has several bugs and glitches. What gets annoying in multiplayer specifically: Talents are resetting in the talent screen randomly on non-host machines. Netcode causes jitter in moving surfaces or vehicles players are supposed to walk on. The good old \"Items can fall through the floor\" is also still a thing (on very flat and visually safe terrain mind you). You will find talents and procs not firing, despite you meeting all conditions.\n\n- Bad UI on PC\nBorderlands always had a \"console-friendly\" UI but this time around there's a lot of \"quick tap to do one action, hold button to do a completely different action\" baked into inventory management. To compare items in your inventory you need to press R once. If you want to drop the item you need to hold R for a while. You can imagine how fun this gets if you do it for 50 items you want to share with friends. Some UI elements are not showing up correctly for some players (despite them being on the right step of a mission). The minimap is frustrating to handle (and mandatory for traveling). They're all downgrades over the previous games.\n\n- Realtime rendered cutscenes are locked to 30fps (for no reason whatsoever).\nYou can look forward to watching stuttery scenes regularly during the campaign. If you are locked into fast paced combat, your screen fades for the a fraction of a second and you get draged into 30fps of wonky cutscenes you are bound to notice what's going on. Good luck trying to ignore how jarring that is.\n\n\nLet me point out [b]a few good things[/b] some might care about:\n- You can set FoV, limit framerate, disable headbobbing, disable screen shake, disable motion blur and tinker with all kinds of settings you might expect from a first person title.\n- The game has enough content and build variety to keep up with previous games (balance issues aside but that's part of the fun for all loot and build based titles)\n- The game has slightly improved gunplay over previous titles and the Unreal-Engine-typical floaty movement causes less frustration this time around.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Falls flat.\n\nThe core combat systems are good, the artwork/ level design clearly have passionate people behind them and some of the side missions are genuinely funny BUT... The main story is really bad and you jump from zone to zone so often that the world lacks identity.\n\nIts sad that it gets so close to being fantastic but ultimately falls flat in favor of being a live service.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good game, better than previous part but terrible optimization drags it down to the \"sewers\". Until they optimize game I cannot recommend anyone to buy this game because this terrible optimization will ruin your expectations and experience for this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was able to play through a stuttering mess for just under two hours. Hardware specs are all at or above the \"recommended\" yet it takes 3+ minutes to compile / load shaders (while increasing the shader cache size to 10gb) and the game runs horribly. Constant stuttering or freezing for 2 seconds in a fight just to go down. I'd love to try the game again once the performance is sorted out but for now I'm gonna refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the worst, most terrible piece of trash I have ever played. After more than a decade on steam playing every Borderlands game, I can say that this is a piece of unplayable trash. It works fine on my rig but in order to get up just one level, you will need at least 1.5 hours per level. Right from the start, you will die like its UVHM and empty mag after mag just to kill one trash enemy. Some enemies are so difficult and bugged they are unkillable, leading me to quit playing. I have never once left a review on steam before but after paying so much money for a piece of garbage I could not resist",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Supposedly I have now played this game for 47 minutes. In reality, I have played it for zero minutes. I have spent all morning just trying to get the shaders to compile. Thats now done. Now I'm trying to get the actual game to run. What a waste of time.\n\nUpdate...after persevering and about 20-30 crashes, the game ran. And it runs really well. Fingers crossed. Something I noticed that kept me persevering with it, after the first 10-15 crashes it seemed I was getting further and further through it every time. I'm feeling a bit more optimistic now, but I worry that I haven't even yet got to the stage where crashing is spoiling the actual gaming as oppsed to the set-up.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Having just sunk 50 or so hours into this and beating it i can speak confidently in saying this is a good borderlands game.\n\nHowever, the performance still leaves much to be desired, the guns were not as fun nor interesting as previous iterations. I will say I actually liked the plot way more than 3 or even 1, the boss fights and vault guardians are really well done. Hell this game might have some of the best side quests in the series.\n\nBUT with the performance still not where it should be a month post launch, and the weapons being honestly lame as hell sometimes, wait for this to hit $30 or less.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've loved Borderlands games since the first game, but I'm finding it difficult to like this one. It's been absolutely plagued with issues, particularly freezing and crashing, and it's now at a point where I can't immerse myself in the game because I instead feel like I'm killing time waiting for the next crash.\n\nCompared to Wonderlands, which was incredible, Borderlands 4 just feels like an empty hole of a game. The character and place names seem AI-generated (so does some of the writing), and the world bosses, while an interesting concept, get boring and repetitive quickly.\n\nWe're playing the game on Hard, and the only real difficulty is finding ammo for the bullet-sponge enemies. Having sunk 50 hours into it so far, I'll be taking a break for a while and hope they can fix the performance and instability issues. This absolutely was not worth my money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game is boring story boring weapons boring  why the made it open world idk skip this borderlands",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "People talk about how poorly optimised this game, and it is, but the bigger crime is that it just doesn't draw you back in. You see it in your library but feel no burning desire to play it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "2 months later and the game still runs horribly.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gameplay can be fun, story is an improvement. But MAN is this game still buggy. Charging premium to get into the beta of a game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I thought I could outsmart Randy. I was wrong. I waited for all the patches to drop, the GPU Driver update to come out, and the inevitable discount to try and recover the poor initial sales numbers. \"Oh, I'll be good,\" I said, looking at my mid-range hardware. It exceeds the recommended, yet is not so new that compatability issues should arise! \"It'll be fine,\" I said, clearing my shader cache, allocating plenty of SSD space for the game and NVIDIA to do their thing.\n\nBut it was not fine. Randy was waiting, without a drop of lube, to violate my gaming experience in ways I couldn't even comprehend. It runs fine, sure. Buttery smooth even without frame gen on my modest output until everything goes black. I'm pretty tech savvy. I've run through every troubleshooting guide, editing this file and that setting to try and get more than thirty minutes of uninterrupted gameplay out of this game without disaster striking and I have failed.\n\nLet my hubris be a warning, potential buyers. You are not smarter than Randy. You will not get lucky, your setup is not good enough, and your technical expertise doesn't matter. Maybe, one day, I will get to experience this $100 paperweight sitting in my steam library, but it probably won't be in 2025 and I really wish I had that hundred bucks to spend on something I could play this year.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Why is coop again super buggy?\nWhy does this game crash every 90 minutes?\nWhy do they keep making the same game over and over again with almost no innovation?\n\nApart from that, coop was still kinda fun. And the writing is not as bad as in 3, but still horrendous.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is NOT borderlands. I have played 1,2 and 3 , loved them , replayed them multiple times but this is not anything like those games. Its more like doom or resident evil, fight a mob of enemies, move 100m fight another mob, repeat, repeat, repeat. There is nothing to get invested in, the story ( what there is ), the characters, the areas, all boring and bland.\r\nAlso they released a unfinished game, its had more patches and updates and adjustments than any game I can remember. Its full of bugs and every update seems to add more, it may address some issues but also add new ones. I spend more time on the internet trying to find solutions than I do playing, after every update it resets all your skill points so you have to reallocate them, now its messed up my sdu, I still have the points but I cannot allocate them, its just one problem after another. \r\nIf you loved borderlands, give this a miss and stick with the first 3 games, they are light years ahead of this game. \r\nA total waste of my hard earned money.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Super fun, its the best gameplay of the series, but also super unoptimized, i cant recommend this game in this state, but as soon as this mess is properly fixed it will be worth every penny. Hell of a game, 10/10 when it works, which is not that often tbh...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In some ways it's a good game, but in others they've managed to create a bad Borderlands game.\n\nIn my opinion, the best game in the series was Borderlands 2. While Borderlands 3 significantly improved the gameplay and graphics, it made the story and characters quite boring. Still, its similarities to Borderlands 2 made it somehow bearable.\nBorderlands 4, however, took this a step further. They improved the gameplay even more, but managed to make the story and characters even more boring. Unfortunately, I can't say the same for the graphics and the art style.\n\nWhile the Unreal Engine technically offers much more advanced features, I don't see them in the game. There's no special RTX lighting effects, no realistic water effects, or stunning scenery. Despite all this, the game loads much slower, leaving you constantly waiting for shaders to load. The cartoony art style we were accustomed to in Borderlands 1 and 2 is gone, and the tone-down makes it feel like you're playing just another looter shooter.\n\nChoosing an Elden Ring-esque \"open world\" map is a huge mistake. The problem isn't the expansiveness of the map itself, but its presentation. You walk around as if you're going to discover hidden places (Borderlands 2, for example, would have hidden areas or trophies from places you'd never even consider), but the place you reach turns out to be just a random monster kill zone. This significantly diminishes the exploration experience.\n\nWhile the map design initially evokes the Elden Ring vibe, it unfortunately lacks the lore-informing details or small references that game offers. This makes the open-world map feel even more empty. Yes, the game offers the opportunity to collect bubble heads. But they're so small, you might miss them even if you look carefully. This detracts from the sense of discovery you get from the game, not enhances it.\n\nThe movement features they attempted in Borderlands: The Pre-Sequel (long jumping and flying) are much more successfully implemented here. I'll give the developers credit for that. Things like flying around the map, jumping, hopping, and double-jumping are much more fun than driving. However, the lack of hidden areas I mentioned and the problems with the open-world map exploration significantly diminish the usefulness of these jumping mechanics.\n\nThe storytelling, which was so annoying to me in Borderlands 3, centered on the \"preventable deaths of supporting characters,\" feels even more intense here. This diminishes the excitement you should get from the main story.\n\nBorderlands 3's endgame raid maps offered a very enjoyable experience. Here, they've eliminated that and filled it solely with boss challenges. This further diminishes the enjoyment of the game. By the end of the game, builds that force you into quick fights among dozens of enemies are meaningless; the only important weapons and builds that allow you to one-shot bosses are the ones that matter.\n\nThey've included a lot of customization in the game, but it doesn't really make sense when you're playing. You find yourself constantly killing the same creatures in the same places. And all these customization options don't offer any additional fun or immersion.\n\nI think instead of releasing this game, they would have been better off creating an MMORPG set in Borderlands 1-2-3. Instead of a \"vault hunter,\" playing a soldier from a major Corporation, trying to rise to the top (like Rhys or Jack), while simultaneously fighting through the story of another game with each expansion, would have been a much more enjoyable experience. This open-world infrastructure they've created would have had more meaning.\n\n5: Below average - It may not appeal to everyone, but there are interesting ideas from time to time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played again for the second time not too long ago with some friends. And the performance is still terrible and tbh mixed with the boring gameplay idk just not having fun at all lol. Will go back to borderlands 2 tbh.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "As a longtime fan of Borderlands, I was on the fence about getting this game because of the mixed reviews I've been seeing. I decided to get it on the off chance that I'd like the game despite the reviews.\n\nHowever, I was thoroughly disappointed when I booted the game up just to receive a nearly unplayable amount of frames. I have a 2080 super and a cpu that compliments it's performance, yet I can't get more than ~50 fps on all the lowest settings. Additionally, the game crashed twice in the small time frame I played it.\n\nI have since refunded it. I hope the devs can make the game playable, the spec requirements are absolutely atrocious and heavy optimization is needed to make this game bounce back at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've given Borderlands 4 the benefit of the doubt for awhile now in hopes that this game will get enough patch fixes to remedy its myriad technical issues. Considering how much money 2K and Gearbox have to throw at this game I think it's time to give this game what it deserves:\r\n\r\nA negative review. It's been two fucking months and Gearbox has yet to stabilize their game in terms of performance and functionality. Everybody knows about the glaring performance issues, so I won't go into that here: even if you have a machine that can handle this game decently well, you're still going to run into all manner of broken shit that will wall off your progress. Every other quest you do will break somehow and you'll have to find a workaround to \"fix\" it when things get stuck, and sometimes there's nothing you can do at all. This is hands down the most buggy Borderlands game I have ever played.\r\n\r\nIf Gearbox can manage to wake up their damn playtesting team to make sure that something as simple as quest mechanics aren't completely broken, I might consider changing this review to positive and describing everything that I like about this game in detail. Until then, I cannot recommend Borderlands 4 in good conscience. Stay away unless you're some kind of masochist with a stonewalling kink.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So I can get around 100+ frames in Cyberpunk and BF6 on max settings (without  AI frame generation or DLSS btw). But in BL4... 50fps. I cant bother with the frame gen in this game because it makes my controls lag. I keep downloading and then deleting this game after every update since release. I just cant with this game. Maybe in a year or two they might make the game playable on PC. Cant recommend this game in its current state.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game isn't bad, but it shouldn't have been released in this state. It can take minutes for the shaders and textures to properly load when first booting the game; this issue being so bad for one of my friends that he doesn't even want to boot the game up anymore until this gets addressed. I get stutters and FPS drops on an i5-10600K with a 4070S running in 1440p. That should not be happening. I don't even have the settings maxed. \r\n\r\nNot to mention the really annoying UI/UX problems like: \r\n* no minimap leading to constantly pressing tab breaking immersion and gameplay flow \r\n* menu/inventory interface is extremely clunky, a huge step back from the ones in previous games. BL2 had such a snappy and simple menu, I'm not sure why we had to take such a step back. \r\n* we need to be able to track more quests in an open world format like this \r\n\r\nI'll be leaving this review up as negative until the game is in a better state. i love borderlands and want to sink a ton of time into this game but I simply just don't want to in this state and I can't believe gearbox pushed it out the door like this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The amount of effort put into storytelling makes me wonder how much of this was AI written, trying to \"feel like borderlands\" but ending up as a washed down version of it.\n\nThe most effort put into cutscenes is in the trailers. There are some key cutscenes missing: game goes from \"you're in this vehicle\" to teleporting to the next scene \"now you're here and oh btw you crashed\" without any transition.\n\nPerformance is abysmal for the quality it delivers, performance patches are there only as placebo and deliver maybe 1-2% improvement at the cost of having to wait tens of minutes overall for shaders to compile.\n\nGameplay is okay i guess...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was fun until my interest fell off a cliff in a matter of days. Now I can't even be bothered to launch it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "there is nothing special about this game, seems like there is no new mechanics or anything, its mind blowing howe they can charge so much for a reskin with new abilitys, the story is ok; you wont remember the story after you stop playing",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gearbox has lost sight of what made their franchise so great. You can't put lipstick on a hog and expect us to be happy. Why are there playstation 1 mechanics in this game, why does the loot suck, why is the map a million times worse to interact with. WHY. So frustrating.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Three crashes in two hours of gameplay. I honestly *did* enjoy what I got to play, but if I can't rely on the game actually running for more than ~45 minutes at a stretch, then I'm not gonna bother with it. Pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's borderlands but its just super bland the characters and missions the dialogue  are all just re-skins of 2 and 3. if you dont have an ssd to store it on it crashes regularly. The first mission runs on just long enough to ensure you go over the 2 hour max for return. The game gives you so much ammo you never have to buy any which is good because the bosses arent hard at all they just soak ammo for 20 min until you finally kill them. !!! ITS JUST NOT WORTH THE PRICE !!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Its 'Good' as a 50-60$ game, if your playing more than that --> Dont!\nThe main campaign is good, some plot twists and interesting turns in the story. My main issue is with some of the layout it quests / sidequests - in more than a few cases theres the old \"go here grab this\" and \"stand by while we hack this door\", which is fine. But, then there is others where you literally have to run back and forth to places to talk to npc's (which we could have easily just called), find an item /lever/box hidden in an areas, leave an area only to come back immediately, and all it really devolves too is alot of \"timesink\" questing, built not with fun in mind but moreso with the mindset of \"how can we make this longer\" \nOtherwise, gunplays good, bootup takes forever to 'compile shaders\" (every time you launch), co-op is smooth and works well even when playing with people of different levels, 'vaults' and their respective bosses are not varied and fairly copy-pasted (lazy)\nAll in all a great 7/10 but im having a real issue paying 90$ (which i foolishly did) for games and them continuing to have 50-60$ games worth of content, not a single new mechanic is in this game that hasnt been done before, premium prices *must* come with premium expectations from the consumer\nSeeing this game on sale now is frustrating, why did i have to pay a premium price that was so easily dropped to 70$ not even two months after launch, at 50-60$ this is a 'ok' choice for what it provides",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "leave it to unreal engine and sh*tty devs to ruin the performance after \"performance patches\" crazy how it was at least playable in a somewhat stable state in 1080. upgraded my gpu cause i wanted a 5060ti and now i have to run the game in ever worse settings??? thanks unreal for ruining the gaming industry and making compiling shader sims!! 10/10 the biggest pile of dog sh*t now",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is a game-breaking bug, where if you even momentarily disconnect when playing multiplayer, you will lose all of your skills. This has apparently been a known issue for at least three months, and hasn't been addressed. If you plan on playing this game multiplayer, I'd recommend staying away until this issue is resolved.\r\n\r\nGearbox claims to have fixed this two months ago, but searching Reddit shows that other people have encountered this issue more recently.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "great for first week but since patches/updates a stuttering mess even after 15 min and clearing backend . \r\n Have tried jumping back in 3 different weeks, 2 weeks after launch and finished campaign week one. last game ever buy off 2k. rtx4080",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have never played a less optimized and broken mess of a game as this. I am sad. I love Borderlands. Instead of actually fixing anything, they are announcing DLC and new characters. Pretty disgusting business practices. I had to download a new game (Dying Light: the Beast) just to make it wasn't my rig. I can play that brand new game perfectly on the highest settings with no issues. It looks photo realistic and doesn't stutter. Borderlands 4 is a cell shaded cartoon and runs like utter donkey dicks. FUNK THIS SHITE OF A GAME",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Over all mid as fahckin' hell really not worth getting the DLC, or even the game. Go buy some furry, gooner, ai slop and just call it a day. Would probably have even more fun with the scrathers at the gas station, that methed up Tony keeps screaming about. \n\nOver all guns are great.\n\nThis part may be a skill issue on my end, but when I hear \"Traditional Borderlands Level Scheme,\" I think of BL2 where if you go to an area, all the enemies are still at the level when you first see them. This is going off BL3's \"Level scaling\" where every enemy just so happens to be nearly the same level as you. This leads to some pretty one sided fights where you ultimately get violently dogged on. THAT is unless you're moving around like methed up Tony mentioned earlier.\n\nLike I said before, better to just play the scrathers, or buy more AI gooner slop. \n\n4/10 wrist cramps from Jacob guns being generally the best weapon for crit fiends like me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really want to like this game, and I really do as far as the game play goes. When it comes to performance, this game is impossible to run on high or ultra settings without a literal super computer. For comparison, I run mostly every game on Ultra or High settings with no problems. I was hoping that eventually they'd address these issues post launch, but it seems Gearbox's CEO has doubled down on not fixing the graphical issues. \n\nAs the game currently is, I don't recommend it until they address the graphical issues that would make this games experience much more enjoyable. If you have a nice computer, you might enjoy this, otherwise you likely won't.\n\nEDIT: I clicked the link in the developer reply, sent more details and was met with a bot response on \"PC troubleshooting\". So much for \"continuing to work on ways to optimize and improve\" when i now know nobody is ever gonna see or read that. Thanks Gearbox 👍proving my point in the review in record time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have a monster computer build and this game is a stuttering mess, waiste of time and money. I've played all the borderlands games and beat all of them multiple times. I tried giving this game a chance but it boring and has too many issues then I care to deal with. Just really disappointed on how this game turned out.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "barely any content with no endgame with trash weekly activities.  pretty clear they're chopping this game up and will sell you the endgame. dont even get me started on the trash performance.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Performance is still a joke. when it works the game is fun. shoulda bought on console... the main problems i have - 1. it crashes at least once every time i play it. 2. performance is atrocious and you'll either be looking at a potato for a decent framerate, or expect 20-40 fps tops with a 30xx series nvidia gpu even on medium settings. (mine is 3070). 3. the incessant shader caching/downloading. Sometimes I sit down to play and it takes 15-30 minutes to do this if I haven't played in a while. Last time I played it did this for 20 minutes, and crashed a few minutes after i finally got into the game... then it downloaded shaders AGAIN for another 7 minutes the next time I launched it later that same day. If you're gonna buy this - probably get it on Playstation unless you have an insanely powerful rig- I'm guessing console companies would have higher QA, and this shader downloading nonsense is my biggest gripe.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As the game is right now, would not recommend. Or at least not on the replayability side of things.\r\nMy first playthrough collecting everything and doing some side missions was fun. Then i decided to 100% the game, requiring to play all 4 characters to max level. safe to say that the remaining 3 were more of a task then a fun playthrough. You have to collect every collectible again on every character, every teleport (kinda understandable). The unneccesary amount of dialogue gets annoying very quick. And once you are done with everything.....there realy isnt any end game right now besides hunt the shiny weapons. Im sure this will get better with future content additions and DLC. \r\n\r\nBut for now i will rank this game at about a 8/10 on first playthrough\r\n4.5/10 on replays. \r\nObviously not a permament rating since the game still has stuff to come out. especialy the hints that takedowns might come back.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "2 months post launch the game still barely runs, constant stuttering is miserable. I do not have a premium PC though. Probably a fun game if you can afford a 7090TI & 15000x, because this game was obviously designed for rigs 10 years in the future.\n\n>3070ti\n>5700x\n>32gb 4800mhz",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love Boarderlands so it breaks my heart to leave a bad review but here I am months out and I still can't play this game I prepurchased. I tried working with the support team but they cycled me back through to the same steps I had already taken multiple times and I never got the same support agent working my case for more than an email or two. I tried everything maneageable on the internet and in forums to try and get this game to run for more than 10 minutes of game play. I've poured easily 20 hours and likely closer to 40 into trying to get it to stop crashing. During that time I logged 6 hours of play, most of it on frozen screens and adjusting settings at the startup. I was hoping an update would resolve these issues but that update still hasn't come. Its disappointing to see such a great franchise just blow the rollout so hard. Soooo many people have had these issues and they won't give me a refund because I invested over 6 hours into trying to make it work. I definitely won't be buying another Boarderlands game until well after launch if at all. Also, super annoyed with steam for giving me no recourse to appeal the no refund determination.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2] A hollow resemblance of what we loved in previous games [/h2]\n\nOh well...\nI can’t stop thinking how we had a series that was fun and memorable for many, and once again developers turned it into nonsense.\n\nBased on numerous reviews, there's already a wide range of problems. Here are mine:\n- The game only starts with Wi‑Fi disabled, otherwise it freezes during the in‑game update. Two months since release, still unresolved.\n- I can only run it on min-medium settings, despite playing most of the 2025 titles on max without having any issues. Lame optimization makes visuals impossible to judge - all you see is a poor image.\n- Localisation is basically a machine translation which makes dialogues and descriptions unnatural and story difficult to follow.\n- Music (especially the music!), characters, enemies, and weapons all feel bland compared to earlier entries.\n- Various glitches like bosses get stuck in their movement boxes, random enemies barely react and move back and forth, open world fauna weirdly slides on a ground, rifle crosshair randomly disappears, etc.\n- Sound design is rediculous - weapons, grenades, explosions all have some kind of stock arcade effects. You may probably think it's not the most important part of a game, but it's rediculous how cheap and unnatural it sounds.\n\nAfter 3 hours, I don’t know what I accomplished, where I progressed, what happened story-wise... and honestly, I don’t even care.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "TLDR - buy the game when its 50% off.  Its been a month and they already did a 20%.  Give it till Steam Summer sale next year probably.\n\nperformance - Im on a 3060 lol and I only had major issues in prologue area (which WAS dreadful with constant dipping) but once got into main section, it was actually pretty decent.  DECENT, not good or great.\n\nstory - underwhelming\n[spoiler] 3 seperate areas with no connection, 3 factions and not even a Fallout: NV Dam battle as a finale?  And they are all identical mission wise.  Just different set designs.\n\nthe villian had potential to be cool.  Guy has ability to possess ANYONE at ANYTIME and he supposedly is \"terrifying\" but he barely is in the story.  He introduces himself and hypes himself up, and then proceeds to talk to you like 3 times on ECHO until the final act of story.  Can we talk about how lame the final act's twist was.  How did Zadra not realize the vault hunter had glowing yellow eyes and a robotic vocal shift INSTANTLY?  And \"he knew to target your echo\" YEAH BECAUSE THAT WAS ESTABLISHED TO BE THE ONLY THING PREVENTING THE TIMEKEEPER FROM MAKING US SHOOT OURSELVES.  But people probably forgot about that 50 hours ago.\n\nAmara losing her arm only for a new robotic one to be installed next time we see her (like what, maybe an in game hour after she lost it?).  So much for \"A Siren's power do not come from their tattoos.\"  She could have been such a BAMF and had a mini story arc using Lillith as an inspiration.  Like if Lillith can move a moon or some shit, surely you can generate a phase arm. \n\nAlso, they missed a hilarious joke with the Dahl subscription thing by not forcing you to make an account, set up auto pay.  And then because you're trying to save the world, you forget about it until some random side quest way after where you spend an hour trying to cancel it, but they have so much red tape that you just decide to blow up the DAHL facility.  Just saying.  Would have been so funny for the game to just take out $20 every hour or something. [/spoiler]\n\nworld design - what a draaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaag\ngood luck ever replaying this game.  Mindless driving around and following the echo line from collectable to collectable.  Just use a save editor to duplicate the save and modify character.  I am NEVER making a new save in this game lmao.\n\nside quests - better than the main questline\n[spoiler] claptrap quest where he lets go of the past to embrace a new future on a new scary planet because now he finally has a new thing to be proud of.  A new friend :)\n\nThat missile quest where it discusses dreams and desires and feelings of failure.  Humanizing a missile,  I'm just glad she was not a dud all along.  My mind was playing \"Firework\" by Katy Perry whole time.\n\nThat random one where you make the ULTIMATE PBJ but because he is a raider he didn't know the final item started with a G and he just kills himself. [/spoiler]\n\ndifficulty - press W and hold left click\nIdk if Vex is just broken, but you can't die.  Full HP bar heal when you press F, cheat death every like 120 seconds or whatever, life steal and bonus kinetic damage.  Like you don't even need to swap weapons.  And when you find a boss just pull out a Torgue sticky shotgun and use your action skill to get an infinite mag until your action skill almost ends then just press R.  And you kill every boss in the game with no aim, no skill, just left click.  I rushed main story because I was really bored, skipping any enemy that wasn't required to kill.  Beat game at like level 31 or something and killed final boss in like 15 seconds using a level 20 green torgue sticky shotgun.  I barely looked at loot, barely interacted with it, just had whatever in all my slots and that is ALL you need in this game.\n\nAlso, weekly reset to farm player metrics.  So cringe, don't add this to your weekly chore list.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game is buggy as hell. No improvements from BL3 in terms of graphics textures. And yet it runs very rich and crashes frequently. No improvements in gameplay. Grappling is supposed to make the gameplay faster but the weapons are slow. This is just another product release from a jira board. No heart and soul behind it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game worked well enough on launch. some crashes and stuttering but not unplayable. for the past month or so the game barely launches and is actually unplayable. i haven't seen the main menu in weeks and always crash while loading shaders. if anyone knows a fix i'm happy to hear it but i'm beyond upset my $130 is wasted on this. if you have the highest end PC money can buy i can promise an enjoyable experience, anything less will result in disappointment \r\n\r\nPC specs:\r\nCPU: Ryzen 7 3800X\r\nGPU: GeForce RTX 3060 12GB\r\nRAM: 32GB\r\nand loaded onto a 1TB SSD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Needs a bunch of work, optimization shouldn't mean struggling to get 60 fps on even med-low settings. Only thing (tbf a huge thing) holding this game back, otherwise its borderlands.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "holy shit this game is boring.......I know 7+hrs isnt shit compared to some 40+, but im just straight up not enjoying this right now",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It just doesn't do it for me.\r\n\r\nThe writing isn't as obnoxious as Borderlands 3 and actually made me laugh a few times.\r\nThe gunplay and movement is the best in the series.\r\n\r\nUnfortunately, most quests are shallow and short.\r\nThe open world is uninteresting and full of repeat objectives.\r\nMoments that should have emotional impact just... don't.\r\nLots of bugs, lots of design decisions that leave you asking \"why?\"\r\n\r\nYou can tell that there are individual developers that put a lot of passion into this game, but the direction just isn't there. Borderlands 4 appears to be yet another victim of mismanagement, which has become all too common in the industry. The people who care and have actual vision are not the ones in charge of the decision-making.\r\n\r\nIt's a shame. I wanted to like this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My computer can run Forza Horizon 5 while moving through the map at 400km/h while being a highly detailed world. Borderlands 4 is an animated game, completely unplayable after having tried to fix the issue playing with graphics for hours, even factory resetted. On top of that the game itself is so poorly made that my AI controlled reaper minion couldn't even hit a single enemy. I have obviously been scammed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fix ur game mate. i pushed through the entire game simply for the fact i been a fan since the first release meaning my whole gaming life. ive passed every game with every character on all modes on console and every release and has gotten more lackluster. BL2 still holds the crown. \n\nFirst borderlands where i woudnt replay. passed and done. not even gonna try another character. \n\nAnd by pushed through i meant even having a super pc now and putting the in game settings to low, shit had the optimization issues compared to the slop of when Star Wars Jedi Survivor came out. WHOLE time i was stuttering like a cod lobby just moving back and forth til the lag disappeared for a bit and then back to it...\n\ntheres even a yt vid of a dude going analytical on the performance from release to the last update and it increased his frames by 1..... idk im just madly dissappointed being a fan of the series.\n\n\njust wait til the game is like 10 bucks with all the dlc and updates",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}