{
  "positive": [
    {
      "review": "so uhm, really damn good game, dont buiy horizon 5, it sucks, nobody gunna see this review anyways bc you cant buy this game anymoreee",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "Forza Horizon 4 is a true celebration of speed and freedom. The game impresses with its scale and attention to detail: the vast open world of Great Britain, changing seasons, dynamic weather, and stunning graphics create the feeling of a living, breathing world.\n\nGameplay\nA huge selection of cars – from classics to supercars.\nEach car feels unique, and the controls are intuitive and responsive.\nCompetitions are varied: on-road racing, off-road racing, drifting, challenges, and even creative missions.\n\nOpen World\nGreat Britain looks incredibly beautiful: picturesque villages, mountain roads, fields, and cities.\nThe changing seasons completely change the atmosphere and driving style – slippery in winter, vibrant and dynamic in summer.\nAtmosphere\n\nThe soundtrack perfectly underscores the excitement and spirit of the races.\nThe online mode allows you to compete and interact with other players, creating the feeling of a true car festival.\n\nConclusion: Forza Horizon 4 is a game you'll want to return to again and again. It offers freedom, excitement, and a true sense of celebration for car lovers. If you're looking for the perfect open-world arcade racing game, this is it.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Best racing game I have played in my life. I hate driving on the left side of the road(thanks Brits). The Youkay looks nice though.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Forza Horizon 4 nails the open-world racing vibe with its gorgeous UK landscapes and dynamic seasons. Driving feels fun whether you’re casually cruising or racing flat-out. There’s always something new to do, and the constant stream of events keeps the game feeling alive and exciting.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Amazing game, one of best in series, and the fact its Delisted and if you do own it you cant get any DLC you missed as well as some events being defunct now is a bloody shame. Incredible 10/10 games being Delisted due to licensing and other crap is such a let down as many wont be able to enjoy this games beauty through normal means. If you can find a third party copy, or a game key I highly recommend grabbing it!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "its a good game for stress relief, kinda chill",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is awesome and its an amazing forza horizon game. i love the seasons and the car selection they really rock but the music is kinda mid. i'll just be driving around the map and taking photos cause of how beautiful the scenery is 8/10 game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent environment. Map is way more enjoyable than in FH5 and winter views are stunning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best way to describe this game is “automotive happiness.” It’s easily one of the most relaxing yet exciting racing games ever made. The whole “changing seasons” system makes the map feel alive—winter ice, autumn leaves, muddy spring roads, each one shaking up how your cars behave. The driving sits in that sweet spot between arcade fun and believable physics, where you can slide around a corner like a maniac but still feel the car’s weight. The map—Britain, but the dreamy postcard version—is packed with events, secrets, barns, and speed traps. It’s one of those games you open to play for 20 minutes and suddenly 3 hours disappear. The festival vibe throughout is infectious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can confidently say that Forza Horizon 4 is the second best Forza game ever released, right behind Forza Horizon 3\n\nIf you like racing games, then give this title its well-deserved chance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game for budget gamers, you just need to do a little bit practice, then you'll fell in love with this game,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i miss this game. i love the map, i love the car selection, and what i wouldn't give to play this game back in its prime again.\n\nforza horizon 6 please be good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After fully completing this game i can definitely say that its one of the best racing games in the industry. It has a large open world which brings cool vibes of the UK. Also the seasons system makes the world look different and less boring for those who play this game a lot. The graphics is pretty decent though it might feel a bit old, but in general it feels OK even in 2025. The only disadvantage that i consider to me crucial is the onliine activities which are pretty boring and very laggy from time to time. All in all i definitely recommend this game for every person who loves racing. If you are struggling to choose between this game and FH5, you might need to check the overviews but in my personal opinion this one is even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is truly a masterpiece. Although it is unfortunately no longer being supported, that doesn't mean this game isn't one of the best ones I've played ever. The gameplay is smooth, the customization abilities for your vehicles are amazing, and is overall an amazing experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always love this type of game, where it's free roam, and the feeling when you drive is always a great experience from the game. Hope I have more free time to spend in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I just played the single player things and had an amazing time reminds me of the old need for speed/ midnight club 3 times not in the gameplay but the atmosphere of the game. loved it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Really nice graphics for a 1650 super.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Forza Horizon 4 nails the open-world racing vibe with its gorgeous UK landscapes and dynamic seasons. Driving feels fun whether you’re casually cruising or racing flat-out. There’s always something new to do, and the constant stream of events keeps the game feeling alive and exciting..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best racing game. Lots of cars and the visuals looks stunning. Got this before it went off from steam store. Loved this game. Controls feels realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have countless hours on this game, only 20 or so on PC but on xbox 1 i played it for numerous hours. now i can tell you that Horizon 4 is the best in the franchise. everything about it is perfect. i have no complaint other than they removed the best of their game and left the worst one up. i feel sorry for those who never gotten the chance to play this one. huge miss out. Horizon 6 im sure will do great unlike 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I love it and in my opinion its better than Forza Horizon 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stunning graphics, cool cars, boring genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Forza Horizon 4 is a really fun racing game with beautiful graphics and smooth driving. It was once a dream to play a Forza game, drive amazing cars, and just enjoy the insane visuals. The changing seasons make the game feel fresh and exciting every time you play. Overall, it feels like a true car lover’s dream come true.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watched every trailer for this game in 2018, excitment was through the roof, but I didn't have pc at the time, so I had to wait a bit before I got a new pc in 2020 and let me say, couldn't be more happier with this purchase. The open world of this game really shines, while real life UK is not that sunny most time of the year, it was a nice window to see beautiful UK really is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy this now if you haven't plaeyed it, this is the best forza of all time. Servers are still on, you can pretty much enjoy it until forza horizon 6!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] 9 / 10 [/h1]\n☆ = Story\n★ = Content\n★ = Gameplay\n★ = Difficulty\n★ = Music\n★ = Sound\n★ = Graphics\n★ = Performance\n☆ = Support\n★ = Replayability",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Forza Horizon 4 is one of those games that just pulls you in. Its open world, set across the Scottish Highlands, feels calm and immersive, making every session incredibly relaxing. Progression is smooth, with plenty of main and side missions to complete, and the car catalog is impressively large.\nThe Forza franchise speaks for itself.\n\nOverall rating: 8.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best Forza Horizon in my opinion. the cars, the maps, the game modes, the soundtracks.. all of them become a masterpiece. most banger intro introducing seasons.. dont forget to listen to Dawnbreaker while racing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what smoootttth graphic and driving. nice to play with epic scenery of UK.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "--{ Graphics }---\n☑ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is nostalgic and fun to play.In my opinion the last good forza game after horizon 3 . Instead of forza horizon i would still play this any time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aamzing World, realsitic physics and graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "besides me forgetting they drive on the left and crashing 24/7 its a pretty good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great racing game, between arcade and simulation, just as good as the other other ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first racing game, so i cant really compare it to anything else, but its been really fun. Seems like there is always something to do, and there is always room to improve your skill. My S1 Jeep Trailcat is still my favorite car, even after getting over 250 cars, and many X tiers. Might upgrade it eventually, but it is rock solid for nearly every event. Get the Fortune Island and the LEGO DLC if you can, they are worth it IMO.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Change the xbox log in. It's terrible.\nThe game is great,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Modern Day Racing game I ever played\" 😎🔥.\r\nSmooth gameplay, amazing visuals, and intense races — everything feels top-notch. The car selection and customization are incredible, and multiplayer is pure adrenaline. 🏁\r\n\r\nAnd the best part? I got this game for only 259 INR. 💸🔥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best arcade racing game that's I ever played! Ideally physics, beautiful graphics, smooth performance and interesting open world activities around all similar games. Recommends 10/10👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2]9.3 / 10[/h2]\nSadly, this game is no longer available on the Steam. But it is a really good game for relaxing after some work. Cars drive smoothly and the world itself feels immresive. I really liked the amount of cars and their customization. You can easily spend countless hours here from trying to beat your own time to just enjoying the view.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Un juego de coches increíble. El mejor que he probado. En la Steam Deck va de fábula además.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved the game and kinda got addicted even though i drive bad and better than wasting time on that crush who has friendzoned you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and beautiful game!!! Forza simply always delivers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, if a lot of the \"online only\" components would be switched to either online or bot, it would be so much better. But, still fun, and relaxing when you need it to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best 2017 game there is it is realistic (other than the crashes) it has the actual cars and it honestly is just a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game. fr have had this game for a year and just started and  its to much fun . hate i started so late ):",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The driving and racing really get in the way of all the unskipable cut scenes!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Forza games better than F5 . Not played many hours on PC yet but great on Xbox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First of all, I hate anything british(except Top Gear trio).\nRoads r absolutely horrendous and handling is dogwater, even with a controller. Modifications r limited as well.\nMissions/storys r unbelivably boring.\n\nDespite of all, I like the competitions and offroad or rally races. \nPS: I got the gold edition for $8, I'd say it wasn't really worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS GOATED, THIS GAME GOT ME IN CARS, I LOVE THIS GAME WITH MY HEART, WHEN I GROW UP AND HAVE KIDS, I AM GOING TO PLAY THIS GAME, I WILL THIS GAME WHILE I AM MAKING KIDS!!!!!, RECOMMEND IT< 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love Free Roam, you love Forza Horizon. Go for it.\r\nAlso, go for Forza 5 if you're having hard time deciding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hello developers. For the third time I'm suggesting this, any chances to add any sort of LGBTQ+ representation in forza? As a transgender, this would increase the playerbase🏳️🌈🏳️🌈🏳️🌈\r\n\r\nYou are celebrating the first week after launch and already talking about content updates but there is still no sign of LGBTQ representation. It feels like you focus on quick post launch hype while ignoring the fact that many players want to see themselves reflected in the game. It is disappointing and frustrating.\r\nEDIT: Like I said on other game announcements for my suggestion, anyone who clown awards me will be BLOCKED",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice car stimulation game I ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game nice car nice graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the vibes, views, experience to drive nice car, experience to drive in some UK places that make me want to go to UK so much to feel the vibes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better that forza horizon 5 except the car sounds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came for the racing\r\nStayed for Pulse Horizon station",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Cars Good Music Good Visuals Better than Forza 5 ( Personal Opinion)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This review will be legendary because you can't buy the game anymore anywhere lol.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great for 2018 to 2019 era of gaming, but its a decent game to revisit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tonight I wear a hat, Richard wears a hat and James... wears a hat.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "love this game, but not too many options for cars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this game, sad to see it's servers shut down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the graphics and the sound of the cars and the way they drift and all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its simply a tuff game. Dosent matter that its 7 years old",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AWESOME GAME TOTALLY RECOMMEND ITS NOT LIKE NFS NOT MUCH ON STORY SIDE BUT ITS FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun , i aint no fan of the racing games even tho im racist but i like this one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beatuiful, beatiful, beatiful game. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unsuprisingly better than the 2nd game on xbox 360",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BRING IT BACKKKKKKKK PLEASEEEEEEEE!!!! i had almost every single barn find and every car, tons of really good stuff, and a super rare car that was being built... I WANT THE STUFFFFFFFFFFF",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good, better than Horizon 5 IMO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Forza Horizon 4 is one of those games that just never gets old. The way it captures the feeling of driving through the British countryside — with changing seasons, weather, and lighting — is still unmatched. Every car feels unique, the world is packed with life, and the freedom to explore however you want makes it easy to lose hours at a time.\n\nI’ve spent plenty of time just cruising around, listening to the soundtrack, and enjoying the scenery. It’s not just a racing game; it’s a whole atmosphere. Whether you’re tuning cars, racing friends, or just drifting through small towns at sunset, it nails that perfect mix of realism and fun.\n\nEven after all these years, Forza Horizon 4 still looks beautiful and runs great. It’s one of those games I keep coming back to — not because I have to, but because it’s genuinely relaxing and fun to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very nice game with realistic graphics but no ford mondeo:(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm not a \"car guy.\" \r\n\r\nForza Horizon 4 is a lot of fun and feels like party that never stops.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "rally cars, collecting like, driving on dirt ass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely class game, shame it’s delisted from steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Drove pretty fast so I say it is pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Beginner friendly \r\nI learned to drive in RL too!\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BRING IT BACK!\n\nits the best forza game handsdown",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cat goes vrooom\nCat be drifting\nCat is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good expirence , best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- get in your car\r\n- crash a little\r\n- almost kill someone \r\n- get back to your garage \r\n- load up Forza 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "graphics sounds everything is good about this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good open car game and chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game I enjoyed it, even tho it isnt the newest one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Forza Horizon off all time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best open world racing game ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game still boring tho lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the very best racing game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its overall a good fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was worth it to buy before delisting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill game for price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lOVE this game \r\ni like free drive more than races",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good thing i got this game in time\n\n\ncool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aestetic view and a lot of cars!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than fh5 favorite forza.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well... as far as racing goes.... This game is awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just good and good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, vrrom vroom.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Launches as a backround task and eventually overloads the ram crashing my computer",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "extremely buggy and fragile, does not even launch",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you fucking assholes, i bought this game over steam, and now i can't log in. ask me to log in on xbox microsoft account, and when i wan't to do that, i can't... repair this or fuck you",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yeah great game when it launches!\nGo on a software engineering course to find out how to launch it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "get the microsoft version instead of this garbage if you decided you want to keep buying from macrohard.\r\n\r\npersonally i wont",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Man, I hate Xbox games. Old Xbox games weren't this annoying. They started doing it somewhere since mid 2010s, implemented Xbox login requirement (it already was annoying in AoE3:DE), but to make you login every single time you open the game is just evil.\n\nAlso, cars slide too much, like you slightly press right/left, and your car loses control on the turn like it is Toyota Supra going full speed, but no, it is just a family car that goe to 100 in 6 seconds, so how does such slow car loses control on a simple turn? Realism? No. Gran Turismo is considered the most realistic game (there is even a documentary about it), even it didn't have such ridiculous controls. That is because you have 10-20 bar options where you slide them left or right to customize your cars \"control\" or \"feel\", if you will. But there is no simple guide for it, the devs just threw that option, and people on the internet speculating which option suits your play style. I mean it is a racing game, who cares for such customization? DiRT 3 Complete Edition also had this feature, but it was mostly useful car driving aspects. If I really wanted to waste 100 hours learning to customize car driving, I would buy a car and drive it in real life, even driving a car in real life is easier to drive it in FH4, FH4 is not a realistic racing game, it just pretends to be. After all, it is a racing game, you should press forward, and car should go vroom vroom, not swush swosh.\n\nThe good thing is that there is still offline part of the game, so you still can drive and race (for the most part).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think I'm done with Forza Games.  It is time to move on.  Have previously played FH1 and FH3.  Fun for a bit and then got bored.  Now I'm bored of this one too.  Among the weakest of missions in this game is the Skill Points.  It seems boring and non sensical.  I read some thread on Reddit explaining Skill Points and it still felt boring and non-sensical.  The series seems soulless.  I don't think I have witnessed a single like-abale character with a voiceover in this series.  And the statistics screen after a successful race is downright creepy.  1984 Dystopian vibes.  Even the character I selected is downright creepy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wont use logitech G wheel if bought game from steam, works if bought on ms store, other games works directly with it from steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely Terrible force feedback system with no setting in game to turn it off. It's kind of like having an annoying bratty toddlers randomly grabbing at the steering wheel while you're trying to drive. \"It's my turn to play\" forza horizon screeches as it steers me into on coming traffic at high speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Геймдизайн будто бы из рекламы стиральной машинки. Сама игра ощущается как та самая реклама порта овердохуя известной игры на мобилки. Казуалам (говноедам) понравится, остальным не советую",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if forza 6 will require me to bind all the buttons on controller i will run the biggest smear campaign on that game world has ever seen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Physics model in this game is horrible. Feels like you're driving on ice everywhere you go.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "LEGOs in videogames is a shizzy idea, quit forcing me to watch the shizzy lego ad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The racing is great. \n\nThe \"story line\" is so cringe I can't bear to play it. You have to sit through more \"influencer\" nonsense than time spent driving. Its so, so cringe.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cloud data disabled to synchronize at all, and additionally require new log in for my xbox account, howevwer error occured after i complete file...so i bought it couple years ago and you gonna tell me all playing hours is in vain?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Works terrible on Windows 11. Game from Microsoft cannot be optimized for Microsoft OS. Sounds really funny",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Learn to handle controls please, I can't even login...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a little boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "oyun açılmıyo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wheel has so much delay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nfsu2 had better engine sound",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "small indie company can't renew licenses for a 2018 game released on steam in 2021 and delists it in 2025 go fuck yourself microsoft\n\nedit: 2018 game not 2016",
      "voted_up": false,
      "votes_helpful": 165
    },
    {
      "review": "Launches as a backround task and eventually overloads the ram crashing my computer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wont use logitech G wheel if bought game from steam, works if bought on ms store, other games works directly with it from steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game used to run fine in my PC, now for some unkown reason it crashes right after the login in the xbox account. I have tried several solutions and nothing works. \r\nMicrosoft literally has my money (and i bought several DLCs) and I cannot play this shit anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "extremely buggy and fragile, does not even launch",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "after many years, this game still cannot recognize Moza's wheel and many others, only Microsoft Store version is available with wheel, and the dev team decide to delete every single discussion about the bug, they also let an autobot to response \"problem solved\" to every single bug ticket, good game, but stupid devs, cannot fix a bug",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you fucking assholes, i bought this game over steam, and now i can't log in. ask me to log in on xbox microsoft account, and when i wan't to do that, i can't... repair this or fuck you",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bloated with annoying filler content. I just want to jump in and race, I don't need a back story, events, microtransactions, character customization, gtfo here with all that. Feels like an EA sports game bloated with unnecessary sh1t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah great game when it launches!\nGo on a software engineering course to find out how to launch it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "get the microsoft version instead of this garbage if you decided you want to keep buying from macrohard.\r\n\r\npersonally i wont",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Man, I hate Xbox games. Old Xbox games weren't this annoying. They started doing it somewhere since mid 2010s, implemented Xbox login requirement (it already was annoying in AoE3:DE), but to make you login every single time you open the game is just evil.\n\nAlso, cars slide too much, like you slightly press right/left, and your car loses control on the turn like it is Toyota Supra going full speed, but no, it is just a family car that goe to 100 in 6 seconds, so how does such slow car loses control on a simple turn? Realism? No. Gran Turismo is considered the most realistic game (there is even a documentary about it), even it didn't have such ridiculous controls. That is because you have 10-20 bar options where you slide them left or right to customize your cars \"control\" or \"feel\", if you will. But there is no simple guide for it, the devs just threw that option, and people on the internet speculating which option suits your play style. I mean it is a racing game, who cares for such customization? DiRT 3 Complete Edition also had this feature, but it was mostly useful car driving aspects. If I really wanted to waste 100 hours learning to customize car driving, I would buy a car and drive it in real life, even driving a car in real life is easier to drive it in FH4, FH4 is not a realistic racing game, it just pretends to be. After all, it is a racing game, you should press forward, and car should go vroom vroom, not swush swosh.\n\nThe good thing is that there is still offline part of the game, so you still can drive and race (for the most part).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think I'm done with Forza Games.  It is time to move on.  Have previously played FH1 and FH3.  Fun for a bit and then got bored.  Now I'm bored of this one too.  Among the weakest of missions in this game is the Skill Points.  It seems boring and non sensical.  I read some thread on Reddit explaining Skill Points and it still felt boring and non-sensical.  The series seems soulless.  I don't think I have witnessed a single like-abale character with a voiceover in this series.  And the statistics screen after a successful race is downright creepy.  1984 Dystopian vibes.  Even the character I selected is downright creepy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely Terrible force feedback system with no setting in game to turn it off. It's kind of like having an annoying bratty toddlers randomly grabbing at the steering wheel while you're trying to drive. \"It's my turn to play\" forza horizon screeches as it steers me into on coming traffic at high speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll be honest, I did enjoy this game but for multiple reasons I can't recommend anyone buy it in it's current state, which isn't going to change since they've long since abandoned this for FH5.\r\n\r\nFirst off, the bugs. Even on Xbox series X, you can reliably crash the game to your home screen by simply going into the festival menu, backing out and re-entering. Playing the game with a wheel is hit or miss, sometimes it works fine. Sometimes you'll be playing and all of your controls suddenly drop and remap to something else. Sometimes the game just freezes on you for no reason. Twice now my PC shut down on it's own without warning just going through cars in the menu, while apparently drawing nearly 200w from the GPU and pushing it at/above 70C. (4K/high preset, limited to 60fps on a 5700XT.) My fiance's nephew used to play this a lot via the microsoft store version, but his save file dropped after having hundreds of hours and now it's making him start over.. I'm also pretty sure this specific game destroyed the 980 Ti I gave him after also handing down a 1080p144hz monitor when my fiance gave me a birthday upgrade.  \r\n\r\nBugs aside the game just has some really annoying quirks. Festival hosts, after you're done with some events will just suddenly decide when and where you're going while you're in the middle of going through all the races for a particular event just to forcefully shoehorn in another type of event. Fast travelling will play unskippable DLC advertisements at random. For a game that's portrayed as an open world arcade style driving game, it sure does like to butt that freedom of exploration out of the way on a regular basis.\r\n\r\nThis game used to be fun but it's just not worth it anymore. Even if you have a decent experience, knowing that the prior Forza Horizon games aren't even available for sale anymore unless you get a disc copy, you're on a timer for how long you can even enjoy this game at all before online servers are completely shut down and you can no longer sign into the game to play it singleplayer. I'm pretty sure the online races are gone now, not that I really participated in them anyways but that's another reason to probably not bother buying it at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Геймдизайн будто бы из рекламы стиральной машинки. Сама игра ощущается как та самая реклама порта овердохуя известной игры на мобилки. Казуалам (говноедам) понравится, остальным не советую",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if forza 6 will require me to bind all the buttons on controller i will run the biggest smear campaign on that game world has ever seen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Physics model in this game is horrible. Feels like you're driving on ice everywhere you go.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LEGOs in videogames is a shizzy idea, quit forcing me to watch the shizzy lego ad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The racing is great. \n\nThe \"story line\" is so cringe I can't bear to play it. You have to sit through more \"influencer\" nonsense than time spent driving. Its so, so cringe.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cloud data disabled to synchronize at all, and additionally require new log in for my xbox account, howevwer error occured after i complete file...so i bought it couple years ago and you gonna tell me all playing hours is in vain?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Works terrible on Windows 11. Game from Microsoft cannot be optimized for Microsoft OS. Sounds really funny",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Learn to handle controls please, I can't even login...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a little boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "oyun açılmıyo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bots suck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nfsu2 had better engine sound",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "small indie company can't renew licenses for a 2018 game released on steam in 2021 and delists it in 2025 go fuck yourself microsoft\n\nedit: 2018 game not 2016",
      "voted_up": false,
      "votes_helpful": 165
    },
    {
      "review": "The game used to run fine in my PC, now for some unkown reason it crashes right after the login in the xbox account. I have tried several solutions and nothing works. \r\nMicrosoft literally has my money (and i bought several DLCs) and I cannot play this shit anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Launches as a backround task and eventually overloads the ram crashing my computer",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "extremely buggy and fragile, does not even launch",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "after many years, this game still cannot recognize Moza's wheel and many others, only Microsoft Store version is available with wheel, and the dev team decide to delete every single discussion about the bug, they also let an autobot to response \"problem solved\" to every single bug ticket, good game, but stupid devs, cannot fix a bug",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think I'm done with Forza Games.  It is time to move on.  Have previously played FH1 and FH3.  Fun for a bit and then got bored.  Now I'm bored of this one too.  Among the weakest of missions in this game is the Skill Points.  It seems boring and non sensical.  I read some thread on Reddit explaining Skill Points and it still felt boring and non-sensical.  The series seems soulless.  I don't think I have witnessed a single like-abale character with a voiceover in this series.  And the statistics screen after a successful race is downright creepy.  1984 Dystopian vibes.  Even the character I selected is downright creepy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you fucking assholes, i bought this game over steam, and now i can't log in. ask me to log in on xbox microsoft account, and when i wan't to do that, i can't... repair this or fuck you",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bloated with annoying filler content. I just want to jump in and race, I don't need a back story, events, microtransactions, character customization, gtfo here with all that. Feels like an EA sports game bloated with unnecessary sh1t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah great game when it launches!\nGo on a software engineering course to find out how to launch it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "get the microsoft version instead of this garbage if you decided you want to keep buying from macrohard.\r\n\r\npersonally i wont",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Man, I hate Xbox games. Old Xbox games weren't this annoying. They started doing it somewhere since mid 2010s, implemented Xbox login requirement (it already was annoying in AoE3:DE), but to make you login every single time you open the game is just evil.\n\nAlso, cars slide too much, like you slightly press right/left, and your car loses control on the turn like it is Toyota Supra going full speed, but no, it is just a family car that goe to 100 in 6 seconds, so how does such slow car loses control on a simple turn? Realism? No. Gran Turismo is considered the most realistic game (there is even a documentary about it), even it didn't have such ridiculous controls. That is because you have 10-20 bar options where you slide them left or right to customize your cars \"control\" or \"feel\", if you will. But there is no simple guide for it, the devs just threw that option, and people on the internet speculating which option suits your play style. I mean it is a racing game, who cares for such customization? DiRT 3 Complete Edition also had this feature, but it was mostly useful car driving aspects. If I really wanted to waste 100 hours learning to customize car driving, I would buy a car and drive it in real life, even driving a car in real life is easier to drive it in FH4, FH4 is not a realistic racing game, it just pretends to be. After all, it is a racing game, you should press forward, and car should go vroom vroom, not swush swosh.\n\nThe good thing is that there is still offline part of the game, so you still can drive and race (for the most part).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wont use logitech G wheel if bought game from steam, works if bought on ms store, other games works directly with it from steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely Terrible force feedback system with no setting in game to turn it off. It's kind of like having an annoying bratty toddlers randomly grabbing at the steering wheel while you're trying to drive. \"It's my turn to play\" forza horizon screeches as it steers me into on coming traffic at high speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Геймдизайн будто бы из рекламы стиральной машинки. Сама игра ощущается как та самая реклама порта овердохуя известной игры на мобилки. Казуалам (говноедам) понравится, остальным не советую",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if forza 6 will require me to bind all the buttons on controller i will run the biggest smear campaign on that game world has ever seen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Physics model in this game is horrible. Feels like you're driving on ice everywhere you go.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "LEGOs in videogames is a shizzy idea, quit forcing me to watch the shizzy lego ad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cloud data disabled to synchronize at all, and additionally require new log in for my xbox account, howevwer error occured after i complete file...so i bought it couple years ago and you gonna tell me all playing hours is in vain?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Works terrible on Windows 11. Game from Microsoft cannot be optimized for Microsoft OS. Sounds really funny",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Learn to handle controls please, I can't even login...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a little boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "oyun açılmıyo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wheel has so much delay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nfsu2 had better engine sound",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "small indie company can't renew licenses for a 2018 game released on steam in 2021 and delists it in 2025 go fuck yourself microsoft\n\nedit: 2018 game not 2016",
      "voted_up": false,
      "votes_helpful": 165
    },
    {
      "review": "The game used to run fine in my PC, now for some unkown reason it crashes right after the login in the xbox account. I have tried several solutions and nothing works. \r\nMicrosoft literally has my money (and i bought several DLCs) and I cannot play this shit anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Launches as a backround task and eventually overloads the ram crashing my computer",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "extremely buggy and fragile, does not even launch",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "after many years, this game still cannot recognize Moza's wheel and many others, only Microsoft Store version is available with wheel, and the dev team decide to delete every single discussion about the bug, they also let an autobot to response \"problem solved\" to every single bug ticket, good game, but stupid devs, cannot fix a bug",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think I'm done with Forza Games.  It is time to move on.  Have previously played FH1 and FH3.  Fun for a bit and then got bored.  Now I'm bored of this one too.  Among the weakest of missions in this game is the Skill Points.  It seems boring and non sensical.  I read some thread on Reddit explaining Skill Points and it still felt boring and non-sensical.  The series seems soulless.  I don't think I have witnessed a single like-abale character with a voiceover in this series.  And the statistics screen after a successful race is downright creepy.  1984 Dystopian vibes.  Even the character I selected is downright creepy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you fucking assholes, i bought this game over steam, and now i can't log in. ask me to log in on xbox microsoft account, and when i wan't to do that, i can't... repair this or fuck you",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bloated with annoying filler content. I just want to jump in and race, I don't need a back story, events, microtransactions, character customization, gtfo here with all that. Feels like an EA sports game bloated with unnecessary sh1t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah great game when it launches!\nGo on a software engineering course to find out how to launch it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "get the microsoft version instead of this garbage if you decided you want to keep buying from macrohard.\r\n\r\npersonally i wont",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Man, I hate Xbox games. Old Xbox games weren't this annoying. They started doing it somewhere since mid 2010s, implemented Xbox login requirement (it already was annoying in AoE3:DE), but to make you login every single time you open the game is just evil.\n\nAlso, cars slide too much, like you slightly press right/left, and your car loses control on the turn like it is Toyota Supra going full speed, but no, it is just a family car that goe to 100 in 6 seconds, so how does such slow car loses control on a simple turn? Realism? No. Gran Turismo is considered the most realistic game (there is even a documentary about it), even it didn't have such ridiculous controls. That is because you have 10-20 bar options where you slide them left or right to customize your cars \"control\" or \"feel\", if you will. But there is no simple guide for it, the devs just threw that option, and people on the internet speculating which option suits your play style. I mean it is a racing game, who cares for such customization? DiRT 3 Complete Edition also had this feature, but it was mostly useful car driving aspects. If I really wanted to waste 100 hours learning to customize car driving, I would buy a car and drive it in real life, even driving a car in real life is easier to drive it in FH4, FH4 is not a realistic racing game, it just pretends to be. After all, it is a racing game, you should press forward, and car should go vroom vroom, not swush swosh.\n\nThe good thing is that there is still offline part of the game, so you still can drive and race (for the most part).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wont use logitech G wheel if bought game from steam, works if bought on ms store, other games works directly with it from steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely Terrible force feedback system with no setting in game to turn it off. It's kind of like having an annoying bratty toddlers randomly grabbing at the steering wheel while you're trying to drive. \"It's my turn to play\" forza horizon screeches as it steers me into on coming traffic at high speed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Геймдизайн будто бы из рекламы стиральной машинки. Сама игра ощущается как та самая реклама порта овердохуя известной игры на мобилки. Казуалам (говноедам) понравится, остальным не советую",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if forza 6 will require me to bind all the buttons on controller i will run the biggest smear campaign on that game world has ever seen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Physics model in this game is horrible. Feels like you're driving on ice everywhere you go.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "LEGOs in videogames is a shizzy idea, quit forcing me to watch the shizzy lego ad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cloud data disabled to synchronize at all, and additionally require new log in for my xbox account, howevwer error occured after i complete file...so i bought it couple years ago and you gonna tell me all playing hours is in vain?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Works terrible on Windows 11. Game from Microsoft cannot be optimized for Microsoft OS. Sounds really funny",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Learn to handle controls please, I can't even login...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a little boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "oyun açılmıyo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}