{
  "positive": [
    {
      "review": "Updates have made huge improvements, as have some of the UI mods. I dropped the game a few weeks after launch but am back playing it and am really enjoying it. The latest update, 1.3.0, has made the civs feel different to each other and made naval and coastal civs far more enjoyable. I probably still won't play  modern age until they make more legacy path improvements as that is still the least fun part of the game.",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "I've been playing Civ Games for 30 years. Civ 7 comes in with the best graphics to date. The diorama style to buildings, cities and topology are a perfect evolution from the flat textures of the original. The UI isn't my favorite of the series but it doesn't bother me either. The updates and changes to the UI have been a step in the right direction. At minimum I find the UI aesthetically pleasing.\n\nThe Civ switching mechanic was a bold choice but I think aligns with history in a truly organic way. Does Rome still exist? Does Babylonia still exist? Does any indigenous empire like the Mayans, Aztecs or Shawnee still exist? And the most omnipresent country/empire in the history of the world China is available the whole game as different dynasties respectfully. While it may be a detraction from previous titles, I think being as historically accurate as possible is one of the core values of the series within the scope of you forging an alternate take of said history. If you build it, they built it first. If you conquer, they conquered it first.\n\nThe Leaders are well done and has you thinking about how you want to play and rule the world from the get go. This is a change from the nation/empire choosing of the rest of the series. This is one thing where historical accuracy goes out the window but seems necessary in that various figureheads of great nations and empires continue to be relevant. Think how Caesar, Genghis Khan and Napoleon for example still inspire and awe the world we know today. \n\nCombat is the best of the series for me. The attention to detail of units, buildings, wonders and city states is all wonderfully executed. I'm glad Barbarians are gone forever. The AI still needs cooking. The diplomacy, religion and espionage mechanics still feel like they need to improve and be fine-tuned to truly stand out above previous iterations. The winning conditions and legacy paths still feel hollow and need to be fleshed out more for them to be truly impressive. Winning in Civ 6 for example feels more satisfying than Civ 7. The culture victory is clumsy and is the least exciting and tedious way to win a Civ game I can remember. \n\nThings I miss or wish were added in regards to previous iterations in the series are numerous. Things like the World Congress, Governors and designing your palace. The fantasy elements that have been included, modded and were stand alone games are something I wish was available, even if they detract from history as it unfolded. I'm talking about my favorite iteration Civilization II: Test of Time. Who doesn't want to play Civ in the world of Middle Earth, Dungeons and Dragons or their favorite anime? A lot of history as we know it, is boring. Fantasy is not boring by it's nature of not being history. \n\nWith my quibbles and hefty price tag to get all content ever made for this game aside, I can't say this is a bad game, it is a good game. It will continue to evolve and it has the chance to be truly great. \n\nLong live Sid Meier!!!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I'm going to be honest. This game is definitely NOT finished, a lot of the concepts and UI still has that early development stage vibe, which does make the price feel quite unfair, which if you are thinking about getting it - wait for a sale. \n\nThe game itself is alright, it still has that classic civ chokehold of \"one more turn\", and I really enjoy how the cities in this game feel alot more like cities and less like placeholders. Builders are gone, which I don't mind, it takes away that tediousness of dedicating construction to build builders that bugged me in other civ games. The military aspect is quite fun, and feels more rewarding. No Barbarians but instead \"independant powers\" is a nice aspect to the game, same with commanders and the like.\n\nLook, this game still is civ at the core, but it does have more of a \"Humankind\" feel. Which I don't hate, but still feels a bit alien for a civ game. I also have quite a love hate relationship with the age mechanic and the transition to different empires, which I hope they can add as an optional thing rather than a forced mechanic. But yeah, its still civ, I'm still gonna sink hundreds of hours into it, and if you are on the fence I would definitely say to watch some gameplay and reviews. \n\nOr buy it, worst case - refund it? I ain't gonna tell you what to do, you do you king ;), engage in the capitalist system we got and become a pawn for Firaxis and 2K. Or don't. \n\nGood luck :D",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Is it a perfect game? No. Is it as good as Civ V and VI? No. Are there things I would change? Absolutely. But at the end of the day I enjoy playing it and don't regret buying it, and that's all that really matters.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Having played this game both at launch as well as after successive patches and rebalancing, I believe it has begun to come into its own. Compared to previous installments, VII feels like a step up in terms of the detail and and nuance felt in each era, where you get to experience an immersive look at several civilizations as you build them. Personally I have mixed opinions about the civ switching mechanic, but have landed on it being an interesting experiment for this installment. If you really lean into the civilization and ages mechanics, you can find very fun ways to shape your own playthrough. As an added bonus the game is absolutely gorgeous. I'll leave some pros and cons as of november 2025:\n\nPROS:\n+ Civ switching mechanic adds new ways to experience and have fun with empire building. Leader attributes and \"mementos\" let you further funnel civilization power towards desired victories. \n+ Each age, leader and civilization feels thoroughly researched and implemented.\n+ You now level up commanders instead of individual military units. The ability to shape and move the direction of the military/navy/airforce feels better than in any other installment of the franchise. \n+ The diplomatic system is definetely more dynamic and interesting. You have several ways to strengthen yourself and your friends, while sabotaging your enemies if you feel like it. \n+ The AI feels like a better opponent than in previous installments.\n+ Multiplayer is straight up fun and competitive!\n\nCONS:\n- The UI still needs work following launch. Information about hidden modifiers and the yield loss on buildings from previous ages should be clearly visible.\n- The game will feel somewhat \"disjointed\", abrubt or straight up unimmersive if you are set on playing a single civilization and leader. \n- The later buildings and units in each era feels like they are never used if either you or your opponent have snowballed to a state of being able to end the eras early. As a consequence I seldom get to see the age of gunpowder or use late-game tech such as air combat.\n- The inability to swap tiles between cities, or settle on resources makes it more difficult to settle dynamically.\n- The progression system seems somewhat limited for long-term strategy players. It is still somewhat fun though!\n\nOverall 8/10 following post-launch changes!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is much better than its reputation is giving off. It is nowhere near as good as it could be, or should be. but is nowhere near as bad the impression I was getting in reviews (although I gather they've made a heck of a lot of improvements since release).\n\nMy hot take, which surprised even me: I like the resets.\nPhew, I feel better for getting that out there.\n\nThe familiar thing in VII, from previous editions: The AI doesn't know how to use air power.\n\nI dunno what to say that will get people to sit and actually read my review properly, but all I can say is that I'm genuinely surprised by the game. I've been playing avidly since Civ I (but missed IV due to lack of hardware) and although VII took some getting used to I'm getting a kick out of playing it.\n\nI was b1tch1ng about this game and chuntering to myself for months. But then at the last sale I decided to just get over myself. It's just a computer game, not a potential spouse, so just give it a go - it's not like you have to marry it. And so I've settled and am having the time of my life with it.\n\nGive it a go. Maybe you'll find something new about yourself!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A little bit of a learning curve, but that's typical for the series. The end of age scenarios are sort of cool and can also be annoying. If you don't like them, you can turn them off. I think overall it's a good pick up and I've enjoyed the game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Definitely worth it. Yes, it had bugs at launch, and there's room for improvement, but the game is super fun and will only continue to get better. Some of the mod features are essentially being integrated into the vanilla game too, which is always nice to see - the devs do listen to the community and are rolling out the most requested changes, it just takes some time and all. I do hope they add a \"fourth age\" since the technology cutoff is earlier than prior entries. (Not necessarily a bad thing).\n\nThe age switching mechanics are super fun and split marathon playthroughs into more manageable chunks. I suspect many complaints about this mechanic come from players who just aren't used to it yet. Give it a few years and Civ 7 will be considered the best in the series, hands down.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not as good as Civ 6, but not as bad as people say either. Grab it on sale.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Imma be fr, I really expected to hate this game and go back to Civ 6 but there is something to love in this unfinished game. \r\n\r\nPros:\r\n\r\nThey fixed a lot of issues with 6 like diplomacy and tourism and if you love RPG Multi-classing and Roguelikes there's something for you here. Mixing different leaders with different Civs has so much potential for replayability and it's the one thing that keeps pulling me back to this game to be honest. Playing Tonga as Tecumseh is drastically different from Tonga as Pachacuti, or playing Great Britain as Blackbeard vs Great Britain as Amina and so on. It just hits different when you cook up a build and pull it off and all the wheels and cogs are turning. \r\n\r\nMy favorite game I've played so far was Jose Rizal as Tonga > Hawaii > Japan, just pure Naval Cultural Domination and it's something I can't say for any Modern/Future Era experience I've had in Civ 6. \r\n\r\nThat's another thing this game does better (still needs improvements) than 6 is the Modern age is still fun, Having your commanders at lvl 15+ and ready to take on the world or dominating the distant lands in the exploration age means you have all the factory resources which just allows you to steamroll the economic side of things, or even having good ageless culture means you're first to access the Ideology Policy cards which basically just giga boosts your yields by a ridiculous amount. I can go on but you get the point\r\n\r\nCons:\r\n\r\nIt's unfinished and it's very apparent the first time you play the game. There are things that should be displayed or information that should be accessible that just aren't anywhere to be seen. The Civilopedia (The In-game Wiki) is not comprehensive and lacks a lot of things that you would assume should be there in detail. The UI, although there are mods that make it so much better, still lacks a lot in comparison to what we had back in Civ 6. There are lenses and keybinds that still aren't in the game, a lot of QOL options are missing, Tile-swapping isn't a thing anymore for some reason.\r\n\r\nTLDR Conclusion:\r\n\r\nShould you buy it? Wait for a sale and I would urge you to try it beforehand maybe find a friend with a copy or family share it idk. What's important is you fall in love with the game in your own way and don't trust other people's opinions (even mine) on something as subjective as videogame preference.\r\n\r\nit's an 7/10 with the potential to be a 10/10 in a year if done correctly",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I know this game got a lot of critcism on launch, but I think Firaxis has yet to geniunely disappoint me as a company. I've seen so many great franchises fall, but despite it all, Firaxis has continued to create and MAINTAIN good games.\r\n\r\nTo this day I still don't know what \"Pacts of Secrecy\" did in Civ 5 before they were eventually patched into  Declaration of Friendship and Denoucements.\r\n\r\nWas the release perfect? No. But the game is stable, suffers from VERY LITTLE major bugs that plague OTHER games, is continiously supported by Firaxis, and I've honestly already got my money's worth.\r\n\r\nIs is different? Yes, but I think if you get into this game without a specific mindset that it has to be the same as previous you'll find it enjoyable. I was initially hesistent myself about it, but I found a lot of the changes to be very enjoyable. I love changing Civs (surprisingly), because I love mix and matching the various abilities. Is the game perfect? No. But I think in few years time it'll probably outpace even Civ 5 as an amazing game. So here's to another 10 years of one more turn.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Tried it when it came out, wasn't great, gave it a miss and ongoing negativity put me off. Tried again with 1.3 and to be honest it's got plenty going for it, a lot of good in the \"different\" bits as well as I'm sure things that some people don't like but for me it's a good game in its own right at this point.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not gonna lie, the game released in beta phase, it was missing a lot of basic features, mostly from the UI. There are a lot of questionable design decisions, like faith, crisises (I turn this off since the beginning, except the revolutionary governments since that is an option), the uncoupling of leaders from civs, the ages, etc. You read it before.\r\n\r\nBUT. There're a few things to consider. First is that the game gradually gets better as patches roll out. Fixes and balance passes help the game a lot, although if you are a good deity level player like I am, modern and exploration ages will still feel like a cakewalk. Also, the modders who stuck with the game, updating their essential modifications after every patch, they are the real champions - a month after release some really cool ones came out, upping the UI and the feel of the game to a fun level (to me at least). And even better ones came out since then, like the policy amd ability yield previews, the one with the settlement list and unit list, we have map tacks with rough yield previews, etc. City planning and building, unit movement, exploring the map are now at a place where you can make informed decisions with just a glance (would've been nice if these things came from the developers, sure).\r\n\r\nAlso, there are stuff that the devs just made better. I honestly like that after 3 decades I don't have to micromanage workers/builders, and every little hamlets that I slapped down for a few resources. Warring became much more enjoyable with commanders (who are basically hero units) - they get the promotions, can transport units, and these changes make it a really fun experience. Also, yield porn. You have no idea how much fun the game hides in the synergies. Granted, you have to let go the „one civ from the beginning with one of their (true) leaders” mindset, but once you are there, then your mind will start combining stuff, and you will see things. Things like exploring the whole map with Tonga, suzeraning ALL of the independent powers, led by Tecumseh with the extra food and production per age from independent power suzaran status mementos. And you find yourself getting 40 food and production in every settlement just from this ability, building all the wonders, getting all the resources, making cities that rival modern settlements :) Then you choose Hawaai in exploration, and culture gets ridicoluos. Stuff like these. Snowball is the game, and despite the era changes, you can and will snowball hard.\r\n\r\nI could go on about the game, but to answer the question - yes, I'd recomment the game, whith caveats. Get it on sale (I got it on prerelease, and while I got my money's worth, most people rightfully felt robbed by the price), get it while the naval DLC pack is free, and go in with a mindset that, you want something different than what we got in the last 30 years (I'm playing the series since 1994, started with the first entry btw). You might have a blast.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's prettier than Civ 6. The soundtrack is great. They took some big swings with the gameplay too. Most of those swings missed but honestly I respect the attempt to shake the franchise up a bit. \n\nPick it up on sale if you're a Civ fan. Or wait until it inevitably gets added to some free monthly game promotion once they've given up.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Civilization V is still the slick, balanced classic that makes you feel like a genius chess master, while Civilization VII is the loud reboot that throws the board across the room and says, “Surprise, now you’re playing three different games at once.” Civ V’s one-unit-per-tile combat and clean mechanics are timeless, but Civ VII’s Age system and mix‑and‑match leaders feel like Firaxis raided a modding forum and decided chaos was the new meta. It’s brilliant when it works, messy when it doesn’t, and somehow still keeps you up at 3 a.m. whispering “just one more turn” like a junkie.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "In the 5 days i have owned this an entire day vanished before my one more turn saying eyes, it's not Civ 5 but at least it's not Civ 6. Solid recommendation when on sale, also Great Britain 100% should be in the base game -Rep Firaxis/2K",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Right now, buy this only on a sale. I do hope that future DLC will add more features like a united nations and diplomatic victory conditions. Hopefully more ages as well such as atomic or information age like in previous games.\r\n\r\nThe best improvements in this game are the city building and combat. This game has the potential to be the best in the series, but probably will take years of updates and DLC to become that.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been thoroughly enjoying the new game formula a lot. Civ VII is a welcome departure from previous titles in the series. While polish was definitely needed at launch, fortunately, most of my main concerns with the game have been addressed.\r\n\r\nAlthough I still think some gameplay balancing and further polishing is necessary, I believe this product is very satisfactory and lives up to the Civ name. Even for players who prefer the old formula, alternatives for this have been added in recent patches.\r\n\r\nI'm happy that the developers are actively listening to player feedback and constantly improving the title. Civ is definitely still the undisputed king of strategy!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I'll give it a cautious thumbs up as in if you buy it understand it's not CIV 6. Or CIV 5. Even CIV 4. The way you develop your civilization has changed, the pathways to victory have changed -- and the game can end in a flash if another country has all the necessary elements to win a specific victory you won't know about until after they win. To say that there are bugs are understatement; my friend and I have a regular online game set for once or twice a month, but we play CIV 6 because the multiplayer is more stable on that platform over this one.\n\nHowever, after playing it for roughly 60 hours, I see it has some potential, as long as the developers continue refining the game to make it more what players have grown to know and love from the series. I've played since the original CIV came out (My operating system back then was a 386sx with Windows 3) and the game has gotten better with each new version. I'm hoping this game eventually is developed to a state that is in keeping with the game series, a high quality 4X game that will have me going just \"one more turn.\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "To say Civ 7 is a controversial game would be an understatment. While the game has good bones, they're currently giving structure to rotting meat. Not to say it dosen't have flaws (it does), but I think the ages system is fun and goes a long way to solving some of the problems in the previous 6 games, mostly as it relates to snowballing. \r\n\r\nThe game has come a long way since launch and I'm confident it will be the best civ game in 2 years. At the current time I'd say it's a game worth playing if you're bored of Civ6 but still want to play Civ \r\n\r\n6/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can see why so many others don't like the age system, but I like it because my biggest hang-up about all the other Civ games was the snowball effect. I found that every game I played was either too easy and very boring or too difficult and very frustrating, with little chance of getting ahead. \n\nThe ages mix things up a bit, which helps change the landscape and create new advantages and disadvantages for individual civilizations. Although, it is kind of a bummer to say goodbye to your old civ and embrace a new one, and it is frustrating to lose units if you don't have enough commanders.\n\nI'm a sucker for in-game artwork and I think this game looks nice.\n\nA part of me wishes I didn't have to \"unpack\" units from my military commanders to attack with them, I can see why not letting us attack with them as single massive unit might make sense, but I like the idea of epic armies full of different types of units clashing all at once.\n\nYou could even create a mini-game where you have to decide how you'll use your units or something. That's probably the Total War fan in me creeping in, though.\n\nMaybe you can do this later in the game and I just haven't unlocked it yet, but I'm thinking probably not.\n\nThe crises are more of an annoyance than anything. I forget they are even happening until the crisis screen pops up and tells me to select a negative effect.\n\nI'm pretty biffed but also not surprised at all that they want us to pay $5 for individual civilizations after paying $70 for the base game (assuming you don't get it on sale). I get that revenue is important, but it feels like players have been complaining about this to multiple developers about multiple games for at least a decade. \n\nTo the Devs: Please stop. People don't like that s***t. You'll probably make more money by NOT doing it on principle and advertising that fact. People will also be much more forgiving if the game requires major subsequent updates if those updates are free of charge, and let's face it, every major game that comes out from now until the end of the world is going to require major subsequent updates.\n\nTo the potential players: Don't pay $70 for this unless they add a lot more content for free and make some significant fixes. Get it on sale. I did, and I don't regret it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Didnt buy because of bad reviews untill now. Bad reviews are far from truth, this civ 7 is by far great improvement to previous ones and i have played since civ 3. \r\n\r\n1. Eras are criticized but they are not as annoying as people say and they solve the biggest enormous problem civ games have always had, the fact that experienced player could tell half way through the game that hes going to win, making end game super boring. Now its fixed.\r\n\r\n2. Much less micromanaging, thanks to towns. In civ 7 not every settlement has to be micromanaged, just 1-3 which you choose to become cities.\r\n\r\n3. Graphics are great, game looks better than previous ones.\r\n\r\n4. 2nd big critic has been absence of 4th era (game ends around ww2 era), people think this as monetization but as old game developer i can see the game differently, 3 eras are so full of content, detail and features that they dont cheat you on this, it was choice they made leaving 4th era to expansion so that they can fully implement everything they wanted to those 3 first eras. If we would have 4th era on launch, then all eras would have had less content. The path they chose means quality over quantity.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I was put off for months by the reviews and the price, but honestly having finally taken the plunge at £40, I think it's really good.  Don't listen to the grumpy nerds - as is often the case, they are just having a tantrum over nothing.  It's great fun, much more difficult (the ai seems to be a lot better on higher difficulties), and much more varied.  There are some really nice new mechanics too - I love the commanders and packing/unpacking units.\n\nYes, it's very different from the old games and it does take some time to get used to, but actually it's a really clever evolution and it is clearly still civ.  What would be nice in the future is a 'game mode' that's more like the traditional - they could call it a skirmish or something.  Otherwise - just go back and play civ VI!  It's still a fantastic game with loads of mod content.\n\nSure, there are a few little niggles still to correct and some actions feel a bit clunky/counter-intuitive, but overall it's a really well polished experience.  Haven't experienced any major bugs yet.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I enjoy playing with my family, the shenanigans and backstabbing are great but there is a snowball effect where usually if someone's winning they will probably keep winning.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Will need to play more, but non of my friends like to play it.  Buy it on sale, and wait for the bundles and the money laundered g2a to come out. only then is this game truly worth it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Oh, my. Oh, my. Releasing a game one year earlier can never be good. \n\nHowever, I like the path this game is following now. Not a big fan of switching your Civ mid game. But the mechanic of splitting whole gameplay in three stages is growing in me. During Civ 6 finishing a game was unlikely to happen, the most enjoyable moment was the early game as you set your empire and expand this, having the gameplay in three different stages allows you to have three early gameplays, which makes the gameplay more dynamic imo.\n\nProbably this Civ is not for old players. But this could be a new window for beginners and people who has just been wishing to try a Civ game for first time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's different from the other installments of the series and it's in continuous development (at least at the time of writing). It has many controversial modifications, but it's a different spin on everything, I like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First time CIV player here, and it’s been a lot of fun! There are many different ways to play and it can feel a bit overwhelming at first, but my advice is to just dive in and figure things out as you go, or check out a few YT tutorials. Overall I’ve really enjoyed it so far. No bias here. I’ve never played a CIV game before CIV VII.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I kept the ship at bay for a while because of the large amount of negative reviews. When the game finally went on sale, my curiosity won, and I decided to see for myself what it was really about.\nI can honestly say it has surprised me in a very positive way, and I’ve had a lot of fun exploring its mechanics so far.\n\nI understand why some players struggle, the systems are very different from earlier versions of Civ. But that’s exactly what draws me in. It creates a completely new experience compared to the Civ games I’ve played before (5 and 6).\nThe graphics are impressive, sometimes a bit hard to read, but beautiful nonetheless.\nThe UI reminds me of Civ 5, which adds a nice touch of nostalgia to an otherwise new experience.\n\nI haven’t played many hours yet, and maybe I’ll run into more obstacles as I move through the different ages, but the current criticism feels too harsh for a game that’s this charming and unique.\n\nI definitely recommend giving the game a fair chance.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sure, it's not Civ VI with better this or more of that. It's its own new iteration of Civilization, and I like it this way.\n\nI love the concept of the ages that shake up things, the legacies that give an identity to each age, choosing a new civilization to best continue my empire's history.\nGameplay improvements as the new commanders, the town/city separation, navigable rivers are all very good. Combining all leaders, civs, attribute points, and mementos, along with all game settings options give a lot of customization to each playthrough.\n\nHowever all is not perfect of course: the first turn of an age feels a bit overwhelming with a lot of decisions to make (it's like entering a new big city in an RPG with all those new things to discover), the pacing of some ages is a bit off (Exploration age in particular feels too quick, as well as victories in Modern age), and of course the UI needs a lot more work (even if it's being worked on for the good, still a lot to do).\nBut all that can be (and is) enhanced update after update (even if it never feels quick enough).\n\nAll in all, I would recommend to give it a fair try, even at some point (sale? demo one day?) if civ switching is not appealing to you. You never know, you might end up liking it too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First Civ game I have played where I am happy to go back and play the old so in a way not the greatest but in another amazing as so different to all other Civ it doe not feel like just the last one made better (often made better but with stuff missing so I have to then return to the game once all DLC out) but this time its a whole new style so can play this unlike any other Civ its much easier to play in quick parts it feels almost like a legacy board game how the ages switch.  I payed way to much for this preordering the most expensive version but do not regrete it very fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game wanted to be something that the fan base didn't want.  It had some interesting ideas that just didn't hit.  No shame in trying to push boundaries.  They are busy in adjusting the game to flow more like Civ 6 and 5 and that isn't a bad thing.  Love the look, love the narration.  And the soundtrack is well put together.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Most people are dissing this game which is a shame, the game on its own is not bad at all, sure it could use some tweaks but it is a fun game on its own. I think people mostly compare it to the previous version which had totally different gameplay so I do not think that is fair for the current game. Does it need more yes, is it fun to play now also yes! Give it some time try it out for yourself, just know its not the same as precious installments of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Civilization VII – A Bold Reinvention That’s Unfairly Criticized? (Player Review)\r\n\r\nI didn't have the chance to play Civilization VII on launch day, so I missed the initial technical state of the game. Sitting down to play it now, \"with fresh eyes,\" I am genuinely surprised by the wave of critical ratings. Yes, the game introduces changes that might shock veterans, but if you approach it flexibly—as a new opening for the series and a nod to new players—it turns out to be a really solid production.\r\n\r\nHere are my thoughts on the game in its current state.\r\n\r\n🎨 Visuals & Atmosphere\r\nThe graphics are a huge, positive surprise for me. They are very pleasing to the eye, not overdone, and readable. Most importantly, they maintain that specific \"Civ\" atmosphere we love. The map feels alive but doesn't overwhelm with an explosion of colors, allowing you to focus on strategy.\r\n\r\n⚙️ Mechanics: What Works Great?\r\nFiraxis made several bold decisions that, in my opinion, have served the game well:\r\n\r\nCity-States: The new system is a bullseye. The ability to take them over peacefully and the simplification of their functions mean you immediately know their purpose on the map and how to use them. No more guessing—it is transparent and logical.\r\n\r\nCommanders & Heroes: I really like the evolution in unit management. The new XP system and Commander management (a mix of classic generals and heroes) add depth to the military side of the game.\r\n\r\nSettlement Limit: Capping the number of cities is a controversial but good move. It doesn't feel artificial. for players who can manage an empire well, exceeding these limits is possible and profitable, but requires planning. This eliminates mindless city spam (ICS), which plagued previous installments.\r\n\r\n⚠️ The Major Flaw: User Interface (UI)\r\nUnfortunately, I have to agree with the complaints about the UI. This is where the developers took a step back, and it clearly needs work from design specialists. The issues are visible on several levels:\r\n\r\nScaling & Empty Space: On a large monitor (I play on a 35-inch screen), the text stretches unnecessarily, and some panels and windows just feel empty. Window sizes should be better fitted to the actual content rather than being artificially pumped up.\r\n\r\nSelection Visibility: The indication of a selected option is poor, in some cases almost invisible. There is a lack of clear visual cues. It needs bolder lines, more vivid colors (maybe gold?), or increased transparency for unselected elements to make the active choice pop.\r\n\r\nUX Design: A prime example is the Era Goals—the lack of a proper background behind the text makes the font blend into the map, rendering it totally unreadable. Previous games proved this can be done better.\r\n\r\n🏛️ Ages & Civ Switching – Why the Critics Are Wrong\r\nThe most controversy surrounds the Ages system and changing cultures mid-game. I totally disagree with the criticism of this feature.\r\n\r\nIn my experience, cultural continuity is preserved. The mechanism of unlocking new cultures by completing specific goals in the previous era is excellent. It ensures we naturally evolve into a civilization that fits our current playstyle. Thanks to this, we don't get \"stuck\" with an early-game choice that makes no sense 200 turns later. Our empire evolves along with our strategy.\r\n\r\nSmall note: The transition could be slightly smoother. I also miss a clearer schema (a tree?) that would allow for better planning of the cultural development path, rather than just reacting to the here and now.\r\n\r\n💰 Price & Verdict\r\nIs Civilization VII worth buying? Yes, but... not at full price. The current launch price is definitely too high for the content. in my opinion, a fair price is max 32 Euros. If you see the game on sale around that price point—grab it.\r\n\r\nIn conclusion: Civilization VII is heading in the right direction. It is a refreshing, modern strategy game that suffers mainly from veteran habits and UI shortcomings. If you are looking for a fresh take on the series, I recommend it with a clear conscience—especially on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not as good as previous games but fun. I'd still rather play VI.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game suffers under it's own expectations; it could never be everything to everybody. And it certainly isn't without its flaws. The UI is clunky, and many mechanics are so poorly explained that they're impossible to understand without someone explaining it first. All that being said though, I still find a tremendous amount of enjoyment from this game. The changes that were made for this installment are all fun and engaging, while keeping the best from the existing franchise. If you loved certain things from previous games, you might hate this one. And that's okay; it certainly is a departure. But I can attest the game is well thought out and fun to play. I'd recommend it to anybody looking to get into the franchise or is looking to shake up gameplay from previous games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great Civ game thats going through the typical \"Civ Growing Pains\" lifecycle that every Civ game since 4 has had to go through.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I did like the game, but was disappointed in the means of how it determines results - in my experience the object of the game is designed based on the number of turns regardless of one's success and/or development.  I had the highest rating in all categories yet I was defeated before I even made it to the 20th century.... so in that sense the game seemed to short, especially since you start off with an established Civilization...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hello! this review may never get looked at, and it may never even be read but I'm going to write it anyway.\n\nWhen this game dropped I'll be honest it lacked a lot i played a couple of games and it hit me like a rock that this is a game that i would need a break from for a little bit, and I stopped playing until they added Ghengis Khan. \n\nNow I've come back to find how much this game has changed since launch and it now to me more than ever deserves more love. It is super fun and honestly Beautiful with how the city building looks on high graphics. That being said, I really wanna see more and hope they add so many more leaders, maybe even some older ones from past games! I really really wanna see Bismarck and his tiger tanks make a return. \n\nBut we have plenty of time to wait and see.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "With the latest patches, it became much more pleasant and satisfying to play. Nice to see the game is being worked on. \nVisuals are great, balance is not so perfect, but I can definitely recommend it to try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not sure why the downvotes and low ratings. But given the trend across several games released in the last few years, maybe gamers just expect too much from game developers. This gave me joy, so yes I recommend this game to other players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There are some differences from previous versions that are controversial. It took me a few times playing to get used to the new age system, but they have made some improvements since the initial release, and I actually enjoy the new age system. It adds more strategy to picking new people groups and can help you adapt once you get a better idea of how the game is shaping up. I like the improvements to the districts.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing for 20 years, I don't mind the changes, the game still makes me feel the same way it's always done and the graphics updates keep blowing me away, I love watching the floods. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Since patch 1.2.5, I have been hooked on this game. The gameplay loop is addicting and I can't put it down. \r\nWhile intimidating at first, the different ages and civ switching keeps the game refreshing. There is still many QoL things to come but it looks promising.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best and most game-changing parts of Civilization VII are the new city–town–rural system that eases micromanagement, the multi-layered diplomacy built around the new Influence currency, the deeper trade and economy-focused victories, and the Commanders feature that adds real tactical depth to warfare. For the first time, the AI actually feels smarter and can be challenging, which is a big step forward. The game also looks and sounds fantastic — it combines the colorful style of Civ VI with the more realistic tone of Civ V, creating a bright yet grounded atmosphere. Still, it’s a bit disappointing that higher difficulties mostly rely on giving the AI bonuses instead of making it truly more intelligent.\n\nOn the downside, city management and the interface can be frustrating. The resource screen starts to break after the third era — every turn you have to assign resources, yet finding which one goes to which city is a pain. UI icons can’t be resized, map generation feels much more limited, and unit variety is smaller (why is there no nuclear submarine?). Some key systems from Civ VI are also missing: there are no UN-like diplomatic institutions, no Golden or Dark Ages, no environmental or natural disaster mechanics, and era effects feel far less meaningful — etc. Overall, many features that added long-term strategy and immersion are simply gone or oversimplified, leaving the game a bit shallower.\n\nSome things are more mixed. The new era and civilization transition system is both interesting and awkward. Trying out different civilization combos is fun, but the 150-turn eras feel uneven — too fast early on, too slow later. Eras could be split into smaller stages, and transitions should be smoother: wars ending suddenly and units disappearing hurt the flow. It also lets weaker civs catch up too easily in science and military. The game tries to fix this with era bonuses, but they’re too weak to really balance or create a snowball effect.\n\nIn the end, despite all these dramatic changes, Civilization VII still doesn’t feel as exciting or groundbreaking as a game that appears only once every ten years should. Those still on the fence after Civ VI — there’s still time to wait.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you are looking for more of the same of civ6, then you are not going to find here.\n\nBut what you are going to find here is a pretty cool Civ game. \n\nThere been a lot more focus on replay-ability.. I know that sounds odd as most civ players have 100's of hours on the game. \n\nI Don't really see any of the review go over some of the new mechanics, so i'll try to cover them.\n\nWhen you first go to start a game, you get to pick a leader, and you get to pick a civ to represent. There are 32 leaders as time of writing this, and 10 starting civs. To add on this, each leader has two passive slots that every leader can choose from. These passive are unlocked by playing leaders and doing actions in game. \n\nThe options for setting up a game is less then civ6, with only a few map types. But the on the other side, the AI's difficulty has a lot of options you can change around. You can make them better at one thing, then another. It's pretty cool.\n\nBeginning of the game, it  plays out like other civs, you find a good spot, start your city, scout around. Barbarians are not in the game, but are replaced by sometimes Hostile independent factions. These can be wiped out, or you can spend influence ally with them and they become a city state. You get rewards for doing so, and the rewards depend on what type of city state they where (econ, military, science, influence).\n\nSoon you will meet your first AI controlled player, and you will see that how you interact with them is completely different. You spend influence on diffrent actions. For example, you can spend influence to create open markets between. The AI can then spend influence to meet your action, you both gain more gold a turn, they can stay neutral, you gain more gold then the AI, but they don't have to spend influence, or they can spend influence to block the action. \n\nAs your city grows, you select tiles to work, which is like selecting which tile to work in civ6. There is no more workers, as when you select which tile to work, it will upgrade it. Another thing they changed is buildings. In civ6, you had buildings they where in your city, and districts. Now, every building is built like a district. Each tile can hold two buildings. If you build a building over a tile that is being worked, you can reassign the worker, later, instead of working tiles, you can place workers inside buildings to increase their output. \n\nAs the game progresses, you are pointed to reach one of 4 age goals. Scientific, economic, military, and cultural. Each one have milestones, and a end goal. These will give you bonuses for the next \"age\". there are 3 ages, and it's basicly a softreset to your units and cities when a age advances. You also pick a new civ to represent, and what civ you can choose depends on your leader, and what actions you have made in the game.\n\nUgh, nevermind, This is getting too long. and no one one will read that I am gay. so why do over everything little detail when a video would be quicker..\n\nAnyways, that's about it for this, it's a fun game, the graphics are great, the music is amazing, and the sound effects are great. It's a great vibe to play that scratches that one more turn.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "8 months of updates have favoured this game well, DLC prices are still egregious, but otherwise the game plays well, and is good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Civ VII is a great game! Recent patches improved game a lot since release. Great to see it's evolution! In many ways is similar to Civ VI, but very cool ideas differ, as Civ switching, commanders and city/towns. City states are much different, giving optional bonuses, providing complexity of gameplay and potentially great bonuses. Many old players are complaining mostly because they didn't want some changes. But it's a new game and we should allow for innovation. I'm a old player of the franchise and I'm enjoying it. New players will certainly have fun!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I see why the reviews are mixed, but I personally land on the positive side. I think the game itself is gorgeous and a blast to play. You pick a leader and a civilization (which don't have to match this time around) and get rolling. tl;dr, I liked it a lot but it does have some things that don't work well for me.\n\nPROs -- Here are some things I really like about the new game:\n\n1. You get a one-turn build for your first unit (scout or warrior), which means no more sitting there waiting for that scout to build staring at your city.\n2. They've done a great job with the military. Generals really matter now, and they can get your units to whoosh across the continent to kick butt or augment your forces' effectiveness. Both technology and having the right units built can make a huge difference in whether you steamroller your neighbor or not. There are also some crazy geographic situations -- walled cities where you have to crush all the walled segments to capture them, weird bluffs you can shoot down from but not walk up, and rivers slowing your attack and making those \"amphibious\" units feel so nice.\n3. Diplomacy is excellent. People remember your past good behavior and reward you for it. Want open borders and more trade routes? Better play nice. You can also kill city states or befriend them with diplomacy points, and you lose diplomacy points when you capture tons of territory in wars, making the aggressive and peaceful approaches trade off. Sure, you can build improvements with diplomacy points to compensate, but if you just burned down three civilizations you aren't going to win friends and influence people.\n4. The exploration is good. In the ancient age you can't cross the ocean (unless you play Tonga) and that means there's still exploring to do in the later ages. \n5. Even though people hate swapping civs, I find it pretty rewarding. One game I played Greece and was a peace out guy who incorporated city states at the end of the age with my massive diplomacy points. However, I was losing. So in the exploration age, I shifted to the Mongols and conquered the entire continent. You don't really \"lose all your stuff\" when you switch civs; you keep all your territory and if you plan ahead, you can use generals and admirals to keep your units, too. You mostly lose unspent points and your cities revert back to town status for a while. You keep your old capital as a city and have the option to move your capital to one of your largest other cities, which is usually a good idea, and you get to buy a bunch of perks based on what you did in the previous age. So, if you were a science and culture star, you get points in those trees to improve your ability to do those things. I don't know why people hate it so much, since I think it works well, and you just need to spend gold to get your cities back to full city status. It's not like you start from scratch each time.\n6. I liked how they handle colonization / exploitation of lands during the middle era. You settle apparently empty lands that are not part of your main continent (using settlers as normal), and then use the resources there to send treasures back home. Is this how it really happened? No, of course not. But is it a lot of fun? Yes it definitely is.\n7. There are a lot of smart and subtle design decisions that force interesting trade-offs. Just like how in the diplomacy model being a backstabbing monster and colonizing everyone makes people hate you and gets the city-states signing up to join your enemies, capturing lots of land quickly hits the settlement cap and raises unhappiness. Unhappiness mostly slows down your ability to run a lot of social policies at once, which is another neat mechanic. Spreading your religion means building temples and missionaries to visit all your cities, but you could ignore religion and spend that gold and production on stuff you want like galleons and settlers. All of this is pretty fun.\n\nCONS -- Here are a few things I think need work or that I didn't like:\n1. The religion model got rid of missionary on missionary rap battles, so you can no longer defend against them except by building lots more missionaries. This can be super-annoying when your neighbors keep converting your cities. I miss my apostles squishing the annoying little brats who want to talk to me about some carpenter being the son of God. (We follow Judaism around here, bruh. Still waiting on that messiah.)\n2. By the modern age, you are often out of spots to build in your cities. This is not so bad if you move your capital around, but in early games I didn't do that and then my most productive city wasn't doing much. \n3. A lot of major civilizations from earlier games are missing and some of the leaders are not leaders, but regular folks. No Zulus or Aztecs in the game, come on!! I find it a little odd that Harriet Tubman is a civ leader, and she's kind of the \"nuclear Gandhi\" of this game. She has a power that makes you have tons of war weariness when you fight her, but she is the one who often declares war, sending all your cities into spiraling depression because they're being mean to Tubs. I mean, who wouldn't be sad about an emancipation hero invading with two dozen trebuchets, I guess? Ada Lovelace and Jose Rizal are other weird choices. They are cool people but feel out of place as civ leaders.\n4. A lot of things in the modern era feel half-done. For example, the modern era has you picking between democracy, communism, and fascism, which is kind of cool but it seems totally arbitrary who picks what, and you can't ever switch. If you make your Prussians into nazis, they will never turn it around and become modern democratic Germany. \n5. Unlocks. I am an unlock junkie in most games, but why do I need to hit Level 7 with civ leader Jose Rizal (apparently a smart guy from the Philippines, which are not even in the game I think) to unlock all his abilities in the game? This is kind of silly. It's a strategy game, not a roguelike platformer.\n6. Maybe a pet peeve but since generals have very specific ability sets that are not always the same from general to general, I really want to be able to give them names. Like, one of my generals mostly sits in the capital and boosts production and defense, while another is used for rapidly running to Karakorum and besieging it with catapults. They are not distinguishable without clicking on them to open their ability list.\n\nOverall, though, I have had tons of fun playing it and look forward to seeing what they do next.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a long time Civilization fan (Since II), I am always excited about a new entry into the series. This game is a worthy addition to the long lineage. However, this is not without some caveats. The game still feels a little bare bones since launch. I do have a problem with every Civilization game launching without features that were in previous games. Why do they do this? They always add it back in new expansions and DLC, which is a bit frustrating. Although I do recommend this game, wait for a sale, or pay full price after they've released some more DLC to fill out the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's taken a while, and I didn't want to jump into anything, but I'm convinced this is a good game. It takes some getting used to, it's definitely a different game from 6, but once you can sink your teeth in the new mechanics you'll be begging for just one more turn.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played every Civ release, Alpha Centauri, Beyond Earth, Colonization (both) and even Pirates!.\r\nAfter playing Civ VII quite a bit, I must say I find it really enjoyable. Every patch and update makes it even better, and experimenting with settings allows you to tailor your experience to a certain degree.\r\nDon't buy into all the hate ;-)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Yaaaaa..... is good now....... Way better than before. Its made most of the essential mods obsolete now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was put off by the original negativity around this game, but I quite like it.\n\nTLDR:  The game is slimmed down from other titles, but the content that's there feels cohesive, and most importantly - it's actually fun to play.  This feels more like the original CIV 1 in a lot of ways than civ 5/6.  I'm a big fan.\n\nFrom my view, it has probably the best combat since civ departed from the doom stacks of units, and possibly just the best combat in a civ game period.  The new mechanic to load units onto a commander and have them move as a single unit took away most of the tedium of having to actually move around the map in civ 5/6 (both of which were just unpleasant to play on the combat front).\n\nThe system mechanics feel trimmed down, but also in ways I think dramatically improve actually playing the game.\n\nThe unit list is condensed, with one or two \"standard\" units per age for both land and sea, and then the faction specific units on top of those.  I mostly don't miss the \"extra\" units, and I appreciate that it makes the civs feel more distinct (a lot of special units in the older games are better off just ignored in favor of powerhouses like crossbow/knights).\n\nCapturing cities is no longer a chore in complete tedium and ridiculousness, where an ungarrisoned city will easily blow away entire armies of units, and a whole war across hundreds of years of game time results in one city changing hands, maybe.\n\nNow cities actually get conquered like they should, but district by fortified district, which means they can last a turn or two against a lone unit without a garrison, but a general dropping an army on an undefended city will easily take it that turn or the next.  Combat is actually enjoyable again, which I feel hasn't been the case since civ 4.\n\nThings I'm mixed on:\n\n- I think the city vs town distinction is probably going to be fine, but I'll have to play longer to really make up my mind.  It keeps the game focused and playable which I like, but also places a lot more emphasis on gold availability.\n\n- I think the \"changing civs\" each era is fine.  It's not really my preferred approach thematically, but I understand why they do it to \"reset\" some things between eras.  No more ancient warriors fighting modern riflemen, and the game is better for it.  I wish you could just pick your starting civ again from the list, though. Overall, this is clearly done to reduce pain during gameplay and it works, but it does feel a little tacked on (and possibly a way to try to sell future civs, which I personally won't buy).\n\n- The AI is still bad.  Welcome to civ.\n\n- The UI is missing a lot of mechanic details that are important.  Ex - there's no indication for how far traders can trade, and help buttons for most things in general are just missing.  It's not the end of the world, and I bought it late enough to avoid most of the early glitches and bugs.  \n\n- Science is still far more important than culture/religion, although I may change my tune here as I play more.\n\n- Breaking things out by era makes it feel \"smaller\" than it really is as a game.  There's a lot of stuff in there, but you don't have to hit it all because the era jumps you to the next spot.  I'm mostly ok with this, but I understand the complaints.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "**Mac users** - this game is buttery smooth. I mostly game on PC, but I'm on my Macbook Pro M1 so much time doing software dev that I love having Mac-friendly games. Full screen game mode can be put in its own window, mute on background (looking at you Paradox), no resource demand in background, graphics gorgeous...purrs better than many PC titles. This is about a best I've seen for a Mac launch of any title and if you are Mac user, on sale it's worth it for that alone. \n\n**God-moders** - I think I'm in the minority (at least among content creators) in how I play this game. Almost never play on deity, barely play multiplayer or competitive. And really don't play to get a \"victory\"  (devs badly misunderstand this part of the player base). I like to play at a relatively challenging level (~King on Civ 6), and try to get ever wonder, every win condition, all the buildings and ships, etc. all in same game. Super wide, huge maps, marathon, no turn-limits. And often keep playing after \"victory\" till I do all I want to do. It's this \"sandbox\" (overused term) playstyle that I absolutely love. Once I've done that, I rinse, repeat. If you're that kind of player, this game has those basics -- not Civ 4, 5, or 6 yet, but better than anything else atm.\n\n**Everyone else** Long-time fan (thousands of hours), fav game series ever. Desperately wanted to get into this. Held out b/c wasn't (and still am not) fan of the age transitions, leader choices, and UI issues I saw raised (Civ-swapping was something I was okay trying and so not a fan, but not a deal-breaker). And primarily, the game was clearly released rushed and broken so no way I would pay the full price they were asking (on principle). Bought it for 35% off with the free DLC. It still has lots of issues - again, the UI (ad nauseam) is just horrendous (contrast this to, say, much more complex EU5 at launch or Endless Legend 2 and it's pretty shameful. Not even to mention Civ 6. Tl;dr - it doesn't give enough info, hard to tell what anything does, has annoying intrusions, etc.). It's bad enough to make this kind of 4X game less enjoyable. That said, the core \"one-more-turn\" dopamine loop is here - the core \"guide my fledgling empire from scraps to world power\" is there. Graphics are mind-bogglingly gorgeous If this was another title -- a \"Civ Killer\" attempt -- it would be be super popular. But for Civ, at the asking price, it still falls well short of the predecessors. Still, 7 is serviceable and worth playing at this price point for me.  But if they keep patching and working on it, and don't get too greedy with DLCs, there's a \"comeback\" story here for sure. Because the nuts and bolts are there. If you love this series, this game will end up in your Steam library sooner or later, so I won't say it's a *must* right now, but I'm happy I got it and looking forward to (hopefully) thousands of hours over the years...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game. Price is a bit steep, but you do get what you pay for. If you liked Civ 6, this improves on it with better graphics, smoother system optimisation, and some fresh mechanics like picking new civilizations every era. Diplomacy is a bit more streamlined than in earlier Civ titles, but that also makes it easier to predict and use strategically. Thematic victories are tougher to pull off in online-speed games, though I imagine the devs will rebalance them as the game grows.Still, nothing’s really stopping you from aiming for thematic wins or going for high-score victories. I haven’t encountered any bugs yet, which is honestly impressive. Tons of replayability thanks to new maps and new exploration every run.\n\nSolid 8/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At first, I was very skeptical of the civ switching feature. But as I've played the game, I realized I don't mind civ switching since it's fun getting various new bonuses and abilities with a new civ. It does keep the game fresh.\n\nI think there is potential here, especially once they release more expansion packs. The game does have a good skeleton, but it is clear they needed more time before launching it, notably the lack of polish in the interface.\n\nObviously, Civ V and VI are currently more completely packages after so many years' worth of expansions and updates, but I expect Civ VII to follow suit. \n\nStill, even in its current state, it is a breath of fresh air after hundreds of hours in V and VI. It is worth checking out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite hat most people are saying, this game is actually really good and completely playable now.\n\nSure it may not achieve hat Civ 6 was, but let's not forget that Civ6 existed for 9 years before Civ 7, and continued received updates during its whole lifetime.\nThe main issue that most people will have with this game is the difference with the precedent games, mostly on the age system. I do think it's a big step to take to go from civ6 too the 7 with the age system, but it's a really good mechanic in a of itself.\n\nSo I really recommend this game if you like strategy, even more if you haven't played the 6, cause it would the transition effect would not affect you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game had a damn rough start: it was rushed out unfinished, the user interface was garbage, the publisher was hellbent on predatory monetization, and it diverged by a lot from the previous entry, which is one of the best ways to alienate your fanbase. I didn't even dare to buy it until summer thanks to all the horror stories I've heard, and only at this point, beyond the release of Tides of Power, that I can recommend buying the game.\n\nNot only is it just as addicting as its predecessors, but it has more asymmetric nations and leaders, and a shitton of possible nation and leader combinations. It's also pretty, though it comes at the detriment of the map's readability. I like the age changes, because each age has its own unique mechanisms that shake up the gameplay, then are left behind once a new age dawns. On the other hand, I don't like how rigid the milestones of legacy paths are, because they force you into a certain playstyle if you want to max them out. Fortunately the game is immensely customizable, you can tamper with the effects of age changes and even turn legacy paths off, if you wish so.\n\nThere are still some things to be done before I can be completely satisfied with the game. I'm still waiting for hot seat, a post-modern age, further UI improvements. But after the I got through the early shock and learning curve, the game quickly grew on me, and I've been having tons of fun with it ever since.\n\nAlso, Edward Teach and the Republic of Pirates fucking rocks. Seriously, after a few more vanilla nations you must try it. Being in an endless loop of raiding ships and trade routes to upkeep your ever growing fleet is ridiculously entertaining.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Civilization VII has great potential, but it still feels unfinished. The new city-growth system without workers is refreshing, and commanders add a nice tactical layer to the military. Unfortunately, the UI is cluttered, pop-ups are overwhelming, and the pacing becomes messy, especially when transitioning between eras. There are good ideas here, but the game needs a few strong updates to truly shine.\n\nScore: 6.5/10 – a solid foundation, but best suited for patient fans of the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an excellent entry into a storied franchise.  It looks great, sounds great and makes me want to play one more turn more often than not.  It does try some new ideas with splitting time into ages and civ-switching, and they don't all land.  Overall though, I've not regretted my purchase and I expect that as expansions and patches continue that the game will keep getting better, same as all the others have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of fun to play and new mechanics to learn.  I enjoy playing Edward Teach the most so far.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "ну братва, обзор на мою улюблену серію ігор, кароче я награв +- 70 годин і можу сказати свою думку. ЦЯ ЦИВА САМА СКУЧНА! Зараз вона сира і менш цікава за інші частини, але все таки в ній можна провести цікаво час. На данний момент 6.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's different. It isn't a bad game, but it isn't Civilization. If you go into the game thinking that its the next in the Civilization franchise, you'll be disappointed. If you go into the game, accepting it for what it is, you'll enjoy yourself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The transitions are not as seamless as I'd like but the concept was interesting.  The game is great if you take it on face value and quit comparing to the older versions. I've been playing since the very first Civilization game came out on DOS.  I've loved it ever since in all it's different versions.  Embrace change and embrace this game for what it is.  It's great.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Let me start off by saying that I personally love this game and have followed it from release and even purchased the deluxe edition to boot. I don't often write reviews- in fact this is my first steam review but I feel like I had to because of some of the negativity this game has gotten.\n\nCIV 7 reshapes what people consider to be a CIV game and offers something new. While this can be Jarring some players I personally think if you want to play the same game over and over again then I would suggest franchise like FC. That being said, there are some nuances to the game that make it polarising and I will go through that in this review.\n\nSome of my favourite PROS:\n\n- The game is beautiful! and that is an understatement. The building and features interact with the environment to shape tiles is truly a testament to the work Firaxis put in to the map generation. Honestly sometimes my friend and I just take a moment to show each other beautiful tiles we find\n\n- Combat!!! The combat in this game feels so much more alive and rewarding, the way Commanders change the battle landscape has honestly made me fall in love with this game. \n\n- I actually feel like I have something to work towards. Levelling up leaders may be contentious for some but I personally love the fact that it kind of forces you to play all the Leaders. This had made me appreciate the subtle differences each leader has and actually understand the game better. Getting mementos from one leader and using it on another to make really cool combinations adds so much to the game.\n\n- Simplified micromanaging. I personally hated builders in the previous CIVs and I am so grateful I don't have to micromanage 10 builders across my settlements. Thanks Firaxis.\n\n\nSome of the worst CONS: \n\n- While the age transitions have grown on me and I understand what they were going for with it, I do think that it still needs to be optimised. I always say that games should give players the option to bypass some of these kind of features (which they have done now) but in this case why have it at all? Also the I would like to see more options for golden age trasitions as currently you could be going for a certain golden age but the reward does not suit your CIV (I.e Carthage and Silk Roads golden age)\n\n-Like any Civ game there is a lot to take in and sometimes you'll find yourself not being able to do something and wondering why. You could say just \"Get good\" or \"Read the wiki\"  but the game does very little to explain to you some of the features. What is a Quarter? (So important to know!!) What counts as a fortifies district? Why can't I trade with that city state even though I am in range?!?!?!?!? Some of these can be extremely frustrating and really dampen the mood when playing. Firaxis have done a good Job so far at fixing some of these issues but we will see what we look like after the first year!!\n\n- Navigation of the Civic and Technology tree still aggravates me. If you want to research a civic mastery you can't plan any more researches in advance. I know that's a small issue but it really annoys me.\n\n\n\nI do think with time people will come to appreciate this game for what it is, like has happened with so many Civilization games in the past even though this one is particularly polarising. Though I would say if you are looking for something similar to previous CIV games maybe you should give this one a miss and that is okay. Other than that is game has the potential to be one of my favourite games of its genre.\n\nTHANK YOU FIRAXIS!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Took me a bit of time to get here, and Unlike the other reviews, which i can understand are coming based on what folks are comparing against the Civ 5/6, i really found the changes refreshing. The latest patches imo elevate the game playing experience. While George Washington on Chola Empire in the Exploration era makes no sense at all, i liked the new challenges this game brings, very different to the previous editions. \n\nThe tech and civic tree is very different than before, and honestly i feel that’s a good thing. I like the civ specific civic trees, which make you think a bit extra. Layering these policies across eras along with suzerian benefits makes it fun to see how you can tie everything together",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, mechanics are easy to understand. Modern Age Civ gets a bit repetitive though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Started a little unpolished but is starting to find its way, have enjoyed it a lot",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "give it another try game has gotten much better since launch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's definitely not like other Civs.  I does take some time to get used to the flow and the recent updates and patches have made it much more enjoyable.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Updates are slowly rolling out and make the game play better and more fun to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Long-time Civ fan here (back to the first one). I initially bounced off Civ VII pretty hard: I hit the end of the antiquity era just once and that was enough to stop me from playing for the next ~6 months (combo of dislike of the era transition, hard-to-parse UI, and over-balanced design). \n\nBut after patch 1.2.5 dropped, with its game-changing (!) approach to map generation, it seemed like time to give it a second chance. I'm glad I did: I'm really enjoying it! Sure, there are aspects of the UI that I still wish were better (all kinds of info that was present in every earlier edition of Civ is now nowhere to be found--though some excellent community mods help address that), but, bottom line, it's fun to play, especially with the expanded roster of leaders and civs. The sound is beautiful and the art has wonderful attention to detail. The devs have steadily been making good choices in improving the UI and leaning back into civ/leader assymmetry as well, so I believe them regarding further improvements in the pipeline, and in the meantime, I'll keep taking just one more turn...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a Civ game. Not sure about the new mechanics. Do not like having to rise and fall THREE times to complete a game. What was wrong with having ONE civilization from start to finish? Seems to get more complicated with each new iteration since Civilization V.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing Civilization since Civ 5, with around 1000 combined hours in Civ 5, Civ 6, and now Civ 7. With that background, I came into Civ 7 with high expectations. There is a lot here that I genuinely enjoy, along with some areas that feel incomplete.\n\nThe strongest part of Civ 7 is the new age-based civilization system. Being able to play through different civs across the Ages feels fresh and gives you real options for bouncing back from a rough era. It creates a sense of momentum that previous games did not have. The game world also looks beautiful, and the atmosphere is very immersive.\n\nHowever, the experience becomes repetitive after a while. The game feels more limited than Civ 6, especially in terms of technological and civic progression. There are fewer advancements overall, and it feels like the game is missing an entire Age that would help the pacing. The overall design is simpler than Civ 6, and for me that is not a positive. I want more systems and more depth to interact with.\n\nOverall, I would describe Civ 7 as good, but it needs more content to reach its full potential. If future DLC adds an extra Age after the third one, I think the game could move from good to great. The foundation is strong, but the depth is not quite there yet.\n\nI would still recommend Civ 7, with the understanding that future expansions will probably be essential for long-term replay value.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Improvements compared to civ 6:\n+ Replaces district system with a better rural/urban system\n+ Much better looking cities. In all prior games, cities never really looked like cities. Overall, certainly best graphics.\n+ Combat system is improved\n+ Influence resource addition is good\n+ Comes with a disaster system like Civ 6 Gathering Storm, but improved.\n+ Can finally travel along rivers in boats.\n\nDifferent changes that bring the game more in line with realistic nation-state gameplay:\n+ Age transition system essentially makes it such that no civ is stuck in a much earlier age. In real life, every country is somewhat on parity technology-wise.\n\nAreas for improvement:\n- Game makes gold too important of a resource, there should be at least two more resources that are equally important (like in Stellaris alloys and consumer goods)\n- No world congress or equivalent, Civ 5 remains the game with the best world congress implementation\n- Diplomacy options should be improved or reworked somewhat\n- Ideology system should be reworked\n- Later game content should be added (one more age)",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This game gets an unfair rap. \n\nIt's really great fun! The Civ switching is novel and I think a cool way to experience the game. \n\nThere are some issues with the UI still and not easily displaying all the relevant information you might need, but it's not horrific. It seems a little less complex than 6 but that is not a bad thing. I think the diplomacy is more 'gamified' which is neither here nor there and totally up to preference. \n\nIf you like Civ you should absolutely pick this up. It's still awesome fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Core Point: \nI really enjoy the game. The evolution of going from one civ to another from one age to the next is an excellent addition to the gameplay, adding depth and complexity. It also avoids what you ended up with in previous Civ games where if you were playing a Civ with its bonuses in the modern age, you're basically playing a regular plain civ until those bonuses kick in. Or alternatively, if your civ had its bonuses in antiquity, then you just have a regular plain civ for the rest of the game. With the ability to choose new civs each age, not only is each game more different, you can also adapt to changing situations. Did your neighbour become very aggressive? You can adapt your gameplay and pick a more militaristic civ in the next age. Were you unable to build a lot of wonders? Maybe you can pick a more scientific-focused civ. The nice thing is that some of the bonuses and flavor of past civs would still persist through the ages. Even if you end up playing, say, America in the modern age, you'd have a very DIFFERENT America in a game where you were historically the Maya then Inca, as compared to another game where you were initially Rome and then the Normans.\n\nThe ages system also means I finish more games than ever, especially compared to past games. In other civ games, once you're winning, you run away with the game, and that is less the case with Civ 7. Recent patches have been watering down the age transition a bit, but while I guess it's fine to keep adding options to the game, I think the core experience should remain true to the age transition/civ evolution mechanic.\n\nI feel like those who dont like the ages and civ evolution system just dont like change, and are like that meme of the old man yelling at clouds, because this all makes sense to me, and as I said, it adds complexity and depth to the game.\n\nMilitary management and war is greatly improved with the addition of commanders.\n\nAreas to improve: \nThere could always be improvements to balance, but that is true of any 4x game, and of any civ game, and that will improve with time. Some people call this \"still in development,\" but I would rather have been playing it these past months than continuing to wait for it. The UI at parts were confusing or could be more helpful, but that has been improving greatly with recent patches. Each civ's traditions are really key to making each one unique, and those should be more easily accessible when choosing civs during age transitions.\n\nI think the age crises should act more like how they are in Mariokart. No one complains that the player in last place in Mario Kart gets 3 red shells or a bullet bill, because it keeps the game exciting. In the same way, if the crises had larger effects on civs doing well, it would give more of a motivation to keep playing it out. This is also realistic - a plague would affect a large sprawling society more than a small out of a way mountain village.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is good. It just is. I have seen countless complains about this game and while I do not think that by ANY means it is perfect, it is an incredibly enjoyable experience and with the recent free DLC and the constant updates has only grown stronger and stronger. \n\nThere are however fair criticisms of the game, mainly about the ages system.\n\nI strongly believe that in this sense, the Civ switching is NOT the problem, and the recently added Civs like the Republic of Pirates and Tonga have only strengthened my resolve in this. This method of Civ switching allows for incredibly interesting designs and provides unique play styles that are incredibly fun to full off. The problem with the age system comes with the legacy paths, and while I am not a big hater of them myself, I do recognize that they are the weakest part of the game. As well as the AI still being bad, leading to modern ages that feel lackluster (this is much less of a problem for multiplayer of course).\n\nRegardless, the basics of the game are great, the UI is much improved and at the moment I have no problems with it (that come to mind at least). I love this way you grow your cities and combat is the best it's been. If you are unsure about buying it just wait for a discount and play a game or two with an open mind. Try out Civs that call your attention and you will soon find yourself 100 turns deep into the exploration age wondering where are all the countless issues people are complaining about.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is really good but I just don't like civ switching. Still, the game has a lot of potential.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve played every Civilization game since the very first one, and in every single version of it there is something that keeps pulling you back.\r\n\r\nThat said, Civ VII is very much a “love it or hate it” entry in the series.\r\n\r\n[b]Era Transition System – Bold but Divisive[/b]\r\n\r\nThe new era transition system is the most controversial feature and for good reason. Being forced to change your civilization between eras feels unnatural to many players, especially veterans of the series. This alone disappointed a large part of the community.\r\nTo be fair, the developers have already announced they are experimenting with new game modes that allow you to keep your civilization from start to finish, which is a very welcome move.\r\n\r\nPersonally, what bothers me even more is that leaders are now detached from their historical civilizations. I understand how many players may see this as a positive thing that adds variety and [u]replayability[/u], but for me it breaks immersion and historical identity.\r\n\r\n[b]Art & Presentation[/b]\r\n\r\nOne aspect that truly shines to me in Sid Meier’s Civilization VII is its art direction. The visuals are simply beautiful, from the detailed map design and city visuals to the UI, animations, and overall atmosphere. The game does an excellent job at making your empire feel alive as it evolves. Even when I’m frustrated with certain mechanics, the presentation constantly reminds me of the high production value behind the game.\r\n\r\n[b]Bugs, Mods, and Ongoing Support[/b]\r\n\r\nEven after all this time since launch, there are still noticeable bugs, and mod compatibility issues remain a real problem. Community content does not always behave as expected, and this hurts one of Civ’s biggest long-term strengths.\r\n\r\nThe good news is that the developers are actively supporting the game (for now). Updates do come, and it feels that there is a long-term intent to improve things. That deserves credit.\r\n\r\n[b]Price & Monetization[/b]\r\n\r\nThis is where things get really hard to defend.\r\nAt its current price, Civ VII still feels too expensive given the controversies and the uneven quality of the content delivered so far. On top of that, the aggressive monetization of extra content leaves a somewhat bad taste. It often feels like more development resources are being allocated to paid DLC and content packs than to properly fixing the core game.\r\n\r\nThat said, it is only fair to mention that the developers just released a free content pack, Tides of Power, which can be claimed for free for one month before receiving a price tag. This is a good gesture toward the community, even if it does not fully offset the broader monetization concerns.\r\n\r\n[b]Final Verdict[/b]\r\n\r\nCiv VII is ambitious, experimental, frustrating, and addictive at the same time. As a lifelong fan of the series, I’m still playing it heavily, but I can’t blindly recommend it to everyone at full price. If you love Civilization and enjoy experimenting with new systems, you may find a lot to like here. If you value historical consistency, stability, and polished mod support, you may want to wait.\r\n\r\n[b]Recommended with reservations.[/b]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "While the game still needs some work its not as bad as people like to say it is. The changes to city development and combat are steps in the right direction for the Civ franchise.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful Graphics and super fun to play. The game does take some time to learn but as someone who enjoys the occasional strategy game this is very easy to to jump right into, however it may take a couple full rounds.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has interesting gameplay by providing so many possible combinations of leaders and civilizations. Theres also mementos which provide even more ways to come up with creative strategies. The game has also received frequent updates and a lot of extra content since it was first released which is also great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played every CIV release starting from the very first game. I pre-ordered this game on launch and it was far from ready for release. After putting it down for a few months and letting the devs respond to player feedback I've picked it back up and feel like it has vastly improved to point where it's fun and enjoyable to play. Improvements have made the age transition less jarring and there is now a more connected line from antiquity to modern ages. The modern age still feels a little procedural, but if you've fallen behind in early ages you will need to be creative and aggressive to prevent the opponents from winning.  This game is finally pointed in the right direction and future  updates will only improve it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Constantly working towards a better game. Devs are doing a great job constantly improving it. Thank you for keeping alive my favorite game series even though i only have time to play with bots. Would recommend, but it is not for everyone. Game is still in the phase of truly finding itself. It will take some time, but i am pretty confident, based on the devs and what they have done up until now, that the game in some time will be top tier. Now if you love the series, there isn't much to say, the game is awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the changes to the formula. It makes for a fresh experience. I miss some things, but I believe a game should be made to an aspiration and if I do not like it I will not play it. The updates are nice, but the game as released was fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never finished a game of Civ 7, but I have managed to steal building a national treasure before my partners, before getting fucked because I forgot other continents are a thing and we are NOT a seabearing nation oops.\n\nYeah you should absolutely play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fair upgrade if you're a fan of the series. The only downside is the world prep screen takes forever to load (this specifically happens only when playing a new game or resuming a save). Nearly 20 hours in now and the game runs smoothly outside of the initial loading time. \n\nIf you say \"just one more turn\" but keep playing, you're not the only one :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Feels unfinished. But realxing and nice visuals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After some questionable decisions before launch, Civ 7 is finally at the point where I can receommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After all the updates, I've been having a lot of fun with Civ 7. The pirate DLC is also one of the most interesting Leaders and Civs I've played in this series.\r\n\r\nI should probably add that I enjoy the shakeups to the formula that Civ 7 brought as I don't think we needed a \"More of the Same Edition.\" They've just needed tuning (and still do). I love having distinct ages, especially for Antiquity and Exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game since the first version.  There have been a few expansions that I felt didn't measure up, but I am loving Civ VII.  I love the variety of leaders and civilizations and the different independents.  Almost every Sunday I play an online game with my daughter half-way across the country and the game play is great for both co-op or competitive.  Love the ability now to change the behavior of independents, and to change the game settings.  Especially to customize the game play with regard to game levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much better now than upon release. Still a ways to go until its comparable to the greatness of Civ 6.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like the age's mechanic to begin with but the more i have played the more i like the change, i like the way the cities/towns are built now to.\nThe combat is much better than in previous games\nI do recommend picking Civ 7 up at some point if you like 4x games, it is different to previous Civ's but in a good way IMO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a casual gamer, for a starter, and fall in love with the Civ series since Civ III. These are my simple review, for players like me:\r\n\r\nWhat I like about CIv VII?\r\n- The visual is amazing! I dig the graphic style, the animations 9/10.\r\n- The gameplay, I can enjoy against normal AI (Governor), have not tried more. I'd give 7/10.\r\n\r\nWhat I don't really like?\r\n- it is somehow missing something I can't pin it really. Civ III to Civ VI, I'd have moments in which I'd be restless and can't wait to go home from work and chill with Civ. Now not so much. Maybe I'm just getting old or maybe the level of AI I'm playing at is not as challenging as the previous Civ's similar level AI.\r\n- I'm not able to upgrade my weapons of war up to near future. Missing GDR, Stealth planes, advanced naval ships so much. Especially GDR. A little bit of XCOM Squad. XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has gotten much better with the updates and available mods. I loved Civ 5 and Civ 6, and this one is also in the path of being a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as bad as everyone thinks, it is interesting to change ages and see what cultures are compatible with what you have done in the previous age.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Short version: \nThe game is good. It's fun. It's different than other in the series so of course most of the complaints and wishes for change are to bring back the old mechanisms, but if you give the game the chance it'll bring joy.\n\nLonger version:\nI remember absolutely hating Civ VI when it came out, only to end up with over 1k hours lying to myself, saying 'one more turn and I'm done for today'. Hell, I remember how everyone hated Civ VI for putting specific districts in game.\n\nSo while the start of Civ VII was a bit shaky for me, I ended up really enjoying the mechanics, even the dreaded change of civilization between eras. I enjoyed sending Suberbots to destroy enemy cities as a Rome as much as every other person, but being forced to actually evolve my chosen civilization is fun as well.\n\nThe Legacy Paths are honestly something I don't even notice most of the times, completing at least the minimums of them in the process of simply playing. Not sure why some people complain about those, They are no more annoying than Gold/Dark Ages in Civ VI.\n\nThe combat is fun, though I prefer being able to level up specific unit and not commander and the era changes at least force the upgrade of all units, so there is no longer a possibility of having a basic slinger fighting against a tank. Take it as a plus or a minus, it could be both.\n\nThe religion play is a bit disappointing, though I have big hopes that it will be fixed soon and we'll be able to go back to killing the opposing religious units rather than simply hoping that we're the last one in the turn and so we'll be able to change religion of a city in the last turn to how we want it.\n\nAnd of course the game is absolutely gorgeous, the details are beautiful and once I started playing I spent more time that I'm willing to admit, just watching roosters on farms, water shimmering around the waterfall wonder and all the little details in game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Civ VII is excellent. The transitions to new eras have become more interesting, more global, and give a sense of historical variability. There were many interesting games this year, but I still return to Civ every now and then.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Nine months later, still in development.  What a poorly-thought out, lazy approach to a game.  \nI have over 1,000hrs logged and have waited until now to review it.  I was trying to give Firaxis a chance to fix my beloved franchise, but my confidence (and patience) is waning.  I have played every Civ game since the beginning.  Yes, I'm that old.  I love civ.  But something went horribly wrong this time around.  Here is my list of issues:\n1.)  The game isn't complete.  I am tired of buying incomplete games.  How can you have a game that models ancient civilizations of humanity and NOT include Babylon, Scythia, Phoenicia, Vikings, Celts, Aztecs, and/or Olmecs?  I can play as Catherine the Great but have no Kievan Rus in ancient era?   No Byzantines.  No USSR.  No modern Germany.  No modern India.  And now they are releasing Blackbeard and Iceland??  Huge wtf moment for me.  It is as if they are throwing in random stuff no one is asking for.  The game also is missing basic wonders of the world like Chitzen Itza, Big Ben, & St. Basil's Cathedral.   I am STILL waiting on a complete core game!  \n2.)  Not only is critical content missing, but the existing content is broken and buggy.  I wish I could attach screenshots, because I see all sorts of graphics bugs.  Why do explorers in the modern age travel faster off-road than they do on-road?? Even in ancient era, units should always chose road travel when you click for them to auto-travel.  Instead, they seemingly take some random path through trees and rivers.  Why do ships auto-route their travel INTO the Bermuda triangle??  These are BASIC programming errors that should not exist 9 month post-release.  \n3.)  Lack of Steam Achievements.  37 achievements.  That's it.  For a game like this, there should be 100+.  At 500hrs I already had 36/37.  \n4.) Lack of in-game achievements.  I loved getting the \"first-to-sail-around-the-world\" achievement because it was a big deal historically.  Doesn't exist now. \n5.)  Leaders are capped at level 10.  All my leaders are maxed out in XP.  What's the point of continuing play?  Do the game designers REALLY want players to stop playing at 1000hrs or so?   \n\nI think the 3 age structure and the dropped immersion that changing nations creates are LESS of a big deal than these other issues.  The former 2 are bold game-design choices they were copying from other games in the genre.    It might have worked (or at a minimum, been a non-factor) if they would have simply taken the time to release a complete, bug-free, vast  game experience.  Instead, it appears the wizards of smart at Firaxis went the lazy route.",
      "voted_up": false,
      "votes_helpful": 1027
    },
    {
      "review": "I finally bought it on sale. I was liking it at first. Then the era changed. It's like this big momentous event that completely changes the game. I don't know why, history doesn't change so much in a singular point in time. It changes gradually. Then this crises stage came about. I don't know if it was something I did or if it was mandatory. My entire civilization was happy. I was making more gold, science, and culture than any other Civ I had interacted with and then I get these massive penalties during this crises era which completely derailed my ability to score Golden Ages in the legacy tree's I was pursuing. Why? Punished for doing well? \n\nThey literally tried to copy Humankind for some reason. They saw a mediocre game and said \"yeah let's do this, but make it worse\". It needs a complete overhaul. It's too bad the era change didn't happen within 2 hours so I could get the refund.",
      "voted_up": false,
      "votes_helpful": 544
    },
    {
      "review": "IF you like paying $70 for a game that relies on mods for extended playtime but crashes on vanilla, this is the game for you. Incomprehensible to be a AAA title several months after releasev with this issue still.",
      "voted_up": false,
      "votes_helpful": 200
    },
    {
      "review": "I really tried to like this game, but after a year of mediocrity I've run out of hope. The brain dead ai cannot put up any semblance of a challenge but at the same time the civs are leaders are too over tuned to translate well into multiplayer. Map gen is still bad even after targeted attempts to fix it with unbalanced starts being frequent in multiplayer even with a setting to prevent it. it's way too easy to spawn trapped in the corner or on a small island. \n\nWar is really fun and probably my favourite part of the game but it probably only makes up about 20-30% of the the gameplay the rest is left to mindlessly mashing the end turn button as you scale out of control with minimal effort. \n\nI feel with many strategy games these days they might not start off the best but I feel they have a good foundation. I do not feel this way with Civ 7. The game has bad bones and I don't think they'll be able to salvage it without seriously reconsidering the structure of the entire game. I hope Civ 7 can turn itself around I just don't have it in me to believe it.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "[h1]Overview[/h1]\nI love the Civilization series and it’s in my top 3 favorite game franchises, but Civ 7 feels unfinished at 9 months post launch. The game has a lot of potential, but still has frustrating design choices, missing features, and UI issues.\n\n[hr]\n\n[h2]What I Like[/h2]\n\n[b]Commanders system[/b]\nCombat feels more strategic and unique with different commanders. This is one of the best additions to the series in my opinion. It also makes moving armies much less tedious. Though I still wish there was an area select option like in other 4x / RTS games.\n\n[b]Momentos & Challenges[/b]\nThese actually give me a reason to finish games and try new leaders. However, the Unlock All Momentos mod is a lifesaver since reaching the level 9 unlocks on some leaders can be a grind.\n\n[b]Graphics[/b]\nThe game looks great in early eras. I really like how the entire map looks like a miniature diorama. However,  later on through the game the cities and district tiles feel cramped and make the terrain of the tiles they are built on hard to see. This can cause some accidental and unwanted moves when you cant tell there is a giant cliff between two tiles when you are attempting to assault a district.  And for me personally, this causes some pretty bad eye strain, especially compared to Civ 6.\n\n[hr]\n\n[h2]Mixed Feelings[/h2]\n\n[b]Ages system[/b]\n[list]\n[*]The era system adds decent replayability and some fun civ/leader synergies. These builds aren't as impactful as a game like Stellaris, but it is a nice breath of fresh air. This also reminds me of the \"Civ Blitz\" community mod/mode from Civ 6 where you drafted every part of your civ from leaders & civ abilities to units & buildings. \n[*]The future-era starts are enjoyable, though, I wish we could select which previous-age civ we would have played so the advanced age start would come with the traditions, improvements, and/or quarters of previous-age civs we would have wanted.\n[*]Continuity Mode fixed some of my original frustrations with the ages system. Making the transition feel more like it did in Humankind. Though I'm still not sure how I feel about all units upgrading, since sometimes a unique unit from a previous age can still be better than the new-age upgrade.\n[/list]\n[h3]Legacy Paths / Victory Conditions[/h3]\n\n[b]Antiquity Age[/b]\nI find all of the legacy paths in this age relatively fun and achievable regardless of playstyle. \n\n[b]Exploration Age[/b]\n\nReligion is bland and hard to manage. The bonuses for tirelessly working to keep a majority religion in either your own cities or other civs is not worth the small bonuses. I hardly find myself playing around religion.\n\nScience in this age is easy but not very fun since if you want to keep up with the AI or other players you need specialists anyways.\n\nEconomic and military legacies force focus on the New World, which can be inconsistent depending on map generation. Sometimes you will never be able to colonize the new world. Other times the AI in distant lands will seem to have done nothing the entire previous age. And ff you want to focus on fighting your enemies in your homeland that you made in the previous age, you don’t get points towards the military path unless you pick Mongolia.\n\n[b]Modern Age[/b]\n\nFeels too fast overall. This age seems to go by way too quick.\n\nCulture is mostly a race to explorers & artifacts.\n\nEconomic legacy is fun, but requiring both a railroad and a port to build a factory (to connect the settlement to your capital) is slightly too restrictive, especially for smaller island settlements where tiles for districts are limited since the railroad occupies and entire tile.\n\nMilitary is okay. I would even say I enjoy this the most in singleplayer, but this can drag multiplayer turns on for way too long (if you play without turn timers).\n\nScience is just a bland “complete projects” gameplay. At least in Civ 6 you could try and rush the projects by chopping resources. \n\n[hr]\n\n[h2]What I Dislike[/h2]\n\n[b]District adjacency[/b]\nDistricts being required to be next to other districts is my biggest issue with this game. Misplacing early settlements or other districts can lock cities out of options. Humankind handled this better with Hamlets which allowed us to place other districts next to a hamlet which could be placed anywhere in the settlement on a valid tile.\n\n[b]Borders[/b]\nThis one is a personal pet peeve, but maxed borders don’t keep expanding like in past Civ games. This causes the map to feel like it isn't as \"filled in\", and topping this with the settlement limit penalties, I often end the games with a map that has vast areas that aren't claimed. Also please bring back the map replay from Civ 5 I'm begging you firaxis.\n\n[b]UI[/b]\nLacks basic features from previous Civ games. Important information is buried or unclear. I don't hate the overall look as much as some people, but some very basic QoL features (like queuing multiple Techs/Civics) are missing.\n\n[b]Scenarios[/b]\nNone at launch, which is disappointing since I really enjoyed these since playing Civilization Revolution on the xbox.\n\n[b]Civs & Leaders[/b]\nThe base roster is okay, but some DLC civs should have been included at launch. England/Great Britain not being a base-game civ is crazy. Also ending Ghandi's reign over our nuclear arsenals is tragic.\n\n[hr]\n\n[h2]Verdict[/h2]\nIf this were a smaller indie game, or  starting at a lower price point I’d recommend it. At full AAA price, it feels unfinished. I pre-ordered the highest tier and have (and will continue to) put hundreds of hours into it, but I can’t fully recommend it right now.\n\n[b]Alternatives[/b]\n\nWant a taste of the eras system (and some interesting choices for civs)? Try Humankind.\n\nWant a refined Civ experience? Stick to previous entries. Especially with the civ modding communities, who continue to breath life into previous civ games. \n\nAlso, try Vox Populi for Civ 5. It is amazing.\n\n[hr]\n\nI’ll update this review as updates and DLC add more content. The game needs more polish before I can fully recommended it to most people.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The worst version ever, it is not enjoyable to play. Incredibly disappointing.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Civilization 7 should be the next great entry in one of my favorite franchises… but at this point, it feels like a masterclass in how to break a good game.\n\nThe November 2025 patch turned the performance from “rough around the edges” to “barely playable.” It runs horribly: stutters, long turn times, crashes, and constant hiccups that pull you completely out of the experience. Every update claims to fix major issues, but somehow it just keeps getting worse.\n\nWhat makes it even more frustrating is the steady stream of extra paid content being shoveled out while the core game is still struggling to function. I don’t want another cosmetic pack or overpriced DLC. I just want what this franchise used to deliver: an offline, buttery-smooth Civilization experience that works. That’s it.\n\nIf you’re considering Civ 7 right now..... Don’t. Wait until they actually focus on making the base game playable again.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The game itself is ok, but I like to play single player game and like to mod games. Due to the non-cheating policy, I can't play this game to my full enjoyment. I always keep task manager visible, but this shuts of task manager as well",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Boring gameplay loop. If you like previous Civilization games, skip this one. This isn't Civ.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "There is a popup that shows up every 6 seconds telling me to login to 2k. I just want to play a local game. I don't want any online services. Warn me once and go away, but the constant modal popup messages that stack, so you may have to dismiss like 30 of them when you go to the bathroom are badgering. I will now never login to 2k even if the game becomes unplayable just out of sheer anger and frustration.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I don't know guys, I think I've given it a chance, but it just ain't fun anymore!\n\nI used to love the franchise. Gave it hundreds of hours of my life until Civ5. As of Civ6, I had to convince myself to keep playing (70h). And this one, well, I am giving up after just eleven hours.\n\nThis game used to be fun! Especially in the beginning. The exploration, the first settlements, the first encounter, the first Wonder. But they killed it. Killed it by stuffing so many things in it, I immediately felt lost. The game has become tedious from Turn 01. There're so many layers and \"legacy paths\" and trees and what not, you quickly end up just min-maxing yields and points (and you get anxious if you miss an adjacency bonus). What's the fun in that? Does anyone even read all those pop-ups, or simply clicks whichever options gives more of whatever you think you need in the moment, like I did? And to make matters worse, they took away the historical dimension, too. Friedrich the Emperor of Rome, seriously?!\n\nDear devs, more is not always better. More food on the plate than you can eat will only make you fat. Sometimes -- quite often, actually -- less is more. So, I think you lost it at some point. Somewhere around Civ6. And so the game now feels purposeless from the start, and into Turn 100, and most probably later as well. And I don't even want to experience the Age Transition everyone's writing about -- I am not ready to suffer that much longer through this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I remember when I launched Civ 6 for the first time and the music hit [i]that[/i] spot which made me excited to scroll through the menus and start playing.\n\nLaunching Civ 7 for the first time didn't bring any of that hype, scrolling through the boring and lifeless menus to just look at a handful of playable civilizations isn't very exciting either. \n\nI bought it with a 35% discount and still feel kind of robbed after [i]just[/i] playing it for a tiny bit. While Civ 6 managed to make me excited at launch, Civ 7 can't do that. Probably gonna refund it.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I just want to pick one civ at the start of the game and use that civ the whole way, I hate this.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Don't buy this game... I'm serious i got it for free and I regret it. \n\nThe worst thing about this game is that you never get a sense of self in regards to the nation, you change so frequently. \n\nI promise if you buy this game you'll be regreting it..",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I have been a life long fan of the Sid game's. Gave then a free pass in for the screw up on the Sid's in space line.\r\n#7 is so,so Bad. I just don't know who is doing the marketing, testing or if the staff is even listening to the customers feedback!\r\nAs of this morning the game keep crashing with update.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I requested a refund for this game. I loved Civ 6, but this game feels incomplete and underdeveloped. It's like they tried to imitate Humankind but make it Civ and failed. I barely made it out of the first age because it felt pointless. Getting penalized for having more than 3 settlements? Pass. Everything getting demo'd after each age? Pass. All of the mechanics and victory paths that I loved in 6 are not present. The graphics feel...weird. Maybe one day I'll pick this up after they've vastly improved it and it goes wildly on sale. Until then, I'll just play Civ 6. \nThis was obviously an incomplete cash grab and it's not enjoyable. That's not to mention the high base game price, which doesn't include all of the DLC which might actually make the game playable. Nah, these devs have betrayed their playerbase. Let Humankind be Humankind and let Civ be Civ.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Just can't get into it like I did with previous games.  Every update I want to like it, but still just don't.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This is - sadly - the worst Civilization I ever played (I started with Civ 1).\n\nAnd what do the do about it? They give you stickers :(",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Instead of trying new things without completely breaking the game like they did with CIv 5 and 6, they just decided to change it completely and it's bad. People never asked for this, it's not fun and the DLCs are a joke. Avoid at all cost and buy Civ 4, 5 or 6 instead",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "You know, I really tried to like this game, but it's simply not Civ. A bitter disappointment -- I've been playing Civ since Civ I, and found each successive release to be an improvement. Not this one. Unplayable.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Civilization 7 is the worst game in franchise history! \n\nThe Ages System is a disaster.\n\nThe Civic and Technology tree offer nothing exciting.\n\nThe game is just boring now. \n\nThere is no replay value.\n\nCivilization 7 was expected to combine the greatest parts of 5 and 6, but instead we received a weak stripped down shell of the best turn based strategy game in history.\n\nWhat an EPIC disaster! \n\nDo you agree?",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Sadly, this is the first Civ game since Civ 1 I don't like. \r\nWhile some of the other games had problems pre-expansion, they could be ultimately fixed, but I don't think this one is fixable, as the problems come from the new core mechanics:\r\n\r\n- Age progression completely kills continuity. Why do so many things reset after an age progresses?  I don't want to essentially start a new game with every age progression. City states reset, diplomacy resets.. why do I even bother?\r\n\r\n- Things have become so much 'flatter': Diplomacy options (when ending a war, you seemingly can only trade cities, not gold, resources, or anything else). City states can be only won one, there is no tug-of-war going on with other powers. Suzerains are permanent (until the age ends, when the city state magically disappears). Resources are no longer an issue to fight over as they are not really needed for anything. Religion is just tedious and doesn't add depth. Trade is extremely simplified. \r\n\r\n- The devs have continually complained about people not 'finishing the game' - who ever saw that as an issue? I loved playing and when I had achieved whatever goal *I* set myself, I'd happily start a new game and keep playing. With this, I really don't want to. I MAY finish my one game, but probably only to be able to then uninstall it in peace. \r\n\r\n- The game pushes you along a path with the (albeit optional) legacies. WHY?! The exploration age bit is just boring and again forces you along a certain path. \r\n\r\n- I'm lukewarm about the civ switching. What's the point? Yes civilisations develop and morph into something else, but usually over many decades. Then again, this was never meant to be historical and more about creating something that WOULD stand the test of time.\r\n\r\n- Civs, leaders and heck, even wonders just feel pointless. They are all very same-y. Balance is great, but I LOVED having an imbalance and various different play-styles. Who didn't like going in as the worst. civ. ever. and coming out on top anyway?\r\n\r\nAll in all, I have no idea what went wrong, but this is not a fun game in its current state :'(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "i feel like they are trying to make a bad game\r\n\r\neverything that worked in the old titles is worse now \r\n\r\nand not only worse, there are fundamental parts missing\r\n\r\nthe whole game feels like a mobile version of civ",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I waited 9 years for this game and have only felt motivated to finish one campaign in the almost one year that I've owned it. At least the graphics are really good right guys?!?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "UI is still horrendous. Just a massive disappointment from a long time Civ fan. I've tried giving this chance after chance but I just can't do it anymore",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have tried. Thought it was undercooked, and stepped away for nearly a year. It's just.... not better than 6. Or 5. Hell, maybe even 3. \r\nDon't buy it if you have any of the other Civs. It's just not worth it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "They got me with the sale and dev updates promising to make changes the players wanted. I shouldve just listen to the reviews. I historically loved Civ and its a close third of my favorites behind Fallout and Total War.. But F's sake only 0.9 hours in and Two failed attempts to play.  First attempt didn't even get beyond the new game setup menu before it crashed out. Second attempt had me about 10 turns into the game before it again crashed. Twice in a short period with one not even beyond the menu... I've never refunded a game and I don't even know how, but this is going to be my first time giving it a shot. Screw this game. Everything the reviews are saying is right. This was crap released at a $70 price tag.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Whoever thought of the ages \"reset everything\" mechanic should be forced to play at least one full game of Civ I to VI as well as Activision's Call to power series just to realize how far they strayed from the magic formula. In my Opinion, this is the worst game in the Civilization series I ever played. Keep in mind I even tried the Symbian iteration as well as Revolutions for consoles one...",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "They really swung for the fences with this game... and honestly struck out. There's a smattering of inspiration here, but it's so bogged down with horrendous UI, bugs left and right, and an overall approach to civilization evolution over ages its not worth it. If you're a seasoned Civ player, you'll get probably one or two enjoyable games in, until you've figured out how to exploit the mechanisms and AI, and then you'll struggle to lose at all on deity mode and just walk all over the competition. The setup is overly complicated, not particularly difficult, and instead of focusing you on building a civilization it turns into playing to objectives in mini-civilization rounds in order to make the next objectives marginally easier. \n\nJust feels like a MASSIVE step back for the franchise, I've played since Civ 1 and have never been so disappointed in a Civ game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I can't tell what's wrong with this game but it's not fun. There is something missing here. I can't recommend it. Just play older Civs instead.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Truly disappointing. And then the greed to follow. Sadly I am not going to be bothering with future titles from Firaxis. Be grateful if I buy your content on whim at 90% off.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Look, I get that you don't want cheaters playing in online games, but if I have a program running and I'm not in an online game you don't get to crash the game on me. What I do in a single player game is MY business.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Civ 5 was most functional\nCiv 6 was most immersive\nCiv 7 was the most lean removing all the fat that made the previous 2 taste great",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Unless the game is below $10, I wouldnt recommend it.  It took a perfectly good model and threw it away to replace it with garbage.  They Eras system sucks, is not enjoyable, and makes no sense.  Right in the middle of a war with troops on enemy cities doorstep, but for some reason they all reset, go to a random city, and its like nothing happened because the age changed.  Its been some time and they have made no meaningful changes.  They just threw an expansion pack at us for free because theyre praying that anyone will come back and play this.  I wouldnt recommend it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I have warmed to the gameplay a bit, but Firaxis seems desperate to put in as much monetisation as humanly possible. At time of writing it would cost me 200$ to purchase all content for a game that was already more expensive than its predecessors. I would be less insulted by this if it felt like this was a meaningful group of DLC but it truly seems like most of the content should have been in the basegame.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's not a bad game, but this is no longer \"Civ\" game. Plays more like Civ&Humanity hybrid.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I paid $70 USD for this clunky, unfinished mess and they have the audacity to have more than 10 paid DLCs in the first few months!? I have played Civilization since I was 11 years old, i built my first PC to play Civ 1 with something like 8 or 9, 5 1\\4 inch floppy disks! So I am a veteran of the series, this version is highly disappointing. I want games to take chances on new mechanics and such, but they should be well thought out and put together long before fancy graphics are given time and effort.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I have played Civilization, since the first edition.  Out of respect I have been trying to hold off, like others, in reviewing this game...but at this point it would need a complete overhaul.  Even with updates and filler material, it's Bland and Underwhelming.  Some improvements were made but it's nowhere near what is needed to truly make this game great.  They are now in the phase of just marching out the add-on content that only glosses over the inadequacies.  They took the animation from Persia's Leader, put a pirate hat on him and called him Blackbeard, and added privateers to the game...WOW...talk about really walking the plank to satisfy your customers.  They smoothed out the ridiculous AGE transition hiccups, but this game is fully infested with the Points/Achievments  system.  This is Civ not Fortnite...I DONT CARE about emojis, or cool name bars...I want a gaming experience that's worth the money I spent on it and not cheap gimmicks like every other software developer these days.  Extremely disappointed.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I don't understand how a game that's normally $70 (i bought it on sale),  still have game breaking bugs in it 9 months after release. Such as the game crashing during an era transition and every single time you reload that same save.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This has been changed so much, dumbed down so much from what this game used to be, even before you consider older Civ games (4 was peak Civ gameplay). Shame.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Wait a year or two, and buy the complete edition when its on sale. Even 8 months later, Id rather repurchase Civ 6 with updated graphics. Sid Meier probably wont attach his name to another game after this one..",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "If you like playing just the start of a civiliation and never getting to see the fruit of all that building and planning payoff this the game for you! Just as soon as things getting rolling its crisis time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For me, this game fundamentally missed the mark and significantly damaged the Civilization franchise's reputation. It takes the core elements of a great strategy game and transforms the experience into something almost unrecognizable and deeply unsatisfying.\r\n\r\nMy primary frustration lies with the periodic resets and radical shifts in gameplay.  The core fun of Civilization is building incredible momentum—seeing your empire grow, your technology advance, and your victory inch closer. This game repeatedly interrupts that feeling.\r\n\r\nIntroducing a mechanic where you are forced to reset your progress, remove units, change your capital city, and select a new civilization not once, but multiple times, is a design choice I simply cannot comprehend.  Just as I would start to see some wins and eke out a victory against the AI, the game would initiate this scenario. This felt less like a strategic evolution and more like being arbitrarily forced to start over, which is contrary to the spirit of the Civ series.\r\n\r\nI genuinely wanted to enjoy this game. I committed a significant number of hours and experimented with the new era settings, hoping it would click. Unfortunately, the game's core mechanics, particularly the constant disruptive resets, prevent it from being a good experience.\r\n\r\nIf you are a long-time fan expecting the traditional, sprawling, empire-building experience of previous Civilization titles, be warned: this is not that game.\r\n\r\nIf you are cool with radical change and enjoy a strategy game that repeatedly forces you to tear down your progress and restart with new conditions, then you might find this game fun.\r\n\r\nIf you crave the classic Civ formula—the slow build, the cumulative momentum, and the preservation of your progress—I would strongly advise against purchasing this title.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "One step forward, 3 steps back for the franchise. \nI liked some of the gameplay enhancements they made. Cities vs settlements, no worker management.\nThe rest seemed like a big miss. Obviously everyone hates the eras, and I found the crisis shit to be annoying.\nHollowed out tech tree was disappointing. \nTook me about 40 hours to play a game and a half. \nZero desire to play more sadly.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Imagine, if you will, Humankind, but all the worst parts of Humankind, and the makers of Civ VII were like \"we want all of the worst parts in this game\". That is Civ VII. The ages don't work, they don't make sense. The AI isn't great. The UI is awful and makes for a terrible user experience (can't find tech or culture trees, if they even exist among other things). The refining of tech and culture is a cool idea, and the graphics are pretty, but that's all I'll give it. Do not get this game, it's not worth the time or money investment.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I find the game very unstable, I have 260 hours and have crashed not every game but regularly. I'm currently trying to load a game that worked just fine last night but crashes every time I click next turn today.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "liked the ideal at the beginning but once you've played a couple of games it very boring compared to civ 5 or civ 6, \n\nwould like to play this more but the black screen of death when creating a new game or loading a save kinda stop me playing again, after one of the update over the summer   \n\ntired the civ support and are just going in circles and getting passed about, with getting no progress after 3 weeks of back and further emails, wish they would help more than saying check driver and try again every email",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They've finally managed to destroy a brilliant game concept. This isn't a Civ game. It's Humankind 2.0. I've played every Civ game and this is by far the worst edition yet. Way to ruin something by trying to \"fix\" something that wasn't broken. Worst Civ game ever. And now they are back peddling and trying to give players options to play as one civ for the whole game, never m,ind that game mechanics don't support that style of game play. They screwed the pooch. Free DLC and haphazard game reworks isn't good enough. I'd rather play Civ IV than this crap.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "The foundational design of this game is broken. Even Humankind did the age transitions better than this. The UI/UX is mess and looks like a cheap Unity game, in addition to the focus on a controller-based interface. Really sorry about the money I threw at this, this game cannot be saved. Really the only good thing about this is Gwendoline's voiceover.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is the first Civilization game that I have not sat down and no-lifed XX-hours in a row to play.\r\nI played first age on 2-3 sittings. Then exploration age on again about 2-4 sittings.\r\nI am not sure if I will play the modern age at all. I just don't feel the urge to play. \r\nThe game play is kinda bland. Like watching paint dry or grass grow.\r\nIt's missing some kind of depth and appeal.\r\n\r\nI do love the graphics, though for some objects/textures we're clearly missing 4k versions.\r\n\r\nThe ages are not too bad of an idea, but it's certainly not polished and definitely not finished.\r\nA lot of stuff in this game simply misses explanation, user interface elements. It's cryptic, or simply mentioned in one place without a proper explanation. \r\n\r\nWe're missing the 'First to circumvalent the globe', which was a shock for me - I've lost so much time going around the world, and I have not been rewarded for that.\r\n\r\nThere are bugs like no connection to the trade network even though there should be or proposing other trade points when reaching the previously accepted destignation.\r\n\r\nI've expected a lot of mods for this game. At least user interface mods, that clarify stuff that Firaxis failed to do. \r\nThere are some, but it's surprisingly little. I guess people simply... don't play this game? So, they don't mod it?\r\nWould be a correct guess with the amount of negative reviews...\r\n\r\nI suggest waiting like year or two and seeing reviews then, if the game is playable. Right now... Yeah, not really.\r\nThey've ripped off ideas of Humankind and failed to do it properly. In Humankind I had the urge to play, like in previous Civ games. In here, I do not...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This Game is a joke:over priced full of bugs and don't get me started on the \"ages\" system...try'n to get a refund as we speak",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "they took so much out of this game that were once in the previous games and it feels like vital pieces of the civ experience is missing and i dont like it at all. the gameplay feels dumbed down and the rulers are weird and many are not canon to any world leadership role which is fine but theres nobody cool to play its too many niche eras of leaders that are mixed up in history's timeline. im just very displeased man. i spent a lot of money expecting a bigger and better civ but it just feels like less.. spoon fed. portioned for DLC expansions and stuff like that.\n\nthis is my refund note lol... hopefully i get it with 16hrs or whatever (freakin fell asleep with my pc on cuz the game was so boring)",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "No Hotseat!\n \nBought Founders Edition for 120 € on release day.\nInstalled it.\nOpened multiplayer menu.\nClosed it.\nHaven't touched it since.\n\nWent from playing Civ 6 once a week to not playing them at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well after a while of playing, and a long time Civ fan and loyal customer. this game is a huge dissappointment. i thought after everyone complained they would change the game to work and function like it always has without stopping every age. but not only that now i cant even save the games locally which means no autosaves. just everything about this now sucks.  probably wont ever buy another civ again after this.  they know everyone hates the way it is now and they refuse to change it, they could at least allow you the option to pick the new way or the standard way..  but no, and now save games are screwed on win 11 and they know this, yet they refuse to make a simple hey choose where to save games option.  Dev like always ruined a great series because they think they know better and want to change thigns for the worst and when the public cries no change it back they ignore them.  Game now uninstalled and i should get a refund.  but we wonlt so instead i am rebuking fireaxis games now and not only will never buy another civ game i wont buy anything from fireaxis again either.  DO NOT BUY",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "the concept of ages in this games makes each time you play feel rushed and unfinished.  before i have a chance to do much in the first era the second starts, then the third.  Then something occured and a completed the ivy project and the game was over.  I still didnt get past bi planes.  It feels to me that this game has taken a completely new direction of game play and it does not suit the civ style.  I most likely will not be playing this for too much longer, im just disapointed that its past the full refund period",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "what game award is this nominated for most disappointing release. Betrays the fans, quick cash grab. Couldnt recommend it less and its a series i have every game of",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "They really dropped the ball with this one. I regret buying the expensive copy. I thought it would be good like the other ones. Can't even hotseat.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game doesn't even feel like civilization anymore, the age transitions are dumb, the urban sprawl making the map unreadable is lame. Makes me miss civ 2, the game doesn't feel epic at all just speed run building something on one city. The game seems years away from ready.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have enjoyed playing CIv since I first played Civ 1. Each game always took a few updates to really hit it's stride and become a very enjoyable game. With Civ 7, the biggest diversion from the original formula is also its biggest issue in my opinion. The game doesn't allow you to build throughout time. The eras format feel very disjointed and forces me to make decisions on my gameplay that distance myself from the progress I had made. I can understand their decision to cut the game into 3 segments for smaller, more casual player friendly version, but I am anxiously awaiting the update that makes this game feature an option, not a key game detail. I have clocked quite a few hours on Civ 7 but when the eras end, so too does my interest in continuing my journey with that file. Wars are unilaterally ended,  My troops are upgraded, but downsized. My armies now feel and play different. The new era starts with me feeling destroyed, despite being at the top of my Civ's evolution.\r\n I enjoy the graphics and the army updates, but find myself returning to Civ 6 for the continuity of the game. To get the entire, unbroken experience of my rise and/or fall. I feel like the eras interrupt the game, not enhance it. Maybe make the eras a choice when you lose the game or when your Civ is in a harsh decline. For no Civ ever stops being themselves when they are at their height. They only search out a new identity when their current rule is failing. \r\n     Again, I like the updates in 7. But the key feature of 3 separate games needs to become an optional part of the experience. As long as it is there, I feel like my hand was forced into changing the path I had laid for the people I had chosen to lead.  Keep it for the casual players who enjoy it if that is who it was created for. Make it an option so those of us who enjoy the epic long game can enjoy this new version too.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Surprisingly really boring progression. I cannot get myself to begin a campaign again because developing your civilization becomes really stale from era \"victory\" conditions influencing you to go down the same routes for tree points. These era points streamlines the aim of the player is *really* boring as you are being led to the same decisions over and over again. Also there is a huge lack of impact in the game as wonders and luxuries don't do enough in terms of power. In Civ 6 going negative amenities is a huge issue so you need luxuries and in this game all luxuries do is give a few percentages in buffs like what. \n\nOverall, the game lacks a huge amount of mechanics that influences you to deviate from previous playthroughs. What causes you to deviate an artificial decision of choosing a different civ which is ass and just forced compared to previous iterations where you're gameplay is influenced by your resources, neighbours, land, etc. Instead the game should force you to react to your map like in previous games creating unique playthroughs.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Is it possible to nominate this game to \"Shittiest Civ game ever\" for the Steam Awards?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have played every version and offshoot of Civilization since the first game was released. This game should NOT have been a core Civ game. I would have given it a favorable rating if it were a release like Civ IV: Colonization, and was named something like \"Civilization: Eras\". The core mechanics are changed. The game is changed. While other games in the series have been better than others, this one is NOT worthy of the title given.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I made it short and simple for you guys - shit game go play civ 5 or 6 or crusader kings 3 or stellaris or any other grand strategy game and actually have fun",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I loved this game until I COULDN'T PLAY IT ANYMORE! It has been months and I have followed every suggestion to get rid of this stupid \"check your system time settings\" error. 146 hours into this game WASTED. And I can't get a refund? This is TRASH! FIX THE ERROR! It's all over the internet you have this error. I have followed EVERY single online fix I have found and nothing has worked. I repeat, just FIX THE ERROR! GEEZ.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I pre-ordered the game in excitement and waited to post a review. At launch it was clear the game was not up to par and should have been pushed back. I gave it more time, waited for some patches and DLC to hopefully help the game, and honestly I'm still underwhelmed. The game doesn't feel like a Civ game, its void of any personality. The leaders face each other in dialogues as if its a Mortal Kombat loading screen, which is more odd than anything, kind of putting you into a 3rd person perspective, when you're intended to be the second leader in the screen. The developers wanted to streamline the game, and I can't argue that they did not. However, in doing so the game feels completely dumbed down, which doesn't make it fun. The team is doing a good job at rolling out patches to try to fix things overtime. I'm a huge fan of the franchise, but this installment plays and feels like a worse version of Humankind. I applaud them for trying to implement new things, and the graphics are nice. It was probably too much all at once, and trying to launch on all consoles and platforms on Day 1 was an unnecessary hurdle, one that could have spread resources and focus across a wider range, rather than focusing on getting it right for some, then rolling it out to the rest as time went by. The game is very clearly a working progress, despite having been released 9 months ago. The predictable era crises are now able to be turned on or off, which is a nice option. Unlocking new civs based on your play-style or accomplishments seems out of place and touch. But, if you're a casual player thats new to the franchise, then this game could be for you, you might like it, but know that this is not reflective of the franchise. Highly recommended to play a previous installment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After a couple of games it's just becomes boring. \r\n\r\nWent back to the CIV VI.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve generally loved the Civilization and Alpha Centauri series, but Civ 7 is a disappointment in my eyes. The new age-progression mechanic breaks up the natural flow of gameplay—it feels more like hitting pause than evolving through history.\r\n\r\nI’ve put in around 40 hours at launch and recently added another 15 hours after a long break. I do appreciate the quality-of-life improvements, which were long overdue and make certain aspects smoother. Unfortunately, even with those upgrades, the game just isn’t as engaging or fun as earlier entries.\r\n\r\nIn short, Civ 7 looks good on paper and fixes some long-standing issues, but it loses the spark that made the franchise so addictive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have played civ since civ2, it is the game I play the most. This is the worst of the series, waste of money and time. If you did not purchase the game dont.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried really hard to like this game. Awful UI. Dumb UX. Whoever suggested to go with a tablet UI/UX even for the PC version is a moron and should seek help. They are incapable of living by themselves. Probably has 2 secretaries running their lives for them. People like that should not be allowed to make decisions for others.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I’ve loved Sid Meier’s Civilization since the very first game. I even pre-purchased a bundle with all the upcoming DLCs, so I have the full content package. When the latest naval expansion was released, I decided to give it another try.\n\nBut sadly, the magic is gone for me. The game no longer feels epic — just a long chain of small, inconsequential actions. Wonders don’t feel grand anymore, whether natural or man-made. The same goes for exploration: the map is packed with resources, yet none of them feel meaningful. It hardly matters whether I have iron or not — every resource just adds a tiny, grey bonus to the mix.\n\nI still try now and then to get into it, but after a few hours of clicking, I simply lose interest. The old “just one more turn” spell is broken.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm a huge fan of the Civ series and after seeing the initial negative reviews i waited a while to purchase the game to give the devs some time to sort stuff out.  Unfortunately, as of Nov my official recommendation is to play Civ 6 instead.  if the game were half the price, i might suggest getting it, but for a variety of reasons it's just not worth the price.\r\nPros:\r\n- stable, no bugs, runs well\r\n- looks good, animations are smooth\r\n- a few good new ideas in the tech/social system\r\n\r\ncons:\r\n- The entire age advancement system is clunky and is an absolute momentum killer.  i get they were trying to get the historically accurate \"civilizations fade, but cultures and people continue\" feel, but they instead got a disjointed momentum killer.\r\n- UI is not nearly intuitive/informative enough for a Civ game.  as a long time Civ player that understands the system interactions that lead to successful games, i struggle to get basic city and unit info at a glance.\r\n- Diplomatic system...again, some neat new ideas...but also, far less involved or informative than expected in a Civ game.\r\n- Graphics are form over function.  They look great, but they are drawn in a way that makes it hard to tell what improvements and things are going on in a tile or area.\r\n\r\nI think some of the failure is based on the relatively high standard Civ players have come to expect from a CIV game.  but, if they aren't going to deliver on CIV quality, don;t charge Civ prices.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is overall just a much worse version of its predecessors. UI and bugs aside, the gameplay design falters over and over where it used to shine. The fact that your cities regress into towns per age, the shallow and boring tech tree, the weak late game etc are all examples of trying to make civ \"quick\". Civ was never meant to be a quick game, and the fact thats its targetting \"smaller quicker games\" or micro segments with ages that continually \"level the playing field\", shows that they have lost sight of what the audience actually enjoys. \r\n\r\nWould not recommend this even on sale, pick up an earlier civ (hell even 6 which isnt as good as 5) rather than this ghost of what used to be an excellent franchise.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game wouldn't work for roughly 2 months. Finally there was enough updates the game finally works. I mean literally couldn't play it. 45min over 2 months because the game kept crashing.  Finally playing it for 15 hours I realized it's not really that fun. I don't get the end of the eras and the changing civs is kinda dumb.  It's also way more confusing than previous Civ games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game crashed half the time I try to start it. Game play is much more dry and boring than previous Civ games. Regret buying and wish I hadn't given it as much of a chance as I did because I missed my refund window.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I waited to finish a complete play thru before giving my thoughts. \r\n\r\nPros: really quick end of turn animation keeps the game moving quickly. Combat and commanders are great. Expanding the city manually and specialists are a cool new feature.\r\n\r\nCons: The least satisfying win conditions I have ever seen, I won by completing a military project and it felt incredibly lame. Religion is just an icon and honestly they did so little with it I would say just take it out completely as it feels like a waste of time. War weariness and crisis events are simply annoying to deal with and don't feel like they should be in the game either. Wonders just exist; they don't have great benefits and you can hardly tell what hex is what.\r\n\r\nI'm going back to civ 6 maybe they can update this game next year, would not recommend purchasing or playing yet in 2025.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Unplayable with the game consistently crashing between age transitions",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "by far the worst civilization game. they tried to make it easier to manage and failed completely. Everything is a rush, and advancing makes no real sense. I am not going to pre ordering moving forward.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I've played this game for just over 200 hours now and I find it unbelievably boring. The amount of customization involved and then the mindless clicking once you get beyond antiquity is incredible (new resource tiles, policies, attributes, techs, master techs, religion beliefs, celebrations, city production items... the list just goes on and on). I played over 2000 hours of Civ 5 and have had every edition of the series, but this is quickly becoming a game I barely want to play anymore. Graphically stunning in places, but otherwise disappointing.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is very disappointing, I have over 2,300 hours in Civ V, 200 in Civ VI, and almost 15 in this. In reality it's more like 12 hours for this as I got up for an hour or so a few times to deal with something without closing the game out. That was as long as it took me to complete one game. \n\nFirstly, I was initially interested in mixing and matching leaders and civilizations. This was quickly remedied when I saw Harriet Tubman leading Aksum and Ahsokha leading some civ so forgetful that I don't even know who they were. I was playing Friedrich as Rome. I found this was problematic because the game does very little to give each civ a distinct aesthetic. I literally didn't know what civs the leaders were leading half of the time and I can't just trust the leader to know what to expect. Initially I wanted to befriend one so that I could conquer the other, however the new diplomacy features are so surface level and scant that it didn't really seem like it was possible. The tooltips do very little to help clear any confusion one may have as they usually go in depth on one specific thing, but explain nothing else about anything other than that one thing it wants you to do. We all ended up being enemies.\n\nI did really enjoy the new commander focused combat style and I found war to be one of the only enjoyable aspects of the game. (I always enjoy war in civ, but I also like to do the science and culture, and religion victories or play styles) as a matter of fact, I found it to be really one of the /i only /i aspects of the game that have any amount of depth to them. Half of the time I found that the game consisted mostly of me moving my soldiers around hitting next turn and then the game tells me I did something and to choose something for some reason I don't really understand giving me a bonus I don't really understand. Most of the game feels like it's on autopilot so you can focus on action... but I want to be in charge of everything. If there is a way to track things like celebrations or any of the other 50 random seeming events that just happen to you, I was not able to find it. \n\nYou may blame me, \"dude, you didn't look hard enough and blame the game that you couldn't think hard enough.\" but believe me, the UI is so atrocious that you struggle to track the things that they do put in front of you! Speaking of things they make difficult to see, the camera doesn't track action. if your troops get attacked or something happens on the AI turn, you don't get to see it unless your camera just so happens to be hovering over the area at the time. Further, small though it may be, it can be difficult to tell if it's your turn. There is no audio chime or visual cue other than a minor icon change in the bottom right. it will not jump to a unit either. \nThis is an issue because it means that you don't know if it's actually the new turn or if a unit completed it's previous order and needs a new one. \n\nNow let's talk about ages... They suck, and it ruins a great deal of mechanics that should be fine otherwise. Firstly, since civs are only meant for one age, that means that each civ's mechanic is incredibly shallow because it only needs to work for one age, not an entire game. This usually makes them very narrow and shallow. Second, the game needs things to go on and that means it needs to artificially undo your progress just to ensure that when the next age starts you don't just keep rolling. It does this via crisis. in my case it was just making my cities unhappy because I was militaristic. I had done very well in spite of a two front war and had both other civilizations on my continent down to like 2 cities each. No matter how many resources or happiness buildings I made, the cities/ towns  NEEDED to be angry and revolt. I moved troops to defend against impending rebellions and was annoyed but figured this is just what happens when you expand too far. Not too bad, and maybe it'll be fun and challenging since I'm demolishing everyone else.\n\nNo rebellion came, they didn't become free cities or rebels or anything. IT JUST GAVE THE CITIES BACK TO MY ENEMIES AND ENDED THE AGE. So I had to spend the start of the next age recovering and then wiped them. Now came the age of religion.\n\nReligion may as well not be in the game. you can train a missionary, you can use two charges of that missionary to fully convert a city. This concludes the impact of religion on the game. \n\nAt this point, without any effort, merchants, or even really building anything money focused, I was making 300 gold a turn in spite of having a giant military. It was basically costing me nothing. by turn 30 of the modern age I managed to conquer the entire world. this was not hard to do because THERE WERE ONLY TWO CONTINENTS AND 6 CIVS INCLUDING ME IN THE ENTIRE GAME. I honestly could not relay to you what I did research wise, as it did not seem to matter, nor could I tell you about my culture, because it did not really seem to matter. In essence, the only thing that mattered in the entire game was managing my army, you can safely ignore nearly all other mechanics in the entire game and it will not matter past the first age. Sure I was trying to win a domination victory, but I shouldn't be able to literally not engage with ANY of the other mechanics of the game. By the modern age I didn't even bother converting towns to cities anymore. I had more than enough money, but it just was more hassle having them build things for me because I was literally just winning without them so what would the point even be?\n\nin short, the combat is the only interesting part of the game and after you secured an advantage in that aspect, it isn't even fun or interesting anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If I wanted to play a half cooked early access game, I would have bought one. It'll took 5 years for this game to close to what Civ6 now  (and that took a decade). And that's regardless of everything that never worked (balanced and disconnect-free multiplayer experience, an actual AI that isn't dumb as a rock. Do yourself a favor and buy something else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A pretty disappointing experience. Maps look good. But suffer from hiding game critical information due to their muted realistic appearance. UI is very bad. But still, all in all it could have been OK, but I just cannot understand the meaning of changing civs mid run. It kills immersion and just feels gamey and tedious. As countless fans have pointed out, it runs counter to the very essence of what civilization is. I really wanted this to work and thought I might learn to appreciate it, but nope. Sadly, by the looks of it this foundational feature will never change and thus the game is effectively dead to me. A pity but there it is. Maybe in 5 years or so there will be a CIV VIII. Until then I will have the occasional VI game and pursue other pastimes.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Played Civ 4 and 6 many hundreds of hours. This game is terrible, like a cell phone game clone of civ. Very tedious, bland, not engaging at all. So streamlined that any interesting choices you might make in another civ are not possible. The eras just compress and simplify everything down to the point where there is barely any STRATEGY in this STRATEGY game. Paid $45, I cannot recommend this game at any price. The haters were correct, this game is as BAD as everyone has insinuated, maybe even worse because it is so bad that to me it seems unlikely that there will be a Civ 8.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is the worst version of the Civilization game!  You have lost a customer!  I have been playing since the original and play it every once in a while just to have the feeling again.  This is the last Civilization game I will buy.  The annoyance of being forced to choose a different leader throughout the game is time consuming and not needed.  Maybe the developers are trying to have people accept different cultures or maybe they thought it was progressive.  I usually look through the list for a while to decide at the beginning of the game and maybe try a new leader.  I don't need or want to do it more than once.\r\nThe game no longer seems to let you turn off the \"climate change\" settings or whether you are going to deal with city states constantly attacking you.  Yet another feeling of the developers forcing their idea of how the game should work and the player has to accept it.  The only real reason I have had not to go to Linux is because Civilization plays on Windows.  I think that has just changed.  I can play old versions of Civilization on Linux just fine.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "constant crashes after age ends means you literally can't finish half of the games you start. brand new PC with amazing stats, so it's definitely the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Experienced many crashes and bugs within the first couple of hours of playing.\nThe base game has been released for a long time by now, how have they not fixed the majority of these issues?....or maybe they already did, and it is still this shit....there is no way...right...RIGHT?\n\nBtw I had fun playing the antiquity age, but I can't tell you anything further since THE GAME CRASHES DURING AGE TRANSITION FOR ME......What a piece of shit....\n\nUI is trash! How is this getting approved for release....\n\nI DONT WANT TO CREATE A 2K ACCOUNT TO UNLOCK NAPOLEON!!!!\n\n....my god this shit is pissing me off....\n\nUpdate to review:\n\nI send my game files to a friend of mine who also bugged out during age transition, it is not a hardware issue. The map changes during age change and I think I got a bad initial seed, and it bugged out during the transition...This happened on my first 2 savefiles..WHATEVER...Now I can continue....\n\n... but there is more.... after making it into the final age I am now finding myself completely locked out of my economic win condition that I have been building up to .. to win in this way you need to build a railway station in your capital to proceed. The problem is in my capital there is no more space. There is no way of fixing it, I cannot destroy already built buildings... what an awful game design... \n\nMy disappointment is immeasurable, and my day is ruined!!!!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A step down from the previous civ games in every imaginable way possible, for 70 dollars.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Can't get passed age transitioning, purchased the game at launch, tried reinstalling, launching with vulkan, reinstalling OS, all the fixes online, no luck.\r\n\r\nCan't recommend wasting money on this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tried this game again a year later after i was thoroughly disappointed upon release.\r\nThis still feels like an indie project and not in a good way: All the depth of the previous titles is completely gone and the UI is still horrendous in certain places (city HP i'm looking at you).\r\n\r\nI really don't know how they could have fucked this up so much after the legendary civ 5 and 6.\r\nDid all the senior staff leave the company? As someone in the industry this project feels like directors and lead designers directing a bunch of junior devs without a sense of direction, changing their minds every 6 months.\r\n\r\nWho thought it was a good idea to design such an uninspired and awful leader screen? They just look like two idiots rambling at each other with zero aura.\r\nThis whole game screams simplification and mobile game design.\r\nThey also removed thermo nukes and that removed 80% of the end game fun for me.\r\n\r\nAll that to say I honestly lost hope in this game, it felt exactly the same playing it now as it felt on release.\r\nJust focus on the next game devs. You can keep the commander and the 3D art but scrap the rest.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "do not waste your money, even if this game is for .99 cents dont even buy it... it is one of Firaxis greatest disappointments and will be remembered as such",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "“Cool ideas buried under a completely different game.”\n\nI’ve been playing Civilization for years, and Civ 7 is the first time I genuinely felt like all that experience meant nothing. Yes, some of the new improvements are cool, but they changed so much of what made Civ… Civ. The core identity feels stripped down and overly “smoothed out,” almost like an inclusive, simplified version aimed at people who’ve never touched the series before.\n\nMajor mechanics feel disconnected from past entries. Systems I spent years mastering don’t translate at all, and the things that gave the franchise its depth, personality, and long-term strategy are either watered down or missing entirely. The game doesn’t even feel like it’s from the same studio — more like a reboot made by a team that only half-understood what made the original special.\n\nThere could be a good game buried in here, but as someone who’s loved this series for decades, Civ 7 is a major step backward. If you’re looking for that familiar Civilization feel, this isn’t it.\n\nI am upset and I got a free copy with my graphics card; I can't imagine how I would feel had I bought the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Without question the worst installment of Civilization.  By far.  \r\n\r\nThey threw out all the game mechanics that made Civ fun for decades in order to make it fit the limited attention span of the social media era.  They made it really pretty though.  Spent an awful lot of time polishing that turd so the customer wouldn't notice that it's actually a massive pile.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a heaping pile of shit. I would rather play Furry Hitler than this bullshit. I have no clue what the devs were thinking when they created this monstosity. How do you mess up a top down strategy game this bad. If I hadn't bought this game when it released and waited to touch it until now, I would refund this garbage.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've been playing since Civilization - Yes, Civ 1 - and still have it. I've loved this game. I don't love Civ VII. In fact, if this were my introduction to the game, I'd never bother playing it again. \n\nThe gameplay is boring and makes no sense. There are no friendly villages; every time you turn around there is someone attacking you, which makes it difficult to focus on building. The graphics are admittedly very nice, but I don't think they're that much better than Civ VI to justify the price, particularly since the game is so much less interesting. \n\nI wonder if they rushed the game to market and are relying on us to provide feedback so they can fix it? Perhaps they ran out of ideas once they realized the game doesn't work well?\n\nThe ability to target a future tech in the research trees is gone. So each time you have to look at the Tech or Civic trees you can only pick out the next one.  You can't decide at the beginning of the game, for example, that you're going to aim for democracy down the track. So, every single time something is researched you have to take a break from the game to re-thing your path.\n\nThe city build commands make no sense. It's as though the developers have decided that we, the players, shouldn't be able to plan or build. There is some weird limit about only being able to build 4 cities before your cities and civilization take a major hit in happiness points. Why on earth would we also have to lose progress at the end of each Age and then take a different path? This makes no sense at all.\n\nI've come back to Civ VII a few times but I'm not going to for a while. I'm reverting to Civ VI. I'll give this some time - months - to see if Firaxis listens to us and makes this even remotely interesting. At this stage, though, I can't see myself playing this in the future.\n\nWhile writing this review, I was listening to the verbal sales pitch from Firaxis about how good this game is; 'the ultimate version,' 'the whatever.......' No, it's not. It's uninteresting and confusing.\n\nI hope this version isn't the end of the franchise. But, I guess I have my legacy copies that I can keep playing even if this is the end.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The way that they forcefully break the game down to three acts is not done delicately. It feels like a ham-fisted attempt to combine three sub-games under a single umbrella.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I have enjoyed my time on this game so far, but the game has crashed every time i transition ages. I will change this to a positive review upon this being fixed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not only it`s expensive, the game is crappy.\nCan`t you add a quit button during era change?\nNew era and no load files at all?\nFreaking first era end faster than your devs.\nUnbalanced, unpolished, should not been published.\nAnd 10 turns countdown.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every mechanical improvement to previous games feels like a silver lining to total artistic failure.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "what a let down.\n\nit's buggy, lacking content and poorly put together. like many, i don't like the eras idea but appreciate they were trying to do something different, it just hasn't worked though and i think that's largely down to the lack of content.\n\nsave your money and buy civ 5 or 6, both are much better games.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I’ve played and absolutely loved Civ 4, 5, and 6. Especially the last two were my favorite games for years. But what I paid so much money for here is honestly a joke.\nIt’s a total disgrace that they’re selling half a game. It’s painfully obvious that it ends in a spot that clearly isn’t the real ending, and that’s just not worthy of a Civilization title.\nAt launch, I could still live with it, but now, months later, I came back — and it’s still a mess of bugs and terrible balance. Really sad to see a series that once stood for quality fall into the content mill, trying to make as much money as possible from a bunch of unfinished mini-releases.\nMaybe the devs suddenly lost their talent — who knows.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I think the game is solid is some ways. The combat systems are good, the map and art are beautiful. Building over older buildings make the cities interesting. It kind of ends there for me though. \nThe Ages system ruins the game for me. There feels like there is no continuity at all between each age. It's as if you complete the first age, and then you're automatically fast forwarding hundreds of years to a new age.  Oh and by the way, you're forced to choose a whole new Civ...for no apparent reason. It feels like you have no agency. \nI understand the urge to have the influence of other civilizations on each game so you're not Rome the whole time for example, but this just lands flat when you're actually playing it. \nThe UI is pretty bad as well. It feels like everything is the same color and it's hard to make out what is what. \nThe resource system and how to move resources is so confusing to me. It makes me miss the simple amenity system from Civ 6. \n\nHopefully they improve on it.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}