{
  "positive": [
    {
      "review": "I don’t think this game is abandoned — it’s finished! Maybe in the future this hidden gem will shine, but right now it’s not the next RimWorld. I mean, it has a community and some great mods, but it’s not on the Minecraft level of popularity.\n\nI think anyone who likes survival and management games will love this game. This game is like another flavor of the same recipe — and I don’t mean that everything is just like RimWorld but in 3D; it has its own charm! Saying that this game is just a RimWorld clone is like saying every game with crafting is a Minecraft clone.\n\nI don’t think the game is abandoned; I think it’s finished. Maybe it will shine in the future, but as with everything in capitalism, what dictates what happens next is money. This game wasn’t made by one passionate guy — it was made by a small passionate studio. Still, it’s a studio; everyone needs money to pay their bills.\n\nIf you like this genre — colony-sim, survival, sandbox — you’ll like this game. Give it a chance!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "There are two things that stop this game from being an 8.5/10; how often you have to tailor clothes and repair solar panels and wind turbines. I feel as though I am wasting so much time making clothes for the survivors because they wear out at an absurd rate. Add to this wind turbines and solar panels, which you need plenty of; they break down far too often resulting in a waste of time and resources. There should be an option to turn this wearing out off. For now, I give it a 7/10.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I love this game...although it is sad that the heart of it is to build an awesome space colony then abandon it so you can win LOL.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Amazing game, addictive and fun. I can just get lost in hours of fun in this game and want to just learn more and more about it. The graphics are amazing and it is a good balance between extremely difficult, challenging, and easy to adapt to the game play. I absolutely love this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "3d modeled rimworld with less people.\r\nthis is a good game but could use a bit more to it still. still very fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't start playing this game unless you have time to spare because it will consume your life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This hasn't been the kind of game I've played before but it's been pretty fun.  I'd like to see the publisher expand the game with DLC or update it with new options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is basically \"the sims\" surviving on an alien planet. Well designed and addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Great resource management, just wish you could get more survivours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wouldn't buy it for full price, but it is a fun game if you like building. Its like the Sims except for surviving. Excellent full controller support that doesn't require a cursor, although controls take a bit getting used to. I like how it can be modded. I'm collecting all the dogs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, especially if you like basic survival games. Even better with the mods, people are super creative (i like to play with the firefly crew)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, some of it is tedious but that is the nature of a micromanage colony survival sim. It plays slow but there is plenty going on to make it not feel that way in the moment. But you can spend an hour on just 1-2 days of game when every decision matters (Insane difficulty)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Strategy game not too long and time consuming and still fun and very replayable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the most incontinent bunch of survivors ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It seemed a little slow going at first, but picked up as I learned more about the way things work. If only I could a dang flashlight or a carriable lantern. We have space-faring technology with space lasers, but apparently being able to create a flashlight or a lantern is outside of our technological capabilities. We can make gas lanterns that hang on a wall, though. Making them carriable is a step too far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good balance between building, research and fighting though the fighting can become a bit monotonous after awhile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Creatively relaxing fun game! Like you can build and design your outpost while learning new world to survive seasons in exotic environment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of strategic options and high replayability",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game on discount and I can't stop playing it. One of the best games I have ever played. Simple and complex at the same time. Only knock against it, I wish I could control the wave of enemies better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please allow pregnancy with all couples in the game. Please add more pipes to the game like calabash pipe and churchwooden pipe.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game. The gameplay is highly engaging, and I'm looking forward to more updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is similar to The Sims but with a survival, resource management, and combat twist. I've played through the game twice, 2.5 years between play-throughs, and I look forward to this game series being continued. It's truly an underrated game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but short",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good !!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun for a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for Steam Deck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "y",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A little like Rimworld, a little like tower defense. But why not. As other reviews have mentioned, the base game feels either unfinished or too short. Despite that, I still managed to get 50 hours of fun out of it without mods. There are at least three distinct playthroughs, thanks to the three different maps/biomes and three unique scenarios.\nWhat I highly recommend is visiting the workshop. Mods make this game significantly better. New food, equip, hygiene needs, more survivors... Even so it might start to feel repetitive after a few runs. \nSo if you thinking about buying, buy it in sale, but it is definitely worth trying.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "I've sunk a great deal of time into this game, and I'll say that I very much enjoy it. I legitimately don't get tired of building up new colonies, cranking up the difficulty, and seeing how I can weather various raids.\n\nMany lob the critique of it being \"3D RimWorld,\" and I think that is warranted. The game has much of the same UI as RimWorld, similar concepts, and similar mechanics, including periodic raids that scale in power. I do enjoy the added depth of the 3D space, and being able to build tall as you unlock additional technologies is a nice touch.\n\nHowever, there are parts of this game that strike me as half-baked, and I've listed some of them below:\n\n-There are remarkably few options for weapons and clothing, with late-game weapons being one that shoots far, one that shoots close, and one that stuns. The late game clothing could do with a bit more variety, perhaps with set bonuses that enhance certain abilities beyond just cold resistance and defense.\n\n-The characters move with agonizing slowness. Playing the game in real-time is a nightmare, as it takes between five and ten seconds for characters to do actions as simple as get out of bed or disengage from a task. Their movement speed is also horrendous, and they often end up slowly jogging to a distance objective, taking one whack at it, then running back to eat a meal. I recognize that the developers implemented the \"fast feet\" modifier that you can optionally implement, but doing something as simple as allowing settlers to stock meals in their inventory or just making them move faster at baseline would be big improvement.\n\n-The late game drags for all but the Robots and Guardians DLC. You will find yourself spending hours upon hours just waiting for an in-game event to pop, with little variation in interstitial events through the rather thin exploration mechanic.\n\n-Crafting of mid- and high-tier components, like electronics and AI cores, takes forever. There is one research that allows you to use 3D printers to manufacture some mid-tier components via 3D printers, and I think that should be standard for all playthroughs.\n\n-Certain quality of life improvements, like automating colonist actions during raids (such as setting battlestations that all colonists report to in the event of an attack) would make it less of a chore to fight back enemies and make it a legitimate test of your defenses. As it stands, it feels like herding cats to get everybody back to base without getting rocked by your colonists' own stupid pathing.\n\n-More variation in player skills. Some of the modded characters do a nice job of this, with significant and noted advantages for certain skillsets among chosen colonists. If somebody is going to be a designated crafter, make them crank through crafting projects in half the time of others with a corresponding debuff to balance it out.\n\n-Certain bugs still need fixing. As much as I love the ability to build vertically, this game is just not built to optimize that mechanic. You can't make a three-level stairwell without the game bugging out on you and making certain roof or wall segments impossible to build. The elevator would benefit from a setting where you can manually cap how many floors it goes up, as opposed to continuing upward infinitely (unless you move it over a tile, construct the ceiling and roof on the top floor, and then move it back).\n\nFor all of my noted problems, this game has great bones. I know Paradox recently purchased this game, and I sincerely hope they give it some love. Even straightforward (albeit significant) changes like quest variety and progression pacing would go a long way.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Rimworld-esque, but in 3D and with its own unique twist. It's enjoyable, though not as groundbreaking as Rimworld. Still, after spending countless hours in Rimworld, this serves as a refreshing and fun alternative.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I enjoyed that game, but now I'm ready for new stuff.  Come on Paradox, why did you bought the rights for this game ?  To let it rot?  DLC's no?  New chapter no ?  Some news on what you are planning, no?",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "If Rimworld, Kenshi and The Sims had a baby ........\r\n\r\nReally enjoyed my time in this game. The first year ingame time is a real challenge. addictive and immersive. My only real complaint is at a certain point (usually year 2 onwards) the challenge lessons and it becomes a bit of a chore. It gave me 50 good hours of entertainment though, so its a defo recommend from me",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I don’t think this game is abandoned — it’s finished! Maybe in the future this hidden gem will shine, but right now it’s not the next RimWorld. I mean, it has a community and some great mods, but it’s not on the Minecraft level of popularity.\n\nI think anyone who likes survival and management games will love this game. This game is like another flavor of the same recipe — and I don’t mean that everything is just like RimWorld but in 3D; it has its own charm! Saying that this game is just a RimWorld clone is like saying every game with crafting is a Minecraft clone.\n\nI don’t think the game is abandoned; I think it’s finished. Maybe it will shine in the future, but as with everything in capitalism, what dictates what happens next is money. This game wasn’t made by one passionate guy — it was made by a small passionate studio. Still, it’s a studio; everyone needs money to pay their bills.\n\nIf you like this genre — colony-sim, survival, sandbox — you’ll like this game. Give it a chance!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "There are two things that stop this game from being an 8.5/10; how often you have to tailor clothes and repair solar panels and wind turbines. I feel as though I am wasting so much time making clothes for the survivors because they wear out at an absurd rate. Add to this wind turbines and solar panels, which you need plenty of; they break down far too often resulting in a waste of time and resources. There should be an option to turn this wearing out off. For now, I give it a 7/10.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I love this game...although it is sad that the heart of it is to build an awesome space colony then abandon it so you can win LOL.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "so good, just watch out for winter, if your not prepared holy shit its punishing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stranded: Alien Dawn nails the mix of survival and strategy. Every decision feels important, and the changing weather and alien threats keep the tension high. It’s one of those games that pulls you in for “just one more day” and suddenly it’s 2 AM.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game, addictive and fun. I can just get lost in hours of fun in this game and want to just learn more and more about it. The graphics are amazing and it is a good balance between extremely difficult, challenging, and easy to adapt to the game play. I absolutely love this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Reminds me a bit of old school Sims. A little bit of a Base Builder, a little bit Resource Management. It can be a bit slow, especially mid game, and it can be a bit frustrating finding that balance between micromanaging and letting it auto run, but its good. I have fun. My best starting advice is to unlock a plant, any plant, first thing, so you can open up the farming grid and check for good soil. It helps you pick better camp placement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, colony sim with complication. think colony sim meets tower defense.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "3d modeled rimworld with less people.\r\nthis is a good game but could use a bit more to it still. still very fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't start playing this game unless you have time to spare because it will consume your life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This hasn't been the kind of game I've played before but it's been pretty fun.  I'd like to see the publisher expand the game with DLC or update it with new options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is basically \"the sims\" surviving on an alien planet. Well designed and addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Great resource management, just wish you could get more survivours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wouldn't buy it for full price, but it is a fun game if you like building. Its like the Sims except for surviving. Excellent full controller support that doesn't require a cursor, although controls take a bit getting used to. I like how it can be modded. I'm collecting all the dogs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, especially if you like basic survival games. Even better with the mods, people are super creative (i like to play with the firefly crew)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, some of it is tedious but that is the nature of a micromanage colony survival sim. It plays slow but there is plenty going on to make it not feel that way in the moment. But you can spend an hour on just 1-2 days of game when every decision matters (Insane difficulty)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Strategy game not too long and time consuming and still fun and very replayable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a wonderful time killer. Do I play on somewhat easier settings? I sure do. Do I enjoy the management aspect of it better than the combat? 100%. So if you want a chill survival game that let's you figure out how to survive on an alien planet, this is a good one. If you want an intense, base defense/survival simulator then I bet it's up your alley too. Finally, I really hope the new partnership announced in April puts some love into the game. There's a bunch more cool stuff that could be done and I hope it pays off!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "30-40h of content. The game is fine, with a bit more polish it could have been a great game but it's still good enough entertainment especially on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game because it looked cool but it sat in my library for a bit. If I had of known the developer I would have played it straight away. As soon as i saw the font from Surviving Mars I knew it was going to be great and it is. Many hours will be enjoyed with this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. The graphics awesome and the gameplay is fun. I want more locations and more flora and fauna and tech.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐ Stranded: Alien Dawn – Review (Recommended)\n\nPlaytime: ~60 hours\n\nVerdict: ★★★★☆ (8/10) – A beautiful, engaging colony-survival sim that’s easy to get into and rewarding to master.\n\nWhat it is:\nStranded: Alien Dawn puts you in charge of a small group of survivors stranded on an alien world. Your job: keep them alive, build a functioning colony, research new tech, and deal with whatever the planet throws at you — from alien wildlife to mental breakdowns.\n\nIt plays like a mix of RimWorld, Surviving Mars, and The Sims (but in space) — with detailed survivor management, base building, and survival priorities.\n\n👍 The Good\n\nSatisfying colony management: Clear task priorities, intuitive building, and lots of control over how your survivors spend their time.\n\nPersonalized survivors: Each character has unique traits, moods, and skills — they actually feel human, not just generic workers.\n\nBeautiful presentation: Great lighting, alien landscapes, and weather effects. Watching your base evolve from a few huts to a full-on colony is genuinely rewarding.\n\nFlexible difficulty: You can play chill, focus on building, or turn up the pressure with constant raids and extreme weather.\n\nReplayable: Different scenarios, biomes, and survivor combos keep things fresh for multiple runs.\n\n👎 The Not-So-Good\n\nShallow compared to RimWorld: Systems don’t interlock as deeply — fewer emergent stories and less mod support (for now).\n\nPacing dips mid-game: Once your base is stable, things can slow down a bit until new threats or goals appear.\n\nConsole/UI quirks: On controller, menus can be a little clunky; best experience is with mouse and keyboard.\n\n⚙️ Overall Thoughts\n\nStranded: Alien Dawn doesn’t reinvent the colony-sim wheel, but it polishes it to a nice shine. It’s approachable, gorgeous, and just deep enough to hook you for hours. Perfect for players who want the survival/management challenge without diving into the brutal complexity of RimWorld.\n\nRecommended for:\nFans of base-builders, survival management, or anyone who loves watching small stories emerge from everyday survival chaos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Many options, hunt, farm, explore, find survivors, develop tech.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far I am loving it, great idea, great game play, deep and immersive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game but  fell like the end game is really lacking. I am not sure what the answer is other than maybe adding way more free game scenarios.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically RimWorld — but someone turned off the cartoon filter and gave everyone realistic faces. You’re still babysitting a bunch of crash survivors who think building walls out of sticks is a good long-term plan, but now it looks beautiful while they panic.\r\n\r\nPros:\r\n\r\nBase-building and micromanagement that scratches that survival itch\r\n\r\nExpeditions that make you feel like you’re doing something productive while your base burns down\r\n\r\nMechs. My colonists drive mechs. That alone deserves a thumbs up.\r\n\r\nCons:\r\n\r\nEnemies? Yeah, it’s just angry wildlife. Every fight feels like “Jurassic Park: The Indie Game”\r\n\r\nNo organ harvesting, no drug empires — basically no RimWorld-level chaos\r\n\r\nZero factions, zero trading, and this planet must be the Bermuda Triangle of space because everyone crashes here but no one leaves\r\n\r\nI’d love DLC that adds human or alien factions — friendly ones to trade with, hostile ones to shoot at, and maybe a few who just want to sell me questionable substances. Give me raids, diplomacy, betrayal — I want drama!\r\n\r\nFor now, it’s a chill, polished, alien RimWorld-lite with mechs. And I can live with that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and addictive colony sim game. There is enough variety in maps, survivors and scenarios to warrant multiple replays. The only thing I feel is missing is a sandbox mode with more things to do around the map. Recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, super addictive, needs tons of work for some QOL issues, micromanagment is a glaring one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game. Found myself really caring about my survivors. Reminds me of State of Decay 2, in terms of being more zoomed in than you would be in a city builder. I like getting involved with just a handful of characters and helping them succeed. It's also got a splash of old Sims games, believe it or not. Building their house, seeing that their needs are met, watching them interact with each other. Except... also making sure they don't get eaten by alien bug monsters, ideally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game offers a lot more than what first meets the eye. The character development is fun, and building is both rewarding and entertaining. There are a couple different scenarios you can do and is very addictive for the perfectionists out there. The only thing that would make me like this game more is offering even more playable characters and to add some more researchable content in the game/ come out with a DLC, perhaps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Engaging and fun. Plus it's not full of buggy bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lovely game, especially if you like the idea of rimworld with more details.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really fun game. Came from Rimworld and am able to just play without worrying sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really fun, challenging and made for those that can take failing on the chin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like Kenshi but without the trauma, with more modern vibes that also reminded me of State of Decay 2.   AI companions are so much better about gathering stone than your friends in Ark, Rust or Conan, and no annoying thirst stat to manage, that's fair.   \r\n\r\nVery good, smooth, runs well.  I've had some annoyances with getting the right internal level of the structure to appear as my base got a little bigger but it might be a skill issue, well see.  \r\n\r\nVery worth the sale price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the most incontinent bunch of survivors ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It seemed a little slow going at first, but picked up as I learned more about the way things work. If only I could a dang flashlight or a carriable lantern. We have space-faring technology with space lasers, but apparently being able to create a flashlight or a lantern is outside of our technological capabilities. We can make gas lanterns that hang on a wall, though. Making them carriable is a step too far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good balance between building, research and fighting though the fighting can become a bit monotonous after awhile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Space rebels with a rogue A.I crash land and try not too die...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Interesting game but mods make it Much, Much Better!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I REEEEEEEEEEALLLY wanna give this a down vote. but idk... im conflicted.\n\nI was having fun at first, but now that i kinda have an idea of what im supposed to be doing, i restarted the scenario with a new team and a new seed, just for variety... and now it feels SO SLOW. Like, i'm progressing further and faster than on my first play thru, but also, i can see the path i want to be taking, and the survivors are just so fucking slow at everything. 12hrs to do this 18 to do that, and im like \"JUST REPAIR THE FUCKING WORKBENCH You have 50 Electronics To make because your power grid is SHIT\"\n\nBut for all that frustration of the TEDIUM ...i still want to play it. i still log in, i still push forward despite the process like watching a snail run a marathon.\n\nEdit after 50hrs played (wrote review after like 15)\n\nThis game definitely helps me work on my patience. the slow grindy tedium of it all is pretty much the only thing i have against it... but i think thats more a genre thing than this game specifically.\n\nis it still maddening?? yes! Is it still fun? Obviously, as i have played like 4X times longer.\n\nSo far i completed teh Crash Landing and the Trade Colony scenarios, Trade Colony felt a bit easier and less stressful, not sure if it was the seed or the scenario or the new region, but it felt less full of aggressive alien attacks, which helped me not have to repair everything all the time (tho stuff went malfunctioning a LOT, so maybe that was a trade off idk)\n\nAnyway... its a good game, I defintely was right to give it a thumbs up... even if it makes me wanna tear out my already thinning hair sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Started limping, goes great with time (thanks to modders tho)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "most fun game ever lots of mods to make the game more fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Creatively relaxing fun game! Like you can build and design your outpost while learning new world to survive seasons in exotic environment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of strategic options and high replayability",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game on discount and I can't stop playing it. One of the best games I have ever played. Simple and complex at the same time. Only knock against it, I wish I could control the wave of enemies better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please allow pregnancy with all couples in the game. Please add more pipes to the game like calabash pipe and churchwooden pipe.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game. The gameplay is highly engaging, and I'm looking forward to more updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is similar to The Sims but with a survival, resource management, and combat twist. I've played through the game twice, 2.5 years between play-throughs, and I look forward to this game series being continued. It's truly an underrated game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is awesome doesn't look like it'll keep getting updated but still real good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fan of the game.have won every game type. enjoyable game\r\n\r\nwould like there to be some better late game challenges as once your established as long as you are somewhat mindful its pretty hard to lose. ceases to be challenging",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, but short",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good !!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun for a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "y",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A little like Rimworld, a little like tower defense. But why not. As other reviews have mentioned, the base game feels either unfinished or too short. Despite that, I still managed to get 50 hours of fun out of it without mods. There are at least three distinct playthroughs, thanks to the three different maps/biomes and three unique scenarios.\nWhat I highly recommend is visiting the workshop. Mods make this game significantly better. New food, equip, hygiene needs, more survivors... Even so it might start to feel repetitive after a few runs. \nSo if you thinking about buying, buy it in sale, but it is definitely worth trying.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "I've sunk a great deal of time into this game, and I'll say that I very much enjoy it. I legitimately don't get tired of building up new colonies, cranking up the difficulty, and seeing how I can weather various raids.\n\nMany lob the critique of it being \"3D RimWorld,\" and I think that is warranted. The game has much of the same UI as RimWorld, similar concepts, and similar mechanics, including periodic raids that scale in power. I do enjoy the added depth of the 3D space, and being able to build tall as you unlock additional technologies is a nice touch.\n\nHowever, there are parts of this game that strike me as half-baked, and I've listed some of them below:\n\n-There are remarkably few options for weapons and clothing, with late-game weapons being one that shoots far, one that shoots close, and one that stuns. The late game clothing could do with a bit more variety, perhaps with set bonuses that enhance certain abilities beyond just cold resistance and defense.\n\n-The characters move with agonizing slowness. Playing the game in real-time is a nightmare, as it takes between five and ten seconds for characters to do actions as simple as get out of bed or disengage from a task. Their movement speed is also horrendous, and they often end up slowly jogging to a distance objective, taking one whack at it, then running back to eat a meal. I recognize that the developers implemented the \"fast feet\" modifier that you can optionally implement, but doing something as simple as allowing settlers to stock meals in their inventory or just making them move faster at baseline would be big improvement.\n\n-The late game drags for all but the Robots and Guardians DLC. You will find yourself spending hours upon hours just waiting for an in-game event to pop, with little variation in interstitial events through the rather thin exploration mechanic.\n\n-Crafting of mid- and high-tier components, like electronics and AI cores, takes forever. There is one research that allows you to use 3D printers to manufacture some mid-tier components via 3D printers, and I think that should be standard for all playthroughs.\n\n-Certain quality of life improvements, like automating colonist actions during raids (such as setting battlestations that all colonists report to in the event of an attack) would make it less of a chore to fight back enemies and make it a legitimate test of your defenses. As it stands, it feels like herding cats to get everybody back to base without getting rocked by your colonists' own stupid pathing.\n\n-More variation in player skills. Some of the modded characters do a nice job of this, with significant and noted advantages for certain skillsets among chosen colonists. If somebody is going to be a designated crafter, make them crank through crafting projects in half the time of others with a corresponding debuff to balance it out.\n\n-Certain bugs still need fixing. As much as I love the ability to build vertically, this game is just not built to optimize that mechanic. You can't make a three-level stairwell without the game bugging out on you and making certain roof or wall segments impossible to build. The elevator would benefit from a setting where you can manually cap how many floors it goes up, as opposed to continuing upward infinitely (unless you move it over a tile, construct the ceiling and roof on the top floor, and then move it back).\n\nFor all of my noted problems, this game has great bones. I know Paradox recently purchased this game, and I sincerely hope they give it some love. Even straightforward (albeit significant) changes like quest variety and progression pacing would go a long way.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Rimworld-esque, but in 3D and with its own unique twist. It's enjoyable, though not as groundbreaking as Rimworld. Still, after spending countless hours in Rimworld, this serves as a refreshing and fun alternative.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I enjoyed that game, but now I'm ready for new stuff.  Come on Paradox, why did you bought the rights for this game ?  To let it rot?  DLC's no?  New chapter no ?  Some news on what you are planning, no?",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "If Rimworld, Kenshi and The Sims had a baby ........\r\n\r\nReally enjoyed my time in this game. The first year ingame time is a real challenge. addictive and immersive. My only real complaint is at a certain point (usually year 2 onwards) the challenge lessons and it becomes a bit of a chore. It gave me 50 good hours of entertainment though, so its a defo recommend from me",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I don’t think this game is abandoned — it’s finished! Maybe in the future this hidden gem will shine, but right now it’s not the next RimWorld. I mean, it has a community and some great mods, but it’s not on the Minecraft level of popularity.\n\nI think anyone who likes survival and management games will love this game. This game is like another flavor of the same recipe — and I don’t mean that everything is just like RimWorld but in 3D; it has its own charm! Saying that this game is just a RimWorld clone is like saying every game with crafting is a Minecraft clone.\n\nI don’t think the game is abandoned; I think it’s finished. Maybe it will shine in the future, but as with everything in capitalism, what dictates what happens next is money. This game wasn’t made by one passionate guy — it was made by a small passionate studio. Still, it’s a studio; everyone needs money to pay their bills.\n\nIf you like this genre — colony-sim, survival, sandbox — you’ll like this game. Give it a chance!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "There are two things that stop this game from being an 8.5/10; how often you have to tailor clothes and repair solar panels and wind turbines. I feel as though I am wasting so much time making clothes for the survivors because they wear out at an absurd rate. Add to this wind turbines and solar panels, which you need plenty of; they break down far too often resulting in a waste of time and resources. There should be an option to turn this wearing out off. For now, I give it a 7/10.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I love this game...although it is sad that the heart of it is to build an awesome space colony then abandon it so you can win LOL.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "so good, just watch out for winter, if your not prepared holy shit its punishing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stranded: Alien Dawn nails the mix of survival and strategy. Every decision feels important, and the changing weather and alien threats keep the tension high. It’s one of those games that pulls you in for “just one more day” and suddenly it’s 2 AM.",
      "voted_up": true,
      "votes_helpful": 3
    }
  ],
  "negative": [
    {
      "review": "This is... this is Rimworld. I don't mean \"this reminds me of Rimworld\" or \"this is a similar sort of experience to Rimworld\", it's the same game with nicer graphics and some features left off. It feels weird to give a thumbs down to a game I've put over 100 hours into, but my honest review is \"Go play Rimworld instead.\" If you love that game, you sadly won't find anything new here. If you've never played it, you're better off experiencing the original.\nI guess if Rimworld's low-fi graphics were bugging you, or maybe you thought its gameplay was a bit too detailed, this game is probably for you. For my money, I find myself missing a number of Rimworld's features and in-depth management, and my NES-era brain stopped being impressed by shiny graphics upgrades a long time ago.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Very odd game. You want to like the game and certain aspects are enjoyable, but there are too many flaws in the game to really be able to play it for long. Sometimes you try to get something done but nobody will do anything and when they do, takes forever to accomplish a simple task. Plus you have to research heavily, even the most minor things. These issues only get worse as you progress. It has a lot of good ideas but none of it has been implemented well, and there are a few bugs and quirks that add to the frustration.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I Never played Rimworld and only realized it was a thing after getting this, either way I went into this enjoying the idea and was enjoying the game itself. Until I realized just how little there really was, I bought this full price just around if not on launch day.\n\nI'm someone who gets into one of these games and will blow half a day on it without realizing, that's what I want sometimes but I couldn't satisfyingly get that with this. I tend to play games like this and put nearly triple digits into a single save/world. I made 3/4 worlds in under 100hr, one I had to remake cause it was broken by an early mod(Which Mods 110% saved this game.) This could play for a bit then walk away and that was how I extended it before falling off. On the plus it looks pretty good with a kinda realistic but still stylized look, animations smooth and at times I did just sit and watch everyone going around. Expect to micromanage to some extent, that's what these are, at some point there is some autonomy set and then its' building up to focus on defense for bug raids. I think the end game is to leave the planet but I never got to that point.... and It might have actually been a mod.\n It's not BAD but it really REALLY needs more into it. More creatures, more items, more devices, CUSTOM SURVIVOR maker. Like JFC I stopped playing for a while to wait until there were more mods cause this honestly feel like an early access game with more to come. You have a perk for \"Slept beside beloved\" yet double beds are a MOD?? Three kinds of dogs and maybe six creatures? There is a mech made much later but no other vehicles, four building material steps,(If I recall right) At best if they come back they will nickle and dime with DLC, when it really should be giving a couple of much needed free updates before that happens if they don't wanna spit in early customers faces. But they are under Paradox now and already DLC happy(Tropico)\nAt this point I say don't bother unless on sale and/or you see enough mods you'd like to use cause it seems like modders added more to the game than the devs who instead abandoned this game, went to another much worse publisher and then instead worked to \"relaunch\" a near identical concept game.(And seemed to fail at it too boot.)\n\nTl;Dr It's an okay game, Definitely enjoy it in short bursts, it just seems like it really needs more. Modders took over while the devs abandoned it for another exact concept game to relive it's glory.\nAnd yea, apparently it's basically 3D Rimworld.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Got no fun fuzzy feeling, seemed clunky and repetitive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super buggy and laggy for some reason.   unable to play in my set up.   had high hopes for this game, oh well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just too much of micromanagement and trying to persuade people to do certain things. It starts great but as game scales it becomes too tedious and player must somehow persuade those people to do certain things in exact order. It sucks all the joy as people become stupid and unable to do basic things. Assigned priorities are great, until game scales when they become meaningless.\r\n\r\nFor Linux players: if game crashes, try to turn off reflections, it can help.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its a simple game. You spend most of your time doing busy work. Especially one survivor is stuck cooking. The others are doing research and harvesting. Slow moving with very little fun factor. The schedule interface doesn't seem to work well. You still have to micro manage to keep survivors efficient and prevent them for burning out. So far has failed my expectations. Going Medieval does a much better job in controlling the players via schedule/activities tab/interface.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I initially bought it because it was essentially a 3D Rimworld clone. \nI thought copying so much of the core gameplay was a smart move at the beginning, you are instantly familiar with the UI which lowers the entry barrier.\nThis obviously raises the question of their own creative output being a copycat in many aspects and therein lies the ironic fate of the copycat.. The developers never had a long-term vision to establish their own identity or add meaningful innovations that would justify choosing this over the original.\n\nEvery time I played, I found myself asking \"why am I not just playing Rimworld instead?\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very clunky and the longer you play the less fun you have",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Paradox is a scumbag company! I am digitally burning everything i own that is paradox.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "made me want to play rimworld, a game better in almost every way.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I used to like this game, but ever since Paradox bought it, it's been crashing after a few minutes of play time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG based; can ruin a run if the wrong events happen.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not terrible, but it's not good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a really toned down version of Rimworld.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring. Waiting simulator",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gudn't",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played through twice with years apart and here is my final and sad verdict.\nCopying Rimworld is not a problem, I loved to see the 3d version with elevation and with a different touch.\n\n2 CRIPPLING problems make it a BAD game and makes you a worse game studio: \n 1. NO FIXES OR IMPROVEMENTS of the game, just functional upgrades, engine, graphic fixes and expansion bullsh1ts. \nYou had +2 years to make sense of the exploration map - it is lifeless garbage - same repeating runs with uninteresting text.\nYou had +2 years to make the bug spawns not unnatural garbage spawning 500 bugs 10 meters from the base. glitching into a ball in the middle\nYou had +2 years to make a story for the scenarios other than 3 (!) sentences - the closing is even more diappointing once you finish - some lifeless recap and out - no story closing \nNONE OF THESE ARE LONG DEV TASKS -- I EVEN I CAN DO IT IN A WEEK \n \n2. You forgot to copy the part what makes Rimworld work - You game is just a complex tower defense sim with sh1tty enemies\n- There are no new characters coming to your base - no humans attacking or joining you whatsoever!!!\n- You don't have crazy morally gray decisions to make on replacing limbs or organs as needed/ hibernating to avoid death \n- Relationships don't matter whatsoever - humans don't react to smaller things - you just loose your sense for it after a few hours \n- There is no base expansion where you move to other places - you can't give up a location if it gets breached - every fight is all or nothing and you better win flawlessly or your progression is lost. \n\nParadox buyout is quite fitting because they love to do this with their titles so I'm sure you will be great friends. You can plan the next DLC laughing while you base game is crap.",
      "voted_up": false,
      "votes_helpful": 209
    },
    {
      "review": "Unfortunately this is one of those games that feels unfinished. With a little polish, a little extra effort, this could have been fantastic. As it is, it feels bare bones and, like many colony sims, quickly devolves in a lot of micro management. It desperately lacks any depth or width. There are the bare bones of a story, there is a tech tree, there are things to do, but it all becomes a big hassle. With some trial and error, surviving the first winter, when there is no easily accessible food except for animals, becomes easy. All you need is a fridge, or, preferably, a freezer. Because all vegetables, fruits, and the like, spoil if not stored properly. Fair enough. But manure ALSO spoils and you need manure to fertilize the fields. Especially if there are crops which you desperately need, so want to grow quickly. But there are too many tasks, and you have so few people available, so gathering manure and storing it (in a freezer no less!) falls by the wayside. So then you are inundated with messages that your manure is spoling/has spoiled. Annoyances like that take up way too much of the game. The native species randomly spawn attacks that are relatively easily fended off, at least at the lower difficulty level, even with handweapons. But those same critters can destroy even concrete walls if left unattended for too long, for instance because they're out of line-of-sight while your people are fighting off the rest of the attack. So what's the point of spending a huge amount of time and effort in making concrete? Most of the 'story' consists of simple 'click one option out of 2/4 and lead to very little in reward. In the 'crashlanded' scenario, the cause of the crash is never addressed, aside from some rumours about it. A wasted opportunity. None of the conversations, even those that are only a few lines, are voiced, making them even less immersive. That you have to research in the 'crashlanded' scenario, makes some sense, that you need to do the same in the 'outpost' scenario, a lot less so, nor does it appear to be addressed even by a line, like, circumstances are different from what we thought, we need to adapt. In addition, the tech tree is randomly truncated, with random inspirations driving further research, but some options available in one playthrough but not others (being able to 3D-print electronic circuits would have been expected in the outpost scenario, but over 2 years in, I didn't see it. You can build defensive turrets, but since attacks can be countered by putting your crew on alert, and because it appeared the turrets wouldn't be able to fire over walls and have only about the same range as the personal firearms of the crew, I didn't even bother to waste resources on that. Whenever you build something, it almost immediately breaks down anyway and then requires precious resources to repair. Tending animals seems to be a waste of time, other than having a ready supply of manure to be ignored. You can easily just hunt any animals nearby, without having to waste time and resources to feed them. Twice I had issues feeding my animals. In one playthrough, there was plenty of the right kind of food sitting in a through, but one dog inexplicably hungry. Since that was the first time I had any animals, I neglected to feed it manually. Big mistake. It ended up going berserk with hunger, despite the aforementioned through being used by the second dog and that one having no issues whatsoever, which misled me to think the problem with the first dog would resolve itself naturally. So it goes berserk, and chases and attacks one of my people, which then suffers broken bones and so on. I hesitated to shoot the poor animal, hoping my crewmate would survive, which they did, but reading over the injury list made me feel very conflicted. Meanwhile, the dog had switched targets for no apparent reason after chasing my crewmate into a house and ended up attacking a large native creature. I thought it died doing that, but later on it was still there and no eating properly out of the very same through. Needless to say I didn't bother with dogs after that, which didn't really feel like they added anything anyway, and immediately intervened if for some reason an animal wasn't eating properly. I think the issue is with the accessability of the food, there needing to be some extra free space. But things like that pop up all over. There are no bugs, but everything takes just a bit too much work and quickly becomes repetitive and annoying. One of my crewmates fixes three light fixtures in a row, is done, another one breaks down. One crewmate almost finishes a harvest and then just goes home, leaving the harvested material to rot and the unharvested part of the field to go to waste, with no replanting, while fertilizing appears to happen randomly, perhaps because the field doesn't grow evenly, so some of the field remains unplanted and then it is IMPOSSIBLE to fertilize the other plants for some reason. Crewmates also move randomly between jobs, like they build part of a wall, then don't continue with the next part of that wall, even though the resources have been delivered, no, instead they move back into the house to lay down some carpet, which was a job that took years in one playthrough because there wasn't a steady supply of the material. I never even had a particularly large base IMHO, but there quickly appear to be too many jobs for too few people that take too much time. Having to micromanage all that isn't my idea of fun. If the game did some of that work, by identifying bottlenecks and giving those the needed priority, that'd be much more convenient. Finally, there doesn't really appear to be much of an endgame. In the 'crashlanded' scenario I constructed the radios and was able to get one (1) crewmember off at a time. That felt wrong, leaving behind a dwindling crew to fend off the incessant alien attacks and inevitable breakdowns. As for the 'outpost' scenario, I imagine there'd never be an end, you can't leave the outpost behind, unattended, it'll just get overrun. There's no way to build a base that'll take care of itself. So, what's the point of it all? But so much is already in place, with just a little more attention and TLC this could have been a great game. All the basic elements are there. If you do like these sort of games, you may still get some enjoyment out of it, but I do recommend getting it at a discount.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "This is... this is Rimworld. I don't mean \"this reminds me of Rimworld\" or \"this is a similar sort of experience to Rimworld\", it's the same game with nicer graphics and some features left off. It feels weird to give a thumbs down to a game I've put over 100 hours into, but my honest review is \"Go play Rimworld instead.\" If you love that game, you sadly won't find anything new here. If you've never played it, you're better off experiencing the original.\nI guess if Rimworld's low-fi graphics were bugging you, or maybe you thought its gameplay was a bit too detailed, this game is probably for you. For my money, I find myself missing a number of Rimworld's features and in-depth management, and my NES-era brain stopped being impressed by shiny graphics upgrades a long time ago.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "It's a Rimworld in 3D but...... it way too shallow than Rimworld.\r\nI tried to play for 4 restart but everytime it ending with nothing to do and not challanging at all. \r\nI should buy rimworld DLC than this game.... sigh",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Bought the game, great experience, but we got forgoten by the devs, they let the game die",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "It's obviously trying to be RimWorld in 3D, but - in a strange twist - it lacks all the depth of the game that inspired it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Very odd game. You want to like the game and certain aspects are enjoyable, but there are too many flaws in the game to really be able to play it for long. Sometimes you try to get something done but nobody will do anything and when they do, takes forever to accomplish a simple task. Plus you have to research heavily, even the most minor things. These issues only get worse as you progress. It has a lot of good ideas but none of it has been implemented well, and there are a few bugs and quirks that add to the frustration.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Everything takes forever to do, you're always in need of a bunch of stuff, and for some reason increasingly-dangerous giant swarms of insects attack your base for no reason. It's like they don't really want you to progress, just wait to die. The basic concept is there, it's just that you need electronics for everything, that all keeps breaking and requires electronics to fix, so you can just never get ahead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I Never played Rimworld and only realized it was a thing after getting this, either way I went into this enjoying the idea and was enjoying the game itself. Until I realized just how little there really was, I bought this full price just around if not on launch day.\n\nI'm someone who gets into one of these games and will blow half a day on it without realizing, that's what I want sometimes but I couldn't satisfyingly get that with this. I tend to play games like this and put nearly triple digits into a single save/world. I made 3/4 worlds in under 100hr, one I had to remake cause it was broken by an early mod(Which Mods 110% saved this game.) This could play for a bit then walk away and that was how I extended it before falling off. On the plus it looks pretty good with a kinda realistic but still stylized look, animations smooth and at times I did just sit and watch everyone going around. Expect to micromanage to some extent, that's what these are, at some point there is some autonomy set and then its' building up to focus on defense for bug raids. I think the end game is to leave the planet but I never got to that point.... and It might have actually been a mod.\n It's not BAD but it really REALLY needs more into it. More creatures, more items, more devices, CUSTOM SURVIVOR maker. Like JFC I stopped playing for a while to wait until there were more mods cause this honestly feel like an early access game with more to come. You have a perk for \"Slept beside beloved\" yet double beds are a MOD?? Three kinds of dogs and maybe six creatures? There is a mech made much later but no other vehicles, four building material steps,(If I recall right) At best if they come back they will nickle and dime with DLC, when it really should be giving a couple of much needed free updates before that happens if they don't wanna spit in early customers faces. But they are under Paradox now and already DLC happy(Tropico)\nAt this point I say don't bother unless on sale and/or you see enough mods you'd like to use cause it seems like modders added more to the game than the devs who instead abandoned this game, went to another much worse publisher and then instead worked to \"relaunch\" a near identical concept game.(And seemed to fail at it too boot.)\n\nTl;Dr It's an okay game, Definitely enjoy it in short bursts, it just seems like it really needs more. Modders took over while the devs abandoned it for another exact concept game to relive it's glory.\nAnd yea, apparently it's basically 3D Rimworld.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Other's have said similar but I had to give it a try on sale.  It's like they added 3d building and better looking characters but subtracted a lot. It just makes me want to play Rimworld again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just play Rimworld. It's more realistic and the people actually function properly.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really expected something different from this game.  Typical low effort city builder game with the same engine as dozens of other games, with a few alienish skins.  I'm glad I got it on sale but I still feel like I was ripped off.  I would pay maybe 1 dollar for this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is nothing more than a frustrating pain in the ass micro management hell hole. Its not fun at all, its just annoying as ##.  Resource trees are not clearly explained, ppl die with little to no indication as to clearly why, its just painful, its not fun, it just rage worthy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "ffs will we suffer the (seemingly contradictory qualities) launcher, and the (seemingly contradictory qualities) data miner for this game now too? jeebus wept. another title goes on the trash heap of games i won't play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sadly, an unfinished game. It felt fun, and like it had potential but it really falls flat in the end.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Unfinished game lacking common sense for your colonists, as even a simple thing like warming up instead of dieing of hypothermia is too much for them, have fun micromanageing minial tasks because your colonists cant sustain themselfes independently.\nid rather go play other game with similar style.\nand 35€ for this? unbelivable, the 4€ i payed for a key on a key vendor site where acceptable, but pff, steam priceing? Go buy something else, this is not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Got no fun fuzzy feeling, seemed clunky and repetitive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super buggy and laggy for some reason.   unable to play in my set up.   had high hopes for this game, oh well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sandbox mode feels ridiculously empty. The only thing that happens there is another pack of bugs coming at you—that’s it. The economy is simple, research is simple, and long-distance travel is simple.\n\nI compare the experience to RimWorld, and this game generates nothing but the hope that it will improve at some point in the future—only to never live up to expectations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In the genre it feels uninspired, it's a game for sure, it plays fine (except crashing on Linux), but it doesn't do anything particularly well.\r\n\r\nThe combat is uninspired and clunky. The research is just the same as other games. The unique mechanic of observation is almost pointless. Some of the AI choices are great (like haul after harvest), but in general AI is as brain dead as is typical in these games (start a long path at 22h and exhaust on the trip).\r\n\r\nThe biggest problem with being so uninspired is that I'd rather do another Rimworld run over this. 3D is a gimmick, it's well done but it just doesn't affect the game play.\r\n\r\nI have zero desire to up the up the difficulty (to contrast 500% on Rimworld is a challenge) primary problem here is the clunkiness of the combat and weapon progression being atrocious. Having to fight hordes (even if small hordes) of bugs all the time is just tiresome.\r\n\r\nThere is some positives with the mechanics, and the game in general works very well. I just think the mechanics are half baked and there is zero unique factor (outside of the 3D gimmick) over vanilla Rimworld.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just too much of micromanagement and trying to persuade people to do certain things. It starts great but as game scales it becomes too tedious and player must somehow persuade those people to do certain things in exact order. It sucks all the joy as people become stupid and unable to do basic things. Assigned priorities are great, until game scales when they become meaningless.\r\n\r\nFor Linux players: if game crashes, try to turn off reflections, it can help.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think I got this for free, but it wasnt worth it. its like a worse version of rimworld. most mechanics are just copied straight from other similar games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a chore.  The AI isn't even smart enough to close windows when it's cold, or change into warmer clothes, or turn off lights.  You have to order your \"settlers\" to do EVERYTHING.  The QOL in this game is absolutely abysmal.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Made it an hour through several tutorials, crashed 3 times starting New Games. Unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to like this game, but ever since Paradox bought it, it's been crashing after a few minutes of play time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game constantly freezes the OS so that I have to manually reboot the PC. I verified, updated, yadda yadda but it still happens. Refund requested.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NOT RECOMMENDED if you are looking for a survivial crafter with depth and detail. \r\nOr for a survivial sim. Or for anything that the game description states prominently on the store page.\r\n\r\nInstead, what you get is a rather uninspired tower defense game, with crafting, survivial, sim, and everything else taking a very far back seat.\r\n\r\nAnimal attacks happen near-regularly on a timer. Each subsequent attack is by a larger group than the previous one. The more provisions you have stored, the even larger the group will be.  Also, the more defenses you have constructed, the larger the attack group seems to be.\r\nThis can go from initially a dozen animals to several hundreds quite quickly. \r\nTheir pathfinding is VERY primitive, so you have to funnel them through a narrow and long constructed defensive path. \r\nAnd that's all the finesse there is to it - no further tactical or strategic elements, at all.\r\n\r\nI severely dislike tower defense of this type, so I reduced this gameplay element via a mod and by dropping to the lowest difficulty level.\r\nAnd the remaining game was still uninspired, disappointing and annoying.\r\n\r\nThere are several undocumented and unclear mechanisms, and there are missable resources due to issue with the random map generation. Either alone will cause failure in the first or second game year. \r\nYou will have to restart from scratch several times over - or read detailed guides in advance that spoil everything.\r\nSome of these gameplay elements you can avoid if you know about them (e.g.: after a restart from scratch).\r\nOthers will force you to micro-manage around them very tediously, due to there being no way to make the survivors behave properly to avoid/neutralize them. Again, no finesse, at all.\r\n\r\nNow, with both all those lessons learned, as well as with the tower defense element reduced via mods - the game is STILL uninspired!\r\nYou are locked into a mostly fixed path, entirely governed by how slow clothes tailoring, crafting and buildig construction is timed versus clothes and equipment wear&tear. Also, by how slow technology resesarch is.\r\n\r\nThere are no engaging discovery elements in this game - no incentive to explore the map (more the opposite), no technology or other surprises/discoveries/alternate paths.\r\n\r\nIn the end, this is a tedious slog - not an enjoyable game.\r\n\r\nWhich is a shame, as there is an incredible amount of detail in the game (excellent sim) - but it all gets buried and killed by the overwhemling mechanisms mentioned above - even if you reduce some of them via mods.\r\n\r\nNOT RECOMMENDED, not even at a discount.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a simple game. You spend most of your time doing busy work. Especially one survivor is stuck cooking. The others are doing research and harvesting. Slow moving with very little fun factor. The schedule interface doesn't seem to work well. You still have to micro manage to keep survivors efficient and prevent them for burning out. So far has failed my expectations. Going Medieval does a much better job in controlling the players via schedule/activities tab/interface.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Abandonedware? Bought by Paradox, then no updates. Not really robust at this stage. Would review after update...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I initially bought it because it was essentially a 3D Rimworld clone. \nI thought copying so much of the core gameplay was a smart move at the beginning, you are instantly familiar with the UI which lowers the entry barrier.\nThis obviously raises the question of their own creative output being a copycat in many aspects and therein lies the ironic fate of the copycat.. The developers never had a long-term vision to establish their own identity or add meaningful innovations that would justify choosing this over the original.\n\nEvery time I played, I found myself asking \"why am I not just playing Rimworld instead?\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "отличная задумка, приемлимая реализация(можно было лучше, но все остальное подобное гораздо хуже), но рукожопые разработчики сделали так, что редактор модов не запускается, а я только из-за этого купил игру. поддержки от разработчика и издателя никакой. вообще никакой, абсолютный нуль. так что советовать к покупке не могу",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very clunky and the longer you play the less fun you have",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "steam if forcing me to see this message when i click on this game, so i am just randomly posting garbage! fart fart fart, stank bubble ginger beard",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Paradox is a scumbag company! I am digitally burning everything i own that is paradox.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just play Rimworld. Tis game brings nothing new nor is it exiciting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "made me want to play rimworld, a game better in almost every way.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you are looking for a game like Rimworld, just play Rimworld.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Alas, the game is unstable on Linux.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "RNG based; can ruin a run if the wrong events happen.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "too much to do for 4 npcs  you end up scrabiling all the time  4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's not terrible, but it's not good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the worst performance in a game i have ever seen. 20 FPS 7900xtx 7800x3d",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "SO FAR REALLY DISAPOINTED.  CONTROLING THE CHARATERS IS NTO EASY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a really toned down version of Rimworld.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring. Waiting simulator",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gudn't",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played through twice with years apart and here is my final and sad verdict.\nCopying Rimworld is not a problem, I loved to see the 3d version with elevation and with a different touch.\n\n2 CRIPPLING problems make it a BAD game and makes you a worse game studio: \n 1. NO FIXES OR IMPROVEMENTS of the game, just functional upgrades, engine, graphic fixes and expansion bullsh1ts. \nYou had +2 years to make sense of the exploration map - it is lifeless garbage - same repeating runs with uninteresting text.\nYou had +2 years to make the bug spawns not unnatural garbage spawning 500 bugs 10 meters from the base. glitching into a ball in the middle\nYou had +2 years to make a story for the scenarios other than 3 (!) sentences - the closing is even more diappointing once you finish - some lifeless recap and out - no story closing \nNONE OF THESE ARE LONG DEV TASKS -- I EVEN I CAN DO IT IN A WEEK \n \n2. You forgot to copy the part what makes Rimworld work - You game is just a complex tower defense sim with sh1tty enemies\n- There are no new characters coming to your base - no humans attacking or joining you whatsoever!!!\n- You don't have crazy morally gray decisions to make on replacing limbs or organs as needed/ hibernating to avoid death \n- Relationships don't matter whatsoever - humans don't react to smaller things - you just loose your sense for it after a few hours \n- There is no base expansion where you move to other places - you can't give up a location if it gets breached - every fight is all or nothing and you better win flawlessly or your progression is lost. \n\nParadox buyout is quite fitting because they love to do this with their titles so I'm sure you will be great friends. You can plan the next DLC laughing while you base game is crap.",
      "voted_up": false,
      "votes_helpful": 209
    },
    {
      "review": "Unfortunately this is one of those games that feels unfinished. With a little polish, a little extra effort, this could have been fantastic. As it is, it feels bare bones and, like many colony sims, quickly devolves in a lot of micro management. It desperately lacks any depth or width. There are the bare bones of a story, there is a tech tree, there are things to do, but it all becomes a big hassle. With some trial and error, surviving the first winter, when there is no easily accessible food except for animals, becomes easy. All you need is a fridge, or, preferably, a freezer. Because all vegetables, fruits, and the like, spoil if not stored properly. Fair enough. But manure ALSO spoils and you need manure to fertilize the fields. Especially if there are crops which you desperately need, so want to grow quickly. But there are too many tasks, and you have so few people available, so gathering manure and storing it (in a freezer no less!) falls by the wayside. So then you are inundated with messages that your manure is spoling/has spoiled. Annoyances like that take up way too much of the game. The native species randomly spawn attacks that are relatively easily fended off, at least at the lower difficulty level, even with handweapons. But those same critters can destroy even concrete walls if left unattended for too long, for instance because they're out of line-of-sight while your people are fighting off the rest of the attack. So what's the point of spending a huge amount of time and effort in making concrete? Most of the 'story' consists of simple 'click one option out of 2/4 and lead to very little in reward. In the 'crashlanded' scenario, the cause of the crash is never addressed, aside from some rumours about it. A wasted opportunity. None of the conversations, even those that are only a few lines, are voiced, making them even less immersive. That you have to research in the 'crashlanded' scenario, makes some sense, that you need to do the same in the 'outpost' scenario, a lot less so, nor does it appear to be addressed even by a line, like, circumstances are different from what we thought, we need to adapt. In addition, the tech tree is randomly truncated, with random inspirations driving further research, but some options available in one playthrough but not others (being able to 3D-print electronic circuits would have been expected in the outpost scenario, but over 2 years in, I didn't see it. You can build defensive turrets, but since attacks can be countered by putting your crew on alert, and because it appeared the turrets wouldn't be able to fire over walls and have only about the same range as the personal firearms of the crew, I didn't even bother to waste resources on that. Whenever you build something, it almost immediately breaks down anyway and then requires precious resources to repair. Tending animals seems to be a waste of time, other than having a ready supply of manure to be ignored. You can easily just hunt any animals nearby, without having to waste time and resources to feed them. Twice I had issues feeding my animals. In one playthrough, there was plenty of the right kind of food sitting in a through, but one dog inexplicably hungry. Since that was the first time I had any animals, I neglected to feed it manually. Big mistake. It ended up going berserk with hunger, despite the aforementioned through being used by the second dog and that one having no issues whatsoever, which misled me to think the problem with the first dog would resolve itself naturally. So it goes berserk, and chases and attacks one of my people, which then suffers broken bones and so on. I hesitated to shoot the poor animal, hoping my crewmate would survive, which they did, but reading over the injury list made me feel very conflicted. Meanwhile, the dog had switched targets for no apparent reason after chasing my crewmate into a house and ended up attacking a large native creature. I thought it died doing that, but later on it was still there and no eating properly out of the very same through. Needless to say I didn't bother with dogs after that, which didn't really feel like they added anything anyway, and immediately intervened if for some reason an animal wasn't eating properly. I think the issue is with the accessability of the food, there needing to be some extra free space. But things like that pop up all over. There are no bugs, but everything takes just a bit too much work and quickly becomes repetitive and annoying. One of my crewmates fixes three light fixtures in a row, is done, another one breaks down. One crewmate almost finishes a harvest and then just goes home, leaving the harvested material to rot and the unharvested part of the field to go to waste, with no replanting, while fertilizing appears to happen randomly, perhaps because the field doesn't grow evenly, so some of the field remains unplanted and then it is IMPOSSIBLE to fertilize the other plants for some reason. Crewmates also move randomly between jobs, like they build part of a wall, then don't continue with the next part of that wall, even though the resources have been delivered, no, instead they move back into the house to lay down some carpet, which was a job that took years in one playthrough because there wasn't a steady supply of the material. I never even had a particularly large base IMHO, but there quickly appear to be too many jobs for too few people that take too much time. Having to micromanage all that isn't my idea of fun. If the game did some of that work, by identifying bottlenecks and giving those the needed priority, that'd be much more convenient. Finally, there doesn't really appear to be much of an endgame. In the 'crashlanded' scenario I constructed the radios and was able to get one (1) crewmember off at a time. That felt wrong, leaving behind a dwindling crew to fend off the incessant alien attacks and inevitable breakdowns. As for the 'outpost' scenario, I imagine there'd never be an end, you can't leave the outpost behind, unattended, it'll just get overrun. There's no way to build a base that'll take care of itself. So, what's the point of it all? But so much is already in place, with just a little more attention and TLC this could have been a great game. All the basic elements are there. If you do like these sort of games, you may still get some enjoyment out of it, but I do recommend getting it at a discount.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "This is... this is Rimworld. I don't mean \"this reminds me of Rimworld\" or \"this is a similar sort of experience to Rimworld\", it's the same game with nicer graphics and some features left off. It feels weird to give a thumbs down to a game I've put over 100 hours into, but my honest review is \"Go play Rimworld instead.\" If you love that game, you sadly won't find anything new here. If you've never played it, you're better off experiencing the original.\nI guess if Rimworld's low-fi graphics were bugging you, or maybe you thought its gameplay was a bit too detailed, this game is probably for you. For my money, I find myself missing a number of Rimworld's features and in-depth management, and my NES-era brain stopped being impressed by shiny graphics upgrades a long time ago.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "It's a Rimworld in 3D but...... it way too shallow than Rimworld.\r\nI tried to play for 4 restart but everytime it ending with nothing to do and not challanging at all. \r\nI should buy rimworld DLC than this game.... sigh",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Bought the game, great experience, but we got forgoten by the devs, they let the game die",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "It's obviously trying to be RimWorld in 3D, but - in a strange twist - it lacks all the depth of the game that inspired it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Very odd game. You want to like the game and certain aspects are enjoyable, but there are too many flaws in the game to really be able to play it for long. Sometimes you try to get something done but nobody will do anything and when they do, takes forever to accomplish a simple task. Plus you have to research heavily, even the most minor things. These issues only get worse as you progress. It has a lot of good ideas but none of it has been implemented well, and there are a few bugs and quirks that add to the frustration.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Everything takes forever to do, you're always in need of a bunch of stuff, and for some reason increasingly-dangerous giant swarms of insects attack your base for no reason. It's like they don't really want you to progress, just wait to die. The basic concept is there, it's just that you need electronics for everything, that all keeps breaking and requires electronics to fix, so you can just never get ahead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I Never played Rimworld and only realized it was a thing after getting this, either way I went into this enjoying the idea and was enjoying the game itself. Until I realized just how little there really was, I bought this full price just around if not on launch day.\n\nI'm someone who gets into one of these games and will blow half a day on it without realizing, that's what I want sometimes but I couldn't satisfyingly get that with this. I tend to play games like this and put nearly triple digits into a single save/world. I made 3/4 worlds in under 100hr, one I had to remake cause it was broken by an early mod(Which Mods 110% saved this game.) This could play for a bit then walk away and that was how I extended it before falling off. On the plus it looks pretty good with a kinda realistic but still stylized look, animations smooth and at times I did just sit and watch everyone going around. Expect to micromanage to some extent, that's what these are, at some point there is some autonomy set and then its' building up to focus on defense for bug raids. I think the end game is to leave the planet but I never got to that point.... and It might have actually been a mod.\n It's not BAD but it really REALLY needs more into it. More creatures, more items, more devices, CUSTOM SURVIVOR maker. Like JFC I stopped playing for a while to wait until there were more mods cause this honestly feel like an early access game with more to come. You have a perk for \"Slept beside beloved\" yet double beds are a MOD?? Three kinds of dogs and maybe six creatures? There is a mech made much later but no other vehicles, four building material steps,(If I recall right) At best if they come back they will nickle and dime with DLC, when it really should be giving a couple of much needed free updates before that happens if they don't wanna spit in early customers faces. But they are under Paradox now and already DLC happy(Tropico)\nAt this point I say don't bother unless on sale and/or you see enough mods you'd like to use cause it seems like modders added more to the game than the devs who instead abandoned this game, went to another much worse publisher and then instead worked to \"relaunch\" a near identical concept game.(And seemed to fail at it too boot.)\n\nTl;Dr It's an okay game, Definitely enjoy it in short bursts, it just seems like it really needs more. Modders took over while the devs abandoned it for another exact concept game to relive it's glory.\nAnd yea, apparently it's basically 3D Rimworld.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Other's have said similar but I had to give it a try on sale.  It's like they added 3d building and better looking characters but subtracted a lot. It just makes me want to play Rimworld again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just play Rimworld. It's more realistic and the people actually function properly.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really expected something different from this game.  Typical low effort city builder game with the same engine as dozens of other games, with a few alienish skins.  I'm glad I got it on sale but I still feel like I was ripped off.  I would pay maybe 1 dollar for this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is nothing more than a frustrating pain in the ass micro management hell hole. Its not fun at all, its just annoying as ##.  Resource trees are not clearly explained, ppl die with little to no indication as to clearly why, its just painful, its not fun, it just rage worthy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "ffs will we suffer the (seemingly contradictory qualities) launcher, and the (seemingly contradictory qualities) data miner for this game now too? jeebus wept. another title goes on the trash heap of games i won't play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sadly, an unfinished game. It felt fun, and like it had potential but it really falls flat in the end.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Unfinished game lacking common sense for your colonists, as even a simple thing like warming up instead of dieing of hypothermia is too much for them, have fun micromanageing minial tasks because your colonists cant sustain themselfes independently.\nid rather go play other game with similar style.\nand 35€ for this? unbelivable, the 4€ i payed for a key on a key vendor site where acceptable, but pff, steam priceing? Go buy something else, this is not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Got no fun fuzzy feeling, seemed clunky and repetitive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super buggy and laggy for some reason.   unable to play in my set up.   had high hopes for this game, oh well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sandbox mode feels ridiculously empty. The only thing that happens there is another pack of bugs coming at you—that’s it. The economy is simple, research is simple, and long-distance travel is simple.\n\nI compare the experience to RimWorld, and this game generates nothing but the hope that it will improve at some point in the future—only to never live up to expectations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In the genre it feels uninspired, it's a game for sure, it plays fine (except crashing on Linux), but it doesn't do anything particularly well.\r\n\r\nThe combat is uninspired and clunky. The research is just the same as other games. The unique mechanic of observation is almost pointless. Some of the AI choices are great (like haul after harvest), but in general AI is as brain dead as is typical in these games (start a long path at 22h and exhaust on the trip).\r\n\r\nThe biggest problem with being so uninspired is that I'd rather do another Rimworld run over this. 3D is a gimmick, it's well done but it just doesn't affect the game play.\r\n\r\nI have zero desire to up the up the difficulty (to contrast 500% on Rimworld is a challenge) primary problem here is the clunkiness of the combat and weapon progression being atrocious. Having to fight hordes (even if small hordes) of bugs all the time is just tiresome.\r\n\r\nThere is some positives with the mechanics, and the game in general works very well. I just think the mechanics are half baked and there is zero unique factor (outside of the 3D gimmick) over vanilla Rimworld.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just too much of micromanagement and trying to persuade people to do certain things. It starts great but as game scales it becomes too tedious and player must somehow persuade those people to do certain things in exact order. It sucks all the joy as people become stupid and unable to do basic things. Assigned priorities are great, until game scales when they become meaningless.\r\n\r\nFor Linux players: if game crashes, try to turn off reflections, it can help.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think I got this for free, but it wasnt worth it. its like a worse version of rimworld. most mechanics are just copied straight from other similar games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a chore.  The AI isn't even smart enough to close windows when it's cold, or change into warmer clothes, or turn off lights.  You have to order your \"settlers\" to do EVERYTHING.  The QOL in this game is absolutely abysmal.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Made it an hour through several tutorials, crashed 3 times starting New Games. Unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to like this game, but ever since Paradox bought it, it's been crashing after a few minutes of play time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game constantly freezes the OS so that I have to manually reboot the PC. I verified, updated, yadda yadda but it still happens. Refund requested.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NOT RECOMMENDED if you are looking for a survivial crafter with depth and detail. \r\nOr for a survivial sim. Or for anything that the game description states prominently on the store page.\r\n\r\nInstead, what you get is a rather uninspired tower defense game, with crafting, survivial, sim, and everything else taking a very far back seat.\r\n\r\nAnimal attacks happen near-regularly on a timer. Each subsequent attack is by a larger group than the previous one. The more provisions you have stored, the even larger the group will be.  Also, the more defenses you have constructed, the larger the attack group seems to be.\r\nThis can go from initially a dozen animals to several hundreds quite quickly. \r\nTheir pathfinding is VERY primitive, so you have to funnel them through a narrow and long constructed defensive path. \r\nAnd that's all the finesse there is to it - no further tactical or strategic elements, at all.\r\n\r\nI severely dislike tower defense of this type, so I reduced this gameplay element via a mod and by dropping to the lowest difficulty level.\r\nAnd the remaining game was still uninspired, disappointing and annoying.\r\n\r\nThere are several undocumented and unclear mechanisms, and there are missable resources due to issue with the random map generation. Either alone will cause failure in the first or second game year. \r\nYou will have to restart from scratch several times over - or read detailed guides in advance that spoil everything.\r\nSome of these gameplay elements you can avoid if you know about them (e.g.: after a restart from scratch).\r\nOthers will force you to micro-manage around them very tediously, due to there being no way to make the survivors behave properly to avoid/neutralize them. Again, no finesse, at all.\r\n\r\nNow, with both all those lessons learned, as well as with the tower defense element reduced via mods - the game is STILL uninspired!\r\nYou are locked into a mostly fixed path, entirely governed by how slow clothes tailoring, crafting and buildig construction is timed versus clothes and equipment wear&tear. Also, by how slow technology resesarch is.\r\n\r\nThere are no engaging discovery elements in this game - no incentive to explore the map (more the opposite), no technology or other surprises/discoveries/alternate paths.\r\n\r\nIn the end, this is a tedious slog - not an enjoyable game.\r\n\r\nWhich is a shame, as there is an incredible amount of detail in the game (excellent sim) - but it all gets buried and killed by the overwhemling mechanisms mentioned above - even if you reduce some of them via mods.\r\n\r\nNOT RECOMMENDED, not even at a discount.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a simple game. You spend most of your time doing busy work. Especially one survivor is stuck cooking. The others are doing research and harvesting. Slow moving with very little fun factor. The schedule interface doesn't seem to work well. You still have to micro manage to keep survivors efficient and prevent them for burning out. So far has failed my expectations. Going Medieval does a much better job in controlling the players via schedule/activities tab/interface.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Abandonedware? Bought by Paradox, then no updates. Not really robust at this stage. Would review after update...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I initially bought it because it was essentially a 3D Rimworld clone. \nI thought copying so much of the core gameplay was a smart move at the beginning, you are instantly familiar with the UI which lowers the entry barrier.\nThis obviously raises the question of their own creative output being a copycat in many aspects and therein lies the ironic fate of the copycat.. The developers never had a long-term vision to establish their own identity or add meaningful innovations that would justify choosing this over the original.\n\nEvery time I played, I found myself asking \"why am I not just playing Rimworld instead?\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "отличная задумка, приемлимая реализация(можно было лучше, но все остальное подобное гораздо хуже), но рукожопые разработчики сделали так, что редактор модов не запускается, а я только из-за этого купил игру. поддержки от разработчика и издателя никакой. вообще никакой, абсолютный нуль. так что советовать к покупке не могу",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very clunky and the longer you play the less fun you have",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "steam if forcing me to see this message when i click on this game, so i am just randomly posting garbage! fart fart fart, stank bubble ginger beard",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Paradox is a scumbag company! I am digitally burning everything i own that is paradox.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just play Rimworld. Tis game brings nothing new nor is it exiciting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "made me want to play rimworld, a game better in almost every way.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you are looking for a game like Rimworld, just play Rimworld.",
      "voted_up": false,
      "votes_helpful": 23
    }
  ]
}