{
  "positive": [
    {
      "review": "9.4/10\nPersonally, I wouldn't recommend playing NIOH1 and NIOH2 back-to-back in one sitting, as the two games share significant repetition. Playing for extended periods straight can lead to severe fatigue. If you only plan to play through the game once casually, focusing primarily on the story and combat, then it's not a major issue. However, if you intend to thoroughly explore every detail, play through at least four times, and ultimately unlock all achievements, the weariness and frustration from playing both back-to-back will become increasingly apparent.\n\nFrom a gameplay perspective, NIOH2 does offer a richer experience than NIOH1. It builds upon its predecessor by introducing several interesting new gameplay mechanics and systems, while also refining and improving numerous details from the predecessor. This allows it to maintain a familiar feel while delivering some genuinely fresh gameplay experiences. However, this is largely thanks to NIOH1 establishing such a solid foundation for its gameplay mechanics, enabling NIOH2 to expand upon it. Second, NIOH2 fundamentally retains the gameplay systems of NIOH1. Consequently, despite the new additions, this sense of novelty doesn't last long. Take my experience as an example: I just finished replaying NIOH1 and unlocked all achievements, then dove straight into NIOH2. The freshness and enthusiasm it offered faded almost completely within 20 hours. Instead, an increasingly palpable sense of frustration and fatigue took hold. After all, NIOH2 essentially amounts to a copy-paste of its predecessor—whether in its action mechanics, combat system, map design, or core gameplay, it remains virtually identical to the original. Third, in my view, not all of NIOH2's adjustments and changes to the predecessor deliver a better experience. For certain gameplay elements, I personally still prefer the settings of the NIOH1.\n\nFrom a narrative standpoint, I find NIOH1's story more compelling. NIOH2's plot unfolds before the events of the first game, functioning as a prequel. NIOH1, however, is set during the late Sengoku period of Japan, weaving a rich ensemble tale through the eyes of William Adams (Miura Anjin). This era of Japanese history gave birth to numerous legendary figures. NIOH1 masterfully weaves these elements into a fantastical saga of the late Sengoku period's warlords. In contrast, NIOH2's historical backdrop feels comparatively muted. It adopts anime-inspired tropes and JRPG narrative techniques, focusing its storytelling on a core group led by the protagonist to reflect the era through intimate details. While this narrative style differs from its predecessor and has its own merits, its overly familiar tropes inevitably feel tiresome. Furthermore, the game repeatedly emphasizes themes commonplace in Japanese anime by its later stages: mutual understanding, harmonious coexistence, and letting go of hatred. While NIOH1 touched upon similar themes, it did so subtly and integrated them seamlessly into the plot. Personally, I preferred NIOH1's ensemble-driven narrative, which delivered a sense of grandeur and epic storytelling. In NIOH2, the plot truly began to feel compelling only towards the end of the main story, when William's return brought all the nostalgia and memories from the first game flooding back. Unfortunately, by this point, the game was essentially over. As for the DLC content, it objectively fills in some gaps in the game's lore and setting, making certain elements more logically consistent. But ultimately, it devolves into a rather melodramatic family saga—the legendary arch-villain turns out to be the protagonist's mother's brother, and all the fighting boils down to familial grudges and fated enmity...\n\n\nIn summary, NIOH2 is objectively a masterpiece not to be missed, and I highly recommend it. Subjectively, however, my prolonged marathon playthrough of both games left me fatigued, affecting my enjoyment of NIOH2. That said, purely in terms of unlocking all achievements, NIOH2 is considerably easier than NIOH1. Consequently, I only played through NIOH2 once with serious dedication, then unlocked all achievements as quickly as possible, and then decided to take a break. I won't be revisiting NIOH2 for quite some time. Therefore, I personally recommend that if you've just finished playing NIOH1 and played it very seriously, you might want to take a break before starting NIOH2. This approach will give you more freshness and sustain your enthusiasm for longer, making it less likely to burn out quickly. Beyond that, NIOH2 remains an excellent game.",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "Brilliant game with lots of replayability. Still didn't end up \"finishing\" the game after 160 hours. Well worth your time.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "The greatest action RPG of all time, unless Nioh 3 somehow tops it. Play this game",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Top tier game.\r\n\r\nI have heard people say that this soulslike is not what you should start out in and granted I started with Demon Souls on the PS3. However, this game teaches good fundamentals, like timing, ki/stamina and life management, build making etc, that gamers can use in other games that are similarly difficult (Sekiro/Elden Ring). I'd say it is definitely a game that people who are new or relatively experienced in the genre should consider, due to its robust systems.\r\n\r\nThe nice thing about this game is that you can also have up to two additional players assisting you via invites, you can also summon npc versions of players to help too if no one is around. There are no invasions in this game so you don't have to worry about that if you don't like it.\r\n\r\nThe game is both fast and slow paced, which sounds odd but it is the best way to describe it. Whilst fighting bosses in the higher difficulties you will be using different methods to take them out and this usually involves in applying a lot of pressure at the right time. The right time does not always present itself regularly and if you get to greedy it can find yourself right back at the shrine. Once you understand this pacing along with understanding the diverse tools available to you to despatch your foes, everything will click for you.\r\n\r\nDon't be afraid to experiment, fail, try a different approach, succeed or fail again, refine your approach and ultimately succeed. \r\n\r\nMy only issue that I have with this game which is quite specific is that the developers only allow the inventory filter function when in certain menus. The problem is that this game does require quite a lot of inventory management so it is unintuitive to have to go to these menus that you may not want to use just to filter items. It would be nice to open my inventory from the overworld and manage it using filters more efficiently. \r\n\r\nI would ultimately give this game a 9-9.5/10.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "TL/DR: Good game. Interesting mixture of game genres that manages to create a unique and fun gameplay loop. Sets itself apart from its competitors very well. Some frustrating difficulty spikes here and there. Neutral towards the story. Bland presentation. Visually the game aged very well. Cool Japanese historical/folklorist/mythological setting with art style and overall atmosphere to match. \n\nHas an extensive endgame grind and NG+. Plenty of replayability and many different builds playstyles. No PvP, but you can fight copies of players called Revenants left behind after they die. You can fight them to increase your passive bonuses in the clan system. There is Co-Op and you can also leave behind a copy of your character for other players to summon. A solid 9/10 game. Highly recommended.\n\n***\n\nIt's a very unique game that combines elements from Hack & Slash action games, Soulslike games and Diablo-style ARPGs. \n\nLots of weapon combos and many different weapon types that each have their own very distinct playstyles.\n\nSlower and more methodical combat with a heavy focus on its unique stamina management system (Ki Pulse). \n\nMetroidvania-like map design (some of the larger maps are very well designed and very complex in a good way). \n\nBonfire-like safe spots called Shrines where you respawn when you die (yes, enemies respawn as well). \n\nStats to level up like you'd do in Soulslike games and lots of gear grind like in an old school ARPG (so no unique armor and weapons like in Soulslike games but randomized Diablo-style loot).\n\nThere are also other types of offensive abilities besides the weapons and their related skills and combos. \n\nThere is Ninjutsu ( do not think I have to explain this one) and Onmyo (a type of traditional magic from Japanese folklore that is like a combination of elemental and holy magic. Think of Shamanism and Exorcism in one). Both are very much viable to include in builds and come with their own skill trees similar to the weapon skill trees.\n\nThen there is Yokai Shift and Yokai abilities. Yokai are spirits from Japanese folklore. Most of them seem to be evil, but there are also neutral one and good ones. Yokai Shift is a transformation that brings out your inner Yokai (the good kind) that comes with greatly enhanched abilities. You can have a total of two guardian spirits at a time, each of which come in three different types (Brute, Feral and Phantom) and with their own stats (not random).\n\nWhen you beat evil Yokai they have a chance to leave behind a Soul Core which you can equip in your Guardian Spirits which allows you to use the abilities of these Yokai. Soul Core stats are mostly random, but each type of Yokai does have specific guaranteed stats that are always the same for that type of Yokai. You are very much encouraged to use these and it's a lot of fun to weave them in between your weapon combos. You can use them independently from your Yokai Shift. You can farm Soul Cores infinitely and there are ways to increase the drop rates. There are a bunch of maps that are especially good for Soul Core farming.\n\nAll in all I'd say that calling the Nioh games Soulslike does not do these games justice. There are certainly elements of Soulslike games. But as I explained above it does a lot to set itself apart from the standard Soulslike formula. And in my opinion it does so in a very good way.\n\nThe game does have some negatives. What I disliked the most were the difficulty spikes. There are certain parts throughout the story were the difficulty will feel very out of wack compared to the parts you just completed. One of these spikes occurs rather early, in the second main mission. It's very much beatable, but for those who tend to struggle at such parts (like I do) then this can become a source for frustration. \n\nBut that's where the gear grind can help you out. In this game gear matters a lot, but in a very different way than you'd find in a more traditional Soulslike game. This is where the Diablo-like ARPG elements come in. Lots and lots of randomized gear of different rarities, and there is also gear crafting. A multitude of different gear sets that come with their own bonuses are also present. Exactly like you'd expect from a Diablo-style ARPG. \n\nYou do not get a weapon and a set of armor and then stick with it for the rest of the game. You will want to get new weapons and new armor on a regular basis. You will play this game as if it were a more traditional Soulslike at your own peril. Play it like Grim Dawn instead of Lords of the Fallen.\n\nOne thing that I'm more neutral on is the story. It takes place in the Sengoku Era and includes iconic figures from Japanese history such as Oda Nobunaga and Toyotomi Hideyoshi, and these are very much relevant to the plot (especially Hideyoshi). Then as a bonus it throws in a lot of supernatural and spiritual elements from Japanese folklore and mythology into the mix. \n\nSo you'd think that this whole setting would be perfect for an incredible story. But the overall presentation kind of falls flat in my opinion. It all appear like a selection of historical events that, while they progress in chronological order, still feel somehow like they were randomly thrown together. And then your own character, the random no-name character that you just created out of thin air, is awkwardly hamfisted in between all these renowned historical figures.\n\nBut I generally do not play these types of games for the story so I didn't bother to look into all the subtext, and therefore I opted to remain neutral towards it.\n\nNow visually the whole setting truly comes to life. I personally love how the historical and folklorist/mythological elements are woven into one another. The game oozes atmosphere, especially on the larger and more complex maps. I think the game aged very well. Yet another piece of evidence in favor of the idea that art style can carry the visuals of a game far further into the future than pure graphical fidelity can.\n\nAnd last but not least, while I'm not at that point in the game yet, there is a very extensive endgame grind at the end of the story. The DLCs included with this edition of the game expand on this endgame. So if you love grinding and optimizing gear and learning the ins and outs of your preferred weapons and abilities, and put it all to the test against overwhelming odds then there is certainly fun to be had in this game. And then there is also NG+. So lots of replayability and plenty of chances to try out different builds and playstyles.\n\nThere is no PvP. But you can fight against Revenants, which are basically copies of other players left behind after they die. There is a sort of clan system that mostly exists to provide some useful passive QoL bonuses. You can fight these Revenants to increase your score and increase your passive bonuses. There is Co-Op and you can voluntarly leave bind a copy of yourself in three maps of your choice that other players can summon to help them out.\n\nAll things considered, I will say that I personally highly recommend this game. I think it's very fun and sets itself apart from other games very nicely. The mixture of Japanese history and Folklore/Mythology provides a very distinct style and atmosphere that I personally really like.\n\nI give this game a score of 9/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nioh 2 has really fun, layered combat, and the build variety is a big part of why it hooked me. Every weapon plays differently, and messing around with different setups keeps the game fresh as you learn the ropes.\n\nThe early hours are rough — the controls feel odd at first, and the game throws a lot at you. Inventory management can get annoying too. But once things start to click, it becomes genuinely rewarding.\n\nIf you’re into Souls-likes and enjoy deep combat with tons of build options, it’s an easy one to recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of my GOATs. It's old now, very old. From the get go, it had great graphics for its time, but not just that, it had absolutely, insanely well optimized graphics. You could run it on high with a 1060 and have zero problems, that kind of optimization is somewhat lacking in Team Ninja's more recent ventures. Beyond that, the replayability is immense. Multiple NG+ tiers each with their own scaling and introducing more loot tiers and new sets as you dig deeper. Finishing NG is just the start. Then you get into NG+ and start tuning weapons, farming for endgame sets, memorizing boss move pools, etc. While it doesn't have the open world nature of a more traditional Souls-like, the linear, level-like layout allows them to have absolutely stellar and tight level design and layouts, and frankly the only blemish on the game's levels is their occasional reuse for smaller side missions. I won't begrudge them that though, since they added multiple new weapon types, discoverable secret moves, and full character customization in their second iteration of Nioh.\n\nI'm writing this belatedly, after having platinum'd the game on PS4 and sunk more than 200 hours into it on PC as well. If you're at all a fan of Souls-likes and you haven't tried Nioh 2 yet, you're missing out on one of the greatest Souls-likes ever made. The customization is fantastic, the challenge is there, and the multiplayer actually functions properly. (Unlike most every FromSoft game ever made.)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good lord do i LOVE this game!\n\nMastering different weapons is so rewarding and engaging, the stances and pulses are like a drug that hurts so good. Enemies do get a lil repetitive as you go on, but bosses are solidddd.\n\nI've played all the souls games and then some and I happily put nioh in the top 5, it's so solid.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I got lots of Souls experience since Demon Souls onwards. This game still kicking my ass. If you enjoy the atmosphere of From Software games then you might not enjoy Nioh. But if you want a very detailed combat system that is incredibly satisfying to learn and master. Dont hesitate to pick this up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a love-hate relationship, but overall I would say yeah, give it a try.\nThe yokai designs are awesome, the weapons and yokai shifts feel very good, your loot goblin instincts will be satisfied (albeit not fully due to the relatively small inventory limit), and you can easily dump a hundred or more hours into the game. The levels are big and fun to explore, and multiplayer is nice.\nMy main grip is some of the bossfights. Man, does it often feel like a drag (although accompanied by an absolute visual spectacle). Most of the time you can be twoshot by any boss, and the attacks come out fast. This can be mitigated by investing in some defensive buffs, or, well, simply \"getting good\" - but half of the time I felt not happy that I bested the boss, but that the fight was finally over. With many npc fights the most effective strategy seemed to be poking them with one attack and running away, which... yeah... And don't get me started on the axe awakening quest. Ugh.\nOverall though, the game's climate and spectacle are great. I love the yokai, I love the spirits and magic, I love scampuss, and I love getting lost in the levels. The oneshots, late-game ganks and npc bossfights be damned, I give the game the thumbs up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely the best soulslike to date, second only to Lies of P. Combat and gear systems are mostly the same as in Nioh 1, but with some fitting additions that enhance the overall experience. The level design is also improved and more balanced, giving a fair challenge that rewards skill and patience instead of punishing trial and error. Hard to admit, but it’s better than any Dark Souls game, I must say.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "First things first, I've waited YEARS to finally play this game and I will say the wait was worth it. Every moment (so far), every victory, every upgrade and even every death all feels well earned and up to the player. Sure you can overlevel but you still need a margin of skill to surpass the hurdles and enemies placed in front of you.\r\nI can't wait to keep playing this game and eventually 100% it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute peak game, its got such a fun nuanced combat and gear system that is so addicting to play, and the NG+ cycles are actually fun with new mechanics to engage with. Has a steep learning curve but once it clicks it really clicks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a hard game. Hard mob enemies and even harder bosses. It's hard in the beginning but as you get better, it gets satisfying. You gotta learn the mechanics and master them to excel in this game. Honestly it get repetitive if you do all the side content. I got bored that I changed my weapon halfway thru the game but overall it's a good game. If you like souslikes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very slept-on from my end and I'm glad to have played this as it combines my love for Ninja Gaiden with the souls-like mechanics to make this a challenge worth struggling through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Combat is very fun. Deserves significantly more popularity as it is a solid Souls-like game.\nAlso the Co-Op is pretty seamless, so it's easy to go through the game with a friend.\nNot an open world though. You have to load into missions, which is a small downside.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If there was a perfect action game, then this would be in the running. The systems within and the variety with a strong core make it practically flawless. It has a highly in-depth attack/stance system with blocking, parrying, and stamina(ki) management.\r\n\r\nThe visuals are fantastic and stylized. Characters are all great looking and customization of your own is excellent too. Performance is decent(Im on the higher end of hardware so biased here)\r\n\r\nEnemies are varied (Especially bosses), and the way you approach them changes based on the enemy type. Some are no threat alone, but those same enemies may become exponentially more dangerous in group fights (kamikaze ninjas- Im lookin at yall), and others will kick your ass up and down the block regardless (ninja oni for me).\r\n\r\nResource management is important (spells,items,healing), especially in longer fights, but they meticulously balance the drop rates such that exploring/progressing longer levels is not a painful process, and the checkpoints/shortcuts are usually well placed, and there is a dark souls style restock system for resources should you get a surplus over their carry limit, pulled from the checkpoints.\r\n\r\nMastering the game feels great, and changing builds between weapons and styles feels like you change the way you interface with the game entirely. Doing so got easier later on due to understanding the fundamentals of it.\r\n\r\nThe story is... there. Somewhat interesting if you know Japanese history I suppose, but it is more of a Dynasty Warriors story style mashup with some Japanese folklore and mythology, and there is more of a disconnect from the main character in this story, rather than Nioh 1, in which it is entirely centered around William. (Nioh 2 almost feels like their story runs in an alternate dimension compared to the other characters- which is fitting I suppose) I got the feeling of playing a fanfic would be the best way to put it. The DLC's are better storywise than the main game.\r\n\r\nI could go on all day but,\r\n\r\ntldr\r\nDifficult 3rd person action rpg with a lot of depth and excellent co-op integration. Highly recommended for fans of Ninja Gaiden, Dynastry Warriors, and Fromsoftware games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nioh 2 has a lot of similarities to Nioh 1—even some of the boss fights are basically copies of the first game. They added a couple of new weapon types and a new Oni form, which was pretty fun to use. I rate this game higher than Nioh 1 because it’s essentially an upgraded version, but it still has the same flaws: repeated boss fights and a 100% that requires you to replay the game over and over, farming the same bosses for weapons again and again. It’s a chore. Play the game, but don’t go for the 100%. The game is a 7.5/10, and the 100% is a 4/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome! It is hard as hell at first but rewards the player for learning how to play. There is way more content in this game than almost any game I have played recently too. I wish I had played it sooner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "第二代比第一代更好玩，在各方面都有所提升，玩法更多樣化，還有洗點更方便了！\n只是這款遊戲對新手來說比較難入手，有些東西沒有解釋到如何運作，玩家自己需要去找攻略。\n有些地圖真的很大，分岔路又有分岔路，真的很容易迷路或者遺漏掉一些物品。\n然後就是一些支線關卡和BGM都重複用一代的，如果該關卡跟一代有相關劇情還說得過去，可是並沒有。\n整體來說還是好玩的，值得推薦👍😊\n\nNioh 2 is more fun than the prequel, with improvements across the board, more diverse gameplay, and even easier stat resets!\nHowever, this game can be quite challenging for beginners to get into. Some mechanics aren't explained, so players need to find guides themselves.\nSome maps are really huge, with branching paths leading to even more paths, making it super easy to get lost or miss out on items.\nAdditionally, some side quests and BGM are recycled from the first game. It would be understandable if the quest had related story content from the first game, but it doesn't.\nOverall, it's still fun and worth recommending. 👍😊",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a big improvement from Nioh 1 in every aspect. The combat in this series is just so unique and interesting that I just keep coming back time and time again just to scratch that specific itch.\r\n\r\nIm not as dedicated as the other fans that has completed the majority of endgame but I still appreciate the sheer depth and replayability of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Character customization is amazing. This game makes my looting goblin brain go \"yes\" but no loot will save me from the skill issue I have.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nioh 2 takes everything the original game did well and elevates it to a whole new level, delivering a souls-like experience that is both punishing and deeply rewarding. After enjoying the first Nioh for free on the Epic Games Store, I found myself even more captivated by its sequel, which expands the weapon variety and introduces powerful Yokai abilities that let you unleash your inner demon in combat. The replayability is excellent, with higher difficulty settings adding fresh layers of challenge and strategy, ensuring that every run feels unique and demanding. Set against the backdrop of Feudal Japan, the story blends history and myth seamlessly, and best of all, you don’t need to play the first game to appreciate or understand the narrative. Altogether, Nioh 2 is a masterful refinement of its predecessor, offering intense gameplay, rich atmosphere, and endless reasons to return for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grindy and Difficult alone.\r\nGrindy and Fun with a friend or two.\r\nBest Coop Soulslike out there imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nioh 1 was fun with occasional moments of intolerable bullshit.\n\nNioh 2 is intolerable bullshit with occasional moments of fun.\n\n\nThis game is designed, deliberately and from the ground up, to be annoying. Every bit of loot is bait. Every corner has something hiding behind it. More than half of almost every map takes place on narrow passages over instant death. There are multiple locations with instant death traps that you can only know exist by falling for them at least once.\n\nThey ran out of mission ideas in the last DLC so pretty much all of the optional missions are just arena gauntlets against a series of packs of mobs and bosses without breaks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game kicks ass. Bosses and items and stats are all really interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love souls games, you are doing a disservice by not giving this one a shot. It is a very satisfying game. Try it. its worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is nioh 1 but more brutal. The demon system is awesome, and some combats with bosses are epic.\nOn the other side, some normal enemies encounters and random traps/troll stuff around the level will make you think this is an unfair game. And that is a fair pov. You just get used to it and see it coming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Balance game, good story,and when multiplayer difficult raise and make more fun, really wide build and costumize character and sometime need strategy for againts oppenent but its not reccomend for skill issue player",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game play is amazing. Build variety is amazing. Story leaves much to be desired but its serviceable enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting constantly staggered and one-shotted - The Game. The character creation is great though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally no other game has better combat than the Nioh series. Each weapon has It's unique features, unique skill trees and 3 different stances that you can switch between at any time. If you want to be simple and just bonk your enemies to death, you can do that. If you want to be agile and dance around your enemies, you can do that. If you want to sink hours and hours to learn how deep the mechanics of this game actually is, you can also do that. \r\n\r\nThe New Game+ isn't weak either. The game keeps throwing new mechanics and content at you as you progress further into the NG+ Cycles. The enemies' moveset changes, new items start appearing, new stats, new bonuses etc...\r\n\r\nPeople keep saying the story is weak, they're wrong. Sure, the cutscenes are a bit anime-ish and not too serious (potentially resulting in people calling the story weak) but there is a really good story here. If you take your time to read the Character Directory, or just follow the story, you can see how good the story really is. It actually made me tear up at times. PS: Play the game in Japanese voices, not English! :')\r\n\r\nThe soundtrack... man, the soundtrack. It's just amazing. Every single boss has an amazing, memorable soundtrack that ties well with their stories and backgrounds. The bosses can go into the Dark Realm (kind of like a second phase) and when they do, the soundtrack intensifies as well and It's just seamless.\r\n\r\nTLDR: If you're looking for a game that has deep combat/mechanics, a lot of cool enemy designs, banger soundtrack and endless content... Nioh 2 is a no-brainer, must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, terrible bosses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like an ARPG combined with Ninja Gaiden. You will enjoy the complex mechanics of combat and add on top of that, the loot and the numbers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its like diablo meets a souls game that also had a sidechick named devil may cry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1k hrs on playstation...... ppl complain its too hard... ppl need to fix build and get better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and hard action rpg. worth the learning curve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best souls like on the market IMO with ways to build and play how ever you like and an incredible endgame.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Story of my life:\nI got engaged, married, divorced and came togehter with the same man again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Perfect mix of Ninja Gaiden and Souls. For those coming from Dark Souls, the ki system will take getting used to, as will the stance system. And inventory management is very time-consuming on higher difficulties.\r\n\r\nOnce you get the hang of all these, there's a lot of amazing level designs and boss battles to keep you engaged, each weapon has very deep and rewarding depths, and there's a lot of replayability and customization. Now go break yokai, and become Nioh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "c'est de l'art pour les yeux vous aller kiffé niveau difficulté c'est hard pour les nouveau et facile pour les anciens je vous conseil de jouer avec des amis c'est plus fun mais pas de jouer avec des amis pour rien branler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More polished combat than part 2, better balance if you liked the first game you'll love this one even more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The stances are awesome and the game is beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A massive improvement in every way over the first game. 9/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game really drives up that top note. *Click* Noice. That's a ten.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Souls-like game with THE most satisfying combat to date.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Veri Guud Masterpiis Of A Geim. Nevö hööd 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love both nioh 1 and 2 great games....waitning for nioh 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good souls like but not enough feet or swamps",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "one of my fav all time games. 100% masterpiece",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It’s not a game, it’s a piece of art.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great acction game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good action game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever. BUY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Japanese themed dark souls. excellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ninja Gaiden with stamina",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "火车你带我走吧",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "She Demon on my Form till I Feral",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "okuni.... 👃👃👃",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PAINFULLY ENTERTAINING",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Snake lady",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "games hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Onimusha Souls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like ninjas",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NIOHHHHHHHHHHHHHHH",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9.4/10\nPersonally, I wouldn't recommend playing NIOH1 and NIOH2 back-to-back in one sitting, as the two games share significant repetition. Playing for extended periods straight can lead to severe fatigue. If you only plan to play through the game once casually, focusing primarily on the story and combat, then it's not a major issue. However, if you intend to thoroughly explore every detail, play through at least four times, and ultimately unlock all achievements, the weariness and frustration from playing both back-to-back will become increasingly apparent.\n\nFrom a gameplay perspective, NIOH2 does offer a richer experience than NIOH1. It builds upon its predecessor by introducing several interesting new gameplay mechanics and systems, while also refining and improving numerous details from the predecessor. This allows it to maintain a familiar feel while delivering some genuinely fresh gameplay experiences. However, this is largely thanks to NIOH1 establishing such a solid foundation for its gameplay mechanics, enabling NIOH2 to expand upon it. Second, NIOH2 fundamentally retains the gameplay systems of NIOH1. Consequently, despite the new additions, this sense of novelty doesn't last long. Take my experience as an example: I just finished replaying NIOH1 and unlocked all achievements, then dove straight into NIOH2. The freshness and enthusiasm it offered faded almost completely within 20 hours. Instead, an increasingly palpable sense of frustration and fatigue took hold. After all, NIOH2 essentially amounts to a copy-paste of its predecessor—whether in its action mechanics, combat system, map design, or core gameplay, it remains virtually identical to the original. Third, in my view, not all of NIOH2's adjustments and changes to the predecessor deliver a better experience. For certain gameplay elements, I personally still prefer the settings of the NIOH1.\n\nFrom a narrative standpoint, I find NIOH1's story more compelling. NIOH2's plot unfolds before the events of the first game, functioning as a prequel. NIOH1, however, is set during the late Sengoku period of Japan, weaving a rich ensemble tale through the eyes of William Adams (Miura Anjin). This era of Japanese history gave birth to numerous legendary figures. NIOH1 masterfully weaves these elements into a fantastical saga of the late Sengoku period's warlords. In contrast, NIOH2's historical backdrop feels comparatively muted. It adopts anime-inspired tropes and JRPG narrative techniques, focusing its storytelling on a core group led by the protagonist to reflect the era through intimate details. While this narrative style differs from its predecessor and has its own merits, its overly familiar tropes inevitably feel tiresome. Furthermore, the game repeatedly emphasizes themes commonplace in Japanese anime by its later stages: mutual understanding, harmonious coexistence, and letting go of hatred. While NIOH1 touched upon similar themes, it did so subtly and integrated them seamlessly into the plot. Personally, I preferred NIOH1's ensemble-driven narrative, which delivered a sense of grandeur and epic storytelling. In NIOH2, the plot truly began to feel compelling only towards the end of the main story, when William's return brought all the nostalgia and memories from the first game flooding back. Unfortunately, by this point, the game was essentially over. As for the DLC content, it objectively fills in some gaps in the game's lore and setting, making certain elements more logically consistent. But ultimately, it devolves into a rather melodramatic family saga—the legendary arch-villain turns out to be the protagonist's mother's brother, and all the fighting boils down to familial grudges and fated enmity...\n\n\nIn summary, NIOH2 is objectively a masterpiece not to be missed, and I highly recommend it. Subjectively, however, my prolonged marathon playthrough of both games left me fatigued, affecting my enjoyment of NIOH2. That said, purely in terms of unlocking all achievements, NIOH2 is considerably easier than NIOH1. Consequently, I only played through NIOH2 once with serious dedication, then unlocked all achievements as quickly as possible, and then decided to take a break. I won't be revisiting NIOH2 for quite some time. Therefore, I personally recommend that if you've just finished playing NIOH1 and played it very seriously, you might want to take a break before starting NIOH2. This approach will give you more freshness and sustain your enthusiasm for longer, making it less likely to burn out quickly. Beyond that, NIOH2 remains an excellent game.",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "Nioh 2 is my favourite action RPG ever. It's a mission-based hack and slash looter with a focus on player movesets. Missions are anywhere from 2 minutes to half an hour, so there's not too much time commitment needed. Its combat systems are too deep to go into in one small review, but it builds off of Nioh's excellent three-stance system and adds in various awesome Yokai abilities that lets you turn into a demon, summon Yokai to help or brutally counter enemy attacks. If you want a gameplay comparison, it's like Ninja Gaiden and Musou had a Diablo baby. There's 11 weapons and they're all incredibly deep and you'll take ages to master their enormous movesets. The graphics are fantastic and the game's artstyle goes so hard, with combat feeling very frantic as particle effects fly in every direction and there's constant explosions and magical effects. Not to mention the absolutely awesome enemies and bosses, of which there are many. The story is more than serviceable and puts you in the shoes of a very famous 16th century Japanese warlord. I won't spoil much more but it's got some awesome moments and even made me cry once or twice. After you finish the 50-70 hour campaign, there's hundreds of hours of endgame content across the game's 4 NG+ cycles, and the gigantic final dungeon unlocked after that. The endgame isn't for the faint of heart - it's designed to be unfair and feel impossible at times, but it does this without artificial padding. You are never far from your mission objective. However, even missions that would be considered boring in other games are just more excuse to interact with the game's insane combat system that you'll never get bored of.\n\nIf you're not a fan of the Sengoku era, you likely won't understand the story much, so go in expecting that. Also, sometimes the game can feel a little bit difficult, but you have the option of asking other players for help or summoning player-created NPC bodyguards to assist you. There's one or two bosses I don't like, with one of the later bosses being a bit obnoxious if you go alone. Lastly, the game doesn't do an amazing job of introducing mechanics slowly to the player, meaning you can definitely feel thrown in the deep end and find yourself dying a fair bit, but just remember that levels don't matter much in this game and you gain permanent experience every time you hit an enemy. \n\nOverall, this is easily my favourite game ever. I've played close to a thousand hours of it on all systems, and I don't intend to stop. No combat system has ever come close, and this game is such a wild improvement over what was already one of my favourite games ever.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Souls-like jrpg.\r\nTons of loot, tons of enemies, tons of fun. \r\nThe only thing that is bad is the difficulty curve - hard in the beginning - watch youtube videos on the bosses.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Before releasing Nioh 3, and after spending more than 1,000 hours, I can say this is the game I’ve enjoyed playing the most!",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "reminds me of action games back on the PS2, absolutely brutal yet some of the most fun i've ever had in a game",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Really painful to play. Every boss fight make my blood pressure spike, but its really fun.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "The greatest action RPG of all time, unless Nioh 3 somehow tops it. Play this game",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Brilliant game with lots of replayability. Still didn't end up \"finishing\" the game after 160 hours. Well worth your time.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I used to hate this type of game with a burning passion. Nioh 1 and 2 have completely changed my mind about these types of games: the level of detail and depth and the gameplay is so fun and polished that 99% of the times you loose you don't even get mad because you understand why you lost. I'm a gamer rageaholic, not going to lie but I found myself having so much fun that I never got angry when losing. 10/10 play it and if you're a new player to these types of games don't be afraid. The game does not hold your hand BUT it always allows you to defeat any enemies (if all else fails the community always helps with guides).\n\nEDIT: Forgot to add, the story is amazing. Japanese history mixed in with historical figures and fantasy elements.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Is easily one of the best games I've ever played. The combat system is incredibly satisfying and deep. Just buy it and enjoy!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Top tier game.\r\n\r\nI have heard people say that this soulslike is not what you should start out in and granted I started with Demon Souls on the PS3. However, this game teaches good fundamentals, like timing, ki/stamina and life management, build making etc, that gamers can use in other games that are similarly difficult (Sekiro/Elden Ring). I'd say it is definitely a game that people who are new or relatively experienced in the genre should consider, due to its robust systems.\r\n\r\nThe nice thing about this game is that you can also have up to two additional players assisting you via invites, you can also summon npc versions of players to help too if no one is around. There are no invasions in this game so you don't have to worry about that if you don't like it.\r\n\r\nThe game is both fast and slow paced, which sounds odd but it is the best way to describe it. Whilst fighting bosses in the higher difficulties you will be using different methods to take them out and this usually involves in applying a lot of pressure at the right time. The right time does not always present itself regularly and if you get to greedy it can find yourself right back at the shrine. Once you understand this pacing along with understanding the diverse tools available to you to despatch your foes, everything will click for you.\r\n\r\nDon't be afraid to experiment, fail, try a different approach, succeed or fail again, refine your approach and ultimately succeed. \r\n\r\nMy only issue that I have with this game which is quite specific is that the developers only allow the inventory filter function when in certain menus. The problem is that this game does require quite a lot of inventory management so it is unintuitive to have to go to these menus that you may not want to use just to filter items. It would be nice to open my inventory from the overworld and manage it using filters more efficiently. \r\n\r\nI would ultimately give this game a 9-9.5/10.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "The best souls-like that I've ever played. The amount of customization when it comes to play styles is amazing. A solid story, but the meat and potatoes is the gameplay. Very fun, very fast. You really feel the power as you progress. Cannot recommend this series enough.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "If you are a noob and bad at soulslikes, spam ninjutsu the entire game and cheese tf out of it.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I enjoyed Nioh 2 more than its predecessor, though the problems I had with the first game are still glaringly present.\r\n\r\nThe good stuff from Nioh is back. The combat is still great, arguably one of the best in the genre, and I found it to be even more snappy and responsive in the sequel. The innovative Ki management system makes its triumphant return, as do the three different stances , the onmyo/justsu magic talismans, and the Guardian Spirit transformations. Both of the latter have been nerfed significantly (I’m looking at you, Sloth talisman), which means there’s no real “press to win” button now. You can still put all your points into Spirit and Magic, but you’ll end up having to engage with the other systems too if you don’t want to get stomped on late-game.\r\n\r\nThree new major introductions to the sequel are Yokai Realms, Burst Counters, and soul cores. Yokai Realms are great fun : fog-shrouded areas filled with powerful enemies that reduced ki recovery until the “boss” of the area is found and dealt with. You really have to plan your attack carefully and not run in guns blazing, which was a refreshing change from the rest of the levels.\r\n\r\nI found burst counters to be awesome : a fairly generous parry that allows you to counter unblock-able attacks in three different ways depending on the spirit type you have equipped (Brute, Feral, or Phantom). There’s no better feeling than turning a bosses’ attack against him, exhausting his ki, and grappling him to death.\r\nSoul cores I was a bit lukewarm on. It’s a great idea in theory, allowing you to effectively steal an enemy’s move-set and add it to your own, but in practice I quickly found my three favourites, then didn’t touch it again until the endgame.\r\n\r\nUnfortunately, there are the other things that still need to be fixed. Loot is still a hassle to deal with. The forge (or reforge), I found to be mostly useless on the lower difficulty levels. I wish Nioh would take a page out of Diablo or Destiny’s playbook and offer up some really unique loot that would be worth keeping and upgrading, rather than another Demon Axe with slightly higher stats that’ll I’ll dismantle before the end of the level because I’ll have found another one.\r\n\r\nThe sub missions still reuse environments and never stray far from the “find this group of enemies or boss and kill them” objective. It’s a shame, as the story is a bit more fleshed-out this time around and there are a host of NPC characters that team up with you occasionally.\r\n\r\nNioh is still a great game, though, better than its predecessor, and with Nioh 3 on the horizon I expect 2026 will be a great year for fans of this magnificently complex, loot-based combat series.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "TL/DR: Good game. Interesting mixture of game genres that manages to create a unique and fun gameplay loop. Sets itself apart from its competitors very well. Some frustrating difficulty spikes here and there. Neutral towards the story. Bland presentation. Visually the game aged very well. Cool Japanese historical/folklorist/mythological setting with art style and overall atmosphere to match. \n\nHas an extensive endgame grind and NG+. Plenty of replayability and many different builds playstyles. No PvP, but you can fight copies of players called Revenants left behind after they die. You can fight them to increase your passive bonuses in the clan system. There is Co-Op and you can also leave behind a copy of your character for other players to summon. A solid 9/10 game. Highly recommended.\n\n***\n\nIt's a very unique game that combines elements from Hack & Slash action games, Soulslike games and Diablo-style ARPGs. \n\nLots of weapon combos and many different weapon types that each have their own very distinct playstyles.\n\nSlower and more methodical combat with a heavy focus on its unique stamina management system (Ki Pulse). \n\nMetroidvania-like map design (some of the larger maps are very well designed and very complex in a good way). \n\nBonfire-like safe spots called Shrines where you respawn when you die (yes, enemies respawn as well). \n\nStats to level up like you'd do in Soulslike games and lots of gear grind like in an old school ARPG (so no unique armor and weapons like in Soulslike games but randomized Diablo-style loot).\n\nThere are also other types of offensive abilities besides the weapons and their related skills and combos. \n\nThere is Ninjutsu ( do not think I have to explain this one) and Onmyo (a type of traditional magic from Japanese folklore that is like a combination of elemental and holy magic. Think of Shamanism and Exorcism in one). Both are very much viable to include in builds and come with their own skill trees similar to the weapon skill trees.\n\nThen there is Yokai Shift and Yokai abilities. Yokai are spirits from Japanese folklore. Most of them seem to be evil, but there are also neutral one and good ones. Yokai Shift is a transformation that brings out your inner Yokai (the good kind) that comes with greatly enhanched abilities. You can have a total of two guardian spirits at a time, each of which come in three different types (Brute, Feral and Phantom) and with their own stats (not random).\n\nWhen you beat evil Yokai they have a chance to leave behind a Soul Core which you can equip in your Guardian Spirits which allows you to use the abilities of these Yokai. Soul Core stats are mostly random, but each type of Yokai does have specific guaranteed stats that are always the same for that type of Yokai. You are very much encouraged to use these and it's a lot of fun to weave them in between your weapon combos. You can use them independently from your Yokai Shift. You can farm Soul Cores infinitely and there are ways to increase the drop rates. There are a bunch of maps that are especially good for Soul Core farming.\n\nAll in all I'd say that calling the Nioh games Soulslike does not do these games justice. There are certainly elements of Soulslike games. But as I explained above it does a lot to set itself apart from the standard Soulslike formula. And in my opinion it does so in a very good way.\n\nThe game does have some negatives. What I disliked the most were the difficulty spikes. There are certain parts throughout the story were the difficulty will feel very out of wack compared to the parts you just completed. One of these spikes occurs rather early, in the second main mission. It's very much beatable, but for those who tend to struggle at such parts (like I do) then this can become a source for frustration. \n\nBut that's where the gear grind can help you out. In this game gear matters a lot, but in a very different way than you'd find in a more traditional Soulslike game. This is where the Diablo-like ARPG elements come in. Lots and lots of randomized gear of different rarities, and there is also gear crafting. A multitude of different gear sets that come with their own bonuses are also present. Exactly like you'd expect from a Diablo-style ARPG. \n\nYou do not get a weapon and a set of armor and then stick with it for the rest of the game. You will want to get new weapons and new armor on a regular basis. You will play this game as if it were a more traditional Soulslike at your own peril. Play it like Grim Dawn instead of Lords of the Fallen.\n\nOne thing that I'm more neutral on is the story. It takes place in the Sengoku Era and includes iconic figures from Japanese history such as Oda Nobunaga and Toyotomi Hideyoshi, and these are very much relevant to the plot (especially Hideyoshi). Then as a bonus it throws in a lot of supernatural and spiritual elements from Japanese folklore and mythology into the mix. \n\nSo you'd think that this whole setting would be perfect for an incredible story. But the overall presentation kind of falls flat in my opinion. It all appear like a selection of historical events that, while they progress in chronological order, still feel somehow like they were randomly thrown together. And then your own character, the random no-name character that you just created out of thin air, is awkwardly hamfisted in between all these renowned historical figures.\n\nBut I generally do not play these types of games for the story so I didn't bother to look into all the subtext, and therefore I opted to remain neutral towards it.\n\nNow visually the whole setting truly comes to life. I personally love how the historical and folklorist/mythological elements are woven into one another. The game oozes atmosphere, especially on the larger and more complex maps. I think the game aged very well. Yet another piece of evidence in favor of the idea that art style can carry the visuals of a game far further into the future than pure graphical fidelity can.\n\nAnd last but not least, while I'm not at that point in the game yet, there is a very extensive endgame grind at the end of the story. The DLCs included with this edition of the game expand on this endgame. So if you love grinding and optimizing gear and learning the ins and outs of your preferred weapons and abilities, and put it all to the test against overwhelming odds then there is certainly fun to be had in this game. And then there is also NG+. So lots of replayability and plenty of chances to try out different builds and playstyles.\n\nThere is no PvP. But you can fight against Revenants, which are basically copies of other players left behind after they die. There is a sort of clan system that mostly exists to provide some useful passive QoL bonuses. You can fight these Revenants to increase your score and increase your passive bonuses. There is Co-Op and you can voluntarly leave bind a copy of yourself in three maps of your choice that other players can summon to help them out.\n\nAll things considered, I will say that I personally highly recommend this game. I think it's very fun and sets itself apart from other games very nicely. The mixture of Japanese history and Folklore/Mythology provides a very distinct style and atmosphere that I personally really like.\n\nI give this game a score of 9/10.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "a great game with a variety of weapons and magic to choose from. for some reason though, it kept crashing my pc every time i tried to quit to desktop. Still, i played it nonetheless.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game was played in its entirety on a Steam Deck.\n\nI can't believe I never wrote a review for this. Probably one of my proudest Perfects.\n\nI really loved the first Nioh, though I did not play it on Steam, and I'm not sure I'm going to revisit it since they are both hand-killers.\n\nI was super excited when my partner and I got the sequel, and it mostly surpasses the original in every way, though there are a few negatives.\n\nUnfortunately, most of the negatives hit you right up-front. The story (well, at least until the halfway mark) is not as strong as the first. Towards the end, I felt that it surpassed Nioh 1.\n\nIt also doesn't play the best on a Steam Deck, though I completed the game entirely on that device. The resolution has to be kept very low, and it's still pretty blurry. It was enjoyable to me to play this on a large screen tv, but not everyone will share my taste for this.\n\nInventory Management is very bad, much worse than the first game, and you will encounter this fairly early into the game, and it will remain a pain throughout your playtime. Towards the end, I basically just kept a lookout for a few particular sets, and had to smash everything in one go to save both my sanity and my hands. I probably lost a lot of good equipment that way. \n\nThe last negative is that I did not like the changes to magic/livingweapon/spirits (I forget all of the terminology, I apologize). It made them tied to the gear too much, and coupled with the inventory management, I wound up again just not changing too much here once I found things I liked.\n\nSomething that I would say is neither a pro or a con is the difficulty. It's gravely difficult, so difficult many people will quit early on, but I don't think it's unfair. Conversely, I think the difficulty is unbelievably balanced and rewarding. You will feel yourself getting better and you will see the results in-game. I would say that a few of the final fights (and final dlc fights) are just kinda ridiculous and I'm glad I did not grind those for gear haha!\n\nFor difficulty references, I am kind of all over the place. I found Elden Ring super easy and got 100%, but Vernal Edge might be the hardest game ever for me!\n\nNow to the positives!\n\nThe graphics, though heavily damaged on the Steam Deck, are still gorgeous. The game has a sense of grandeur and scale that almost no other game does (though Nioh 1 also did this really well!). You will frequently overlook huge vistas of sprawling shanty-towns, rolling hills, and warped crystalline structures. I don't want to spoil too much of the end-game locations, but fans of the first game can expect the same AND MORE!\n\nThe maps are crazy-good. Master class. You might find an odd glitch or fall through a texture every now and then (very rare), but there is just so much to like about these maps. They are logically laid out and always varied enough that you can orient yourself quite easily (most of the time) just by visual landmarks. Maps progress logically, telling a story. There are numerous little hidden alcoves and nooks and fake walls. And there are hints a-plenty to almost all of them. The maps are just amazing in this game.\n\nThe combat is I guess the last thing I can talk about. And that's a good thing, because the combat is even better than the maps. Once you get into a groove, it just sings. Two enemies at once are a death sentence in your first hour. Ten hours later, you will be ambushed by five ninjas and 2 ogres and a snake miniboss in a room the size of an elevator, and also the floor is lava, and you'll casually check your ninjitsu loadout numbers and just smirk. It's a testament to the combat system that I cannot pick a favorite weapon. I also cannot pick a least favorite weapon. I played every weapon and I enjoyed each one. They are all so different and unique and it was truly a joy unlocking ALL (yes, I'm crazy) of the arts for every weapon!\n\nI guess one final thing is, don't play this if you like your hands. They will be mean to you after this game.\n\nAnd also, thank you for reading this far!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good lord do i LOVE this game!\n\nMastering different weapons is so rewarding and engaging, the stances and pulses are like a drug that hurts so good. Enemies do get a lil repetitive as you go on, but bosses are solidddd.\n\nI've played all the souls games and then some and I happily put nioh in the top 5, it's so solid.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Made me learn speed running because the levels were interesting and the combat absolutely rocks. Great foundation for 3. Good game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Nioh 2 has really fun, layered combat, and the build variety is a big part of why it hooked me. Every weapon plays differently, and messing around with different setups keeps the game fresh as you learn the ropes.\n\nThe early hours are rough — the controls feel odd at first, and the game throws a lot at you. Inventory management can get annoying too. But once things start to click, it becomes genuinely rewarding.\n\nIf you’re into Souls-likes and enjoy deep combat with tons of build options, it’s an easy one to recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of my GOATs. It's old now, very old. From the get go, it had great graphics for its time, but not just that, it had absolutely, insanely well optimized graphics. You could run it on high with a 1060 and have zero problems, that kind of optimization is somewhat lacking in Team Ninja's more recent ventures. Beyond that, the replayability is immense. Multiple NG+ tiers each with their own scaling and introducing more loot tiers and new sets as you dig deeper. Finishing NG is just the start. Then you get into NG+ and start tuning weapons, farming for endgame sets, memorizing boss move pools, etc. While it doesn't have the open world nature of a more traditional Souls-like, the linear, level-like layout allows them to have absolutely stellar and tight level design and layouts, and frankly the only blemish on the game's levels is their occasional reuse for smaller side missions. I won't begrudge them that though, since they added multiple new weapon types, discoverable secret moves, and full character customization in their second iteration of Nioh.\n\nI'm writing this belatedly, after having platinum'd the game on PS4 and sunk more than 200 hours into it on PC as well. If you're at all a fan of Souls-likes and you haven't tried Nioh 2 yet, you're missing out on one of the greatest Souls-likes ever made. The customization is fantastic, the challenge is there, and the multiplayer actually functions properly. (Unlike most every FromSoft game ever made.)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the only good games to come out of the Souls genre, and maybe that's because it doesn't just steal the mechanics from a souls game. I should clarify, all of the Dark Souls games and Fromsoft that are souls likes are usually great, but in my experience, out of the infinite wave of games that copied the genre, this was one of the only few good ones. For instance, the combat is rather similar to that of Ghost of Tsushima and even Monster Hunter in some aspects. The theme is also pretty unique for a somewhat \"modern\" game. You don't see too many games about killing Yokai. The visuals here are also quite nice, and co-op is pretty good. All in all, just an upgrade to a typical souls-like. If you liked any of the Dark Souls games (especially the first one), this game would probably be right up your ally. Unless you have a tendency for not being able to handle dying in a game, but then I don't know why you would want to play this.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Starts promising but quickly falls into the same pitfalls as Nioh 1. It's even hard to call it a proper sequel, with the amount of reused enemies, bosses, and maps. The game feels more like Nioh 1.5. Here are some of the biggest issues:\n* Game still throws at you a massive amount of trash loot that you then have to dispose of manually. Searching for a particular piece of equipment is a real pain in the ass, especially when you try to get set bonuses.\n* It feels like around half of the enemies are reused from the previous game with a very little change to them. There are also reused bosses and maps, but to a much lesser degree.\n* Main missions format feels stale, especially after completing Nioh 1. Nothing interesting happens during missions. In the first game, at least there were some events like for example battlefields.\n* I didn't like the way you get proficiency points. To get any meaningful progress in onmyo or ninjutsu tree you have to spam abilities all the time. It's also hard to try a new weapon type. You can't just relocate points, you have to start from the scratch.\n * I liked the enemy design at first, but it gets more and more stupid as you progress the game, with the final dlc being a cherry on top. Some of them are REALLY annoying and tiresome to deal with.\n* Yokai bosses were mostly great, but human bosses are trash. They don't seem to play by the same rules. For example, they can regenerate ki while being hit, cast spells without interruption, be unstaggered as they like, or just throw at you an instant grab attack.\n* Enemy placement is terrible, with constant ambushes every 10m. It makes exploring levels a slog.\n\nSome positives worth mentioning:\n* Story got better, same with the characters.\n* Improved combat - more moves, spells, yokai shift is much better and fun than living weapon from Nioh 1.\n* Overall well designed yokai bosses.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Hey guys, this is not a good game. If you want to grind for no reward, and build a set for negligible gains, go ahead and play it. Worst balancing in any souls-like game in existence.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nioh 2 is a game where you play as a sickly anemia patient with chronic fatigue. Feel the exhilaration of waiting 3-5 business days for your stamina to refill after swinging your sword two times. Revel in the excitement of watching your entire stamina bar disappear halfway through dodging a single combo.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "To be clear, I am on the fence with this game. Yes, I did \"beat\" NG+1. No, I did not love every minute of Nioh 2. If I wasn't playing co-op I would have dropped Nioh 2 after the credits rolled. For every thing that Nioh 2 does really well, it does something else equally horribly wrong. The level design is way more involved and intentional than in Dark Souls, but these levels are also really long and it's easy to miss collectables or side-quest tasks. Equipment is interesting yet not restricting in what you can use, but getting a specific kind of weapon means potentially hours of grinding for recipes. \n\nThe most prominent thing about Nioh is the combat, and here its a mixed bag as well. There are lots of cool active skills, but only one or two per weapon (anything that can kick, especially) are really good, and you will SPAM them. Burst counters should reward reactions and timing, but those timings are inconsistent: am I supposed to burst when this guy right away, or when he dashes at me, or when he tries to slash me? Get it wrong and you'll INSTANTLY DIE. This game is definitely a victim of \"hard = good\", enemy ambushes that can kill you in two hits. Enemies randomly get hyper armor and kill you in two hits. Enemies have unreactable command grabs which nearly kills you and leaves you vulnerable to a follow-up. Run out of ki and instantly die. Get paralyzed by a goblin during your OWN critical hit animation and instantly die. I hated the dojo fights, as well.\n\nI beat all of NG+0 by doing light attacks->stance change ki pulse->repeat or kick->stagger->iai slash->grapple->repeat. The stance system's only obvious use is to hit Yokai weak points and maybe(?) high attacks breaking guards easier. If there are nuances to the three stances, they aren't explained well. Low stance is \"defensive\" but high stance has the most usable roll. High stance is \"aggressive\" but its attacks are suited for poking where low stance has fast attacks that let you play close to the enemy.\n\nWhile it's nice that NG+ actually adds content in Nioh 2, once I hit NG+2 (Dream of the Demon) I decided I was done with the game. I blasted through the NG+1 final boss, so I thought I was going to be fine in NG+2, oh how wrong I was. The enemies become far too tanky and you are basically required to either master the game like it's your crack addiction, or abuse damage multipliers from skills/confusion to progress. The entire NG+0 could be beaten by playing smart and just using regular attacks, but in NG+ it's gimmick city. It's a shame, because apparently there's even MORE content in the later NG+ cycles, but I cannot be bothered anymore.\n\nOverall it took me about 60 hours to beat the main story and half of the side missions, have not done the DLC. I thought the actual plot was cool, if a little rushed by the end. I'm not a history buff, but I thought the pseudo-historical retelling was cool and reflected the concept of the Nio (folklore) well. If you agree with the sentiment that \"hard = good\" then give Nioh 2 a try, but I honestly think the vast majority of people will be better off not spending so much of their time trying to master a game that doesn't respect yours. This is an exhausting game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Massive frame rate issues no matter how interesting it may be. I'm told it worked fine until 2023, what a shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nioh 2 started with so much promise. I was really feeling this game until the repetitiveness turned the game from fun to boring. Playing basically the same level and facing the same ten enemies over and over again for almost 20 hours was enough for me. The story doesn't do the game any favors either. It's a shame because the gameplay and RPG elements are on point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was to hard and unplayable in multiplayer without previous experience playing this type of combat. the multiplayer enemy scaling is too much and even random mobs take too many hits to kill without running out of stamina. would not recommend for multiplayer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "another team ninja game . if u have played it before u know what you are getting into , one trillion buttons at the right frame and the game is pretty cool , if ur trash like me who  can press only million u are in for very hard time . welp i had forgotten what was this game good thing didnt order the next one . this is the last one for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Much potential\r\nToo many bugs and player-unfriendly\r\nMonsters always get priority\r\nGet rekt\r\nMultiplayer makes it worse\r\n2/10 meows",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just an absolute waste of time and money. Bosses do unreal damage to the player, while it takes the player 100 combos to kill the boss. \n\nJFC man.\n\nThere are so few genuinely good souls-likes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is:\n- the same enemies in every new region (also DLC)\n- reusing the same maps over and over again \n- enemies guard can block meteorites and nuclear weapons\n- no idea for new boss fight? - fight Otakemaru 4129492149 times\n- NPCs are always extremely useless when helping you but turn out extremely powerful after they betray you and fight you\n- there is some yellow costume homeless guy who is bothering you all the time during the main game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Short answer: it is a frustration simulator that makes you burn time for nothing.\n\nA liitle more detailed: The difficulty spikes all the time, you are never strong enough to do anything, it is all about struggle without any reward. The map design is made in a way for you to get lost, die in dumb ways, be grabbed by not dodgeable attacks at blind spots, to make you fell bad. Not only that, why did they have to make the dark realm be so hard to see anything? Ah, that's enough, a real shame since the combat feels so good, this game is not about challenge, it is just a hard try to surpass the first game (that is much more fair).\n\n#HateTokichiro",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Janky combat, lack of weapon feel. no idea why the voice is in japanese, I have seen videos with it in english, but no settings found?\nGame seems overcomplicated in a bad way\nnowhere near as bad as the 1st one though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game's graphics are too terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game caught me at a very chinese time in my life 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starts promising but quickly falls into the same pitfalls as Nioh 1. It's even hard to call it a proper sequel, with the amount of reused enemies, bosses, and maps. The game feels more like Nioh 1.5. Here are some of the biggest issues:\n* Game still throws at you a massive amount of trash loot that you then have to dispose of manually. Searching for a particular piece of equipment is a real pain in the ass, especially when you try to get set bonuses.\n* It feels like around half of the enemies are reused from the previous game with a very little change to them. There are also reused bosses and maps, but to a much lesser degree.\n* Main missions format feels stale, especially after completing Nioh 1. Nothing interesting happens during missions. In the first game, at least there were some events like for example battlefields.\n* I didn't like the way you get proficiency points. To get any meaningful progress in onmyo or ninjutsu tree you have to spam abilities all the time. It's also hard to try a new weapon type. You can't just relocate points, you have to start from the scratch.\n * I liked the enemy design at first, but it gets more and more stupid as you progress the game, with the final dlc being a cherry on top. Some of them are REALLY annoying and tiresome to deal with.\n* Yokai bosses were mostly great, but human bosses are trash. They don't seem to play by the same rules. For example, they can regenerate ki while being hit, cast spells without interruption, be unstaggered as they like, or just throw at you an instant grab attack.\n* Enemy placement is terrible, with constant ambushes every 10m. It makes exploring levels a slog.\n\nSome positives worth mentioning:\n* Story got better, same with the characters.\n* Improved combat - more moves, spells, yokai shift is much better and fun than living weapon from Nioh 1.\n* Overall well designed yokai bosses.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Hey guys, this is not a good game. If you want to grind for no reward, and build a set for negligible gains, go ahead and play it. Worst balancing in any souls-like game in existence.\n\nEdit: Hey guys, the game is still not good, but I am playing it again. Frick my fricking chungus life.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It throws too much stuff at you right from the start. You must bring your A game or you will just die over and over again. I just can't be bothered.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "10/10 Best asthma simulator 2021\n\nI love the different stances and customizable combos, more games should offer this depth. \nHowever... \n\nPlaying feels not rewarding. Stats are useless. You will deal no damage, mobs will 2-tap you, boss will one-shot you (or stun-lock you and one-shot you anyway). All the while, this game has the biggest HP sponges I ever saw, on common enemies (I'm talking MMO's style HP sponges here: about 100 hits for a boss, multiple combos for a field boss).\n\nAll these moves and combos made almost pointless by the infinite or on-demand poise of enemies. Meanwhile, you will get staggered and combo-ed to oblivion by enemies so fast you'll have a fraction of a second to react, face insta-grabs for one shots, oftentimes by teams and waves. Worth mention also would be the mission where you fight slower teams instead, such as Gozuki and Mezuki (the cow and horse bosses) at the same time. Like, WT...\n\nTelegraphing is abysmal. Camera is abysmal. Therefore, grabs and attacks are oftentimes inevitable. Enemies can input-read to chain spams, making healing or casting a liability.\n\nTeam Ninja copied something they didn't even try to understand. Enjoying flailing your wet noodles at 1-2 shotting packs of mobs for hours on end or go back to play From Software games. I will never give these Devs another cent.\n\n\nTL;DR: enemies are playing with hacks on; lovely combos, but the game is sadly BS.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love the atmosphere of the game and the great setting - killing Yōkai as a samurai/ninja is just awesome.\nBUT the game mechanics and controls are way too complicated for its own good. Each button has been mapped three or four times requiring combinations and it doesn't help that the controls are counterintuitive.\nEven the lowliest of enemies are bullet sponges requiring five or more hits to kill while you go down in two hits. Bosses take forever to whittle down with their ridiculously high health pools. Add to it the attack speed of the game it just kills all the fun for me. I've played hard games before (I've beaten Bloodborne with all optional bosses), but this is just ridiculously hard and most of it comes down to horrible controls (controller is bad, keyboard and mouse is even worse) and way too many gimmicky game mechanics. It's a game clearly made for the controller but with too many actions for the limited amount of buttons.\nWhile NIOH 2 is definitely not a bad game, and more skilled players might love it, to me it plays like a chore. I can't say I had fun playing it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nioh 2 is a game where you play as a sickly anemia patient with chronic fatigue. Feel the exhilaration of waiting 3-5 business days for your stamina to refill after swinging your sword two times. Revel in the excitement of watching your entire stamina bar disappear halfway through dodging a single combo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is my second try trying to like this game, but it's just not for me. I don't like games that disrespect your time. And I think this is one of them. I don't like the re-used maps, the mission based progression etc. I've bought the complete edition, but I never got to the DLCs, because I can't be bothered. I don't like the enemy design really, the story is very meh, so I wasn't even sure why was I playing it, so I stopped. Good thing, because now I know not to get hyped for Nioh 3, as this is just not my type of game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so Buttcheck NO MATTER HOW HARD OU RECOVER YOUR ki in that stupid dark relm it stay the same and your pretty 1 shot . i swear i might die from this game cause my head hurt like crazy and it feel like im gonna KILL MY SELF  i will never recommend this game to anyone . These cretor are weird as hell. i hope all lose money and get broke im for real . i also cant even team up with ppl bc this game will nvr connect TRASH GAME!!!!!. ID spit on it if it was physical copy. This game is literally Terminal cancer and i feel like this game can give Brain cancer if you continue to play it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To be clear, I am on the fence with this game. Yes, I did \"beat\" NG+1. No, I did not love every minute of Nioh 2. If I wasn't playing co-op I would have dropped Nioh 2 after the credits rolled. For every thing that Nioh 2 does really well, it does something else equally horribly wrong. The level design is way more involved and intentional than in Dark Souls, but these levels are also really long and it's easy to miss collectables or side-quest tasks. Equipment is interesting yet not restricting in what you can use, but getting a specific kind of weapon means potentially hours of grinding for recipes. \n\nThe most prominent thing about Nioh is the combat, and here its a mixed bag as well. There are lots of cool active skills, but only one or two per weapon (anything that can kick, especially) are really good, and you will SPAM them. Burst counters should reward reactions and timing, but those timings are inconsistent: am I supposed to burst when this guy right away, or when he dashes at me, or when he tries to slash me? Get it wrong and you'll INSTANTLY DIE. This game is definitely a victim of \"hard = good\", enemy ambushes that can kill you in two hits. Enemies randomly get hyper armor and kill you in two hits. Enemies have unreactable command grabs which nearly kills you and leaves you vulnerable to a follow-up. Run out of ki and instantly die. Get paralyzed by a goblin during your OWN critical hit animation and instantly die. I hated the dojo fights, as well.\n\nI beat all of NG+0 by doing light attacks->stance change ki pulse->repeat or kick->stagger->iai slash->grapple->repeat. The stance system's only obvious use is to hit Yokai weak points and maybe(?) high attacks breaking guards easier. If there are nuances to the three stances, they aren't explained well. Low stance is \"defensive\" but high stance has the most usable roll. High stance is \"aggressive\" but its attacks are suited for poking where low stance has fast attacks that let you play close to the enemy.\n\nWhile it's nice that NG+ actually adds content in Nioh 2, once I hit NG+2 (Dream of the Demon) I decided I was done with the game. I blasted through the NG+1 final boss, so I thought I was going to be fine in NG+2, oh how wrong I was. The enemies become far too tanky and you are basically required to either master the game like it's your crack addiction, or abuse damage multipliers from skills/confusion to progress. The entire NG+0 could be beaten by playing smart and just using regular attacks, but in NG+ it's gimmick city. It's a shame, because apparently there's even MORE content in the later NG+ cycles, but I cannot be bothered anymore.\n\nOverall it took me about 60 hours to beat the main story and half of the side missions, have not done the DLC. I thought the actual plot was cool, if a little rushed by the end. I'm not a history buff, but I thought the pseudo-historical retelling was cool and reflected the concept of the Nio (folklore) well. If you agree with the sentiment that \"hard = good\" then give Nioh 2 a try, but I honestly think the vast majority of people will be better off not spending so much of their time trying to master a game that doesn't respect yours. This is an exhausting game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Massive frame rate issues no matter how interesting it may be. I'm told it worked fine until 2023, what a shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nioh 2 started with so much promise. I was really feeling this game until the repetitiveness turned the game from fun to boring. Playing basically the same level and facing the same ten enemies over and over again for almost 20 hours was enough for me. The story doesn't do the game any favors either. It's a shame because the gameplay and RPG elements are on point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game design includes looking on the internet for an explanation about the game mechanics. How do you guys make money at this?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was to hard and unplayable in multiplayer without previous experience playing this type of combat. the multiplayer enemy scaling is too much and even random mobs take too many hits to kill without running out of stamina. would not recommend for multiplayer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "another team ninja game . if u have played it before u know what you are getting into , one trillion buttons at the right frame and the game is pretty cool , if ur trash like me who  can press only million u are in for very hard time . welp i had forgotten what was this game good thing didnt order the next one . this is the last one for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is:\n- the same enemies in every new region (also DLC)\n- reusing the same maps over and over again \n- enemies guard can block meteorites and nuclear weapons\n- no idea for new boss fight? - fight Otakemaru 4129492149 times\n- NPCs are always extremely useless when helping you but turn out extremely powerful after they betray you and fight you\n- there is some yellow costume homeless guy who is bothering you all the time during the main game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Just an absolute waste of time and money. Bosses do unreal damage to the player, while it takes the player 100 combos to kill the boss. \n\nJFC man.\n\nThere are so few genuinely good souls-likes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Janky combat, lack of weapon feel. no idea why the voice is in japanese, I have seen videos with it in english, but no settings found?\nGame seems overcomplicated in a bad way\nnowhere near as bad as the 1st one though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game's graphics are too terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't think I've ever been more frustrated starting a videogame than I have been with this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game caught me at a very chinese time in my life 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't play with odachi",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So far mainly annoying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starts promising but quickly falls into the same pitfalls as Nioh 1. It's even hard to call it a proper sequel, with the amount of reused enemies, bosses, and maps. The game feels more like Nioh 1.5. Here are some of the biggest issues:\n* Game still throws at you a massive amount of trash loot that you then have to dispose of manually. Searching for a particular piece of equipment is a real pain in the ass, especially when you try to get set bonuses.\n* It feels like around half of the enemies are reused from the previous game with a very little change to them. There are also reused bosses and maps, but to a much lesser degree.\n* Main missions format feels stale, especially after completing Nioh 1. Nothing interesting happens during missions. In the first game, at least there were some events like for example battlefields.\n* I didn't like the way you get proficiency points. To get any meaningful progress in onmyo or ninjutsu tree you have to spam abilities all the time. It's also hard to try a new weapon type. You can't just relocate points, you have to start from the scratch.\n * I liked the enemy design at first, but it gets more and more stupid as you progress the game, with the final dlc being a cherry on top. Some of them are REALLY annoying and tiresome to deal with.\n* Yokai bosses were mostly great, but human bosses are trash. They don't seem to play by the same rules. For example, they can regenerate ki while being hit, cast spells without interruption, be unstaggered as they like, or just throw at you an instant grab attack.\n* Enemy placement is terrible, with constant ambushes every 10m. It makes exploring levels a slog.\n\nSome positives worth mentioning:\n* Story got better, same with the characters.\n* Improved combat - more moves, spells, yokai shift is much better and fun than living weapon from Nioh 1.\n* Overall well designed yokai bosses.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Hey guys, this is not a good game. If you want to grind for no reward, and build a set for negligible gains, go ahead and play it. Worst balancing in any souls-like game in existence.\n\nEdit: Hey guys, the game is still not good, but I am playing it again. Frick my fricking chungus life.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It throws too much stuff at you right from the start. You must bring your A game or you will just die over and over again. I just can't be bothered.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "10/10 Best asthma simulator 2021\n\nI love the different stances and customizable combos, more games should offer this depth. \nHowever... \n\nPlaying feels not rewarding. Stats are useless. You will deal no damage, mobs will 2-tap you, boss will one-shot you (or stun-lock you and one-shot you anyway). All the while, this game has the biggest HP sponges I ever saw, on common enemies (I'm talking MMO's style HP sponges here: about 100 hits for a boss, multiple combos for a field boss).\n\nAll these moves and combos made almost pointless by the infinite or on-demand poise of enemies. Meanwhile, you will get staggered and combo-ed to oblivion by enemies so fast you'll have a fraction of a second to react, face insta-grabs for one shots, oftentimes by teams and waves. Worth mention also would be the mission where you fight slower teams instead, such as Gozuki and Mezuki (the cow and horse bosses) at the same time. Like, WT...\n\nTelegraphing is abysmal. Camera is abysmal. Therefore, grabs and attacks are oftentimes inevitable. Enemies can input-read to chain spams, making healing or casting a liability.\n\nTeam Ninja copied something they didn't even try to understand. Enjoying flailing your wet noodles at 1-2 shotting packs of mobs for hours on end or go back to play From Software games. I will never give these Devs another cent.\n\n\nTL;DR: enemies are playing with hacks on; lovely combos, but the game is sadly BS.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love the atmosphere of the game and the great setting - killing Yōkai as a samurai/ninja is just awesome.\nBUT the game mechanics and controls are way too complicated for its own good. Each button has been mapped three or four times requiring combinations and it doesn't help that the controls are counterintuitive.\nEven the lowliest of enemies are bullet sponges requiring five or more hits to kill while you go down in two hits. Bosses take forever to whittle down with their ridiculously high health pools. Add to it the attack speed of the game it just kills all the fun for me. I've played hard games before (I've beaten Bloodborne with all optional bosses), but this is just ridiculously hard and most of it comes down to horrible controls (controller is bad, keyboard and mouse is even worse) and way too many gimmicky game mechanics. It's a game clearly made for the controller but with too many actions for the limited amount of buttons.\nWhile NIOH 2 is definitely not a bad game, and more skilled players might love it, to me it plays like a chore. I can't say I had fun playing it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nioh 2 is a game where you play as a sickly anemia patient with chronic fatigue. Feel the exhilaration of waiting 3-5 business days for your stamina to refill after swinging your sword two times. Revel in the excitement of watching your entire stamina bar disappear halfway through dodging a single combo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is my second try trying to like this game, but it's just not for me. I don't like games that disrespect your time. And I think this is one of them. I don't like the re-used maps, the mission based progression etc. I've bought the complete edition, but I never got to the DLCs, because I can't be bothered. I don't like the enemy design really, the story is very meh, so I wasn't even sure why was I playing it, so I stopped. Good thing, because now I know not to get hyped for Nioh 3, as this is just not my type of game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so Buttcheck NO MATTER HOW HARD OU RECOVER YOUR ki in that stupid dark relm it stay the same and your pretty 1 shot . i swear i might die from this game cause my head hurt like crazy and it feel like im gonna KILL MY SELF  i will never recommend this game to anyone . These cretor are weird as hell. i hope all lose money and get broke im for real . i also cant even team up with ppl bc this game will nvr connect TRASH GAME!!!!!. ID spit on it if it was physical copy. This game is literally Terminal cancer and i feel like this game can give Brain cancer if you continue to play it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To be clear, I am on the fence with this game. Yes, I did \"beat\" NG+1. No, I did not love every minute of Nioh 2. If I wasn't playing co-op I would have dropped Nioh 2 after the credits rolled. For every thing that Nioh 2 does really well, it does something else equally horribly wrong. The level design is way more involved and intentional than in Dark Souls, but these levels are also really long and it's easy to miss collectables or side-quest tasks. Equipment is interesting yet not restricting in what you can use, but getting a specific kind of weapon means potentially hours of grinding for recipes. \n\nThe most prominent thing about Nioh is the combat, and here its a mixed bag as well. There are lots of cool active skills, but only one or two per weapon (anything that can kick, especially) are really good, and you will SPAM them. Burst counters should reward reactions and timing, but those timings are inconsistent: am I supposed to burst when this guy right away, or when he dashes at me, or when he tries to slash me? Get it wrong and you'll INSTANTLY DIE. This game is definitely a victim of \"hard = good\", enemy ambushes that can kill you in two hits. Enemies randomly get hyper armor and kill you in two hits. Enemies have unreactable command grabs which nearly kills you and leaves you vulnerable to a follow-up. Run out of ki and instantly die. Get paralyzed by a goblin during your OWN critical hit animation and instantly die. I hated the dojo fights, as well.\n\nI beat all of NG+0 by doing light attacks->stance change ki pulse->repeat or kick->stagger->iai slash->grapple->repeat. The stance system's only obvious use is to hit Yokai weak points and maybe(?) high attacks breaking guards easier. If there are nuances to the three stances, they aren't explained well. Low stance is \"defensive\" but high stance has the most usable roll. High stance is \"aggressive\" but its attacks are suited for poking where low stance has fast attacks that let you play close to the enemy.\n\nWhile it's nice that NG+ actually adds content in Nioh 2, once I hit NG+2 (Dream of the Demon) I decided I was done with the game. I blasted through the NG+1 final boss, so I thought I was going to be fine in NG+2, oh how wrong I was. The enemies become far too tanky and you are basically required to either master the game like it's your crack addiction, or abuse damage multipliers from skills/confusion to progress. The entire NG+0 could be beaten by playing smart and just using regular attacks, but in NG+ it's gimmick city. It's a shame, because apparently there's even MORE content in the later NG+ cycles, but I cannot be bothered anymore.\n\nOverall it took me about 60 hours to beat the main story and half of the side missions, have not done the DLC. I thought the actual plot was cool, if a little rushed by the end. I'm not a history buff, but I thought the pseudo-historical retelling was cool and reflected the concept of the Nio (folklore) well. If you agree with the sentiment that \"hard = good\" then give Nioh 2 a try, but I honestly think the vast majority of people will be better off not spending so much of their time trying to master a game that doesn't respect yours. This is an exhausting game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Massive frame rate issues no matter how interesting it may be. I'm told it worked fine until 2023, what a shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nioh 2 started with so much promise. I was really feeling this game until the repetitiveness turned the game from fun to boring. Playing basically the same level and facing the same ten enemies over and over again for almost 20 hours was enough for me. The story doesn't do the game any favors either. It's a shame because the gameplay and RPG elements are on point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game design includes looking on the internet for an explanation about the game mechanics. How do you guys make money at this?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was to hard and unplayable in multiplayer without previous experience playing this type of combat. the multiplayer enemy scaling is too much and even random mobs take too many hits to kill without running out of stamina. would not recommend for multiplayer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "another team ninja game . if u have played it before u know what you are getting into , one trillion buttons at the right frame and the game is pretty cool , if ur trash like me who  can press only million u are in for very hard time . welp i had forgotten what was this game good thing didnt order the next one . this is the last one for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is:\n- the same enemies in every new region (also DLC)\n- reusing the same maps over and over again \n- enemies guard can block meteorites and nuclear weapons\n- no idea for new boss fight? - fight Otakemaru 4129492149 times\n- NPCs are always extremely useless when helping you but turn out extremely powerful after they betray you and fight you\n- there is some yellow costume homeless guy who is bothering you all the time during the main game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Just an absolute waste of time and money. Bosses do unreal damage to the player, while it takes the player 100 combos to kill the boss. \n\nJFC man.\n\nThere are so few genuinely good souls-likes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Janky combat, lack of weapon feel. no idea why the voice is in japanese, I have seen videos with it in english, but no settings found?\nGame seems overcomplicated in a bad way\nnowhere near as bad as the 1st one though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game's graphics are too terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't think I've ever been more frustrated starting a videogame than I have been with this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game caught me at a very chinese time in my life 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't play with odachi",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So far mainly annoying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starts promising but quickly falls into the same pitfalls as Nioh 1. It's even hard to call it a proper sequel, with the amount of reused enemies, bosses, and maps. The game feels more like Nioh 1.5. Here are some of the biggest issues:\n* Game still throws at you a massive amount of trash loot that you then have to dispose of manually. Searching for a particular piece of equipment is a real pain in the ass, especially when you try to get set bonuses.\n* It feels like around half of the enemies are reused from the previous game with a very little change to them. There are also reused bosses and maps, but to a much lesser degree.\n* Main missions format feels stale, especially after completing Nioh 1. Nothing interesting happens during missions. In the first game, at least there were some events like for example battlefields.\n* I didn't like the way you get proficiency points. To get any meaningful progress in onmyo or ninjutsu tree you have to spam abilities all the time. It's also hard to try a new weapon type. You can't just relocate points, you have to start from the scratch.\n * I liked the enemy design at first, but it gets more and more stupid as you progress the game, with the final dlc being a cherry on top. Some of them are REALLY annoying and tiresome to deal with.\n* Yokai bosses were mostly great, but human bosses are trash. They don't seem to play by the same rules. For example, they can regenerate ki while being hit, cast spells without interruption, be unstaggered as they like, or just throw at you an instant grab attack.\n* Enemy placement is terrible, with constant ambushes every 10m. It makes exploring levels a slog.\n\nSome positives worth mentioning:\n* Story got better, same with the characters.\n* Improved combat - more moves, spells, yokai shift is much better and fun than living weapon from Nioh 1.\n* Overall well designed yokai bosses.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Hey guys, this is not a good game. If you want to grind for no reward, and build a set for negligible gains, go ahead and play it. Worst balancing in any souls-like game in existence.\n\nEdit: Hey guys, the game is still not good, but I am playing it again. Frick my fricking chungus life.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It throws too much stuff at you right from the start. You must bring your A game or you will just die over and over again. I just can't be bothered.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "10/10 Best asthma simulator 2021\n\nI love the different stances and customizable combos, more games should offer this depth. \nHowever... \n\nPlaying feels not rewarding. Stats are useless. You will deal no damage, mobs will 2-tap you, boss will one-shot you (or stun-lock you and one-shot you anyway). All the while, this game has the biggest HP sponges I ever saw, on common enemies (I'm talking MMO's style HP sponges here: about 100 hits for a boss, multiple combos for a field boss).\n\nAll these moves and combos made almost pointless by the infinite or on-demand poise of enemies. Meanwhile, you will get staggered and combo-ed to oblivion by enemies so fast you'll have a fraction of a second to react, face insta-grabs for one shots, oftentimes by teams and waves. Worth mention also would be the mission where you fight slower teams instead, such as Gozuki and Mezuki (the cow and horse bosses) at the same time. Like, WT...\n\nTelegraphing is abysmal. Camera is abysmal. Therefore, grabs and attacks are oftentimes inevitable. Enemies can input-read to chain spams, making healing or casting a liability.\n\nTeam Ninja copied something they didn't even try to understand. Enjoying flailing your wet noodles at 1-2 shotting packs of mobs for hours on end or go back to play From Software games. I will never give these Devs another cent.\n\n\nTL;DR: enemies are playing with hacks on; lovely combos, but the game is sadly BS.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love the atmosphere of the game and the great setting - killing Yōkai as a samurai/ninja is just awesome.\nBUT the game mechanics and controls are way too complicated for its own good. Each button has been mapped three or four times requiring combinations and it doesn't help that the controls are counterintuitive.\nEven the lowliest of enemies are bullet sponges requiring five or more hits to kill while you go down in two hits. Bosses take forever to whittle down with their ridiculously high health pools. Add to it the attack speed of the game it just kills all the fun for me. I've played hard games before (I've beaten Bloodborne with all optional bosses), but this is just ridiculously hard and most of it comes down to horrible controls (controller is bad, keyboard and mouse is even worse) and way too many gimmicky game mechanics. It's a game clearly made for the controller but with too many actions for the limited amount of buttons.\nWhile NIOH 2 is definitely not a bad game, and more skilled players might love it, to me it plays like a chore. I can't say I had fun playing it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nioh 2 is a game where you play as a sickly anemia patient with chronic fatigue. Feel the exhilaration of waiting 3-5 business days for your stamina to refill after swinging your sword two times. Revel in the excitement of watching your entire stamina bar disappear halfway through dodging a single combo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is my second try trying to like this game, but it's just not for me. I don't like games that disrespect your time. And I think this is one of them. I don't like the re-used maps, the mission based progression etc. I've bought the complete edition, but I never got to the DLCs, because I can't be bothered. I don't like the enemy design really, the story is very meh, so I wasn't even sure why was I playing it, so I stopped. Good thing, because now I know not to get hyped for Nioh 3, as this is just not my type of game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so Buttcheck NO MATTER HOW HARD OU RECOVER YOUR ki in that stupid dark relm it stay the same and your pretty 1 shot . i swear i might die from this game cause my head hurt like crazy and it feel like im gonna KILL MY SELF  i will never recommend this game to anyone . These cretor are weird as hell. i hope all lose money and get broke im for real . i also cant even team up with ppl bc this game will nvr connect TRASH GAME!!!!!. ID spit on it if it was physical copy. This game is literally Terminal cancer and i feel like this game can give Brain cancer if you continue to play it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To be clear, I am on the fence with this game. Yes, I did \"beat\" NG+1. No, I did not love every minute of Nioh 2. If I wasn't playing co-op I would have dropped Nioh 2 after the credits rolled. For every thing that Nioh 2 does really well, it does something else equally horribly wrong. The level design is way more involved and intentional than in Dark Souls, but these levels are also really long and it's easy to miss collectables or side-quest tasks. Equipment is interesting yet not restricting in what you can use, but getting a specific kind of weapon means potentially hours of grinding for recipes. \n\nThe most prominent thing about Nioh is the combat, and here its a mixed bag as well. There are lots of cool active skills, but only one or two per weapon (anything that can kick, especially) are really good, and you will SPAM them. Burst counters should reward reactions and timing, but those timings are inconsistent: am I supposed to burst when this guy right away, or when he dashes at me, or when he tries to slash me? Get it wrong and you'll INSTANTLY DIE. This game is definitely a victim of \"hard = good\", enemy ambushes that can kill you in two hits. Enemies randomly get hyper armor and kill you in two hits. Enemies have unreactable command grabs which nearly kills you and leaves you vulnerable to a follow-up. Run out of ki and instantly die. Get paralyzed by a goblin during your OWN critical hit animation and instantly die. I hated the dojo fights, as well.\n\nI beat all of NG+0 by doing light attacks->stance change ki pulse->repeat or kick->stagger->iai slash->grapple->repeat. The stance system's only obvious use is to hit Yokai weak points and maybe(?) high attacks breaking guards easier. If there are nuances to the three stances, they aren't explained well. Low stance is \"defensive\" but high stance has the most usable roll. High stance is \"aggressive\" but its attacks are suited for poking where low stance has fast attacks that let you play close to the enemy.\n\nWhile it's nice that NG+ actually adds content in Nioh 2, once I hit NG+2 (Dream of the Demon) I decided I was done with the game. I blasted through the NG+1 final boss, so I thought I was going to be fine in NG+2, oh how wrong I was. The enemies become far too tanky and you are basically required to either master the game like it's your crack addiction, or abuse damage multipliers from skills/confusion to progress. The entire NG+0 could be beaten by playing smart and just using regular attacks, but in NG+ it's gimmick city. It's a shame, because apparently there's even MORE content in the later NG+ cycles, but I cannot be bothered anymore.\n\nOverall it took me about 60 hours to beat the main story and half of the side missions, have not done the DLC. I thought the actual plot was cool, if a little rushed by the end. I'm not a history buff, but I thought the pseudo-historical retelling was cool and reflected the concept of the Nio (folklore) well. If you agree with the sentiment that \"hard = good\" then give Nioh 2 a try, but I honestly think the vast majority of people will be better off not spending so much of their time trying to master a game that doesn't respect yours. This is an exhausting game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Massive frame rate issues no matter how interesting it may be. I'm told it worked fine until 2023, what a shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nioh 2 started with so much promise. I was really feeling this game until the repetitiveness turned the game from fun to boring. Playing basically the same level and facing the same ten enemies over and over again for almost 20 hours was enough for me. The story doesn't do the game any favors either. It's a shame because the gameplay and RPG elements are on point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game design includes looking on the internet for an explanation about the game mechanics. How do you guys make money at this?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was to hard and unplayable in multiplayer without previous experience playing this type of combat. the multiplayer enemy scaling is too much and even random mobs take too many hits to kill without running out of stamina. would not recommend for multiplayer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "another team ninja game . if u have played it before u know what you are getting into , one trillion buttons at the right frame and the game is pretty cool , if ur trash like me who  can press only million u are in for very hard time . welp i had forgotten what was this game good thing didnt order the next one . this is the last one for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is:\n- the same enemies in every new region (also DLC)\n- reusing the same maps over and over again \n- enemies guard can block meteorites and nuclear weapons\n- no idea for new boss fight? - fight Otakemaru 4129492149 times\n- NPCs are always extremely useless when helping you but turn out extremely powerful after they betray you and fight you\n- there is some yellow costume homeless guy who is bothering you all the time during the main game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Just an absolute waste of time and money. Bosses do unreal damage to the player, while it takes the player 100 combos to kill the boss. \n\nJFC man.\n\nThere are so few genuinely good souls-likes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Janky combat, lack of weapon feel. no idea why the voice is in japanese, I have seen videos with it in english, but no settings found?\nGame seems overcomplicated in a bad way\nnowhere near as bad as the 1st one though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game's graphics are too terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't think I've ever been more frustrated starting a videogame than I have been with this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game caught me at a very chinese time in my life 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't play with odachi",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So far mainly annoying.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starts promising but quickly falls into the same pitfalls as Nioh 1. It's even hard to call it a proper sequel, with the amount of reused enemies, bosses, and maps. The game feels more like Nioh 1.5. Here are some of the biggest issues:\n* Game still throws at you a massive amount of trash loot that you then have to dispose of manually. Searching for a particular piece of equipment is a real pain in the ass, especially when you try to get set bonuses.\n* It feels like around half of the enemies are reused from the previous game with a very little change to them. There are also reused bosses and maps, but to a much lesser degree.\n* Main missions format feels stale, especially after completing Nioh 1. Nothing interesting happens during missions. In the first game, at least there were some events like for example battlefields.\n* I didn't like the way you get proficiency points. To get any meaningful progress in onmyo or ninjutsu tree you have to spam abilities all the time. It's also hard to try a new weapon type. You can't just relocate points, you have to start from the scratch.\n * I liked the enemy design at first, but it gets more and more stupid as you progress the game, with the final dlc being a cherry on top. Some of them are REALLY annoying and tiresome to deal with.\n* Yokai bosses were mostly great, but human bosses are trash. They don't seem to play by the same rules. For example, they can regenerate ki while being hit, cast spells without interruption, be unstaggered as they like, or just throw at you an instant grab attack.\n* Enemy placement is terrible, with constant ambushes every 10m. It makes exploring levels a slog.\n\nSome positives worth mentioning:\n* Story got better, same with the characters.\n* Improved combat - more moves, spells, yokai shift is much better and fun than living weapon from Nioh 1.\n* Overall well designed yokai bosses.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Hey guys, this is not a good game. If you want to grind for no reward, and build a set for negligible gains, go ahead and play it. Worst balancing in any souls-like game in existence.\n\nEdit: Hey guys, the game is still not good, but I am playing it again. Frick my fricking chungus life.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It throws too much stuff at you right from the start. You must bring your A game or you will just die over and over again. I just can't be bothered.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "10/10 Best asthma simulator 2021\n\nI love the different stances and customizable combos, more games should offer this depth. \nHowever... \n\nPlaying feels not rewarding. Stats are useless. You will deal no damage, mobs will 2-tap you, boss will one-shot you (or stun-lock you and one-shot you anyway). All the while, this game has the biggest HP sponges I ever saw, on common enemies (I'm talking MMO's style HP sponges here: about 100 hits for a boss, multiple combos for a field boss).\n\nAll these moves and combos made almost pointless by the infinite or on-demand poise of enemies. Meanwhile, you will get staggered and combo-ed to oblivion by enemies so fast you'll have a fraction of a second to react, face insta-grabs for one shots, oftentimes by teams and waves. Worth mention also would be the mission where you fight slower teams instead, such as Gozuki and Mezuki (the cow and horse bosses) at the same time. Like, WT...\n\nTelegraphing is abysmal. Camera is abysmal. Therefore, grabs and attacks are oftentimes inevitable. Enemies can input-read to chain spams, making healing or casting a liability.\n\nTeam Ninja copied something they didn't even try to understand. Enjoying flailing your wet noodles at 1-2 shotting packs of mobs for hours on end or go back to play From Software games. I will never give these Devs another cent.\n\n\nTL;DR: enemies are playing with hacks on; lovely combos, but the game is sadly BS.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love the atmosphere of the game and the great setting - killing Yōkai as a samurai/ninja is just awesome.\nBUT the game mechanics and controls are way too complicated for its own good. Each button has been mapped three or four times requiring combinations and it doesn't help that the controls are counterintuitive.\nEven the lowliest of enemies are bullet sponges requiring five or more hits to kill while you go down in two hits. Bosses take forever to whittle down with their ridiculously high health pools. Add to it the attack speed of the game it just kills all the fun for me. I've played hard games before (I've beaten Bloodborne with all optional bosses), but this is just ridiculously hard and most of it comes down to horrible controls (controller is bad, keyboard and mouse is even worse) and way too many gimmicky game mechanics. It's a game clearly made for the controller but with too many actions for the limited amount of buttons.\nWhile NIOH 2 is definitely not a bad game, and more skilled players might love it, to me it plays like a chore. I can't say I had fun playing it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nioh 2 is a game where you play as a sickly anemia patient with chronic fatigue. Feel the exhilaration of waiting 3-5 business days for your stamina to refill after swinging your sword two times. Revel in the excitement of watching your entire stamina bar disappear halfway through dodging a single combo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is my second try trying to like this game, but it's just not for me. I don't like games that disrespect your time. And I think this is one of them. I don't like the re-used maps, the mission based progression etc. I've bought the complete edition, but I never got to the DLCs, because I can't be bothered. I don't like the enemy design really, the story is very meh, so I wasn't even sure why was I playing it, so I stopped. Good thing, because now I know not to get hyped for Nioh 3, as this is just not my type of game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so Buttcheck NO MATTER HOW HARD OU RECOVER YOUR ki in that stupid dark relm it stay the same and your pretty 1 shot . i swear i might die from this game cause my head hurt like crazy and it feel like im gonna KILL MY SELF  i will never recommend this game to anyone . These cretor are weird as hell. i hope all lose money and get broke im for real . i also cant even team up with ppl bc this game will nvr connect TRASH GAME!!!!!. ID spit on it if it was physical copy. This game is literally Terminal cancer and i feel like this game can give Brain cancer if you continue to play it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To be clear, I am on the fence with this game. Yes, I did \"beat\" NG+1. No, I did not love every minute of Nioh 2. If I wasn't playing co-op I would have dropped Nioh 2 after the credits rolled. For every thing that Nioh 2 does really well, it does something else equally horribly wrong. The level design is way more involved and intentional than in Dark Souls, but these levels are also really long and it's easy to miss collectables or side-quest tasks. Equipment is interesting yet not restricting in what you can use, but getting a specific kind of weapon means potentially hours of grinding for recipes. \n\nThe most prominent thing about Nioh is the combat, and here its a mixed bag as well. There are lots of cool active skills, but only one or two per weapon (anything that can kick, especially) are really good, and you will SPAM them. Burst counters should reward reactions and timing, but those timings are inconsistent: am I supposed to burst when this guy right away, or when he dashes at me, or when he tries to slash me? Get it wrong and you'll INSTANTLY DIE. This game is definitely a victim of \"hard = good\", enemy ambushes that can kill you in two hits. Enemies randomly get hyper armor and kill you in two hits. Enemies have unreactable command grabs which nearly kills you and leaves you vulnerable to a follow-up. Run out of ki and instantly die. Get paralyzed by a goblin during your OWN critical hit animation and instantly die. I hated the dojo fights, as well.\n\nI beat all of NG+0 by doing light attacks->stance change ki pulse->repeat or kick->stagger->iai slash->grapple->repeat. The stance system's only obvious use is to hit Yokai weak points and maybe(?) high attacks breaking guards easier. If there are nuances to the three stances, they aren't explained well. Low stance is \"defensive\" but high stance has the most usable roll. High stance is \"aggressive\" but its attacks are suited for poking where low stance has fast attacks that let you play close to the enemy.\n\nWhile it's nice that NG+ actually adds content in Nioh 2, once I hit NG+2 (Dream of the Demon) I decided I was done with the game. I blasted through the NG+1 final boss, so I thought I was going to be fine in NG+2, oh how wrong I was. The enemies become far too tanky and you are basically required to either master the game like it's your crack addiction, or abuse damage multipliers from skills/confusion to progress. The entire NG+0 could be beaten by playing smart and just using regular attacks, but in NG+ it's gimmick city. It's a shame, because apparently there's even MORE content in the later NG+ cycles, but I cannot be bothered anymore.\n\nOverall it took me about 60 hours to beat the main story and half of the side missions, have not done the DLC. I thought the actual plot was cool, if a little rushed by the end. I'm not a history buff, but I thought the pseudo-historical retelling was cool and reflected the concept of the Nio (folklore) well. If you agree with the sentiment that \"hard = good\" then give Nioh 2 a try, but I honestly think the vast majority of people will be better off not spending so much of their time trying to master a game that doesn't respect yours. This is an exhausting game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Massive frame rate issues no matter how interesting it may be. I'm told it worked fine until 2023, what a shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nioh 2 started with so much promise. I was really feeling this game until the repetitiveness turned the game from fun to boring. Playing basically the same level and facing the same ten enemies over and over again for almost 20 hours was enough for me. The story doesn't do the game any favors either. It's a shame because the gameplay and RPG elements are on point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game design includes looking on the internet for an explanation about the game mechanics. How do you guys make money at this?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was to hard and unplayable in multiplayer without previous experience playing this type of combat. the multiplayer enemy scaling is too much and even random mobs take too many hits to kill without running out of stamina. would not recommend for multiplayer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "another team ninja game . if u have played it before u know what you are getting into , one trillion buttons at the right frame and the game is pretty cool , if ur trash like me who  can press only million u are in for very hard time . welp i had forgotten what was this game good thing didnt order the next one . this is the last one for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is:\n- the same enemies in every new region (also DLC)\n- reusing the same maps over and over again \n- enemies guard can block meteorites and nuclear weapons\n- no idea for new boss fight? - fight Otakemaru 4129492149 times\n- NPCs are always extremely useless when helping you but turn out extremely powerful after they betray you and fight you\n- there is some yellow costume homeless guy who is bothering you all the time during the main game",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}