{
  "positive": [
    {
      "review": "This game seems fun and all but unfortunately my potato computer cannot run it, but seeing the gameplay from other youtubers I know I would like it even I was able to play",
      "voted_up": true,
      "votes_helpful": 37
    },
    {
      "review": "Do you have a fear of the dark? caves? water? cannibals? Swimming underwater in dark caves with cannibals outside? This game will either get you over those fears or cement them so firmly you'll never get over them.\r\n\r\nThis is a little pre-mature since I have not finished the storyline because I am playing through it co-op with friends. The game is worth the money and the jumpscares especially if you can do it co-op.\r\n\r\nPros:\r\n-Fun Co-op\r\n-Captivating \"what's going on here\" plot\r\n-Diversity of game play: it's a survival game, it's a hunting game, it's a base building game, it's an exploration game.\r\n\r\n\r\nCons:\r\n-It takes some messing around the understand the crafting, there is not a whole lot of handholding.\r\n-Building structures can be a bit janky. Suggest you mess around with it in a casual mode game where you aren't getting attacked all the time and experiment.\r\n-I can see it being a tough solo game. If you don't have friends who have the game, gift it to them and play together.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Great visuals, fun gameplay, and a solid experience whether you play solo or with friends. The world has decent biome variety, good weapon/armor options, and the caves make exploration genuinely exciting.\n\nBut the optimization is a real issue. I’m running an RTX 3060 12GB with an R5 3600 — both recommended specs — yet I can’t maintain a stable 60 FPS on high settings. GPU usage won’t go past ~60%, CPU sits around 30–35%, and even single-core usage stays under 75%. It clearly feels like an optimization problem, not hardware.\n\nAfter finishing the story, the game also loses direction and becomes mostly about gathering consumable resources with no meaningful late-game content.\n\nStill, despite the flaws, it’s a fun survival game with good value for its price. Recommended, but only if you can tolerate the performance issues for now.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "compared to the first one i prefer that one overall. the first one felt more creepy/scary. i do enjoy the building part in this one though. the graphics are really nice as all. still an awesome game both are worth playing",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Definitely fun if you want to play with a friend. You can build cool bases, explore, have jump-scares, fight cannibals and monsters, and enjoy a good story overall. But optimization isn’t the best, you will probably struggle on a lower-end PC.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I played through the story mode with my best friend, and it was one of the best multiplayer story game experiences we've ever had. Sometimes it felt like an advanced version of Minecraft, so it was like having flashbacks to the good old days.\nI definitely recommend it!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very fun game especially if you ARE not planning on joining other people's world and blowing up their base and /spawnitem log 100,000,000",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very fun game, might have murdered a key NPC but we ball. Also maybe the OTHER key NPC, but who's counting... \r\n\r\nGame was great, I would say it's better than the first forest game, looks incredible and the gameplay is smooth and kinda spooky when you go caving and whatnot.\r\n\r\nPick it up, it's a blast with friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game was really fun, graphics were pretty really good, gameplay was a little confusing but absolutely fun!! Me and my wife played this a lot, the only thing i could complain about is just the overly annoying part with how many times i went to bed in my cabin (That takes 5+ hrs to bld)  to have ppl in my house and destroy it and rebuild it 15x.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It’s creepy, beautiful, and addictive. The building system is super satisfying, the Klanker is surprisingly smart, and exploring the island with friends never gets old. Every night feels like a fight to survive, and every cave trip feels like an adventure. Easily one of the best survival games I’ve played in years.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This is a pretty incredible game. The map is huge, tunnel system is massive. Enemies are challenging and you need to be paying attention to win. The base building is probably the best system I've played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love playing sons of the forest with my friends and i think its a very good game considering the first one in my opinion was a bit underwhelming but i think endnight did a good job on this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Let me start off by saying that if you catch this game on sale, it's worth the purchase. At full price,  it's still a good game, but considering the bugs & glitches, it's not worth full price to me. Achievements are bugged and things happen occasionally like items dropped on the ground just vanishing never to be seen again. Sometimes it wont let you build in places that you know you should be able to. the NPCs are frustrating too, like standing in the fire and getting themselves killed for no reason.\nBeyond that, this game has a great air about it to create a real experience of being stranded on an island and having to survive. The building system is very wonky but you can build a few cool structures with it. Defending your base from enemies has a fun element to it. Most of the weapons are fun to use. Exploring caves is a curious and fun adventure. I highly suggest playing with friends or with a group. Not for the faint of heart to solo but it can be done if you're hardcore enough or good enough at escaping with your life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay: Yes.\r\nCo-op experience: Yes.\r\nStory: No, a thousand times over.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This perfect sequel to \"The Forest\" delighted me with every detail and the incredible survival gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sons of the Forest is an intense and immersive survival experience that I absolutely loved for its atmosphere and depth.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought it recently… already addicted 🔥🌲\r\n\r\nJust picked up Sons of the Forest not long ago and honestly? I didn’t expect it to be this fun. It’s creepy, beautiful, and kinda hilarious when you and your friends panic over cannibals in the dark. The building system is super satisfying, you start with a stick hut and somehow end up making a whole mansion in the woods\r\n\r\nThe AI companions are cool too (Kelvin is ma boy, even if he sometimes breaks my walls 💀) Exploring caves legit gives me chills, and every day in-game feels like a mini adventure\r\n\r\nIt’s still got a few bugs here and there, but it’s honestly worth it for how much chaos and fun it brings. If you liked The Forest, this is like that but cranked up in every way\r\n\r\n9/10 — accidentally hit ma boy Kelvin with an axe, felt bad, still love him 💚",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Total upgrade from the previous game! I absolutely love the cannibal attacks, and having guns makes me feel I'm bringing real colonialism to these savages.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall its a fun game but its also a walking simulator, there is so much walking and even with the other forms of travel, it is still rough. Also, the enemy balancing in this game is whack, enemies have varying amounts of health that can be easy to kill or take a 100 hits meanwhile you go down in 2 hits 90% of the time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun survival gameplay and combat. The cut-scenes and voice acting are to be... desired.. 0ther than that I highly recommend the game. Especially fun with friends i'm sure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There are silly bugs for a online game (like, you have to actually SAVE before you leave, otherwise you'll lose everything).\n\nGameplay is great, multiplayer is great, only complaints can be fixed with modding so damn good game.\n\nBut, overall, its a 7/10 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's not as scary as the forest but idk if i changed or if i got used to the game but it's very fun and building in this is so fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is very fun and enjoyable. I would recocomend to play this game with friends because that just makes it more fun. I feel like the game could be more scary and more difficult I have been playing for a while on the hardest possable settings and its just a little to easy. The reason I belive for the game not being as scary as the first forest is that you dont risk losing anything when you die, you just get your stuff back right from respawn which I think just makes it so much less scary and much more easy. Other than the game having a quick story, it being easy and not that scary this game is really fun and I would recomend it to lots of people.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a beautiful game. I know beautiful is not a justify word, but everything in this game is just fun. I like the environment and the crafting in this game. For me is my number one survival game. It will be more fun if you play with friends. This kind of game why I have PC :) \n\nBut I kind of wish the story had more to it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fine game in general especially in the early-mid game , however when nearing the end it's quite annoying and tiring searching thru countless caves looking for bullshit items , practically impossible without taking a peek at the wiki . putting the bunkers at the polar opposite of the map is a shit move. Besides building mechanics are pretty nice allowing you to create pretty much whatever you'd need.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not gonna lie. The beginning is absolutely hard and you must look for guides or looking what to do and in what order. After doing that and getting the first key items from caves the game becomes much more entertaining and fun. When you get good weapons you get way more confident on exploring. I completed the first game like 3 times and i loved it so much. I've not completed this one yet. But so far i liked the first one the most because of many mechanics that are now different, even tough some changes are actually better than the first like, like the new GPS map you get. It's a really good game. Has lots of new content, enemys, weapons, etc... Worth playing if you liked the first one for sure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "crash landed on epstines island, found the gates to agartha, married a ben 10 alien wife with 3 feet and then managed to cure aids (LORE ACCURATE trust)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great gameplate, 10/10 trees choping, story great disappointment, much loss\n\nRecommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game really surprised me with how much fun it turned out to be. I’m giving it a 9 out of 10, and honestly, co-op takes it to a completely different level. When you play with friends, it’s easy to split roles — someone builds, someone gathers, someone wanders off into the woods like a maniac — and somehow it all works. And taking down cannibals together is just pure chaotic entertainment.\n\nThe atmosphere hits hard, the island feels dangerous in a good way, and the building system is insanely satisfying once you get into it. Exploring caves, planning out your base, dealing with weird mutant encounters — it all mixes into this addictive survival rhythm. The AI can act strange, but half the time it just makes the experience funnier, not worse. Performance isn’t perfect, but it’s solid enough to enjoy the game without frustration.\n\nIn the end, this game is absolutely worth the money and the time you put into it. It gives you plenty of moments that stick with you long after you log off.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sons of The Forest is an intense and immersive sirvival game with amazing graphics and a huge open world to explore. The building system is really detailed the enemies are smarter than ever and the horror atmosphere keeps you on edge the whole time. There are still some bugs but the game keeps improving with updates.Overall its a fun and challenging survival experience especially with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay in Sons of the Forest is solid especially if you're primarily using it for the survival aspect; building feels great although different from The Forest, the UI is clean, and companions like Virginia and Kelvin are surprisingly helpful. But the story is all over the place. It’s never really clear who Virginia is, why she is the way she is, major plot points are easy to miss, and Timmy just shows up on the island with no real explanation of how or why. There’s also this mystery guy who clearly doesn’t want you (or Timmy) there, but the game never bothers to explain him either.\r\n\r\nIf you’re here for mechanics and survival fun, it delivers. If you’re hoping for a clear, coherent story, it’s pretty lacking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i think i have played. the lore goes crazy and its a good time passing game. alr have 18 hrs after playing for like 3 or 4 days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game just scratches an itch for me im not sure what it is. it also just has the perfect amount of jank to it which adds some great humor. amazing with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game doesnt run the smoothest, even with lower quality settings, but it works well enough to still enjoy the game. Some refinement would be preferred but a good game overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun killing monsters before they eat you (dont throw explosives next to your house when they are attacking)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS TERRIFYINGLY GREAT! Great building and survival, huge improvement from The Forest. Definitely forces the player to go out and explore. Be warned: You will scream if you play this alone especially in the dark.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game story line ids fun very confusing though but i love the fighting mechanics cut scenes and the building its nice that you can set your own difficulty with the custom difficulty option and that you can enjoy the survival aspect of the game by turning off the enemys overall im would recomend to play this also very good with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the sandbox feature along with the dark horror vibes for creatures and the backstory behind the game great job very entertaining and i love how much bigger the map is conpaired to the Forest witch is also another amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In essence of one the most beautifully captured experience's of any game I've ever played.  The stunning graphics draws you into the horrors that awaits you, the atmosphere keeps on the edge of your seat. I and friend have played for hours and enjoyed every second of this gory but stunning game,\n\nDon't let this game pass you by, don't hesitate to buy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, some glitches and bugs here n there but most of the time they are funny like my friend getting flung across the map lol. Lots of replay ability and able lots of game play time. Like minecraft where you can have a phase for a bit and get back on in a couple months with your friend/friends. Plus I love survival games. 9.5/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely bangin' with friends. Love the survival aspect though there is a common strength issue between the player and the low end cannibals. They shouldn't be able to one shot you when you have high end armor on.\r\n\r\nAlso major let down that this game still isn't completely crossplay yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, terrifying at times, and complicated to learn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not for me, but competent if you like this kind of thing. good building system and fun for a while with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Beautiful graphics. Big map, scary caves and cannibals, Love the base building and crafting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it for a bit a year ago, today I came back to it and now I appreciate the game, me and my dad played for a bit about a year ago and I was the one who didn't want to play, now I actually appreciate the game and how he got it for me. 10/10 game would play multiple times over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good survivle game relistick a lot to do like build freely play this game for Sure!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes its so amazing in fact I don't care that I run it at a lowish framerate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may be the best game or definitely one of the best survival games, especially considering the quality of the plot and its presentation. No less interesting is the innovative approach to the implementation of game mechanics, like construction, inventory, etc. The developers have taken a very confident position in this genre of games, so I'll be glad to see more content or maybe new game from them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game\n10/10\nAmazing visuals, very nice game play and base building. Survival elements are also nicely balanced. Also a quite large map, much bigger than the first game, as well as a much higher variety of weapons/tools than in \"The Forest\". Really cool story too. Everything is a major improvement compared to the already high standards of the first game.\nThank you Endnight devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE this game. Glitches and all. This provided several nights for the girls to come together and slaughter camel balls like the goddamn ladies we are. 10/10 recommend for your next girls night.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game with a writing that makes the game lose all it's purpose and fun in retrospect. Incredible piece of work. This managed to be more stupid writing than Borderlands 3. \n\nIt is a 5/10. I loved the game, but when it finished, I hated it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, fun building a survival mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "will be better if it had VR support,Developers Please ADD VR!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had a great time playing through it with a friend; sometimes it was a little hard to figure out what to do next but we figured it out :)\r\nThe base building seemed pretty irrelevant by the end of the game. That's not to say you can't spend a ton of time on your base, we just did the basics for storing food and sleeping and then explored the island most of the time.\r\nSpeaking of the island, this game's environments are *stunning*. Definitely the highlight for me.\r\nFinding all of the new tools and gadgets was a lot of fun. They each added great new dynamics to the gameplay.\r\nCombat felt pretty good, better than some other survival games I've played but it occasionally felt a little clunky. Full disclaimer we played it with enemy damage reduced a little because we tried it on the standard \"normal\" difficulty and got brutalized a few times. Ended up reducing their damage a bit but leaving their hp and our hp and damage at the \"normal\" setting.\r\nStory was interesting enough; the ending was somewhat unexpected. So far only got one of the possible endings.\r\n\r\nGame definitely has content that is not for all ages; player/viewer discretion is advised.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OMG the amount of time that lose as I get fully engross playing this with friends and family. 12/10 would recommend. over 50 hours and hardly touched the store. Been to busy building bases and crafting!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The perfect game for horror, open world, and slow progressive crafting with resources.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and sequel, have had a lot of fun with my friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I've just been playing this as a hunting and building survival sim with enemies set to passive, and its been fun so far. Huge improvement over The Forest, and the world is so dense and realistic. Plays well on Deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better version of the forest.Really good,Deserves the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game great graphics reminds me alot of the forest and its scary as hell i got jumpscared by the mutants alot i would recommend this game honestly my favourite so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Think of this game from the perspective of a virginia colonist settling in the old Reserve of 1763 after the United States became independent. Just as the founding fathers intended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its reallt visually pleasing and takes a while and gives a rush and a sense of never getting bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although I feel like the vibe of the game is slightly worse than the first one, it's overall a much tighter experience. Worth playing with friends for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, just watch out for the creepy crawly multi legged things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent sandbox thriller/horror game with fun building despite its jank. Story was kinda wack but can definitely recommend on a good sale. Maybe not so much full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great, overall way better quality of life than The Forest, there are way more enemy types that keep gameplay feeling fresh; and the graphics are amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bought the game with my friends, just to be knocked out by someone's ball sack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Survival horror done right, tense exploration, creative crafting, and unpredictable enemies keep you on edge. The open world and emergent gameplay make every session feel fresh and exciting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to play with a group of friends and has nice custom building",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far I'm really loving the game, it has a really nice asmr affect to it even though there's a bunch of naked people trying to kill you at times. I love cutting the trees and building bases from scratch. Then I love how Virginia is always around helping me with any threats. Ultimately, its definitely an upgrade from the first game and I love the story aspect in this. Cave exploring is on a whole new level with this too, everytime i go in a cave i feel like i find something new. Overall gonna come back to fix this review but until then gonna keep gaming. Should try to get, gives me ark vibes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing, the crafting, exploration, enemies, and the building? FANTASTIC! Whether you are in the mood to hunt cannibals or explore creepy caves, or simply just survive the wilderness and build your dream cabin this is the game. The graphics are great. I simply just love the building in this game itself. now i wish there was trajectory for the bow as there is for the spear, but thats just a small flaw.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very entertaining, although it can become repetitive in the caves, does not offer much to do in the construction part, how many of these games, you can devote yourself to make a great fortress but that will not help you at all with the story of the game. In the end, you only need a place to sleep and that even with a tent and a stick can be done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its not often that I enjoy a sequel more than the original in video games. This is one of those times. This game expands on what the first game has in every aspect. The building is better, the combat feels more challenging and responsive, the map is very large, the graphics look absolutely stunning, caves are terrifying, it has a wider variety of items, weaponry, enemies, things you can construct, and mechanics. If you enjoyed the first game, im confident you will LOVE this one, and even if you haven't, I still highly recommend this game. My only negative is how difficult the story is to figure out. I played with a friend who was explaining everything to me while we played and I still couldn't wrap my head around what the hell is going on. Even still, I thoroughly enjoyed this game to the end, and with a decent amount of mods available online, you can tailor your experience to your own preferences. Massive thumbs up for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is so funny to play with friends and the game is incredible. What I like the most are the caves and the options the game gives you to build different things. So overall I recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game, quite different from its predecessor \"The Forest.\" It's much more polished in every way, and the story and gameplay will likely feel a bit different. It's much better to play with others, though, as it becomes easier and more enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sons of the Forest — Terrifying Survival in an Unforgiving Wilderness\n\nSons of the Forest plunges players into a terrifying, atmospheric world where survival depends on resourcefulness, strategy, and nerves of steel. Set on a new island, the forest is teeming with deadly creatures and hidden dangers, making every moment tense as you explore, build, and fight to stay alive.\n\nThe game excels in survival and crafting mechanics. Gathering resources, constructing shelters, setting traps, and managing health, hunger, and stamina keeps players constantly engaged. Combat is visceral and strategic, requiring careful planning to overcome hostile enemies and nightmarish creatures lurking in the shadows.\n\nProgression and exploration are rewarding. Unlocking new tools, weapons, and upgrades as you venture deeper into the forest creates a strong sense of accomplishment. The island is full of secrets and environmental storytelling that encourage curiosity while maintaining a constant sense of dread.\n\nVisuals and audio amplify the tension. The realistic, detailed environments, dynamic weather, and night cycles make the forest feel alive—and dangerous. Coupled with a haunting soundtrack and immersive sound design, every encounter is intense and memorable.\n\n[h3]Final Verdict:[/h3]\nSons of the Forest is a thrilling, atmospheric survival experience that balances fear, strategy, and exploration. Challenging, immersive, and full of surprises, it’s a must-play for fans of horror survival games.\n\n“A chilling, beautifully crafted survival horror adventure where every choice could be your last.”\n\nOverall Rating: ⭐⭐⭐⭐⭐⭐⭐⭐⭐☆ 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра отличная, очень интересно играть. Покупал по скидке за где-то 500 рублей(6.5 доллара) и этих денег она точно стоит советую.\r\nИстория: на базу напали абаригены я хочу выйти на улицу открываю дверь, а она открывается не полностью, но я смог увидеть за дверью 3 мутанта и МНОГО абаригенов, они своими телами закрывают дверь. Ситуация произошла недавно",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games ive played in a long time. It's great with friends or even solo. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Lots of fun, and I hope they make another one in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was very happy and distracted playing this game it was so much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game just not good on low end pcs but i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game loved it with every sense of the world its fun, engaging and can get chaotic which is all the more fun, its one of those games i wish i had dementia so i could play them for the first time again, endnight did an amazing job and i cant wait til i hear that they made a new one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY fun and worth 30$ a bit hard to progress at first but as soon as you get the hang of it its even better. +points for very fun multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not that bad.. I gave it a chance once again because I was too noob at the first try which left me a bad scent but now it's absolutely good even tho it's grindy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sons of is so realistic, definetely a must play, prefferably with a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Much more ease of use into the story than the first game with the objectives being marked as you go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game about surviving on an island with mutants and wild tribes.\nI got all the achievements. Surprisingly, there are a lot of bugs with getting them in this game; they often don't count, but there's only one way to fix them!\nYou need to build a tent out of a tarp and a stick, save it, and reload the game. Then, jump on it, break it, and pick up the stick that drops. If that doesn't work, try again.\nThe game has become more beautiful, more stable, and more diverse compared to the first game. Construction allows you to build structures from different materials, not just wood. Moreover, you can create your own shape and design; the game doesn't limit you to pre-made templates.\nThe downside is the extremely weak storyline; there's none! If you rush, you can complete the game in 3-4 hours, but if you collect all the collectibles and explore the island, it could take up to 40-50 hours, including building a base. Then the sandbox begins, although it starts from the very beginning, as there are no story restrictions.\nBuying it on sale is worth it. 7 out of 10, it wasn't boring, but after the story and completing the achievements, you don't want to go back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "accidently completed the game in 8 hours, great fun otherwise\r\n\r\nnow ive done a gameplay with my mates and we just building now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great survival game it's perfect for playing with friends i recommend it to everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story is med at best\ngameplay is an upgrade from the first game \ngolf cart is amazing  and the glider too makes traveling easy \nKelvin is W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game weather your playing solo or with friends. Something i always find myself coming back to and replaying every so often. The building is super relaxing and very well done. All in all a very pretty and well put together game that should have more praise than it does. 9/10 one of the best survival games out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. great survival mechanics, combat, and the building in this game is in a league of its own. Must have if you enjoy survival games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the graphics are great and this game is very fun with my boys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its the best game i have ever play for a reasonable price and literally Love it when playing with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Started playing, built a cool house in the middle of a lake after figuring out the canabils can't swim.\n\nDidn't know there are seasons in this game.... found out the hard way that in winter the lake freezes over...\n\nBig red man came along and absolutley obliterated my settlement in one flop, sending logs flying and the game crashed.\n\n10 out of 10 worth every cent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game for what it was intended for. It looks and feels good as a survival game which I don't usually play. Only complaint I have is multiplayer. I would love to join some people that start a public server and not get jabbed instantly haha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very challenging game. You would feel frustrated at first, but every achievement uncovering the mysteries in this damn island are so wonderful and the atmosphere is calm but unsettling. Really should give it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun multi-player mode. Single player is FRUSTRATING but still addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is intriguing, it offers a lot of freedom to do whatever you want. The problem with most building games is that there's so limited things you can build until it tells you that you can't place anything more.\r\n\r\nThis is why having no limits is such a good feature, and that's not even including the different enemies that not only are difficult, but are balanced in their own ways\r\n\r\nGreat game, would recommend for the price.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game has it's moments but overall it got very boring and tedious. \n\nThe start of the game is very fun and exciting but once you explore the first 3-4 caves you've seen it all. \n\nThere isn't much incentive to build a base really apart from when you arrive at the end of the game where you need to upgrade your gear and armor, even this is basically useless because by the time you start upgrading your gear you have finished the game and there's no reason to do so. \n\nExploration is rewarded but not satisfactory, you have a vast array of tools but barely ever end up using half of them and mobs variety is lacking. \n\nThere could've been more wildlife like bears, wolves, tigers etc but none of this is present. \n\nTravelling is also a pain in the ass often times, short travels are ok but once you need to cross to the east side of the map it just gets so tedious. \n\nYou unlock a teleporter but only at the end of the game which by then becomes useless as you've finished the game. \n\nThere's no incentive to stay playing apart from maybe collecting all items and upgrade all weapons but there's no point to do so.\n\nI'd give the game a 5/10 maybe 6 at best. The start and end game are engaging but most of your mid game is boring and bland. You can have some fun, it has it's moments but I'm writing this review mostly so that it helps the developers in improving it cause I like the franchise. \n\nIt's worth a try but don't expect too much.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "gameplay is great, story is horseshit. how in your right mind did u approve that ending",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "all of a sudden i cant use my microphone. it works in every app except sons of the forest. i do not recommend this game at this time. waste of money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not as much like the original Forest as I had hoped. Difficult right off the bat with zero easing into it. The only thing I found remotely enjoyable was Kelvin, and I will forever be disappointed that he's stuck in this game that I never want to open again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to like this game so much and feel bad leaving a negative review. \r\nIf you want more of The Forest, just play the first game again.\r\nUnclear and unsatisfying story was the biggest downfall but FAR from my only issue with the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't know why they thought a map like 10x bigger would make the game more \"fun\" when the most interesting part of the first game to me was the vast cave network where it felt like almost every cave was connected together. I just couldn't push past all the jank and boring parts when the exploration itself just feels so much worse than the first game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's boring. Can't really think of anything positive to say about this game. Definitely not worth 29 Euros.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This may be a somewhat good game, but it's buggy, slow, and the gameplay can be annoying or repetitive. If it wasn't for my friend who pushed me to play this I would have about half an hour in this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is pure fucking trash, if you die in a cave you will never open your backpack again no matter what, monsters run across the map to one tap you. game is absolute shit -10/10 game never again",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I do not recommend this game. I honestly cannot fathom how is this 90% positive reviews.\nThe game was a very big disappointment, even though I didnt expect too much from it. \nI didnt expect a good story, but what we got is much worse than if it didnt have any. People fill the gaps with truly nonsensical headcannon and call it a mystery story. \nIn order to be a mystery story, you need some informations that you can think about. You need clues so that you can piece the story together. But here... we really didnt get ANYTHING worthile. Honestly I remember from 20 years ago better minecraft movies with 360p and made by 12 years old children. Even those had much better stories and even their impros were higher quaility than this one. Its just simply random.\nThe boss at the end was not scary, it was fucking hilarious and sad at the same time.\nI laughed a lot of times during the game (its a horror game mind you) and not becuase I had so much fun.\nI didnt laguh WITH the game but AT the game and its bugs. \nForest 1 was actually scary for me but this one wasnt, not by one bit. \nThe map is huge and empty. Its full of vegetation and I cant see shit and I am always attacked from the bushes without warning, but even then they are not a threat.\nAnd this is an another big problem: the combat. Its just too easy. I am attacked by 10 mutants and some cannibals and I just go into melle and loose some armour and kill them. I am almost always in net+. \nCompleting the game is very tedious and after that we get the artifact which doesnt help with anything in the end. I can teleport sure, but why would I do that? Why would I do anything in this game?\nI dont have to have resources stored because my inventory is more than enough, which means I dont have to build a base, which means I dont have to defend it, which means there is no reason to fight. \nEven without traps I kill hordes of the enemy without explosives, guns etc. I dont have to do anything tactically because I can kill everything.\nThe enemies in general are not scary, they look funny.\nI am very disappointed. \n\nTLDR: Bad and easy combat, not scary, buggy, map too big and empty, \"story\" terrible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has one of the worst building system, its restrictive and buggy to the core. Build a base with no window one door and flat roof one log high and it rains and snows inside the base, what's the point in building the base then. Combat is shit. The only thing good in this game is the atmosphere. Also it seems no patches are being worked on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "beta A** game\r\nterrible inventory system\r\nwretched ui\r\nno storyline\r\ngraphics are nice though\r\nui and inventory make combat awful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trying to play with my friends online, get disconnected every 5-10 minutes with \"Host not responding\" error. I tried hosting and my friends get the same issue. I can not recommend buying the game in this state",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I loved playing this game but the lighting in it is so awful I can't bring myself to recommend it to anyone. Worst Light Adaptation system I have ever seen, making ALL light sources BAD because they ALL blind you to the point you can't see what's near you in the slightest.\r\n\r\nThis game genuinely hurts your eyes because of HOW BAD the light is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Compared to the original, the world in this game is much vaster and much emptier. You'll quickly realise that they've placed corpses in trees the way they'd place a generic bush asset, just to fill space. Unlike the original, where players can easily argue over which spot is best to set up their base, I'd be hard pressed to actually describe any location in this game in a way another player could understand. The companion is an annoying and weirdly ableist caricature that's not useful for much beyond getting stuck on cliffs and chopping wood. Honestly, this sequel makes me see the original differently. It's like when the indie director lands a major film and you realise that the charmingly low quality wasn't really because of the budget...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WOW the mechanics of this game got worse . everything that was fun and cool about this game got so so much worse. its not fun its not better they absolutly destroyed them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needlessly large empty world. Improved some parts of the original but threw away it's best features.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So lame. Can't even do anything without getting attacked constantly. It's even more boring than the forest which says a lot.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game's plot and its ending are not worth buying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried getting into the game but for me, it is just too counterintuitive. Inventory management is this terrible ui experiment where you have an unwrapped backpack with all your stuff layed out before you that you should combine into arrows for instance, and those then dissapear from your inventory, giving you no clue how many you have left? maybe I am missing something and accidentaly clicked my hud away which should be showing all things I need like ammo, map markers and directions, (these are on a in game phone app, hardly visible and not interactible I think? I would love to see some quest progression to get you started in a game like this, show you how to create things or even just what I am supposed to do. Tried it for an evening, dont feel like putting in the effort to find the answers to all of this online.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good for 16 hours then it gets REALLY boring and repetitive. Not much substance here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are great, and the gameplay mechanics feel solid, very similar to the older title. The mutants still leap at you and try to tear you apart, which keeps the tension high and the atmosphere familiar. However, the story leaves a lot to be desired. It’s inconsistent and very poorly introduced. A lot of things in the game are not explained, and there’s no evidence of how or why they happen. This also applies to events from the first game — many moments feel completely random and unclear. Overall, the game is only worth it for the survival simulation aspect. For that reason, I’d recommend buying it on sale for around €9, not for the full price of €29.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NO AWFUL GAME. the first game was so much better in every aspect. more options to build stuff but i absolutely despise sons of the forest",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is a bad game...\nthe crafting was boring and once you got certain items the game played predictably.\napparently there are a few endings but who would want to put themselves through that multiple times is a mystery.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Started a multiplayer world with friends and played for around 10 hours. Logged on to play again and had lost all my items and was back in the starting cut scene. 10 hours of gameplay down the drain for no apparent reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So the Idea of this game is great. CO-OP sounds fun! (havent had the time to play with my friends yet) But this game just isnt ready yet (obviously \"Beta\") But Dangit if i didnt just spend over an hour building my defensive walls just to have it crash.... so i do have a problem with forgetting to save. And i NEED an auto save option. i can deal with beta's and bugs but i cant stand progressing and losing it all just to do it all again. AUTO SAVE PLEASE AND I WOULD RECOMEND EVEN IN THE STATE ITS IN NOW!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Playing multiplayer, my entire save dissapeared from a bug. hours of wasted. screw this buggy ass game. DONT RELEASE THINGS UNTIL THEY ARE WORKING PROPERLY.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Expensive, unclear and generally a bit crap :( completed it relatively quickly, didn't faff with building loads of buggy buildings so it was pretty boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't even know where to start with this game... TLDR for the following review: It is fun, but not intentionally, and if you want a serious survival game experience, either play the first game or a different title like Valheim.\n\nSons of the Forest demands you to engage with a myriad of core systems, whilst simultaneously making each one irrelevant through every point of the game. This problem is only further exacerbated by the completely nonsensical story and total lack of atmosphere. Despite these flaws, I do still think there is a decent game at the core, which is fun with a friend.\n\nThe largest problem I see is with the game's consistent failure to keep any sense of tension by watering down every single survival mechanic. There is no need to scrounge for food, meds, water, hell even ammo since every (and i do mean every) location, including cannibal camps has all in large quantities. You can even notice that the game intentionally places numerous energy drinks and bars in every single major cave, meaning that if you just eat an energy bar and drink an energy drink every time you enter a cave, you will likely never have to sleep and will scarcely run out of hunger. This odd anti-survival design philosophy makes the game feel absurdly easy, as the only thing you ever have to worry about is your creepy armor breaking. I never once felt like I was about to run out of food or water, or any crafting materials, and had a massive surplus of both ammo and explosives for the entire game. \n\nThe exploration fails to be interesting at all, since it amounts to nothing more than heading to the marked POIs on the GPS. Some natural exploration can be found in cannibal camps or GPS locator camps, but they are all designed in very similar fashion, with the exact same enemies and loot. Additionally, the absurdly massive island means that there is no detail put into anything in between the previously mentioned POIs, and the game avoids this problem by easily giving you access to fast transportation in the form of the golf cart, glider, and scooter. And on the topic of vehicles, who the actual fuck designed these stupid things? The golf cart literally NEVER runs out of battery, as it has a solar panel and will immediately begin recharging once you exit it. It will also take no damage from impacts, meaning you can drive it like a maniac into trees and rocks and off cliffs, take no player damage and just cheese natural exploration. This problem is made even worse by the fact, that the golf carts are total killing machines. They can instantly kill a maximum level cannibal, make you incredibly hard to hit, and are indestructible. Now, I will admit this mechanic is VERY fun and me and my friend abused it to no end, since we found it hilarious. It's worth mentioning that this level of jank in relation to golf carts I find heavily amusing, but I think muddies the atmosphere, and makes the game far too easy. I think that the island should've been much smaller, like the first game, and smaller details should've been worked on more.\n\nAnd on the topic of atmosphere, the game has the worst sound design I think I have ever heard. From the voices to the melee sounds to the guns, nothing has any impact and it all sounds incredibly muffled or otherwise unfinished. It's very curious to me that this was so severely overlooked given that I think the visuals are quite incredible. \n\n[spoiler] Now all of that would be fine and forgivable if the story left anything to be desired, but unfortunately here we are. This game's story is probably the single worst of any game I have ever played, a totally nonsensical bunch of schlock from beginning to end that left so many questions, though they were questions that at this point I don't care to learn the answers to. After exploring the first couple caves, you may find some strange symbols or technology, which may pique your interest. Perhaps there is something interesting going on here? No. It's fucking aliens. And no, I am not kidding. In one of the caves, out of nowhere there is just a fucking spaceship, and you get some weird alien armor that loops into the plotline about the resort, so let's talk about that. Once you get to the first maintenance bunker, and get through it, a random cutscene will play with a completely unexplained character which I guess we're supposed to infer is the son of the survivor from the first game. He says some random voice lines, shoots mutants then runs away. Later, in a different bunker, his dad (the survivor from the first game) randomly also shows up, but is shot by some random guy in a silver jacket and taken away, but for some reason he just leaves you. After that you go to a different bunker and click a button to free the kid from a jail cell of some sort. And in between each of these there are no further cutscenes or explanations, just cuts to black and laptops pointing you to the next POI. Nothing about it makes any sense or feels natural in any way. In the final area, it reaches peak stupidity with the most obscene schizo shit you could possibly imagine. You take the alien armor, coat it in this strange gold substance on the island, then take it to an ancient alien wall which opens up to a cube. What follows is some insane far-right Agartha edit type bullshit where the box opens up to reveal a future human civilization with flying cars and whatever bullshit. Totally insane, no explanation whatsoever, and it ends in like a minute. Then you're thrown into a boss fight with just a massive bullet sponge, then the survivor from the first game out of nowhere shows up and saves you in a helicopter. And for the ending, the game just randomly gives you a choice between leaving and going to grab this weird alien orb, which at that point we have been told nothing about and has no idea what it does. If you leave, the game ends with some nonsense cutscenes and if you stay the game just continues. Overall the story content amounts to very little, and what little is there is totally incoherent bullshit. At least it was entertaining, though not intentionally. [/spoiler]\n\nIn conclusion, you can play this game if you want, but it IS dogshit. Like big time dookie dogshit. The combat is fun, but it is not a survival game, it is an infinite ammo golf cart driving simulator with some semblance of a story written in probably 30 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It crashes a lot. My PC is over the required specs. Random lag spikes, and it randomly hard crashes my pc. I'd like to play it more, but I just am tired of losing progress over an optimization issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth the price and it doesn't play or feel like a finished game and it's not getting updates anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not a bad game... but i find the story lackluster. Specially  the ending.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat much worse than first game, 1 mutant feels like a souls fight every time, melee combat is useless because youre made of glass even with mid game armor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ignored 80% of the issues from the first game to instead add a follower system and golf carts...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't regret playing this with my friend\n\nCrafting stuff is always fun. The story is, at times, fairly exciting. The JUMP SCARES ARE GOOD. \n\nThere is essentially no reason to build a base, or go there, ever. Period, there's not. Unless you just really want to for the sake of messing around - but it's a real CHORE to walk there ... and no real reward or incentive ... so you kind of just don't. So the most fun part of the game, building stuff, is really just a purposeless side quest - compared to a game like 7 days to die where building a base is absolutely essential to core gameplay.\n\nSome enemies are \"bullet\" sponges that end up taking you 15 minutes to whittle down with your spear if - god forbid - you haven't found the shotgun etc. yet\n\nIf you want to build a base and survival roleplay and have fun - go for it. But don't expect too much from the story. The story builds a lot of momentum but the ending kinda falls pretty flat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is buggy. cant customize your controller.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most annoying games I've ever played. I read that you're supposed to adjust settings instead of just playing on normal so that you can actually build instead of just being attacked every 5 seconds. Unfortunately I was too far in to start over so I just end up running laps around the island, using the little tents as quicksaves. If I try to build anything that takes more than 30 seconds, I just get interrupted constantly. As soon as I clear one horde and start building again, another shows up. It's nonstop. The only way I can avoid being in constant battles is to just keep moving.\n\nI find so much stuff laying around that I don't even need to craft or base build anyway. I was looking for a survival game where'd Id have to chop trees, build shelters, hunt for food etc. If I try to do any of that I'm punished, and it's all completely pointless anyway since you can just find facilities all over the place full of food, supplies, weapons, and safe places to sleep. I'm basically just playing an open world zombie fps at this point.\n\nIf the game didn't have so many flawed systems and wasn't so tedious and annoying it would be great.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really liked The Forest, so I thought this would be pretty fun too, but it's not. On Normal difficulty it is insanely difficult. You'd have to be a sadist to enjoy it even on normal, and yeah, I know there are people that like playing it on hard or even custom difficulties that are super hard for the challenge, but I wasn't interested in the challenge. As it stands right now, there is no \"reasonable\" option for a more casual player. It's either insane enemies or \"peaceful\" mode which is too easy. There's no good balance.\r\n\r\nCombat isn't fun. Exploring caves is terrible because they are full of enemies that aren't fun to fight. It's not like a fun challenge like Dark Souls where combat is methodical, it's just a bunch of running away and seeing when you can get a good hit in, and most of the time you don't.\r\n\r\nUltimately I am going to give the game another chance on peaceful, but that feels like it defeats the purpose. They really should have made the \"normal\" difficultly more reasonable. I actually don't trust the custom difficulty sliders because based on other reviews I don't think they'll actually make much of a difference.\r\n\r\nI don't think it would be that hard to make the game good. Just make it so like one or two arrows kills most enemies, and I mean regular stone arrows. For me, by Day 10, I pumped like 8 arrows into a basic cannibal and it didn't go down. That's insane for \"normal\" difficulty. Even early in the game I resorted to the pistol for almost anything I saw, but then I was quickly out of ammo. Yes, I know someone is going to tell me I'm playing the game wrong. Maybe I am, but the game already has too much of a barrier to entry. I already watched a few hours of YouTubers trying to explain this game, and I guarantee you that if I had not played The Forest, I would have quit a lot sooner.\r\n\r\nI'm not even saying it's a bad game. I'm sure there is an audience for it, but it isn't me. And I'm saying that as a fan of the original.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was able to play this game for 5.5 hours. I had lots of fun with my friends but suddenly cannot launch it. I've seen somewhere on reddit that this is actually a known issue that Devs hasn't bat an eye yet (at least that's what I've read). I hope devs fix the issue so I can launch it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The boss fights are so awful and the ending sucks so bad, don't get this blud",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game ending is so underwhelming, cut scenes are terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont buy this fuckin game. every boss fight is the same, every weapon is the same. the story is on the same level as garten of ban ban and the only fun part is exploring like 2 caves.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unity ekranını açıp kod kısmında klavyeye sikimi sağa solda çarptırsam bu oyundan daha oynanabilir ve keyifli bi oyun çıkarabilirim ortaya değerlendirin beni",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels empty, story wise feels very empty compared to the first one.\r\nLost of performance and bug issues, I waited for 1.0 to enjoy but very little seems to have changed.\r\nNo update for about a year. \r\n\r\nMenu systems worked great in the first one, but there's too many items and things aren't made clear. \r\n\r\nEnemy scales with days instead of actual player progression. Players are punished for engaging with the building system. It's complicated and not explained well. I can see players potentially bricking a save because they spent too long trying to learn it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly this game is extremely mid compared to the first game. Boring cave systems that don't link up and usually hold just one key item and then has no other use. No interesting places to build bases, very few interesting locations to explore besides the copy and pasted camps scattered around the map. A terrible story that explains almost nothing a builds up nothing. Only reason to play this game if you only want to enjoy base building which has been improved upon from the first game but that's about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I will like to write this in english in hope that the company will read this.\n\nFirst of all, i love this game. I really mean it. But i'm gonna explain why on steam, i dont recommand it.\n\nTheres too much caves. And everything is happening only in caves, like the whole story of the game.\n\nExcept tribal and mutant that always come to fight when you have a base.\n\nIt get really boring because you know that everytime you load you're game with friend, you NEED to explore caves or there is nothing to do else to finish the game.\n\nI was waiting so much and so much time for this game. I'm now a f father because of how much we're waiting lol.\n\nIf there will be a next The Forest game. I hope that the outside will be more alive with lot of interaction and war.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Full release game, still clipping out of bounds through terrain while building walls or driving golf carts. The entire cart when through the map and I got stuck in a wall. Progress massively lost",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun with friends, lovely visuals, loads of content, creative mechanics. Great game.\n\nIt does has a huge multiplayer issue. you would get disconnected every 10-60 min. The worst thing is progress loss. The game only allows you to save through tents/beds, it means no autosave, and potential huge timeloss. 30EUR is too expensive for this issue",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In total, for $14.50, we have: \na shitty plot \na lot of bugs \nno auto-saves in 2024 \n0 variety of enemies \n0 resistance from enemies \n0 scary atmosphere (because you're given a gun at the beginning of the game and there are allied NPCs on the island) \nA shitty map design \nThe good thing is the building \nEnemies get stronger over time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i liked the forest one but beside from the base building every other aspect of this game i cant stand",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lots of bugs, and huge, empty map. Great game to waster your money and time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you are looking to buy the game for the freedom of building bases with the really good idea of this game building system don't buy the game for that. It is a horrible system and makes no sense. High foundation over a lake sounds awesome right? Well the game doesn't. Ohh you wanted the foundation to be level too bad you cannot place that 1/4 of log on top of that so it's level because fuck you that's why. You wanted to remove that full log because you wanted to save time and resources, too bad you better go back individually and support each log so after that you can remove that one log. Well you spent 15 minutes supporting everything so you can save 1 log and wasted 20 minutes for that. Horrible system. Don't bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Were yall on crack when you made the story? Genuinley the worst story in terms of cohesian and player understanding i have ever played. Amazing survival mechanics but come on, yall just gonna throw in a whole lotta shit for no reason all at once? Good survival game, but man don't expect a coherrent game. Cracked out writers godamn must of been a fun writing room",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun for a little bit, but gets repetitive quick. It's honestly impressive how the devs were able to fk up gun and vehicle mechanics so badly in 2024. This game is still a buggy mess. Somehow fire axes chop down trees faster than a literal chainsaw, seagulls can take more than 1 shot from a handgun to kill, your armor randomly disappears, fireplaces work the same as 2 sticks burning on the ground, the npc AI is atrocious, the lighting is terrible, you cant pull out a knife or anything underwater, bushes block gun shots(???), no custom waypoint markers, you cant work on your base for more than a few minutes without your companion dying or running away and abandoning everything he was doing. I can go on forever. Finally the ending is absolutely terrible and incredibly short. They just make an already existing mob the final boss, how exciting..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it crashes as soon as i start it up, but before that its a nice game worth playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My play time is the point of boredom. The first game was a hit, it was fresh, new, spooky, scary, all these things but the second game is exactly like the first one, and as it doesn't show anything new, it's just boring.\nYou diss mobs as a routine job, climb the same hills, discover the same caves... No shockers.\n\nI read that the ending is also a mess so... If you never played The Forest, either play that game if you'd go for the story, or this one if more interested in the fancy (better looking something) and don't care the ending, but again, either-or, no need to play both as the games are virtually identical.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story, game play, exploration aspect, and graphics are all good. The building system is fantastic and one of the more unique ones out there in the survival genre.\n\nThere is no depth to any of the game's systems. \n\nEverything is extremely straight-forward and can get you from Point A to Point B with ease, but if you were hoping to dive in to a rich survival experience, look elsewhere. \n\nWhile the building system is quite good, you are very limited in what exactly you can make. The game misses a lot of the smaller pieces, snap points, clipping, and angled variants that games like Valheim thrive on. There is next to no decor, and very little furniture - and not a single furniture mod in the past two years. The gardening mechanics from the first game weren't iterated upon, and honestly Sons' planters are a downgrade, not to mention that there's next to no reason to farm anything from the game's perspective. Animal taming doesn't exist at all. Then there's the weather; winter is cold, fire warms you, and the winter jacket protects you until you get wet, but there's no way to make it water resistant? So your best option in the winter is to forgo the winter jacket entirely and just carry a torch around. \n\nHonestly feels they dropped the ball with this one and it's far too late for them to pick it back up. Sons has good foundations, but no support structure. A fun game with friends for two weeks once a year. Beat the story, build a house you visit a couple times, then put it away and forget it all to repeat the same thing next year. If it had the system depth of Valheim or Vintage Story it could become one of our staple survival experiences, but I don't see that happening now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Although you have an AI assistant helping you, I still find the first forest is the better game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I get a lot of lag and FPS drops, especially when I use sticky bombs on my base.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got this game for $3-4 bucks on the Steam sale, if you can pick it up for that price you can have some fun playing through with a friend.\n\nThe game is poorly designed. You have this building system and giant island and from my experience it seems completely pointless. All you need to do is pitch a tent and maybe craft a fire and that's about the extent you truly need to interact with the crafting. You can bounce between points of interest (caves and bunkers) and just beat the entire game scrounging for items. You would think that you need to setup a small base, build up supplies, and then tackle a cave but it's a waste of your time versus just rushing in head first. In fact, the caves are *safer* than sitting out in the open.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring as hell. The map is too big and there are just too many bugs . The developers need to retire . Not worth it I bought it on 10$ , but the game is like running simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd rather grate my dih ona cheese grater while boofing a cactus, then play this story ever again",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "this was entirely so bad, tried it with a friend for 2 hours and all we did was chop wood for a house that looked like ass until we realized that there were blueprints you could follow.. that part might have been on us but there wasnt a great tutorial we were just thrown into it with no clue what was going on. insta refund",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game doesn't pick up my mic and has no way to select mic input. Lazy design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good for about 15.5 hours so you can do quite a bit but after you find the first artifact you kind of get lost and bored of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible, I went into the water then a shark killed me uninstalled immediately",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought a game on Steam in order to defeat the boss and complete all the achievements. I started the journey and immediately encountered a bunch of bugs, but somehow managed to beat the boss. The next stage was to complete all the achievements. 1. The achievements are harder to complete because of the bugs.2. The developers changed all the locations of the items. I think this is bad. I completed all the achievements except the last three, and I do not recommend anyone try to complete them, especially the food-related ones. I consumed all the food twice in a row and it didn’t count toward the achievement. I do not recommend anyone waste their time searching for the paper sheets. The game is not optimized: in winter, FPS drops by half, while in summer everything is fine.I give the game 4 out of 10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the building is terrible way to hard to craft stuff, the original was a lot easier dont understand the change",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely not worth the money. Play the first game, there are multiple reasons I have less than two hours in this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME HAS THE SHITTIEST CAVE SYSTEMS EVER IF YOU WANNA PLAY DEAD END SIMULATOR THIS IS IT TERRIBLE TERRIBLE GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so i havent played a lot since i rushed to get my refund.\nit very quickly showed me that it was not for me. I rly did not like how the inventory worked and the general controls where meh? idk how to describe it. the game in general was slightly lagy too.\nThe forest and the areas did not pull me in at all, i felt so immediately disappointed? \neither way, i get why some people like it but it was not for me, someone who LOVED the first game. might be worth buying when on some massive sale :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GMAE IS DUMB UIN THE HEAD NO ONE SHOULD BUY THIS BEACUSE MELLERTHEIFOLD WILL JOIN YOURE GAME AND JHE WILL SHOT YOU AND SHOT SAONWS AND WHEN YOU ARE TRRYTING TO GET THE GRAPPLE GUN HE WILL LUGH ATT YOU WHEN YOIU FALL INTO THE FUCKING PIT THAT REASTERXST YOU AND PLACES YOU IN ANOTHE CAVE",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bugs make ts unplayable devs get ur heads out ur asses",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The most overhyped game ive ever played. Ive had more fun doing stock counts than playing this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "4/10 - Great cuts of meat but no connective tissue. YMMV if you do multiplayer and/or prefer crafting.\n\nGreat music - \"Heeey you with that funky groove!\" I had no idea a cereal commercial would be my sole comfort in these horrific times...\n\nGood yet underutilized companions - \"How's Georgia?\" my RL partner asked. \"How DARE you misname her!\" Loved the interactions and usefulness. If they didn't take 7 years to show up they'd be perfect.\nGood crafting but not my personal fav - Preferred the pre-built layouts rather than Minecraft/lego which seemed its focus, plus I found no need to base build since simply keeping on the move provided safety and ample stock. Still, well-designed.\nGood yet very disconnected story - reading all the pieces together online helped understand the well done cutscenes but with practically nothing between them you'd go 25+ hours of gameplay (not to mention days between gaming) forgetting everything. I'm very story driven so to have it so took away the power of an excellent, intricate story.\nGood visuals and sound - Other reviews seem to think these were amazing but I felt they were simply up to par.\nGood weather and other new features - but I never got to see winter. So probably thinking bugs are still skittering about. Also noticed a few things better in other gameplay videos so maybe I had a worse experience than the majority.\n\nBad map - Giant with nothing in it. Wasted hours of my life \"driving\" around pointless landscapes and swimming in empty lakes.\nBad \"driving\" - Knight V was useless off beaches, and if I ever ride in a golfcart again I will drive off the nearest cliff (and live, right? #puttingthe'survival'insurvivalhorror).\nBad shovelling - Five baddies spawn with every click? Maybe this was a bug, if not, going through this bullsh*t for weapons I never used is prime example of why I disliked the whole game. All work and no play...\n\nOverall great ideas that sadly smashed into a \"bigger is better\" mentality, what I'd call \"Witcher 3 Syndrome\" - \"There's LOADS to do! After hours of labour and travel...\" I prefer exploration rewarded with story as opposed to difficult gameplay* and open-world; the game definitely seems aimed at multiplayer which is a shame - made it feel divisive between 50% of players preferring a survival sandbox and 50% a survival horror explorer (in similar vein to early Resident Evil/Silent Hill).\n*Personally hated the combat but it seems to work well for multiplayer. Had a few good sneaking/silent kill moments but 99% of the time wouldn't see the enemy coming, got swarmed and died instantly despite armour and built-up strength (and Virginia screaming as she shot wildly). So not gonna say bad but can't honestly say anything positive.\n\nP.S. Didn't finish - Got to that golden door and found out I needed 25 stones and just gave up. Virgina my love, you'll be dancing that three-legged tango forever...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot recommend because it quickly causes bad nausea. Generally we don't get motion sick playing video games. The only other game that gave us nausea was Talos Principle, and sometimes Deep Rock Galactic. \n-Enjoyed the first The Forest game, which doesn't have this problem\n-Noticing that as time goes on, many games don't follow design best practices, or invest as much into testing for bugs before release, performance optimization, or designing for or adding accessibility settings for combating motion sickness\n-We feel this game falls into the latter, because all you can do is adjust FOV\n-Would love for this to get addressed, because it's an interesting game, but until then, can't recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is  the most bullshit story game i ever play i wish i could squish my ball and throw my ass in a grinder after experience this fucking game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For a survival horor game, there in not much survival horror and a bit too much of repetetive dungeon crawling.\n\nRespective the survival mechanics are super truncated, compared to the first game, exept for building, wich is, admitedly, wery nice, but otherwise the game does not even aptemt to pretend like stuff like gathering and hunting matters for game progression, all progression is exclusive to the dungeon crawling\n\nNow, in the area of dungeon crawling there have been some major improvements, some dungeons are now distinguishable from others, tough still much of the cave dungeons feel even more same-y than in the first game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The ending of this game is like. Mind numbingly bad. Genuinely the worst ending to a game I have ever experienced. At first I thought it was glitched, and then the boss battle was horribly easy, and the ending cutscenes were just. Horrible. Straight up ruined my entire gameplay experience and I'm kind of annoyed that I got it in the first place.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "downgrade from the first game\n\nmain complaints are:\n-map is too big\n-caves aren't connected like the first game. a lot of caves are one room.\n-game is not balanced for solo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Achievements more annoying than in the first one and I didn't even have to spend 100 days in it. Please don't make another frustating piece of sh*t like it ever again. Thank you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To much like work . i play games to relax from work not to work.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Log chopping simulator. Building a base is pointless as enemies spawn inside your perimeter wall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the worst ending ever, it was super boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is NOT the Forest, whoever designed this should find a different career",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't tap Virginia's booty. \n\n0/10\n\nAlso shitty story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my 150 day playthrough got deleted outta no where, L game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i fucking hate Kelvin. stupid chud that only gets in my damn way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies spawn in bases no matter what and devs wont fix it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "kinda boring\nboring map\nboring caves\nbad combat",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "too hard stuck in cave with my boi lars and we forgot duck tape fk u",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Compared to first game  very disapointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got bored quite fast. Feels like a DLC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks ahh fiist game better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring af. the forest was better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's the biggest piece of dog shit that I've ever heard",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "너무 징그러워요.. 식인은 아닌거같아...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is mid dont waste ur time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game ripped off 99 nights in the forest",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The ending genuinely reduced my intelligence level to that of a protozoa",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}