{
  "positive": [
    {
      "review": "This trilogy is not a game, it's an experience. \r\nI'm Commander Shepard, and this is my favourite game on the Steam store.",
      "voted_up": true,
      "votes_helpful": 142
    },
    {
      "review": "Mass Effect is unlike any other franchise out there. Most other sci-fi games set in space solely focus on colonization, resource extraction/crafting, or are so far removed from the reality we are accustomed to it becomes more fiction than science. In a sense there is a familiarity to Mass Effect, not only in its narrative-driven design, but in the universe and its characters. \n\nThe lore throughout the games remained so, so, captivating. Whether it was through datapads, missions, or retroactive dialogue based on your decisions in previous games, the environments were beautifully designed to fully immerse the player within the Mass Effect universe. It doesn't try to simplify concepts, and instead demands your attention to the experiences you have throughout the games. I believe that respects the player's intelligence, and makes for stronger mental connections to the lore.\n\nFrankly I cannot recommend this highly enough. I now see why there were always fervent fans of the original trilogy. There is so much replayability to be had, and with each game delivering around 40 hours of content, you will get your moneys worth MANY times over.",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "[h1] The brightest star in the action RPG firmament [/h1]\r\n\r\nI’m ashamed to admit that I’m one of those people who never played Mass Effect before the Legendary Edition came out. When you’re young(er), other genres appeal more to your tastes, I was into RTSs, hack and slash games and the occasional RPG, so a story rich, choice driven, decision and consequence type of game, even with some RPG elements, didn’t seem like the kind of thing I wanted to immerse myself in or “waste time” with.\r\nI’m no stranger to BioWare’s work, I’m a fan of Dragon Age, SWTOR, and even today I still play Neverwinter Nights, but for some reason Mass Effect never piqued my interest.\r\n\r\nI was so wrong…\r\n\r\nI can’t speak for the legacy versions of Mass Effect, but with the Legendary Edition (LE), all I can say is that this feels like the way to play it, or rather, the way it was meant to be experienced all along. The original trilogy released between 2007 and 2012, built fully on Unreal Engine 3 with all its capacities and limitations, and in 2021 LE arrived still running on UE3 but with a plethora of upgrades in lighting, textures, QoL, models, shaders, performance and so on.\r\nSo let’s get one thing straight, LE is, in the true sense of the word, a deep and thorough remaster, not a remake.\r\n\r\nRegarding graphics, by today’s standards, even with the upgrades, it has aged, and the limitations of UE3 do show. Even so, it’s still a beautiful game to experience. Starting with Mass Effect 1, you notice that some mostly interior locations are almost identical to one another, the only thing that changes is the colour palette and textures, and the lack of asset variety is evident. This aspect is mitigated in Mass Effect 2, and further improved in Mass Effect 3.\r\nBut overall, even with these “downsides” and I put it in quotes because I don’t consider it one, but some people might, the visuals are enjoyable and credible, and the simple touch of using Mass Effect 3’s character models and details as the base for all three games was brilliant, visually consolidating the entire story and making the trilogy feel more cohesive.\r\n\r\nThis is, of course, a matter of opinion. Even with LE, it’s still a four year old upgrade of an eighteen year old game, but I would rather play something with dated or old school graphics that keeps me entertained and immersed than a game with nearly lifelike visuals that feels void of emotion and purpose. And nowadays there’s no shortage of titles that chase graphical fidelity but fail to connect or captivate the player.\r\n\r\nIn the sound department, the cast of voice actors is blessed with legends like Lance Henriksen, Keith David, Steve Blum, Seth Green and Raphael Sbarge, among many others, and all of them deliver performances that bring characters to life with such feeling, gravitas and emotion that very few games possess.\r\nAs for the soundtrack, Sam Hulick and Jack Wall did an incredible job dressing the galaxy with music that ranges from ethereal and ambient while exploring to synth and hard techno when wandering around places like Afterlife or Purgatory, and even some truly epic scores for when you do epic things. No spoilers.\r\n\r\nGameplay wise, I often feel like I’m playing three completely different games from ME1 to ME3. You see concepts evolving, features being added or removed, systems being streamlined. For example, in ME1 you had to manage inventory and equip companions one by one through lockers, something later improved in ME2 and ME3 where you equip as needed right before missions. The only management becomes choosing which upgrades to use and which armour pieces look best on your Shepard.\r\nAnother thing is movement and motion. From ME1 to ME3, you will notice a lot of differences, especially during firefights. Duck, cover, flank, you’ll need all of that.\r\nOh, and starting from ME2, don’t bother looking for a walk toggle. There isn’t one.\r\n\r\nOne of the most memorable aspects of Mass Effect is the depth and richness of its universe, the races, cultures, values, beliefs and traditions. From some of these races come your companions, characters larger than life with their own stories and fears that you uncover along the way. The narrative you find yourself in is intricate, full of twists and revelations, and your companions grow with you. No doubt you’ll feel closer to some characters than others, but trust me, take the time to know them all. You’ll be amazed by the complexity and roundness of their personalities and stories.\r\n\r\nNow for some advice: ME1 > Liara and ME2 and ME3 > Tali.\r\n\r\nTo finish this review, and to sum up my shame, I’m reviewing this jewel of a trilogy in 2025, meaning I’m 18 years late. But I genuinely feel this deserves a review, even a late one, for all the laughs, tears, wholesome moments, intricate narrative, memorable characters and the masterpiece of a story it gave me.\r\nIf I could go back in time and meet my younger self, I’d kick him so hard for skipping this that he’d still feel it today. No matter what I write, I’ll never do justice to the masterpiece this trilogy is. You have to play it to feel it.",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "I’ve always loved space, the galaxy, and anything that resembles Dragon Age, so naturally I love this trilogy. I’ll review them in order.\n\nMass Effect 1:\nYou can immediately tell it’s a 2007 game. It has a unique aura for its genre: it’s a game about other worlds and galaxies where you’re thrown onto these remote planets WITHOUT A MARKER, WITHOUT HELP. You go there and you have to figure out what to do ON YOUR OWN. You can’t afford to skip dialogue or ignore your journal, otherwise you’ll have no idea what’s going on. Many times you find yourself on a mission with absolutely no clue whether you’re going in the right direction or the wrong one.\nThe atmosphere is incredible and truly makes you feel like you’re actually there, like you’re really lost in space. Gameplay-wise it’s behind the others, but it’s light-years ahead when it comes to the emotions it makes you feel while playing.\n\nMass Effect 2:\nObviously the best of the three, and definitely one of the greatest RPGs in history. We all know why and we all know how, so I won’t drag this out. I just want to say that I LOVED the variety of missions—especially the final one.\n\nMass Effect 3:\nThe game was HARSHLY criticized for its ending, but I think the ending is actually the only strong point of the game. What fits better in a game than a finale where you can choose to end the universe? Or reset it? Nothing—pure chaos, pure anarchy.\nThe problem is everything that comes before it: boring missions where you just go somewhere and shoot everyone, unlike ME2 where every mission is different and genuinely tells you something. It takes everything good about Mass Effect 2 and simply brings it back here.\nBasically, the strengths of this game come from ME2—because they’re all borrowed",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Mass Effect is a game that I will always remember fondly and not only because I used to play the first game on an Xbox 360 that was so loud it looked like it was going to re, enter the atmosphere while I was staring at a tube TV. Mass Effect stayed with me because it was the first game that made me think that my choices had an impact... until 2012, when BioWare gently came to me and said, \"Hmm, not really. Here are your three colors, have fun.\" \n\nMass Effect 1 \nPlaying this again with the Legendary Edition is a bit like bringing an old photo album back from the attic, except if the people in the photos were smuggling assault rifles and sometimes went through the furniture. The improvement is stunning. Now, Eden Prime really is a paradise instead of just a low, res screensaver. Shepard still moves like a refrigerator with legs, but that's definitely one of the things that makes the game so lovable. It's the timeless one: the Reapers mystery, the awkward elevator rides, the Mako making every planet a sort of low, gravity trampoline park. Just right. \n\nMass Effect 2\njust hits different. The Legendary Edition makes everything look and feel even better smoother, flashier, like you’re watching a top-tier sci-fi movie you get to control. Every character stands out. The missions? Can't ask for more. Then you’ve got those loyalty quests that mess with your head and your heart. If Mass Effect 1 feels like coming home, Mass Effect 2 is that first taste of independence your own place in the city, sitting back and thinking, “Yeah, this is the life.” \n\nMass Effect 3\nThere is a lot to like in ME3, the combat is awesome, the characters go through incredible changes, and the final arc could have been absolutely amazing. However the ending… Oh yes, the ending: the point where BioWare took all my choices, relationships, sacrifices, and hours of meticulous Paragon/Renegade moral philosophy, mixed them in a cosmic way, and delivered it in three slightly different \"Oops\" colors. \n\nIt was not only disappointing, it felt like the developers invited me to a birthday party, gave me a beautifully wrapped present, and inside there was a note saying, \"The real choices were the friends you made along the way. By the way, please pick a color now.\" \n\nNonetheless, even ME3 is a bit more brilliant in the Legendary Edition, although no amount of remastering can completely take away my trauma from the star child’s PowerPoint presentation at the end. \n\nFinal Verdict \nMass Effect Legendary Edition isn't just a visual upgrade; it's a passport to another time. It reintroduces the delight, the amazement, the thrill of being in charge of the Normandy… and yes, the disappointment of realizing that after three games of making choices that affect the whole galaxy, your ultimate destiny would be determined by a glowing space toddler handing you a multiple, choice test. \n\nHonestly? After all that..... I'd still do it. In a heartbeat. The journey is simply that awesome. \n\nIn fact, the Legendary Edition is the impact that we have always known Mass Effect is not one game, or even three, it is a feeling. A feeling of heroism, camaraderie, heartbreak, and at times, shouting “THAT’S NOT HOW MY SHEPARD WOULD ACT” at your TV. \n\n10/10. Would romance Garrus again.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "You don't get to play one you like the most. You are stuck playing all 3 of them back to back, and only you to blame for this (good taste my guy).  With that said, touch some grass here and there, don't make my mistakes.\n\nThe games are good btw",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "My name is Commander Shepard and this is my favorite game on the citadel.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Mass Effect™ Legendary Edition includes the entire trilogy, which has been remastered, and almost all of the original DLC. You play as Commander Shepard in an adventure of epic proportions that will decide the fate of the galaxy.\n\nThe story is simply amazing, featuring a rich universe with varied alien species and deep lore, along with legendary characters. This all comes to life with the excellent writing and voice acting. Nonetheless, I have to address the elephant in the room. The ending is unfortunately disappointing. For a game that changes so much based on your decisions, they are all ignored in the end. Regardless of what you've done, you will always have the same three choices to choose from. While this is regrettable, the journey leading up to it is so outstanding that I still think this is one of the best games of all time.\n\nIn regard to the gameplay, Mass Effect is a third-person shooter with role-playing elements. Some of its features are definitely dated, but the games were originally released in 2007, 2010, and 2012, so this is understandable and it doesn't prevent me from enjoying it.\n\nThe graphics have been slightly improved, with better textures, lighting, and effects. The first entry is the one where the difference is more noticeable. The soundtrack is also very good, with some unforgettable music.\n\nMass Effect™ Legendary Edition is an astounding game that is up there among the greatest. This is Commander Shepard, and this is my favorite trilogy on Steam!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Greatest RPG trilogy of all time, and revisiting it was an absolute joy.\r\n\r\nI already played ME LE back when it launched on PS4 a good few years back, but Mass Effect on KBM is a transformative experience if you use your custom bindings to the fullest.  I played the whole trilogy back-to-back on Insanity, an Engineer in 1 and 2, speccing into Adept in ME3.  Being able to control your entire squad's power output with multiple binds is so much better than using the radial menu and two basic D-Pad commands on console.\r\n\r\nPerformance is great, and bugs are very minimal. Among the trilogy, I only encountered one bug in ME3 where if you save and quit after convincing the Eclipse to work with Aria, Captain Bailey will never contact you to complete the quest. You can mitigate this with the Trilogy Save Editor, however, and doing so took me no more than ten minutes.\r\n\r\nME1 has been given a new lease of life with the quality of life updates to its inventory, powers, achievements and progression. I recommend the new Level 30 Trilogy  style levelling system to get the most out of your builds.\r\n\r\nME2 is still superb, with one of the most daring intros in videogames and a bolstered roster of anti-heroes you can't help but care for by the end, where the game culminates in one of the most tense, heart-pounding and consequential finales in all of videogames.\r\n\r\nAnd ME3 feels amazing on a mouse, wow. It was my least fav of the trilogy on console, but on PC I appreciate its combat system so much more. Biotic combos are insanely overpowered and the refinements to melee and cover really shine on a mouse that can do all of that. Plus, it comes bundled with the extended cut, that alone is worth revisiting it. It now ranks as my 2nd favourite ME.  I still have very strong opinions about a certain Indoctrination Theory, but we'll be waiting until N7 Day to see if that has legs. \r\n\r\nIf you haven't already played ME, all I can ask is: why? You won't find a trilogy quite like this one.\r\n\r\nJack is the best romance and I'm tired of pretending she's not.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Classic trilogy that still stands to this date in almost every gameplay aspect. Flawless remaster.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I knew about this game for a while but never actually got around to playing it, mostly because i felt it was a bit outdated gameplay wise. 88hrs later THIS GAME IS INCREDIBLE and is now one of my favourites of all time, i love every bit of it and explore ever area and do all the side quests. This often goes on sale and you should 1000% buy it, the value for money is insane. Incredible story, combat is fun, and lots of replayability.\r\n\r\nOne of the best and most unique gaming experiences of my life.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you played the original trilogy way back when it was released, don't bother with the \"legendary\" edition. It doesn't really do anything special. But if you are graving to try the space opera again or haven't ever played these, then I can recommend it for sure if the game is on sale!\r\n\r\nA quick summary of each entry:\r\n- ME1: more talking, less shooting, super fun and interesting character and world dynamics, fun car and missions interesting characters, my favorite of the trilogy - easily. Also, the only one with driving around with the Hammerhead!\r\n- ME2: a few super boring characters - though most are amazing, not so cool vibe because there's non of that alliance military stuff, not a spectre either which kind of made Shepard and the missions less interesting, much more shooting than ME1 which I found tiresome.\r\n- ME3: even more shooting! Very much a military kind of vibes, most characters were sort of just rushed with their ending arcs, ending was a let down and collecting war assets did nothing, the worst in the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing trilogy of games that should be experienced by everyone, regardless of preference for RPGs. The story and characters make it special, with the gameplay being a nice add-on for me personally.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay may be a little dated, and not being able to holster in the third game can be slightly annoying; but other than that, this game has THE best story telling in gaming. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's Mass Effect. If you like Bioware narrative based RPG lites with their ensemble casts and straightforward map crawl xp grinds, you'll love it. Great story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mass Effect… I still remember buying the first game back in 2007 - an actual physical copy, a proper “licensed” one, as we used to say. I devoured it in just a few sittings. The same thing happened with the second game: once I started, I simply couldn’t stop. The third one, though, I never finished back then. What I do remember clearly are the endless online arguments about its ending. But honestly, I never understood what people were so angry about. Were they really upset just because Shepard dies? Even back then it seemed like a strange complaint to me - not every story has to end with a happy ending. Life itself usually doesn’t.\nRecently, I picked up the remastered trilogy on sale and finally played all three games back-to-back, with every piece of DLC included. And what can I say? It’s still an absolutely brilliant trilogy - powerful, emotional, unforgettable. God, what deep and alive companions BioWare created! Letting any of them die is simply unthinkable. I was ready to reload dozens of saves in Mass Effect 2 just to save everyone!\nAs for the ending, there was only one thing that bothered me: the final cinematic itself felt lazy, as if the developers were trying to cut corners. But despite that, I don’t regret a single minute I spent in this universe.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is not just one game; it's a deep, dark abyss of space operas and emotional investment. You play as Commander Shepard, the galaxy’s ultimate soldier, diplomat, and master of awkward elevator conversations.\n\nThe Legendary Edition polishes the first game into something genuinely playable and makes the entire trilogy feel cohesive. You get three massive sci-fi RPGs where every choice you make matters... right up until you reload a save because you accidentally said the wrong thing to Garrus.\n\nStop reading this. Go play it. Date an alien. Punch a reporter. Save the galaxy. It's the best sci-fi trilogy in gaming, hands down. I'm Commander Shepard, and this is my favorite review on the Citadel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a rough start (first game) due to graphics, controls,  and slow world building - but its SO WORTH IT!!! Second game is the best gameplay while the third is a masterpiece!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This collection is awesome and is a testament to legendary gaming. Your choices and actions matter, they have consequence that impact your ending from the first game to the last game. Of course don't forget the romance that adds a little spice to it all. This game got me emotional and caring for all the characters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ME: Legendary Edition is far the best way to play ME. The enhancements made to the trilogy are by far some of the most important aspects that made me buy the game in the first place.\n\nME1 had the most improvements: The combat, the graphics, the illumination and bug fixes (not all of the bugs are fixed, but can easily be patched with some mods).\n\nME2 still has the benefits of the graphics improvements, the textures seem so realistic even for a remaster.\n\nME3 had the least amount of changes, textures look a little bit better than in the original ME3 but nothing noticeable at first hand.\n\nWhy buy this edition? It has all the DLC's for all games (except for ME1 with Pinnacle Station, but that DLC's is not important for the story and ME3 has the Citadel DLC which is better than PS for ME1 and its the same thing). Besides, you can always find it on sale with a lot of discount, and with a lot I MEAN A LOT, like 80% to 90% most of the time.\n\nMy recommendations: Change the graphic settings in the menu for an optimal experience (being old games, your pc won't suffer if you play them but you need to customize the settings first), DON'T GET SPOILED because going blind is the best way to experience it, don't install mods until you play it once for the best experience.\n\nWhat else can I say? Is one of the best videogames trilogies of all time. And for the price... \n\nIf you ask, mods are very easy to install, so give them a try.\n\nSome of those reasons are why I have played this trilogy for so many hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It was nice to have a compilation of the games. Remastered graphics are a plus and the game runs a bit smoother than it once did. I really enjoyed the original games when I played them, although none quite as much as the first.\n\nOverall, I think the Legendary Edition is worthwhile.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everyone who picks up this trilogy is going to have a great time, but for those who love sci-fi, great storytelling, and amazing characters, it’s a must-play. One of the things I’ve always loved about the original series, and it’s still here, is that your save carries over from the first game through the rest, meaning your choices have a direct impact on what happens next. It really feels like one long playthrough.\n\n10/10 Experience - N7 for life",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Most underrated game series ever. The story is amazing, the characters are so beautifully written. I will forever love ME and will continue playing it over and over again. I just wish EA would've stayed away, BioWare was the goat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The GOAT. Never replicated, never even attempted again. The industry is long overdue for Mass-Effect-likes, and now with the rise of AA gaming that gives us what AAA refuses, and easier development tools than ever becoming available, I hope that we will begin seeing indie or middle-budget Mass Effect-likes. I for one would be absolutely content with the (by todays standards) rather simple shooting and abilities of the mass effect games. And so many of the side missions are often simply a handful of arenas linked by linear passageways. This could easily be done by indies or smaller teams. \r\n\r\nEven if good voice acting and writing is just as rare today, I'd rather see failed attempts at mass effect-likes than absolutely nothing, which is what we're getting now.\r\n\r\nIf you want to recapture the mass effect feel, the only recent game I've played that has a similar formula is the original Greedfall. It's a janky hidden gem.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I usually write stupid reviews for games but for this one im gonna be serious becaise I have a combined total of nearly 500 hours on mass effect LE on both PC and Playstation and it is genuinly one of the best games of all in my opinion. The story acriss all three games is absoutly amazing and it is the best RPG i have ever played, The fact that choices you make in the first game can have a lasting effect all the way to the third is crazy and makes it one of the best RPG's out there especially ones that are set in space. If you are looking for three absoutly amazing games to play through with an amazing story you should defiantly try a Mass Effect Legendary edition because not only do you get the three base games but you also get every single DLC for all three games as well and if your looking for a game with one of the best DLC's ever defiantly play through ME3's Citadel DLC as it is probably the best DLC i have ever played in a game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun 3rd person trilogy that holds up to the test of time.\r\nIF you are ignoring how it originally ended before this version.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Definitely not what people hype it up to be, but its still a fun sci-fi series where decisions sometimes matter. Some good characters though!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everyone should experience  this trilogy at least once.   the companions/party members are some of the best in gaming  and your choices   carry over from game to game and actually impact the story  in a meaningful way and it all just feels like one epic journey to save the galaxy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best trilogy in gaming.  Period.  Dont be sad that it ended.  Celebrate that some of the best developers were at the right place at the right time and that they made this.  And you got to play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute masterpiece of a trilogy!!\r\nI couldn't stop myself from crying after finishing it because of how much attached I got to the characters. Now I want another game 😭",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "when the first game came out, it was a revolutionary form of media. graphics were unheard of, advanced beyond measure. story well written. the trilogy as a whole, though, is a stiple of gaming media. everyone should play the trilogy at least once. it's from the time when AAA still meant \"good.\" and it's your own, unique space opera to play through as you see fit. we've seen big strides since, when it comes to branching narratives and action gameplay - none of it would be around if it weren't for mass effect. though the visuals are dated, they still hold up in 2026, for the most part. story is just as good as it always was. price is unbeatable - do yourself a favor and get this game. i recommend modding to get the original lighting and to tweak the characters and etc to your liking, too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I grew up playing Dragon Age Origins and have always heard the Mass Effect Trilogy is one of the greatest video game trilogies of all time, I finally got around to playing them this year (2025) and man...... everyone was absolutely right, while ME1 can be a bit outdated the story, characters and decision making is top tier and it only gets progressively better as you go through the games as well as improving gameplay little by little, while I think it is the weakest part of the series it isn't something that hinders the series for me, these games might have some of the greatest party members in any RPG ever and the Shore Leave mission in ME3 is one of my favorite side quests ever, I have never laughed so much while going through a mission, the ending for ME3 also left me with a few tears which hasn't happened to me since I beat Persona 4 Golden in 2020 when it released on Steam, if you're a fan of RPGs and especially having the freedom to make choices and those choices actually mattering, this is an easy recommendation!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "posiblemente mi trilogia favorita de los videojuegos , historia, personajes. escenas, lo ha pasado tiempo y el gameplay del 2 y 3 sigue estando  muy bien , muy recomendado",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the original ending I still love the Mass Effect Trilogy. Definitely one of my favorite games ever. Also I recommend getting the Happy Ending Mod, to give the story the proper send off it deserves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Combat is a bit janky, especially by modern standards, but it probably has the best lore ecosystem of any major gaming franchise. The story really is that good. It's easy to think of the trilogy as a cohesive, singular thing, and it's one of those experiences that's stuck with me. It's kind of an existential thing in the vein of Outer Wilds. Absolutely pick these up if they are on deep discount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Mass Effect Trilogy nails it as Shepard's galaxy spanning epic of unbreakable bonds, wise choices, and heroic triumphs. Combat is great and gets progressively better  in 2 and 3, story grips like no other. An absolute masterpiece 10/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One does not simply skip this trilogy, lest they be taken for a fool. \nSeriously, you absolutely have to play through these games at least once in your lifetime. They're not simply games, they're a whole new experience and frankly, they aged very well plus modding community is absolutely wild (but for virgin playthrough you should definitely play vanilla). Unlike newer games by many studios, Mass Effect has choices that matter, relationships that matter (not talking only about romantic ones you perv XD), has story that stays with you for some time after credits roll, and the way those three games work together, with a way to import your Shephard to the next game with all the choices you made, people that survived or died, allies and enemies you made, this creates very cohesive universe, so rare these days. \nDo yourself a favor. Assume control and play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Back when Bioware was one of the best game developers around. A lot of great graphical and quality of life improvements, but still the beloved ME we all fell in love with back in the day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So BioWare took their space opera masterpiece, gave it a fresh coat of paint, and made damn sure you noticed Miranda's ass in glorious 4K. Let's not pretend here—the game designers spent more time on those camera angles than most directors spend on their entire films. Every conversation with her might as well come with a disclaimer: \"Yes, we know what we're doing. Yes, it's intentional. Enjoy.\"\r\n\r\nThe good: You get all three games plus roughly 47 metric tons of DLC. Miranda's catsuit defies several laws of physics and possibly a few intergalactic treaties. The remaster means her curves got the HD treatment, and the camera makes absolutely certain you appreciate the craftsmanship. It's not subtle. It was never meant to be subtle.\r\n\r\nThe bad: Trying to have a serious conversation about her daddy issues while the camera is doing everything except pointing directly up. \"Commander, we need to discuss my genetic design\"\r\n\"I'm looking at the results, Miranda. The results are incredible.\"\r\n\r\nThe ugly: Realizing you've saved the galaxy three times and what you remember most is that loyalty mission ass shot.\r\nWorth every penny. No shame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! Played it originally on the console when it first came out and loving the updated graphics. Even though their eyes still look like they are perpetually in shock. I forgot how annoying the controls are as well, BUT- still a fun game for the story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "How did this go under my Radar? I feel like I have ripped the developers off for £4.99. Fantastic game, it has everything you were not expecting - this will be a cult classic in years to come, are they making any more??",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a wonderful remaster of an amazing sci-fi trilogy. One of my all time favorite games. And I still replay the whole thing now in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kick ass trilogy. ME1 was a bit of a slog for me, so I had to b-line the main story. (the gameplay just didn't do it). However once I got to ME2, everything clicked. Seriously such a good experience, where your choices matter, and the fate of the universe is in your hands. cool stuff. sucks we won't ever get a good thing in this universe again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "How would I even put what I've experienced with this game into words... it gave me a life of its own, the beauty and amount of content you get to experience and just how detailed and realistic story-wise building it is just so heartwarming. Loved the game and definitely became my 2nd favorite game ever, right after red dead redemption 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best CRPG/Action games out there. The story is great and it is fun to carry over your character and choices from previous games to the next one -- actions in Mass Effect 1 will impact Mass Effect 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man this is definition of LEGENDARY game.\r\nSad about how EA treated the 3rd game, but thankfully 1st and 2nd game laid such an INSANE road.\r\nIt was close to impossible to fail, EA tried their best... Legendary edition fixes those problems and you can now play easily top 10 game of all time.\r\n\r\nI recommend using mods, these are quite easy to install and use.\r\nHere is a good list:\r\n\r\nhttps://leilukin.com/links/mass-effect-le-mod-list/#important-notes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible collection.  I played these when they released, and they are just as enjoyable today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is astonishing how a game consisting of small rooms, shot/reverse-shot conversations, codex entries, and somewhat linear corridors can feel as big as a whole galaxy. There has been nothing quite like it since.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved the story and my squadmates so much I got post-game depression after it finished.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Listen, screw the meme- these are actually my favorite games on the citadel and off it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm Commander Shepard and this is my favorite game on the Citadel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mass Effect is one of those lighting in a bottle series. It has everything you want in a spacefaring adventure.  Romance, tragedy, a great cast of characters, great lore, great atmosphere, phenomenal music. Its a testament to how much the team that worked on this cared about their game. You don't see many AAA titles get this much love and care put into them and still feel complete. The DLC for the games also feel like a added touch to the game instead of a pointless cash grab. Long gone are the days where one game let alone 3 make you feel something. We were truly lucky to get this masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mass Effect has been my favorite game since it came out in 2007. This game is an enhanced version of the originals. The first game benefits the most from the graphics upgrade. Also nice that this version of ME includes controller support even though I still play with k+m because of preference.\nPinnacle Station and multiplayer isn't included since they don't add to the story. I was never a fan of multiplayer being forced into the 3rd game, but I kind of miss P.S. because the action was a fun break from all the talking and exploration. Also nice to play this game through Steam instead of the old EA Origins nonsense.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite game series of all time. It has it's quirks through out the series but overall, one of the most engaging stories I've ever experienced. I'm not much of a sci-fi person when it comes top video games, but what really drew me to this game was the characters and and how choices effect so many things through out the games. The characters in this game are all so fleshed out and great, you really grow attached to them through out the games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best stories in game history, only bad side is they could have been unified mechanics through all three game but they didn't. Still, I would highly recommend it to anyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Juego basico para tener en tu biblioteca, y a pesar del paso del tiempo a envejecido bien.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah it's classic AF. Nothing helps me wipe my brain from the monotony of regular life than immersing myself in an epic space opera RPG!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maybe this will help:  When Mass Effect first came out I played it through...\n\n\n...\n\n\nELEVEN TIMES IN A ROW!  Yes, addictive, enormous replay value and while I did not particularly enjoy the opening of the second game, the rest of it and Mass Effect 3 are masterpieces.  \n\nThis game series is one of only two I can recommend with so much enthusiasm.  RPGs are meant to make you feel.  By the end of the third game, if you're not feeling something, you have a stone heart.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game! It's so captivating in cutscenes & story, and the gameplay is very enjoyable! I can't overstate enough how much I love it :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have not done a complete playthrough on PC yet as I have only just started the first game, but I have put more than enough hours on console to leave a review here. The trilogy are my favourite RPG games to date. The first game might be difficult for some people to get into as it is extremely slow, but trust me, the rest of the games are worth it.\n\nThe choices you make drastically effect the progress/ experience of the current game and the next game in line. The combat, exploration, dialogue and soundtrack are fantastic. It does make you very immersed. The remastered graphics are very well done and you do not need a NASA spec PC to make this game look incredible.\n\nThe DLC included with the LE are also great but it is a shame the ME3 multiplayer never was imported to this version.\n\nI have been recommended by one of my mates to play this game with mods to change my experience. A player called Synth has made a modpack which has very good feedback for any of you are interested - \n\nhttps://youtu.be/7Eqg9fDClCM?si=kekdWWzu_nG_i6v4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have finished playing the game through at the time of writing this review. And I have very much enjoyed this game. From starting the first game and learning through talking to all sorts of species and reading through data collections to know more about this universe;. This game was very well made for back in 2007 and beyond and enhanced in this remake. The story is amazing i enjoyed it and the lore. It drew me in from our protagonist Comm. Shepard learning their past and going through the story and each game. It is interesting in a way that your choices matter i noticed it much more in the 2nd installment. And the lives of the other characters depend on our choices and much more. You transfer your shepard to each game and you determine the personality of shepard through dialogue and action choices. I wont delve into it much just got to try it for yourself. It is a realllly good game if you like story based, decision making, single player games. 10/10 from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes I never played it back in the day and I bought this trilogy for a few dollars and it's everything I wish Starfield was. Land on a planet, something to do (besides pick up rocks...my dig at Starfield).  I'm only into ME1 and the interface and combat is a little dated though but fun.  It's definitely intriguing and well written. It's a darn tooting shame what EA, Bioware and AAA gaming has become.\n\nJust a note for mod obsessed people like me,  Really got to mod it before starting the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is immersive and draws you in from the beginning.   The story is in depth and the characters are fully developed.  One of the best trilogy games on the market.  It stands the test of time.  If you aren't playing this game, you are missing out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played the Mass Effect trilogy multiple times over the years. The changes that were made in the Legendary editions make the experience much better. The replayability of this game is amazing. There are so many choices that can affect the story. This is a must have.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished 1 and 2. Both great games and look good, despite their age. Although 2 streamlined the gameplay in some areas (compared to one), it felt slightly more linear. Hope 3 will be best of both worlds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing. great weapons, story and especially characters. i play all games once a year since their release  always a blast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mass Effect 1 is one of my top 10 favourite video games in my lifetime--maybe even #1--and the whole series is a standout, forever-favourite. \r\n\r\nThe story is so phenomenally told, with characters that are unique, fascinating, and satisfyingly complex. Many of the cast of characters will forever possess a piece of my heart (especially Commander Shepard themself, Liara, Garrus, and Tali'Zorah, Joker, Jack, Miranda, EDI, Cortez)--though, ahem, we don't talk about Jacob.\r\n\r\nThe games also have a gorgeous soundtrack that draws you into the wardrum heartbeat of the series, though there are plenty of tracks suited to thoughtful character moments, and capturing the sheer majesty of setpieces (like seeing the Destiny Ascension and the Citadel for the first time--WOW!). \r\n\r\nThe Legendary Edition updates a ton of textures, and consolidates everything into a clean menu of the three games that keeps it all feeling consistent and meaningful across the trilogy. \r\n\r\nSuper highly recommend--fantastic for fans of the series, and perfect for people picking it up for the first time. I wish I could experience it all for the first time, but honestly, every time I play this immersive game is a joy. Mass Effect always evokes a kind of wonder, passion, and curiosity all braided together that makes this game unforgettable and genuinely life-changing (especially for being one of the first games to ever show same-sex relationships; Liara and Jane/female Shepard will forever mean so much to me for that).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game and story are great \r\nStory - 8/10\r\nGameplay - 7/10\r\nMusic -  9/10\r\nChoices matter and game decisions lead to a verity of different outcomes and endings so it is certainly replayable.\r\nTotal - 8/10 would recommand anyone who did not play this yet and likes Sci-fi where decisions matter story with shooter/ability gameplay if you pick this up you wont regret it.\r\n*Note it does require EA launcher and account to play on steam this is a negative but I would still recommend the game especially in current price.\r\n(This review is created after I completed all 3 games thoroughly including all side content)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I grew up with the original games, not that I likely should have, but I have always been facinated with this franchise. Anyone who knows me personally knows that Mass Effect is simply part of my personality, and have heard me talk about it at one point or another.\r\n\r\nThis game specifically gave little me all the DLC and addons she could hope for, and it brings joy to my heart every time I get around to playing it all once again. My Shepard has changed and grown with me through the ages, and it reflects who I am and who I want to be.\r\n\r\nThis game is and will always be one of my favorites. I will be forever thankful for getting to experiance every bit of it, from bullets to calibrations.\r\n\r\nIf you've read this far, you should just buy this game. It's so good, I promise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mass Effect Legendary Edition is one of the few games that made me feel genuinely attached to a fictional universe. It’s a rich, emotional journey that lets you build a story over dozens of hours and feel the weight of your choices. There’s a constant feeling that what you do matters, and that these characters are more than just NPCs. It's important that the story continues from one game to another and it's something that enhances your connection to the characters.\r\n\r\nThe game is full of quiet, human moments in between the big cinematic battles: talking to your squad in the ship. The world-building is rich (different species, cultures, politics) and it doesn't feel like a lore dump.\r\n\r\nThe Legendary Edition also makes the experience feel smoother and more cohesive. The game was never top of the line in terms of mechanics or gameplay or even graphics compared to respective competition. It is the feeling it leaves after completing the Trilogy. You feel like you've lived through an epic space story. So that makes it one of my favorite games and an unforgettable emotional experience in gaming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My absolute favorite game of all time. The trilogy is damn near perfect to me. I remember borrowing the original game on Xbox 360 from a friend around the time that the first Assassin's Creed came out. I took him back his game a day later and went and bought my own copy. Now I'm playing it for the hundredth time on PC with a few mods. I will never get tired of this trilogy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a good game, although not a huge fan of the updated style of controls/leveling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A timeless classic, even the weakest of the 3 games, storywise, is still better than 90% of new game releases nowadays. Memorable characters and fun gameplay. Clearly made by a completely different BioWare.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 ..100%.. best of the best. \n\nOne of the best games ever made (all 3 of them), wish they want to revive multipleplayer. Bioware should go back to their roots. Starting a new playthrough now AGAIN after playing DA:0 - I to exhaustion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best stories that actually is good through the entire series. I hope they make a remake one day. This is by far one of my favorite game series to exist to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "little janky like the original titles. Mass effect one feels a bit dated for sure. But the story and environment are great. Some really great a memorable characters. Mass effect 2 really gets the combat much better and has some of my favorite characters in all of gaming. Worth a play if you have not before.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strategy. Graphics. Story. All still hold up today. I can't add any more than what's already been praised for over a decade now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played 600+ hrs on ps4, pc mods make it 100% better best game Ive ever played not a shill just a touch of the tism.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10\n\nStory:\nThe story of the Mass Effect Trilogy (ME for short) follows the same path, trying to save humanity, and space itself, from an inevitable invasion. Although the main objective of each game is different, it all comes together to form a unique and spectacular storyline across the three games, one of the most memorable I’ve ever played.\n\nIf that wasn’t enough, the player has a lot to say about how the story goes with the constant choices they make, which actually impact the narrative, instead of giving you the illusion of choice. Depending on what you’ve done or what you say in certain dialogues, some characters may die or live, among other consequences. Even the more meaningless quest you think won’t alter anything may cause a character to appear or not in the next game.\n\nAnd very important to say if you didn’t know already: your character’s choices and design goes from one game to the next one. This means that it will feel like one unique game, one single story, divided into three acts. Romanced a character in one of the games? They’ll be there, waiting for you, on the next one.\n\n\nGameplay:\nMass Effect’s combat is based on a 3rd person shooter, with a large amount of weapons you can choose from (pistols, sniper rifle, shotgun…), while using yours and your crewmates’ abilities to win each battle. A lot of people enjoy the tactical side of this system, while I prefer to go sniping everything I see while they use their abilities on their own, which is a thing you can activate, at least in ME2 and 3. So you can play it as you see fit.\n\nCharacters:\nThis one is one of the other aspects of gaming where ME shines again. The trilogy grants us access to a ton of original characters, with their own individual personalities, likes, stories, quests, and abilities. You’ll surely fall in love with at least some of the characters, and you’ll hate others with such a burning passion… They definitely feel real, almost all of the time.\n\nYou’ll also get to know your crew deeply if you want to, as you can approach them and talk to them any moment you want, and they’ll have something to talk about most of the time. (ME 2 DLC characters, Kasumi and Zaeed, together with the ME3 crew, have stuff to say, but you won’t always be able to have a conversation with them). Anyways, the ME Trilogy has an amazing cast, not only your crew, but some NPCs as well, and might have some of the best companions in games. It also has some mid ones, but most of them are incredibly written during the entire trilogy. Not only that, but you’ll also be seeing characters from a past installment in the other games, which fills you with an incredible joy. And, sometimes, they’ll be joining your squad again.\n\nMusic:\n\nI’m not an expert on music, and while I’m playing I don’t really pay attention to it anyways, so take this with a grain of salt, BUT I think this game has some amazing music at some scenes and cutscenes, I remember specially at the ME1 finale.\n\n\nExtra categories.\nGraphics: Not as realistic as other games, but enjoyable anyways, do not look outdated at all, at least to me.\n\nLocations: Again, another aspect Bioware’s game shines at. Every planet you explore is unique, with unique landscapes, skies, color palettes… I remember entering a planet and seeing an enormous red sun in front of me. It was gorgeous.\n\nWorldbuilding: The games have a lot of ways to let you dig deep into the universe’s lore: you can ask characters about it, or you can look up the Codex, which has, and I mean it,  A LOT of information about the different races, characters, and locations, among others. Your crew also is very diverse, as you have a variety of alien races with you in the first and second game, although there is a predominance of humans in ME2’s squad.\n\nCharacterisation: It does not give as much freedom as other games do (Elden Ring or Baldur’s Gate, for example), because you're not playing your own character: you’ll be playing Commander Shepard, representing humanity in this war. You’ll be able to change a bit the hair and eyes, your face, and that’s it, even though there aren’t a lot of good hair options either. Still, I, a person who loves to creates character and was pretty disappointed at seeing the CC, managed to make a Shepard I enjoyed. \n\nWhen going to the next game, you can import your previous game character, or create a new one. If you import from ME1 to ME2, your eyebrows and beard will disappear (at least it was so in my case). I thought it would be horrendous to look at my character like that, but I got used to it, and ended up liking it after a few hours. In between ME2 and ME3, the hair grows back, fortunately, and you can also import and then edit whatever you want about your imported appearance, which I don’t think was an option in ME2.\n\nRomance:\n\nThere are a lot of romanceable characters between the three games, and I can only speak for one of them, but I believe that each romance is well paced and written. They feel realistic, some won’t want anything with you and some will just be straight so it will be a no-go, but the most romanceable characters are romanceable, I believe, and it feels like a genuine relationship. The one I did, which I will not be spoiling, was amazing and an incredible journey the end of which I’m still waiting to see (not finished playing ME3 yet).\n\nTotally recommended to any rpg fan who wishes to be inmersed in a sci-fi world, meet characters and companions, and shoot everyone in their way in this amazing story that takes your choices into account.\n\nEnding (SPOILER WARNING):\n1st game was good. The reaper invading the Citadel was amazing, the chase at Ilos to reach the conduit… But the battle itself was meh for me. Didn’t make Saren’s first phase as I made him kill himself, and then Sovereigned Saren was just a frog beaming at me. It was good, but not amazing.\n\n2nd game was good, but a bit weird. Suicide misson was a blast and felt like a real threat when two characters just die while trying to go the Collector’s base, but you really didn’t know what to expect. Then the game throws a Human Reaper at you, which I loved, and I was actually surprised when the thing came up to fight us, but… we didn’t know what it was, what it was being made for or anything, just that it was something made by the reapers and using humans as energy. I didn't feel like “saving the universe”, but maybe that was just me being too fast and not reading important dialogue (I think I did pay attention to everything, but who knows).\n\nHaven’t finished ME3, so I’ll see if it goes better than its predecessors or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ever made, but this remaster isn’t perfect. The visual updates are solid, especially for ME1, and the gameplay feels smoother overall. But don’t expect a fully modernized remake — the animations, AI, and some clunky mission designs remain exactly as dated as you remember.\r\nIf you can accept those limitations, this collection delivers an incredible story and characters that still hold up. But if you’re expecting a complete overhaul, you might be disappointed.”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best Sci-Fi gaming trilogy of all time. Also one of my favorites. This is a perfect way to experience all 3 games. 10 / 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game destroyed me emotionally........... i REBUKE the ending! It never happened. My Shepard and Garrus are happy and relaxing on a beach, discussing what human-turian babies look like, I don't care!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great strory and game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR buy it on sale for $5\n\nME1 - Fun third person RPG Shooter with depth for the story and gameplay Completed on Insanity nearly 100%.\n\nME2 - Awkward arcade hide and peek shooter that continues the story from ME1. It is a significant downgrade gameplay wise. Working on first play through on Insanity, but it simply is a worse game than ME1.\n\nLong story less long:\n\nME 1: This is one of the best shooter RPG games I have ever played. Even though the graphics may be dated, the story is worth playing with good gameplay to back it up. The attention to detail in the world interactions rivals and beats games released in 2025. \n\nFrom social interactions that have implications later in the story, to physical interactions with the world, ME1 feels like a full game worth playing.\n\nI would recommend giving it a try if this is on your backlog.\n\nME2: It is alright - very similar to ME1, but there are differences. The gameplay is such a let down after ME1, it feels like some exec who didn't even play the first game made some changes on how the fundamentals work by stripping a lot of the core gameplay from the game:\n\n1.  There is no inventory system & you cannot swap weapons/armor during a mission.\n2. They managed to make the maps & navigation worse and less useful in ME2. Can't even access the ground map during a mission. ME1 you could access it and place a custom marker at any time.\n3. Weapon selection is limited and upgrading weapons is completely different.\n4. They took the ability to crouch out of the game. This SIGNIFICANTLY limits how you can play the game compared to ME1.\n\n In order to crouch, you have to be directly in front of cover and it is not a true crouch, more of a duck and cover.  \n\nExample why this is bad: I am standing, but the wall in front of me across some cross fire, could protect me if I could just MANUALLY CROUCH to hide from the enemy. In order to crouch, I have to go through cross fire that is currently blocked by a wall that will not provide protection if I crouch against it...but it is protecting me against the crossfire.\n\nUnFun fact: You cannot crouch against every wall, anyways.\n\n5. Sprint, Take Cover, Action/use are all mapped to same button.\n6. You auto heal outside of combat, you do not use medi-packs to heal anymore.\n7. They changed how weapons work in the universe, slightly. No longer do you have enough energy to run your weapon over the time the story takes place, but you now have depletable ammo. Ammo replaces the cooldown mechanic. \n\nThis puts organics another step back from [spoiler]the Reapers[/spoiler] technology wise.\n\nIt was fun sneaking around in ME1, slowly moving around corners and peeking for shots. I hope manual crouch is brought back in future games...\n\nI can see why people do not like Mass Effect 2. It is a stripped down version of ME1, with better graphics. The \"it does not feel like as much of an RPG as ME1\" comments are warranted. It doesn't.\n\n7. Also, they made bypassing circuitry just... a hidden puzzle matching game...\n\nAll in all, my only motivation for 2 is to finish the story, but I think I will just uninstall and read the lore online.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic game, looks brilliant, plays brilliant, is brilliant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best sci-fi RPGs ever created. First played it while at Uni and loved the interactions and options it gave you. It was one of the first games to do that therefore it left a great impression to me. Since then, other games with the same mechanic have surfaced but the feeling still stays with me.\r\n\r\nAmazing partnership and freedom with the team.\r\nLove the weapons and even sense of magic.\r\nGreat story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the best franchises I've played. Great story, combat, and characters. If you're hesitant on purchasing or playing, just pull the trigger. You wont regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is literally the best game ever made, there are no close seconds (except Assassin's Creed). This game needs a complete redevelopment. Strip everything down to the story and completely remake the game with modern graphics, physics, combat, movements, etc. As well as some added features, like ship customization, buying properties, more planets to explore, and more. This game was, and still is, an absolute masterpiece, And it deserves a full modern day revival.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a great trilogy. The First game is a bit dated from a combat/gameplay standpoint, but the story is fantastic. 2 and 3 get progressively better, re:gameplay. If you take your time and get to know your squadmates, it really is a wonderful story that you will definitely get invested in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mass Effect (2007), Mass Effect 2, and Mass Effect 3 are a great trilogy of games. The Mass Effect \"Legendary Edition\" includes all three titles as well as some fixes, user interface updates, graphical improvements, etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I discovered this game in 2025, and it has been an absolute gem. Mass Effect is an epic adventure with memorable characters and compelling quests. It’s all in the name - it’s legendary.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game for the first time recently anD OH MY GAAWWWDDD I LOVE IT SO MUCH HOLY SHIT I BOUGHT IT ONE SALE BEST FOUR DOLLARS I EVER SPENT I'M NOW GOING TO BLOW MONEY ON MERCH HELL YEAH.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love these games. Playing them all bundled together really takes me back to the good old days. Play these games if you haven't already. The first game is a little long in the tooth. But I promise its worth playing and is quite endearing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "About 12 years since I first finished this series, and the emotional heights still hit just as hard. Coupled with top notch character writing and great gameplay, this series holds up as my favorite game series of all time - And seeing how I replayed it 4 times already, you can be certain I'll come back for more.\n\nBioware, thank you.\n\nAlso, don't fuck up ME5!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The greatest sci-fi rpg bar none. You own it to yourself to play it not once, not twice, but at least 3 times to get the full immersion of it all. And remember, all reapers must die.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't felt so close to characters since playing Persona 5. \r\nFirst game was rough because of mako. Everything else was a masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah it's a masterpiece. Less RPG than Dragon Age, but with a more consistent and better told story. \r\n\r\nOnly problem is EA's god awful launcher that makes we wish I'd pirated the game instead. Besides that, 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Mass Effect series are classics and should be played by everyone at least once",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A genuine story-telling and role-playing space-opera masterpiece. I cannot recommend this enough for anyone who's even remotely a sci-fi fan. The shooting mechanics are solid (though different) in all three games, and the visuals still hold up in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mass Effect trilogy is a must play for anyone who loves sci-fi and rpg games. By the goddess💙",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Without a doubt my favourite thing in the entire world is not being able to play a game I have purchased with real money offline.\n\nWhy (I mean, we know why: that sweet, sweet datamining that is provided by the EA launcher) does the game simply launch another launcher? Steam knows I've bought the game, just let me play the game!\n\nOnce it runs, great game. However be prepared for a lot of your spare gaming time to be taken up trying to get the infernal EA launcher to work properly. And make sure you have a stable internet connection. Couldn't possibly run a single-player, offline game without one because then EA won't be able to sell your game usage data to data brokers, heaven forbid!",
      "voted_up": false,
      "votes_helpful": 360
    },
    {
      "review": "Game won't start without being connected to the internet. Get rid of the EA launcher. Especially after the new acquisition. Stop requiring players to create accounts for third party launchers when selling games on steam. I only got this because it was on sale for $5. I already have these games on steam and my high praise (except Mass Effect 3 ending) reviews of this game series still stand.\n\n\nThis game isn't the improvement I had hoped for. It changed very little. The \"improved skin rendering\" in the trailer actually looks worse. I got the impression the character building and weapon systems would be condensed to being the same in every game, but no. This is pretty much just a game port. The game flaws have still never been fixed. In Mass Effect 1 the M35 Mako still gets stuck on random things and you have to reload to an earlier game or return to the Normandy. At some points  there are LESS options than the original games. In the original Mass Effect 2 you could modify your imported character's appearance. They removed that feature and now you have to manually type in your ME 1 character's appearance code if you want to fix the messed up eye brows imported characters get or start from scratch.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The Mass Effect trilogy is fantastic, but having to log into EA every time you just want to play the game makes for a frustrating experience. \r\nThe launcher also regularly forgets credentials and forces you to wait 10 minutes while they send you a security code, just so you can launch an application.\r\nI don't think I'll continue to buy EA games in future",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Like many I bought this out of nostalgia. I remembered back then that the gameplay was a bit meh, but the story was cool.\n\nIt has aged terribly. \n\nThe gameplay is abysmal. Nothing works as intended. After developping a character that was everything but a sniper, sniping was still way better than anything else thanks to the magic of landing headshot any baby would hit with a mouse. Your allies are bugged as f. They won't hold their position except when you want them not to, will or will not use a power you ask them to at random. The looting is all reskin of the same guns with 3 stats that are not explained.  Everything is super easy, super boring until it's insta death. Any mobile game offer better mechanics than this but also, 20 years older RPG games than this were way more advanced in term of tactics.It's bad tactical fights. \n\nWhat about the story? Well it was great back then. But the base line has raised by a lot as far as sci fi goes. The Expanse exists. Cyberpunk exists. It's still by far the best thing in this game and uncovering it for the first time may still be cool.  Still, the Renegade branch lacks clarity, many artifical choices in dialogs etc. \n\nI wonder if KOTOR wasn't actually better than this. I mean as far as this kind of RPG fights go, it's hard to do it worse than ME. And well, there are quite a lot of fights in that game.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Just refunded it, what a pathetic joke this is. You need to have an EA launcher installed on your computer to play it on this platform, so you have multiple launchers watching you, and running in the background just to play a single player game that you actually paid for. It shouldn't be sold on here if it requires stuff like that, it's just pure greed from Steam. Secondly, when I load in there is zero sound but there is sound on the main menu. Looking online, this has been an issue for multiple years now that they still haven't fixed, so I am angry for even trying to support them and actually paying for the game. Why pay for anything when you are treated like a leper.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unfortunately, the game requires the EA launcher, but after downloading it, it doesn't work—and without it, the game cannot be launched. I've tried many solutions and guides, but unfortunately, the constant updates to the EA app only make it worse and it can't be fixed. Give us our money back for the game, or make it possible to play without the EA app. I love Mass Effect and would like to try the Legendary Edition, but so far, I haven't been able to.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'd rather buy a copy of the game to show my support, and play a pirated version than deal with the annoying EA launcher.🤬",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Probably would have played it a lot sooner had EA's stupid app/DRM not prevented at every turn.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h1]Unlike Fine Wine[/h1]\n\nMass Effect did [i]not[/i] withstand the test of time.\n\nI have no idea what they remastered, because the game is exactly as I remember it from 2 decades ago. The Legendary Edition includes all DLCs, but I didn't see anything beyond the vanilla game after playing ~75% of ME1 (that's where I finally stopped, because I was beyond bored. I didn't even bother starting ME2 and 3). \n\nI remembered ME as having one of the best stories I've ever seen in a video game. After playing it again, I think it's a rather simple one rather poorly told. \n\nYou make some choices here and there, yes, but they are binary and you don't have to wonder about their consequences, because the game immediately tells you the moral outcome of your pick by awarding you Paragon or Renegade points. So, your options are always the same: to do what the game considers \"good,\" or what it considers \"bad.\"\n\nSurveying planets is boring and pointless. Landing on them is much worse, because doing so takes you to a large empty area with a bumpy terrain that is quite annoying to navigate with your bouncy and weirdly-controlled 6-wheeler. If you bother exploring them thoroughly, all you'll find is money, a few sad items, and/or your worst nightmare: a copy-pasted location. And I'm not even talking about some nice, complex place; no, I'm talking about a few interconnected square rooms filled with nothing but boxes -- and always the same 5 or so different boxes, because these are pretty much all the props available in the game.\n\nCombat is dull, consisting in your weapon overheating while you fire at bullet-sponges that move illogically. Having 2 squad mates joining you in battle is cool, but they act stupidly and frequently get in your way.\n\nYour characters have skill trees, but these are boring and uninspired. Also, you get a ton of skill points, likely enough to get 100% of skills on everyone (no strategic building required whatsoever). \n\nItems are dull as well. Weapons' stats consist in variations of damage/heat-sink/accuracy, armors' in variations of defence/shield/biotic or tech defence. That's all. The only interesting thing about items is that weapons and armors have slots in which you can install some mods, adding bonuses to them. That's nice, but the mods themselves are nearly as uninspired as everything else in the game.\n\nAll maps are small, all spaces tight, everything linear. The game's level design is the worst and laziest I think I've ever seen.\n\nTo wrap it all in a paper bag and set it on fire on your porch, Mass Effect requires EA's platform to be installed on your computer, and for it to run every time you start the game. After it just refused to open twice in a row as I was about to force myself to play the game for a few more minutes, I finally gave up on it. \n\nIn short, ME is terribly [i]dated[/i]. I thought it was a classic, but no -- it was just once good, in a time when there was simply nothing better. All the charm it had when initially released is gone. Now, it's just an embarrassing example of how awful [i]everything[/i] in games was 20 years ago. \n\nI loved this thing back in the day, and just gave the series a second, honest shot. But nostalgia alone can't save it. Mass Effect is now as boring as hell to old timers, and probably downright unplayable to newcomers. Even remastered, with all DLCs and a 90% discount, it's not worth playing -- not even for the story, which is what I personally went in for.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Play the game in other ways the EA Launcher is a pain in the butt to run.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "EA app makes this literally unplayable. Beat ME1. Was going to play 2 today, and now the EA app just won't launch the game citing cloud storage being over 1gb, which the save games aren't over 1gb, and they are all saved on my pc anyway, literally hot dumpster fire garbage EA not just letting the game run through steam, but through their awful app",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "EA continues to show just how trash they are with this pathetic excuse for a launcher. The game is unplayable on a fresh never before downloaded install. I make it to the splash screen then my game crashes. Yet another reason why fitgirl is a godsend for games with sorry excuses for 3rd party launchers. Talking to you EA and epic games. SMFH. Just get this game off fitgirl dont bother going through EA.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't play without installing EA DRM garbage. Recommend pirating rather than allowing EA to [strike] steal[/strike] make money off of your personal information.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good remaster, but very disappointing the multiplayer for the third game is not included.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got a bug that does not let get past game select menu. Tried what could be done to fix it, but apparently its a known issue that the devs refuse to fix. Game was just getting good too. What a shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completed all three games with all dlcs, Mass effect 1 is horrible tedious slog to get through, only thing good there is the world building and the fact the progression carries onto mass effect 2, Mass effect 3 started out strong, it has good combat and feels fluid, however the endings are fkn horrible, they are too forced and whatever choices you make in game dosent really matter that much also fk that child, the only game that is worth to play is mass effect 2. It has decent story, good characters and heavy weapon that you can use whenever you want. Overall disheartened :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The characters? Great.\r\nThe story? Great.\r\n\r\nThe experience for anyone who hasn't played before? Fucking abhorrent.\r\nI really have no energy to express just how absolutely god awful this game is for new players. I am 8 fucking hours into the first game of the trilogy and it's insane how absolutely terrible this game is from a gameplay standpoint. Some of the worst navigation I've ever experienced.\r\n\r\nAfter eight hours of trying to enjoy \"one of the best RPGs to ever exist\" I'm just so tired of how insanely terrible this game is to try to navigate and experience. Probably four hours of my gameplay have been spent running in circles and looking up guides on where the hell I'm supposed to go.\r\n\r\nI spent over 30 minutes alone just trying to figure out how to get off the damn ship at my first destination, because the game doesn't give you any clue at all, and the actual door for it is just a little hidden hallway designed to look like all of the other ones that don't lead anywhere.\r\n\r\nI had such high hopes for this to at least behave like a normal video game and play like a somewhat outdated one \"with really great story.\"` It held up to the story. It did not hold up to anything else\r\n\r\nOne of the worst gameplay experiences of any game I've ever touched. Let the clown awards come in.\r\nThis game absolutely sucks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot get the game to actually load. I can get the splash screen to show up, then it immediately crashes back to the main menu. I would hope Steam or EA has a fix to this, but they don't seem to. \nGoing to be very careful trying to fix this again, don't want to have Steam refuse a refund for a broken game because I hit 2.1 hours trying to fix a broken mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought it to play ME3 since I played it when was a kid and enjoyed a lot. The game is still a masterpiece, kinda reminds me of time when games was made to provide fun. BUT huge downvote for EA to not bring a multiplayer. This shows you how much they \"care\" about their players. Multiplayer in original ME3 was fire and not just \"addition\" to the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ME1 is playable and the only issue I have with it is inventory management\r\nME2 and ME3 are dogshit bad console ports where your biggest enemies are atrocious cover mechanics, invisible walls and claustrophobic railrodaed environments that do not allow for any kind of creativity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA Launcher is Cringe.\n\nWith that out of the way, honestly to me the Trilogy's narrative doesn't hold up at all. \n\nThe first game is great and establishes the world and a solid vibe game. The only complaint I have is that the companions are a bit vapid, but the game still rocks. \n\nThe second game sidelines the entire first game and elements established within. The first game established the Trilogy's main antagonist, how much of a threat they're going to be, and how the galaxy needs to start preparing now. What's the second game about? Oh human colonies are going missing and a human terrorist organization is using Shepard to investigate them. At least that would be the plot if the main meat of the game wasn't spent on making sure your companions' family troubles aren't resolved. The focus on the small bunch of characters takes away from the greater universe and the impending doom that will need to be resolved in the third game. \n\nImma be honest, I've played Mass Effect 3 before and trying to play it after 1 and 2 is a huge tone shift that makes the game feel like it's not a Mass Effect game. Unfortunately 2 set up 3 in a bad spot and it shows from the start. \"Oh no, the doomsday threat we were warned about in the first game is here! You know, that giant ship that basically required a whole fleet to take one down is now here in mass! What will we do?!\" Then Liara shows up with the blue prints for the Deus Ex Machina device and a point system that will determine if Shepards lives or dies in the either the Mountain Dew ending, the Mountain Dew Code Red ending, or in the Mountain Dew Voltage ending. But along the way, you get to rush by and resolve everyone else's problems because they wouldn't let you do so in the 2nd game due to babysitting duty. \n\nOverall, the launcher is cringe, the first game is good, the second one is fun but derailing, and the third is just a different game trying to fix everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "O combate desse jogo é asqueroso, não sei pra que serviu esse protótipo de remaster, os comandos são confusos e ineficaz, a IA é a coisa mais jumenta que já vi, pior que muito jogo mais velho, também não podia ter melhorado isso com essa coletânea? A câmera é dura e as vezes muito próxima do personagem. E por fim a HUD e interfaces do jogo num todo, nada prático ou intuitivo. Mesmo com um enredo interessante uma história boa e complexa não entra na minha cabeça como esse jogo é tão adorado. Simplesmente é frustrante demais ver o quão horrivel, com exceção do roteiro, esse jogo é.\nNOTA - Mass Effect 1: 5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried to give this game a positive review. It is so frustratingly bad at times. \nStory: Great, i love it. very well written and relly fun to experience.\nGameplay: ME1 is the best part, but a bit bland and old feeling. ME2 is just stupidly boring and aged worse than ME1. ME3 is litteral dogshit. The dodge and cover systems got way worse and on insane it is a real nightmare to play, because it keeps bugging out on you in the worst way possible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shockingly terrible after all I've heard about it, one of the worst main stream games I've ever tried to play. Movement and gun play are painfully slow and awkward, powers are used from a secondary menu that has to be opened mid gunfight, awful melee system, annoying cover mechanic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's been quite fun replaying the trilogy with updated graphics... but I feel like this was an incredibly low effort attempt at a Remaster.\r\n\r\nFor starters, the combat is every bit as tedious as the original trilogy-- especially ME2. All enemies act like bullet sponges, even on the easier difficulties. Combat isn't hard, it just gets frustrating having to empty a clip of 30-50 rounds into every single enemy. This is something that can literally be tweaked in a matter of seconds and wouldn't have taken more than a day to perfect. The devs just couldn't be bothered to do so. Squad powers and biotics (if you play adept) are extremely unreliable too, just like the originals. They fire off at weird angles and hardly ever behave as expected.\r\n\r\nHowever, most people-- myself included-- play for the characters and the story... but even that didn't manage to see any reasonable improvement. In fact, I've actually had a couple of errors that I never experienced with the original 3 games: and those are problems with the relationship system. In ME1, I was friendly with Liara, told her there wasn't anything romantic between us, and romanced Ashley... but somehow I ended up getting the Liara ending. I thought maybe I made a mistake and carried on... then, in the second game, I romanced Tali (as always) but acted friendly with Jack and told her there was nothing romantic between us... I then somehow got thrown into the Jack romance, locked out of the Tali romance (\"end things with Jack\", which I couldn't do because Jack refused to talk to me), and then when I met with Liara she said she was \"tossed aside for a tattooed woman with anger issues\"-- again, I never even started the romance with Jack, I started it with Tali.\r\n\r\nFor me, this is by far the worst issue because it means you have to frequently reload the game and time each interaction carefully. It wasn't a problem in the originals, so I don't see why it is suddenly a problem in the remaster. It's clearly something to do with the relationship points behind the scenes.\r\n\r\nSpeaking of Tali... the replacement photo of Tali still feels like a massive cop-out. There's clearly been no thought put into it whatsoever, which feels incredibly frustrating when the rest of the world-building has been so masterfully done. It's not just about this one character, it's about an entire race of people who are central to the plot... it should have been a massive reveal, but instead it was just thrown in there without a care in the world. Honestly, I'd rather they just deleted that scene than to try and fix one bad photoshop job with another. Her mouth isn't even close to the filter on her mask, it just looks weird. You can find dozens of speculative fan art of the Quarians which do a much better job of imagining their look.\r\n\r\nLastly, all of these issues would have been much easier to fix if console commands or mods were easy to use. I have no idea why the devs went out of their way to put so many roadblocks in the way to prevent players from doing these things, but it's just another reason to find this game disappointing.\r\n\r\nIf you have the originals-- download some graphics mods. \r\n\r\nIf you don't, wait until this game goes on at least 70% sale, and hopefully you won't be too disappointed. I, unfortunately, was.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was hyped to replay it- it happened to be on sale. Played it and was just kind of bored, not enough new stuff. It's one thing to improve the graphics but the design of the hubs is just flat and dull. Everything still seems lifeless and fake. They could have really improved it and added new content. Nowadays a few improved textures and shaders are enough. \n\nPlaying it again just made me take the rose-tinted shades off... no multiplayer? That is criminal! I used to really enjoy that back in the day and was actually one of the reasons I bought it again. Another thing I notice is that playing renegade is a bit hit and miss, your character seems to have been designed to be paragon. Would be better if they actually improved the game instead of just giving the artwork a new lick of paint. At least you can mod it to add a little bit more life into it. \n\nUltimately if you love the single player experience or haven't played it yet, it might be worth the cost to get all 3 games in one package but I was expecting a lot more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I need to play through all the games again because achievement triggers failed most of the time, which was a known issue when I first played through it.\n\nThere is NO co-op multiplayer whatsoever ported over from Mass Effect 3. Especially sad considering that we still got the co-op mode working in normal Mass Effect 3.\n\nAlso, I cannot stress this enough: [b][u]F!UCK THE EA LAUNCHER! REMOVE THAT POS SOFTWARE AS A REQUIREMENT! EVEN uPLAY WORKS BETTER THAN THIS PIECE OF CRAP![/u][/b]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm really sorry to all the fans out there, but Mass Effect just isn't a good game. The gameplay is below average, the graphics hasn't aged well and the first two games (haven't started the third at the time of writing) is plagued by so many bad decisions and systems that makes it feel like it was developed in a minor eastern European country on a budget of instant noodles and never play tested more than a few hours. The writing is pretty good but not amazing and the companions are likable but there are many titles that does better in both regards (Pillars of Eternity, Disco Elysium, Star Wars Jedi Survivor and Fallen Order, Dragon Age, Metro). \r\n\r\nIt just isn't a good game. It's not a bad game, but it's not good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy this.  Its been changed.  Its been EA-afied.  I only bought it now because I stole all three games back in the day and I was able to purchase all of them now for only $5.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never played the ME games before, seemed worth a try though. It's hard to really comment on them as a whole though because maybe this is just a bad port or something. But it's very janky.\n\nYou need to download EA's app to play the game at all, and if you don't make an account and log in then it will pop up every time you boot your PC up pestering you about it (even when you haven't loaded up Steam yet, never mind tried to play the game). There's no workaround for this, far as I can tell... and I did look.\n\nI've only touched ME1 and I've had problems with the game progression. There's barely any tutorial, I keep having to look up how to do basic things like holster weapons and heal. Load times are meh, graphics are worse than I expected for a modern remaster, but that's fine, I can forgive that.\n\nBut the BUGS. My god. I was prompted to write this review by the fact that I just barely got past the \"prologue\" section of the game and immediately hit a game-breaking bug (cannot access the galaxy map, and therefore can't... do much of anything, I'm stuck on the Citadel).\n\nI'll try reloading an old save and give those cutscenes another run-through, but this really doesn't bode well for the game overall. And I'm not eager for the experience of playing a game constantly worried that I'll be softlocked behind some random bug which makes my save unplayable.\n\nThe game itself, in terms of story and gameplay and so on, seems like something I could've been very into if I'd played when I was 14 but I can't say it feels especially engaging to me now. Still, I would've stuck with it if the game would actually work. Not sure if I will now. I'm not sure it's worth the effort. Shrugs.\n\nCan't recommend this at all, especially at the price. Not impressed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "An experience where, after each subsequent playthrough, it becomes more apparent how dumb the writing is.\r\n\r\nThe first game, as a standalone title, is pretty good though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Dogshit, runs like shit, looks like shit, quests are shit \"find out\" well thank you for that i guess i'm gonna talk to every fucking npc in this 10 story large spaceship... i hope bioware gets gutted and thrown away since every game of them seems to be dogshit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not optimized for WASD or controller, borderline unplayable. \nEA, why you do dis?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm still at the first one, but this one is so overwhelmingly NOT even passable in any regard other than story, setting and production values, which are OK (but certainly nothing more, with some really aggravating and facepalming moments), there's just no way the rest of the trilogy can save the package. An abundance of idiotic one-hit-kill mechanics coupled with limitations to saving that lead to having to do boring shit over and over again (a couple of the fights are really unreasonable to boot), the lack of any (!) character development, the worst/most uninteresting loot/equipment system I've ever seen (and with the spectre weapons you can get before the halfway point being the best in the game, all further weapon looting is pointless – and so are the millions of accumulating credits you can't spend on anything because there is nothing worth buying! this isn't even amateur level game design, it's retard level!), boring-as-fuck levelling which is completely unbalanced as well, psionic abilities all seem to do the same thing (namely, hindering your opponent for a few seconds – I can't tell a difference between them at all!), the abominable balance of main and side quests (speedrunners must love this though...), unskippable cutscenes, many, many bugs... and, most direly, the total and utter failure in the RPG aspect as you cannot choose even your own words (!), much less anything else between generally good and vaguely evil... and it's beyond reason itself, as predecessor Knights of the Old Republic was infinitely better in each and every single regard, and DA:O which came afterwards in almost all regards!\n\nEDIT: Game 2. Oh boy! There is more character development in the first 30 min than in game 1, but the actual gameplay is so much worse I simply cannot believe it! Only 4 to 6 things to level instead of some 15 (!), you can't specialise in weapons, the actual shooting feels way worse, the first (!) group battle is already next to unwinnable (and I did beat game 1 on hardest difficulty...) (– EDIT: and that's just par for the course... the difficulty is as insane as it is UNFAIR and UNREWARDING), health refills are gone apparently (or I cannot find them) and to top things off, I cannot figure out how to fucking map the quickslots (which I never used in the first game, as I was able to map the weapons to keys, WHICH SHOULD ALSO BE THE CASE HERE!). Fucking shit, the sniper scope doesn't even line up with your line of sight, LOLOOLOL.\n\nI cannot believe how hard they fucked up the gameplay compared to the already not very good first game! No inventory at all, four or five skills to level, no specialisation in weapons, still no feedback whatsoever – you are literally not told whether you hit an enemy or not, and what hits you in turn (even though the latter isn't as important as you can't protect yourself against different kinds of damage, OBVIOUSLY)! No way to boost your abilities in something like the insane garage fight (complete with the biggest video game sin that exists, infinitely respawning enemies – and that's against very limited ammo!!! Hell, after this shit I'll never complain about a game having infinite ammo again!), hell, the fuckers even took out health potions altogether!!! There's apparently quickslots but no apparent way to map them, so I have to change my weapon FROM THE FUCKING MENU EVERY SINGLE TIME!!! Oh and making the sprint key not only the same as Use but also Cover in this one means I will never buy another game from this developer again. OH and apparently this is a squad shooter, though you never actually KNOW what your henchmen are actually doing!!! And even if you did, they don't follow orders... even when my only desire is to send them into killzones so they distract the enemy from me actually carrying... which would be fine IF that mechanism WORKED.\n\nGame 2 is an action-adventure, not a shooter and certainly no RPG, and so many features were taken out compared to the first one it feels like DOS Shell vs Windows 95 (and not 3.1)! I've experienced quite a lot of hateful games in my 10 years of Steam, but this is one of the truly worst, most overrated experiences of all time. I can only imagine the advertising budget is where the big bucks behind this project were going, because otherwise this would not have spawned a franchise but fizzled out like some Daikatana or Duke Nukem Forever.\n\nI regret spending 4,79 on this fucking shit of a game, I really do. They did not test this game before releasing it, and they did not test the re-release either... what kind of people would do that... only the worst scum imaginable. Humanity doesn't DESERVE to be saved!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Have to do an ini edit to set the resolution to anything above 1080p in this \"optimized for 4K Ultra HD.\" version",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Piece of trash. “Greatest RPG of all time”? More like a basic CoD-like 3rd-person shooter with barely any mechanics and an incredibly boring gameplay loop. Not recommended in 2025",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Another game another required launcher.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this series, but the state it is in shouldn't be acceptable. DLCs have too many gamebreaking bugs and some aren't even avaible in Legendary Edition, main games have few smaller issues like broken side quests and NPCs. Voice-lips syncing ranges from good to none. Polish dubbing is supported only through 1st and 2nd game with exception of Mass Effect 2: Arrival DLC, and polish text translation in some instances (mostly 3rd game) seems to be done either by early google translate or english speaking intern with a dictionary. The fact you need internet connection while booting is another downside, tho I personally don't mind it.\n\nOverall, story, companions, the world, are all excellent, I love how multilinear ME2 and ME3 are (ME1 too, but to much lesser extent), it's a 3 act masterpiece.\n\nI DO recommend Mass Effect: Legendary Edition, just don't expect it to work perfectly, it's a beautiful mess, with emphasis on MESS.\n\nOh, and also, fuck EA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA DRM makes it difficult to get the game working, interferes with features like the Steam Overlay and Steam Input, and is always online so you can’t play the game offline. I haven’t tried it on the Steam Deck yet but I bet it will be even worse.\n\n\nNo matter how good this game is I strongly recommend others do not buy it in this form.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't play when the internet goes out for the 15th time. 0/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EA Launcher sucks",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Forgot about EA APP. Refunding.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fuck ea and their shitty launcher",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Reqires EA cra*p launcher",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashes all the time. EA is lost to us.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I didn't like it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "creeeediooooo jogo horrorosooooooooo....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't give your money to ea",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In 2007, Mass Effect 1 launched alongside Assassin’s Creed, Modern Warfare, The Witcher, Space Rangers 2, and Overlord.\nIn 2010, Mass Effect 2 released in the same year as Mafia II, Metro 2033, Fallout: New Vegas, Brotherhood, and Bad Company 2.\nIn 2012, Mass Effect 3 shared the stage with Dishonored, Far Cry 3, Diablo III, XCOM, Spec Ops, and Sleeping Dogs.\nI genuinely cannot find a single year where Mass Effect could reasonably be called “game of the year.”\n\nEveryone already knows the positives of the trilogy — hundreds of reviews have written them out in detail, so I won’t repeat them. But honestly:\n\nME1 is visually barren, mechanically empty, and painfully outdated — even by the standards of its own release year.\nME2 fixes some issues, but still looks and plays rough.\nME3 finally shows better visual direction and game design, but even then it can’t escape the core problems of the series.\n\nAnd even with nostalgia — even after multiple playthroughs — I have to admit:\nthese games aged terribly.\nThe gameplay is weak, the combat often frustrating, the visuals unimpressive, and Legendary Edition simply cannot fix the wasted potential of what should have been a defining space opera.\n\nBioware were always praised as “geniuses” and “RPG legends,” but in truth they only ever excelled at worldbuilding and storytelling. Gameplay? Interesting mechanics? Engaging combat? Never their strong suit. These games feel more like movies than interactive experiences — and not in a good way.\n\nLegendary Edition doesn’t revive the series; it exposes how creatively exhausted the studio was. Especially on higher difficulties the flaws become even more obvious:\n\nabsurd encounters where 10 krogan rush you in tight arenas,\n\npoorly balanced combat stretched out just to feel “challenging,”\n\nand the infamous Shepard clone DLC, which ends in a frustrating cycle of endlessly stripping and restoring barriers — a perfect showcase of how uncreative and tedious the gameplay can get.\n\nFor me, it all amounts to disappointment: a once-celebrated franchise that now looks like creative stagnation, shallow design, and a complete inability to deliver a truly engaging shooter experience.\n\nIn the end, Legendary Edition feels like a dull nail in the coffin of Bioware’s trademark game design — and a reminder of how much potential was squandered.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Every once in a while, I reinstall the game to see if EA has removed its client software.  Take Two did it with the old Bioshock games.  But, not EA.  It's still there.\n\nPart of that EA software runs in Windows all the time, even if you're not using Steam or playing any games.  Check your Task Manager.  And if you try to disable the process permanently, it has a watchdog that pops up a notice about fixing it every time you restart your computer.\n\nI didn't agree to ANY such behavior when I bought the ME games.  Those little yellow boxes on the store page that mention \"background use required\" are entirely too vague.  The average consumer would never expect it to mean something so invasive and unnecessary.",
      "voted_up": false,
      "votes_helpful": 1322
    },
    {
      "review": "Without a doubt my favourite thing in the entire world is not being able to play a game I have purchased with real money offline.\n\nWhy (I mean, we know why: that sweet, sweet datamining that is provided by the EA launcher) does the game simply launch another launcher? Steam knows I've bought the game, just let me play the game!\n\nOnce it runs, great game. However be prepared for a lot of your spare gaming time to be taken up trying to get the infernal EA launcher to work properly. And make sure you have a stable internet connection. Couldn't possibly run a single-player, offline game without one because then EA won't be able to sell your game usage data to data brokers, heaven forbid!",
      "voted_up": false,
      "votes_helpful": 360
    },
    {
      "review": "Great games. Great texture update. Sick of the EA launcher. Steam DRM is bad enough. I just want to jump into a game, not verify account, after account after account. I cant remember the password for everything and when I'm off work and want to play a game, I want to jump into a game NOW. Or have the option of offline play. I don't want more work by diggin into my emails to reset a pass for a damn game.\n\nDRM ception. DRM inside DRM. It's ridiculous\n\nDw though. GOG and piracy are gonna take the market share prettty soon. And targeting your customers in court for getting sick of these practices will INCREASE consumerr malcontent and drive this trend forward at a quicker rate.",
      "voted_up": false,
      "votes_helpful": 327
    },
    {
      "review": "I love this game and I will always sing Mass Effect's praises but having to fight the EA launcher for hours on end in a futile effort to get the game to open is not worth it. To whoever wants to play this game I would honestly say you're better off playing Mass Effect Legendary Edition on console.",
      "voted_up": false,
      "votes_helpful": 135
    },
    {
      "review": "I've been trying to get this game to work, but no matter what I do, EA Launcher makes it impossible to, everytime I try to install the damn launcher, it shows error, and when I managed to get it working, there was only more problems. And those god awful problems only got worse and more annoying. \n\nAt this point I will just buy console version of this game, so I don't have to bother anymore with this garbage launcher that is EA Launcher.\n\nI didn't download this game just to be kicked in the butt by EA.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I had Mass Effect and ME2 from way back. The EA launcher is on all of them now, including LE that I purchased, and it literalyl is the worst thing I've ever seen. I have been trying for two hours to play a game that worked fine before and all I get are password errors, after I successfully changed the password. I cannot recommend this much effort for any game, even this one.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I'd rather buy a copy of the game to show my support, and play a pirated version than deal with the annoying EA launcher.🤬",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "You have to create an EA account in order to play, stick to an offline disc.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Game won't start without being connected to the internet. Get rid of the EA launcher. Especially after the new acquisition. Stop requiring players to create accounts for third party launchers when selling games on steam. I only got this because it was on sale for $5. I already have these games on steam and my high praise (except Mass Effect 3 ending) reviews of this game series still stand.\n\n\nThis game isn't the improvement I had hoped for. It changed very little. The \"improved skin rendering\" in the trailer actually looks worse. I got the impression the character building and weapon systems would be condensed to being the same in every game, but no. This is pretty much just a game port. The game flaws have still never been fixed. In Mass Effect 1 the M35 Mako still gets stuck on random things and you have to reload to an earlier game or return to the Normandy. At some points  there are LESS options than the original games. In the original Mass Effect 2 you could modify your imported character's appearance. They removed that feature and now you have to manually type in your ME 1 character's appearance code if you want to fix the messed up eye brows imported characters get or start from scratch.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wanted to get into Mass Effect and deemed this sale the perfect time to do so. However, it's the EA launcher that ruins it for me. Not only is the entire download +100 GB due to the fact that you can't select which game to download, but dealing with EA at all is annoying in its own right. Without the launcher, I would recommend this.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I bought this edition a while ago. I'm on PC and the Legendary Edition had no option to change field of view. It's set narrow by default, which is fine if you're on a console looking at a TV across the room, but hot garbage if you're on a computer at a desk. There were no mods available to alter FoV at the time so I returned it. If they've since added FoV controls then this is a great purchase. If not then it's a still console port with shitty display options.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I really want to give a recommendation because the Mass Effect collection is great. The EA Launcher on the other hand, is an abomination that should never exist. It keeps asking me for verification for the millionth time and insists to synchronize saves even though I tell it not to. May whoever that came up with the EA Launcher die a painful death.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Game? AAA, top of the line, S tier, timeless classic.\n\n[b]EA's Launcher? Invasive, nosy, intrusive, bulky, clingy, smelly.[/b]",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "[b] Unfiltered Opinion:[/b] The Mass Effect franchise is single-handedly the pinnacle examples of what it means to over-promise and under-deliver. The game's fundamental lack of depth, ingenuity, and trust in the player renders the foundation of the game (where decisions allegedly matter) to be rotten to the core. This franchise does nothing more than fumble around in the dark for three games straight until the finale where it falls flat on its face. I have not, in recent memory, felt like my time was more disrespected than I was playing through Mass Effect 1, 2, and 3. For the supposed \"king of choice matters game\" this was a failure of epic proportions.\r\n\r\n[b] Filtered Opinion:[/b] Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "normally i would say it was one of the best games i have ever played \nbut now EA wants you to log in to their site and reinstall the game.... \nthe game was fantastic while Bioware had it but after EA it has only gone downhill and i am so sad and disappointed with what EA has done that it is hard to think that anything positive will happen in the future \n\nFUCK YOU EA FOR RUINNING THE BEST THING ABOUT MY YOUNG DAYS.\nMASS EFFECT WAS THE BEST GAME AND JUST FOR ALL THE SHIT YOU HAVE MADE, I WILL TELL EVERYONE I KNOW AND FORTHCOMING....... DON'T BUY ANYTHING TO DO WITH EA. THEY JUST FUCK YOU IN THE MOUTH AND ASS WHEN YOU BUY ANYTHING FROM THEIRS ........ \n\nBig disappointment.\nHate EA for what they have done to all the good old games.\nI'll just tell others that if EA has anything to do with the game, \"stay away from it, don't give those greedy assholes anything\"normally i would say it was one of the best games i have ever played \nbut now EA wants you to log in to their site and reinstall the game.... \nthe game was fantastic while Bioware had it but after EA it has only gone downhill and i am so sad and disappointed with what EA has done that it is hard to think that anything positive will happen in the future \n\nFUCK YOU EA FOR RUINNING THE BEST THING ABOUT MY YOUNG DAYS.\nMASS EFFECT WAS THE BEST GAME AND JUST FOR ALL THE SHIT YOU HAVE MADE, I WILL TELL EVERYONE I KNOW AND FORTHCOMING....... DON'T BUY ANYTHING TO DO WITH EA. THEY JUST FUCK YOU IN THE MOUTH AND ASS WHEN YOU BUY ANYTHING FROM THEIRS ........ \n\nBig disappointment.\nHate EA for what they have done to all the good old games.\nI'll just tell others that if EA has anything to do with the game, \"stay away from it, don't give those greedy assholes anything\"",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Just refunded it, what a pathetic joke this is. You need to have an EA launcher installed on your computer to play it on this platform, so you have multiple launchers watching you, and running in the background just to play a single player game that you actually paid for. It shouldn't be sold on here if it requires stuff like that, it's just pure greed from Steam. Secondly, when I load in there is zero sound but there is sound on the main menu. Looking online, this has been an issue for multiple years now that they still haven't fixed, so I am angry for even trying to support them and actually paying for the game. Why pay for anything when you are treated like a leper.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Great game, one of the greatest of all time.\nAbsolutely terrible terrible launcher that will randomly force you to close the game for an update, not accept your password that works fine on the website, randomly not work unless you reboot the whole system... It's like they are trying their best to make the experience terrible for paying customers.\nBad EA! Bad bad bad!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The Mass Effect trilogy is fantastic, but having to log into EA every time you just want to play the game makes for a frustrating experience. \r\nThe launcher also regularly forgets credentials and forces you to wait 10 minutes while they send you a security code, just so you can launch an application.\r\nI don't think I'll continue to buy EA games in future",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As of 9/29/25 do not buy this game even on sale unless you enjoy supporting anti-humanitarian regimes. Awful company (EA) somehow bought by even more awful people. Will never be giving them my money again.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "The original three games are masterpieces, probably Bioware's peak, even the much maligned Mass Effect 3. You can definitely see the quality start to suffer badly in ME3, and why it (and arguably Dragon Age Inquisition) were the last Bioware games worth playing despite both being more than a decade old at this point.\n\nUnfortunately, like everything Bioware and indeed EA have made in the past decade the remastered legendary edition manages to be a low effort, poorly done disappointment. Mass Effect 1 is the only game that can even really claim to be a \"remaster\" in the trilogy, with the visuals and previously very janky UI having been significantly rehauled. Brain dead AI and issues with inventory management from the original ME1 unfortunately remain.\n\nME2 and ME3 on the other hand are both buggier and jankier than the original games were when they came out 15 years ago. Minimal improvement has been made, there is no DLSS or even any decent anti aliasing options so those games will be full of jaggies unless you force anti aliasing elsewhere.\n\nThe fact that the game relies on the EA launcher to load means that a decent portion of the time it simply won't start up properly, forcing you to dig through the task manager and manually shut down the EA app process to get the game to even boot up properly.\n\nBasically the legendary edition is a great reminder of how Bioware used to make phenomenal games, with a low effort remaster showing us that they unfortunately no longer can deliver. The Mass Effect trilogy deserved a proper high effort remaster or remake, like we have seen recently with Oblivion Remastered and with the RE4, Dead Space and Demon's Souls remakes. Unfortunately this is anything but that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately, the game requires the EA launcher, but after downloading it, it doesn't work—and without it, the game cannot be launched. I've tried many solutions and guides, but unfortunately, the constant updates to the EA app only make it worse and it can't be fixed. Give us our money back for the game, or make it possible to play without the EA app. I love Mass Effect and would like to try the Legendary Edition, but so far, I haven't been able to.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "legendary game series. ea launcher is garbage and broken on Steam deck",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Sorry, I can't recommend any single player game that requires internet to play. The game is fine.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Probably would have played it a lot sooner had EA's stupid app/DRM not prevented at every turn.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is the culmination of Bioware's last great hurrah before being consumed entirely by the mediocrity by EA. It is a gorgeous trilogy.\n\nUnfortunately I can't recommend buying it, as EA managed to retroactively infect it by requiring that you launch through their terrible \"EA App\" launcher. Not only do you need an EA account (for a single player game), it also frequently just fails to run, requiring a full pc restart. The game runs fine if it ever launches, but you don't have access to a .exe, you are entirely at the mercy of this terrible app.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Like many I bought this out of nostalgia. I remembered back then that the gameplay was a bit meh, but the story was cool.\n\nIt has aged terribly. \n\nThe gameplay is abysmal. Nothing works as intended. After developping a character that was everything but a sniper, sniping was still way better than anything else thanks to the magic of landing headshot any baby would hit with a mouse. Your allies are bugged as f. They won't hold their position except when you want them not to, will or will not use a power you ask them to at random. The looting is all reskin of the same guns with 3 stats that are not explained.  Everything is super easy, super boring until it's insta death. Any mobile game offer better mechanics than this but also, 20 years older RPG games than this were way more advanced in term of tactics.It's bad tactical fights. \n\nWhat about the story? Well it was great back then. But the base line has raised by a lot as far as sci fi goes. The Expanse exists. Cyberpunk exists. It's still by far the best thing in this game and uncovering it for the first time may still be cool.  Still, the Renegade branch lacks clarity, many artifical choices in dialogs etc. \n\nI wonder if KOTOR wasn't actually better than this. I mean as far as this kind of RPG fights go, it's hard to do it worse than ME. And well, there are quite a lot of fights in that game.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "A comforting game to come back to, this is the third time I've owed the trilogy. ME2 was the first game I bought when I got an Xbox One, because the cover looked interesting and it was $3. It's still my favorite of the 3. For new players I recommend it with an asterisk: I think it's less overwhelming to play compared to modern shooters, but its mechanics are not as tight as you're likely used to. The voice acting and story are pretty good, it provides me with that space-like wonder. It's a hell of a deal for $10.\n\nEdit: game is absolutely ruined by the EA app integration, which now fully will not work on my Steam Deck (which I've played this on for 30 hours), broken overnight. It will also not run on my computer which previously I played 20 hours on, same timeout error about internet connection despite my wifi being fine. Unacceptable and now unplayable. Pick up Legendary Edition, just on GOG or console and NOT Steam.\n\nSyncing between devices is abhorrent with the EA client as well.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]Unlike Fine Wine[/h1]\n\nMass Effect did [i]not[/i] withstand the test of time.\n\nI have no idea what they remastered, because the game is exactly as I remember it from 2 decades ago. The Legendary Edition includes all DLCs, but I didn't see anything beyond the vanilla game after playing ~75% of ME1 (that's where I finally stopped, because I was beyond bored. I didn't even bother starting ME2 and 3). \n\nI remembered ME as having one of the best stories I've ever seen in a video game. After playing it again, I think it's a rather simple one rather poorly told. \n\nYou make some choices here and there, yes, but they are binary and you don't have to wonder about their consequences, because the game immediately tells you the moral outcome of your pick by awarding you Paragon or Renegade points. So, your options are always the same: to do what the game considers \"good,\" or what it considers \"bad.\"\n\nSurveying planets is boring and pointless. Landing on them is much worse, because doing so takes you to a large empty area with a bumpy terrain that is quite annoying to navigate with your bouncy and weirdly-controlled 6-wheeler. If you bother exploring them thoroughly, all you'll find is money, a few sad items, and/or your worst nightmare: a copy-pasted location. And I'm not even talking about some nice, complex place; no, I'm talking about a few interconnected square rooms filled with nothing but boxes -- and always the same 5 or so different boxes, because these are pretty much all the props available in the game.\n\nCombat is dull, consisting in your weapon overheating while you fire at bullet-sponges that move illogically. Having 2 squad mates joining you in battle is cool, but they act stupidly and frequently get in your way.\n\nYour characters have skill trees, but these are boring and uninspired. Also, you get a ton of skill points, likely enough to get 100% of skills on everyone (no strategic building required whatsoever). \n\nItems are dull as well. Weapons' stats consist in variations of damage/heat-sink/accuracy, armors' in variations of defence/shield/biotic or tech defence. That's all. The only interesting thing about items is that weapons and armors have slots in which you can install some mods, adding bonuses to them. That's nice, but the mods themselves are nearly as uninspired as everything else in the game.\n\nAll maps are small, all spaces tight, everything linear. The game's level design is the worst and laziest I think I've ever seen.\n\nTo wrap it all in a paper bag and set it on fire on your porch, Mass Effect requires EA's platform to be installed on your computer, and for it to run every time you start the game. After it just refused to open twice in a row as I was about to force myself to play the game for a few more minutes, I finally gave up on it. \n\nIn short, ME is terribly [i]dated[/i]. I thought it was a classic, but no -- it was just once good, in a time when there was simply nothing better. All the charm it had when initially released is gone. Now, it's just an embarrassing example of how awful [i]everything[/i] in games was 20 years ago. \n\nI loved this thing back in the day, and just gave the series a second, honest shot. But nostalgia alone can't save it. Mass Effect is now as boring as hell to old timers, and probably downright unplayable to newcomers. Even remastered, with all DLCs and a 90% discount, it's not worth playing -- not even for the story, which is what I personally went in for.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Play the game in other ways the EA Launcher is a pain in the butt to run.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "EA app makes this literally unplayable. Beat ME1. Was going to play 2 today, and now the EA app just won't launch the game citing cloud storage being over 1gb, which the save games aren't over 1gb, and they are all saved on my pc anyway, literally hot dumpster fire garbage EA not just letting the game run through steam, but through their awful app",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "EA continues to show just how trash they are with this pathetic excuse for a launcher. The game is unplayable on a fresh never before downloaded install. I make it to the splash screen then my game crashes. Yet another reason why fitgirl is a godsend for games with sorry excuses for 3rd party launchers. Talking to you EA and epic games. SMFH. Just get this game off fitgirl dont bother going through EA.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't play without installing EA DRM garbage. Recommend pirating rather than allowing EA to [strike] steal[/strike] make money off of your personal information.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good remaster, but very disappointing the multiplayer for the third game is not included.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got a bug that does not let get past game select menu. Tried what could be done to fix it, but apparently its a known issue that the devs refuse to fix. Game was just getting good too. What a shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completed all three games with all dlcs, Mass effect 1 is horrible tedious slog to get through, only thing good there is the world building and the fact the progression carries onto mass effect 2, Mass effect 3 started out strong, it has good combat and feels fluid, however the endings are fkn horrible, they are too forced and whatever choices you make in game dosent really matter that much also fk that child, the only game that is worth to play is mass effect 2. It has decent story, good characters and heavy weapon that you can use whenever you want. Overall disheartened :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The characters? Great.\r\nThe story? Great.\r\n\r\nThe experience for anyone who hasn't played before? Fucking abhorrent.\r\nI really have no energy to express just how absolutely god awful this game is for new players. I am 8 fucking hours into the first game of the trilogy and it's insane how absolutely terrible this game is from a gameplay standpoint. Some of the worst navigation I've ever experienced.\r\n\r\nAfter eight hours of trying to enjoy \"one of the best RPGs to ever exist\" I'm just so tired of how insanely terrible this game is to try to navigate and experience. Probably four hours of my gameplay have been spent running in circles and looking up guides on where the hell I'm supposed to go.\r\n\r\nI spent over 30 minutes alone just trying to figure out how to get off the damn ship at my first destination, because the game doesn't give you any clue at all, and the actual door for it is just a little hidden hallway designed to look like all of the other ones that don't lead anywhere.\r\n\r\nI had such high hopes for this to at least behave like a normal video game and play like a somewhat outdated one \"with really great story.\"` It held up to the story. It did not hold up to anything else\r\n\r\nOne of the worst gameplay experiences of any game I've ever touched. Let the clown awards come in.\r\nThis game absolutely sucks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot get the game to actually load. I can get the splash screen to show up, then it immediately crashes back to the main menu. I would hope Steam or EA has a fix to this, but they don't seem to. \nGoing to be very careful trying to fix this again, don't want to have Steam refuse a refund for a broken game because I hit 2.1 hours trying to fix a broken mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought it to play ME3 since I played it when was a kid and enjoyed a lot. The game is still a masterpiece, kinda reminds me of time when games was made to provide fun. BUT huge downvote for EA to not bring a multiplayer. This shows you how much they \"care\" about their players. Multiplayer in original ME3 was fire and not just \"addition\" to the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ME1 is playable and the only issue I have with it is inventory management\r\nME2 and ME3 are dogshit bad console ports where your biggest enemies are atrocious cover mechanics, invisible walls and claustrophobic railrodaed environments that do not allow for any kind of creativity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA Launcher is Cringe.\n\nWith that out of the way, honestly to me the Trilogy's narrative doesn't hold up at all. \n\nThe first game is great and establishes the world and a solid vibe game. The only complaint I have is that the companions are a bit vapid, but the game still rocks. \n\nThe second game sidelines the entire first game and elements established within. The first game established the Trilogy's main antagonist, how much of a threat they're going to be, and how the galaxy needs to start preparing now. What's the second game about? Oh human colonies are going missing and a human terrorist organization is using Shepard to investigate them. At least that would be the plot if the main meat of the game wasn't spent on making sure your companions' family troubles aren't resolved. The focus on the small bunch of characters takes away from the greater universe and the impending doom that will need to be resolved in the third game. \n\nImma be honest, I've played Mass Effect 3 before and trying to play it after 1 and 2 is a huge tone shift that makes the game feel like it's not a Mass Effect game. Unfortunately 2 set up 3 in a bad spot and it shows from the start. \"Oh no, the doomsday threat we were warned about in the first game is here! You know, that giant ship that basically required a whole fleet to take one down is now here in mass! What will we do?!\" Then Liara shows up with the blue prints for the Deus Ex Machina device and a point system that will determine if Shepards lives or dies in the either the Mountain Dew ending, the Mountain Dew Code Red ending, or in the Mountain Dew Voltage ending. But along the way, you get to rush by and resolve everyone else's problems because they wouldn't let you do so in the 2nd game due to babysitting duty. \n\nOverall, the launcher is cringe, the first game is good, the second one is fun but derailing, and the third is just a different game trying to fix everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "O combate desse jogo é asqueroso, não sei pra que serviu esse protótipo de remaster, os comandos são confusos e ineficaz, a IA é a coisa mais jumenta que já vi, pior que muito jogo mais velho, também não podia ter melhorado isso com essa coletânea? A câmera é dura e as vezes muito próxima do personagem. E por fim a HUD e interfaces do jogo num todo, nada prático ou intuitivo. Mesmo com um enredo interessante uma história boa e complexa não entra na minha cabeça como esse jogo é tão adorado. Simplesmente é frustrante demais ver o quão horrivel, com exceção do roteiro, esse jogo é.\nNOTA - Mass Effect 1: 5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried to give this game a positive review. It is so frustratingly bad at times. \nStory: Great, i love it. very well written and relly fun to experience.\nGameplay: ME1 is the best part, but a bit bland and old feeling. ME2 is just stupidly boring and aged worse than ME1. ME3 is litteral dogshit. The dodge and cover systems got way worse and on insane it is a real nightmare to play, because it keeps bugging out on you in the worst way possible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shockingly terrible after all I've heard about it, one of the worst main stream games I've ever tried to play. Movement and gun play are painfully slow and awkward, powers are used from a secondary menu that has to be opened mid gunfight, awful melee system, annoying cover mechanic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's been quite fun replaying the trilogy with updated graphics... but I feel like this was an incredibly low effort attempt at a Remaster.\r\n\r\nFor starters, the combat is every bit as tedious as the original trilogy-- especially ME2. All enemies act like bullet sponges, even on the easier difficulties. Combat isn't hard, it just gets frustrating having to empty a clip of 30-50 rounds into every single enemy. This is something that can literally be tweaked in a matter of seconds and wouldn't have taken more than a day to perfect. The devs just couldn't be bothered to do so. Squad powers and biotics (if you play adept) are extremely unreliable too, just like the originals. They fire off at weird angles and hardly ever behave as expected.\r\n\r\nHowever, most people-- myself included-- play for the characters and the story... but even that didn't manage to see any reasonable improvement. In fact, I've actually had a couple of errors that I never experienced with the original 3 games: and those are problems with the relationship system. In ME1, I was friendly with Liara, told her there wasn't anything romantic between us, and romanced Ashley... but somehow I ended up getting the Liara ending. I thought maybe I made a mistake and carried on... then, in the second game, I romanced Tali (as always) but acted friendly with Jack and told her there was nothing romantic between us... I then somehow got thrown into the Jack romance, locked out of the Tali romance (\"end things with Jack\", which I couldn't do because Jack refused to talk to me), and then when I met with Liara she said she was \"tossed aside for a tattooed woman with anger issues\"-- again, I never even started the romance with Jack, I started it with Tali.\r\n\r\nFor me, this is by far the worst issue because it means you have to frequently reload the game and time each interaction carefully. It wasn't a problem in the originals, so I don't see why it is suddenly a problem in the remaster. It's clearly something to do with the relationship points behind the scenes.\r\n\r\nSpeaking of Tali... the replacement photo of Tali still feels like a massive cop-out. There's clearly been no thought put into it whatsoever, which feels incredibly frustrating when the rest of the world-building has been so masterfully done. It's not just about this one character, it's about an entire race of people who are central to the plot... it should have been a massive reveal, but instead it was just thrown in there without a care in the world. Honestly, I'd rather they just deleted that scene than to try and fix one bad photoshop job with another. Her mouth isn't even close to the filter on her mask, it just looks weird. You can find dozens of speculative fan art of the Quarians which do a much better job of imagining their look.\r\n\r\nLastly, all of these issues would have been much easier to fix if console commands or mods were easy to use. I have no idea why the devs went out of their way to put so many roadblocks in the way to prevent players from doing these things, but it's just another reason to find this game disappointing.\r\n\r\nIf you have the originals-- download some graphics mods. \r\n\r\nIf you don't, wait until this game goes on at least 70% sale, and hopefully you won't be too disappointed. I, unfortunately, was.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was hyped to replay it- it happened to be on sale. Played it and was just kind of bored, not enough new stuff. It's one thing to improve the graphics but the design of the hubs is just flat and dull. Everything still seems lifeless and fake. They could have really improved it and added new content. Nowadays a few improved textures and shaders are enough. \n\nPlaying it again just made me take the rose-tinted shades off... no multiplayer? That is criminal! I used to really enjoy that back in the day and was actually one of the reasons I bought it again. Another thing I notice is that playing renegade is a bit hit and miss, your character seems to have been designed to be paragon. Would be better if they actually improved the game instead of just giving the artwork a new lick of paint. At least you can mod it to add a little bit more life into it. \n\nUltimately if you love the single player experience or haven't played it yet, it might be worth the cost to get all 3 games in one package but I was expecting a lot more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I need to play through all the games again because achievement triggers failed most of the time, which was a known issue when I first played through it.\n\nThere is NO co-op multiplayer whatsoever ported over from Mass Effect 3. Especially sad considering that we still got the co-op mode working in normal Mass Effect 3.\n\nAlso, I cannot stress this enough: [b][u]F!UCK THE EA LAUNCHER! REMOVE THAT POS SOFTWARE AS A REQUIREMENT! EVEN uPLAY WORKS BETTER THAN THIS PIECE OF CRAP![/u][/b]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm really sorry to all the fans out there, but Mass Effect just isn't a good game. The gameplay is below average, the graphics hasn't aged well and the first two games (haven't started the third at the time of writing) is plagued by so many bad decisions and systems that makes it feel like it was developed in a minor eastern European country on a budget of instant noodles and never play tested more than a few hours. The writing is pretty good but not amazing and the companions are likable but there are many titles that does better in both regards (Pillars of Eternity, Disco Elysium, Star Wars Jedi Survivor and Fallen Order, Dragon Age, Metro). \r\n\r\nIt just isn't a good game. It's not a bad game, but it's not good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy this.  Its been changed.  Its been EA-afied.  I only bought it now because I stole all three games back in the day and I was able to purchase all of them now for only $5.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never played the ME games before, seemed worth a try though. It's hard to really comment on them as a whole though because maybe this is just a bad port or something. But it's very janky.\n\nYou need to download EA's app to play the game at all, and if you don't make an account and log in then it will pop up every time you boot your PC up pestering you about it (even when you haven't loaded up Steam yet, never mind tried to play the game). There's no workaround for this, far as I can tell... and I did look.\n\nI've only touched ME1 and I've had problems with the game progression. There's barely any tutorial, I keep having to look up how to do basic things like holster weapons and heal. Load times are meh, graphics are worse than I expected for a modern remaster, but that's fine, I can forgive that.\n\nBut the BUGS. My god. I was prompted to write this review by the fact that I just barely got past the \"prologue\" section of the game and immediately hit a game-breaking bug (cannot access the galaxy map, and therefore can't... do much of anything, I'm stuck on the Citadel).\n\nI'll try reloading an old save and give those cutscenes another run-through, but this really doesn't bode well for the game overall. And I'm not eager for the experience of playing a game constantly worried that I'll be softlocked behind some random bug which makes my save unplayable.\n\nThe game itself, in terms of story and gameplay and so on, seems like something I could've been very into if I'd played when I was 14 but I can't say it feels especially engaging to me now. Still, I would've stuck with it if the game would actually work. Not sure if I will now. I'm not sure it's worth the effort. Shrugs.\n\nCan't recommend this at all, especially at the price. Not impressed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "An experience where, after each subsequent playthrough, it becomes more apparent how dumb the writing is.\r\n\r\nThe first game, as a standalone title, is pretty good though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Dogshit, runs like shit, looks like shit, quests are shit \"find out\" well thank you for that i guess i'm gonna talk to every fucking npc in this 10 story large spaceship... i hope bioware gets gutted and thrown away since every game of them seems to be dogshit",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}