{
  "positive": [
    {
      "review": "I like the game and battle mechanism and progression of the Angel Legion, and recommend the game. As an added feature the angels are gorgeous and are fun to watch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good graphics and game play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very fun free game to play. Of course like many games it wants you to buy this or that, but can enjoy most of the game without paying anything, very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this Game,takes a bit to getting use to but still learning.Highly recommend this game its a challenge.But Fun!! Lots of free stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful graphics, cool characters, and enjoyable gameplay. You can play without any donations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра 'Angel Legion' — это захватывающее приключение в мире фэнтези, где игроки собирают и развивают армию ангелов, сражаясь против сил тьмы. С первых минут погружаешься в атмосферу эпических битв и стратегических решений. Графика игры выполнена на высоком уровне, а детально проработанные персонажи и локации не перестают радовать глаз.\n\nБоевая система сочетает в себе элементы пошаговых стратегий и RPG, предлагая глубокую проработку тактики. Выбор ангелов, их умений и экипировки напрямую влияет на исход сражений. Есть множество режимов игры, от сюжетной кампании до PvP-арен, что обеспечивает разнообразие и реиграбельность.\n\nОднако, стоит отметить, что прогресс в игре может показаться несколько затянутым, особенно на более поздних этапах. Требуется время и терпение для развития своих героев до максимального уровня. В целом, 'Angel Legion' — это достойный представитель жанра, который придется по вкусу любителям фэнтези и стратегий.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look...i aint gonnna sugar coat it. Y'all know why you are all here...i know why i am here...lets just...\n\\\nENJOY THE BABES WOOOOOHOOOOOOOOOOOOOOOOOOOOOOOO",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun Game, so far so good.  Enjoying the progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gooning game. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still figuring this out, but cool so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is marvelous X3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great Waifu game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOTY 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uwuw coomer games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incroyable comme jeu",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":drool:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tggt",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Boobs\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Boobs\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Boobs\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Boobs\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Boobs\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Boobs\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Boobs\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Boobs\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Boobs\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ Boobs\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ Boobs\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Boobs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ Boobs\n☐ 10",
      "voted_up": true,
      "votes_helpful": 125
    },
    {
      "review": "I am enjoying this so far. Fast turn paced game and been progressing quickly. Marked as nsfw but there isn't any nudity scenes just some tiny outfits",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "a nice thing would be to have all the free dlcs in a bungle together for the sake of making it easy to download them but other than that it seems promising I give it 3/5 stars as its kind of a hassle downloading each free dlc which is currently 200+ manually",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Angel Legion is one of those idle RPGs that feels like a mix of gacha collecting and AFK grinding. The art style is flashy and the sci-fi anime theme makes it stand out a bit compared to the usual fantasy idle games.\n\nPros:\n\nBeautiful anime-inspired character designs with lots of variety.\n\nVery beginner-friendly—progress feels rewarding at the start.\n\nIdle system works well, so you can make progress even when offline.\n\nPlenty of content: campaigns, arena battles, and events keep it from being too empty.\n\nCons:\n\nHeavy reliance on gacha mechanics—you’ll need luck (or money) to get top-tier heroes.\n\nCan feel repetitive after a while since the gameplay loop is pretty standard for idle RPGs.\n\nBalance issues: some characters are way stronger than others.\n\nMicrotransactions are very present, which might be frustrating if you want to stay free-to-play.\n\nOverall:\nAngel Legion is a solid idle RPG if you enjoy collecting heroes and watching them auto-battle while you manage upgrades. It’s stylish, has nice visuals, and offers a lot of activities, but the grind and gacha system can test your patience. Good for casual play, but not something to dive into expecting deep, strategic gameplay.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It is labelled as nudity, however, this is actually a lot more placid than some RPG game armour...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Used to play on IOS. When they did some updates that made it more difficult to play on the phone, I did stop playing for a while. After getting a laptop and installing Steam. I got back into playing AL and have really enjoyed it. Started up a 2nd account since I beat the game and am now into the hard levels on my other profile! Definitely recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The \"hand holding\" tutorial style got annoying real quick.  After 20-30 minutes, I was ready to uninstall it.  But if you can deal with that until the end (after about 10 battles) eventually the game will actually let you control and explore things.\n\nEdit:  I found that if you kill the game in the middle of the tutorial, and then relaunch it, it at least allows you to adjust settings first, like turning off the annoying music and voice, and adjusting the volume.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I like the game and battle mechanism and progression of the Angel Legion, and recommend the game. As an added feature the angels are gorgeous and are fun to watch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "verry nice graphics, colors and character. I hope this game turn in to the action RPG game, so I can move the character like in the movie. I have a problem, i can't play the mobile version in IOS, please solve my problem. Thanks, great work",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game play and visuals are damn good. i run through main missions to kill time while bored and the rewards are pretty concise and steady. easy leveling but the grind is nice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very fun free game to play. Of course like many games it wants you to buy this or that, but can enjoy most of the game without paying anything, very fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is wonderful and easy to play, your not forced to get in game purchases but they are there if you want them, and over all? Great game so far.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love this Game,takes a bit to getting use to but still learning.Highly recommend this game its a challenge.But Fun!! Lots of free stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice gacha game with actual gameplay.\n\nMost other games like this just focus card/character collecting.  This one have overworld map exploring and some game modes require you to switch out party members, so you dont have to always stick out to your top six favorite.  You have to level-up some back ups.\n\nCharacter outfits and picture/gravure modes are not as elaborate as doa venus vacation, but as i said, this one has actual gameplay involve, so its not boring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As far as these type of games are concerned, it's a fine game. Chicks on the  battlefield.\nOkay, I've played a little more now and it's going to look like that's as far as I go. Paywall keeps me from progressing further. So, still thumbs up, but only because there's no middle ground here",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So very fun, but also a little too simple & just too time-consuming!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good graphics and game play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Angel Legion — Style, squads, and a surprising amount of depth\n\nTL;DR: Flashy visuals, striking heroine designs, and snappy, effects-heavy battles. Lots of modes and build paths keep the grind from going stale. Monetization exists (it’s a gacha), but the game gives you enough levers to tinker and progress if you’re patient.\n\nVisuals & Performance\n\nAngel Legion looks slick. Menus pop, skill cuts are crisp, and battle VFX land with satisfying punch without choking the screen. On a mid-range rig it runs smoothly; animations are clean enough to make auto-grind watchable instead of a chore. It won’t rival AAA art budgets, but for an anime-styled squad RPG, the polish is legit.\n\nThe Women (Character Design & Customization)\n\nLet’s be honest: the heroines are the headline. Designs range from elegant to dangerously extra, with good model work, distinct silhouettes, and flashy ultimates. Skins change the vibe meaningfully rather than just palette-swapping. Beyond eye-candy, each character’s kit actually nudges you toward different team comps—DPS nukers, sustain supports, debuff queens, and weird utility picks that reward experimentation.\n\nCombat (Fast, punchy, and readable)\n\nBattles are quick and kinetic. Timing your ult chains and buff windows matters, and the game rewards synergy over raw power. Boss fights toss in mechanics that make you care about turn order, shields, and cleanse timing. Auto works for dailies, but manual play is where you squeeze out those clutch clears.\n\nEndless Variety: “Do X things” (and then ten more)\n\nIf you like feeling busy in a good way, this delivers. You can:\n\nBuild: level, ascend, gear, rune/gene/skill trees, and link bonuses—multiple layers to min-max.\n\nTeamcraft: faction buffs, role coverage, speed tuning, counter comps.\n\nClimb: campaign, elite stages, boss towers, time-limited events, PvP ladders.\n\nFarm: resource raids, gear dungeons, daily trials with rotating modifiers.\n\nTinker: artifacts, loadouts, and situational builds for specific bosses.\nThere’s always one more upgrade path to push, which keeps the loop lively.\n\nQoL & Grind\n\nDaily routes are streamlined, with sensible auto-clear options and skip tokens to cut the time sink. The grind is real (it’s the genre), but checklists are tight enough that you can log in, bang out essentials, and log off without feeling trapped.\n\nMonetization\n\nGacha pulls and costumes exist. If you’re free-to-play, expect a slower climb—but smart team synergy, event rewards, and targeted farming can carry you further than you’d think. Whales will whale; everyone else can still progress.\n\nVerdict\n\nIf you’re here for striking heroines, crisp anime aesthetics, and fast tactical battles—with a buffet of modes and build systems to tinker with—Angel Legion is an easy recommend. It’s stylish, it’s punchy, and it gives theorycrafters plenty to chew on.\n\nScore: 8/10 — “Come for the angels, stay for the team-building.”\n\nShort blurb (for the summary line):\nFlashy anime visuals, top-tier heroine designs, and snappy battles wrapped in a mode-rich grind that rewards smart teamcraft. Gacha caveats apply, fun still wins.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful graphics, cool characters, and enjoyable gameplay. You can play without any donations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра 'Angel Legion' — это захватывающее приключение в мире фэнтези, где игроки собирают и развивают армию ангелов, сражаясь против сил тьмы. С первых минут погружаешься в атмосферу эпических битв и стратегических решений. Графика игры выполнена на высоком уровне, а детально проработанные персонажи и локации не перестают радовать глаз.\n\nБоевая система сочетает в себе элементы пошаговых стратегий и RPG, предлагая глубокую проработку тактики. Выбор ангелов, их умений и экипировки напрямую влияет на исход сражений. Есть множество режимов игры, от сюжетной кампании до PvP-арен, что обеспечивает разнообразие и реиграбельность.\n\nОднако, стоит отметить, что прогресс в игре может показаться несколько затянутым, особенно на более поздних этапах. Требуется время и терпение для развития своих героев до максимального уровня. В целом, 'Angel Legion' — это достойный представитель жанра, который придется по вкусу любителям фэнтези и стратегий.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look...i aint gonnna sugar coat it. Y'all know why you are all here...i know why i am here...lets just...\n\\\nENJOY THE BABES WOOOOOHOOOOOOOOOOOOOOOOOOOOOOOO",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its weird they censor stuff in an adult game. But its mildly fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice cant play the game anymore after playing this long",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game/story of characters and to gather items. Sometimes hit a wall but wait a while and eventually you get stronger to overcome it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun fast paced game i was very entertained right from the start.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very beautifully designed, addictive, and fun.\r\nProbably one of the best Idle RPG games I've played.\r\n\r\nWould for sure recommend you play this if you haven't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game, so far so good.  Enjoying the progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gooning game. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still figuring this out, but cool so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gacha game with actual gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its actually a fun turn based game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Советую в игре есть автобой дрочить стало ещё легче",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun and you can take your hands of the keyboord for abite",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have enjoyed the Game so far, not too far into yet, but I do like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm generally not a fan of Idle games, but this is cool!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and addictive!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is pretty easy to play and good to kill time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sweet game played it before but i like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For now i'm really enjoying the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty solid game for the genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is fun when you just need relaxing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and like the art",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like it its pretty cool so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IMHO a fun game enjoying it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is marvelous X3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great Waifu game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good rpg game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mediocre game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOTY 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a lot of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun way to pass time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uwuw coomer games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incroyable comme jeu",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the goon is so good bro my room still smells like cum",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Netter Zeitfresser",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems to be a friendly gacha.\n\nEdit 1 (Oct 4, 2025) : Ok, what a travel. I mean, it IS a friendly gacha, crafting seems fine and the music is wonderful... I'll be writing when I find something to write on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "it seems ok.... but I clicked \"i dont recommend\" because the game tags are dishonest. Probably a sad attempt at getting more gamers to install a game that has limited play draw beyond the first time playing.\nIf you dont mind meaningless grinding gameplay, or pay to win mechanics, with censored model content, then maybe its ok.\nI uninstalled it after a brief play through the tutorial and a little beyond. Seems like they tried to expand the complexity of game play a little, but having \"nude\" but censored scenes made it feel sad and pathetic. Either go whole hog and show everything, or remove the \"nude\" scenes al together.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "As you can see from my play time, I loved this game. It's a great game and I highly recommend playing it for free.\r\n\r\nI don't recommend spending any money on this game. At first you spend and succeed, spending gives you a boost that is impactful and pushes you through content faster, and there is a lot of content in this game. Then after a month or so they will begin the server merges and you roll the dice, will the server you merge with have stronger players than you making all your spending pointless or will they merge a weaker server and you are still invested.\r\n\r\nThe first merge I had was a weaker server so the money spent up until that point was not wasted, I was still in the top tiers, still earning the best rewards. The second merge was with a server nearly a month more advanced than mine, and I was pushed out of the top, losing all my daily rewards and benefits. All the money spent up until that point completely wasted, useless, unless I spends thousands of dollars to try and retake a month worth of progress from the older server.\r\n\r\nDon't make my mistakes, the game is great, play it for free. Don't spend a dime on this or you will eventually be sitting with the free players anyway when they merge with a stronger server.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Backloggd: https://backloggd.com/u/TGA_backloggd/review/3638847 \r\n\r\nSo I decided to try another one of these games, just to clear our my backlog and hard drive space and this has, once again, many of the same trappings of a freemium game.\r\n\r\nYou start up as a faceless commander who wakes up your first of these companions (and it appears the only one you really interact with outside of combat, beyond tapping others in their body) who trains this advanced android to take part in hunting down bandits that defy the galactic authority.\r\n\r\nYou can gain more androids and grow them in these pods because they are more like the character Melfina from Outlaw Star being a mixture of artifical and organic to create these androids that are made for combat, yet all look like beauty models that would fit better in a world with acting or modelling.\r\n\r\nAll of them look very familiar and the animated scenes you see feel like AI, though I have no idea if they really are or not, but they just have that same style as those many AI dating apps that YouTube likes to bombard you with so it's hard not to see them as being related.\r\n\r\nThe gameplay, just like so many, is essentially auto-play just like Hero Wars, Raid: Shadow Legends and so damn many others out there, making it so that even if you have a more tactical mind, you will do as well as anyone else with the exact same stats of characters and such. +/- RNG of course.\r\n\r\nI enjoyed flying the space ship around and the ability to skip the combat against groups of level 1 robot mobs to get the loot, though the equipment was a pain in the ass to deal with because of how, just like other games I've played in the past, you have all these qualities and what makes it more confusing is that the stats are not always the same, even if it's the same type of equipment. One piece of Soldier Breastplate might give +3.00% attack, but another will give you +1 Damage resistance and you need these sets to be matching because you gain passive buffs for doing this.\r\n\r\nThere are also sections where you travel around a room, not too unlike your own, for the mysterious girl to live in and over time unlock furniture for her place so you can walk in on her sleeping, lying down naked, napping on the sofa, showering and washing herself in the bath.\r\n\r\nNow, here's where you think a major selling point of this game might be as it advertises itself as an adult game and after Eros Fantasy I was expecting actual nudity, however, because of where this game comes from (China) you instead have a white haze that covers her body, as if she's wearing a dress of solid light! It's stupid and what's even worse is that it doesn't even work that well if you watch carefully you can see through it, so it just feels like it's especially useless and why it's getting an even lower score because if you can't even allow nudity in a game that advertises itself like this, then you don't deserve to even have THAT seen as a feature.\r\n\r\nYou get all the same problems too, multiple different currencies that have their own functions, containers that can be unlocked, but only after a time has elapsed (unless you pay the premium currency) obtaining resources that are on a timer (again, sped up with the premium currency) and ontop of all this, the English isn't very good either. Multiple spelling and grammatical errors, coupled with how the VO continues, even if you've skipped the dialog because you have already read ahead.\r\n\r\nI'd avoid this title, it's not worth it and it doesn't even have the nudity it tries to entice you in with to get you hooked on the gambling mechanics so just avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RUN, don't walk, RUN AWAY. It's crazy how this gam has more recent positive reviews than active players. If you want a gacha that has no endgame just gigantic progresss wall after gigantic progress wall for infinity. Watching your level 260 SS ranked angels hit level 170 A ranked enemies for 40k while they hit you for over 3 million, play it and maybe you can write a legitimate positive review.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "whole tutorial lasts 30 minutes with no way to skip it, and the game isnt even that good, feels like a shitty mobile to PC port.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generic gacha game with simplistic turn-based mechanics. The character designs are extremely uninspired and the story is unappealing. The only good part of the game are the illustrations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why is Asuka from Neon Genesis Evangelion on the lobby page of this terrible game?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "what on earth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Goon",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it seems ok.... but I clicked \"i dont recommend\" because the game tags are dishonest. Probably a sad attempt at getting more gamers to install a game that has limited play draw beyond the first time playing.\nIf you dont mind meaningless grinding gameplay, or pay to win mechanics, with censored model content, then maybe its ok.\nI uninstalled it after a brief play through the tutorial and a little beyond. Seems like they tried to expand the complexity of game play a little, but having \"nude\" but censored scenes made it feel sad and pathetic. Either go whole hog and show everything, or remove the \"nude\" scenes al together.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I don't see an tits? Do I have to keep playing or something? I thought this was Hentai/NSFW/nudity. I'm 3 hours in and no tits yet, no hentai, no NSFW/nudity. Kinda simple game, would be better if there were more tits. As of now, I do not recommend. They do give you stuff, but the IAP exist. Not as bad as other games.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "The generous rewards are not so generous. You progress faster in the fisrt 2 months than in the next 2 years unless you pay a lot. \nRecent updates were downgrades, taking the game back years graphically.  And now we have new bugs and glitches. \nAlso,  player friendly features were discontinued for monetization purposes.\n\nThere are lots and lots of resources. Some become obsolete in time, afterwards they pile up and there is nothing to do with them. Players asked for years to solve that issue but instead they were given downgrades. \n\nSupport only exists for payment issues, \nDiscord channel is useless. Players are free testers for bugs... And you wait for weeks for an answer about a bug due to witch you did not receive certain rewards then they say it was a translation error or a new feature.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is fine... but it's not something I would recommend to others.\r\n\r\nPros:\r\nThe graphics are fine.\r\nPlenty of systems, but not so many that you spend too much of your time on them.\r\n\r\nCons:\r\nCycle of pulling new players into new servers so they can feel powerful, and then merging servers so they will become week and spend money to progress.\r\nA sudden steep increase in difficulty regarding leveling your main character.\r\n\r\nHonestly, the only way to gain power at a decent rate is to pay money. If you don't, expect to spend a couple of years grinding.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "As you can see from my play time, I loved this game. It's a great game and I highly recommend playing it for free.\r\n\r\nI don't recommend spending any money on this game. At first you spend and succeed, spending gives you a boost that is impactful and pushes you through content faster, and there is a lot of content in this game. Then after a month or so they will begin the server merges and you roll the dice, will the server you merge with have stronger players than you making all your spending pointless or will they merge a weaker server and you are still invested.\r\n\r\nThe first merge I had was a weaker server so the money spent up until that point was not wasted, I was still in the top tiers, still earning the best rewards. The second merge was with a server nearly a month more advanced than mine, and I was pushed out of the top, losing all my daily rewards and benefits. All the money spent up until that point completely wasted, useless, unless I spends thousands of dollars to try and retake a month worth of progress from the older server.\r\n\r\nDon't make my mistakes, the game is great, play it for free. Don't spend a dime on this or you will eventually be sitting with the free players anyway when they merge with a stronger server.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Proof that if you spend a year learning coding, and aggressively abuse Generative AI Programs, you too can be aggressively Mid and somehow make money!",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Game is decent and graphics are great, but the game and all the DLCs are not tagged correctly. very misleading.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Backloggd: https://backloggd.com/u/TGA_backloggd/review/3638847 \r\n\r\nSo I decided to try another one of these games, just to clear our my backlog and hard drive space and this has, once again, many of the same trappings of a freemium game.\r\n\r\nYou start up as a faceless commander who wakes up your first of these companions (and it appears the only one you really interact with outside of combat, beyond tapping others in their body) who trains this advanced android to take part in hunting down bandits that defy the galactic authority.\r\n\r\nYou can gain more androids and grow them in these pods because they are more like the character Melfina from Outlaw Star being a mixture of artifical and organic to create these androids that are made for combat, yet all look like beauty models that would fit better in a world with acting or modelling.\r\n\r\nAll of them look very familiar and the animated scenes you see feel like AI, though I have no idea if they really are or not, but they just have that same style as those many AI dating apps that YouTube likes to bombard you with so it's hard not to see them as being related.\r\n\r\nThe gameplay, just like so many, is essentially auto-play just like Hero Wars, Raid: Shadow Legends and so damn many others out there, making it so that even if you have a more tactical mind, you will do as well as anyone else with the exact same stats of characters and such. +/- RNG of course.\r\n\r\nI enjoyed flying the space ship around and the ability to skip the combat against groups of level 1 robot mobs to get the loot, though the equipment was a pain in the ass to deal with because of how, just like other games I've played in the past, you have all these qualities and what makes it more confusing is that the stats are not always the same, even if it's the same type of equipment. One piece of Soldier Breastplate might give +3.00% attack, but another will give you +1 Damage resistance and you need these sets to be matching because you gain passive buffs for doing this.\r\n\r\nThere are also sections where you travel around a room, not too unlike your own, for the mysterious girl to live in and over time unlock furniture for her place so you can walk in on her sleeping, lying down naked, napping on the sofa, showering and washing herself in the bath.\r\n\r\nNow, here's where you think a major selling point of this game might be as it advertises itself as an adult game and after Eros Fantasy I was expecting actual nudity, however, because of where this game comes from (China) you instead have a white haze that covers her body, as if she's wearing a dress of solid light! It's stupid and what's even worse is that it doesn't even work that well if you watch carefully you can see through it, so it just feels like it's especially useless and why it's getting an even lower score because if you can't even allow nudity in a game that advertises itself like this, then you don't deserve to even have THAT seen as a feature.\r\n\r\nYou get all the same problems too, multiple different currencies that have their own functions, containers that can be unlocked, but only after a time has elapsed (unless you pay the premium currency) obtaining resources that are on a timer (again, sped up with the premium currency) and ontop of all this, the English isn't very good either. Multiple spelling and grammatical errors, coupled with how the VO continues, even if you've skipped the dialog because you have already read ahead.\r\n\r\nI'd avoid this title, it's not worth it and it doesn't even have the nudity it tries to entice you in with to get you hooked on the gambling mechanics so just avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RUN, don't walk, RUN AWAY. It's crazy how this gam has more recent positive reviews than active players. If you want a gacha that has no endgame just gigantic progresss wall after gigantic progress wall for infinity. Watching your level 260 SS ranked angels hit level 170 A ranked enemies for 40k while they hit you for over 3 million, play it and maybe you can write a legitimate positive review.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's simple, this is not a game, it's someone's BUSINESS, and there is only one rule, MONEY.\nFor this kind of games there should be a separate store or maybe even platform. This is a plague, a BANE of gaming industry. But, again, who cares?!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TLDR: This is a fun game for the first 20 hours, but it's hindered by having no real balance in your party makeup, and unique characters are locked behind a paywall, eventually you can't advance without money or waiting multiple days, and way too many attempts to get you to spend money while calling itself an 'Idle game\" make the game feel horribly disingenuous. \n\nA buddy asked me to see if the game was worth playing. He's a BAG (Broke-Ass Gamer) and has to be frugal with his money. After 100+ hours I'm at a point where I need to wait multiple days to upgrade my characters a tiny bit, taking a week to actually advance in the game without spending money.\n\nOverall: 2.3/5\nSound: 2/5\nGameplay: 1/5\nGraphics: 4/5\n\nSound: 2/5\nThe music is literally nothing to write home about. It was crisp and clear, but otherwise boring, and I had to turn the music off because it kept putting me to sleep. The voice overs were okay, I guess, though it isn't in English. I had it set to voice in Japanese, but at least one character still used a Chinese dialogue instead. That obviously needs work.\n\nGameplay: 1/5\nThis game bills itself as an \"Idle\" game. The desktop shortcut is titled, \"Angle Legion LSP Idle RPG\", after all. However don't be fooled, it's just another GACHA game, so I'll break this up into a couple of sections.\n\nCombat:\nCombat is limited to 20 turns. If you don't defeat all the enemies by the end of turn 20 you auto-lose. This is a mechanic that limits your advancement since you only gain resources from winning. The only exceptions are \"Arena\" matches where you gain participation currency. If you win you get more of that currency and usually some other currencies as well. Your characters can do a normal attack on every turn unless they are affected by sleep, stun, petrification, or dead. Normal attacks also increase energy by 2 points unless the character is affected by insulation. Unless affected by silence, when a character has at least 4 energy they can use a special attack that will do extra damage, may attack multiple enemies, and my apply status effects like stun, blind, silence, insulation, petrification, etc..\n\nLeveling:\nYou're characters don't level through experience, you have to spend in-game currencies to improve them, and even then they are cappped at Lv 60, 110, and 160 unless you \"evolve\" them using character \"Genes\". Anyways, you'll need genes of other characters or \"generic\" genes to get them to a \"breakthrough\" point, and then you'll need the characters' genes to push them to the next evolution tier. This isn't just tedious, it's where the GACHA mechanic comes in. I won't go into it, but you have significantly lower odds of getting the genes of an \"Angel\" than any other. Oh, and you either need to save up 100 genes of a character to unlock them or randomly pull the character from the gacha mechanic. Just to be clear, I've been playing for a month, having logged in every day, and accumulated over 100 hours of play and still have seven \"S\" tier \"Angel\" characters that are locked.\n\nCharacters:\nThere's almost no balance to the various characters. Yes, higher tier characters are more powerful than lower tier characters, but there is only one \"C\" tier character, four \"B\" tier characters, and no \"D\" tier characters, despite there being a checkbox for \"D\" tier in \"Gene Recycling\". These characters can only be upgraded to Lv 60.\n\nThere are 17 \"A\" Tier characters and they far eclipse the lower tiers because they can be upgraded to Lv. 110, equip UAVs that provide stat boosts and special effects in combat, and have three different skills: an attack, special attack, and a support skill. Meanwhile, the lower tiers can only be upgraded to Lv 60, can't equip a UAV, and don't have an support skill. \n\nStill, the \"A\" Tier characters are quickly eclipsed by \"Angels\" or \"S\" tier (and above) characters because they have a second support skill for a total four skill, can equip \"Elves\" which give them an HP shield, extra stat boosts, and a boost to a stat while the shield is at least 80% full, and effectively don't have a level cap. Even among these \"Angels\" however, there are some that stand out as particularly useful to have in your six person party.\n\nFirst, you must always have Maya in your party, as the game revolves around her. However, she is arguably the weakest character in your party for most of the time you'll be willing to play this game. You'll need to proceed through multiple story segments to unlock her memories and boost her effectiveness in battle. Until that time, she may actually be stuck at Lv 60 while the rest of your party are at Lv 110. She has 3 types of weapons, each of which have their own skills and stats, and will synergize with 6 different characters by altering their special attacks to have extra effects and damage. This is where any semblance of balance falls apart.\n\nSecond, you'll want to have two healers to have any hope of surving a fight with enemies at the same power level. There are two that you will absolutely want in your party: \"Gentle Healing\" and \"Sakura Dancer\". Gentle Healing has the ability to revive a single character per battle, and Sakura Dancer has the ability to remove adverse status effects from any character she heals.\n\nOkay, so that's three slots taken right? Well, we're about to fill a fourth with \"Raging Angel\" who has the ability to increase the energy of two characters in her row by 2 or more when she uses her special attack. She also has a chance to increase the energy of the whole party by 1 when she uses her normal attack or dies. She's far, far, too useful in the row with your healers to not use.\n\nSo, that leaves two slots for all the other \"Angels\" right? Wrong. Becuase of the added affects of the synergizing with Maya you're absolutely going to want specific characters depending on which weapon Maya is using. \n\nYou'll probably end up using the Scythe most often as it's ridiculously OP compared to the other weapons, being able to damage the entire front row, and the characters you can synergize with are also fairly powerful. You'll want \"Time Gaurdian\" who can stun the entire front row of the enemy team, and \"Arcane Scholar\", since when her turn comes will gain an extra point of energy and increase an allies energy by, and whom's synergized special will add 3 points of energy to herself and whoever she is in a column with. That means She will always have enough energy for her special after she uses her special the first time in combat and practically guaranteeing the character in front or behind her can do so as well. Combined with \"Raging Angel\" your party might never even approach running out of energy.\n\nIf you're using the Sniper, you'll want \"Bounty Hunter\", who can stun a column of enemies, and \"Time Jumper\", who can stun all the enemies.\n\nIf you're using the Katana, you'll want \"Justice Blade\" who can blind the entire front row, and either \"Tenka Fubu\" who can prevent the entire front row of enemies from gaining energy, or \"Deadly Shadow\", who can stun anyone she crits agaisnt.\n\nAs you can see, there's basically no balance among the charsters. Worse still, however, is the characters that you can only get by spending money. Every week or so there is an Event that offers an \"UP Recruit\" character. The game makes it seem like you can get them by spending a special limited time currency that drops during the event. Except the currency only drops during the first half of the event and the chances that you will accumulate enough of them to spend to redeem the event character without buying more of this currency approaches \"divide by 0\".\n\nEquipment:\nJust another GACHA mechanic to get \"S\" tier gear.\n\nGraphics 4/5\nArguably the reason that everyone even considers this game, the pretty girls. Yes, they are pretty, with many different outfits that you can dress them in. I'd give 5 points, however, there are [b]paid DLC outfits in a GACHA game.[/b] Minus one point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "whole tutorial lasts 30 minutes with no way to skip it, and the game isnt even that good, feels like a shitty mobile to PC port.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generic gacha game with simplistic turn-based mechanics. The character designs are extremely uninspired and the story is unappealing. The only good part of the game are the illustrations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a waste of your time.\r\nnothing interesting, just do chores to unlock more chores.\r\nyou can unlock some revealing outfits, but that's about it.\r\n\r\nI stopped playing when I had about 60k combat power and I kept losing to a 7.2k enemy. only to realize it's actually 72k combat power but the dev can't do basic math.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hidden paywall! So yes you can technically grind but it becomes so mind numbingly slow that it resembles something more like a chore than a videogame. You can't go back to earlier levels to grind with lower level enemies to build up experience and the crawl forward becomes so slow that the only viable way forward is to open your wallet. I can't complain too much, the game is free, but at this point I would imagine you would get much more out of a sixty dollar triple A game and it would probably come out cheaper.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game looked fun when i started, but when i dig in i found the progress way too hard and heres why:\n1-you have to charge alot money to become strong or take your hero to next level and when i say alot you should expect to spend 200~500$ per week.\n2-the servers open weekly and community die too fast which effect your legion/game progress. \n3-the chat system very has very high sensor which make it barely understandable and dose not have translate option.\n4-the options game play for Fun to Play (F2P) person very limited and takes forever to become strong. \n5-alot of lag and high consume of system requirement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The translation is horrible into English.  It barely makes sense.  The tags are misleading to say the least.  There are some nice jiggle physics when moving the models around, and I do like the fact that you can customize pretty much any character, but other than that, the game is just meh.  There are better games to play, overall I would give it 2/5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool Art even if it's ai\nbut there's not really any game to play here\nyou spend more time upgrading your characters than actual battles and everything else just feels pointless.\n\nShould have better interactions with the characters, make it serve some sort purpose\nCombat needs a redesign - Just press autoplay and watch for 98% of fights\nDidn't care for the story.\nIf you're going for adult theme, make it adult otherwise it's like a half baked apple pie.\n\nThere's just zero inspiration to keep playing, and you keep getting hit with popups like \"Buy this for only £14.99\"\nonly... XD pass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As soon players reach top of anny activity a server merger is announced and rewards are taken away,classic scam. Pity could have been ok ,sad greed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad:\n[list]\n[*]poor performance\n[*]inconsistent and unresponsive UI\n[*]bad writing\n[*]it's a gacha game\n[/list]\n\nNeutral:\n[list]\n[*]gameplay\n[*]recently updated 3D models\n[*]no energy mechanic\n[/list]\n\nGood:\n[list]\n[*]I like seeing the numbers go up.\n[/list]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Connection problems after update.\nshit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why is Asuka from Neon Genesis Evangelion on the lobby page of this terrible game?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trash game with AI arts",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "weird af dont play got dared",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ai gooner shit",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Booring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "what on earth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Goon",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it seems ok.... but I clicked \"i dont recommend\" because the game tags are dishonest. Probably a sad attempt at getting more gamers to install a game that has limited play draw beyond the first time playing.\nIf you dont mind meaningless grinding gameplay, or pay to win mechanics, with censored model content, then maybe its ok.\nI uninstalled it after a brief play through the tutorial and a little beyond. Seems like they tried to expand the complexity of game play a little, but having \"nude\" but censored scenes made it feel sad and pathetic. Either go whole hog and show everything, or remove the \"nude\" scenes al together.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I don't see an tits? Do I have to keep playing or something? I thought this was Hentai/NSFW/nudity. I'm 3 hours in and no tits yet, no hentai, no NSFW/nudity. Kinda simple game, would be better if there were more tits. As of now, I do not recommend. They do give you stuff, but the IAP exist. Not as bad as other games.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "The generous rewards are not so generous. You progress faster in the fisrt 2 months than in the next 2 years unless you pay a lot. \nRecent updates were downgrades, taking the game back years graphically.  And now we have new bugs and glitches. \nAlso,  player friendly features were discontinued for monetization purposes.\n\nThere are lots and lots of resources. Some become obsolete in time, afterwards they pile up and there is nothing to do with them. Players asked for years to solve that issue but instead they were given downgrades. \n\nSupport only exists for payment issues, \nDiscord channel is useless. Players are free testers for bugs... And you wait for weeks for an answer about a bug due to witch you did not receive certain rewards then they say it was a translation error or a new feature.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is fine... but it's not something I would recommend to others.\r\n\r\nPros:\r\nThe graphics are fine.\r\nPlenty of systems, but not so many that you spend too much of your time on them.\r\n\r\nCons:\r\nCycle of pulling new players into new servers so they can feel powerful, and then merging servers so they will become week and spend money to progress.\r\nA sudden steep increase in difficulty regarding leveling your main character.\r\n\r\nHonestly, the only way to gain power at a decent rate is to pay money. If you don't, expect to spend a couple of years grinding.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "As you can see from my play time, I loved this game. It's a great game and I highly recommend playing it for free.\r\n\r\nI don't recommend spending any money on this game. At first you spend and succeed, spending gives you a boost that is impactful and pushes you through content faster, and there is a lot of content in this game. Then after a month or so they will begin the server merges and you roll the dice, will the server you merge with have stronger players than you making all your spending pointless or will they merge a weaker server and you are still invested.\r\n\r\nThe first merge I had was a weaker server so the money spent up until that point was not wasted, I was still in the top tiers, still earning the best rewards. The second merge was with a server nearly a month more advanced than mine, and I was pushed out of the top, losing all my daily rewards and benefits. All the money spent up until that point completely wasted, useless, unless I spends thousands of dollars to try and retake a month worth of progress from the older server.\r\n\r\nDon't make my mistakes, the game is great, play it for free. Don't spend a dime on this or you will eventually be sitting with the free players anyway when they merge with a stronger server.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Proof that if you spend a year learning coding, and aggressively abuse Generative AI Programs, you too can be aggressively Mid and somehow make money!",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Game is decent and graphics are great, but the game and all the DLCs are not tagged correctly. very misleading.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Backloggd: https://backloggd.com/u/TGA_backloggd/review/3638847 \r\n\r\nSo I decided to try another one of these games, just to clear our my backlog and hard drive space and this has, once again, many of the same trappings of a freemium game.\r\n\r\nYou start up as a faceless commander who wakes up your first of these companions (and it appears the only one you really interact with outside of combat, beyond tapping others in their body) who trains this advanced android to take part in hunting down bandits that defy the galactic authority.\r\n\r\nYou can gain more androids and grow them in these pods because they are more like the character Melfina from Outlaw Star being a mixture of artifical and organic to create these androids that are made for combat, yet all look like beauty models that would fit better in a world with acting or modelling.\r\n\r\nAll of them look very familiar and the animated scenes you see feel like AI, though I have no idea if they really are or not, but they just have that same style as those many AI dating apps that YouTube likes to bombard you with so it's hard not to see them as being related.\r\n\r\nThe gameplay, just like so many, is essentially auto-play just like Hero Wars, Raid: Shadow Legends and so damn many others out there, making it so that even if you have a more tactical mind, you will do as well as anyone else with the exact same stats of characters and such. +/- RNG of course.\r\n\r\nI enjoyed flying the space ship around and the ability to skip the combat against groups of level 1 robot mobs to get the loot, though the equipment was a pain in the ass to deal with because of how, just like other games I've played in the past, you have all these qualities and what makes it more confusing is that the stats are not always the same, even if it's the same type of equipment. One piece of Soldier Breastplate might give +3.00% attack, but another will give you +1 Damage resistance and you need these sets to be matching because you gain passive buffs for doing this.\r\n\r\nThere are also sections where you travel around a room, not too unlike your own, for the mysterious girl to live in and over time unlock furniture for her place so you can walk in on her sleeping, lying down naked, napping on the sofa, showering and washing herself in the bath.\r\n\r\nNow, here's where you think a major selling point of this game might be as it advertises itself as an adult game and after Eros Fantasy I was expecting actual nudity, however, because of where this game comes from (China) you instead have a white haze that covers her body, as if she's wearing a dress of solid light! It's stupid and what's even worse is that it doesn't even work that well if you watch carefully you can see through it, so it just feels like it's especially useless and why it's getting an even lower score because if you can't even allow nudity in a game that advertises itself like this, then you don't deserve to even have THAT seen as a feature.\r\n\r\nYou get all the same problems too, multiple different currencies that have their own functions, containers that can be unlocked, but only after a time has elapsed (unless you pay the premium currency) obtaining resources that are on a timer (again, sped up with the premium currency) and ontop of all this, the English isn't very good either. Multiple spelling and grammatical errors, coupled with how the VO continues, even if you've skipped the dialog because you have already read ahead.\r\n\r\nI'd avoid this title, it's not worth it and it doesn't even have the nudity it tries to entice you in with to get you hooked on the gambling mechanics so just avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RUN, don't walk, RUN AWAY. It's crazy how this gam has more recent positive reviews than active players. If you want a gacha that has no endgame just gigantic progresss wall after gigantic progress wall for infinity. Watching your level 260 SS ranked angels hit level 170 A ranked enemies for 40k while they hit you for over 3 million, play it and maybe you can write a legitimate positive review.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's simple, this is not a game, it's someone's BUSINESS, and there is only one rule, MONEY.\nFor this kind of games there should be a separate store or maybe even platform. This is a plague, a BANE of gaming industry. But, again, who cares?!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TLDR: This is a fun game for the first 20 hours, but it's hindered by having no real balance in your party makeup, and unique characters are locked behind a paywall, eventually you can't advance without money or waiting multiple days, and way too many attempts to get you to spend money while calling itself an 'Idle game\" make the game feel horribly disingenuous. \n\nA buddy asked me to see if the game was worth playing. He's a BAG (Broke-Ass Gamer) and has to be frugal with his money. After 100+ hours I'm at a point where I need to wait multiple days to upgrade my characters a tiny bit, taking a week to actually advance in the game without spending money.\n\nOverall: 2.3/5\nSound: 2/5\nGameplay: 1/5\nGraphics: 4/5\n\nSound: 2/5\nThe music is literally nothing to write home about. It was crisp and clear, but otherwise boring, and I had to turn the music off because it kept putting me to sleep. The voice overs were okay, I guess, though it isn't in English. I had it set to voice in Japanese, but at least one character still used a Chinese dialogue instead. That obviously needs work.\n\nGameplay: 1/5\nThis game bills itself as an \"Idle\" game. The desktop shortcut is titled, \"Angle Legion LSP Idle RPG\", after all. However don't be fooled, it's just another GACHA game, so I'll break this up into a couple of sections.\n\nCombat:\nCombat is limited to 20 turns. If you don't defeat all the enemies by the end of turn 20 you auto-lose. This is a mechanic that limits your advancement since you only gain resources from winning. The only exceptions are \"Arena\" matches where you gain participation currency. If you win you get more of that currency and usually some other currencies as well. Your characters can do a normal attack on every turn unless they are affected by sleep, stun, petrification, or dead. Normal attacks also increase energy by 2 points unless the character is affected by insulation. Unless affected by silence, when a character has at least 4 energy they can use a special attack that will do extra damage, may attack multiple enemies, and my apply status effects like stun, blind, silence, insulation, petrification, etc..\n\nLeveling:\nYou're characters don't level through experience, you have to spend in-game currencies to improve them, and even then they are cappped at Lv 60, 110, and 160 unless you \"evolve\" them using character \"Genes\". Anyways, you'll need genes of other characters or \"generic\" genes to get them to a \"breakthrough\" point, and then you'll need the characters' genes to push them to the next evolution tier. This isn't just tedious, it's where the GACHA mechanic comes in. I won't go into it, but you have significantly lower odds of getting the genes of an \"Angel\" than any other. Oh, and you either need to save up 100 genes of a character to unlock them or randomly pull the character from the gacha mechanic. Just to be clear, I've been playing for a month, having logged in every day, and accumulated over 100 hours of play and still have seven \"S\" tier \"Angel\" characters that are locked.\n\nCharacters:\nThere's almost no balance to the various characters. Yes, higher tier characters are more powerful than lower tier characters, but there is only one \"C\" tier character, four \"B\" tier characters, and no \"D\" tier characters, despite there being a checkbox for \"D\" tier in \"Gene Recycling\". These characters can only be upgraded to Lv 60.\n\nThere are 17 \"A\" Tier characters and they far eclipse the lower tiers because they can be upgraded to Lv. 110, equip UAVs that provide stat boosts and special effects in combat, and have three different skills: an attack, special attack, and a support skill. Meanwhile, the lower tiers can only be upgraded to Lv 60, can't equip a UAV, and don't have an support skill. \n\nStill, the \"A\" Tier characters are quickly eclipsed by \"Angels\" or \"S\" tier (and above) characters because they have a second support skill for a total four skill, can equip \"Elves\" which give them an HP shield, extra stat boosts, and a boost to a stat while the shield is at least 80% full, and effectively don't have a level cap. Even among these \"Angels\" however, there are some that stand out as particularly useful to have in your six person party.\n\nFirst, you must always have Maya in your party, as the game revolves around her. However, she is arguably the weakest character in your party for most of the time you'll be willing to play this game. You'll need to proceed through multiple story segments to unlock her memories and boost her effectiveness in battle. Until that time, she may actually be stuck at Lv 60 while the rest of your party are at Lv 110. She has 3 types of weapons, each of which have their own skills and stats, and will synergize with 6 different characters by altering their special attacks to have extra effects and damage. This is where any semblance of balance falls apart.\n\nSecond, you'll want to have two healers to have any hope of surving a fight with enemies at the same power level. There are two that you will absolutely want in your party: \"Gentle Healing\" and \"Sakura Dancer\". Gentle Healing has the ability to revive a single character per battle, and Sakura Dancer has the ability to remove adverse status effects from any character she heals.\n\nOkay, so that's three slots taken right? Well, we're about to fill a fourth with \"Raging Angel\" who has the ability to increase the energy of two characters in her row by 2 or more when she uses her special attack. She also has a chance to increase the energy of the whole party by 1 when she uses her normal attack or dies. She's far, far, too useful in the row with your healers to not use.\n\nSo, that leaves two slots for all the other \"Angels\" right? Wrong. Becuase of the added affects of the synergizing with Maya you're absolutely going to want specific characters depending on which weapon Maya is using. \n\nYou'll probably end up using the Scythe most often as it's ridiculously OP compared to the other weapons, being able to damage the entire front row, and the characters you can synergize with are also fairly powerful. You'll want \"Time Gaurdian\" who can stun the entire front row of the enemy team, and \"Arcane Scholar\", since when her turn comes will gain an extra point of energy and increase an allies energy by, and whom's synergized special will add 3 points of energy to herself and whoever she is in a column with. That means She will always have enough energy for her special after she uses her special the first time in combat and practically guaranteeing the character in front or behind her can do so as well. Combined with \"Raging Angel\" your party might never even approach running out of energy.\n\nIf you're using the Sniper, you'll want \"Bounty Hunter\", who can stun a column of enemies, and \"Time Jumper\", who can stun all the enemies.\n\nIf you're using the Katana, you'll want \"Justice Blade\" who can blind the entire front row, and either \"Tenka Fubu\" who can prevent the entire front row of enemies from gaining energy, or \"Deadly Shadow\", who can stun anyone she crits agaisnt.\n\nAs you can see, there's basically no balance among the charsters. Worse still, however, is the characters that you can only get by spending money. Every week or so there is an Event that offers an \"UP Recruit\" character. The game makes it seem like you can get them by spending a special limited time currency that drops during the event. Except the currency only drops during the first half of the event and the chances that you will accumulate enough of them to spend to redeem the event character without buying more of this currency approaches \"divide by 0\".\n\nEquipment:\nJust another GACHA mechanic to get \"S\" tier gear.\n\nGraphics 4/5\nArguably the reason that everyone even considers this game, the pretty girls. Yes, they are pretty, with many different outfits that you can dress them in. I'd give 5 points, however, there are [b]paid DLC outfits in a GACHA game.[/b] Minus one point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "whole tutorial lasts 30 minutes with no way to skip it, and the game isnt even that good, feels like a shitty mobile to PC port.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generic gacha game with simplistic turn-based mechanics. The character designs are extremely uninspired and the story is unappealing. The only good part of the game are the illustrations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a waste of your time.\r\nnothing interesting, just do chores to unlock more chores.\r\nyou can unlock some revealing outfits, but that's about it.\r\n\r\nI stopped playing when I had about 60k combat power and I kept losing to a 7.2k enemy. only to realize it's actually 72k combat power but the dev can't do basic math.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hidden paywall! So yes you can technically grind but it becomes so mind numbingly slow that it resembles something more like a chore than a videogame. You can't go back to earlier levels to grind with lower level enemies to build up experience and the crawl forward becomes so slow that the only viable way forward is to open your wallet. I can't complain too much, the game is free, but at this point I would imagine you would get much more out of a sixty dollar triple A game and it would probably come out cheaper.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game looked fun when i started, but when i dig in i found the progress way too hard and heres why:\n1-you have to charge alot money to become strong or take your hero to next level and when i say alot you should expect to spend 200~500$ per week.\n2-the servers open weekly and community die too fast which effect your legion/game progress. \n3-the chat system very has very high sensor which make it barely understandable and dose not have translate option.\n4-the options game play for Fun to Play (F2P) person very limited and takes forever to become strong. \n5-alot of lag and high consume of system requirement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The translation is horrible into English.  It barely makes sense.  The tags are misleading to say the least.  There are some nice jiggle physics when moving the models around, and I do like the fact that you can customize pretty much any character, but other than that, the game is just meh.  There are better games to play, overall I would give it 2/5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool Art even if it's ai\nbut there's not really any game to play here\nyou spend more time upgrading your characters than actual battles and everything else just feels pointless.\n\nShould have better interactions with the characters, make it serve some sort purpose\nCombat needs a redesign - Just press autoplay and watch for 98% of fights\nDidn't care for the story.\nIf you're going for adult theme, make it adult otherwise it's like a half baked apple pie.\n\nThere's just zero inspiration to keep playing, and you keep getting hit with popups like \"Buy this for only £14.99\"\nonly... XD pass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As soon players reach top of anny activity a server merger is announced and rewards are taken away,classic scam. Pity could have been ok ,sad greed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad:\n[list]\n[*]poor performance\n[*]inconsistent and unresponsive UI\n[*]bad writing\n[*]it's a gacha game\n[/list]\n\nNeutral:\n[list]\n[*]gameplay\n[*]recently updated 3D models\n[*]no energy mechanic\n[/list]\n\nGood:\n[list]\n[*]I like seeing the numbers go up.\n[/list]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Connection problems after update.\nshit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why is Asuka from Neon Genesis Evangelion on the lobby page of this terrible game?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trash game with AI arts",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "weird af dont play got dared",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ai gooner shit",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Booring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "what on earth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Goon",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it seems ok.... but I clicked \"i dont recommend\" because the game tags are dishonest. Probably a sad attempt at getting more gamers to install a game that has limited play draw beyond the first time playing.\nIf you dont mind meaningless grinding gameplay, or pay to win mechanics, with censored model content, then maybe its ok.\nI uninstalled it after a brief play through the tutorial and a little beyond. Seems like they tried to expand the complexity of game play a little, but having \"nude\" but censored scenes made it feel sad and pathetic. Either go whole hog and show everything, or remove the \"nude\" scenes al together.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I don't see an tits? Do I have to keep playing or something? I thought this was Hentai/NSFW/nudity. I'm 3 hours in and no tits yet, no hentai, no NSFW/nudity. Kinda simple game, would be better if there were more tits. As of now, I do not recommend. They do give you stuff, but the IAP exist. Not as bad as other games.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "The generous rewards are not so generous. You progress faster in the fisrt 2 months than in the next 2 years unless you pay a lot. \nRecent updates were downgrades, taking the game back years graphically.  And now we have new bugs and glitches. \nAlso,  player friendly features were discontinued for monetization purposes.\n\nThere are lots and lots of resources. Some become obsolete in time, afterwards they pile up and there is nothing to do with them. Players asked for years to solve that issue but instead they were given downgrades. \n\nSupport only exists for payment issues, \nDiscord channel is useless. Players are free testers for bugs... And you wait for weeks for an answer about a bug due to witch you did not receive certain rewards then they say it was a translation error or a new feature.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is fine... but it's not something I would recommend to others.\r\n\r\nPros:\r\nThe graphics are fine.\r\nPlenty of systems, but not so many that you spend too much of your time on them.\r\n\r\nCons:\r\nCycle of pulling new players into new servers so they can feel powerful, and then merging servers so they will become week and spend money to progress.\r\nA sudden steep increase in difficulty regarding leveling your main character.\r\n\r\nHonestly, the only way to gain power at a decent rate is to pay money. If you don't, expect to spend a couple of years grinding.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "As you can see from my play time, I loved this game. It's a great game and I highly recommend playing it for free.\r\n\r\nI don't recommend spending any money on this game. At first you spend and succeed, spending gives you a boost that is impactful and pushes you through content faster, and there is a lot of content in this game. Then after a month or so they will begin the server merges and you roll the dice, will the server you merge with have stronger players than you making all your spending pointless or will they merge a weaker server and you are still invested.\r\n\r\nThe first merge I had was a weaker server so the money spent up until that point was not wasted, I was still in the top tiers, still earning the best rewards. The second merge was with a server nearly a month more advanced than mine, and I was pushed out of the top, losing all my daily rewards and benefits. All the money spent up until that point completely wasted, useless, unless I spends thousands of dollars to try and retake a month worth of progress from the older server.\r\n\r\nDon't make my mistakes, the game is great, play it for free. Don't spend a dime on this or you will eventually be sitting with the free players anyway when they merge with a stronger server.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Proof that if you spend a year learning coding, and aggressively abuse Generative AI Programs, you too can be aggressively Mid and somehow make money!",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Game is decent and graphics are great, but the game and all the DLCs are not tagged correctly. very misleading.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Backloggd: https://backloggd.com/u/TGA_backloggd/review/3638847 \r\n\r\nSo I decided to try another one of these games, just to clear our my backlog and hard drive space and this has, once again, many of the same trappings of a freemium game.\r\n\r\nYou start up as a faceless commander who wakes up your first of these companions (and it appears the only one you really interact with outside of combat, beyond tapping others in their body) who trains this advanced android to take part in hunting down bandits that defy the galactic authority.\r\n\r\nYou can gain more androids and grow them in these pods because they are more like the character Melfina from Outlaw Star being a mixture of artifical and organic to create these androids that are made for combat, yet all look like beauty models that would fit better in a world with acting or modelling.\r\n\r\nAll of them look very familiar and the animated scenes you see feel like AI, though I have no idea if they really are or not, but they just have that same style as those many AI dating apps that YouTube likes to bombard you with so it's hard not to see them as being related.\r\n\r\nThe gameplay, just like so many, is essentially auto-play just like Hero Wars, Raid: Shadow Legends and so damn many others out there, making it so that even if you have a more tactical mind, you will do as well as anyone else with the exact same stats of characters and such. +/- RNG of course.\r\n\r\nI enjoyed flying the space ship around and the ability to skip the combat against groups of level 1 robot mobs to get the loot, though the equipment was a pain in the ass to deal with because of how, just like other games I've played in the past, you have all these qualities and what makes it more confusing is that the stats are not always the same, even if it's the same type of equipment. One piece of Soldier Breastplate might give +3.00% attack, but another will give you +1 Damage resistance and you need these sets to be matching because you gain passive buffs for doing this.\r\n\r\nThere are also sections where you travel around a room, not too unlike your own, for the mysterious girl to live in and over time unlock furniture for her place so you can walk in on her sleeping, lying down naked, napping on the sofa, showering and washing herself in the bath.\r\n\r\nNow, here's where you think a major selling point of this game might be as it advertises itself as an adult game and after Eros Fantasy I was expecting actual nudity, however, because of where this game comes from (China) you instead have a white haze that covers her body, as if she's wearing a dress of solid light! It's stupid and what's even worse is that it doesn't even work that well if you watch carefully you can see through it, so it just feels like it's especially useless and why it's getting an even lower score because if you can't even allow nudity in a game that advertises itself like this, then you don't deserve to even have THAT seen as a feature.\r\n\r\nYou get all the same problems too, multiple different currencies that have their own functions, containers that can be unlocked, but only after a time has elapsed (unless you pay the premium currency) obtaining resources that are on a timer (again, sped up with the premium currency) and ontop of all this, the English isn't very good either. Multiple spelling and grammatical errors, coupled with how the VO continues, even if you've skipped the dialog because you have already read ahead.\r\n\r\nI'd avoid this title, it's not worth it and it doesn't even have the nudity it tries to entice you in with to get you hooked on the gambling mechanics so just avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RUN, don't walk, RUN AWAY. It's crazy how this gam has more recent positive reviews than active players. If you want a gacha that has no endgame just gigantic progresss wall after gigantic progress wall for infinity. Watching your level 260 SS ranked angels hit level 170 A ranked enemies for 40k while they hit you for over 3 million, play it and maybe you can write a legitimate positive review.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's simple, this is not a game, it's someone's BUSINESS, and there is only one rule, MONEY.\nFor this kind of games there should be a separate store or maybe even platform. This is a plague, a BANE of gaming industry. But, again, who cares?!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TLDR: This is a fun game for the first 20 hours, but it's hindered by having no real balance in your party makeup, and unique characters are locked behind a paywall, eventually you can't advance without money or waiting multiple days, and way too many attempts to get you to spend money while calling itself an 'Idle game\" make the game feel horribly disingenuous. \n\nA buddy asked me to see if the game was worth playing. He's a BAG (Broke-Ass Gamer) and has to be frugal with his money. After 100+ hours I'm at a point where I need to wait multiple days to upgrade my characters a tiny bit, taking a week to actually advance in the game without spending money.\n\nOverall: 2.3/5\nSound: 2/5\nGameplay: 1/5\nGraphics: 4/5\n\nSound: 2/5\nThe music is literally nothing to write home about. It was crisp and clear, but otherwise boring, and I had to turn the music off because it kept putting me to sleep. The voice overs were okay, I guess, though it isn't in English. I had it set to voice in Japanese, but at least one character still used a Chinese dialogue instead. That obviously needs work.\n\nGameplay: 1/5\nThis game bills itself as an \"Idle\" game. The desktop shortcut is titled, \"Angle Legion LSP Idle RPG\", after all. However don't be fooled, it's just another GACHA game, so I'll break this up into a couple of sections.\n\nCombat:\nCombat is limited to 20 turns. If you don't defeat all the enemies by the end of turn 20 you auto-lose. This is a mechanic that limits your advancement since you only gain resources from winning. The only exceptions are \"Arena\" matches where you gain participation currency. If you win you get more of that currency and usually some other currencies as well. Your characters can do a normal attack on every turn unless they are affected by sleep, stun, petrification, or dead. Normal attacks also increase energy by 2 points unless the character is affected by insulation. Unless affected by silence, when a character has at least 4 energy they can use a special attack that will do extra damage, may attack multiple enemies, and my apply status effects like stun, blind, silence, insulation, petrification, etc..\n\nLeveling:\nYou're characters don't level through experience, you have to spend in-game currencies to improve them, and even then they are cappped at Lv 60, 110, and 160 unless you \"evolve\" them using character \"Genes\". Anyways, you'll need genes of other characters or \"generic\" genes to get them to a \"breakthrough\" point, and then you'll need the characters' genes to push them to the next evolution tier. This isn't just tedious, it's where the GACHA mechanic comes in. I won't go into it, but you have significantly lower odds of getting the genes of an \"Angel\" than any other. Oh, and you either need to save up 100 genes of a character to unlock them or randomly pull the character from the gacha mechanic. Just to be clear, I've been playing for a month, having logged in every day, and accumulated over 100 hours of play and still have seven \"S\" tier \"Angel\" characters that are locked.\n\nCharacters:\nThere's almost no balance to the various characters. Yes, higher tier characters are more powerful than lower tier characters, but there is only one \"C\" tier character, four \"B\" tier characters, and no \"D\" tier characters, despite there being a checkbox for \"D\" tier in \"Gene Recycling\". These characters can only be upgraded to Lv 60.\n\nThere are 17 \"A\" Tier characters and they far eclipse the lower tiers because they can be upgraded to Lv. 110, equip UAVs that provide stat boosts and special effects in combat, and have three different skills: an attack, special attack, and a support skill. Meanwhile, the lower tiers can only be upgraded to Lv 60, can't equip a UAV, and don't have an support skill. \n\nStill, the \"A\" Tier characters are quickly eclipsed by \"Angels\" or \"S\" tier (and above) characters because they have a second support skill for a total four skill, can equip \"Elves\" which give them an HP shield, extra stat boosts, and a boost to a stat while the shield is at least 80% full, and effectively don't have a level cap. Even among these \"Angels\" however, there are some that stand out as particularly useful to have in your six person party.\n\nFirst, you must always have Maya in your party, as the game revolves around her. However, she is arguably the weakest character in your party for most of the time you'll be willing to play this game. You'll need to proceed through multiple story segments to unlock her memories and boost her effectiveness in battle. Until that time, she may actually be stuck at Lv 60 while the rest of your party are at Lv 110. She has 3 types of weapons, each of which have their own skills and stats, and will synergize with 6 different characters by altering their special attacks to have extra effects and damage. This is where any semblance of balance falls apart.\n\nSecond, you'll want to have two healers to have any hope of surving a fight with enemies at the same power level. There are two that you will absolutely want in your party: \"Gentle Healing\" and \"Sakura Dancer\". Gentle Healing has the ability to revive a single character per battle, and Sakura Dancer has the ability to remove adverse status effects from any character she heals.\n\nOkay, so that's three slots taken right? Well, we're about to fill a fourth with \"Raging Angel\" who has the ability to increase the energy of two characters in her row by 2 or more when she uses her special attack. She also has a chance to increase the energy of the whole party by 1 when she uses her normal attack or dies. She's far, far, too useful in the row with your healers to not use.\n\nSo, that leaves two slots for all the other \"Angels\" right? Wrong. Becuase of the added affects of the synergizing with Maya you're absolutely going to want specific characters depending on which weapon Maya is using. \n\nYou'll probably end up using the Scythe most often as it's ridiculously OP compared to the other weapons, being able to damage the entire front row, and the characters you can synergize with are also fairly powerful. You'll want \"Time Gaurdian\" who can stun the entire front row of the enemy team, and \"Arcane Scholar\", since when her turn comes will gain an extra point of energy and increase an allies energy by, and whom's synergized special will add 3 points of energy to herself and whoever she is in a column with. That means She will always have enough energy for her special after she uses her special the first time in combat and practically guaranteeing the character in front or behind her can do so as well. Combined with \"Raging Angel\" your party might never even approach running out of energy.\n\nIf you're using the Sniper, you'll want \"Bounty Hunter\", who can stun a column of enemies, and \"Time Jumper\", who can stun all the enemies.\n\nIf you're using the Katana, you'll want \"Justice Blade\" who can blind the entire front row, and either \"Tenka Fubu\" who can prevent the entire front row of enemies from gaining energy, or \"Deadly Shadow\", who can stun anyone she crits agaisnt.\n\nAs you can see, there's basically no balance among the charsters. Worse still, however, is the characters that you can only get by spending money. Every week or so there is an Event that offers an \"UP Recruit\" character. The game makes it seem like you can get them by spending a special limited time currency that drops during the event. Except the currency only drops during the first half of the event and the chances that you will accumulate enough of them to spend to redeem the event character without buying more of this currency approaches \"divide by 0\".\n\nEquipment:\nJust another GACHA mechanic to get \"S\" tier gear.\n\nGraphics 4/5\nArguably the reason that everyone even considers this game, the pretty girls. Yes, they are pretty, with many different outfits that you can dress them in. I'd give 5 points, however, there are [b]paid DLC outfits in a GACHA game.[/b] Minus one point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "whole tutorial lasts 30 minutes with no way to skip it, and the game isnt even that good, feels like a shitty mobile to PC port.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generic gacha game with simplistic turn-based mechanics. The character designs are extremely uninspired and the story is unappealing. The only good part of the game are the illustrations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a waste of your time.\r\nnothing interesting, just do chores to unlock more chores.\r\nyou can unlock some revealing outfits, but that's about it.\r\n\r\nI stopped playing when I had about 60k combat power and I kept losing to a 7.2k enemy. only to realize it's actually 72k combat power but the dev can't do basic math.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hidden paywall! So yes you can technically grind but it becomes so mind numbingly slow that it resembles something more like a chore than a videogame. You can't go back to earlier levels to grind with lower level enemies to build up experience and the crawl forward becomes so slow that the only viable way forward is to open your wallet. I can't complain too much, the game is free, but at this point I would imagine you would get much more out of a sixty dollar triple A game and it would probably come out cheaper.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game looked fun when i started, but when i dig in i found the progress way too hard and heres why:\n1-you have to charge alot money to become strong or take your hero to next level and when i say alot you should expect to spend 200~500$ per week.\n2-the servers open weekly and community die too fast which effect your legion/game progress. \n3-the chat system very has very high sensor which make it barely understandable and dose not have translate option.\n4-the options game play for Fun to Play (F2P) person very limited and takes forever to become strong. \n5-alot of lag and high consume of system requirement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The translation is horrible into English.  It barely makes sense.  The tags are misleading to say the least.  There are some nice jiggle physics when moving the models around, and I do like the fact that you can customize pretty much any character, but other than that, the game is just meh.  There are better games to play, overall I would give it 2/5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool Art even if it's ai\nbut there's not really any game to play here\nyou spend more time upgrading your characters than actual battles and everything else just feels pointless.\n\nShould have better interactions with the characters, make it serve some sort purpose\nCombat needs a redesign - Just press autoplay and watch for 98% of fights\nDidn't care for the story.\nIf you're going for adult theme, make it adult otherwise it's like a half baked apple pie.\n\nThere's just zero inspiration to keep playing, and you keep getting hit with popups like \"Buy this for only £14.99\"\nonly... XD pass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As soon players reach top of anny activity a server merger is announced and rewards are taken away,classic scam. Pity could have been ok ,sad greed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad:\n[list]\n[*]poor performance\n[*]inconsistent and unresponsive UI\n[*]bad writing\n[*]it's a gacha game\n[/list]\n\nNeutral:\n[list]\n[*]gameplay\n[*]recently updated 3D models\n[*]no energy mechanic\n[/list]\n\nGood:\n[list]\n[*]I like seeing the numbers go up.\n[/list]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Connection problems after update.\nshit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why is Asuka from Neon Genesis Evangelion on the lobby page of this terrible game?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trash game with AI arts",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "weird af dont play got dared",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ai gooner shit",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Booring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "what on earth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Goon",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it seems ok.... but I clicked \"i dont recommend\" because the game tags are dishonest. Probably a sad attempt at getting more gamers to install a game that has limited play draw beyond the first time playing.\nIf you dont mind meaningless grinding gameplay, or pay to win mechanics, with censored model content, then maybe its ok.\nI uninstalled it after a brief play through the tutorial and a little beyond. Seems like they tried to expand the complexity of game play a little, but having \"nude\" but censored scenes made it feel sad and pathetic. Either go whole hog and show everything, or remove the \"nude\" scenes al together.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I don't see an tits? Do I have to keep playing or something? I thought this was Hentai/NSFW/nudity. I'm 3 hours in and no tits yet, no hentai, no NSFW/nudity. Kinda simple game, would be better if there were more tits. As of now, I do not recommend. They do give you stuff, but the IAP exist. Not as bad as other games.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "The generous rewards are not so generous. You progress faster in the fisrt 2 months than in the next 2 years unless you pay a lot. \nRecent updates were downgrades, taking the game back years graphically.  And now we have new bugs and glitches. \nAlso,  player friendly features were discontinued for monetization purposes.\n\nThere are lots and lots of resources. Some become obsolete in time, afterwards they pile up and there is nothing to do with them. Players asked for years to solve that issue but instead they were given downgrades. \n\nSupport only exists for payment issues, \nDiscord channel is useless. Players are free testers for bugs... And you wait for weeks for an answer about a bug due to witch you did not receive certain rewards then they say it was a translation error or a new feature.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is fine... but it's not something I would recommend to others.\r\n\r\nPros:\r\nThe graphics are fine.\r\nPlenty of systems, but not so many that you spend too much of your time on them.\r\n\r\nCons:\r\nCycle of pulling new players into new servers so they can feel powerful, and then merging servers so they will become week and spend money to progress.\r\nA sudden steep increase in difficulty regarding leveling your main character.\r\n\r\nHonestly, the only way to gain power at a decent rate is to pay money. If you don't, expect to spend a couple of years grinding.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "As you can see from my play time, I loved this game. It's a great game and I highly recommend playing it for free.\r\n\r\nI don't recommend spending any money on this game. At first you spend and succeed, spending gives you a boost that is impactful and pushes you through content faster, and there is a lot of content in this game. Then after a month or so they will begin the server merges and you roll the dice, will the server you merge with have stronger players than you making all your spending pointless or will they merge a weaker server and you are still invested.\r\n\r\nThe first merge I had was a weaker server so the money spent up until that point was not wasted, I was still in the top tiers, still earning the best rewards. The second merge was with a server nearly a month more advanced than mine, and I was pushed out of the top, losing all my daily rewards and benefits. All the money spent up until that point completely wasted, useless, unless I spends thousands of dollars to try and retake a month worth of progress from the older server.\r\n\r\nDon't make my mistakes, the game is great, play it for free. Don't spend a dime on this or you will eventually be sitting with the free players anyway when they merge with a stronger server.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Proof that if you spend a year learning coding, and aggressively abuse Generative AI Programs, you too can be aggressively Mid and somehow make money!",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Game is decent and graphics are great, but the game and all the DLCs are not tagged correctly. very misleading.",
      "voted_up": false,
      "votes_helpful": 7
    }
  ]
}