{
  "positive": [
    {
      "review": "Against the Storm is one of those rare gems that truly captivates you and doesn't let go. It's highly addictive and has kept me hooked for hours, which is saying a lot considering how many games I’ve played over the years. The beauty of the game is how it manages to keep you engaged without the frustration that often comes with more complex strategy games. I’ve never once gotten angry or frustrated while playing, which is an impressive feat!\r\n\r\nThe soundtrack deserves a special mention — it’s absolutely calming and perfect for setting a relaxing, almost meditative atmosphere while you build and manage your settlement. It’s the kind of music that keeps you immersed without ever feeling intrusive.\r\n\r\nOverall, Against the Storm has quickly become one of my go-to games for winding down after a busy day. Highly recommend it to anyone looking for a strategic yet peaceful experience!",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Everything in this game clicked with me so hard. The music/sfx and art style is gorgeous and the gameplay can become brutally challenging while leaving you with a hugely rewarding feeling for solving logistic problems in the final seconds. This game has so many mechanics and they all build off each other in such complex ways that nothing in this game seems half baked. The devs truly did their best to mature all aspects of the game and take community feedback very seriously. This is what lead to my addiction in early access and coming back to two full DLC's and other alterations to the base game is going to trigger that in me all over again. This is definitely in my top 5 games of all time.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "10/10 – A Masterclass in City-Builder Design\r\n\r\nAgainst the Storm is nothing short of exceptional. The level of care poured into the UI is astonishing: every panel, tooltip, and visual cue is crafted to keep you informed without ever overwhelming you. It’s elegant, intuitive, and beautiful to look at.\r\n\r\nThe game’s core systems—Hostility, Reputation, and Impatience—form a brilliant puzzle of tension and balance. They intertwine in ways that constantly challenge you to adapt. Each decision matters, and the shifting forest ensures no two settlements ever play the same.\r\n\r\nProduction chains are another highlight. Recipes aren’t just “pick the best one and forget”; they’re a deep optimization game where every resource, building, and worker assignment influences the next step. It’s crunchy but deeply satisfying.\r\n\r\nAnd the atmosphere… it’s mesmerizing. The music and sound design create an immersive mood that pulls you into its dark, rain-drenched world. The soundtrack subtly shifts as danger rises, heightening the sense of urgency as the Storm approaches. It feels both haunting and exhilarating.\r\n\r\nIf you enjoy strategy, management, or simply losing yourself in a uniquely crafted world, Against the Storm is an absolute must-play.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "For a city builder game, this game has a lot of replay ability and of different ways to achieve quests. I love that as you grow in the game you can also branch out to not just higher difficulties but you gain more game content as you venture out farther from the starting point.  No military component that I have noted yet, but you are really battling the environment itself. If you enjoy Northgard this would be a great game, I think.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Great game, randomised nature of stages keeps me coming back to it over and over again.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "An absolutely delightful roguelike city-builder that focuses on the exploration and establishing parts of the gameplay loop, cutting away the maintenance endgame. The variety of buildings and ways of doing things keeps things fresh for hours and hours of gameplay that ranges from casual to punishing.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This game is amazing in every way: intuitive UI, captivating gameplay, nice music, beautiful graphics. It can be relaxing or challenging or even hardcore depending on the difficulty you choose. This game is just perfect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the best settlement builder i have played. This game scratches that stressful, yet calm and unpredictable itch that not a sinmgle game have ever done before. 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A great game with a huge replayability system that never lets you get bored. The music is something else — atmospheric, magical, and beautiful.\n\nP.S. My GF has a 400 hours record and she got me hooked on this.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Certainly an interesting mixed bag with lots of influences; base building like AoE / Warcraft (with similar aesthetics to the latter), short games with a randomness element and some long-term progression ala roguelikes, production chain management similar to Caesar / Zeus. Games are short-ish at 1-2 hours, I can sneak in a game or two on a regular workday and start fresh the next day without having to figure out what I was doing previously. \nI'm not much for the gambling rainpunk / corruption mechanics or getting to the prestige levels, and after 100 hours things have gotten a little samey; but hey, it's been 100 hours! Highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. I like that you finish a city in 1-2 hours so you can put a decent gaming session into an evening and then call it a day.\r\n\r\nAlso, the free updates by the developers, as well as the paid dlc are awesome!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of my favorite little city builders in a while. This game removes my dislike of other city builders which is the endgame of a super sprawling city that just needs micro management and instead gives you a nice randomized startup of a town that actually needs your help to grow and prosper, or to earn enough queen kudos for you to move on. There's enough variety and also scaling harder difficulties that the game never really feels easy when you unlock more of your meta progression. Would also recommend all the DLCs as they add in even more fun without being better than the rest in terms of buildings or races.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Against the Storm has an incredibly compelling gameplay loop. A combination of citybuilder and roguelike, it's got enough variety to keep you coming back again and again, but a core gameplay concept that is easy to get the hang of. I got the original game, poured dozens of hours in, and have since bought both DLCs in part to support the creators of this great game, but also because each DLC is crafted by the same attentive team. This game is staying in my standbys, along with Slay the Spire and Factorio.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First thought about this genres mashup was: \"looks fun but it can't work', but still I decided to give it a try. And here it is, one of the best games I ever played. Not many other titles hooked me in so much to clock more than 100 hours (it is not frequent for me to commit so much time for one title).\r\n\r\nBlending rogulike elements into city bulider really hit the spot - it got rid of the biggest drawback that haunts the genre - repetitiveness. There are some actions that you perform most of the games, some schemas, but still it's nothing like building a new city from groundup, using the same buildings every game. You have to adapt your strategy to the bricks that game throws at you. This gameplay loop is extremaly engaging.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game gives me a mix of chill and stress thats hard to describe, and at the end of every settlement, a feeling of \"wow, that was a great 1.5 - 2 hours spent). I had to give the game 3 chances, but it finally clicked, and its one of my favorites.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of my favorite games. The soundtrack is amazing, please listen to it somewhere or buy the soundtrack to support the developers. It is relaxing, daunting, stressful and terrifying, and fits the game like a glove.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome city builder game, which somehow manages to be cozy and hardcore at the same time. Very addictive, has a lot of depth and variety to it. Also art and overall theme are quite spectacular.\nThe only minor downside is that UI lacks some centralized information in some cases, forcing you to do a lot of micro-management on higher level difficulties.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is addicting and very fun to play. The balance is phenomenal and I feel like I always have a good challenge and grow with each game. I've been playing it on and off for years and highly recommend it to anyone to try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My favourite city builder game! So much fun, like everyone has already said they took the most fun part of a city builder (the beginning) and have you do it all over again! So far I've had multiple settlements that play totally different. Playing into your cornerstones (perks) is great too!\n\nIf you love games like StS, other city builders, logistic games, etc you will love this!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absurdly good game!\nIt was exactly what I needed, an RTS with an objective where I could build a settlement and then a reason to keep replaying it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love city builders but have trouble deciding I'm done with a city. This game makes the choice for me. Completed your objectives or spent enough time? You're done! Move on to the next city!\n\nI'm having a great time. I'd definitely recommend it!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My favorite \"City Builder\" game. \n\nUnlike most, these come in rounds with clear objectives as you traverse an overworld map to places with different effects on the land/your objectives.\n\nAt first I wasn't sure if I liked that, but over time I realize I now prefer it. \n\nGreat game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had this game a long time and continue to appreciate the updates and great communication from the dev. I'm not the biggest fan of wipe and reset gaming style but this game makes it really enjoyable!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great take on city building. Progression is great, modifiers completely change each run, runs are slow enough to be engaging but fast enough not to get boring and you can jump in and out at any point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice furry game, can't wait to unlock bats they are so HOT.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my \"go back to\" game whenever I had a stressful time. Love the game and it stays fun even without DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my comfort game. It's very relaxing and addictive~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a strategy city builder game with well-designed roguelite mechanics, then this is the game for you. I love it and find it addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "These bastards keep adding content as soon as I obtain a solid grasp of the full mechanics of the game and start developing strategies for challenge runs. Its a never ending STORM of updates. \n\n10/10 please just don't Stellaris me I'm poor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing city builder where you get to rebuild your settlement over and over, each time becoming better at it! The thrill of finding exactly what you need in a dangerous glade and the horror of encountering a River Kelpie! Love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game. The difficulty scales in a very natural way. Progressing in this game is very satisfying. Overcoming challenges is truly its own reward. I have not spent over 100 hours on very many games, which really isn't all that much in relation to  some other reviewers.\n\nI've always liked RTS games, but I never really won all that much when it comes to other players. There are no warrior units in this game to keep track of, but there are plenty of other factors to consider. \n\nSo, if you like Northgard but never liked going the domination route for your victories. I say give this game a try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the spin on the city builder with the rogue-like elements, I haven't played this game very much but what I have I've really enjoyed. The lore and story behind everything is also very enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has a gritty cozy vibe to it. Obviously your cities/settlements won't be as big as in many other games from this genre, but what you have here is more of a close knit society, which must operate as efficienty as possible to please the higher ups in the heirarchy. \n\nDefinitely worth buying the base game alone. I've yet to play or see the DLC influence my gameplay. I'd recommend getting the DLC separately later, as you see fit. The base game has enough content to keep you hooked.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game! Great at getting you into a flow state with its audio design and complicated mechanics requiring you to keep track of a bunch of things and constantly mentally retread paths to figure out the way forward.\n\n...Eh, my brain can't articulate no more. Game good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of these games I come back occasionally for a casual play. While I cannot be bothered to get good enough to master high prestige levels, just playing at lower difficulties is an enjoyable experience for me. Learning the full complexity of this game is probably rewarding, too - just not something I am into any more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic. I'm a big fan of colony sims, but admittedly they can get stale fast on replays. Against the Storm encapsulates the best part of one: the first two hours of a colony sim when you're unlocking everything and going from rags to riches, but repeats it in a super addictive and (Usually) relaxing rogue-like. The music is incredible, and so is the art style. I absolutely love it. Even without the DLC's, the base game itself is wonderful and fully fleshed out.\r\n\r\nSpeaking of fleshed out, omg the in game encyclopedia is fantastic! Only twice have I sought out information outside the game, and most of that was looking for tips from other players on how to streamline and improve my gameplay at higher levels after a few failures. The game does an incredible job explaining things, and giving you a good base of info that is always on hand. \r\n\r\nThe achievements are also very fun! They offer a great mix of relaxed and more intense goals, like beating a game with frogs in your settlement on an irl Wednesday, or beating a settlement on higher difficulties after pulling a specific set of cards/buildings. \r\n\r\n My only real critique is that DLC achievements are bundled in with the base game :/ so if you're a cheevo hunter but only want to get the base game, you're SOL. \r\n\r\nOtherwise, there really is no negatives! I feel so spoiled playing it, truly not many other colony sims can scratch the same itch. A single settlement taking around 1 hour on average is perfect for a quick match at the end of the day to relax, and I really appreciate that this game has a nice balance of light and contrast. I have an issue with one of my eyes picking up contrast and bright lights, a lot of games love to be super bright or flashbang day-night cycles, Against the Storm has a comfortable level of darkness to light, and I never feel like my eyes are sore or fatigued after a longer play session.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cool base builder with a unique gimmick. Reminds me of great games like Frostpunk and Surviving Series (Mars, Aftermath, etc.).\n\nAlso devs are still updating the game, whether it's paid DLC or free QoL updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing rogue-like city building game, with numerous strategies to win. Plus fun to boot.\n\nA must play for anybody.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere is peak, I both adore playing it and watching others play it, the new content is always fresh and adds a new dynamic to gameplay without making it overwhelming... It can be stressful at times, but it's the good kind of stressful. I've adored this game ever since I first discovered it and it holds up every time I come back to it.\n\nHere's to many more years and hours of delicious gameplay !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! If you enjoy stragety games with a lot of heart and world building you'll love Against The Storm. Honestly, the music has me hooked - it's beautiful, and the art is very creative and refreshing. \r\n\r\nThe whole game is definitly a labor of love!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A seemingly simple Citybuildier that grows complex real fast, yet never becomes needlessly over-complicated. It is always just the right amount of demanding.\n\nIt's roguelike system is both innovative and ensures a fun and concluded play session experience, while still giving a sense of progression.\n\nThe mechanics are fairly non linear. You have to adapt to the situation to excel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really feels like the perfect city builder. Only focused on the early game and the cycles end before you can get bogged down in the mid/late grind of other games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great music, relaxing even if not chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great roguelike city builder / resource management game. I love the art style and the general feel of the game. Lots to keep track of, which might be a negative for some, but it works well. It's the type of game where not every run is going to be perfect and you are very much supposed to adapt to what you are given.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great strategy/survival game. Good mechanics and good city development, which supports a range of different playing styles. The Devs continue to provide additional content. The only setback, albeit minor, is the lack of multi-player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was forced to review this for the Steam Badge. It's a great game if you like city builders.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Against the Storm is heavily focused on the Roguelike aspect, and would likely disappoint players that are expecting a grand city builder. The game is based off single scenario stages with a straightfoward objective to clearing the stage, with many variables - from the resources discovered from each new area, the timed events from exploring, to orders(sub quests that contribute to clearing the stage), and progression rewards(pick 1 from 3/4) within the stage - are all random. \n\nMost of the planning are rather done before you select the node on the world map where you want to build, where you can select(to some extend) what species of villagers and extra resources you want to bring into the map, based off the kind of forest you are entering. Once in the map it is more on micromanaging and adapting to the random resources and buildings given to you and finding the recipe to stabilization and victory.\n\nRecommended for players who enjoy problem solving, dealing with unkonwn challenges with time constraints, and  for people that enjoy the feeling of mastering the mechanics and turning most stuff into controlled RNG. And also the thrill when sometimes things go south and the race against the clock to complete the stage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game that recieves much love from the developers and although the missions are similar, it's never the same and keeps you engadged.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "High praise for this game. Bought it thinking it would be a light strategy game, and was completely wrong. Been absorbed with this game for quite a while now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good settlement builder, almost roguelike play, a balance between sweaty and chill play. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a big fan of city builders, and this is not only a good example of one of those, but it integrates roguelike mechanics with aplomb and thematic depth usually absent in this genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a Fantastic game with great visuals and a wonderful soundtrack.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never thought that this kind of combination of game genres is possible to be honest. Roguelite and city builder mixed and combined with each other to create this beautiful concept of resource management and random events with level progression and so many aspects that will make your game diffrent with each run like biomes, species, blueprints of buildings, perks, cornerstones and orders. Without forgetting to mention amazing and unique artstyle and SFX that to me personally couldn't be done better. It's a game for countless hours that will not get predictable over time due to so many variables. I recommend this masterpiece of a game to anyone who likes city builders to play something refreshing in this genre and to anyone who likes roguelike/roguelite to at least try this game for its unique approach to random events and randomized unlockable perks and schematics through every run. I hope this game will still continue to develop, best of luck to developers and I hope and can't wait for another DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is life-ruiningly addictive. One of those \"oh I just need to do X and then I'll stop\" and then it's suddenly 3am sort of games.\r\nIf you love the early game of Civ, AoE or town-building games, then this is pretty much that on repeat with roguelite elements to keep it fresh.\r\n\r\nManages to strike the perfect balance of challenge and urgency so there's always the next little thing to do, and the satisfaction when you save your settlement from a death spiral (that you put it in from being too greedy) is awesome.\r\n\r\nThe world-map approach with different difficulty zones adds a nice feature that I haven't seen in many roguelikes where you can alter the base difficulty of the game during a run (as well as the usual modifiers and harder-specific-challenges).\r\n\r\nThe aesthetic is beautiful and models remarkably detailed for something that you are looking at zoomed out 99% of the time. Try zooming in to your settlement sometime to appreciate it.\r\n\r\nDefinitely seems like a labour of love from the devs and it's well supported.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm just getting started in this game, but I've got to say: as someone who always liked strategy games, RTS and simulation/city builders, I've always been able to \"like\" them but they've had such a dedicated fanbase for so long that most games are built for people who are really good at them/have been playing them since Warcraft 2. The old games are either too simple, or the new games are too loaded and complicated.\n\nThis game seems to strike a fine balance at letting experienced players crank up the difficulty, but still offering a way for the non-pro to really dive in. The beautiful ambiance that reminds me of Hollow Knight's rainy cities, the graphics and fantasy to suck you in, while also having easy to understand basics, and a SEARCHABLE ENCYCLOPEDIA build inside the game?? Absolutely love that, and love the tutorial. You get a practical dive in, taught by Queen emissaries to keep you engrossed in the story, while also offering a whole plethora of game information searchable at your fingertips. I really can't understate how much it sucks you out of a game to have to alt tab and read reddit articles on a game or watch youtube videos, instead I can listen to the raindrops while I look up what the heck I need to understand. Not to mention, keeping just the early portions of a standard city-builder helps a new player not drown in the bloat of a thousand cities and their logistics.\n\nA bunch of depth in a game that also has the ramp, and immersion to keep you learning it all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great concept, music, replayability and balancing through a range of difficulties",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most fun city builder I have played, the art style is both cute and abit horror like, I have only played 20 hrs of this game and it still feels like I\\m in the beginning and looking forward to get further",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game with a positive and wholesome story where you get to feed cute foxes, lizards and frogs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone has already written everything I want to say about how wonderful this game is, but all I can say is that if you're on the fence about buying it, buy it. You won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun base builder strategy. Would certainly call it a resource managment game, although the focus on city building is I think more important.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, confusing at first but stick around and its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game , I would recommend not going on to you tube tutorials and learn the game by making mistakes, the tutorials are challenging and teach you the game concepts through trail and error which I really like. Once youve learned how the game works the real fun begins. It's just a really dynamic great game , with beautiful visuals and an excellent soundtrack.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my favorite city builder, the amount of replayability in this is high due to the rogue light mechanics. Definitely worth it even at full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A city builder that never gets boring. Fantastic replayability, charming style, difficulty to your own liking. On the easier side to chill out, or harder to test your decision making and micro managing skills.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play city builder.  Up till Viceroy difficulty it has been fun with good progression mechanics and enough variation that nudges you to slightly change strategies on some maps.  Now at Viceroy where I saw some say grindy so will see if it continues to be fun or not but definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great for anyone who likes city/base building games. You can play it on a low difficulty if you want to chill out and relax, or a higher difficulty if you want a more intense RTS/resource management experience. This game is also being updated consistently, with changes inspired by community feedback. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy games like Anno or the old-school RTS classics such as Warcraft 3 for their base building and resource management, Against the Storm is an absolute gem. It feels like a love letter to the golden age of city builders, blending that nostalgic loop of gathering, constructing, and optimizing with a fresh roguelite twist.\n\nEvery run feels fresh and its a game I regularily come back to. The gameplay loop is relaxing, yet challenging with some brutal difficulty levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A city builder with great art, interesting mechanics, and lots of variable difficulties. What's not to like?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game with an innovative mix of roguelike (/ roguelight) and city builder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally came back to this game after playing during early access. Grabbed the DLC as well. This game is so good, it's quite amazing how well done everything is. Everything feels fairly balanced, so many unique biomes now with the DLCs. Been climbing up the prestige difficulties, so refreshing to have unique modifiers to add difficulty instead of just nerfing stuff or making things more tedious than they need to be. Zero performance issues or bugs I've seen. Rogue-lite city-builder is kind of nice as a lot of the time starting a new city is sometimes the best part of a city-builder. It has the added benefit of never getting to the point the settlement gets so big that performance takes a dive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one my favorite games. I haven't gotten far in it nor do I play it often because I like to play it when I know I will have the time to zone out on it for hours. This is one those games where I lose track of time and before I know it, it's 3am. It scratches that city builder itch in a great way. Game and DLC are worth full price and I cannot wait to be able to get to the latest updates and new in-game stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay, so if you're looking at this, you've probably played a city builder or two before.\r\n\r\nYou know how the most fun part is almost always the set up? The initial rush of figuring out where you're going to put things, what buildings to prioritise, what resources to rush for.\r\n\r\nWell this game basically takes those addictive first few hours of a city builder and makes them the whole gameplay loop. Each settlement you start will only last a couple of hours at most, and by the time it feels like you've solved it, you've either won or lost that particular instance and it's time to move on!\r\n\r\nThe randomisation of which races, buildings, resources, perks (cornerstones) and orders you get also prevent you from ever getting too comfortable with any single strategy. It's not a complete RNG mess, there are always some viable ways of getting through things and some options that you always have, as well as a number of ways to get what you want once you set your mind to a goal.\r\n\r\nIf I were to offer a single critique, and this is entirely a matter of personal preference, I like to try and match the architectural style of the buildings I pick to the three races that happen to be present in my game. Now with the addition of several new races, it is really not a good idea to do that, as you will definitely lock yourself out of useful buildings by playing that way. So pls, devs. Building architecture skin pack when?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxing city builder with a unique and emersive progression system. Highly recommended if you're looking for that game to play while listening to podcasts or on higher difficulties can be quite challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Against the Storm has this unmistakable vibe that instantly reminded me of early-2000s strategy games, the kind that mixed charm, bold ideas, and a ton of personality. That style hit me right in the nostalgia, but with a modern twist that genuinely surprised me. The “roguelite city-builder” concept works way better than it sounds. Splitting what would normally be a long RTS session into smaller, meaningful runs is honestly brilliant. It keeps every settlement fresh, avoids the usual mid-game drag, and gives you that “one more cycle” feeling constantly.\n\nI also love the characters and tribes, their little quirks, needs, and strengths. And the events? Great design choices all around with the \"fog of war\" mechanic adding some tension to it. There's a lot of replayability here. \n\nI’ve been hopping in and out of it in small batches ever since the first release, and I still love it every time. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Core mechanics are easy to learn and very engaging. If you were a fan of the Caesar games (or their spiritual successor CivCity Rome) you'll probably like this as well.\r\n\r\nUnless you're trying the (very endgame) Queen's Hand Trial then just take the game at your own pace, speed will come with time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The balance this game achieves between \"chill\" and \"challenging\" is, for me, just right. No stress, but you still have to make decisions to not fail missions. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whenever I get the base-building itch that no other game can scratch, I just open up against the storm. Great game, mechanics, story and mix of free and paid dlc. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a combination of genres. Once you get the hang of it and stop trying to make full material product chains, it's very satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well supported, addictive city builder that scratches only the best itches from RTS games, city builders and even colony sims",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First, I didn't get it. Built my first city, found it lacking, and quit. Then I heard all the praise and returned for a second try. Built a second city. Third. Fourth. And then 100 more. In this \"city builder\", the progress isn't in a single city, it's between those games. The more you do, the easier the early game becomes, and the more difficulty options open, which offer more rewards going forwards. Quite a nice play loop, since you can just hop in for a single 1-2 hour game, then forget about it for a month, and you still progress. Nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bit grindy but lovely game. You need to understand lots of systems, but scratches that Anno itch I sometimes have.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an interesting genre mix. It takes the best part of city builders, condenses it into a 2-3 hour run, the 'rougelike' aspect means that you won't have access to every building each time and you can choose between modifiers that can affect your run. The tutorial is across multiple runs, introducing a new aspect and options each time mitigating feeling overwhelmed at the start so it is very approachable. The aestheics and sound design are great, twisting knobs to increase your rainpunk settings, adding your population into the designated slots for each building and the atmospheric rain all scratch my brain just right, \r\n\r\nThe dev team are communicative and open - there is literally a give feedback button inside the game. They have released multiple free updates that include new content, quality of life updates and balance changes along with two paid DLC (at time of writing) for further species to play as in your runs. These are not needed to experience the game however I would still recommend getting these and supporting this game and this dev team. I am highly looking forward to what Eremite Games do next!\r\n\r\nGenius game design. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't speak highly enough about this. I actually got this years ago and played it an hour but was put off by all the systems but I came back now and... yep it's incredible. The game is immersive, it makes you think and you are constantly in a state of planning for the future without knowing what exactly that future will be. \n\nIncredible game design, amazing presentation and music. Slight Frostpunk vibes but it's not so oppressive (at least at my difficulty - veteran) and the systems are so well designed that you can normally find a creative way out of a problem.\n\nGreat game and truly unique!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Initially I wasn't sold on the fact that you constantly lose what you have created in favour of starting again and again.  I thought I enjoyed big city builders with a persistent world to continuously develop.  But over time, I realise I quite enjoy the cycle of starting over with different variables to consider.  Each settlement has its own charm and its own struggles, keeping me interested time and again.\nIf you are on the fence, but are worried you won't enjoy the cycle of starting again and again, I'd say give it a go.  You may decide you like it, just as I did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 Wonderful gameplay loop, basically roguelike frost punk but with animals (and humans), but also way more strategic depth. The victory point bar and the queen's impatience bar feels like its straight out of a board game and puts a soft time limit on games. One of the few games I have played where on the harder difficulties you really do need a strategy based on the hand that you have been dealt. Sometimes you have to take paths you don't want to take as there no way to get the alternative resources together in time. Sometimes you get a plan going and you manage to make it work. Sometimes you get a plan going only to have to cannibalise it and try and cobble something together as best you can. Sometimes you sail over the finish line with plenty to spare as your well laid plans come to fruition. Sometimes you are putting out fires (metaphorical) all over and just manage to limp over the line in time. One of those games where the more you learn in the game only provides you with the necessary toolkit to tackle its harder difficulties. There is no correct strategy, only decisions and trade offs. Love it.\n\nOh yeah and all of this on top of quite a lengthy progressions meter which continually adds to the way you play. I am roughly 85 hours in at the moment and maybe 2/3 of the way through it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite game! I bought it by mistake thinking it was something else and well I have over 100hrs in it and love it! \r\nThey update it regularly and the DLC content looks interesting and is integrated into the base game but doesn't stop you from having a wonderful time playing without it. \r\nThe difficulty scales nicely and overall the game feels great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it, simple at first but engaging and challanging later on. Quite addictive and really easy to get lost for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game you can always come back to.  The gameplay loop never gets boring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a new classic imho. Great balance, constant flow of updates, endless replayability and unique gameplay loop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game play. Easy to play with also enough difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "City builder after a marriage with Roguelike :) \nA great, engaging combination without unnecessary complications, which makes you want to return to the game after some time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, good gameplay, nice graphics and music. Difficulty goes up until it is actually hard, even if the fun goes down as you are forced to specialise more and need to pick more optimal strategies (which means runs becomes more similar).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. So overwhelming with a huge diversity. Every village is different, I face another challanges in every different villages. The game itself is very challangeing, around 350 hours of gamplay I still couldn't complete the Adamantine seal, but I love challanges, which is rare to find in today games. Highly recommended for every resource management fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a start, I would say this game is like a mix between frostpunk and roguelite, which fits me pretty well.\n\nI love everything about this game, and I highly recommend it. Yes I did write this review just for the game awards badge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I usually have trouble finding motivation to start a new city, increase the difficulty, or try diffrent things in city/town building games.\r\n\r\nThis one fixed that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an awesome strategy/sim game. I just bought the 2 DLC and can't wait to play them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is legit. If you're looking for a city-builder that actually keeps you on your toes, you absolutely need to check out Against the Storm. It expertly mashes the chill vibe of building a town with high-stakes roguelite runs, making every decision feel super massive. The constant pressure from the Blightstorm and the Queen's demands is totally addicting and it's hard to put down. Plus, the art style is genuinely gorgeous - reminds me Warcraft 3 style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After reaching and finally finishing a titanium seal and working towards my adamantine seal run, miserably dragging my way through every prestige difficulty and trying to find new and crafty ways to play the game, I can heartily recommend this roguelike citybuilder.\n\nIf you have any doubts, let me assure you that I've gotten countless hours out of this already, and the slow but very steady updates from the developers out of just sheer love for the game have only added to the depth that you're able to experience.\n\nThe way it introduces difficulty is extremely gradual and poses multiple ways to challenge yourself and further anger the Queen when you fail as one of her chosen viceroys. I've robbed so many merchants, killed so many villagers, and made my people suffer, all in the name of survival. I'm telling you, there's nothing more cathartic than finishing some of the hardest difficulties (prestiges) with unexpected methods. My neurons are firing, my brain is wrinkling.\n\nI still think frogs kinda suck as a race but at least they're endearing and I can flood their homes with water that I will absolutely refuse to build reservoirs for otherwise. Just play it. You won't regret it.\n\nI hope the devs keep updating this game and make a sequel. When they do, I'll be there to play and rip my hair out from stress in trying to salvage my terrible runs with the craziest comebacks. You ever win by sacrificing your villagers to get 2,000 stacks of meat so the rest of them won't starve? You will.\n\nI love this game!! Get it!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like city builders and can tolerate roguelikes, this is the game for you! Got 600 hours in before I got bored!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has replaced Civ5 for me (with Vox Populi mod/patch) as my go-to for a deep strategy game. I have been meaning to write a review for a while now but I am always just impatient to get on with playing the game! (Bear in mind, this game is nothing like Civ, though.)\r\n\r\nIt's such a good game that boils down to an endless series of interesting choices and a lot of opportunities to build exponential combos with the choices you make. Additionally, the learning curve is pretty forgiving and the game naturally increases the difficulty in line with your increasing understanding of the game and unlocking of the meta upgrades that you keep forever.\r\n\r\nI love this game!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "If you don't like losing to a timer, this isn't the game for you. I almost feel bad posting a negative review about the game because you can tell the devs put a lot of heart and effort into it, but at a certain point you just have to admit when a game isn't fun and for all the interesting mechanics they put into the game...it's all gutted when you lose to a timer (which is the only failure mechanic for each level).\r\n\r\nWhat makes it even worse is that so much of the game is left to RNG. What buildings you choose from. What resources are on the map. What settlers you get to choose from. The missions/orders you receive. Unfortunately you can just lose a mission because the RNG options you receive don't line up well enough for you to beat the clock. Has nothing to do with your strategy or decisions.\r\n\r\nEssentially all you are doing in the game is choosing from randomly generated options (orders, buildings, etc) without any ability to plan ahead. So the only thing in your control is making sure that the right types of settlers are assigned to the appropriate buildings, and that those buildings are near their resources. Even the town layout doesn't really matter beyond placing production buildings near resources and each other to cut down on travel time, and putting homes near the hearth. But there is no room for individual strategy or play style. And it doesn't help that there are buildings that you obviously want to choose every mission if you are lucky enough get them, and other buildings that aren't worth it but you have to choose because you don't have any other choice. \r\n\r\nAt it's best, levels are too easy and you beat them with plenty of time to spare. At worst you get a bunch of bad rng rolls and get to watch the clock run out while you scramble to try and compensate (or don't because you are left without any options). But always you are left wishing the timer didn't exist and you could just build out and optimize your town, and keep exploring the maps. \r\n\r\nThe aesthetic is really nice but I'm willing to bet this isn't the city builder, resource management game you were looking for.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "[H1] This is a hard game to engage with ?! [/H1]\n\nThe underlying mechanics are great, but it just seems so hard to engage with them. Knowing how to set up your happiness structures for villagers, dealing with blight outbreaks, or planning journeys. The more effort you put in to mastering these systems the more that seems to go to waste, as though the game is deliberately waylaying your progress and prolonging your game time. \n\nThese are just hard systems you have to memorize to conquer, and the difference isn't a strong village but [b]well done[/b] you were faster than the Queen's Impatience (the time out function). \n\nIt's a hard game to make pretty in a sense. It doesn't build together to make outcomes. You achieve a speed score and that's not my type of memory game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing it for a while, you realize each game plays the same, with only minor differences based on whichever buildings are available. Random events don't really change how you approach each game, and overall progression through the unlock tree feels very slow.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While I thoroughly enjoy the art style and the variety and complexity of resources, the heavy use of rng leads to unwinnable situations. Losing on a map that you’ve spent hours playing, simply because quests start asking for items you can’t produce and the traders don’t seem to want to show up with, is just annoying and results in a sense of ‘I’m wasting my time’.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was a huge miss for me, the whole game felt too much like a sandbox and didn't have enough feeling of \"building up to survive\". I've admittedly played dozens of these city builder types, Frostpunk, They are Billions, Sim City, etc, so I do have a good bit of experience when I say this just, wasn't any fun for your actual gamer. I don't know how this has overwhelming reviews, perhaps only casual players play it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rubbish. I tried hard to get into it but it constantly crashed for no reason over and over. Contacted steam who were of no help and I had gone over 6 hours gameplay trying to get this working so they auto-responded and denied my refund request. I tried again, finding no solution to the crashing so have given up and now have a useless game sitting in my library.. :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't play much (more than 0.8 hours though, that seems to be a glitch), but I strangely didn't like this game.\n\nI really like early Settlers games, and I like Anno games. The negative delta between Settlers and Anno for me is that Anno is much more railroaded (different installments to a different degree), where the challenge is to do one specific next thing, like get 1000 artisans or whatever, while keeping the rest intact.\n\nThis game takes that delta up to 11, I think the queen's demands or whatever mechanic is terrible. I might try this game again to see if that  improves as you make progress, but for the first few hours you are always doing STRICTLY one thing, and one thing only  (and as an aside, I dunno what's roguelite about this game, it has no combat and is completely linear). Really not for me if that's how it continues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has great city building mechanics and replayability except for one huge problem... There is zero combat in this game making it feel somewhat bland and a obvious missed opportunity. It takes the realism away from the game when you have no town watch or town guard or no standing army to protect your very vulnerable town, it just doesn't make any sense. You have a new outpost in the middle of a ravenous wildlands and nothing is coming out of the woodwork to attack you, huhhhhhhhhh???????? WHY?????? Adding combat would be so easy to implement and it would only make sense given how hostile this world is supposed to be, somewhat braindead concept when you think about it. The game gets stale after awhile without any meaningful combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While I thoroughly enjoy the art style and the variety and complexity of resources, the heavy use of rng leads to unwinnable situations. Losing on a map that you’ve spent hours playing, simply because quests start asking for items you can’t produce and the traders don’t seem to want to show up with, is just annoying and results in a sense of ‘I’m wasting my time’.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Immensely disappointing. Instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lol ist Soo bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didnt like",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too much RNG.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you don't like losing to a timer, this isn't the game for you. I almost feel bad posting a negative review about the game because you can tell the devs put a lot of heart and effort into it, but at a certain point you just have to admit when a game isn't fun and for all the interesting mechanics they put into the game...it's all gutted when you lose to a timer (which is the only failure mechanic for each level).\r\n\r\nWhat makes it even worse is that so much of the game is left to RNG. What buildings you choose from. What resources are on the map. What settlers you get to choose from. The missions/orders you receive. Unfortunately you can just lose a mission because the RNG options you receive don't line up well enough for you to beat the clock. Has nothing to do with your strategy or decisions.\r\n\r\nEssentially all you are doing in the game is choosing from randomly generated options (orders, buildings, etc) without any ability to plan ahead. So the only thing in your control is making sure that the right types of settlers are assigned to the appropriate buildings, and that those buildings are near their resources. Even the town layout doesn't really matter beyond placing production buildings near resources and each other to cut down on travel time, and putting homes near the hearth. But there is no room for individual strategy or play style. And it doesn't help that there are buildings that you obviously want to choose every mission if you are lucky enough get them, and other buildings that aren't worth it but you have to choose because you don't have any other choice. \r\n\r\nAt it's best, levels are too easy and you beat them with plenty of time to spare. At worst you get a bunch of bad rng rolls and get to watch the clock run out while you scramble to try and compensate (or don't because you are left without any options). But always you are left wishing the timer didn't exist and you could just build out and optimize your town, and keep exploring the maps. \r\n\r\nThe aesthetic is really nice but I'm willing to bet this isn't the city builder, resource management game you were looking for.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "After playing it for a while, you realize each game plays the same, with only minor differences based on whichever buildings are available. Random events don't really change how you approach each game, and overall progression through the unlock tree feels very slow.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[H1] This is a hard game to engage with ?! [/H1]\n\nThe underlying mechanics are great, but it just seems so hard to engage with them. Knowing how to set up your happiness structures for villagers, dealing with blight outbreaks, or planning journeys. The more effort you put in to mastering these systems the more that seems to go to waste, as though the game is deliberately waylaying your progress and prolonging your game time. \n\nThese are just hard systems you have to memorize to conquer, and the difference isn't a strong village but [b]well done[/b] you were faster than the Queen's Impatience (the time out function). \n\nIt's a hard game to make pretty in a sense. It doesn't build together to make outcomes. You achieve a speed score and that's not my type of memory game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was a huge miss for me, the whole game felt too much like a sandbox and didn't have enough feeling of \"building up to survive\". I've admittedly played dozens of these city builder types, Frostpunk, They are Billions, Sim City, etc, so I do have a good bit of experience when I say this just, wasn't any fun for your actual gamer. I don't know how this has overwhelming reviews, perhaps only casual players play it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rubbish. I tried hard to get into it but it constantly crashed for no reason over and over. Contacted steam who were of no help and I had gone over 6 hours gameplay trying to get this working so they auto-responded and denied my refund request. I tried again, finding no solution to the crashing so have given up and now have a useless game sitting in my library.. :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't play much (more than 0.8 hours though, that seems to be a glitch), but I strangely didn't like this game.\n\nI really like early Settlers games, and I like Anno games. The negative delta between Settlers and Anno for me is that Anno is much more railroaded (different installments to a different degree), where the challenge is to do one specific next thing, like get 1000 artisans or whatever, while keeping the rest intact.\n\nThis game takes that delta up to 11, I think the queen's demands or whatever mechanic is terrible. I might try this game again to see if that  improves as you make progress, but for the first few hours you are always doing STRICTLY one thing, and one thing only  (and as an aside, I dunno what's roguelite about this game, it has no combat and is completely linear). Really not for me if that's how it continues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has great city building mechanics and replayability except for one huge problem... There is zero combat in this game making it feel somewhat bland and a obvious missed opportunity. It takes the realism away from the game when you have no town watch or town guard or no standing army to protect your very vulnerable town, it just doesn't make any sense. You have a new outpost in the middle of a ravenous wildlands and nothing is coming out of the woodwork to attack you, huhhhhhhhhh???????? WHY?????? Adding combat would be so easy to implement and it would only make sense given how hostile this world is supposed to be, somewhat braindead concept when you think about it. The game gets stale after awhile without any meaningful combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While I thoroughly enjoy the art style and the variety and complexity of resources, the heavy use of rng leads to unwinnable situations. Losing on a map that you’ve spent hours playing, simply because quests start asking for items you can’t produce and the traders don’t seem to want to show up with, is just annoying and results in a sense of ‘I’m wasting my time’.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Immensely disappointing. Instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lol ist Soo bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didnt like",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too much RNG.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you don't like losing to a timer, this isn't the game for you. I almost feel bad posting a negative review about the game because you can tell the devs put a lot of heart and effort into it, but at a certain point you just have to admit when a game isn't fun and for all the interesting mechanics they put into the game...it's all gutted when you lose to a timer (which is the only failure mechanic for each level).\r\n\r\nWhat makes it even worse is that so much of the game is left to RNG. What buildings you choose from. What resources are on the map. What settlers you get to choose from. The missions/orders you receive. Unfortunately you can just lose a mission because the RNG options you receive don't line up well enough for you to beat the clock. Has nothing to do with your strategy or decisions.\r\n\r\nEssentially all you are doing in the game is choosing from randomly generated options (orders, buildings, etc) without any ability to plan ahead. So the only thing in your control is making sure that the right types of settlers are assigned to the appropriate buildings, and that those buildings are near their resources. Even the town layout doesn't really matter beyond placing production buildings near resources and each other to cut down on travel time, and putting homes near the hearth. But there is no room for individual strategy or play style. And it doesn't help that there are buildings that you obviously want to choose every mission if you are lucky enough get them, and other buildings that aren't worth it but you have to choose because you don't have any other choice. \r\n\r\nAt it's best, levels are too easy and you beat them with plenty of time to spare. At worst you get a bunch of bad rng rolls and get to watch the clock run out while you scramble to try and compensate (or don't because you are left without any options). But always you are left wishing the timer didn't exist and you could just build out and optimize your town, and keep exploring the maps. \r\n\r\nThe aesthetic is really nice but I'm willing to bet this isn't the city builder, resource management game you were looking for.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "After playing it for a while, you realize each game plays the same, with only minor differences based on whichever buildings are available. Random events don't really change how you approach each game, and overall progression through the unlock tree feels very slow.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[H1] This is a hard game to engage with ?! [/H1]\n\nThe underlying mechanics are great, but it just seems so hard to engage with them. Knowing how to set up your happiness structures for villagers, dealing with blight outbreaks, or planning journeys. The more effort you put in to mastering these systems the more that seems to go to waste, as though the game is deliberately waylaying your progress and prolonging your game time. \n\nThese are just hard systems you have to memorize to conquer, and the difference isn't a strong village but [b]well done[/b] you were faster than the Queen's Impatience (the time out function). \n\nIt's a hard game to make pretty in a sense. It doesn't build together to make outcomes. You achieve a speed score and that's not my type of memory game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was a huge miss for me, the whole game felt too much like a sandbox and didn't have enough feeling of \"building up to survive\". I've admittedly played dozens of these city builder types, Frostpunk, They are Billions, Sim City, etc, so I do have a good bit of experience when I say this just, wasn't any fun for your actual gamer. I don't know how this has overwhelming reviews, perhaps only casual players play it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rubbish. I tried hard to get into it but it constantly crashed for no reason over and over. Contacted steam who were of no help and I had gone over 6 hours gameplay trying to get this working so they auto-responded and denied my refund request. I tried again, finding no solution to the crashing so have given up and now have a useless game sitting in my library.. :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't play much (more than 0.8 hours though, that seems to be a glitch), but I strangely didn't like this game.\n\nI really like early Settlers games, and I like Anno games. The negative delta between Settlers and Anno for me is that Anno is much more railroaded (different installments to a different degree), where the challenge is to do one specific next thing, like get 1000 artisans or whatever, while keeping the rest intact.\n\nThis game takes that delta up to 11, I think the queen's demands or whatever mechanic is terrible. I might try this game again to see if that  improves as you make progress, but for the first few hours you are always doing STRICTLY one thing, and one thing only  (and as an aside, I dunno what's roguelite about this game, it has no combat and is completely linear). Really not for me if that's how it continues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has great city building mechanics and replayability except for one huge problem... There is zero combat in this game making it feel somewhat bland and a obvious missed opportunity. It takes the realism away from the game when you have no town watch or town guard or no standing army to protect your very vulnerable town, it just doesn't make any sense. You have a new outpost in the middle of a ravenous wildlands and nothing is coming out of the woodwork to attack you, huhhhhhhhhh???????? WHY?????? Adding combat would be so easy to implement and it would only make sense given how hostile this world is supposed to be, somewhat braindead concept when you think about it. The game gets stale after awhile without any meaningful combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While I thoroughly enjoy the art style and the variety and complexity of resources, the heavy use of rng leads to unwinnable situations. Losing on a map that you’ve spent hours playing, simply because quests start asking for items you can’t produce and the traders don’t seem to want to show up with, is just annoying and results in a sense of ‘I’m wasting my time’.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Immensely disappointing. Instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lol ist Soo bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didnt like",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too much RNG.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you don't like losing to a timer, this isn't the game for you. I almost feel bad posting a negative review about the game because you can tell the devs put a lot of heart and effort into it, but at a certain point you just have to admit when a game isn't fun and for all the interesting mechanics they put into the game...it's all gutted when you lose to a timer (which is the only failure mechanic for each level).\r\n\r\nWhat makes it even worse is that so much of the game is left to RNG. What buildings you choose from. What resources are on the map. What settlers you get to choose from. The missions/orders you receive. Unfortunately you can just lose a mission because the RNG options you receive don't line up well enough for you to beat the clock. Has nothing to do with your strategy or decisions.\r\n\r\nEssentially all you are doing in the game is choosing from randomly generated options (orders, buildings, etc) without any ability to plan ahead. So the only thing in your control is making sure that the right types of settlers are assigned to the appropriate buildings, and that those buildings are near their resources. Even the town layout doesn't really matter beyond placing production buildings near resources and each other to cut down on travel time, and putting homes near the hearth. But there is no room for individual strategy or play style. And it doesn't help that there are buildings that you obviously want to choose every mission if you are lucky enough get them, and other buildings that aren't worth it but you have to choose because you don't have any other choice. \r\n\r\nAt it's best, levels are too easy and you beat them with plenty of time to spare. At worst you get a bunch of bad rng rolls and get to watch the clock run out while you scramble to try and compensate (or don't because you are left without any options). But always you are left wishing the timer didn't exist and you could just build out and optimize your town, and keep exploring the maps. \r\n\r\nThe aesthetic is really nice but I'm willing to bet this isn't the city builder, resource management game you were looking for.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "After playing it for a while, you realize each game plays the same, with only minor differences based on whichever buildings are available. Random events don't really change how you approach each game, and overall progression through the unlock tree feels very slow.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[H1] This is a hard game to engage with ?! [/H1]\n\nThe underlying mechanics are great, but it just seems so hard to engage with them. Knowing how to set up your happiness structures for villagers, dealing with blight outbreaks, or planning journeys. The more effort you put in to mastering these systems the more that seems to go to waste, as though the game is deliberately waylaying your progress and prolonging your game time. \n\nThese are just hard systems you have to memorize to conquer, and the difference isn't a strong village but [b]well done[/b] you were faster than the Queen's Impatience (the time out function). \n\nIt's a hard game to make pretty in a sense. It doesn't build together to make outcomes. You achieve a speed score and that's not my type of memory game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was a huge miss for me, the whole game felt too much like a sandbox and didn't have enough feeling of \"building up to survive\". I've admittedly played dozens of these city builder types, Frostpunk, They are Billions, Sim City, etc, so I do have a good bit of experience when I say this just, wasn't any fun for your actual gamer. I don't know how this has overwhelming reviews, perhaps only casual players play it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rubbish. I tried hard to get into it but it constantly crashed for no reason over and over. Contacted steam who were of no help and I had gone over 6 hours gameplay trying to get this working so they auto-responded and denied my refund request. I tried again, finding no solution to the crashing so have given up and now have a useless game sitting in my library.. :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't play much (more than 0.8 hours though, that seems to be a glitch), but I strangely didn't like this game.\n\nI really like early Settlers games, and I like Anno games. The negative delta between Settlers and Anno for me is that Anno is much more railroaded (different installments to a different degree), where the challenge is to do one specific next thing, like get 1000 artisans or whatever, while keeping the rest intact.\n\nThis game takes that delta up to 11, I think the queen's demands or whatever mechanic is terrible. I might try this game again to see if that  improves as you make progress, but for the first few hours you are always doing STRICTLY one thing, and one thing only  (and as an aside, I dunno what's roguelite about this game, it has no combat and is completely linear). Really not for me if that's how it continues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has great city building mechanics and replayability except for one huge problem... There is zero combat in this game making it feel somewhat bland and a obvious missed opportunity. It takes the realism away from the game when you have no town watch or town guard or no standing army to protect your very vulnerable town, it just doesn't make any sense. You have a new outpost in the middle of a ravenous wildlands and nothing is coming out of the woodwork to attack you, huhhhhhhhhh???????? WHY?????? Adding combat would be so easy to implement and it would only make sense given how hostile this world is supposed to be, somewhat braindead concept when you think about it. The game gets stale after awhile without any meaningful combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While I thoroughly enjoy the art style and the variety and complexity of resources, the heavy use of rng leads to unwinnable situations. Losing on a map that you’ve spent hours playing, simply because quests start asking for items you can’t produce and the traders don’t seem to want to show up with, is just annoying and results in a sense of ‘I’m wasting my time’.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Immensely disappointing. Instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lol ist Soo bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didnt like",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too much RNG.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you don't like losing to a timer, this isn't the game for you. I almost feel bad posting a negative review about the game because you can tell the devs put a lot of heart and effort into it, but at a certain point you just have to admit when a game isn't fun and for all the interesting mechanics they put into the game...it's all gutted when you lose to a timer (which is the only failure mechanic for each level).\r\n\r\nWhat makes it even worse is that so much of the game is left to RNG. What buildings you choose from. What resources are on the map. What settlers you get to choose from. The missions/orders you receive. Unfortunately you can just lose a mission because the RNG options you receive don't line up well enough for you to beat the clock. Has nothing to do with your strategy or decisions.\r\n\r\nEssentially all you are doing in the game is choosing from randomly generated options (orders, buildings, etc) without any ability to plan ahead. So the only thing in your control is making sure that the right types of settlers are assigned to the appropriate buildings, and that those buildings are near their resources. Even the town layout doesn't really matter beyond placing production buildings near resources and each other to cut down on travel time, and putting homes near the hearth. But there is no room for individual strategy or play style. And it doesn't help that there are buildings that you obviously want to choose every mission if you are lucky enough get them, and other buildings that aren't worth it but you have to choose because you don't have any other choice. \r\n\r\nAt it's best, levels are too easy and you beat them with plenty of time to spare. At worst you get a bunch of bad rng rolls and get to watch the clock run out while you scramble to try and compensate (or don't because you are left without any options). But always you are left wishing the timer didn't exist and you could just build out and optimize your town, and keep exploring the maps. \r\n\r\nThe aesthetic is really nice but I'm willing to bet this isn't the city builder, resource management game you were looking for.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "After playing it for a while, you realize each game plays the same, with only minor differences based on whichever buildings are available. Random events don't really change how you approach each game, and overall progression through the unlock tree feels very slow.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[H1] This is a hard game to engage with ?! [/H1]\n\nThe underlying mechanics are great, but it just seems so hard to engage with them. Knowing how to set up your happiness structures for villagers, dealing with blight outbreaks, or planning journeys. The more effort you put in to mastering these systems the more that seems to go to waste, as though the game is deliberately waylaying your progress and prolonging your game time. \n\nThese are just hard systems you have to memorize to conquer, and the difference isn't a strong village but [b]well done[/b] you were faster than the Queen's Impatience (the time out function). \n\nIt's a hard game to make pretty in a sense. It doesn't build together to make outcomes. You achieve a speed score and that's not my type of memory game.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}