{
  "positive": [
    {
      "review": "Phenomenal game. I had a stroke in October and thankfully most content really needs just one hand to play properly, so what little time I had to game, OSRS was great for it.",
      "voted_up": true,
      "votes_helpful": 90
    },
    {
      "review": "this is probably the greatest game to ever exist... i will be playing old school runescape for the rest of my life... lol by the way... i have way more then 17.8 hours on this game... i just started playing it through steam. im 32 years old and started playing it when i was like 11 so imagine how many hours i got into runescape....\nplease play runescape and lets keep the game ALIVE!!!!",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Old School RuneScape has the energy and life of a modern MMO, while largely avoiding the traps and pitfalls of modern MMO games (e.g., FOMO, microtransactions, dailies, etc.).\n\nIt has a frequent update schedule and endless progression & content that engages any type of player (solo/group, casual/hardcore, PvM/PvP, etc.).\n\nIt's the game that truly makes you feel like a kid again, who can't wait to go home after a long day and log in to your favorite MMO.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "“OSRS Ironman mode turns the game into an incredible journey of self-sufficiency. Challenging, nostalgic, and deeply satisfying.”",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "**Probably have closer to 6,000 hours compared to the 524 it shows for when this review is posted**\r\n\r\nMy pick for best MMO, and one of the best games ever made. Pretty chill barrier for entry with a very high skill ceiling depending on the content you like to do. The game has a great sense of progression, with the time you put into it leading to rewards and unlocks that really feel like they matter. \r\n\r\nIt definitely has a grind element to it, but if that isn't a bother then there's potentially something really special here for you. \r\n\r\nI should also say that if this game does \"click\" for you, I am SO sorry.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game. Devs are some of the best of any MMO for the amount of community feedback they take in to make the game better",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Okay so first time player of OSRS and im a F2P Ironman, im now 100+ hours deep and it has been super easy (time consuming) but super easy and fun, you do not have to become a member straight away or at all but you are/will be restricted on how fast you can lvl (they also dont push for you to become a member, only when you try to access member content). Now, im probably gonna drop another 50hours before i buy member bcuz then its really gonna take time for me to progress. I do recommend this game, i also recommend to have wiki on hand and that you have at least watched some starter guide video on YT.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I like this game but I couldn't complete the \"nautical nonsense\" quest featuring the iconic character of spongebob. no matter how hard I tried it required me to have \"bigger pants okay\" and not sure what that means. weedbob? not entirely sure. I like this game though.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So happy I played this game when I was younger so I already had a account to use \nI had fun get 100% achievements",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is the only game I can just shut my brain off and watch numbers go up. absolute peak\n\nalso if your gonna play this game, dont play it on steam, play it on Runelite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like sitting by a window on a rainy day, with a big warm blanket. Pure comfort & cozy gaming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The perfect game to play while watching One Piece - Neither require your full attention 100% of the time, and you'll max out your character in about the same time it'll take you to watch all of One Piece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic grind and level your skills. It's been released for decades, so tons of content to keep you busy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nostalgic game which still stays alive. (Rare thing for games nowadays). Good game to empty brains when needed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "generally well designed MMO with developers that seem to care about the playerbase. no microtransactions, and all changes are voted for",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's not enough words to really describe my deep love (and hate, but read on) for this game and I truly believe Oldschool RuneScape is one of the best games of all time. Right now is the absolute BEST time to jump in for the first time, or again after awhile if you've played before - this is the game's platinum age and you can't miss it. Steam charts do NOT grasp the full extent of the hype - 150,000 people play daily.\n\nHere's my HONEST review as a veteran player. (TL;DR at the bottom)\n\nIn 2012, the developing company Jagex absolutely fumbled the bag and destroyed the original game (RuneScape/RS3) with a terrible-at-the-time update (too much to get into here), 6 months later in February 2013 after massive community backlash, they re-launched the 2007 version, the ''golden age'' of the game, and It went through a period of hype, quick die-off, long stagnation, and then re-development to create what is the game we all know and love today.\n\nThe issues that led to the downfall of the original cannot exist because all major updates outside of balancing require a successful vote via in-game poll system to pass (70%+) and these days the development team is comprised of tenured, veteran employees, and newer, dedicated, ACTUAL PLAYERS who've been through the lows of the past that now get to work on their passion and preserve it.\n\nEvery level you achieve, and every item you earn mean something. This isn't like many other MMOs you may have played where every new major content expansion or update completely nullifies previously sought items. Your achievements and effort mean something and will always stay. Your best-in-slot equipment, weapons, and armor do not suddenly become worthless upon an update. They may, rarely, be superseded by a newer item but the old one retains usefulness and value. The game thrives on it's horizontal progression system.\n\nInstead of WASD movement, this game relies on your mouse and clicking the most. You'll still use your keyboard, but usually only your function (F1/F2 etc) keys to change UI tabs significantly faster than clicking the icon. Think of this as a rhythm game, all actions and functions are on a 100bpm/0.6s \"tick\" system. Focusing on the rhythm itself is ABSOLUTELY NOT ESSENTIAL in the beginning, and is only necessary at a late-game stage where select combat encounters and certain training methods require tick-precise input. By the time you get there, you'll understand. It's incredibly approachable from a know-nothing beginner standpoint, and easy to learn over time because the game will ease you into it.\n\nSome people have a hard time enjoying the game due to the low graphics quality. I don't know what to tell people who are hung up on this. There are certain plugins on playable game clients that can resolve this to an extent - but I've always been a gameplay over graphics person. The low-poly style of OSRS is it's charm. You don't need \"nostalgia glasses\" to play the game, and I disregard that argument. This isn't supposed to be a modern game with modern frills, and if it's not for you, then it isn't for you - and that's fine.\n\nThe gameplay loop of skilling and killing can be rewarding for some, but a slog for others. I won't lie, it can be HARD to get into for new players if you aren't willing to make a commitment, but when you do it is extremely rewarding. The highest level per skill is 99. 50 isn't halfway, haha, no. It's 92 - because the experience curve is EXPONENTIAL. The original developers in 2001 never expected people to make it to 99, nor did they expect people to make a goal of getting 99 in *every* skill. Skills are, however, balanced well and 90% of playable content is unlocked by the time you're 1/4th to 99 (level 85), so maxing skills aren't strictly necessary but more of a long-term goal. For example, I've been playing OSRS since 2013, have significantly more hours off-Steam, and am still only at 2,330 total levels (maxed is 2,376) but enjoy all of the available content.\n\nFinally, I can't speak to every issue the game has but I can speak two of the bigger ones, first, the 'bot' problem - it's not like TF2 if you're curious. \nLike any MMO with an expansive game and active economy, there's people who want to make as much money (in-game, and REAL) as possible. Look up how reliant Venezuela is on OSRS gold. It's a big problem. Jagex is absolutely doing it's best to stop them and solve it, but this is an arms race as old as time, and cannot ever truly be won. I won't fault them fully for the issue, as it's only natural to be had, but they could be doing more.\nSecond, account security and customer support. For the longest time, Jagex has been notoriously HORRIBLE about keeping good customer support despite being a billion dollar company. They're recently been making public strides to improve this. Personally, I have not had issues. My infosec is good, but it isn't for everyone. Keep your stuff secure.\n\nMost of the loudest voices talk about these two issues and while they are problems, they are not as massive and overblown as some people make them out to be - your mileage may vary.\n\nSo, with as much as I've written to be said so far, and without prolonging this review to the point nobody wants to read, I'll summarize with a quick TL;DR.\n\nTL;DR, the game is fun. It's grindy, it takes time, and it has it's quirks - but if it wasn't enjoyable and rewarding it wouldn't be getting as much traction as it does today. Massive community, foundational in early internet culture and maintains a large footprint today. The phrase 'you don't quit, you just take a long break' comes from RS and is absolutely true.\n\nGive it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the past year all I've been doing is cutting the same tree down in Lumbridge and setting the logs on fire. Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played off and on for 10-15 years, always a classic to come back to and feel like you can pick up right where you left off.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steam is G O A T E D for porting OSRS to Steam, plus with added achievements!! PLUS you can also play RS3, but yeah.  Same nostalgic feeling playing on your Steam account, just sadly no nostalgic feeling of Java, BUT still playable.\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the greatest sandbox mmo's to ever exist, still thriving today and better than ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing Old School RuneScape on Steam has been a blast. I love how it takes me back with its retro graphics, but there’s so much depth in quests, skilling, and PvP that it never feels shallow. The community is surprisingly active, and I always find people to team up with. It’s definitely dated visually, but the nostalgia and endless content more than make up for it. Honestly, it’s one of those games I can sink hours into and still find something new to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly OSRS just gets better with age. No wonder the playerbase is reaching all time highs because all the updates are awesome, so much fun stuff to do and progress is permanent. You don't lose it like in other MMOs. Questing is a lot of fun and gets rid of most of the grinding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With Sailing having just recently come out I can definitely say Old School Runescape has aged well, the new content feels natural and cohesive everything is interconnected and the segment based storylines allow the stories to continue through the years. and even if you do not engage with the world history it it thriving with minigames and bosses to keep you engaged.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game always. I love the difficulty of the tasks and how you have to logically think of the steps to finish it. I wish there were more free quests, tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just writing this for steam badge but i voted osrs labor of love, the game has just had it's biggest update yet after 20+ years if that isn't worthy of the title idk what is\n\nthis is the game that is always here for you, osrs is home to me and hundreds of thousands of others\ni will probably be playing this game for as long as i'm alive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not much of a runescape person but after all these years this game has been around a major update adding a whole new side to the game is the kind of event that shows how much devs care for their games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runescape is an MMORPG that does NOT ask you to Min-Max everything. You have the choice to use the Meta strategies or simply sit back and casually do whatever task comes to mind. You can choose to partake in a hardcore challenge or just log in and play for a few minute before going back to work (or school idk). What is most important is that the road is long but very open, whatever barriers that may appear are easy to get past at whatever pace you decide.\n\nI have played for 10+ years (before steam access) and I cannot recommend this more. No matter how invested you may or may not be, there's always something to do or at least try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple looking game but super fun to grind. I'd recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wish I still had my stuff on my account but starting over is not so bad. Hits the nestlogic itch.  Add the fact you can play it on your cell phone only adds to the exp. ^.^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first played 2007, nostalgia at its finest, when I start this game I suddenly feel like a child during the 2008 financial crisis again, 10/10 do definitely recommend\n\nFalador was an inside job",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun to play and waste time with.\nYou do need Membership to really get the most out of the game though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has ton of activities, enemies have a variety of mechanics, but it requires a lot of grinding to get powerful gear and high levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed playing runescape as a kid and it is still as much fun today",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game that never ends, in a good way imo.\nYou can play super actively at bosses, raids, and PVP, or just fish and cut trees all day while you watch videos and talk with friends. \nIt has some of the best written quests, which can get pretty complicated if you decide not to use a guide.\nMusic is charming, love the world design, as well as the armor and weapons. The team tries hard and does a good job of trying to keep many places and items relevant for a multitude of things, and preventing things from becoming dead content or useless, though inevitibley there are some corners where that exists.\nLately I've taken up doing clue scrolls, which are a side activity based on the occasional maps you can get that are dropped by monsters, which will lead you to treasure. Some of the rarest and most expensive items in the game are acquired this way, and it's always fun to test your luck from time to time.\nI'm not sure what I can say that hasn't been said before, but this game has lasted so long for a reason and it's worth trying out if you have time on your hands and can't decide what to play. Give it a chance, let it grow on you, look up some content on youtube to see what the game has to offer. (That said, don't let it consume you. Many such cases.)\nI play mostly on PC and sometimes mobile. Not sure what the Steamdeck experience is like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "*Log in\n* Click some trees\n* Click some rocks\n* Do some quest/s\n* Kill some monsters\n* Rinse and repeat\n\nAnd it just works, a classic MMORPG that still is going strong!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you are looking a game to grind then look no more this is it... i have played different accounts and even when i step away i always come back to the grind... and yes i don't really play it on steam but on runelite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played Runescape since 2004, came back to oldschool in 2022. The best time to start is now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game with the most dedicate dev team I have ever seen. Truly a passion project.\nThe quests, the soundtrack, the silly looking combat and the numbers going up - this game has it all.\nWith thousands of hours outside of Steam on both RS3 and OSRS, you truly never quit, only take long breaks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Jagex Client is still awful (lots of other clients you could use) - and those clients make the game much more playable and interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games to exist. I don't have a lot of hours on steam because I usually play using RuneLite or mobile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a game that will most likely get a spot in your memory, it also gets updates\n\ni played this game back in the childhood and the nostalgia always makes me come back from time to time for the fun when it arrived on steam. its a very chill easy going game.\n\nlooking forward for the next time im going to subscribe then i will be sailing everywhere!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can always come back to it and enjoy yourself. Hours on hours of gameplay & a team that listens to it's community driven polls/feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The perfect mix of not-quite-an-MMO, idle game, rhythm game, and chat room. Has an amazing range of attentional tuning: fight a boss that requires perfect timing and dozens of actions for minutes at a time, or chop a tree by clicking the screen once every 10 minutes, or pick something in between. No matter your choice, you're making permanent progress that never resets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it way back in the day (only been playing on Steam for about 1.5 years, 790 hours (for my tracking)), still plenty of fun. A wonderful game for grinding some skills while catching up on other media. Regarding membership, my 2gp (couldn't resist) would be to play free for a while to accumulate raw materials and levels, before deciding whether to go member.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only MMO that is not tainted by the filth of Cash shops and macro transactions. 20+ years old but still the best one available. Also the only game/developer who know how to handle the player criticism and expectations with their polls and how that is transformed in to the game. I am very happy that I am playing it now, but it is a bit sad that there is nothing available to satisfy the MMO itch without cash shops and Macro transaction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played before RuneScape 3. Had so much fun even though I played F2P\n\nTried OSRS this year as an Ironman. I tried membership too; it itched something in my brain and I never stopped playing since. Truly one of the best MMO game of all time.\n\nMonthly subscription is so worth it. Don’t let the price scare you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOAT game with a great team behind it. 10/10 would spend another 20 years playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "click button, lather, rinse, repeat for 20 years off and on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wasted many hours on this game in my childhood, and I'm glad to be able to waste even more hours on it in my adulthood.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend made me addiction to play this game also learning a lot better than school",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was banned cause my account got hacked and I had to reset my progress. Still its a great game and tons of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grew up playing this game and the developers have only made positive changes to it. The best 2nd monitor game by far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played the game and now I'm sad that I didn't when I was a kid. Being a grown up and playing OSRS is hard, but boy I love to suffer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's runescape, but none of those bad decisions by the newer guys.\r\n\r\nWhile it's a snapshot of an older version, it's been growing in an unique direction, i love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The community is incredibly generous and friendly. Someone gave me full steel armour and guided me through how to level up my defense to equip it.  If you like friendly players you can get along with, and are ready to pass that experience on to the next person, this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the classic RuneScape from 2007, and it’s really enjoyable. No FOMO, no micro transactions, and being able to play a nostalgic game at your own pace. It’s very relaxing. \n\nI use to play this game extensively from 2005 to 2008, and I eventually moved on. I was a little bummed by original character I’m now part of RuneScape 3, but starting over hasn’t been that bad. My character is essentially the same character but back at level 3. There is a certain amount of fun in being able to relive an experience of leveling up my exact main character all over again. \n\nThe main MMO I have played as an adult is ESO, and I’ve treated it like a solo RPG. I’ve had a lot of fun on there and spent roughly 4300 hours in game. But the flaws of ESO standout in comparison to OSRS. I still play ESO, and its micro transactions aren’t nearly as bad as RS3; but OSRS reflects a time when things weren’t all about money. It’s a nostalgic feeling, and I’d strongly recommend giving it a try even if you never played before. There’s a lot to enjoy here, and it’s unlike anything else when you compare the active player base, which is pretty insane.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. It was all I could play on my crappy computer as a child and coming back to it, it's got a lot going for it. It can still run on just about any computing device including your phone which is a plus. Lots of ways to make progress and every bit of progress is meaningful. Not all the content is strictly relevant, but a lot of it is still fairly evergreen which is refreshing, and even the irrelevant areas there's usually at least one thing worth collecting to round out your log or whatever.\n\nOh and it's cheaper than going to the doctor for an adult autism diagnosis.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best retro fantasy MMORPG on the planet. Old School is RuneScape but… older! This is the open world you know and love, but as it was in 2007. Saying that, it’s even better than that – Old School is shaped by you, its players, with regular new content, fixes and expansions voted for by the fans!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got permanently banned after finishing the tutorial. Great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Old School RuneScape is the only game where you log in “just to do a farm run” and wake up three hours later woodcutting in a completely different part of the world with no memory of how you got there.\n\nIt’s:\n\n* 50% nostalgia\n* 30% grinding\n* 20% staring at XP drops like they’re stock prices\n\n---\n\n### Pros:\n\n* Truly playable on **any** PC. If it can run a web browser and mild shame, it can run OSRS.\n* One account, one character, 47 different “build ideas” you will never actually commit to.\n* Skills for everything: cooking, fishing, mining, construction, even “standing in a bank wearing fashionscape pretending you’re busy.”\n* Quests are simultaneously unhinged and legendary:\n\n  * Help a sheep\n  * Kill a dragon\n  * Commit light tax fraud for the King\n* The Grand Exchange is a fully functional anxiety marketplace where you list an item, forget about it, and then get 12m gp randomly one week later.\n\n### Cons:\n\n* “AFK” content that somehow still eats your entire evening.\n* You will absolutely misclick and light a fire in the middle of Varrock bank at some point.\n* New players: killing goblins.\n  Veterans: clicking on a single pixel in Barbarian Assault for 2 hours.\n* Level 99 in anything doesn’t mean “you’re done,” it means “now do it again but more efficiently.”\n\n---\n\n### Peak Old School Moments:\n\n* Spending 15 minutes theorycrafting a money-making method that earns 150k/hour while rocking 300m in the bank.\n* Saying “I’ll just do one more Slayer task” and suddenly it’s 3 a.m. and your coffee is cold and your cat hates you.\n* Dying in the Wilderness, losing everything, calmly closing the game like “yeah that’s fair.”\n* Getting a super rare drop, screaming, then realizing you can’t tell non-players because they won’t understand why a pixel stick made you emotional.\n\n---\n\n10/10\nIt looks like 2007, feels like a part-time job, and somehow is still one of the most addictive games ever made.\nWould chop one more tree, do one more quest, and “just finish this inventory” for the rest of my life again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "True peak game-play. No other words to describe it. Graphics might look laughable at first, but you get used to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best MMO out there if you look past the graphics. When you do and play more you even appreciate the graphics. \r\n\r\nAs a 20 year long WoW veteran I can say this game has soo much more to offer than all the mmo's with vertical progression where you keep getting stronger and stronger making old gear useless.. Oldschool runescape does it different and does it well. \r\n\r\nI play as an ironman (official option ingame) which means I have to do everything myself without trading and it makes it very fulfilling for me. \r\n\r\n600 hours in and don't seem to be stopping soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic graphics, decent font, sexy music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played a lot of Runescape on mobile, but it's way better on PC. I would highly recommend OSRS to anyone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "haven't played this since 2008 and it's so nostalgic. but now it seems more membership based, but free to play can also be explored for quite some itme",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played this game since like i was 6 years old.\nrunescape classic, runescape, runescape 2, runescape pre-eoc/runescape 3. oldschool. just a grindy game, good for adults imo...nothing competitive. just chill. obviously p king is competitive and sweaty nowadays compared to back in the day...but yeah...good game if you just wanna game solo, kill time, raid with friends. maxed 3-4 times. now playing iron man. good sht.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра Old School RuneScape - это ностальгическое путешествие во времена рассвета MMORPG, для тех, кто помнит 2007 год. Грубая, угловатая графика подкупает своей простотой, а хардкорный геймплей заставит попотеть даже опытных игроков. Никаких тебе автоматических квестов и подсказок - все приходится искать и делать самому, полагаясь на онлайн-сообщество или собственную смекалку.\n\nПрелесть OSRS в ее полной свободе. Хочешь стать богатым торговцем? Пожалуйста. Мечтаешь покорить всех боссов? Никто не запрещает. Жаждешь PvP-сражений? Wilderness всегда ждет. Игра постоянно развивается, добавляя новый контент, но при этом бережно хранит дух старой школы.\n\nЕсли вы устали от современных MMORPG с их бесконечными упрощениями и жаждой микротранзакций, OSRS может стать глотком свежего воздуха. Приготовьтесь к гринду, смертям и множеству часов, проведенных в поисках решения. Но поверьте, это того стоит. Это игра, где каждое достижение чувствуется заслуженным, а чувство удовлетворения от победы над сложным боссом ни с чем не сравнится.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably one of the best mmos on the market. Addicting and full of content with the membership, althought its worth noting that the free quests given can give a good idea on what the game has to offer if you're not sure whether this game is worth the money or not. \nOverall reccomended, especially if you end up using the runelite launcher which can give you some nice plugins to improve your experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i never played as a kid really sad i missed out on this being a part of my childhood. its pretty fun although as i understand it things have changed alot and its not what it used to be. having said that, without the perspective of what once was, the game is fun and enjoyable. i see why it has stood the test of time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 3200 hours in this game across 3 characters before the Steam version released. I have quit twice and am now returning again for sailing. It's really addicting. Main pros of this game are the progression, social aspect, and ability to do all content solo. There is also a lot of room for freedom and creativity. I guess the only con is that the community doesn't always agree on what is best for the game, so there is content which could be improved but doesn't get improved because it fails the vote threshold",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You never quit.....you'll always be back. Don't let my steam hours fool you as i play on the Runelite client. 3000+ hours in and now i can play the game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game, I've achieved everything i need to do in F2P unfortunately, since steam doesn't launch the launcher for Runelite support, I missed all of my achievements since I started using it and even in base game achievement (without using runelight just a straight download ) some achievement like \"Democracy in action\" doesn't trigger no matter how many times you open polls as F2P.\n\nRegardless, I will never regret playing this game and I will miss 301 with the few hours I spent standing on GE as well as finally destroying Elvarg. \n\nhopefully in the future they can add Runelight for steam so I could get achievements while my game doesn't look like dawgsheet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing sense game came out many years ago it is a good fun challenging game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only just started it today, using RuneLite, sadly i cant use it with Steam to get the achievements :(\n\nI feel like im super late it, but im glad its still very much active, just wish i was in the Grindset way earlier, love goes out to the community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I cry while I play this game. Why does it have to be on steam and accessible to me after 18 years it's like a malignant cancer that keeps popping up. If you need me I'll be in Edgeville.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a classic, i remember playing this as a kid, it's a bit dated but it brings back some memories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have loved this game since i was a kid and they have optimized the experience very welll i still play it from time to time and always enjoy myself no matter what i end up accomplishing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and casual game, I play it when I am just hanging out with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really love coming back to the old game. I just kind of wish we could restart if we wish to stream it but there's no way to do this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for some off reason i keep misclicking in the game on the 1star rating because of my high level alching clicks without barely looking. making up for that by writing a positive review lol. i like osrs. its a fun time killer for me, even as f2p.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh Runescape. How much time I spent as a kid chopping wood, killing wizards etc...\nAlways F2P mind you. Its been 6 years and suddenly ive got the itch. This is the chillest MMO ever. Even the combat is so slow it doesnt even feel like combat. \nI made my first 1mil 6 years ago, I forgot and logged into a lvl 50 I forgot I had and had just bronze junk. Oh yea, I gave away my 1 mil and \"quit\"\nLets get 1mil again! Lol. \nAlso, I wish I knew how to get back all the old accounts I have with random emails. I probably have about 6+ account out there I dont remember anything about from child/teen hood.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is exactly how I remember it when I played as a teenager. It's so nostalgic, such a fantastic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have over 15,000 hours in RS2/OSRS, easily the best MMORPG to exist, and i've played my fair amount over the last 18 years and OSRS is the only one i come back too, you will never complete this game, it has essentially infinite content that doesn't make the prior content obsolete, so you can enjoy bosses released a decade ago and the gear still be relevant to your progression. super grindy but the sense of progression is something else, no game can farm more dopamine than this one. i also recommend using the JAGEX launcher using runelite as your client.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Personally this MMO is personal for me, it was my entry into the english-speaking community and believe me when I say I have some hilarious anecdotes about this incredible game.\n\nThe missions, aesthetics, world, and its incredible community are the best things about this game, which, although it runescape he feels old, he has a bunch of sh*tty bots and have a confusing PvP even so, it's a great game and one of the best MMOS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like a really cool fantasy RPG game and I enjoy it because levelling up feels like chugging Monster Energy until i become too caffeinated to function  without exploding something.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are horrible. Always have been really. Even in 2007 we said so. But the gameplay? The mechanics? A pure old school MMORPG experience. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If it's not too late for you, just start smoking cigarettes instead. They're better for you and you'll look cooler.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of the best games ever in human history. The longevity and content this game offers is wild, and I truly appreciate it. I played this game for over 20 years and must say it has and always will be a hit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game to spend alot of time in both solo and with friends and do group content. but tho would strongly recommend to set up so steam boot up Jagex launcher or runelite. To be able to use runelite and all its tools and plugins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The better version of RuneScape, with no microtransactions. Continiously updated, with new skills, areas and quests. Looks pretty old, but still very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still my favorite mmo after all these years. Lots of freedom in how you choose to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Progress matters. You never really quit, you just take long breaks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic MMORPG that has an amazing amount of free content to enjoy and a whole world available to members. The steam client version makes logging in pretty simple to a single character but if you want to use another you need to go to the Jagex site and switch linked characters, which can be a pain.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I honestly loved OS Runescape, but I'm not a insanely active player. However from my limited time on Steam, PC, and playing on a modded 3DS that one time... it's a classic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Back from the Miniclip Days when I was in Primary school! classic of classics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started recently after seeing the hype for sailing and it’s been really addicting so far. I’m glad that it runs on mobile so I can do a little whenever I have time and carry that progress back over to steam without having to do anything special on my part. For now I’m staying free to play until I’ve built up some more skills and done the quests available but I can definitely see myself becoming a member in the future. Great if you need a time sink (for quests) or something to just turn your brain off but be working on an objective (for leveling or making money). Only complaint so far is as free to play you’ve got a long hold on your account before you can start trading with people, they can trade you but you can’t trade anything back for a good chunk of in game time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐ 11/10 – Peak 2007 never left\n\nI logged in for nostalgia.\n\nNow it’s 3 AM, I’m clicking on virtual rocks while watching YouTube videos about efficient tree-cutting routes. My fingers have developed muscle memory for “1, 2, 3, drop, repeat.”\n\nI told myself I’d “just do a few quests.” It’s been six months. I’ve fought dragons, joined a cult, and still haven’t gotten 99 Cooking.\n\nEvery time I die, I lose 3 hours of progress and somehow thank Jagex for the experience.\n\nThe economy is run by people with spreadsheets and gambling addictions. The Grand Exchange is basically Wall Street if everyone wore party hats and argued about cabbage.\n\nHighlights:\n\nChopped 14,000 logs to afford a hat.\n\nGot scammed by someone named “TrusTMeIRl” — twice.\n\nAccidentally clicked “Follow” instead of “Trade” and ended up in Falador.\n\nSpent 40 minutes trying to find a bank, then remembered I was in the Wilderness.\n\n10/10. The grind never ends, but neither does the trauma bonding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First played this in 2003 as a kindergartener who had to have a friend over to teach her how to bake bread on Tutorial Island. Somehow I'm still here.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It doesn't get better than Old School RuneScape. I'm way too deep in to have any kind of well-rounded review, so allow me to simply say: Thank you, Old School RuneScape for existing so that I may get lost in your polygon haven and forget my troubles for a time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you're starting in 2025/2026, you will live longer than me, but you wont truly know what you missed or be a part of this community",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Client is broken. Fullscreen mode does not work and trying to resize the window makes the game crash",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm only going to play this game until my membership runs out in two months. After that, I'm well and truly gone. Sailing has got to be literally [b]the most[/b] braindead thing they could've possibly done besides EoC again. This game is an absolute time leech and I genuinely recommend you don't let it sink its fangs into you. Go play other things, things that you can have your fun with and move on like a normal person in [i]UNDER[/i] 2,000 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "shit game that doesnt give options to delete account or make new account.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its fun if you are a member. less restrictions. otherwise 70-80% of things to do are members only.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I was hooked... watched many videos about this game and all.\nAnd now in 2025 I thought, \"Hey you might as well give it a try\".\nDid the tutorial, everything cool, oldschool feeling like I wanted but then it hit me...\n\nAt the bank guy in the tutorial I got confronted with the \"Benefits\" page of the paid content.\nRight at the top, the first \"benefit\" reads \"World 3 Times Larger\" and I got curious.\n\nTurns out they gatekeep the full map from you for a shitty monthly subscription model. Instantly deinstalled that shit and I will never look back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I learned I was banned for macroing when I don't even know what a macro was while playing the game, very cool moderators you have there jagex, waste of my time (I like the game I am disappointed to learn playing normally, no third party programs whatsoever, and PROBABLY SLOWER THAN THE AVERAGE PERSON is \"major macroing\")",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Possibly the most boring I've played with a community all suffering from stockholm syndrome. I used to think these people belonged in cages but now I weep for they know not what they do...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "At least let players know when you're doing server maintenance, you dorky devs. I went on a rabbit hole for the past hour thinking there was some problem on my machine, when actually everything was ok.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice for nostalgia, and to kill a lot of time, but the grind to get anywhere level-wise is ridiculous. And good luck trying to get anything you need to pay for your membership without a credit card. The only way is bossing and that can take years to get the levels. I only play this when I have absolutely nothing else to do.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Runescape 3 is the real runescape, and can be found Here: https://store.steampowered.com/app/1343400/RuneScape/\n\nThis is just for nostalgiaChuds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing screams \"Old School RuneScape\" like adding pronouns and censoring the terms male and female.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tryed to play on my steam deck and after 10 hours got banned theres no reason why and tryed to get unban so if you got a steam deck and play on it i guess you will get banned tho it was fun playing it again after so many years",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like crack, its an addicting waste of time and money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the biggest MMOs is...\n\nI like the most OSRS Content\n\nBut having a $20 1 per month membership is insane crazy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sailing is the biggest nothing burger of an update I have been playing Runescap since 2002 and I am now quitting, I stayed through eoc, this is worse, would never waste your time on this again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is actually trash. i love runescape, but not letting us have fullscreen? literally just absolute trash and whoever thought we wouldnt want fullscreen should be fired (yeah, in case you guys are wondering, its NOT a bug, the devs actually CHOSE to not give us fullscreen). Uninstalled as soon as i saw i have to download some stupid third party client just for fullscreen. dont waste your time, just play regular RuneScape.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "disconnected several times after 2 hours of wintertotd rewards over 70k points vanished 200plus rewards gone because of shitty disconnects fix wintertotd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trying to log into your account is like trying to break into the washington dc army military defence system",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring trash, too much donation",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i been played for dis account to runelite now i cant play on runelite same account only on steam from now why ???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not the game for ADHDers in my opinion",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game SUYCKS LOLLOOOOOOOO AHAHGAHAHHAAHHAHAHA wassup now YALL 3/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ridiculous Pricing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "rather watch my cat try to open a door",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how the fuck do i change my age f this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "server eror pls",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i got bored",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs constantly dissapoint",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cancelled their pride event",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ya'll pigeons",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck sailing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bottle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCKASS GRINDANJE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let me preface this review by saying that the game is amazing, I have sunk 2400 hours into my main account and almost have a 2000 skill total, two maxed skills, quest cape, I have played this game for 2 years.\nThe amount of content is amazing, your goals can constantly change while the game gives you freedom to do basically anything you want. The ingenuity of this simplicity has allowed hundreds of special snowflake accounts explore the limits of this game like chunk locked accounts, tileman mode, etc.\n\nHowever, as it stands I can not recommend this game to any newcomers whatsoever. Jagex has not only dropped the ball, the ball has went through the basement and is in China. Picture this: You get off the tutorial island and start your first quest to kill an imp.. Sorry can't do that, every imp spawn is immediately killed by a scripted account (A bot).\nAnd sure, while that may at first make you feel like this problem only persists for the F2P version of the game, this problem is made a thousand times worse in the members worlds.\nEvery single activity you can think of, from afk fishing to doing endgame raiding and bosses, it's all botted. The current playercount of around 200k has to be 160k bots, I'm not even inflating this number. Every single activity, every single world. I saw 20 rogue's chest wilderness bots with enough thieving xp to be found on the highscores, and this was just in 2 german worlds.\n\nThe problem is: Jagex doesn't care about bots, at all. Their new CEO, the new company they've been bought up by, they see bots as a GOOD thing, since more player count = more customers = more money.. Which is what ultimately ruined this company and by extension both of their games (Oldschool and RS3).\nAnd when the bank you've been building up for 2 years on your account that's been powered by bonds up until this point loses 100 million gold in a week and the bonds go up to 15m.. Yeah no, I quit.\nThe way they handled this is ultimately pathetic and pointless, announcing a random bingo event instead of even acknowledging let alone banning the bots which kill the 20 year old economy??? Look at any item that could be botted in a price tracker, look how much it has crashed since may this year. Blighted supplies, raw materials, even endgame uniques from hard content like raiding. All due to them not banning gold buyers.\n\nBefore a bot apologist comments something akin to \"There's been bots ever since day 1\" \"There's no way to detect them\" etc.etc.etc., Jagex has turned their bot detection off by purpose, which has lead to bots outgrowing the actual playerbase within these past few months.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "Removed pride event because it's \"political\"... In a game whose almost every quest is about politics.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Tried to like it, played about 4hrs (switched to the Lite client for notification while skilling) and I just found it dull. The combat, the aesthetic, the interactions... I don't know they were just boring. I've never played before so got no nostalgia for it either.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is full of hackers. Jagex is not secure and they do not offer assistance. Do not play this game. It is NOT worth it. 86 up and cannot recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Look I love Runescape for the nostalgia even after they chased away all of us OG players in 2007 and then begged everyone to come back more than a decade later with old school Runescape. But this ain't it. The account syncing was freaking annoying for me for some reason and this version of Runescape on Steam doesn't have the optional launcher called Runelite. If you're not playing with Runelite these days you're just playing handicapped with a bad outdated launcher that Jagex has made tiny attempts to make better. Don't play on this launcher unless you just want things to be like they always were or you're a masochist.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Fun game but Jagex is a horrible company run by broken AI bots that automate everything which will lead to the loss of your account if you're unlucky. They randomly ban accounts with their faulty anti bot system and everything from there is a headache. They do not provide any evidence for their bans because they are unable to provide evidence no many how much you ask for it and their support team practically does not exist at all. They do not read anything and only provide automated copy/paste responses that are useless and ignore everything you've written. All their talk of improvements to their support team is a full on lie.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Client is broken. Fullscreen mode does not work and trying to resize the window makes the game crash",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm only going to play this game until my membership runs out in two months. After that, I'm well and truly gone. Sailing has got to be literally [b]the most[/b] braindead thing they could've possibly done besides EoC again. This game is an absolute time leech and I genuinely recommend you don't let it sink its fangs into you. Go play other things, things that you can have your fun with and move on like a normal person in [i]UNDER[/i] 2,000 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "shit game that doesnt give options to delete account or make new account.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its fun if you are a member. less restrictions. otherwise 70-80% of things to do are members only.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I was hooked... watched many videos about this game and all.\nAnd now in 2025 I thought, \"Hey you might as well give it a try\".\nDid the tutorial, everything cool, oldschool feeling like I wanted but then it hit me...\n\nAt the bank guy in the tutorial I got confronted with the \"Benefits\" page of the paid content.\nRight at the top, the first \"benefit\" reads \"World 3 Times Larger\" and I got curious.\n\nTurns out they gatekeep the full map from you for a shitty monthly subscription model. Instantly deinstalled that shit and I will never look back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I learned I was banned for macroing when I don't even know what a macro was while playing the game, very cool moderators you have there jagex, waste of my time (I like the game I am disappointed to learn playing normally, no third party programs whatsoever, and PROBABLY SLOWER THAN THE AVERAGE PERSON is \"major macroing\")",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Possibly the most boring I've played with a community all suffering from stockholm syndrome. I used to think these people belonged in cages but now I weep for they know not what they do...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "At least let players know when you're doing server maintenance, you dorky devs. I went on a rabbit hole for the past hour thinking there was some problem on my machine, when actually everything was ok.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice for nostalgia, and to kill a lot of time, but the grind to get anywhere level-wise is ridiculous. And good luck trying to get anything you need to pay for your membership without a credit card. The only way is bossing and that can take years to get the levels. I only play this when I have absolutely nothing else to do.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Runescape 3 is the real runescape, and can be found Here: https://store.steampowered.com/app/1343400/RuneScape/\n\nThis is just for nostalgiaChuds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing screams \"Old School RuneScape\" like adding pronouns and censoring the terms male and female.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tryed to play on my steam deck and after 10 hours got banned theres no reason why and tryed to get unban so if you got a steam deck and play on it i guess you will get banned tho it was fun playing it again after so many years",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like crack, its an addicting waste of time and money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the biggest MMOs is...\n\nI like the most OSRS Content\n\nBut having a $20 1 per month membership is insane crazy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sailing is the biggest nothing burger of an update I have been playing Runescap since 2002 and I am now quitting, I stayed through eoc, this is worse, would never waste your time on this again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is actually trash. i love runescape, but not letting us have fullscreen? literally just absolute trash and whoever thought we wouldnt want fullscreen should be fired (yeah, in case you guys are wondering, its NOT a bug, the devs actually CHOSE to not give us fullscreen). Uninstalled as soon as i saw i have to download some stupid third party client just for fullscreen. dont waste your time, just play regular RuneScape.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "disconnected several times after 2 hours of wintertotd rewards over 70k points vanished 200plus rewards gone because of shitty disconnects fix wintertotd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trying to log into your account is like trying to break into the washington dc army military defence system",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring trash, too much donation",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i been played for dis account to runelite now i cant play on runelite same account only on steam from now why ???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not the game for ADHDers in my opinion",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game SUYCKS LOLLOOOOOOOO AHAHGAHAHHAAHHAHAHA wassup now YALL 3/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ridiculous Pricing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "rather watch my cat try to open a door",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how the fuck do i change my age f this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "server eror pls",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i got bored",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs constantly dissapoint",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cancelled their pride event",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ya'll pigeons",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck sailing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bottle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCKASS GRINDANJE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let me preface this review by saying that the game is amazing, I have sunk 2400 hours into my main account and almost have a 2000 skill total, two maxed skills, quest cape, I have played this game for 2 years.\nThe amount of content is amazing, your goals can constantly change while the game gives you freedom to do basically anything you want. The ingenuity of this simplicity has allowed hundreds of special snowflake accounts explore the limits of this game like chunk locked accounts, tileman mode, etc.\n\nHowever, as it stands I can not recommend this game to any newcomers whatsoever. Jagex has not only dropped the ball, the ball has went through the basement and is in China. Picture this: You get off the tutorial island and start your first quest to kill an imp.. Sorry can't do that, every imp spawn is immediately killed by a scripted account (A bot).\nAnd sure, while that may at first make you feel like this problem only persists for the F2P version of the game, this problem is made a thousand times worse in the members worlds.\nEvery single activity you can think of, from afk fishing to doing endgame raiding and bosses, it's all botted. The current playercount of around 200k has to be 160k bots, I'm not even inflating this number. Every single activity, every single world. I saw 20 rogue's chest wilderness bots with enough thieving xp to be found on the highscores, and this was just in 2 german worlds.\n\nThe problem is: Jagex doesn't care about bots, at all. Their new CEO, the new company they've been bought up by, they see bots as a GOOD thing, since more player count = more customers = more money.. Which is what ultimately ruined this company and by extension both of their games (Oldschool and RS3).\nAnd when the bank you've been building up for 2 years on your account that's been powered by bonds up until this point loses 100 million gold in a week and the bonds go up to 15m.. Yeah no, I quit.\nThe way they handled this is ultimately pathetic and pointless, announcing a random bingo event instead of even acknowledging let alone banning the bots which kill the 20 year old economy??? Look at any item that could be botted in a price tracker, look how much it has crashed since may this year. Blighted supplies, raw materials, even endgame uniques from hard content like raiding. All due to them not banning gold buyers.\n\nBefore a bot apologist comments something akin to \"There's been bots ever since day 1\" \"There's no way to detect them\" etc.etc.etc., Jagex has turned their bot detection off by purpose, which has lead to bots outgrowing the actual playerbase within these past few months.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "Removed pride event because it's \"political\"... In a game whose almost every quest is about politics.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Tried to like it, played about 4hrs (switched to the Lite client for notification while skilling) and I just found it dull. The combat, the aesthetic, the interactions... I don't know they were just boring. I've never played before so got no nostalgia for it either.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Anytime the game becomes too fun and XP rates are great for casual players they nerf it completely into the ground. They only care about the players willing to put 12-15 hours a day into the game completely fuin yhe experience for normal people. We are seeing this happen YET again with the new sailing skill. Avoid the game (i have 1000s of hours played on official client and am over 2K total level)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is full of hackers. Jagex is not secure and they do not offer assistance. Do not play this game. It is NOT worth it. 86 up and cannot recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Look I love Runescape for the nostalgia even after they chased away all of us OG players in 2007 and then begged everyone to come back more than a decade later with old school Runescape. But this ain't it. The account syncing was freaking annoying for me for some reason and this version of Runescape on Steam doesn't have the optional launcher called Runelite. If you're not playing with Runelite these days you're just playing handicapped with a bad outdated launcher that Jagex has made tiny attempts to make better. Don't play on this launcher unless you just want things to be like they always were or you're a masochist.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Fun game but Jagex is a horrible company run by broken AI bots that automate everything which will lead to the loss of your account if you're unlucky. They randomly ban accounts with their faulty anti bot system and everything from there is a headache. They do not provide any evidence for their bans because they are unable to provide evidence no many how much you ask for it and their support team practically does not exist at all. They do not read anything and only provide automated copy/paste responses that are useless and ignore everything you've written. All their talk of improvements to their support team is a full on lie.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "its fun if you are a member. less restrictions. otherwise 70-80% of things to do are members only.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I'm only going to play this game until my membership runs out in two months. After that, I'm well and truly gone. Sailing has got to be literally [b]the most[/b] braindead thing they could've possibly done besides EoC again. This game is an absolute time leech and I genuinely recommend you don't let it sink its fangs into you. Go play other things, things that you can have your fun with and move on like a normal person in [i]UNDER[/i] 2,000 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "shit game that doesnt give options to delete account or make new account.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Client is broken. Fullscreen mode does not work and trying to resize the window makes the game crash",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I learned I was banned for macroing when I don't even know what a macro was while playing the game, very cool moderators you have there jagex, waste of my time (I like the game I am disappointed to learn playing normally, no third party programs whatsoever, and PROBABLY SLOWER THAN THE AVERAGE PERSON is \"major macroing\")",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Possibly the most boring I've played with a community all suffering from stockholm syndrome. I used to think these people belonged in cages but now I weep for they know not what they do...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "At least let players know when you're doing server maintenance, you dorky devs. I went on a rabbit hole for the past hour thinking there was some problem on my machine, when actually everything was ok.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was hooked... watched many videos about this game and all.\nAnd now in 2025 I thought, \"Hey you might as well give it a try\".\nDid the tutorial, everything cool, oldschool feeling like I wanted but then it hit me...\n\nAt the bank guy in the tutorial I got confronted with the \"Benefits\" page of the paid content.\nRight at the top, the first \"benefit\" reads \"World 3 Times Larger\" and I got curious.\n\nTurns out they gatekeep the full map from you for a shitty monthly subscription model. Instantly deinstalled that shit and I will never look back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nice for nostalgia, and to kill a lot of time, but the grind to get anywhere level-wise is ridiculous. And good luck trying to get anything you need to pay for your membership without a credit card. The only way is bossing and that can take years to get the levels. I only play this when I have absolutely nothing else to do.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Runescape 3 is the real runescape, and can be found Here: https://store.steampowered.com/app/1343400/RuneScape/\n\nThis is just for nostalgiaChuds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing screams \"Old School RuneScape\" like adding pronouns and censoring the terms male and female.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tryed to play on my steam deck and after 10 hours got banned theres no reason why and tryed to get unban so if you got a steam deck and play on it i guess you will get banned tho it was fun playing it again after so many years",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like crack, its an addicting waste of time and money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the biggest MMOs is...\n\nI like the most OSRS Content\n\nBut having a $20 1 per month membership is insane crazy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sailing is the biggest nothing burger of an update I have been playing Runescap since 2002 and I am now quitting, I stayed through eoc, this is worse, would never waste your time on this again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is actually trash. i love runescape, but not letting us have fullscreen? literally just absolute trash and whoever thought we wouldnt want fullscreen should be fired (yeah, in case you guys are wondering, its NOT a bug, the devs actually CHOSE to not give us fullscreen). Uninstalled as soon as i saw i have to download some stupid third party client just for fullscreen. dont waste your time, just play regular RuneScape.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "disconnected several times after 2 hours of wintertotd rewards over 70k points vanished 200plus rewards gone because of shitty disconnects fix wintertotd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trying to log into your account is like trying to break into the washington dc army military defence system",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring trash, too much donation",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i been played for dis account to runelite now i cant play on runelite same account only on steam from now why ???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not the game for ADHDers in my opinion",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}