{
  "positive": [
    {
      "review": "It's the classic grind and make number go up and feel good game. Its a good time, but there is currently a big issue with p2w MTX slop.\r\n\r\nP.S. Wiki is your friend.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I have been playing Runescape for almost 25 years! Even if i stop playing for a year i always come back. Great game if youre into grinding.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "one of the best games in the world... old school is better but i cant help but love rs3 becuase its still runescape!!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm still new to the game, but after playing for 3 days, I'm hooked! The story lines are funny as heck, and its a family friendly game, which is hard to find. How did I not know of this game for so long???",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "NEVER. dared to play this game, because when I first saw it more than two decades ago the skill system seemed so overwhelming. I am glad I did now, if you tackle one thing at a time theres time for us adults to make progress in this game. There is nothing rushing you to make progress, you can go at your own pase and theres really no order to do stuff. Its a very open game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "More refine version of OSRS regardless of how many people dislike it, coming from a 2013 player this RS3 is heading the right directions!\n\nNot necessarily P2W but it just beautify it\nPaying for member is just unlocking the entire gameplay, no bias",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's alright, a side game you can return to when you have nothing to play. Something rare in the MMO space with most modern ones end of servicing within 5 years.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My husband grew up playing this, I did not (I was a gaia online, maple story and WOW girly). He has continued to play well into adulthood and, after 11 years of being with him I decided to finally pick it up. I love it! Being a 90's gamer, I don't need 4k graphics or 120+ FPS to enjoy a game and I am completely okay with click and point gaming long as its engaging. RS is successful in these aspects, and I love that the developers care for their community and actually take their opinions seriously. I'm thoroughly enjoying my run of the game and highly recommend if you need something fun and doesn;t require to much of your attention.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the casual silliness of the game. the quest line in the timeline order is a great way to experience the game, and make yourself feel rewarded for more for leveling rather than just grinding to see big numbers.\r\n\r\nMaking in game currency is very easy, and you should never be actually broke if you spend a little time each day doing what are referred to as \"shop runs\" everyday.\r\n\r\nso far the people in game have been courteous, helpful and kind when they are not AFK.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spent to long looking for osrs likes when i got burnout from the grind, this fits perfectly to what i wanted and excited to see the game grow now that MTX is being removed in Janurary!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a life style and its well worth it lool! get summmm rs3 or osrs! they both rock",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RuneScape is one of the longest running MMORPG's, and it's well earned its place. With a rich soundtrack, a densely populated world of interesting characters and gorgeous locations, and a nearly countless amount of quests and challenges, one can spend years on the game and still be less than halfway through it.\r\n\r\nThe main gameplay loop of RuneScape is repetition in the form of training skills or earning money, which may be either a deterrent or a bonus depending on the player. Since the game does not require heavy performance, I have found it easy to run the game on one screen or window while doing other things at the same time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game to pass time has alot to do plus to keep busy while you do other little things plus stays updated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty chill and cozy. Has my oldest online account of almost 20 years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game expansive world Alot to do slow start at the start but gets amazingly entertaining the more you play and build up your account",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grew up with this game and might die with it. <3 Exploration is unlimited, various things to achieve almost unlimited as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра RuneScape® - это вечная классика MMORPG, которая цепляет своей свободой и глубиной. Она предлагает огромный, живой мир, где ты сам выбираешь свой путь. Хочешь стать могущественным воином, отважным исследователем подземелий, умелым ремесленником или просто богатым торговцем? Всё в твоих руках.\n\nОгромное количество навыков для прокачки и разнообразные квесты не дадут заскучать, а постоянно развивающийся мир и регулярные обновления делают игру актуальной и сегодня. Графика, конечно, не самая современная, но компенсируется огромным количеством контента и уникальной атмосферой. Важным аспектом является и социальная составляющая - игроки активно взаимодействуют друг с другом, помогают новичкам и создают целые сообщества.\n\nНесмотря на то, что игра может показаться сложной в освоении поначалу, она обязательно вознаградит тех, кто готов потратить время на исследование и погружение в мир Gielinor. RuneScape® - это игра, которая может затянуть на долгие годы, и всегда найдется что-то новое для изучения и покорения.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive played this game for a long time, about 20 years, and have closer to 5000 hours in game. It has had some dark times (2012 to 2024), but it seems that its coming back from the hell hole path it was going down for all that time. Luckily, there is a new CEO that genuinely seems to want to restore the health of the game and it seems that he is doing that. \n They are taking away the predatory micro transactions that have haunted the game since 2012, and they are also backing away from forcing gay propaganda into the game. The game is old as hell, and at a surface level it look dull and pointless. But beyond that, it is a game that has such incredible depth and I, for one, am glad its finally coming back to being the great game it was pre 2012.\nI recommend the game, but it is certainly not for everyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The more modernized UI and mechanics \nThe better game if it wasn't pay for level ups \n\nYou can grind which I enjoyed \nOr you buy a few levels and go play for an hour \n\nIts not a race, your levels don't bother me but the dopamine shifted to daily log ins rather than playing \n\nIt is wild how much of my levels are from daily log in mtx items \n\nGet rid of the items like that or change them to a heavily favoring the you need to grind to get the bonus exp instead of getting instant level ups",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Modern Runescape has the same appeal as cookie clicker. Decent thing to have on your second monitor while doing other things.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "many quests are not really all that interesting, but it is still a fun world to play in",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is so much fun - BUT it drives you insane at the same time! LOL - ChatGPT's guides help though... My two cents worth... just explore and enjoy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing Runescape since I was 14, feels great to get back into it. I'd finished all the free quests there were, and now there' so much more to do, even as a free member.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "once you get used to the combat system, it's probably one of the most immersive and enjoyable mmo's as far as high-level pvm goes. Definitely recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played a few hours in and i think i finished the tutorial part of the game. I will play the main game and see if I like it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "says i have 3 hours but been playing the game since 2005 as a young lad. Its a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "questing or lvling up your skills is a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A certain \"RED\" Bladed Curved weapon named after a mythical creature Is indeed considered a Sword.....\r\n\r\n\r\n\r\n........Still waiting to get my free trimmed armour back tho....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it. a better shinier version of old school runescape",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "20 years later, now a nigga can pay for his own memebership. Fuck you mom and dad.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Top tier game, would recommend to literally everybody.\n\nBeen playing since like 06 or 07 and this shit has hit every single time i go back to it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Besides nostalgia, (though osrs is more for that) it's actually a very decent game. Sure it can be grindy. And while it's free, membership is a must for all the Steam achievements. \r\n\r\nNevertheless it's an enjoyable game to me. Might be very grindy for f2p (can get much further on quests alone as a member). Definitely worth a try. And you can get membership for free with ingame currency. Though sadly, It's still expensive. \r\n\r\nThe community is massive. There are guides for pretty much everything. Sadly Runescape itself doesn't have their forums anymore and Zybez is also dead. But nevertheless. It's a great way to bring back memories of old. And make new ones.\r\n\r\nThe only real issue I have is thousands of microtransactions. It feels like EA not Jagex. Monthly membership I understand, but encouraging me to buy keys or cosmetics after every login gets old quick.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a pretty fun game! i do wish that it was a bit easier to tell how to get bonds in the game for membership, well, then again i wish the membership thing wasn't an option, or had a seperate world map for all the membership stuff. but outside of that i see myself putting so many hours into this game now that i am able to play it on steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runescape is the greatest mmorpg ever. ask anyone and i bet Runescape is in the conversation. with deep character building, great lore, strong player community, its just the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am going to show my age here, but I remember playing Ultima Online when it first came out and this reminds me of that but with more actual depth of gameplay. I was addicted to UO and could easily see myself losing plenty of time in this game. Choose your playstyle, combat,crafting,hunting or whatever. the world is your oyster in this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Poor's Man Ultima\nThey have removed the MTX, and its just cosmetics now.\nIf you played 20 years ago. They have veteran capes now too.\n\nEvolution of Combat can be removed by toggling Legacy Combat on the interface. So it plays more like Old School RS",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Warning:\n\nYou Will Spend Money On Random Outfits And Weapon Skins",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "One of the best MMORPG's ever played, period.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing since 2001. Love it. I always keep coming back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean, c'mon. It's Runescape. What else do I need to say about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive played this game for over 20 years old school as well...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well i played for 1,104 hours before this review to pop up so yes i recommend this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with plenty of content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes. play this game. no no, Shhhh don't worry about your life. you wont be needing that anymore. such a silly thing, that. just play Runescape. Friends? they'll be fiiiiiine just keep playing... it'll all be okay. just keep playing. just keep playing ^-^",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "best game i have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i got a few hours in the game. its fun, give it a go",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Vote for the removal of the current MTX :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than Albion Online fishing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the best game ever",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its been fun so far!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Procrastination tool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very awesome game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Number go up > me go happy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic MMO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Game is Very Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ш вщ утощн ершы пфьу ащк ше иуштп фдшлу ф црщду гтшмукыу штф куекщ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "XP go BRRRRTTT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a lot of skills to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUN!\r\nSO FAR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's okay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ENDLESS ADVENTURE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No P2W as of JAN 16TH? SIGN ME UP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing sence 1994",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best MMORPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you will lose your life",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fishing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "add sex",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "every chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOAT",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nostalgia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "xxxzyxxzyyyxyyzxxxzzzy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have about 10,000 hours in RuneScape and if you like:\n\nGaining xp/wealth (watching numbers go up like in idle games)\nFast and engaging combat\nDozens of unique bosses and a few raid/group bosses\nMultiple ways to play\nA relaxed gaming experience\nSkills that you can AFK\nNostalgic feel of playing RuneScape again\nOr you just think this game looks cool and want to give it a go\n\nI will be the first to tell you to stay as far away from this game as possible. Once you start there is really no escape. You might take some time off and think you’ve quit but you’ll come back. You’ll always come back. Then, before you know it, you’ll have been playing for almost 15 years and have about 10,000 hours in the game.\n\nHonestly, playing RuneScape is like clapping. Once you start you never really stop. The intervals between playing (claps) might increase but you never truly stop.\n\nAnyways, Jagex, thanks for an alright first 10,000 hours and here’s to the next 10,000. Cheers.",
      "voted_up": true,
      "votes_helpful": 57
    },
    {
      "review": "One of the greatest MMO ever made. Original and unique (whereas newer MMOs tend to feel like they're copypasted from each other), it's a real RPG adventure (not a min-max grindfest), with actual amazing quests (better than any other MMO) filled with intriguing lore and an entertaining atmosphere, amazing music and an on-point sense of humour. The graphics, which in certain areas really show their age, add a sense of history which is charming and gives the game an identity; let yourself not be deceived, though: this is not a ridiculous fossil such as OSRS, but a living, well kept game with a tight update schedule and kept in time with what is expected of an MMO nowadays, plus its amazing, thriving community which numbers in the millions. For a game so cheap (in fact, you can play a lot of it for free!) with a company so small in budget and size, it sure has worked miracles in the 20 years of its history. 8/10.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "With over 1000 hours on this game, I think I liked it.  Numbers go up and you get a dopamine release every time.  Also fun to chat with people while farming for materials or whatever.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "It's the classic grind and make number go up and feel good game. Its a good time, but there is currently a big issue with p2w MTX slop.\r\n\r\nP.S. Wiki is your friend.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I thought I would hate this game judging by videos I've seen of gameplay, it always looked SO confusing and just not something I'd be interested in. Until I was asked to play and gave it a go and now I'm addicted, so yay! It is still confusing and I'm still learning new stuff every day, I just wish I hadn't spent the past 20 years not bothering with it, oh whale",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "actually a pretty fun game, I totally recommend this game.\nI have never taken interest in fantasy MMORPGs until NOW. It's surprisingly VERY fun and chill. This is such a good game especially if you're a casual player who wants to sit down, relax and play a game.\n10/10",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I have been playing Runescape for almost 25 years! Even if i stop playing for a year i always come back. Great game if youre into grinding.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "“RuneScape 3: Where Time Goes to Die”\n\nImagine logging in (just to do a farm run) and suddenly it’s 4 hours later, your virtual potatoes are thriving, but your real ones in the oven are charcoal. RS3 is basically a financial advisor in disguise it teaches you that sunk cost fallacy is real, and that you’ll happily grind 200 hours for a cape that gives a +4% chance to not burn digital fish.\n\nThe graphics? Surprisingly decent for a game that also runs on toasters. The combat? It’s like playing piano on your keyboard while your boss monster judges your rotation. The quests? Absolute masterpieces until you realize the gnome you helped 10 years ago now requires 95 Archaeology, a PhD in puzzles, and the patience of a monk.\n\nThe community? Equal parts kind, helpful, and terrifyingly rich people who own more in-game than most countries’ GDP.\n\n10/10 would AFK woodcutting while questioning my life choices again.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Used to play it when I was in middle school and its nice remembering how fun this game used to be and still is.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Although this game has been out for MANY years i just started playing it for the first time in Aug 2025 and i find it to be an excellent game.  Engaging, plenty to do for hours and hours of enjoyment.  I highly recommend it!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "one of the best games in the world... old school is better but i cant help but love rs3 becuase its still runescape!!!!!!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "My grandad got me into RuneScape when I was about nine. After dinner he’d pull up a second chair to the old desktop, hand me a cup of tea, and we’d spend an hour or two chopping those Yew trees next to the GE or killing spiders together. He never got past bronze armour and thought the Grand Exchange was “fancy nonsense,” but he loved the quiet rhythm of it—fishing lobsters while we talked about school or his time in the navy. He passed away when I was fifteen, and I still can’t hear the old OST without thinking of him. It was never about the game, really; it was just time with him.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best and most consistently enjoyable MMORPGs ever made and it's 25 years old. I'd like to see someone make a better F2P MMORPG that actually rewards your time and effort. Played a lot back in Middle School and as returning player at age 31, all the fun and wonderful memories are back.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'm still new to the game, but after playing for 3 days, I'm hooked! The story lines are funny as heck, and its a family friendly game, which is hard to find. How did I not know of this game for so long???",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "NEVER. dared to play this game, because when I first saw it more than two decades ago the skill system seemed so overwhelming. I am glad I did now, if you tackle one thing at a time theres time for us adults to make progress in this game. There is nothing rushing you to make progress, you can go at your own pase and theres really no order to do stuff. Its a very open game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "More refine version of OSRS regardless of how many people dislike it, coming from a 2013 player this RS3 is heading the right directions!\n\nNot necessarily P2W but it just beautify it\nPaying for member is just unlocking the entire gameplay, no bias",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "I want to enjoy this game, but I cannot.....I so badly want to play it...but i cannot....\nYou have to pay for a membership to actually level up your skills to the max.  You want to max level smithing eh? Well too bad, you have to pay for a membership to get to level 120 max smithing......The \"free version,\" you can only level it up to 59.  Such bs, and such greedy companies have to ruin the gaming experience.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "About as fun as watching paint dry. My character's stats barely moved, but my carpal tunnel leveled up and my doctor is now concerned about deep vein thrombosis.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "RuneScape is loved by plenty, but I’ve heard about the greedy company that cares little about the players support and have questionable opinions, so it’s hard to game, especially since you have to pay to continue playing in the other maps.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i like the game but when i took a break for 80 days when i came back to the game my 1b bank was hacked and empty and block this is the 4 time this has happen and i was buying the membership for 4 years $300 spent at this point after this time i am done playing the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having played old school and coming to this, it feels very dead of players. the game just has a missing charm that o feel old school has.\nTry it out but you are basically playing a single player mmo at this point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i just found out at the first 5 minutes of the game (in the tutorial island) that you cant cook certain foods or even level some habilities if you dont have an ultra expensive membership which is MONTLY paid\nthen i searched online about it, and theres way more p2w stuff in-game than what i imagined at first\n\n0/10 never playing again\nits not p2w its pay to play\nno idea how theres people playing this for decades and keeping the membership on for all this time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A RuneScape membership is required to access the vast majority of the game world,\nAs the free-to-play version is limited to about 35% of the map. \nBy paying for a membership, you unlock access to the entire game world map, which is roughly three times the size of the free area,\n\nMembership costs 12.99€ wich is ok, can't really say.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Play WHERE WINDS MEET!\n\nThe community is full of people who will never quit because of the time and money they have spent in this game, or can't look past their nostalgia.\n\nI honestly tried to like this bullshit game, it's for old people...\n\nIn some RPGs I've played, your mechanics can somehow carry you through some boss fights even with low tier gear, not with this piece of shit! You will be hit for a third of your hp, a quarter if you use their awful prayer system.\n\nAnd everything is quest locked. Ok no problem, you do the quest and the requirements want you to have 86 archeology, a skill that takes 5 years to train because it's soo fucking slow, and some need you to have 70 in all combat skills, why can't they just ask you to pick a specific combat style and just ask for the minimum requirement!?!?! Why do I have to have 80 necromancy when I'm using melee throughout the game?!?!!?! Make that make sense! Why do I have to level a combat style I have no interests in?\n\nYou honestly can't do anything in this game without doing something prior, even then after jumping through 23 235 133 451 351 134 hoops to do it. The honest reviews I see here are people who've been playing for 5+ years and probably haven't played any other rpg.\n\nOr, they're taking away treasure hunter, the only thing that maybe helped to level up those skills which took ages to level up, rip that...absolute shit show!!!\n\n\nFUCK THIS GAME, FUCK THE DEVS, AND FUCK THOSE OLD FART BAGS WHO ARE NOT TRANSPARENT ABOUT THIS GAME NOT BEING NEW PLAYER FRIENDLY!!!\n\nPLEASE DON'T TOUCH THIS SHIT!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Over 15 years I've played this game, and yes that includes back when it was RS2 and was the ORIGINAL OLD SCHOOL RUNESCAPE but because OSRS crybabies just couldn't handle people actually enjoying RS3, they kept crying about things that did not affect them whatsoever until finally RS3 became another huge step closer to '07 Runescape again. Gotta love how every time OSRS players cry about something it gets changed, even when it has NOTHING to do with OSRS. Congrats, all you sheep who \"were doing your part\" you ruined a perfectly good game that you never even touched to begin with, this is why we can't have nice things.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Since Jagex decided to remove Treasure Hunter (formerly known as Treasure Trails), I can no longer recommend this game. It has it's moments, but you should definitely avoid RuneScape if possible from now on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yawn!\r\n\r\nI really have not enjoyed or been in any way impressed by the last 96 minutes.  I will be removing this from my account immediately.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Recent changes are a slap in the face to those who have played, paid, and supported RS3 for years. They bowed to a vocal majority, used polls with only 1 vote option, and skewed results to drive the narrative they want. After 21 years of playing RS3, I am quitting.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Jagex, you have fucked us again. another account issue that locks us out indefinitely due to your stupid account security requirements that you have not implemented correctly. Try to log in to find out my account is locked because i do not have a jagex account, make a jagex account, the character it links is the wrong one, try to select another character, find out somehow i have made too many recovery attempts on this account and now I cant recover a character I have had for 20 years. Blow me Jagex. Every year you dissa[point me more and more.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cant play the game even from steam or their own launcher..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SHIT GAME  CANNOT USE ANYTHING IF UR NOT A MEMBER",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Microtransaction Simulator",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "by far the absolute WORST video game of all time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is SO FUCKING ASS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its got a lot of nazis",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am blocked from this site when I login for some reason.  I have never done anything wrong to these guys. I have not played for awhile.. I came back and I am blocked.  What gives?!?!?!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game UI is awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no thanks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You have to pay $14 for each alt subscription. So if you like having alts, be ready to fork over A LOT of money. It's insane and greedy in my opinion, it's morally wrong. It really turns me away from wanting to make Item Shop purchases in the future :/ \n\nWhy not do things that are good for the players and the game? Then customers will be more than willing to make even purchases. instead, I feel like Jagex is trying to take advantage of it's players and not offer a fair market value trade for the transactions. \n\nIt's just a bad way to feel as a customer.\n\nI will update this review if I'm wrong.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I want to enjoy this game, but I cannot.....I so badly want to play it...but i cannot....\nYou have to pay for a membership to actually level up your skills to the max.  You want to max level smithing eh? Well too bad, you have to pay for a membership to get to level 120 max smithing......The \"free version,\" you can only level it up to 59.  Such bs, and such greedy companies have to ruin the gaming experience.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "It's a great game, but playing alone can be overwhelming, especially if you're a newbie. If you don't pay for the membership, you are missing out on a lot of content.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Fun game but Jagex is a horrible company and their support team is nothing but useless bots that give automated copy/paste worthless responses that ignore everything and fix nothing.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "About as fun as watching paint dry. My character's stats barely moved, but my carpal tunnel leveled up and my doctor is now concerned about deep vein thrombosis.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "i like the game but when i took a break for 80 days when i came back to the game my 1b bank was hacked and empty and block this is the 4 time this has happen and i was buying the membership for 4 years $300 spent at this point after this time i am done playing the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game looked fun but having to pay a monthly subscription to see 70% and play on the map pushed me away the moment i saw. and didn't get to play the class i wanted to",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The ban appeal process is almost entirely illegitimate. Once the automated system tags you for botting or macroing, you have almost no hope of getting justice, no matter how much time you put into your character or how much money you paid. I only play this game because it has no competition in the genre.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The quests are some of the best there is, skilling is pretty great, and I love what they did with archaeology, necromancy is really cool too except for the bossing requirements. endgame is a LOT of bossing and its all awful. the timing of mechanics is waaay too punishing for how high the tick length is. needs some sort of visual indicator for tick timings or SOMETHING. I've been playing this game for nearly 20 years now, but bossing has steadily more and more catered to the top 5% of players, There have been some efforts recently to fix this, but all efforts so far have been lipstick on a pig.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i would like to play but right away alll the customization screens, shadows, and character/item portraits are glitching out...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrendously boring. Bloated skill systems and the point and click makes one feel like the tutorial never ends. I don't even know what the story would be, that needs to be present first before you make me cook food and do meandering fetch quests. Vibrant quests at 30+ probably but to get there is a slog. Not worth the effort.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TLDR: Skilling is the main game. Quests are cool. The combat is not fun. Game servers are old. MTX is bad, but Ironman goes brrrr. Everything you do builds towards endgame bossing, so keep that in mind when you do your vibe check.\n\nI've put in 10k hours on this game over the decades and there is plenty to do in the game, plenty of people to meet and hang out with, and it is easy to lose weeks or months to this game. RS3 and OSRS are glorified spreadsheet, checklist, cookie clicker MMORPGs. Progress is permanent and there is always something new to complete. It is satisfying looking back at where you started and seeing how far you've come.\n\nThe life skilling content is overabundant and great if that's what you're looking for in an MMO. The content varies heavily from high APM activities to \"AFK\" activities where you can play RS on a second or even third monitor. It seems like the devs mostly play skilling content and they prefer making more of this content, so if you like it then you'll always have something to look forward to.\n\nThe quests and lore is 95% great. Some recent stories were shat out to push agendas, but they have zero impact on the world and can be ignored pretty easily. Some of the quest lines are legendary and truly impressive storytelling. If you're not locking into one quest line and jumping around, be prepared for some extreme shifts in tone.\n\nThe combat content is also very massive with plenty of bosses to learn, collection logs to complete, and achievements to showcase your mastery and dedication to the content. The actual combat itself is confusing and clunky and requires hundreds of hours of research off platform to figure out how to play. The tooltips aren't clear, the animations are copy pasted, the audio cues are few and far between, and damage just seems to happen with no indication on where the damage came from.\n\nThere are some other server related jank like the tick system and the ground tile system which is an extreme problem in this game and OSRS, but OSRS has better accessibility with RuneLite where ingame tick metronomes and true tile markers help you see past the jank. You can overcome this if you like the content enough, but you need to understand that what the server sees is different than what your client is showing you. The visuals are lying to you.\n\nMicro-transactions are also a huge problem in this game, you can buy gold, xp, double xp, loot boxes, and cosmetics. Fortunately you can ignore this by playing the many Ironman Modes which transforms the game into a competitive self-funded solo MMO and it disables the cash shops for leaderboard integrity. But you'll get months where there are no updates outside of the cash shop and those periods of time feel like all the dev time is going towards the shop, not the game. (There appears to be a culture shift going on in 2025 so maybe this will slowly go away.) Your mileage will very.\n\nOverall, the game is building towards endgame combat. Every skill, quest and monster you kill is preparing you for killing the bosses. If you don't like the combat and don't want to fight the bosses then your enjoyment of the rest of the game may feel meaningless. You can over-level and use power creep to trivialize most early bosses, but those bosses usually serve the purpose of preparing you for the next boss in the ladder, playing this way won't magically make you enjoy the combat if it misses your initial vibe check.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was an okay game back in the day. \n\nThis is not Runescape that I know, This may have my old account on it but it's not Runescape, this is WoWscape.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RuneScape is loved by plenty, but I’ve heard about the greedy company that cares little about the players support and have questionable opinions, so it’s hard to game, especially since you have to pay to continue playing in the other maps.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Locking seasonal event items behind a paywall is just asshole behavior. You can't even bank it for later",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having played old school and coming to this, it feels very dead of players. the game just has a missing charm that o feel old school has.\nTry it out but you are basically playing a single player mmo at this point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Addressing \"Ironman is fun because no MTX\", ironman is more fun AT THE BEGINNING, because there are better early game progression systems. After that it becomes the same or worse than a main with the same dailies and events being the main loop of the game, ruining all of the charm of runescape's traditional appeal of being able to play whenever you want and do whatever you want.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oct 5. it poorly words things the first time you launch tricking you into creating an account then prevents you from linking your existing account so the whole app becomes useless until their customer support can fix it because theres no way you can by yourself. JUST LET ME LOGIN\n\nUpdate Oct 28. their customer support is complete useless and the app still doesnt work. if you havent used this app yet, LINK YOUR ACCOUNT TO STEAM BEFORE DOWNLOADING. it is designed to make you hate runescape clearly. this is the least user friendly launcher i have ever seen by a colossal amount. EA, Ubisoft, Xbox, 2k, Rockstar, those are all awful but theyre all better than this. havent played runescape in years and had been wanting to for weeks, well this has killed all desire to try again. all they had to do was give an email login option. but thats too much for them now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is an ripoff because i did my daily challenges and i didnt like it so i bought a lot of vis wax and lost 3 million coins and every time it looped it and it wanted me to do 60 things for one job",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎 Not Recommended\n\nI lost 11 Ancient Scales during a Seriyu kill because of the long-standing “no loot / no KC” bug — it happens when you kill the last crystal on the same tick you’re thrown off the platform. The game registers the kill but gives no loot or kill-count.\n\nI submitted a detailed report to support and got a canned response claiming “no valid items were lost outside of intended game mechanics.” Even though this is a known issue, they refuse to help or acknowledge it.\n\nIt’s not about the GP — it’s about trust. If Jagex can’t fix or stand behind small, verifiable bugs, how can anyone believe they’ll take care of bigger ones?\nI’ve cancelled my membership after years of play. Sad to see how far RuneScape has fallen from what it used to be.\n\n🔗https://www.reddit.com/r/runescape/comments/1b8adzl/soo_i_just_killed_seriyu_and_got_no_loot/",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "As someone who's been playing RuneScape for over 2 decades now, I can confirm that this version of RuneScape is dead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Before starting the game, I didn't read any reviews about it, and I shouldn't have. The game is indeed full of donuts and grinding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't play this game it absorbs your entire existence and then u turn into a black hole and die.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can say I dislike the fact I got banned for botting or whatever they saidin 2024.  when I only just got my PC back this year and I just found out I was banned try to appeal their decision and it won't let me appeal it the appeals page keeps having issues so gonna give them a 0 stars outta 5 on this one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have hundreds and hundreds of non-steam hours in this game, but it was years ago.  My account gets hacked every time I take a break from the game. Their security is garbage.  You will get hacked if you download this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i just found out at the first 5 minutes of the game (in the tutorial island) that you cant cook certain foods or even level some habilities if you dont have an ultra expensive membership which is MONTLY paid\nthen i searched online about it, and theres way more p2w stuff in-game than what i imagined at first\n\n0/10 never playing again\nits not p2w its pay to play\nno idea how theres people playing this for decades and keeping the membership on for all this time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is boring and for nerds i fell asleep playing this game and woke up with a neck beard I’m not even kidding id steer clear!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Jagex account and linking to steam is stupid doesn't work and just deletes your old runescape character and forces you to start over.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A RuneScape membership is required to access the vast majority of the game world,\nAs the free-to-play version is limited to about 35% of the map. \nBy paying for a membership, you unlock access to the entire game world map, which is roughly three times the size of the free area,\n\nMembership costs 12.99€ wich is ok, can't really say.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Play WHERE WINDS MEET!\n\nThe community is full of people who will never quit because of the time and money they have spent in this game, or can't look past their nostalgia.\n\nI honestly tried to like this bullshit game, it's for old people...\n\nIn some RPGs I've played, your mechanics can somehow carry you through some boss fights even with low tier gear, not with this piece of shit! You will be hit for a third of your hp, a quarter if you use their awful prayer system.\n\nAnd everything is quest locked. Ok no problem, you do the quest and the requirements want you to have 86 archeology, a skill that takes 5 years to train because it's soo fucking slow, and some need you to have 70 in all combat skills, why can't they just ask you to pick a specific combat style and just ask for the minimum requirement!?!?! Why do I have to have 80 necromancy when I'm using melee throughout the game?!?!!?! Make that make sense! Why do I have to level a combat style I have no interests in?\n\nYou honestly can't do anything in this game without doing something prior, even then after jumping through 23 235 133 451 351 134 hoops to do it. The honest reviews I see here are people who've been playing for 5+ years and probably haven't played any other rpg.\n\nOr, they're taking away treasure hunter, the only thing that maybe helped to level up those skills which took ages to level up, rip that...absolute shit show!!!\n\n\nFUCK THIS GAME, FUCK THE DEVS, AND FUCK THOSE OLD FART BAGS WHO ARE NOT TRANSPARENT ABOUT THIS GAME NOT BEING NEW PLAYER FRIENDLY!!!\n\nPLEASE DON'T TOUCH THIS SHIT!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, I got 13 hours in and gave up. Perhaps the old-school RS is better, but this is trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Over 15 years I've played this game, and yes that includes back when it was RS2 and was the ORIGINAL OLD SCHOOL RUNESCAPE but because OSRS crybabies just couldn't handle people actually enjoying RS3, they kept crying about things that did not affect them whatsoever until finally RS3 became another huge step closer to '07 Runescape again. Gotta love how every time OSRS players cry about something it gets changed, even when it has NOTHING to do with OSRS. Congrats, all you sheep who \"were doing your part\" you ruined a perfectly good game that you never even touched to begin with, this is why we can't have nice things.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Since Jagex decided to remove Treasure Hunter (formerly known as Treasure Trails), I can no longer recommend this game. It has it's moments, but you should definitely avoid RuneScape if possible from now on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Recent changes are a slap in the face to those who have played, paid, and supported RS3 for years. They bowed to a vocal majority, used polls with only 1 vote option, and skewed results to drive the narrative they want. After 21 years of playing RS3, I am quitting.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Jagex, you have fucked us again. another account issue that locks us out indefinitely due to your stupid account security requirements that you have not implemented correctly. Try to log in to find out my account is locked because i do not have a jagex account, make a jagex account, the character it links is the wrong one, try to select another character, find out somehow i have made too many recovery attempts on this account and now I cant recover a character I have had for 20 years. Blow me Jagex. Every year you dissa[point me more and more.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was really enjoying the game, The quests were cute, due to the free keys it was pretty fast to get skills up for early game content (Though I did feel a tad OP). I will flat out that I find this game better than old school runescape. \n\nI was enjoying the game a lot, but getting to the end of what being a free player offers... I was considering doing a premium sub for a month or two to keep playing... \n\nThen I saw the price.... $20 Australian a month? Are you takin the mickey jagex? They have got to be right? NOPE that is the price of the game, it is WILDLY overpriced for what it is. Yes, it's fun, Yes I enjoyed the free content... But NO, it's not worth $20 a month... MAYBE $20 as a once off, or a $5 a month but $20? Well that was the end of my Runescape experience, I would rather put that $20 a month into my wow account where I could literally turn it into millions of gold....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SHIT GAME  CANNOT USE ANYTHING IF UR NOT A MEMBER",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "oldschool runescape is better idk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Microtransaction Simulator",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "by far the absolute WORST video game of all time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is SO FUCKING ASS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its got a lot of nazis",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am blocked from this site when I login for some reason.  I have never done anything wrong to these guys. I have not played for awhile.. I came back and I am blocked.  What gives?!?!?!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game UI is awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disgusting woke bullshit.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no thanks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You have to pay $14 for each alt subscription. So if you like having alts, be ready to fork over A LOT of money. It's insane and greedy in my opinion, it's morally wrong. It really turns me away from wanting to make Item Shop purchases in the future :/ \n\nWhy not do things that are good for the players and the game? Then customers will be more than willing to make even purchases. instead, I feel like Jagex is trying to take advantage of it's players and not offer a fair market value trade for the transactions. \n\nIt's just a bad way to feel as a customer.\n\nI will update this review if I'm wrong.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I want to enjoy this game, but I cannot.....I so badly want to play it...but i cannot....\nYou have to pay for a membership to actually level up your skills to the max.  You want to max level smithing eh? Well too bad, you have to pay for a membership to get to level 120 max smithing......The \"free version,\" you can only level it up to 59.  Such bs, and such greedy companies have to ruin the gaming experience.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "It's a great game, but playing alone can be overwhelming, especially if you're a newbie. If you don't pay for the membership, you are missing out on a lot of content.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Fun game but Jagex is a horrible company and their support team is nothing but useless bots that give automated copy/paste worthless responses that ignore everything and fix nothing.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "About as fun as watching paint dry. My character's stats barely moved, but my carpal tunnel leveled up and my doctor is now concerned about deep vein thrombosis.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "i like the game but when i took a break for 80 days when i came back to the game my 1b bank was hacked and empty and block this is the 4 time this has happen and i was buying the membership for 4 years $300 spent at this point after this time i am done playing the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game looked fun but having to pay a monthly subscription to see 70% and play on the map pushed me away the moment i saw. and didn't get to play the class i wanted to",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The ban appeal process is almost entirely illegitimate. Once the automated system tags you for botting or macroing, you have almost no hope of getting justice, no matter how much time you put into your character or how much money you paid. I only play this game because it has no competition in the genre.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The quests are some of the best there is, skilling is pretty great, and I love what they did with archaeology, necromancy is really cool too except for the bossing requirements. endgame is a LOT of bossing and its all awful. the timing of mechanics is waaay too punishing for how high the tick length is. needs some sort of visual indicator for tick timings or SOMETHING. I've been playing this game for nearly 20 years now, but bossing has steadily more and more catered to the top 5% of players, There have been some efforts recently to fix this, but all efforts so far have been lipstick on a pig.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i would like to play but right away alll the customization screens, shadows, and character/item portraits are glitching out...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrendously boring. Bloated skill systems and the point and click makes one feel like the tutorial never ends. I don't even know what the story would be, that needs to be present first before you make me cook food and do meandering fetch quests. Vibrant quests at 30+ probably but to get there is a slog. Not worth the effort.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TLDR: Skilling is the main game. Quests are cool. The combat is not fun. Game servers are old. MTX is bad, but Ironman goes brrrr. Everything you do builds towards endgame bossing, so keep that in mind when you do your vibe check.\n\nI've put in 10k hours on this game over the decades and there is plenty to do in the game, plenty of people to meet and hang out with, and it is easy to lose weeks or months to this game. RS3 and OSRS are glorified spreadsheet, checklist, cookie clicker MMORPGs. Progress is permanent and there is always something new to complete. It is satisfying looking back at where you started and seeing how far you've come.\n\nThe life skilling content is overabundant and great if that's what you're looking for in an MMO. The content varies heavily from high APM activities to \"AFK\" activities where you can play RS on a second or even third monitor. It seems like the devs mostly play skilling content and they prefer making more of this content, so if you like it then you'll always have something to look forward to.\n\nThe quests and lore is 95% great. Some recent stories were shat out to push agendas, but they have zero impact on the world and can be ignored pretty easily. Some of the quest lines are legendary and truly impressive storytelling. If you're not locking into one quest line and jumping around, be prepared for some extreme shifts in tone.\n\nThe combat content is also very massive with plenty of bosses to learn, collection logs to complete, and achievements to showcase your mastery and dedication to the content. The actual combat itself is confusing and clunky and requires hundreds of hours of research off platform to figure out how to play. The tooltips aren't clear, the animations are copy pasted, the audio cues are few and far between, and damage just seems to happen with no indication on where the damage came from.\n\nThere are some other server related jank like the tick system and the ground tile system which is an extreme problem in this game and OSRS, but OSRS has better accessibility with RuneLite where ingame tick metronomes and true tile markers help you see past the jank. You can overcome this if you like the content enough, but you need to understand that what the server sees is different than what your client is showing you. The visuals are lying to you.\n\nMicro-transactions are also a huge problem in this game, you can buy gold, xp, double xp, loot boxes, and cosmetics. Fortunately you can ignore this by playing the many Ironman Modes which transforms the game into a competitive self-funded solo MMO and it disables the cash shops for leaderboard integrity. But you'll get months where there are no updates outside of the cash shop and those periods of time feel like all the dev time is going towards the shop, not the game. (There appears to be a culture shift going on in 2025 so maybe this will slowly go away.) Your mileage will very.\n\nOverall, the game is building towards endgame combat. Every skill, quest and monster you kill is preparing you for killing the bosses. If you don't like the combat and don't want to fight the bosses then your enjoyment of the rest of the game may feel meaningless. You can over-level and use power creep to trivialize most early bosses, but those bosses usually serve the purpose of preparing you for the next boss in the ladder, playing this way won't magically make you enjoy the combat if it misses your initial vibe check.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was an okay game back in the day. \n\nThis is not Runescape that I know, This may have my old account on it but it's not Runescape, this is WoWscape.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RuneScape is loved by plenty, but I’ve heard about the greedy company that cares little about the players support and have questionable opinions, so it’s hard to game, especially since you have to pay to continue playing in the other maps.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Locking seasonal event items behind a paywall is just asshole behavior. You can't even bank it for later",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having played old school and coming to this, it feels very dead of players. the game just has a missing charm that o feel old school has.\nTry it out but you are basically playing a single player mmo at this point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Addressing \"Ironman is fun because no MTX\", ironman is more fun AT THE BEGINNING, because there are better early game progression systems. After that it becomes the same or worse than a main with the same dailies and events being the main loop of the game, ruining all of the charm of runescape's traditional appeal of being able to play whenever you want and do whatever you want.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oct 5. it poorly words things the first time you launch tricking you into creating an account then prevents you from linking your existing account so the whole app becomes useless until their customer support can fix it because theres no way you can by yourself. JUST LET ME LOGIN\n\nUpdate Oct 28. their customer support is complete useless and the app still doesnt work. if you havent used this app yet, LINK YOUR ACCOUNT TO STEAM BEFORE DOWNLOADING. it is designed to make you hate runescape clearly. this is the least user friendly launcher i have ever seen by a colossal amount. EA, Ubisoft, Xbox, 2k, Rockstar, those are all awful but theyre all better than this. havent played runescape in years and had been wanting to for weeks, well this has killed all desire to try again. all they had to do was give an email login option. but thats too much for them now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is an ripoff because i did my daily challenges and i didnt like it so i bought a lot of vis wax and lost 3 million coins and every time it looped it and it wanted me to do 60 things for one job",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "👎 Not Recommended\n\nI lost 11 Ancient Scales during a Seriyu kill because of the long-standing “no loot / no KC” bug — it happens when you kill the last crystal on the same tick you’re thrown off the platform. The game registers the kill but gives no loot or kill-count.\n\nI submitted a detailed report to support and got a canned response claiming “no valid items were lost outside of intended game mechanics.” Even though this is a known issue, they refuse to help or acknowledge it.\n\nIt’s not about the GP — it’s about trust. If Jagex can’t fix or stand behind small, verifiable bugs, how can anyone believe they’ll take care of bigger ones?\nI’ve cancelled my membership after years of play. Sad to see how far RuneScape has fallen from what it used to be.\n\n🔗https://www.reddit.com/r/runescape/comments/1b8adzl/soo_i_just_killed_seriyu_and_got_no_loot/",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "As someone who's been playing RuneScape for over 2 decades now, I can confirm that this version of RuneScape is dead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Before starting the game, I didn't read any reviews about it, and I shouldn't have. The game is indeed full of donuts and grinding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't play this game it absorbs your entire existence and then u turn into a black hole and die.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can say I dislike the fact I got banned for botting or whatever they saidin 2024.  when I only just got my PC back this year and I just found out I was banned try to appeal their decision and it won't let me appeal it the appeals page keeps having issues so gonna give them a 0 stars outta 5 on this one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have hundreds and hundreds of non-steam hours in this game, but it was years ago.  My account gets hacked every time I take a break from the game. Their security is garbage.  You will get hacked if you download this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i just found out at the first 5 minutes of the game (in the tutorial island) that you cant cook certain foods or even level some habilities if you dont have an ultra expensive membership which is MONTLY paid\nthen i searched online about it, and theres way more p2w stuff in-game than what i imagined at first\n\n0/10 never playing again\nits not p2w its pay to play\nno idea how theres people playing this for decades and keeping the membership on for all this time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is boring and for nerds i fell asleep playing this game and woke up with a neck beard I’m not even kidding id steer clear!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Jagex account and linking to steam is stupid doesn't work and just deletes your old runescape character and forces you to start over.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}