{
  "positive": [
    {
      "review": "Really detailed medieval city builder. Nice graphics. Desperately needs a UI scale setting on the Steam Deck.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Manor lords is what I always wanted from Banished. It's a project clearly loved by its developer and it shows. There is so much freedom in building, the flow of goods works, and ITS SO FUCKING PRETTY.\nThis feels as the most realistic yet fun medieval town builder out there for me. I am very excited to see future content for this game.\n\nYes, it is very clear this game is still early access. From balancing to content. But I can enjoy 60+ hours of gameplay no problem and while almost never encountering a bug.\nThere is the issue of the latest update taking a while, but they're working on the biggest update while expending the team (which was one person???).\n\nI am so fucking excited to see what future content will bring :3",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Great game! Obviously in development so few problems here and there, but well worth the money.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Great potential for further development. Manor Lords is a game that still has a long way to go until fully finished but i can confidently say that it can be one of the greatest strategy/ resource managing games out there.  In the beginning of a new save i'd say it might be difficult understanding what you got to do. At times i can feel lost as to what i need to do next. The game doesn't give you much guidance nor a tutorial...you gotta figure it out yourself.\nOverall very nice and pretty game that still needs polishing in all the aspects (gameplay, user guidance, etc.)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "For early access very good. The game complexity is nice, but sometimes lacking (because of early access). It is clear the dev has major plans for where this game will go and I cant wait for it. \r\n\r\nAs is, the game is playable and very enjoyable and with every update it gets more immersive, challenging, and exciting! It's impressive how this game incorporates everything from high-level city management and resource management down to granular troop movements.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Greetings, just to tell my experience.  \n\nHere I had the game literally as soon as it came out because I had an xbox pass at the time.  It's beautiful, I enjoyed it for 3 months and even though it had a million bugs.  \nThe subscription expired and I stopped playing it.  \nNow, after a year, I bought the game on steam, played it for 3 hours and had to ask for my money back.  \nThe game has progressed very little since then, it's still full of bugs and I just think that not much has been done in a year. Soo shame\n\n\nEDIT>>>>\nI leave this coment like one day before BIG update. I will buy this game again and try it   xD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, still a bit to go until its finished but even in early access already massive fun",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I bought the game after watching some videos, and it’s awesome! I’m excited to see more once the improvements are finished. It’s definitely a beautiful game—please continue improving it as much as you can!\r\nI do find it a little difficult, maybe because I’m still at the beginning, but gathering finite resources is quite challenging.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Manor Lords delivers the same satisfaction of strategic management as Frostpunk but without the dark, depressing vibes. Instead, you get a deeply immersive medieval world brought to life with surprisingly high-quality graphics, where every detail reflects the developer’s passion and lets you truly sink into the atmosphere.\n\nThanks to the dev for creating such an incredible game and wishing you the best with the rest of your journey !\n\nLord Spectre",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Manor Lords is honestly the first game I’ve truly fallen in love with because of its immersive, semi‑realistic slow pace. Watching villagers build step by step feels so satisfying, and the way they move around is surprisingly natural, almost like real people going about their daily lives.\n\nThe graphics are not fantatic but beauitiful, the animations are smooth with no lag at all. The road‑building tool is spot‑on too, you can lay out routes exactly how you want and then place homes and buildings along them, which makes designing your town feel personal and creative.\n\nIt’s calm, relaxing, and if you’re a fan of slow‑paced games like me, this is one you’re really going to enjoy! It’s still in development, so of course it’s not perfect yet, but the potential here is huge. The gameplay already feels fluid and engaging, and I can only imagine how much better it will get with updates.\n\nThe soundtrack deserves mention! it’s medieval‑inspired, with soft strings, flutes, and gentle tones that create a calm, atmospheric vibe. It fits the theme and era perfectly, blending into the background while making the experience even more immersive. The orchestration is just beautiful. It feels on par with a high‑budget TV series soundtrack, the musicians and composer deserve congratulations for creating something immersive and refined. Blending medieval influences with cinematic and ambiance quality.\n\nI voted for this game in the Steam Awards 2025, and I genuinely hope it takes the win because it truly deserves it. The developers have created something unique, relaxing sometimes, immersive, and full of potential, and it would be amazing to see their hard work recognized!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game very peaceful and enjoyable building my village up from  nothing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a fun game. There is quite a lot to do as you discover how the individual pieces work, and it's satisfying to watch directives unfold in real time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best real time strategy games I've played in a while. One of my favorite games. Still under active development from a growing, small, dev team. I am very excited for upcoming features. Worth picking up. Fully playable as is, while limited, with lots of depth to come.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Game for those who love town building and asset management games!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's kinda glitchy (but the devs are pretty upfront about this.) It also it's fun asf and the beta looks to make it even better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game worth the money. There is some work that needs to be done, once the game is completed it will be a masterpiece!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a good game quite tricky to start out from nothing but it has lots of stages throughout and does not become repetitive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite people who don't understand that there is a learning curve with these games and give it bad reviews and people who don't bother to read the news updates from the devs and act like like they just did a money grab, Its a great game. \r\n\r\nYou can opt into the beta testing portion of the game which gives you access to the updates people are crying about not happening. The updates have came and the game is honestly really good. Yes there is a learning curve and it takes some time to understand how to manage your settlement correctly. But watch some YouTube videos if you don't want to learn by doing and enjoy the game. It has an immense amount of potential and it is already absolutely worth the money, especially on sale. \r\n\r\nFor those who complain about getting overran by bandits and such, that's simply because you don't know what you are doing. When you first start out learning the game and you don't want your settlement lost, then start a game on the mode without bandits and AI and just learn. Once you figure out how to build your settlement, build a reliable food supply, how to build and army etc etc, then start a new game and introduce yourself to bandits and the AI. But don't climb on here and give the game a negative review just because you don't understand how to play it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Worth every penny. This has the quality a AAA budgeted game would have. Hell, even they don't sometimes. Puts other games to shame.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "takes a little bit to get into but the game keeps updating!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is a grind. Its disappointing its not the full game but costs the full game price. I really did get a good amount of play time out of it, but the fact that it is unfinished after 7 years probably means its not going to happen any time soon. Not sure what the issue is...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "has the potential of a great game just needs a little more love from the community...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you like rts combined with citybuilding and medieval combat tactics, this is an incredible game to spend time on. dev team has been putting in work on experimental versions and it should come out an incredibly fun game when finished",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is such a great game, just got to grips with the building side of things and how to move through the levels. Superb, cant wait to see how this one develops. Kudos to the devs!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite all the bugs and unfinished features, this is a pretty enjoyable city-builder. \n\nWith curved roads and flexible housing plots you can make some really nice organic looking medieval towns that aren't fixed to a grid. A recent patch in addition to adding stone castles also ironed out some quirks in the perk system. In the new system, many production buildings were that were previously locked behind perk requirements are now always available and the perks just provide passive bonuses. This was an excellent change IMO because it greatly opens up options for the player and makes a wider variety of starting conditions viable.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game. Good mix of colony builders such as Banished or Ostriv and Total War style of combat and army control. Looking forward for future updates and more content! (although what is available now will still give you hours of gameplay!)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is better than any AAA game that has come out in years\n\nand it's only early access and in active development.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great village builder considering it is still in development. The tutorials were very helpful so I was able to figure out how to place buildings right away without having to google anything. I was happy to discover that idle residents find work to and that assigning residents to a job actually assigns the entire family to a job. Also loved the \"snap to road\" feature in construction. I would recommend this to any one looking for a cozy/micro-manage-y game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I do not regret my purchase, I was aware that I would buy a \"promise\".\nDo not buy if you can not wait for two or more years for the game to be decent.\nDev is active, albeit excentric, recently added more people to his team and the promises are big.\n\nAt this point in time it is not more than a glorified demo, however much I love the ideas and the overall \"vibe\" of the game. With the newest beta patch showing that the next \"real\" update is going to re-shape the game in major ways I am at least hopeful that the project will get to a state that somewhat resembles a finished product. Wether or not it will be the glorious game we all want it to be however, at the current time I am doubtful.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While the game is technically in Early Access, its current state feels far beyond a typical beta. It's truly impressive how much is already implemented and playable. Although some features are still planned for later updates, what's available now is solid and deeply engaging—a must-try for fans of city-building, RTS, and management genres.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Real strategy game, interesting economy engine nice battles, a lotof resurses.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun sim game with battle elements 8/10 due to balancing issues (I'm positive they will fix). Relaxing game though the weapons/armor/battle elements need to be worked out. The beginning is too hard due to trying to focus on starting your city and also build an army to battle bandits. If you can fight off the first bandit raid, then you should be ok but it isn't easy. As for the off screen Lord, I couldn't imagine how difficult it would be to fight bandits and Lord. Once you get a good sized army however, all the enemies are cake but it is difficult to reach that point. Getting money in the beginning is difficult as well to even hire mercenaries. Honestly I think they should start bandit raids at 5 years after start. Also, I would make farming easier. I love the farming/food aspect but I have to keep starting a new game just to get a piece of land that isn't ground garbage for farms. It is either all or nothing. Either you have good land for growing or you don't and I don't like that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is still in developement, so bugs and some unbalance is to be expected, but I still had a lot of fun playing. I am looking forward to future updates.\r\nAlso, the game is simply gorgeous!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing Manor Lords for approximately 12 hours straight, I now have the overwhelming urge to travel back to the 14th century, abandon all responsibilities, and sleep on a gloriously itchy pile of hay—just like my buddy Eddie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a great game. Entertaining and challenging. Wish there was more to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Cant wait for full release all features to be complete",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really fun. Music owns. Kind of a cross between age of empires and a city builder, done very well. Several game modes for whatever you want. True the game is not finished, but it's completely playable. I've had a minor bug here and there, hasn't been a big deal. 10/10 I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've spent a decent amount of time on this game and I can say it is pretty fun but still in development. A lot of things are odd or the AI is pretty dumb but the concept is sounds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and can't wait for it to be a finished product. Keep up the good work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best city builder games I've played, can't wait for full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's way underdeveloped which normally I would just refund and revisit later, but idk. Something about it...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is actually the first game i have ever really gotten into. I Love it. I'm excited to see how the final turns out but each beta has been awesome so far. I hope there is a feature in the final where me and my family can play in the same map against or with each other.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Manor Lords is honestly such a fun management game, I've been playing since first early access release and now through the beta update releases. I've encountered few bugs, the main bug being my PC freezing while using the road tool when flipping to bridges, which according to recent patch notes has been fixed. I really have no complaints whatsoever other than just wanting MORE game, which I am eagerly awaiting the full release of. this is one of the most in depth management games; the art styles and graphics are lovely and I really enjoy the classic medieval art used in the game. all in all, would recommend. loving it and can't wait for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's addictive, even though I'm not a strategy game fan. I'm looking forward to the full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Even for an open Beta its very fun. Really looking forward to seeing what the devs have in store for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have enjoyed playing this game but it does very much feel unfinished, I would recommend turning off banditry and royal taxes, as those mechanics are frustrating and unrealistic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "heavy strategic gameplay plus attention to detail on attractive graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even before the last few updates I thought despite the game in some ways feeling like a demo that this is a masterpiece.   Certain aspects of the game are not found in any game ever made and I just hope the Devs continue to build this game for years to come.  It has a chance to be one of the best games of all time and has endless potential for devs to continue to evolve the game. \r\n\r\n9.5/10!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Found it on random and got instantly hooked. I've been following the game since its Free Testing version some three years ago and I absolutely adore its graphics, gameplay, and developer feedback!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very fun game very aesthetically pleasing, quite different than other colony sims. however i could only play for 25hr until i pretty much got bored, but thats just because its early access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a game that's still developing. It's addicting. I love it. I'm excited to see it improve. There's a few bugs that still need to be ironed out . Biggest issue I've had is when I rally or hire a outsider to fight in battle they just freeze and don't fight or they just don't move to the battlefield.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "new patch fixed a few key things the community was asking for along with a bucket load of QOL changes. Looks like I can say goodby to a few days of my life as I dive into Manor Lords again (I regret nothing).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great progress on the game. Buy if you like to support good games, but it is still early access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic, you can tell the developers really love this game and have put a lot of effort into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great combat and also great music!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better builder games out there! sweet graphics! Still beeing worked on and updated, the finnished game might be the best ever in this genre!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good dev team, frequent updates and discussion as of recent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, even though the Settlers, which probably inspired it, were always the most boring PC creation ever made. I love it more that I loved my other favorite 4x/rts/rtt games/ . Next thing to fix: the clarity of Mule barter:) I'm very happy it works (well) past 100 inhabitants now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good city bilder and constantly being updated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hey, love the game,\nBut can you fix the frame gen so it isn't locked to 60 fps?\n\nI play at 120 most of the time (1440p, tried out Fullscreen and borderless fs), but I'm experimenting between quality and balanced dlss and other settings to optimize everything.\n\nIf I switch frame gen to auto or 2x I get stuck capped at 60fps and actually lose frames as a result (kinda beside the point of using the frame gen in this situation, wouldn't you think?)\n\nIt would be great to be able to turn everything up to ultra, and use the frame gen to still get 120 fps in demanding situations like deep forest.\n\nThanks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent medieval city builder and love the small battles you can have.\nLove everything about the game even in early access the game feels very well put together.\n10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Manor Lords is still in Early Access, and you can feel that while playing. Even with the current amount of content, it’s fun to build your village and defend it from raiders. I’m impressed by the attention to detail. I’m curious to see what the full release will look like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love Manor Lords. You can tell it is such a labor of love from the dev. Visuals are gorgeous, music is phenomenal, atmosphere is great, and I am by no means and expert but it seems pretty historically accurate. As much as I am really looking forward to seeing where the dev takes this game, and especially getting more building upgrades and visuals, I could (and do!) play this game in its current form for hours on end. Every new game is challenging in different ways, and I have yet to get tired of this game. Definitely recommend and I look forward to where Manor Lords goes in the future!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Early acces still, but I highly recommend it . I love the complexity and the easy-going-ness at the same time of the game. Plus, I LOOOVE the athmosphere ! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is actually really engaging and challenging. If you play games a lot and wish there was something to actually challenge you. THIS IS IT. it is complex yet still very fun to learn. I have played a couple hours straight and wow does this game make time fly. 10/10 worth every dollar. (PS... if you get really mad over things you cannot overcome, do not get this game, it will challenge your ability to quickly think and adapt)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top tier city builder. Great soundtrack, good immersion, not many bugs & the developers are actively looking after the game. \n\nWhen the new update comes out soon ill be putting in another 20 hours or so, especially as a BIG city builder (that shall not be named) that came out recently was a complete disappointment.\n\nGreat vibes when playing before/after KCD!.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I built a PC a year ago for the sole purpose of playing the early access Manor Lords. Incredibly fun and dynamic. Once you master it though, you kind of end up waiting for the next big update, which they do periodically. The last overhaul really gave the game so much more depth and seemed thought through. If you love city builders and are patient, this is the game that keeps on giving. Cannot wait to see how the game develops. Looking forward to the next update!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "3 hour review on easy - first impressions to understand how the game works\r\nPros:\r\nInteractive Settlements\r\nSuperb Medieval Music\r\nAddictive Building Gameplay \r\nRealism Gameplay\r\nCons:\r\nCan feel like an eternity to get started\r\nActions halted because A needs to do B. Not clear unless you click around. \r\nFamilies are Re****, but it is AI\r\n\r\nThis is a cozy game for those who want to be the ruler of their civilization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely loved this game, can't wait for the updates! There's many, many bugs and you the new military update is pretty basic right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "idk where to leave pre release reviews so i'll leave it here.\nThe game is still becoming the best city builder at this moment.\nBut when you are builing with castle planner its supper usntable and you can loose you hub wich makes you go back to the last save you have.\nI understand this is a pre-release issue so iots still an awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every city-building game needs to have yard mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must have in your library.\r\n\r\nA bit of learning to do but a game for end of a working day to relax (when you know the all the bits)\r\n\r\n\r\nVillager quotes \r\ngave the old ox a handful of month-old grain. he spat it in my face and tried to carve me a new nipple\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really great game already with so much more to be added. Devs really listen to the community and get stuff done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very relaxing time consuming game and deff worth the while \r\nthe fact that you can control you armys and where they should be stationed is very fine \r\nrecommend to enyone who wants to commit to a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend this game, sure i dont have a lot of hours on it but I love the game and wish the best for the devs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Manor Lords is a fantastic game, although a little rough around some edges, even after a year. The mechanics of the game are quite indepth but not so much as to give too much to do, graphics are also great. I will say, the AI can be a little off sometimes but I am sure this will be fixed in future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The beautiful graphics and overall look of the game does it for me, while the gameplay can either be super relaxing or punishing depending on how you tweak the settings. It's a fun little feature being able to walk around in third-person and watch your settlers go about their tasks. If you're not familiar with the genre, just play on peaceful so you can learn how to build a thriving population and look forward to future updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has come a long way and it still has far to travel but all throughout the journey this game gets slowly better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxed citybuilder, and graphicly very nice. can't wait to see where this game will go",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun town builder. Nice organic look and placement of houses etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Building functional cities and regions is very rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this is the coziest game! Thank you for the atmosphere and the chill vibes!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice beautiful exciting game, I can't wait for the next update. Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great concept, gameplay, but the game is far from finished, it will be a masterpiece but it will take a while to bring out the full version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a lot of upside to it. RIght now its in a state where theyre is a lot left to be desired as far as design goes its great especially if youre a city builder type of person However, as far as keeping you here its not there yet but the creator is making big strides so I believe it will be there soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it really good for a sim game. but everytime i build anothe city, it look like the peasant gone back to the stone age while the other city already in another level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been following this game since EA. With every update, it just builds the anticipation of what is easily becoming my favorite game. Even playing through the different bugs, in different updates or betas. I never find myself thinking, \"welp im done with this trash\". I am always relieved with the trust that I can patiently wait for the next update to resolve the issues, as well as bring something(s) significantly new to my next playthrough. The attention to detail and desire to build, directly from the voices of their player base, is nothing short of heroic to the gaming industry. lol. What seems to be another industry falling into the quantity over quality trap; there are very few developers that are clinging to their projects and not selling out to big companies that ruin them. If you are on the fence with this game, you can wait if you like - for it to be at its final state down the road. Though personally I do not regret a single dollar, even at its current state.  I cannot imagine what the final stages of this game will look like, or any further projects the developer may pursue in the future. I will definitely be following Slavic Magic in their later pursuits and projects, if any!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the game that got me interested in city builder games and although I personally had a steep learning curve (my falt not the game's) and still suck at it, I find myself always coming back to it. A MUST buy. Huge shout out to the developers!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having never been into base building games, I love Manor Lords. I'm super excited to see how this game turns out. 100% worthy of your time and money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game that has a ton of potential. Highly recommend giving this one a go. Overall, currently (8/10).\r\n\r\nThere still seems to be much to do to complete this game, especially with the end game - but it's definitely going to give you hours of fun meticulously crafting your city and managing your resources and production.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend this nice city builder. It takes a little time to learn the ropes and develop a system for effective growth, but the balance feels nice. You can easily put in several hours in this game. I haven't taken it off my computer since first installing it over a year ago as there are plenty of updates the developer has been giving from time to time that make the gameplay feel fresh each time I come back to it after waiting a few months.\nI am excited to see what this game has in store for the future and how it will periodically build on the new systems it adds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what a brilliant game! the visuals, music and design of it are just bloody lovely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "excellent game.  grew up playing roller coaster tycoon which got me into these sorts, this one has been one of the more fun ones i've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game for over a year as it has released numerous updates and improvements. Gameplay has always improved with each update, never regressing as many studios like to do. The game started out solid and has gotten better with each step. I look forward to see where the games goes form here.  I will say, not a single other game studio gives you as regular or in-depth updates as far as how things are coming along and what to expect moving forward. \r\nOutstanding game, with an even better studio behind it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love when you play a game and instantly you can tell, its a passion project, its something special. this game is exactly that. its rough around the edges in some areas, its AAA in others. Can't wait to see what comes next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slowly seems to be progressing, but still playable and enjoyable. Would recommend with caution that it still needs some polishing. Loads better than that demo that came out a few years back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game with lots of potential. It is however clearly still under development, but that's fine. \nThe game isn't easy, not even for its sort. And yet, I keep coming back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!.. awesome realism... waiting for future developments/completions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Manor lords is more on the casual side when it comes to strategy games however it does suffer with a really mediocre tutorial. Super fun at first but does start to get repetitive after a while. Huge potential for full release yet still fun in early access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "High quality simulation. A bit rough around the edges technically (bugs/pecularities), but big potential and unique experience.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "At first it was forgivable to have such a lack of content and a lack of balance due to the early acess nature of this game, as stated by the dev, but after more than one year this game is still lacking in many basic areas which is sad due to his great potential.\nAi should be fixed, raids are too common and they are just annoying, the rival noble spams claim too fast, you can disable both in the options but then you encounter another problem: the gameplay becomes to flat, you need some action in the game but this action should be balanced, ai feels really braindead, it's just annyoing because it constantly spams.\nEconomy is unbalanced, farms still struggles, the garden houses strat is still the meta for feeding your pops, traiding and owning new provinces is unecessarly convoluted, maybe it's just me but i think it's really stupid to consider adiacent territories as two different cities, just let me build in the new territory i claimed as if it was an extension of my city.\noverall 5/10, huge wasted potential, balance is very needed",
      "voted_up": false,
      "votes_helpful": 413
    },
    {
      "review": "This game in its current state is borderline unplayable. There are many features that say they aren't available in early access and the ones that are there are buggy as hell. The game bombards you with constant attacks from enemies right after you repaired and your villagers are starving, then when you are broke and starving you have a war declared on you for your land. You are broke trying to pay taxes and to make up for the food you are unable to produce despite having over 100 citizens. It has been over a year as others have said. I thought I would give it a try while it was on sale. It's much worse than I thought especially after seeing all the positive reviews.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Fantastic bones to a game that could be great, but absolutely no communication from the devs despite promises of doing better and game breaking bugs in the beta update that they've known about for literally a month means that this game is pass for now if you don't already own it.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The communicated from the dev team is killing this game. A broken update launched after months of radio silence with the words \"I am rethinking what went wrong to ensure it won’t happen again.\" only to do the exact same thing.\n\nThe bones of this game are great and one day it could be. But do drop a broken update and the more radio silence for weeks (currently 7 weeks and counting) is not good enough. At least just give the community something like \"we are 10% done so we can temper expectations, which isn't asking for much. A hotfix...? Lets not be too hasty.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I really love this game. But I can't in good faith reccomend it to anyone right now. It's been in early access for almost two years, and still very little has changed and it's very unfinished. Hopefully soon we'll get updates and more communication frequent communication, but as of now Manor Lords is an unfinished game without updates for quite a long time - I will change my review when things take a better turn.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Game seems amazing initially. However, the devs are taking too long to deliver the 1.0 version. It is still in very VERY very early development. I wouldn't buy if I knew it beforehand. Will come back to play after the release of updates.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game has a ton of potential, but between the eternity between updates and the lack of communication from the devs, you're better off buying it when it's finished",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I don't recommend this game. The developer hasn't optimized it and there's a lack of updates and content.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If they ever finish this game and add more to it, it will probably be good. I liked it for what it was, but I'd get to a point of progression and kind of go \"what now?\". Expanding took a very long time and often didn't feel worth it. I liked my initial play-throughs, but unless they add more to the game I don't think I'll keep playing it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Finish the game, then I might play more. It's a cool concept, nice graphics and ideas within the game but still development tree is not ready, some other buildings and so are not ready etc, no end-game so to say. I will play when the game is finished. \n\nAnyone who wants just to check out the game - it is really neat, cozy and consuming game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I feel guilty for not liking it after I've kept this one so long in my wishlist.\nBut here we are.\n\nLooks great, feels great but not playable yet. Because it's...well...boring.\nThe first time with all normal settings as game brings you in, I got wiped so fast I didn't actually get it and kept pressing on my village units and thought it must be an early-access bug lol :D \n\nWhile I was trying to keep up with the bread and firewood still after 10 long game years because the game never told me \"Oh you can find your diplomacy settings here!\" \"Oh hey you can select some technology there!\" - (And believe me they are so hidden, there are notifications but they make no sense UI/UX-wise and I just clicked on my village name out of boredom and found them all laying there hahahah)\n\nAnywhoo, an edge lord came to my door with a high level army. Wiped out, hurt, it made me itch for a second game - without the fights and wars - so that I can see how the actual village life works. \n\nOh it's so boring. The seasons are endless, you dont get points for technology tree fast enough. And you wait. Endlessly. \n\nI've played these kind of games since birth. Manor Lords have a huge potential but lacks a lot of intuition for the player. Normally I would expect myself to solve what goes where faster than an average player - but you guys got me.\n\nAsked for a refund, probably wont get it so you better make this game great I'll be waiting.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is broken and unfinished and developer clearly can't fix it or make progress to completion. They worked for over a year on an update and the recent update made it worse.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Its a really cool game but it still's not ready to play, theres some glitches, and enemys are waaaay stronger, they build up everything really fast and u take long time to build, economy sucks, making weapons take a long time, and when you grow your army to 36, they already have 200 men ready, bro its impossible, im asking for refund",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is great in concept, but is too under-baked and over-shot, unless you want to sit and watch Youtubers show you how to play, and to do what they do just to get the same results they do, than just avoid this game until it is baked, because rn you gotta be baked to enjoy it without a head-ache",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Bought it quite a while ago, enjoyed it initially then quickly realised how little depth there is to the gameplay. Looking back at this almost two years later it does not look like much has changed. Don't recommend to purchase at full price.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "TLDR:   I do NOT recommend  this game.\r\n\r\nToo many serious game breaking bugs, glitches and crashes.  The developers are not serious about timely hot fixing.  Its very rare to actually complete a game, and some scenarios are pratically  un-doable due to game breaking bugs (No clothes, no iron production, deep mines dont work, etc).  Other bugs are annoying, oxen getting stuck in the pond, villagers that stand around doing nothing.\r\n\r\nIts very frustrating.  The developers and the fanbois claim \"its early access, its in BETA, etc etc\"  (the typical excuses for this behaviour).   But the fact is, there are many games in early access who's developers make timely hotfixes.  Some of these bugs are very simpel bugs, that completely break the game (like the clothing bug), and should be simple fixes (the modders fixed it in under a week), but the dev team thinks the player base should just wait another three months (or however long) for them to get their shit together.  Well thats not how early access works.  \r\n\r\nSteam should pull this game from its store until \"slavic Magic\" makes a commitment to a timeline!  It should never have been offered for sale with this sort sloppy development.  \r\n\r\nI bought early access on 7D2D over a decade ago, played thousands of hours, saw many iterations.  The team repsonded quickly to the playerbase, and though many many chages were made, the game just got better and better.  I bought early access on \"The Long Dark\" and have not been disappointed there either. Despite many changes, it has rarely crashed, the dev team communicates with its players, and generally is on time with new features.\r\n\r\nScammer Lords is the opposite.  No communication whatsoever.  A \"glacial\" pace of development.   Its a real shame too, because this game has a ton of potential.  \r\n\r\nThats my opinion.  Have a nice day.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Mechanics of this game are really unintuitive, had to watch a lot of video tutorials how to play it just to find out its boring af...",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Imo, too overhyped and a massive let down. Go play something like Farthest frontier for a more fun, more in depth and longer experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its wild to me how hyped this game was and how little it has been developed over the last year.\n\n$39.99 well spent. /s",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Nice idea, nothing more. It looks good, but that's about it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "least intuitive game ive ever played. Nothing makes sense you need to watch hours of youtube videos to play this game. This is the only game i have ever paid for that i want a refund for.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Things I like about the game is the graphics, and the music which is very well done. I can tell the creator put a tremendous amount of time into the game which I can appreciate. However, my biggest complaint is progression, the game in certain areas of progression, is too tedious, and illogical at times. Trying to produce weapons in this game for your armies, is a massive undertaking, with so many hurdles you are required to jump through its not very enjoyable in my opinion. Too build weapons it requires building, a black smith work shop, to build this you need, a church, tannery, access to two different food sources, fire wood, tools, bloomery, iron mine, regional wealth, and a few other buildings to achieve this goal. Some of these requirements make sense as a natural form of progression such as a well, or iron mine. Others make no sense in regards to why I’m building them as mandatory prerequisites to crafting weapons. What does building a church, or creating two different food sources for villagers have anything to do with producing weapons? These are two illogical prerequisites, that have nothing too do with weapons smithing, there are more illogical anomalies however these are just the most glaring examples. This game has a lot of these questionable, game mechanics, that make the game insufferable at times.  My first play through I had an enriched animal hunting area, so I had access too and more wild animals. I tried capitalizing on this by taking the resources and producing hide from the animals, to sell on the market. However, for whatever reason certain resources are not sellable on the market until you have an improved trade route. Which means I couldn’t sell any of the hide I was producing. Why? because I need an improved trade route or something. Anyways beyond the rant I think this game has a lot of potential, but as of right now the mechanics are a mess. Overall, buy the game if you want to support the creator, if you want a game with functional mechanics play a game that is already well established.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Maybe when they implement the promised multiplayer, I'll get the game again.\nAs of now, a quick xbox month made me not purchase it.\n\nI simply can't trust developers who say something before release (clearly to boost sales), then ignores it as if they never said it. No matter how good the game looks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "With 11hrs under my belt I feel I've given it a good try, but even after 3 restarts and reading all of the guides - I don't think I'm going to come back to this until it is actually finished.\n\nThe problem is that while it looks stunning, the mechanics and gameplay just aren't good enough (yet?).\nIf you want to scratch the itch, I'd recommend sticking with Foundation, or even Dawn of Man - both of which are deeper and feel more complete, even if they aren't as immediately visually appealing as Manor Lords.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game could be so great but has so many issues it's just not enjoyable yet. Villagers don't do anything. They have supplies and aren't assigned so that they can build. The problem is, they just don't do anything. I'd recommend trying it out in a year or two. Supporting these early access games is becoming a chore more than anything lately.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is missing basic content, good game but its still very basic. Farms have bugs with second ox not plowing. Still very buggy game needs a lot work. Will change how I feel about the game when we get the rest of the game out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While the overall concept is cool, the game is seriously lacking in content, quality of life features (or honestly, a functional UI), and apparently, nothing substantial has evolved in the last years(!). The game still has the same placeholder icons as when I first launched the game which feels like ages ago. I bought into the hype and I paid the price.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really want to love Manor Lords — the concept, visuals, and atmosphere are everything I hoped for in a medieval city builder. Unfortunately, the current beta build is in a terrible state.\n\nBugs are everywhere: villagers get stuck in loops, buildings refuse to complete, and performance tanks even on decent hardware. Some features that worked fine before are now broken, and every session ends in frustration. It honestly feels like the beta wasn’t properly tested before release.\n\nAt this point, the game is almost unplayable. I understand it’s still in development, but this update made things worse instead of better.for now, I can’t recommend it in its current state.\n\nVerdict: Wait for fixes before diving in.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is always one step forward and two steps back. We didn't need new art work, we needed a game that functions. My HUD is constantly disappearing which means I cannot play the game at all. There is only one development trait unlock, which is pretty much useless and leaves no incentive to progress anything past level two. Building your castle is bugged, can't reset mistakes and cannot navigate through the upgrade options clearly. This means you're upgrading or destroying fences and garrisons without meaning too, and without any way to simply click reset so that you return to how it was before you started the glitchy upgrades. Still cannot mine more that a couple ore or clay per month. Making mining in the game obsolete. When you pay money for something you should be able to deliver the product. The updates are few and far between and this game is starting to feel like a money grab. $40 for a game that is literally unplayable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Despite of a huge potential, the reputation of this game has been slowly killed off by the slow pace of its development. Other than pretty and catchy game graphics, the game gets repeated and boring after a couple of run as contents are quite lacking. Granted it is early access and buggy beta, the lacking of communication, bug fixes, empty promises... are killing the game. At the current stage I wouldn't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gave this game a good try on both the current build and the test build. Then i looked at how slow updates are on it. The test build actually makes the game worst and even slow and more boring than it was before. This game is just really bad. \n\nI had to play the game at 3x speed just to get stuff to really happen. The bugs in the game make it impossible to get the supplies and stuff to where they need to be. They have a LOT of work that needs to be done. Considering how long this game has been in development, i highly doubt it will ever be done.\n\nI am requesting a refund on it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is very pretty and has some impressive mechanics but at the moment it is incredibly short and very monotonous. A warning, be VERY careful buying this right now. It does eventually become unplayable, you can only have very small towns before it crashes nonstop, literally cannot even load my city. But getting to that point will also bring you over the 2h mark and you might not be able to get a refund. I'm feeling pretty scammed but also I recognize it does have potential to be a nice game (in YEARS probably though)..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's taking a very long time for the game's systems to be functional, balanced, and complete. There are only a few real hours of gameplay to be had, and those hours are really engrossing and enjoyable. But the depth is still missing after a long time, and the fact that things seem to consistently break or change as opposed to solidify and expand, is frustrating. Seems like the dev is spinning their wheels just trying to get the foundation built. Hopefully they can sort it out because this game has a lot of potential.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Haven't played in 6 months, started playing again and there's more bugs now than there were 6 months ago. Game is now unplayable...\nCrops keep disappearing when harvesting.\nThe Retinue get stuck in the manor every time I rally them.\nPeople continue to get stuck when upgrading burgages beside one another. In return I have to destroy the building because there, for some odd reason is a reset key or tab to help with these situations.\nVegetable gardens are a hit or miss on the crops disappearing when harvesting.\n\nNo point in playing this game when hours spent just disappear..",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I can't recomment this game atm. Firstly, the development pace is glacial with updates few and far between, so it constantly feels like the game has just been abandoned. It seems like it hasn't tho because we have recenly had a beta testing branch drop. Unfortunately, it hasn't really improved some of the major issue which prevent this game being fun. \n\nIt starts poorly, but everything really falls apart mid-game.   The main issue it that the economy is a joke.  As of the most recent update a new ox costs 20 gold and the construction material to house it (either one log or two planks), starting a vegetable garden in one of your houses costs 2 planks (why?) and at least 32 gold for beetroot seeds?! In what world are beetroot seeds more expensive than an ox? If you want to plant cabbages then the cost is 62 gold!!!! Considering you only start with 100 gold on the easiest setting and are unable to earn more gold until your trade post is constructed this cost is absolutely ridiculous, and given that vegetable gardens are the main food source for your settlement in most cases this introduces a pretty annoying bottleneck straight off the bat.  Edit: having now double checked vegetable gardens are now the second most expensive house improvement in terms of gold. More expensive than chickens, goats, pigs, and apiaries. The only thing more expensive are fruit trees, which again makes no sense. I understand this is a game but in medieval times people would have just gone and found the plants in the wild and replanted them in their gardens at 0 cost. If there is a balance issue then make it so they produce less, not cost more. \n\nSo into mid-game - every region has different resources and you need access to most of them to get to late game. Unfortunately, it seemingly impossible to turn any sort of profit with trade or even tell if you're going to or not. For example - your villagers need clothes. One of the ways to make clothes is to turn flax into linen, which then can be made into clothes. Unfortunately, my settlement is not in an area where flax will grow very well so the only option is to import it. A single unit of flax it costs 11g, which the game tells me is a price of 1g with a 10g import tax - who am I trading with? Donald Trump? Anyway, you need clothes to progress so I have to sell some produce to afford it. Early game export items I have in abundance are planks - export price 1g/rough stone - export price 1g/fire wood - export price 1g/fish - export price 2g. So in order to afford a single unit of flax I need to sell all of the above for 3 months (and spend none of it on the many improvements that require gold). THEN, you process the flax into linen, make that into clothes and how much can you sell clothes for? 3g FFS. So for every piece of clothing I make I am making an 8g loss! PLUS, you need to buy a trade route to export clothes and a trade route for both flax and clothes comes to 70g.  \n\nThis means it's nearly impossible to reach late game, as you need to import certain goods through trade and managing more than settlement is a logistical nightmare.  I have 80+ hours and I have given up every attempted play though after about 3/4 hours playtime because you just hit bottleneck city and it stops being fun. \n\nIt's a shame, I really want to like this game, which is why I keep coming back. I think it has great potential but the economics really need to be looked at and made clearer and fairer. Regional wealth is one of the most important resources but it is damn near impossible to turn a profit currently or track how much is coming in or out of your coffers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As it currently stands I can not recommend this game. Ive heard theres a beta branch out that adds a lot of content, however since I havnt played it I can only talk about the current up to date version of the game.\r\nIt has a LOT of filler text and a decent amount of bugs, some gamebreaking ones too!!\r\nAn enemy lord decided to take over my land, I fought and won against his army, he peaced out and then afterwards STILL took over my land somehow? Quite bummed out about that to be honest.\r\n\r\nIf I try to look around and between these issues, there is a very solid, very fun framework to go with. It seems like a barebones version of anno in certain scenarios, but thats not a bad thing!-.. The anno comparison, not the barebones one.\r\n\r\nGet it if its 5 - 10 bucks, otherwise itd be too expensive for my taste!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "vaporware.\nwe have to rely on nexus modding community to implement bug fixes.\nembarrassing.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game is not yet ready, it is lacking  content and really does have around 20 to 60 hours of content, and in my opinion is not yet worth 40 bucks so until then my review will be negative",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I previously recommended this game but now it's more than a year and a half since pre-release and it's still quite unplayable. The foundations of an excellent game are there, but it requires so much work and the publisher really needs to force the author to bring on a larger team to stop this project dying out. \nThe game in its current state is great for an hour or two of game play, but AI is basic, the resource mechanics break down once you get a reasonably sized population. Warfare is either too easy or too difficult depending on who you are fighting, and a lack of late game buildings / challenges makes it repetitive.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I can live with bugs in an early access game. What I do not like is the fact that the developer admits publicly that they have patched up problems on their end months ago, and they still have yet to let the players play with the patched version that they supposedly have. Not a great look on their part.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Once the developers got their money, their attitude completely changed.\nAs someone who bought the game right after it was released, coming back to play it a year later feels almost the same or even worse than before.\nAnd to make matters worse, any negative comments you post in the review section get deleted.\nI originally thought about giving the game another chance after some time, but seeing how the discussion forum can’t even handle simple criticism, I’ve lost hope for this game.\nFor anyone still considering buying it, I’d suggest waiting a few years to see how much progress is actually made.\nAt this point, I really can’t recommend purchasing it there are just too many better games to choose from.\n\n開發者錢拿到手,態度就不一樣了,身為剛出售就購買的玩家,過了一年後再次遊玩的感想與一年前差不多甚至體驗更糟,然而在評論區發表不滿言論還會被刪除,原本還想著過一段時間再次遊玩,也給這個遊戲一個機會,但沒想到討論區無法接受簡單的批評,那我想這遊戲應該也沒什麼希望了,真的想買的人可以等三年後的進度如何,現階段一律不建議購買,畢竟有太多遊戲可以選擇",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Pretty game but too buggy, not enough content, and far too much micro-managing for the little content it contains.\n\nUpdate after a full playthrough.. It's worse than I thought. This game does not deserve the amount of good reviews it has.. \"Grow your starting village into a bustling city\" Literally false advertising, you can't grow past a \"Large Town\" .. Development points are locked to a region, not the player, so you basically have to start a new game within a game just to walk a short distance and grab some resources over a line drawn over the map. I assume this is to compensate for the trash AI logic mapping. Half my citizen are just stable workers so resources can actually move to where there supposed to move. No major updates in over a year and conversations in discussion board just as old complaining about all these issues. Devs don't respond and fanboys jump down your throat defending them. Save your money and pick up an at least half completed game. You can find more content in 20 year old titles. I can build bigger cities in Kenshi 😂\n\nThis isn't a 4x game (exploit, expand, explore, exterminate).. It's a 2x game at best.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really like this game but its so buggy i get my save corrupted everytime i try to play. It's happened so many different ways now.. One way is when peace is declared the hud is just gone",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So close to being playable but no progress on actually making it so. I've heard of modders tweaking their own versions of the game and getting something playable within a couple hours, but I don't have mods downloaded and don't know how to do that myself. I expect that Hooded Horse doesn't know how to, either, since the game has remained in its stagnant, unplayable state since I purchased it.\r\nIt could be such a great game, though. It's so close. If you really want to buy it, just wait a couple decades for the next beta version to be released before trying your luck.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Great game, BUT it freezes when building the castle, the castle walls, the castle tower, or whenever you do ANYTHING in the 'castle builder' function. \r\n\r\nAfter exiting the 'castle builder' function, the game First removes the HUD features, then it removes the keyboard hotkeys, and then it simply freezes and you're unable to even exit. At one point, I wasn't even able use my computer's Task Manager to get out of the game. I ended up having to hard re-boot the whole PC.\r\n\r\nI'm definitely taking a step back from the game for the next year, because its bugs are just ruining the experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Be aware, my fellow gamers, this game is in production hell. According to development speed since EA has been dropped, and overlooking on incapability of devs to communicate or at least fulfill their promises... You have to wait for a couple years at least for it to be playable. Sad but true :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I'm sad that I cant really recommend this as there's a lack of games like these that provide any kind of challenge beyond \"Watch the town grow with no outside threat\". It's a very good looking game and the music is excellent. I am however constantly running into \"Coming soon!\" blocks in the game when trying to access different features. It does have tooltips that are helpful but there's a lot of wondering how or why something works a certain way without it being explained. If you decide to try this game, really look through every menu while playing and see how much is still incomplete but \"coming soon\". Having looked at the developers news on steam for the past few years I'm not impressed. I got this 35% off for $30 and I still dont think it was worth buying. Read other negative reviews and see how many people a year ago said \"this game will be worth buying in a year or two\".",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I understand that this game is basically ran by small group developers but they barely communicate with the community and barely give any sort of updates. Main words that the devs keep on saying is \"soon\". Game is still in a raw state. AI bugs out and creates random traffic, random FPS stutters on RTX 4060 and general lack of content is not appealing for its price currently.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Despite having the foundation for a great game, at this point, I cannot recommend it. Even with the latest \"huge\" beta update (Nov 2025), too many elements are still missing.\n\nYou will find lots of half-implemented features and many missing or incomplete in-game descriptions for mechanics and items. There are also quite a few gameplay-breaking bugs that suck the fun out of playing, often forcing you to restart a map only to run into a new issue—like farm yields bugging out at 1 or getting permanently locked out of resources. The first couple of hours on a map are fun, but the experience goes downhill after that.\n\nThe graphics have improved and the game can look stunning, though some annoying visual glitches persist. The music is okay—not great—and mostly lacks variety.\n\nI do trust that the game will be great eventually, but I think it’s going to take at least one or two more years to get there. I’ve also noticed some mismanagement from the developer. It is partly understandable given the solo-dev origins, but scaling up has been slow, and the project could still fail due to bad decisions. The worst outcome would be a premature release from Early Access. The publisher has gotten more involved recently, which seems positive so far. Let's hope everyone involved sticks with it for the long term!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant recommend this game. Seven years of almost zero content,  they update the game with grossly lack of content and fixes. \n\nStay away from the this game. if they dont really pulling the extreme amount of work they need. The game is not finish, it would not be even finish in 2 years becuase of the amount of content that the game lacks and all the huge amount of problems example: \nperformance: memory leaks that could kill your computer (pc) and i dont joking about this. \ninefficent performance derivvates the amount of efficent work load under time, this game lack this and will extremely uncessary force your computer work more and intense, its lack of structure and bad programming or very unprofessional wise. \n\nheat: Growing workload with inefficent code base will generate more heat from computer which one thing that uncessary degrate your computer, TOTALLY UNCESSARY, BUT ZERO FIXES!!!\n\ngame balance\nGraphics buggs and bad programming. \n\nConstant crashes \nEXTREME LACK OF CONTENT AND DEPTH. \n\nas an engineer this is abanotion and i regret i bought this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a great game when it works properly. I do not recommend in it's current state, it  is a buggy mess at the moment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "abandonware. Only one update in 2025. And that's for an Early Access game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have really tried to like this game as the concept seems really interesting, but after waiting so much time to see what improvements the developers will make and not really seeing anything to make the game more interesting. I honestly can't recommend this game in its current form.\n-Not being able to choose your starting location, makes zero sense.\n-The world map is literally a square, could of at least made it an island country.\n-No real negotiations or diplomacy\n-Land gets claimed by other faction way too quickly and they do nothing on it. So trying to claim it is pointless as there is no city, town of village to claim.\n-Claiming the land as nonsense. Built up an army of two spear units, two axe units and one archery unit. Was doing well in the battle, then another two random units get sent. It was at this point I gave up on the game on my recent attempt to give it another try.\n-Farms can't grow vegetables, you can only grow them in the gardens of houses you designate to grow them in. Meaning the only food source you can grow on the farm is wheat, to turn into flour, to make bread. It's Farm land!\n-Bread is the only food you can make from the flour, even though you have berries and meat. So I don't understand why pies are not another option (food options are important as you upgrade houses, so having multiple options which are not locked behind skill trees would make sense).\n-Once you expand a city to it's max, it becomes very boring as you are just stuck waiting to expand enough to have a big enough army, just so you can have the majority of your troops die, to claim land just so you can unlock more from your skill tree.\n-No leather armour options.\nNo rivers or Oceans. Which means, no boats or Navy.\nLimited army building, no catapults and archers feel pointless.\n\n This game is lacking so much at the moment. I bought it when it first came out, because of the hype and was expecting it to be a city builder, with actually world conquering diplomacy, battle to conquer other cities. But it still has a long way to go and after a year of waiting, it doesn't feel like much is happening.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really love this game. But I can't in good faith reccomend it to anyone right now. It's been in early access for almost two years, and still very little has changed and it's very unfinished. Hopefully soon we'll get updates and more communication, but as of now Manor Lords is an unfinished game without updates for quite a long time.\r\n(there is a Beta, but it's highly buggy and not in the main game as of now)",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "\"Early access\" is a understatement, shit game. \n\nWHAT A COMPLETE WASTE OF MONEY. \n\nFUCK YOU!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unfortunately, the game will never be finished at this rate. it has been more than 11 months since there was a update to the main branch of the game, and on the beta branch 1.5 months ago they release a buggy mess of a release with multiple game breaking bugs, and tons of tiny bugs, yet not a single patch or hotfix for any of these has come out after now 1.5 month. And there is still sooo much work that has to be done to finish the game. So i just don´t see it happening.\n\ngame is beutifull, but the gameplay is average at best.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "last time i buy an early acces game. It needs lot of work, game will be finished in 50 years. Waste of money, lost hopes.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "REALLY wish I listened to the other reviews. The game has a solid base and the direction they clearly want to go is fantastic and I love it. But there is NOTHING to this game right now. It's just the basics of a small town building sim. At first I thought I was missing aspects of the game, surely this can't be everything. Nope, it is. The vast majority of anything depth wise to the game is still a WIP. You literally build a town and sustain. Gather food and wood, you can gather some other resources to trade and upgrade buildings and then you can claim land and do that again in another zone. Sometimes you have to fight bandits and other lords and that can take some skill but that's the whole game. I literally was able to walk away from this game and go do other things for upwards 30min while they grew and stockpiled.\n\nThe systems are super lacking and the policies, the couple implemented, are absolutely trash and why you would pick any of them is a mystery. Same with the town skill tree. There's a couple, actually implemented, that are okay but most don't matter at all. The biggest red flag is that after over a year of EA, THIS is still all there is...\n\nI should have listened to the reviews, even for $25 on sale it's not worth the 4hrs of actual gameplay I got out of it and the other 6 I blame trying to figure out the mechanics and what anything does because good luck finding a tooltip or reasonable explanation for anything in their almanac thing.\n\nDon't buy this. Not unless they start showing some real progress soon. REALLY wish I could get a refund, this feels like a cash grab honestly.\n\nBETA play:\nPlayed the separate BETA with all of there \"Massive Updates\" so wanted to update the review with that. It's still the same game. They've changed nothing of worth in their update. The VAST majority of the updates are artwork and GUI related. They changed around the development tree (Skill Point) but added nothing. They just changed the way they explain what the abilities do and made it super confusing. They added a couple new buildings and removed a few others but none of the new buildings really do anything different. Coal for example, sure you get more heat but that wasn't an issue before it's just making me build another building and staff it for no real good bonus to anything. They added a resource, Mushrooms, but this is literally just Berries with a different name. They have blocks in the game now but there's no use for them. And that sums up their update. Otherwise it's still very bare and dry with no substance or depth to it. If this is what they have after working on it for over a year then it's at least 3-4 years away from being worth its sale price never mind full price.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly does not play well, mechanics are badly done. Good idea, horrible execution. A 2 man team could have done a better job than this lol.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "dumped about 18 hours in the game, Really good game. However after 7 years and it still being so underdeveloped, just wait for it to go on sale or get a key off of G2A... not worth the 40$, wish I could get a refund.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This idea and interface of this game is quite similar to Banished. Just 10 years later added some war options...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way to much micro management of citizens to keep supplies up, many of the mechanics aren't working properly, like getting livestock to graze properly, and I can't add enough fields to grow enough food for like 10 houses. I didn't even try out the combat aspects cause I wanted to see how city building/management was, and it's not good.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gotta love when companies when release half a game and abandon it and screw their customers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is just empty.\r\nMechanics are unclear with no way of clarifying stuff. Lying or sometimes not existing tooltips. There are few ways to lock yourself progress-wise. There is so little depth to the gameplay compared to alternatives it's not worth trying at it's current state.\r\n\r\nOn top of that it crashed 2 times in 4hours of gameplay loosing all the progress of course.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Manor Lords came out ages ago, and absolutely nothing has changed. The potential for an amazing game is there, but instead we’re stuck with the same tired, repetitive mechanics on a loop. Promised features? Gone. Nonexistent. It’s an outright joke. You spend hours doing the exact same thing while the developer sits on millions from the beta and can’t even finish the most basic parts of the game.\n\nThe price is insane. This isn’t just overhyped—it’s a full-on spit in the face to everyone who supported it. If this developer thinks a DLC or some “social experiment” nonsense is going to fix this mess, they’re delusional. Manor Lords right now is the perfect example of how to sell hype and cash without delivering an ounce of actual value. It’s insulting, frustrating, and frankly, embarrassing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i have a very high power gaming setup and i got 15 hours of play before it crashed and will not even run anymore. its fun... if the game didnt crash so often",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Beta is taking tooo looooong and Anno Pax Romana just came and demolished anything Manor Lords have to offer.\n\nSlavic Magic needs to cook faster, hire some extra team mates and deliver promised features.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "You’d normally expect at least some degree of progress even from a solo developer, but that’s unfortunately not the case here. Comparing the current state of the game to its trailer from five years ago, it actually looked better back then in almost every respect. The game hasn’t just failed to improve, it couldn't even manage to maintain the quality it once presented. (I didn’t play the game at that time, so I can’t say whether what was shown was truly playable, but the point stands: there has been no real progress.)\n\nManor Lords promises spectacular features if the developer can eventually deliver on them, and I genuinely hope I’ll be able to change this review to “Recommended” someday. But right now, that's simply impossible. For the time being, stay away.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bought this ages ago, every time I come back there's still something in the gameplay that is missing for me. I can't quite put my finger on it, but I regret buying this. It's got great graphics, a decent management interface, love the whole zoning and construction mechanics for laying down structures, seasons, farming etc... but something about the whole package just doesn't land it for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Only one broken beta update after over one and a half year, that's still not fixed after a month. It seems like this project is very poorly managed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Yet another overhyped, unfinished, never-updated, cash-grab EA scam.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "why do my sheep keep dying at high elevation they literally live on mountains my neighbor",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ">Spawn in a tile without iron and fish\n>To get a new tile you must march with your army or buy with kings favor (not implemented yet)\n>To get an army you need equipment\n>To get equipment you need iron\n>I can't get iron\n>I'm unable to do anything except watch everyone else around me slowly expand until my inevitable demise",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "still beta after 7 years, developer is either lazy, stupid, or stealing money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is taking forever to get developed I think I'll be dead before it gets finished. The newest 'update' isnt even an update its another beta WITHIN A beta its insane. Please don't buy this game its so underdeveloped you cant even have multiplayer. Buy ANNO or literally any other city builder or some just pirate this game. \n\nThey have a 'team' but literally even the Stardew dev has put out more than than they have in 7 years LMAOOO. Nice looking game, but lazy developers. Don't Buy It. Your Welcome.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "CANT EVEN PLAY IT ,,,CAN I HAVE MY TIME AND MONEY BACK PLEASE. iTS NOT JUST THIS GAME ALL THE ONES I LIKE CRASH OR DONT WORK COUNTLESS HRS. AND MONEY WASTED,",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Crash on startup always. Cannot fix, and the company does not respond to help messages. Hooded Horse deserves any bad reputation they get.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Taking a 5 min of your time to make an update is too hard apparently. So let's make one every 4 months when you sold a product that is unfinished with the promise to complete it....\n\nthis \"lone, solo, isolated\" dev needs to learn a little how the concept works",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Hmmmmmmmmmmmmmm, come on, you sneaky people. ;) Let's be fair here...\n\nBy 2.5 hours you will have built every building and seen every feature. The only people playing this game past the 20+ hour mark are those who are happy building the same village over and over again. This is an EXTREMELY early access game. As I say, by 2.5 hours you've seen everything the game has to offer.\n\nFor $10? Worth it. But a $40 price tag? No sir, you can't fool me ;)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is disqusting It keeps crashing once i Start the game i Paid 150$ For the game man Fix this game man",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game but too few updates too far apart",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "very little progress for a game with over 60 million dollars in revenue",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Manor Lords is actually a pretty visually striking game, with some very good mechanics built into it that includes economy, city building, managing population and workforce, and even with a strong weather system that directly influences your food supply and other variables. There's military engagements to be had, but to be honest I will say there's far too many roadblocks to have a enjoyable enough experience to get to that stage. I have enjoyed making a few settlements and getting to know some of the core mechanics of this game. \n\nUnderstanding full well this is early access, even considering that, this is where my positives of the game end for the most part. This game makes you feel like you're trying to put together a Lego set with no instructions. I again fundamentally love the core ideas of building up your population, and even managing your food supply, fuel supply, livestock and some rudamentary economy decision making. In fact, in the early stages of the game when you are basically collecting lumber for fuel, crafting some of that suppply to be made into planks for more advanced construction, developing crops and livestock and watching your little medieval settlement grow, it's super addicting and rewarding. However, once you get a little further this is where the cracks really begin to show. For example, to advance your settlement and therefore kingdom's influcence upon the region, you must get into making sure your people are properly clothed. Building pastures in order to herd sheep to get wool for the clothing makes logical sense. However, I spent at least an hour on the beginners map trying to find proper land that could be used for a pasture. Every time, despitre reading countless guides on how to just find a suitable terrain for pastures, it never worked, and I resported to needing to import sheep, wwhich is very costly for a early-mid game run. It was sugggested to me to find good grazing land, away from other buildings, but the game does not have any kind of overlay to suggest where it thinks that would be a proper plot of land for that use. It does mention arable land for crops, but not pastures. Also, trying to increase my peasants happiness by providing them with some ale was a whole other level of trail and error. I had an excellent supply of rye from my fields, but learned after far too long that the reason my alehouse was getting no supply was because my storehouses were allocating the resources elsewhere, or I needed to ensure that I had an adequate supply of rye in my granary instead of the storehouse. Again, there's systems that the game assumes you will know how to sort out, but it's just not obvious enough, and you're never taught these things.  I will be happy to admit this if this is jsut a skill issue, but even if it's something obvious and I'm just being dumb, this leads to my next and one of the moist fundamental problems I am finding with Manor Lords: \n\nThe tutorial stinks. Or lack of tutorial and helpful support for beginners, which is basically everyone since this is a not super popular early access game. Tutorial hints are a-plenty at the start of this game, which is great and I will give credit to the fact that it does teach you the core fundamentals of gameplay, let's call that tier 1. When you want to progress, the game does not really tell you how these individualized systems are supposed to all work in harmony very well. Tier 2 mechanics are very clearly where the early access part of this game comes in, and again I understand what I am purchasing when the developers say this is early access, but this is just a warning to others that you're essentially buying into a game with really neat and unique concepts that stand alone well, unfortunately when you need these systems to work in tandem, they sometimes do, and sometimes don't. Going to the in game help page is a bit of a slap in the face as well. With so many topics simply being resorted to one liners, with highlighted text to describe buildings or resources, but you cant click on them to get to other parts of the hep section, and often you absolutely cannot find the answers you are looking for. This is a true trail and error, and read a bunch of community notes kind of experience. I don't love when games hold my hand, but at least give me the option for it to hold my hand a little bit espercially upon first few playthroughs. This isn't like other city builders/large economy and warfare based games, so it was a little surprising that the devs didn't put more emphasis on teaching you how to run your kingdom efficiently.\n\nAgain, there's a lot of brilliance in this game, it looks beautiful and I really can tell that the devs have put some heart and soul in to this. I will gladly switch my review to a recommendation as I am not throwing in the towel on hope for this game, however my intent is to give anyone interested in checking this out a heads up that there are a lot of broken mechanics, and systems that should be functioning in tendem with each other simply don't. At least not yet. Hoping this game actually sees a full 1.0 release soon and am genuinely looking forward to that day so I can build and walk around my little settlement, and watch it grow into a sprawling kingdom. But for now, save your dollars, there's plenty of folks already playtesting this thing and it's really now up to the developers to actually finish this title up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Came out strong, but waiting months for game breaking fixes, and the game essentials/pace changing from the initial release has made me give a low rating. Was really hoping this game dev would keep up with constant fixes and updates like other small devs (see Vein). The 'ai' is horrendous, and almost seems like an afterthought to throw the term around.\r\nI would recommend wainting to purchase once it's more stabilized and the Dev figures out what this game will be. \r\n(Still no major manor/castle mechanics!)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "(Still early access)\n\nManor Lords attempts a blend between a city-builder and RTS combat. Unfortunately, it fails in both areas. There is great promise with this if balancing is achieved and more features are fleshed out.\n\n1. Balancing for City-Building: There are numerous bugs and poor interactions that occur during gameplay. Resources don't get moved when you need them to, construction queueing is poorly prioritized, and sometimes things break for no reason (markets suddenly stop getting supplied, causing your population to become unhappy with you). Farming is absolutely underpowered and useless: it takes too many farmers to produce too little result. AI is very underdeveloped: I opened a Sawmill and it took, no joke, 14 months before the AI figured out how to move Lumber from my Lumber Yard to my Sawmill. Honestly, everything on this side of the game feels way too expensive and tedious to acquire/build except for Stone, Clay, and Clay Tiles. There really aren't enough resources, and those that exist deplete too quickly to feel any sort of progress. This could definitely be fixed by adding more/faster policies or development points. \n\n2. Balancing for Combat. Holy !@#$ you get screwed over so fast. Before my first winter on my latest run, I had almost all of my food stolen from raiders, alongside most of my pelts. There is nothing you can do, as far as I know, to stop this before you have soldiers (which takes longer than 5 minutes of gametime). \n\nThe enemy AI is so ridiculously overpowered. Your off-map rival will steal 2-3 provinces before a full 12-16 months goes by, which is about when you'll be able to have a church and muster your first (free) 20 spearmen. In contrast, the AI will have near-or-usually-over 100 units of archers, spearmen, retinue, and usually mercenaries. The balance is so repugnant.\n\nDefinitely a lot of potential, but not worth it at this point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What game let's the NPC monopolize the only means of defending yourself (Mercenaries).  The game has potential, but the NPC race to clear bandits is stupid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it was  a good game but half the building did not get build even if i had the resoues required",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I REALLY want to like this game, but plagued by EXCEPTION_ACCESS_VIOLATION errors.\n\nSometimes the CTD is random, other times when I click on a building. The only time I've known what caused the crash is attempting to save, this almost always results in a CTD. Sometimes I can go an hour without CTD, sometimes 5 minutes. What's worse is after the CTD most of the time the saved file is lost.\n\n-Set game .exe to run as admin, did not work.\n-Updated GPU drivers, did not work.\n-Verify game files, no missing files.\n-Set game to launch -dx11 and 12, did not work.\n-Ran Windows Memory Diagnostic Tool, no errors.\n-DISM, no errors.\n-sfc /scannow, no errors.\n-Edit settings.ini in C:\\(username)\\appdata\\local\\manorlords\\saved\\config\\windowsnoeditor, windowsnoeditor file does not exist. Tried usersettings.ini to ML.aaMode=, did not work.\n-Repaired Visual C++, did not work.\n-Attempted to rename/delete OpenXR from Steam\\steamapps\\common\\Manor Lords\\ManorLords\\Binaries, folder does not exist.\n-Uninstalled/reinstalled game, deleted all remaining files (%appdata%). Checked file pathing, windowsnoeditor/binaries did not populate, probably removed in an update.\n-Deleted DirectX Shader Cache, did not work.\n-Manually set mhz of RAM, did not work.\n-Manually set voltage of RAM, did not work.\n-Disabled and enabled XMP in bios, did not work.\n\nI have never in all my life had more trouble trying to get a game to work than I have with Manor Lords. There are quite a few people who've ran into this issue. I've found posts going back over a year with this exact same problem. Most for Manor Lords, some for other UE games. Apparenlty, UE isn't great. \n\nI believe my issue is solely due to the Unreal Engine conflicting with something in my system that no other engine does.\n\nIn it's current state I can't recommend as early access means you get to play it, it's supposed to be beta. I would not want others to go through this, knowing you'll love the game but can't get it to work because of the engine. \n\nOf course it might work for you as it has with others, but ye be warned.\n\nZ790-E\ni9-13900KF\n64GB RAM\nRTX 4090\nM.2\nDrivers up to date.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a lot of game breaking bugs\n\n3 months ago, they had an update and it also has a game breaking bug where clothes consumption is way too high.\nit's nearly impossible to upgrade your homes to reach end game because of this\n\nafter 3 months of silence, they finally posted a \"devlog\" just in time for the steam awards and a big sale \nbut still no fix or any mention of said bug anywhere. not a good look",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It’s nice, but nothing truly groundbreaking. The game has been in Early Access for one and a half years, and unfortunately new content has been rather scarce. A lot has been announced, but little has actually been implemented. I wouldn’t buy it again at this point—let’s see how things develop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun (when it gets updated) But right now it is simply updated too slow for it to be fun in the long term RIGHT NOW. Do not buy it yet, I would buy it shortly after it fully releases or gets close to that point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has an amazing concept, amazing graphics and amazing gameplay.. Until you play for more then 10 hours  and realize how bare bones of an experience it actually is, especially for its price tag. The game is riddled with unavoidable game breaking bugs, broken mechanics and mediocre performance. It gets very few major updates and the updates that do come out are broken bug filled messes that go long swathes of time before being patched, The graphics themselves face constant clipping and janky animations all while the performance has been degraded to a severe degree since the game launched, the combat is good during the larger battles but the city building itself is awfully buggy and unstable, not to mention that the mechanics that are in place are quite bare. The game is not worth 40 euros and with the developers working at the speed of mojang at its worst its safe to say it wont be any time soon.  in short: amazing concept, lazy or just very untalented developer who stopped caring after cashing out on the inital sales, bug filled mess thats not getting fixed any time soon (that costs as much and more then far better games)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "15% productivity at my saw mill because the AI pathing is just walking back and forth XD GG, will come back to test it again later maybe.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is fantastic... when it isn't broken due to the workers not collecting timber even though I have three unassigned families, 50 surplus timber, and 3 idling oxen. Happens every game I start after 5 minutes or 2 hours. Very disappointed that this bug has been around since the game was released and it is still not fixed. \n\nAside from the bug, 4/5 stars. Here is why: The game is very fun. I love city builders and this one has great graphics, it is easy to control, and has lots of features. I can't wait to see what becomes of it. I would give it a fifth star (ignoring the game-breaking bug) if enemy ai would build on the other lands.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really good concept, really bad execution. For the first year of the beta, things went fine, the game was unstable and you could only reach \"mid game\" or not even that, but we could see progress in the development. I feel like ever since Greg started to work in a team and not as a solo dev, things got worse.\r\nI get that you have to organize your spaghetti code in order to work with a team and it takes time and effort, but this latest update is criminal. It made the overall state of the game feel like even more of a beta game than before, and didnt really solve any issues or moved the game forward. The only reason they released the update was because they left the community in the dark for months and wanted them to shut up. I have not given up on this game yet, but the lack of communication and current state of the game makes me worry if this game would ever be finished.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "16 hours I understand this game is early access but it seems broken and unplayable without cheating or modding. It isn't balanced well enough to support growth and the trade mechanics are punishing. They also have features you work towards just to find out you strived hours to reach an access like plowing fields only to find they're broken and don't work well so you waste all those hours just to get a botched upgrade. I really wanted to like this game but to me it feels like they launched a game in early access in an entirely broken unbalanced state.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game crashes. system requirements are bullshit. 8g of graphics not enough.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is visually striking and there are some good bones there, but overall it's painfully incomplete. Resource management after the first few years is wildly unbalanced and combat feels bolted on from another game. It gets boring and repetitive quickly. Large sections of the game don't make a lot of sense, and nothing is well documented or explained. This one needs quite a bit more baking before its ready for serving. As it stands now, it's a frustrating experience that's one notch above vaporware.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Really fun game, like it a lot. Combat is janky and I've lost 10 hour between two save files that deleted themselves so can't post a positive review but has real potential.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve been waiting for and supporting this game ever since the very first teaser dropped, and I bought it as soon as it became available. But up to now, it’s still just an unfinished product.\n\nThe map is small, lacking terrain variety, and almost doesn’t affect gameplay at all. The hilly and mountainous areas barely have any mineral deposits. Rivers don’t provide any fish or seafood. And there’s absolutely no point in building on higher ground for defense, since the combat system is still incomplete. Obviously, with the current map size, all I can build is a tiny little village—nowhere close to anything resembling a real city.\n\nThe professions and activities are mediocre, with little to no interaction with the environment or other systems. I mean, you build a hunter’s hut, and they just wander off to get meat on their own—you don’t even have to assign them an area. Same with gatherers; they don’t need any input from me. Oh, and since the map is pathetically lacking in resources, I don’t even have to bother deciding where to send them—because there isn’t anywhere else to gather from anyway.\n\nThe building system has nothing new compared to other games—nothing special in terms of quantity or mechanics. Honestly, when it comes to how buildings interact with each other, this game is miles behind FF (if you know what I’m talking about—the one where you need saw blades to run windmills, and you can only get those from traders or a foundry). The main building, castle, or whatever you want to call it has stayed just as barebones as ever.\n\nWeather doesn’t matter at all. I left food sitting outside for an entire season, and it never spoiled. Hello? I need spoilage, drought, pests ruining crops, floods, or some kind of natural disaster—something to justify how long the devs have been delaying this game.\n\nPlease. With its graphics and potential, this game deserves so much more. For the price we paid, the devs owe us better. As it stands, it’s just plain disappointing.",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}