{
  "positive": [
    {
      "review": "One of the most polished fighting games in the market right now. Beginner friendly, amazing ranked system, top-notch netcode, a huge player base, and a lot of single player content with the world tour mode. The big downside though is the business model, with the character passes being extremely expensive. If you want to buy individual characters they only offer you packs of premium currency that have more than what you actually need to buy them. If you don't mind the DLCs the base game is completly recommended.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I am addicted to this game. While I don't play pvp, I have enough fun in world tour that I don't need to go into pvp. I love the story, I love the gameplay and the customization is not perfect, but good enough to where I have 0 major complaints.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "dbfz fanboy plays fighting game & this is probably my new favorite. i feel like its balanced well, soundtrack is dope,executing combos is satfisfying and this mode has ThE BEST training mode of any FG ive ever played. getting to master was very satisfying to me and love learning new characters",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "The netcode and lobbies are better than Street Fighter V.\n\nIs the game itself better than Street Fighter V and Ultra Street Fighter IV?  That remains to be seen.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Definitivamente um dos melhores jogos de luta recente, mas ainda possuí seus problemas: Capcom só tem focado no público japonês e throw loop ainda está no jogo",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "great fighting game to bang it out with friends. world tour mode is great to lay back with on the couch using a gamepad. probably my favorite sf title next to sf4. huge improvement over sf5 imo. maybe they could look into nerfing raw drive rush. i think its happening too frequently in matches for no risk.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "ranked match getting more dry and triggered what the hell happen to fighting game nowdays",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Ahhhh nothing like good old Street Fighter and this one it probably one of the biggest Street Fighters In the series love the 3 modes you can play, The Battle Arena is my Favorite. I really like they have some of the classic Street Fighter games here really enjoyable fighting game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If I could leave a Thumbs Sideways rating I would. Not because the game is mid. The game is amazing. Fighting games are amazing. The problem is they will ruin all other games forever. Play fighting games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Street Fighter 6 is a very well balanced fighting game with gorgeous graphics and a stylish flair that keeps it fresh for a long time. The mechanics are enjoyable. They've made it accessible to people with poor button skills while high level play is as challenging as for any game. The virtual gaming center (Battle Hub) where you can meet and challenge other players is a great touch.\r\n\r\nMy one gripe is the World Tour mode. It's cool to be able to make your own avatar and train with all the game characters, but the dialog and cutscenes are terrible. You don't buy this game for the story, and that's a shame considering how much potential this has.  Instead of a couple disconnected quests for each \"Master\" character they could have given each a full story line and tied that into the world system they created.\r\n\r\nOverall, Street Fighter 6 is a great update to the game. It's a great place to start or get back into it if you haven't played a fighting game for a while.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my go to fighting game right now. Tournaments are also really fun to watch and analyse. Highly recommend this to all my fellow friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't usually play Fighting games, or PVP, but this is alright.  Good community.  Good skill-based ladder matchup.  Got this game just for my waifu, Chun Li, but goddamn can the matches be frustrating sometimes.   Like with all PvP games: it's half love and half torture.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not my favorite street fighter but still a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best an easiest fighters for newbies. For vets its got some good stuff but its not without its problems (throw loops and drive rush) however its great game overall.   Really like SF6 compared to the past entries in the series. Give it a try if you're looking for a good entry point or just a vet looking a challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games to play till this day because I have been playing Street Fighter since I was in kid. If you're looking for an entry to fighting games try out Street Fighter 6. They have a control setting called Modern that simplify  your controls input a few buttons with a combo assist feature or if you want to dive deeper into SF6 and learn classic with motion inputs from light medium and heavy buttons that great as well. The game is hard to learn at first but once you get the hang of fundamentals (neutral, AA, BnB and etc) or doing flashy combos in ranked that you practiced for hours. You'll feel on top of the world :) SF6 is about self development from learning the game, learning the characters and learning your match ups! \n\nSo give it a shot and I'm SURE YOU CAN do it (get it :D?)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great music, great visuals, crisp fighting game with a lot of depth and extra content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, excellent experience. Please add 1 frame links back to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Single player review for those who aren't interested in PvP.\n\nFor someone returning to fighting games after a long hiatus this is a welcomed return. On sale, World Tour alone is worth it. \n\nEven with its uninspired story, World Tour is addicting and genre-defining. The customization and gameplay are on point. This is the single player campaign the genre desperately needed. \n\nThe arcade mode (character episodes) is ok, it suffers from a lack of production quality. Please be better than storyboards next time.\n\nMy one big complaint is the lack of unlockable outfits for the characters. Most of them are behind pay walls. This killed the game's replay value because there is nothing worthwhile to earn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very fun and replayable but the characters and outfits being locked behind expensive paywalls really sucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best new gen fighting game, great for newcomers to learn and get into fighting games, like one of my friends started playing this game 8 months ago and he's master rank with juri already, it's insane",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One tournament stream put me into this game and had a friend talking a lot about the license in general, now I owe him respect because it is difficult to be good at it, but im having fun learning all the combos one by one and using them in match, even if I loose I’m happy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly my favorite street fighter. expansive singleplayer, can make your avatar into a genetic freak, solid fighting, terry bogard's in it. only real complaint is that there's WAY too many microtransactions, especially for a full price game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "大清成分过高\n需要洪台吉清太祖洪承畴对冲一下",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it!\r\nIt is like they combined SF III, IV and V mechanics in one game and it somewhat works and is very fun to play.\r\nI am staying mostly for World Tour, though. It surprisingly has a lot of content for a fighting game and a good game in its own right.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best fighting game experience so far\naccessible, yet so deep to master\nendless improvement incoming\nshoryuken !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Versus friends 7/10 tone down the reliance on throw loops\nWorld Tour 3/10 being able to make your own character is cool and all but please remove the lock on moves that have the same motion, or let us set our own input for the move, its not that hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play it if your friends play it, otherwise you'll burnout fast\nAt least it has\n- Nice gameplay mechanics (for those new to the series and the Street Fighter veterans)\n- A good single player mode, filled with stuff to do\nEverything else is a pay wall \n\nThis game gets a 7/10, because I'm certain even if you burn out, you'll end up coming back to it\nAnd potentially paying money too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have more hours on XBSX, and it's still pretty fun. (buff gief plz)\nWorld Tour is for the boring people that play a genre that's at it's best when there are two players for the single player. You play as your created character and do busy work grinding for levels and learning the actually cool fighting styles. One glaring issue is that a lot of the mode is catered for modern controls. if you have a move that has one motion input, you cant use another that has the same motion input but a different button. (for example you can't have Hadouken \"↓↘→+punch\" and Donkey Kick \"↓↘→+kick\"\nBattle Hub is like an avatar lobby. Your created character (either the one from world tour or one you make for battle hub, it depends on which one you open first.) can play on arcade cabinets fighting other players in the lobby, fight using your avatar against others, participate in tournaments, or even play some actual arcade games that shuffle in and out of rotation every once in a while. (proceed with caution, though. some people are super salty and will be super obnoxious in the text chat.)\nFighting Ground is all of the usual stuff you would find in a fighting game. Training, arcade ladders, tutorials, & ranked play. (If you are SUPER new, play ranked. You'll be paired with people on your same level, and you'll have a chance to learn and adjust compared to just getting matched up with whoever.)\nThe core gameplay is fun, drive as a mechanic is pretty nice, some characters just benefit a little too much from it but that comes with the territory.\nConsidering that this is still getting updated and I can't see into the future, the meat of the game is worth a try, although I'd say wait until it goes on sale with some (or all if you're reading this like 10 years later) of the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Possibly the best fighting game out there, even if the execution is really difficult for a casual/beginner player like me.\n\nI'll keep practicing though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game really great probably the best wonderful 10/10 recommend to all family friends and neighbors",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very, very good game. Sort of my first real fighting game, so I could be biased. 800 hours later I have a little haute pad with manon and akuma stickers on it lol. I started off using modern controls bc it was way more accessible and I was clueless about most of the mechanics, but eventually switched to classic bc I wanted to do more damage and never looked back. It was also really fucking hard to learn and I'm still only diamond 4 with one character, but it's soo much fun. I learned a ton of new things by getting into this game. It has flaws, but for me it has been addicting. I wish it was less expensive to get new characters or cute outfits, but I get it I guess. I appreciate that you can unlock the 2nd costumes in world tour, but holy shit does world tour suck. It has its moments, but its nooot fun to play and it so jarringly different from playing in any other mode. I grinded for Mai's 2nd outfit and haven't touched it since lol. But I play a lot of ranked and local coop w my bf :) he gave me a lot of tips and helped me pick out my pad so shoutout to him",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best fighting game out there by a good margin. Fun and engaging with amazing characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Theres a big Italian woman that does a ton of damage and it gives me serotonin when I play her 10/10 best SF game that ends in the number 6",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hours felt fast, don't know cause the game are slow or not, but great to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had fun even being diabolically bad and largely sticking to singleplayer, the work Capcom put into World Tour and the new player experience really paid off. Compared to SF4 there's a lot more content variety without sacrificing the core competitive gameplay.\n\nIt's still a high skill ceiling fighting game so that's where the real value is, but SF is such an iconic series steeped in history. Having a solid story mode and opportunities to learn the lore was a really smart move and it clearly paid off with how well SF6 sold.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a good game, I picked it up last week and I am having a blast labbing these fighters. My only gripe are the god awful  modern control players!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fire, I absolutely love all the charachters even through the redesigns they got. It's so much fun to play !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far the most polished fighting game I've played to date, everything works perfectly and while throw loops and cr.mk - dr is still an issue; it's very easy to work past that as the balancing and feel of the game is like no other.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "recommending for the single player content. going through the city and fighting with your funny avatar is awesome. i was out here with Giant Glowing Slenderman doing blanka balls. its cash. i just dont think this game is for me competitively. maybe theyll release a character for me at some point, maybe ill come around to it like i did with sfv. who knows bruh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a rlly nice game honestly. as a beginner the combos are kinda hard to get used to, but practice makes perfect and thats honestly just a skill issue, the game is amazing and i love the character designs, music and environments. Also such unique fighting styles and things to keep in mind. Seems overwhelming at first but the tutorials rlly help. Lovely game tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I did not like fighting games before \r\nI like them now \r\n\r\nAdvise - Please take in small doses and avoid competitive abuse",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 zangief can command grab opponents on end if you avoid them trying to actually play the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fighting game, the cadence of balance and content leave a lot to be desired tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SF6 is really good game, classic, they can nerf the DLC characters a little all do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a fun competitive game. I will say still needs some balancing on specific characters but definitely a lot more technical than Mortal Kombat. I do wish that when in training mode and searching for a match I hate that I can't open the menu because it's still searching so I'd like to be able to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing SF since ST2turbo until alpha 3. Then after getting busy at worked and obligations. I didn't get too enjoy sf3. Now I'm back and enjoying the competitiveness of sf6. \r\n\r\nI just hate it when I get hit with the Drive impact. due to skill issues",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m not much of a fighter game player but it’s pretty fun to play with friends from time to time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's difficult to find a spot to squeeze in with your fighting game thoughs. I feel like I'm too invested to say something that will speak to casual enjoyers, and too much of a scrub to say anything fighting game veterans won't scoff at. The mere fact that I skipped an entire entry in this very series, Street Fighter 5, makes me fundamentally ill equipped to say something like \"Street Fighter 6 is the best Street Fighter game, and by extension readily one of the best fighting games of all time.\"\r\n\r\nWith that said, I do believe those things are true.\r\n\r\nI think there's an X factor in some games that makes them uniquely suited to attracting and encouraging players. There's something about the vibe that is inspiring and uplifting. I'm reminded of how Overwatch felt initially. A design philosophy that inspired every decision with that game was surfacing your progress, highlighting your accomplishments, and tucking away friction like your win/loss ratio. The result was a game that offered a class for every style of play, a position on a team where you could feel like you were contributing, and before you knew it, you were good at the game without experiencing any of the soul sucking mud wrestling with toxic dipshits normally associated with learning a competitive game.\r\n\r\nStreet Fighter 6, by virtue of being 1v1, transposes those design decisions elsewhere - the prevention of direct communication, the \"modern\" control option, the various modes through which you ultimately engage with the same aspects of the game with different degrees of friction - but the broader effect is the same. It's a game that is welcoming and excited to have players play it.\r\n\r\nAnd it shows. The pudding is full of proof. Matchmaking keeps queueing you up with opponents in seconds, and no matter your skill or rank, there's an opponent ready to meet you at your level, meaning the player pool is huge and active, three years after launch.\r\n\r\nTwist my arm and I would say a weakness is its lack of extra content for normal ranked play. Only twoish extra outfits for each character - if you're lucky and your main has more than one - is pretty wacky when you consider how ready hardcore players are to shell out for a new look after a thousand hours looking at the same character. That aside, even though the pricing is steep, the season passes have delivered character drops that feel *major*. The character choices, Akuma aside, have felt bold and they've been truly exciting to revisit inside the framework of this game. I'm writing this some weeks after C Viper came out (my favourite new character in SF4!), and getting to grips with her is like opening a new game within this game.\r\n\r\nI've emphasised the player base and accessibility of the game a lot with this write-up, which may seem strange, but no matter how good the underlying game is, I do consider its popularity its greatest asset. The fact that the environment is there to have such a snappy and fulfilling experience online is simply something most fighting games cannot offer - regardless of the quality of the game itself.\r\n\r\nIt feels rewarding to love this game, and it's an easy game to love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hardest game to learn from the big three, transitioning from NRS has been pain, yet I can't get enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game but nerf breakout whenever i use kimberly's special move it just becomes breakout for really long and i just get comboed cause i cant drive impact or use her special move",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "还可以 从没玩过真正的格斗游戏 现代模式虽然很无脑 还是带我进入了这个格斗游戏的世界",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm still new to this game and I think that it's just fantastic \nIt's well balanced, the mechanics are great and fun \nMost matches are satisfying and each match teaches you a lot \nSf6 lets you see your progress and it's super satisfying to notice how better you're getting day by day\nGame doesn't punish you for being new and it can be fun from the start specially with modern controls which helps you understand the game and fundamentals better and then you can switch back to classic for that lovely feeling of executing your moves right\nFor me this game will have a really special place in my heart as the only fighting game that's actually well designed and is not frustrating and overwhelming for newer players and doesn't make you feel stuck or helpless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played every SF since Third Strike and this is peak 3S nostalgia with a fun new twist. Not going to pretend I'd make it out of pools at EVO, but as a fan of the series this hits all the right spots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The streets REALLY fight back in this one...\r\n\r\n\r\nRegardless of whether or not you're new to fighting games, you will learn, very, very quickly, why Street Fighter is the Gold Standard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall great game, slower than what i usually play but it is really fun\nAlso love the fact that it is easy to get into so my friend could play it with me even though some of them have zero experience in fighting game\nOnly complain i have is slow update with very few character doesn't mind drive rush or throw loop too much, really wish some of the older character like Q come back one day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely EXCELLENT game. Have 122 hours in my 1st month of playing, managed to play a ton of world tour (the single player) and make it to platinum in ranked play. I have been playing this game casually AND competitively, normally i play a competitive game or two and play another casually for stress-free gaming; i can do both here. World tour is basically a big sprawling RPG, with lots of hours of gameplay. Only thing about it though that i disagree with most people is that it DOES NOT help you get better at the game; the game is usually played 1v1 with other people, but most of world tour is more than just one enemy, so not really the same thing. Either way it has a ton to offer and is still great single player. \n\nNow, multiplayer, it's been a blast. I may not have had a high standard because i came from Smash and Tekken, which...have both become absolutely broken games, sadly. This game has some rather powerful characters, but it is absolutely far better balanced than Smash Ultimate and Tekken 8 at the point I am typing this review! Also modern controls is a fantastic way for newer players to get into this, which nerfs special attacks... then eventually switching to classic to use their character at 100%. It's a brilliant idea actually. Also the fact this game hits top 100  most played on Steam (sometimes top 50) every single day as a CORE FIGHTING GAME ON PC is a testament to how good and active this game is. Fighting gamers aside from Smash are usually on Playstation. Oh yeah, soundtrack is okay, and graphics are AMAZING yet pretty well optimized game. Let this be your entry into traditional fighting games like it was for me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great and I love the art style, the single button special moves are great for beginners that want an extra flare with their attacks!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There’s a few bad things  I can say about SF6, like the scummy pricing of characters and costumes, and how most of the collabs have missed the mark.\nDespite all of this SF6 is everything a fighting game should be, packed with single player content, good features good online and the gameplay itself encourages so much player expression it’s crazy. If you don’t believe just watch EVO top 8 of any year and it will be hype as hell. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what to do if this game failed to play. failed to read saved game to data corruption.and failed to create new and play from the beginning",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- 10/10\n \n-One of the best fighting games I've ever played.\nIt's fun because every match is different.\nAnd the ranked mode is fantastic.\n\n-Every character is unique. For example, Ryu is very different from Sagat, and Sagat is very different from Ed.\n\n-So if you like fighting games, this is for you!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "steep learning curve, if you want the OG fighting game feel, but worth the hustle\r\ngood game indeed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hmm... So, it got Chun-li and Mai. Hmm.... So, it's from Capcom, the company that created Monster Hunter. Hmm...... Click Buy.\r\n\r\nAbsolute Cinema",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am addicted to this game. While I don't play pvp, I have enough fun in world tour that I don't need to go into pvp. I love the story, I love the gameplay and the customization is not perfect, but good enough to where I have 0 major complaints. (42h on PC and PS5) My fav fighters in this game: Chun-Li and Juri. They SOOOO GOOOD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ive been playing Street Fighter since Super Nintendo so Ill always have a soft spot for the game. Graphics are on point and game  play is fluid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good kinda difficult to learn different characters if your new to street fighter but still a great game also f u modern users",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with flexible options for various play styles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "monetization kinda sucks in the game, but its easily the best 2d fighter out there. Great for beginners and returning vets! Base game went on sale for 20$ this year!! absolutely worth it at that price!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After the turd that was SFV, it's nice not to have to feel shame when you tell people you play Street Fighter.\r\nFinally a good ranking system, Capcom can realistically only make this game worse going forward.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Survivalist, heroic as a tiger is\nEarn my stripes 'cause you know I'm do, or die with this\nJourney started young, super hard-headed\nCall me crazy, but you is not my psychiatrist\nBeen through a lifetime of strife and strugglin'\nBe the best, that's my covenant\nAnd I'm gonna live forever, that's my legacy\nGreatest of all time, that's what they gonna label me\nThey gon' say what they gon say regardless\nI'm not afraid to fail, I try my hardest\nPower up, the time is now, I got this\nI'm on fire, light the darkness\nI'm ready for a fight, when it's on, it's on\nI'm charging like a bull, when it's on, it's on.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is not only the best game in the franchise (hot take probably) but it is also the best fighter for scrubs like me that have tried and failed get into fighters for years. Modern controls have turned button mashing and hours or combo trials into me getting to actually play. I have nearly made it to ranked with a low tier character thanks to both Modern Controls and years of practice. They are just enough of a helping hand to get you into learning the fundamentals. I don't want it to come off like Modern Controls are holding your hand. They are not. I'm rambling. It's good for people like me. Thumbs up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who grinded dbfz hella on my old account this game is awesome. beat world tour in a day hella addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must-play for both newcomers and longtime fans. Great performance on Steam Deck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game but theres this weird bug where mai is still in the game. hope it gets fixed soon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The good news about Street Fighter 6 is that there's really something for everyone. The single player content is solid with World Tour and Avatar Battles etc, but if you want to get sweaty on ranked, you can do that to. I have about 600 hours on PS5, plus a couple hundred on PC as of writing this, several characters in master, with my main character sitting comfortably around the 1550MR mark (on a great day), so I can confidently say that I like this game a lot. \r\n\r\nBut with most fighting games, there is a caveat, which is that you have to: \r\n\r\n1. Like fighting games \r\n2. Like the system that the fighting game uses \r\n\r\nSF6 is a modern FGC title through and through, which means that it's easy to learn compared to earlier titles, AND legacy skill is diminished because of it. That doesn't mean if you've been playing Street Fighter since the arcade days that your skills mean nothing, but what it does mean is that there's a lot to learn AND the drive system in this game is very, very strong. \r\n\r\nThe best comparison I can think of is through chess. \r\n\r\nOld mainline Street Fighter games were like classic chess -- the speed and timing were just so that while you couldn't take forever, the speed by comparison was much slower.\r\n\r\nModern Street Fighter games are like rapid or blitz chess. It looks similar, but the game is much faster, and you've gotta go fast because the timer is not on your side. \r\n\r\nSo it goes with the drive system. There's one way to play. That way to play is really, really fun, but only if it clicks. If it doesn't click, you're going to find that you spend a lot of time on ranked really angry because you died in two hits, and you didn't really get to play the game. \r\n\r\nBut, if it does, there is nothing quite like the speed and rapid decision making that goes into a victory, and yes, even the 50/50 emphasis can be enjoyable if you accept the coin toss for what it is, and shift your thinking towards a different game plan than the one you might be expecting. \r\n\r\nIs this game for everyone? It depends on what you want to get out of it. If you're new to Street Fighter and want to learn this classic series, then play this game. If you like aggressive, fast paced gameplay where you can overwhelm your opponent, or make that split second decision that gets you a round, then play this game. If you're hoping for a game more like SFIV or Third Strike, you might be disappointed, but then again, who am I to say otherwise? \r\n\r\nThe great days are great, but the bad days are bad -- and unlike older fighting games, you can't grind away forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll be honest, the artwork and animations are the only reason I love this, as well as the Arcade Mode so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ">character turns green \n>guess wrong\n>thrown or combo'd\n>repeat\n\n10 green slimes/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but damn chan li voice is bad i hate her voice in dub",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "5 win streak got me feeling higher than any drug. glory to the father who is most high, for he is the one who grants my wins!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you suck, this game is great for you\r\nif you are good, this game is great for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a fighting game, nothing more, nothing less.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "completely addicted. not much else to say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good beat em up, prolly the best one since MK3ULT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game always if you plsy with a friend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good! First tim properly playing a fighting game and its quality has made me like fighting games more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10 2d fighting game  (1 point extra for netcode)\r\n10/10 video game including all modes and modern trinkets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel like sf6 is pulling a less extreme sfV where the initial launch leaves a bit to be desired or has (in my opinion) questionable choices like reducing the base cast to mostly sf2 characters and Juri, but it gets progressively better, and the new characters like Marisa, and Jamie are welcome additions. It feels like we are getting more fan favorite characters like Elena, Viper, and Alex. Akuma and Sagat should have been base roster tho. \n\nHowever, i am a bit annoyed with the direction 6 is heading. the wack pricing of the dlc has been brought up before by a lot of users but capcom has also really been pushing ads and promotions in the most blatant way yet. it feels alienating to see them push le big product before changing gameplay elements like throw loops which dumbs down neutral and removes some skill to the game. this isn't a \"erm git gud\" situation as i feel that sentiment skips adressing the games possible issues and just clowns on the player.    \n\n \nBut with all that said, its still a fun game that'd i recommend, especially to newer players. it's got lots of personality to it, a lot of characters like Chun li and Dee jay have incredible redesigns, and there is still lots of love and dedication that went into it. hopefully 6 can live up to V near the end of it's lifespan. This is a game new players should try, but longtime players should have possible concerns for the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Practice makes perfect.\r\nThat's how this game works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is nuts.  DLC is crazy expensive.. but honestly having a ton of fun.  Feels so smooth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 1000+ hours in this game I can finally say Drive Impact sucks and it's 100% not a skill issue on my part. My reactions are fine I am not an unc. games good though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I payed money to get punched in the face. 10/10 would get punched again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. World Tour was a great idea.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great SF game and all but we want ONI and GOUKEN ! ＞﹏＜ Bring them back !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the best fighting game series ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, makes me unfathomably angry :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "No game has made me rage harder. 10/10 A+++++",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply the greatest fighting game to date.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Fighting Game ever, Tekken will never be better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not my first street fighter. But now is my favourite street fighter",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best SF game for me :D It's really novice player friendly :))",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I main Cammy just to enjoy her butt on the victory screen",
      "voted_up": true,
      "votes_helpful": 7
    }
  ],
  "negative": [
    {
      "review": "the game itself is only the entry cost, everything after that will cost you eventually way more than the game itself",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "This game feels so much boring compared to the older ones, it so streamlined and so weird that I am playing a weird version of an Air dasher without the air dashes. \n\nYou can insult me if you want to but this game doesn't feel like street fighter anymore, these throw loops, Drive rush and impact are just so stupid as mechanics, the fact that every just feels awful to play. \n\nAnd why are we allowing people with master controls into Ranked? what's the point?, so the effort that I put in learning a character can be thrown away because some person decides to play with easy mode... so what's the point of playing the game the correct way?. Still need to learn the basics but it takes away like half of the point and the fun part of a fighting game. \n\nIn my opinion I don't like it, if you do like it power to you.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm not sure the menus in this game could be worse.\r\n\r\nGameplay is great but I cannot be bothered to fuss with all the menu layers, network connection waits, and unreadable fonts.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "easier to understand & more balanced than tekken. asides from that, tekken is better in every way",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "All the plagues of contemporary games. If you want a good experience go play a game from at least 10 years ago.\n\n> base game is 40€, each base update is 30€ (ultimate is 50 wtf) so at least 40+30+30+30 = 130€ \"full\" base game for now.\n> Launch the game, lose 10min of your life creating a Capcom account to sync with steam with all the password double security check on, so on so they can spy on you.\n> 2025 the game do not auto recognize your screen is 4k and launch in windows mode 1080p\n> lose 5 more min in the trash settings.\n> Over accessibility to make the game easier, 6 buttons classic gamplay is too hard apparently, they think people are dumb so the simplified it and made shortcuts and breaker. Loss of depth evident. At least you can still play in classique controls.\n> Every mode have unskippable tuto... because you can't understand 6 buttons and 4 movements.\n> You can unlock stuff and gear for your characters, but everything is made confusing with a slow progression to frustrate you and push you toward microstransaction and season pass...\n> of course it was made before Concord, so all the cringe ridiculous design of new characters for a \"global modern audience\", Type1/Type2 body BS, is here to an rarely seen extreme, They even stolen the character from Chris Tucker in the 5th elements for no reason excepted pushing some clear \"fabulous\" cliché agenda.\n\nA shame because the production quality is in fact great. Just imagine what they could have done if they committed all their ressources to having efficient navigation in the menu, no time wasted on pointless introduction and weird design, obscur microtransaction and so on , add more characters and new mecanics to add depth instead of removing it...",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "fix your dog shit internet i disconnect almost every game makes me want to eat my controller",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I remember playing hours and hours against my college buddies Ken v Ryu. Street Fighter was a staple. I feel like over time, I've lost what this game was. I no longer have a joy of playing this. I can't quite pinpoint what it is.\n\nThe art direction doesn't bother me totally (weird shiny people on steroids now, I didn't even hardly recognize some of the past staple characters at first) or the fact I don't know half the characters (I like that - variety is good). But there is so few characters for the price. The value isn't here. I also think the DLC is 4 characters for the price of other games. \n\nI really wanted to log in, love it, throw my money at this. I logged in, liked it, and didn't throw more money at it. The arcade version to get the plot of each character was 5 fights with 1-2 cut scenes. There is no character development or story to fall in love with characters. \n\nI'd give this a neutral rating if I could, but because of the price of the DLC, it swang me negative.  It just feels corporate with no love. I hope I'm wrong and the workers loved it and for that I apologize that I didn't connect with your vision.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "gone are the days where you could pick up a fighting game and the character you wanted to play was in the game without having to wait more than a year for them to be released and then pay money once they do come out. Disgusting",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Maybe I am old schooled.  But I have never played a game where you have to buy the game then buy the characters you want to use.  The creators of SF6 should be ashamed of themselves.  What do I know though?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Casino 6\n\nGood game hindered by Drive System, Perfect Parry and easy mode BS.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The DLC pricing for  4 DLC characters a piece is extremely predatory. Otherwise it is Street Fighter.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game load out very staggnet and the character paywall for only half the content is really sad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "50% boring fights with under-powered randos and 50% annoying spam from other fighters. No middle ground, just meh either way. It's like playing in an arcade full of sleepy toddlers and pro players who know your inputs - pick your opponent.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It has almost been 6 months and there's still no way for the existing player base to upgrade their game to the Fighters Edition.\n\nThis is genuinely a good game but it's ruined by Capcom's immeasurable greed and complete lack of concern for their titles. In their eyes: good sales = good game, with no need for updates. Capcom simply doesn't care about their games unless the Japanese player base starts voicing complaints. This is a well-known fact, though for some reason, the Japanese player base often stays silent on many issues. Despite the huge success of this game, Capcom still refuses to provide regular content updates. It takes them months to release an update, and when they do, it's usually a half-hearted effort focused on avatar customisation in the Battle Hub — something the majority of the player base doesn’t even care about. And after that, they go silent again for months.\n\nEven a whole year isn't enough for Capcom to release four characters, so don't expect a new outfit for your favorite character anytime soon. It's just not happening.\n\nBalance changes are nearly non-existent. They only do a balance update once or twice a year, and it's usually insignificant and nonsensical. Throw loops are still rampant. And let’s not even get into the horrendous monetisation for the tiny amount of content that there is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Highly disappointed in this game. Waste of $16. This is coming from someone who loves a lot of capcom series. Resident evil, Devil May Cry, and Dead Rising are all goated game series. But Modern Street Fighter is just not it for me. I don't understand why its so popular when fighting game series like Tekken, Soul-Calibur, and Virtua Fighter exist for the 3d space and Mortal Kombat, Guilty Gear Strive, and Marvel vs Capcom. exist for the 2d space. All these fighting game series feel way smoother and fun to play for me. There's just something about street fighter that feels off when it comes to fighting games. It doesn't feel fun to play for me personally, it feels clunky and outdated gameplay wise, even though the presentation for the game is pretty good since it uses the re engine, and I like the character design. Just the actual gameplay feels so doo doo to me when I compare it to how satisfying, smooth, and complex, games like Tekken and Soul-Calibur can feel like. I swear even Soul-Calibur 2 from the PS2 era feels way more clean of a fighting game than this game and if you don't agree guess we just value different gameplay. Should have went with my gut feeling after I tried the demo for it 2 times but decided to cave in since it was using the new RE engine and like I said I respect their other games they have made on that engine. Unfortunately my gamble on this game didn't work out. Tekken and Soul-Calibur will always clear.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really enjoy the game, but I wish matchmaking didn't error/time out all the time and force me to start it up again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game just doesnt work.\r\n\r\nI get constant issues of button presses or holds just not being read by the game. Making links a simple as standing mp to crouch mp unreliable at best, giving me two standing mp instead. Ive had multile times where spamming drive impact to respond to another drive impact lead to literally nothing happening.\r\nYet when I play other fighting games to see if its me or my controller, I dont get these issues.\r\n\r\nThe connection is weird. When I get games im fine but after 2 to 3 matches the game becomes incapable of connecting with anyone, leading to constant errors untill I restart the game, where i get another 2 to 3 games before repeat. Some days it just doesn't connect at all. This is the only game where I have this issue.\r\n\r\nEven if those issues werent a thing, the core game mechanics make it a frustrating experience. \r\nThrows are too dominant, causing almost every oki to be a coin flip as to whether you take damage or not, with drive rush making it worse by making most attacks plus on block, so it happens in neutral aswell.\r\nDrive impact just feels cheap. Everyone getting an armoured attack they can throw out whenever probably wouldnt feel as annoying if it didnt grant full combo's because you pressed a button or failed to pass the 'unc' check by pressing their own DI in time, assuming the game didnt eat your input...\r\n\r\nOverall the game makes me feel like im sitting at a dodgy slot machine where the buttons sometimes dont work and it randomly turns off. So im out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ive came back to this game to see if i could get good at ranked cause why not and holy its literal hell, the drive impact is so annoying to play against and can be spammed way too much same with grab attacks, range attacks are awkward to dodge on a controller and for a new player it feels impossible to climb.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In short, less than a month after Windows 10 support ended, but while Microsoft is still doing security updates, Capcom retroactively stated the system requirements for this game would not include Windows 10 and the game might stop working, even though it was sold as requiring Windows 10, and still shows on the store page that it supports Windows 10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The arcade mode is okay - more or less a typical street fighter game - but world tour is awful. You're constantly grinding to up your stats to follow a rubbish story which barely features actual street fighter characters. Think a GTA game but you have to fight lots of random people for no reason other than to boost your stats, as well as doing missions that are not fun, and you have to fight in street fighter style fights but often your opponent is so overpowered you more or less can't beat them without using multiple power ups throughout the bout.\r\nIf you want a street fighter game, play the arcade more, or the versus mode, but the world tour is just awful. If I buy a street fighter game, I'm not looking for a bad RPG, so why provide one?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keeps opening a digital keybord and i think copilot when i exit arcade games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "How can I endorse Capcom's current business model? The game should be one price for all the fighters, and then optional paid content in the form of customization. Anyone that endorses this style of f***ery is a part of the problem.\n\n The base game is fun and the campaign was unique and enjoyable for a short time. However the content is shallow and cheap. They didn't seem to put a lot of effort into the story mode either. The create a character is the highlight of the game. \n\nCompared to SF4 this is a downgrade.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL:DR if you are thinking about getting into this game late don't bother, unless you grab an edition with every character unlocked otherwise this game will not respect you\n\n\nI originally played this game on launch and it Was quite the fun little fighting game, I was coming in from street fighter 5 so I wasn't new to the FGC, i recently took a break from this game and upon returning I can say it is kind of a shame how little the game respects you if you aren't willing to blow money for every character in the game.\nwith 18 base roster and 10 DLC character\n\nthe controls are fine with classic and modern a hot debate i'm sure, But the main issue for coming into this game at this point in time, is there is a fundamental failure of training options for DLC characters if you wish to play online, Otherwise it's fine, have fun against the Ai in world tour it can be fun no doubt\n\nBut for a primarily competetive online fighter it feels like my time is being wasted as soon as a DLC character enters my screen, as some concepts are either conveyed poorly or not communicated at all, \n\na few examples I have faced are with akuma and Ed as of right now, Akuma seemingly presses buttons and specials which are all safe or plus (I don't know I can't really test them at all) ed is supposedly Minus on a lot of their buttons as the replay reviewer says so but I cannot actively test when the Block stun ends so as far as i'm concerned I cannot contest any of them\n\nmy time feels actively wasted when a character I am barred from knowing enters my screen. and with some of the more intricate and legacy characters being DLC you see DLC A LOT like more than most, there is a large amount of DLC presence in this game versus vanilla characters\n\nI originally thought that rental fighters were a good way to remedy this but if i only need to test one thing, and fight another terry after the hour passes I need to spend another one and they are not very common in my experience.\nadditionally I would also have to learn the characters enough to set up situations that i got in to test them from complete scratch \n\nwhile I do not regret my purchase for the time it gave me on launch this game is longer worth my time as it does not think I am worth theirs. if you plan on following it religiously it can be fun for you if you plan on buying the base game and playing some ryu the game will not make you matches easy by any means with obscure frame data and a lack of options to expand understanding",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is brain dead. \n\nStreet Fighter 4 is the last good Street Fighter game. \n\nYou might play this game and think you're cool and bad ass playing a fighting game but you're actually just ice skating at each other with drive rush and taking turns getting lucky making you think it's somehow competitive. Competitive coin flipping maybe. Competitively rubbing your bomcheeks on the controler maybe. \n\nEven if you ignore the plainly dumb stuff like modern controls, drive rush, drive impact, throw loops, total corner carry after the first touch which I can't ignore because they're dumb, it's still dumb. \n\nAfter playing Street Fighter 4 there is no way you can play this without feeling like you're being completely robbed of what a fun experience fighting games could be. \n\nIf you enjoy winning without using one single brain cell then pick this up when it's on sale, for 50c in the year 2035",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "what's the point of learning and using modern control if you are going to punish the player with less damage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First, I do like the game, it's one of if not the best fighting game I've played.\n\nBut the pricing is off the chart. You get only 18 characters, and no way to unlock new characters unless paying. That's fine for me if only I can practice against dlc characters I didn't buy, just like some other fighting games have done. This killed the competitive integrity of the game, making it somewhat \"pay to win'. (In fighting games, you need to \"lab\" your opponent's characters to improve, that's why having access to all characters in the training mode is crucial for a fair competitive fighting game)\n\nLast, the wokeness is a bit too in your face. I've played a lot of woke games, this one stood out.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "if you love getting grabbed nonstop and just guess every two seconds this is the game for you!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "its fun except the core mechanics suck and make the game a mind numbing experience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got this game alongside SFV and played both so this isn't some rose tinted nostalgia trip, but SFV is just better in pretty much every way that SF6. The artstyle is nicer, theres way more characters and stages, the combat feels smoother, less clunky, even the story which has never really been a draw for sf games, is better in sfv. The multiplayer is slightly less active but by no means dead, and I had plenty of fun playing against the higher difficulty cpus. If both games are on sale, just get sfv.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Locking DLC characters behind a paywall more than twice the games original price is horrendous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ending support for windows 10 is lame",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The Artstyle is like someone left their Toddler alone with spray cans and crayons. Its that kind of stylized amateurism that can ruin a game because its hard on the eyes.\nAlso:\n-small base roster\n- classic legacy characters as DLC",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "You rarely (if ever) fight a street. You spend most of the time fighting a man (or a woman). May I suggest renaming the game to man-fighter six. But also since there is no man-fighter 1-5, maybe just 'man-fighter'.\r\n\r\n1/1",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is the worst  SF game ever made for people that want to be good at fighting games. Your opponent will make grievous errors and then end up in positive situations. It feels like the only thing that matters is guessing right and not playing well.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Jogo é bom mas ter que pagar 150% do preço do jogo pra desbloquear 4 personagens novos é ridiculo.\r\n\r\nRankeadas no inicio levam quase 40m pra achar 1 luta, depois que você sobe pra pelo menos prata fica mais rapido, no ouro leva algo em torno de 1-5m.\r\n\r\nPersonagens quebrados, quem diabo pensou que o JP era balanceado? Não adianta comentar sobre quem joga de Cotoco com Mei, Ken(Jinrai kick infinito) ou Spamando Sonic Bom com o Guile mas pra resumir, Ouro pra cima é disputa pra ver quem espama mais os special e da DI mais rapido, só.\r\n\r\nVolta e meia aparece alguns hacks com DI perfeito, Parry perfeito(Todos os golpes sempre) e auto grab e etc mas é tipo de 50 lutas 1 é hack.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Modern players ruin the game. No respect for the genre and overall no respect for themselves. It’s sad such a good game is littered with such filth. I’m new to fgc and I run into modern 8/10 matches. Going to tekken.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Couldn't find a character I thought was cool and I don't like the modern or the classic input feel.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it doesn't feel very satisfying to learn anything new or to rank up or nothin\r\nfatal fury better",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "once you enter you are bombarded with non sense boring woke dialogue, and with no actual guidance on how to play the game. plus servers are empty so u have no one to play with",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Anybody ever told Capcom that 2D fighting style and 3D universes don't mix?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not the Street Fighter we grew up with 🤨.\n\nSF always had two types of characters, charge and input.\n\nNo more charge characters like Shadaloo Vega and Balrog. No longer is Bison charge too.\n\nI tried to like it, no. I want - and sure others out there as well- want OG Shadaloo back 👏. Please Capcom.\n\nNot fun 👎.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "oh i'm sorry, i can't save between your spam bot \"HOW BOUT THIS\" tournament competitor and the second peasant creature? fuck you",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't even save settings properly without having to do some digging in the files lmao",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nice capcom ! Did nothing for Street Cheater™ 6.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game has the potential to be the most entertaining fg in the last 10 years but the devs refuse to update it’s enraging inconsistent input system and broken throws that make 40% of the match boring. not to mention the way they treat their pro circuit has made me lose all interest. only buy this overpriced doody water if you love watching something you love be neglected",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you can only play online with a vpn, and then your ping is too high to get any matches, single player content is just fetch quest, art direction is ass, pvp is drive impact > corner carry > throw loop repeat and modern zangief insta command grabbing\n\ni cannot believe you have to pay for this experience this genuinely might be the worst fighting game ever made",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game keeps crashing and is bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I just dont get it,why dlcs overprices like that.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Terrible game do not recommend if you love your life.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this games campain is so fucking annoying all the ai dose is spam",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What shit game can't support win10?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "World tour with monetization were mistakes",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Genuinely one of the most uninteresting games I have ever played",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ad micro transaction",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Trash ass game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pass a certain rank it aint fun no more",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game too hard 4 me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no thanks. i'm good",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Jamie Player",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too much guessing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "meno fanservice plz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "play spelunky two instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a ripoff",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nerf throw loops",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "ts frickin sucks",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sleep Fighter 6",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sh1t\n\ngame",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "slop rush 6",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "f",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dlc characters are too expensive. Not everyone lives in a developed country. There's no way to grind coins. Noly option is to buy. Put some add in the game and allow as to play and earn new characters",
      "voted_up": false,
      "votes_helpful": 286
    },
    {
      "review": "So basically Street Fighter 6 is: you pay 60 bucks for the game that have less than 20 fighters.\nEach character pass includes 4 more fighters and it cost 30 dollars, in capcom mindset making 4 characters equals 50% of the work (according to prices) that develop a full game costs.\nSo that's 30 dollars per year plus the waiting to get the actual fighters with no free way to unlock them by playing the game (as it was the case with Street Fighter 5)\nAnd finally any cosmetic DLC that you want cost real money that equals the price of a full game so tbh, despite how good the game is, who could recommend this when Fatal Fury is on steam for the same price and you get all the characters for free.",
      "voted_up": false,
      "votes_helpful": 304
    },
    {
      "review": "Gamewise, it's fun enough. It also has a great training mode, good netcode, lots of single player content...\n\nIt's the other stuff that bothers me. Feels like SF6 is consumer unfriendly and a little out of touch. You have to buy an excess of in-game currency to get 1 DLC character, Capcom recently decided to make tournament viewing a pay-per-view experience, and updates feel stale IMO.",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "bought the game for nostalgia reasons, remembered standing in line to buy SF2 / SF2Turbo on SNES, expected some fun.. it's some fun,  but pay to unlock characters, and outfits, no thanks, i'm no longer buying another capcom game let alone SF brand.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "I'm not going to sit here and pretend that I don't like this game, you can see from my playtime that I very clearly do.\n\nStreet Fighter 6 had one of the smoothest and most successful launches of a fight game ever but unfortunately Capcom has been fumbling most things about it since.\n\nThen to top it all off they recently announced that Capcom Cup will behind a Pay-per-view paywall for the first time in it's 12-year-history. It's complete BS for more reasons that I will bother making you read here, but think of it this way; it must be pretty bad if it got me to write a review after all this time and make it negative.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Imagine if in Tekken they made Kazuya a DLC character and made you pay $20 for him\nImagine if in mortal kombat they made liu kang a DLC character and made you pay $20 for him\nImagine if in KOF they made Kyo a DLC character and made you pay $20 for him\nImagine if in Soulcalibur they made nightmare a DLC character and made you play $20 for him\nImagine if in Super Smash Bros they made Mario a DLC character and made you pay $20 for him\n\nImagine if you bought a game and half of it is locked behind an almost $200 pay wall",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "the game itself is only the entry cost, everything after that will cost you eventually way more than the game itself",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "The game is fine, the problem is the company behind. For almost everything you have to pay the MACROtransactions, now even to watch tournaments they want you to pay for it. We are back to the Capcom from the SFxTekken era, but even worst now. \nFighting Game Community was always about the community trying to promote games, sharing content and knowledge about them, explaining mechanics and different ways to play or learn, that's why we have places like Dustloop, Mizuumi and Supercombo, websites that share countless info about several fighting games, which can be used to help anyone who wants to try a new fighting game (which can be a popular game or a very niche one) or simply learn more about it. There's also several Discord severs with the same purpose, with highly focus on helping players to find a match for them on their favorite fighting games. That together with the rollback netcode was one of the biggest bless we could have in this community. On Youtube you can also get several streamers and channels to watch combo videos, tutorials and tournaments all around the world.\nNow, Capcom, the company that is pretty much the biggest one on fighting games (on popularity and in number of players), is going against everything FGC has builded, charging for people to simply watch the tournament.\nCompared with the other genres, fighting games aren't that big, but now is bigger than ever before. However, sometimes I wish it was less popular than what it is now, just to avoid these bullshit that companies do when they grow in money and greed.\n\nKeep supporting your locals and the tournaments that people make with their passion, and stop supporting whatever Capcom is trying to throw at you with these abusive prices.\nI will keep my negative review until Capcom change their mindset, even knowing that I make no difference on this, but at least I'm doing my part on what I think is right.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Whereas the game mechanics are relatively well thought out, almost none of the characters feel genuinely fun. I really really enjoyed SF4, SF5 was already worse, and SF6 feels like an upgrade and downgrade at the same time. The battles don't play smoothly (at least for me, with a 4090!!!) and overall, it feels weird. I dislike the character designs / the artistic choices made.\n\nYet, what TOPS everything is the absolutely aggressive DLC strategy. This game attempts to rival the Sims in this regard. EVERYTHING costs REAL money. It's disgusting. Paying 50€ for 4!!! characters is absolutely bonkers. Don't waste your money, and play some Ultimate Edition coming out in 10 years.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Capcom has created a masterpiece of a fighting game with Street Fighter 6, but it's impossible to ignore the elephant in the room: the relentless and predatory monetization. We paid full price for this game, yet Capcom treats it like a free-to-play title, constantly dangling cosmetics and other content behind expensive paywalls. The use of premium, confusingly-priced currencies is a scummy tactic that has no place in a premium game.\nThe disrespect for the player base reaches a new low when considering the esports side of things. Instead of celebrating the competitive community, Capcom forces fans to pay up to engage with the Capcom Pro Tour and other championship content. It's a blatant cash grab that undermines the very spirit of competitive gaming. The fun gameplay and strong mechanics are overshadowed by a feeling of constantly being nickel-and-dimed. This is a betrayal of consumer trust and a stain on an otherwise excellent game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Rage inducing and pay to win\nOnce the honey moon phase is over you start questioning and nitpicking on the devs directions in balancing and the games mechanics (reversals not being good and how some reversals are much weaker than others, throw loops, having to input for a drive rush like why cant it be made up as a button I can go on and on on the games shity mechanics), also not all characters are viable so be ready to be a meta picker in order to keep the enjoyment. (I shouldnt have mained lily but I wanna main rashid next as he's quite intriguing)\nOverall its a weak introduction to the street fighter franchise and Id rather have tried sf5 first, cause it looked more offensive unlike sf6 and every character was somewhat viable there.\n\nto keep something out: modern aint really that op, its just makes it easier to react and do combos. It is a great addition for new mains or new players.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Love the game , but Capcom just made a the capcom cup pay per view 40$. its cheaper to buy this game than watch pros getting throwlooped into infinity ... Good job on isolating half of the world for some greed.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "As a long-time fan of the series, I wish I could give a neutral rating here on Steam. Unfortunately from my own experience I honestly can't recommend this game in it's current state. I keep trying to like the game, but the more I try, the more I regret my purchase and hours wasted. I purchased the Year 1 Character Pass due to the enthusiasm at launch but they will not get any more money from me for this game until I see some worthwhile game-play tweaks.\n\nThis game is not for casuals, myself included. The game is offense heavy and seems tailored to entertain with flashy extended combos. Watching competitive play is OK but actually playing can be rage inducing. \n\nGraphics, while nice, don't always make a game good and that is definitely what we have here. The input system is downright awful. Character balance is hidden behind the cheaply implemented drive gauge mechanics, boring throw setups, and a stiff input system that favors light attack spams. I spent enough time in training mode looking at frame data at normal and reduced speeds to confirm what I was seeing and feeling during game-play. \n\nBeing pinned in the corner is the worst I have ever felt in a Street Fighter game, and this is going back several games in the series. Some characters have insane corner carry so one whiff punish will have you nearly carried into a corner situation with a huge chunk of your life bar gone.\n\nI suggest anyone interested in the game spend some serious time playing the demo, watching videos, and seeing if you are OK with the feel of the game-play. The 'World Tour' mode was interesting, and helped explained some things, but really won't help you defeat the input system.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "pros:\n-great battle mechanics\n-great visual design\ncons:\n-while the world tour mode is novel, the story is a whole lotta nothing, and the quest design is boring\n-on top of paying for the game, you have to buy season passes if you want all the characters\n-the battle passes are lacking\n-even on lowest settings i have performance issues\n-music is hit or miss for me\n\ni love and hate this game lol, i just wish capcom would be better about some things",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if you are not from japan dont bother getting into this game. the biggest tournament of this game capcom cup is just made pay per view because apparently paying to watch esports is welcomed in japan.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Um jogo onde você tem que comprar 2 pacotes de 250 FC pra comprar UM personagem não existe.\nLiteralmente uma das práticas mais predatórias que existe, não tem respeito algum com o player.\nVão pro tekken que lá eles vendem os personagens separados por DLC.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EVERYTHING is locked behind a paywall. I don't care how great of a game it \"might\" be, This is bullshit! I'll never support capcom or this franchise again! Sad, as I've been with this franchise for well over 30 years. What a joke!!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I’ve spent more than $200 buying all DLC up till season 3 and even again for the Switch 2. The game is great and fun but I’m not paying $40USD to watch Capcom Cup.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "throw loop, drive rush, etc also like your not fighting the player your fighting the mechanics instead imo, game design for people who play with their brain turned off, i don't get how ya'll enjoy this game when all ya'll doing is throw looping and drive rushing with no neutral, and to the people who think this game is perfect ya'll are stupid",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The greed this company game company has (mostly for the street fighter franchise in my experience) is unbelievable. The UI is cluttered and confusing. At least the gameplay feels somewhat refreshing...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Microtransactions in a full price game with scheduled very expensive DLC on top.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the \"modern controls\" absolutely ruin this game. anti-airs, projectiles, all that done with just one button instead of directional strings to start. the damage is lessened but barely at all, and it doesn't even matter when you can just spam buttons to combo and win without the hassle of startup/end lag or any stun frames whatsoever. specifically zangief is just way too op, he already does an insane amount of damage as is, but with his command grabs now just at the push of one button it makes u forced to zone and playing like that is no fun. awful game for the sole reason of modern controls",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game feels so much boring compared to the older ones, it so streamlined and so weird that I am playing a weird version of an Air dasher without the air dashes. \n\nYou can insult me if you want to but this game doesn't feel like street fighter anymore, these throw loops, Drive rush and impact are just so stupid as mechanics, the fact that every just feels awful to play. \n\nAnd why are we allowing people with master controls into Ranked? what's the point?, so the effort that I put in learning a character can be thrown away because some person decides to play with easy mode... so what's the point of playing the game the correct way?. Still need to learn the basics but it takes away like half of the point and the fun part of a fighting game. \n\nIn my opinion I don't like it, if you do like it power to you.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm not sure the menus in this game could be worse.\r\n\r\nGameplay is great but I cannot be bothered to fuss with all the menu layers, network connection waits, and unreadable fonts.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gameplay is good, I really liked this game for a while and want to get back to it but the lack of access to the DLC content is a huge turn off, particularly the price. Characters and stages are just far too expensive for me to be able to afford or justify if I could, even when on sale and on top of the game itself. There's rental tickets and all the characters are approachable and moves available in the world tour but I still feel like I'm limited and/or missing out, especially with stages and costumes. Don't care for battle passes and there is no exception here.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "easier to understand & more balanced than tekken. asides from that, tekken is better in every way",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I like this game a lot. There are certainly some valid criticisms of the game, but it's a quality product. Lately though, It isn't being shown enough of the care that it deserves.\n\nMy reason for review bombing is that I dislike the Capcom Cup PPV streaming model. Let the stream be free as it was before, and until the end of the Capcom Cup series, please. As-is, the PPV stream model seriously hurts the community of the game. You've probably heard all the rest about this topic.\n\nIf Capcom wants to charge fans for a PPV livestream model- keep the stream free, and instead offer PPV as a \"premium\" stream. It might have less advertisements, and exclusive stream content to cover downtime. Why not have exclusive SF6 game content for Battle Grounds. i.e. Character colours and, perhaps OUTFITS!?!? (Remember SF5's character outfits designed by CC winners? Cool, right?) \n \nCapcom, if you're going to charge fans money to stream professional play, you must offer an experience that has an actual value proposition. \n\n!!!   LET  THE  STREAM  BE  FREE   !!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "All the plagues of contemporary games. If you want a good experience go play a game from at least 10 years ago.\n\n> base game is 40€, each base update is 30€ (ultimate is 50 wtf) so at least 40+30+30+30 = 130€ \"full\" base game for now.\n> Launch the game, lose 10min of your life creating a Capcom account to sync with steam with all the password double security check on, so on so they can spy on you.\n> 2025 the game do not auto recognize your screen is 4k and launch in windows mode 1080p\n> lose 5 more min in the trash settings.\n> Over accessibility to make the game easier, 6 buttons classic gamplay is too hard apparently, they think people are dumb so the simplified it and made shortcuts and breaker. Loss of depth evident. At least you can still play in classique controls.\n> Every mode have unskippable tuto... because you can't understand 6 buttons and 4 movements.\n> You can unlock stuff and gear for your characters, but everything is made confusing with a slow progression to frustrate you and push you toward microstransaction and season pass...\n> of course it was made before Concord, so all the cringe ridiculous design of new characters for a \"global modern audience\", Type1/Type2 body BS, is here to an rarely seen extreme, They even stolen the character from Chris Tucker in the 5th elements for no reason excepted pushing some clear \"fabulous\" cliché agenda.\n\nA shame because the production quality is in fact great. Just imagine what they could have done if they committed all their ressources to having efficient navigation in the menu, no time wasted on pointless introduction and weird design, obscur microtransaction and so on , add more characters and new mecanics to add depth instead of removing it...",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "It is a good game for veterans and newcommers, but it is agresive charging for most of the extra stuff, and now they decided that they will charge pay per view for the capcom cup 12. That's insane.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you buy for single player, do not buy this game. The single player actively killed my love for this game so fast. It is tedious and if you love street fighter like I do, it will burn you out faster than just learning to play with others online. Play for online, DON'T Play the SINGLE PLAYER IT IS AS  BAD AS OTHERS HAVE MADE IT OUT TO BE.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game has potental, it really does. But there are a few issues, I will start with what I enjoyed and then follow with what I did not like. \r\n1. World tour is alot of fun, it is rough around the edges but I enjoyed it.\r\n2. Practice mode has so many tools that are so useful for learning. You can set up any scenario and practice it over and over. \r\n3. The net code is really good. \r\n\r\nNow the things I did not enjoy\r\n1. Cheaters and capcoms lackluster response to it is dissapointing and the main reason I am giving a negative review. It ruins the fun of the game, and is just sad. \r\n2. I am not a fan of the reactive type gameplay loop they have created. Let me explain, in a match I have to react to DI, DR, DRC, Jump in's, and character specific move's. Honestly the elements are fine separately  but together they create a soup of annoyance that I am just not a fan of. A solution in my opinion would be to delete DI, DR, and DRC. That would fix most of the issues for me. \r\n\r\nThese two issues are what really bogs this otherwise great game down. But if you enjoy this, have fun but it is not for me I think.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}