{
  "positive": [
    {
      "review": "100 hours in, I have not build a Dyson sphere nor Dyson swarm. Great game. Would play for another 1000 hours.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Dyson Sphere Program is a factory building, FPS+3rd person (shoulder view) type game that gives you that thrill of building mega factories, endless hours of calculating ratios and maximizing efficiency to become the best factory manager you can be,\r\n\r\n you start playing and a few hours later you realize it's already 2am and you haven't had dinner yet (your mom left it in the fridge and now it's cold... you need to microwave it), it's that game you say \"just one more small change and I'll put it away\" and now it's 3am and your wife is sleeping with your child in the bed and will be angry at you in the morning - you know who you are ;-)\r\n\r\n so go buy it now - what are you waiting for ??",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game has came a long way from where it was when I first purchased it. Im really pleased with the new mutithreading update. Im hitting the point where my game would typically have ground to a near halt and im still running nearly as smooth as when I started.\r\n\r\nThe dark fog was also a welcome addition to the game in my eyes, and I have found it to be a lot of fun to increase the dark fogs strength to increase the strategic difficulty. Im really glad you gave the player the ability to customize that for their runs.\r\n\r\nGreat game overall and looking forward to what else is in store!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "DSP is the one of the best factory games on Steam, HANDS DOWN! This play great on the Steam Deck. All I need is more content. Can’t wait for space stations. I do wish there was auto travel while in space. Other than that I don’t have any complaints.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A good and very addicting space factory builder with a lot to do and some pretty big freedoms that come with it.\nWhen you give me the ability to make Pandora a perfect sphere of sheet metal to smelt the perfect amount of copper plates say less. \n\n500 hours in and still continuing the global and solar harvesting off all resources to unlock more reliable ore vein harvesting research!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is not for the faint of heart. Much like Factorio, it is squarely designed to convert time to conveyor belts and there will be lots and lots of those. Recommended if you are prepared to spend at least a 3-digit amount of hours on it to get familiar for a playthorugh.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Dyson Sphere Program is excellent.\r\n\r\nWhile the [i]actual[/i] Dyson sphere is mechanically shallow and essentially just a platform for player art, the steady improvement of production lines and networks to reach the end product of the game is delightful. The Dark Fog, an optional and optionally hostile force, then spices things up with a periodic wave assault with intensity and cooldown that depends on how offended they are with you, until you eventually develop the technology and force to evict it from your world, worlds, and the planetary system - but just stare up into the sky once in a while when the Hive is in line of sight, and you'll see a truly daunting task for the future.\r\n\r\nThe universe and its planets and moons are also great to look at, at least until you pave over everything with grey foundation.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My little guy has no power and all the hydrogen in the universe and 20 hours later I've used up all the hydrogen and still have no power.\n\nI love it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A fully featured, insanely detailed, expansive automation game that has warped beyond any expectations I have with an early access game.\n\nI’ve played the entire time on the Steam Deck, colonizing multiple planets, setting up interstellar trade routes, and fighting the dark fog without much of a hitch. Stunning graphics pepper the layered gameplay, and find myself snapping screenshots whenever possible.\n\nIt can be overwhelming at first, but the built in tutorial will game you some loose goals to learn the mechanics. Absolutely recommended in its current state.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game to sit back and relax but also allows for basic combat which is nice. This game got me into factory type games, as I never thought I had the patients for them, and got me hooked for hours.\nBuilding a Dyson Sphere is difficult and takes a really long time especially depending on your knowledge for efficiency. Finding the right seed can help a lot with this because some star systems either wont have everything you need, or you'll have the venture vast distances to fine some of the more rare materials. The distance can really be a problem if you don't have warp drive or the patients to fly for thirty minutes, give or take a few. \nI was venturing into a solar system that had a flight time of 1 hour and right in the middle of it I ran out of fuel for my mecha. This took the distance to a whole new level, after flying for 30 or so minutes I had to reload a save because I was now stuck in space. While this isn't a problem with proper planning it still shows how necessary picking out your solar seed when starting a new game is important. A unique grid system inside the spheres are interesting so you better know where your north and south poles are so you aren't going to make mega structures, or blueprints, be placed in awkward situations where it reduces efficiency or even the ability to place blueprints.\n\nThis review may sound like complaints but its quite the contrary. This game is beautiful, peaceful, and sounds amazing. Proper planning is the number 1 rule when leaving your home planet 100%, and the distance can be annoying in the beginning but right after you get warp drive the entire map feels much smaller.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's not too bad honestly, a pretty interesting take on the concept of base management and factory building games. Sad to learn there wouldn't be multiplayer, but might be willing to pick it up again should that change.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the pillars of the genre. It's a bit simpler than Factorio, but the visuals are on another level. Seeing your factory grow across the stars is unmatched. 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Warning, this game is extremely addictive, It'll grab you by the balls and never let go like it did to mine. Idk what grass looks like, everything is concrete, there's belts everywhere. I look at the sky and there's a massive Dyson ball. Or it's full of ships going all over the place. The only thing that matters is that the Factory Must Grow!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like space and think you might be interested in the automation/factory genre, go for it. Prepare for 4pm to turn into 9:57pm without looking away. Great graphics and amazing space-feeling. Music's fine. Not difficult or punishing; features some enemies, though they aren't a huge threat most of the time. Extremely rewarding progression. It's hard to get a feeling of accomplishment like this from most games. If you like to look at systems and find inefficiencies and then redesign and then improve your technology and go back and apply your new techniques to make everything flow better and move faster, you will have so much to do in this game that you'll have to tell yourself to stop playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At the time of writing, I have 12 hours in the game.\r\nBy the time you're reading this, I probably have >1000 hours in this game.\r\n\r\nThis game is the mother of all automation/factory building games. Factorio is its most relevant comparison, but even Factorio does not match the scale and expansiveness of Dyson Sphere Program.\r\n\r\nEarly access, and already more complete than any other game in this genre.\r\nStrongly recommend if you are looking to spend an unbelievable amount of time in the pursuit of the amazing Dyson Sphere.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the game that started my obsession with Automation and Factory games. Love everything about this, and how it has grown over the years.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "something about interstellar logistics just tickles my brain and this game does it beautifully",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is beautiful and can range from hardcore to artsy... a great builder that can get overwhelming at times, but has great tutorial mechanics. Learning how to make or find quality blueprints can also be daunting, but, in time, it can be very rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "interplanetary logistics are the best part of this game.\r\n\r\nThe worst part? the building grid is extremely weird and builds that work in one place might not work in another.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing the game normally at 8:00\nOh crap, the entire star cluster is out of power!\nFix issue.\nCrisis averted at 8:30.\n10/10 productive use of 12.5 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I played this back when it first came out in open beta, I feel like the addition of enemies ruined the game, very glad that they made it optional.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game, I dare say better than factorio. I hope that this game continues to grow and be added to!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to relax too. build one line of production at a time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting the blue cube, pretty alright. Getting the red cube a lil harder. Yellow cube okay this pretty hard. Purple cube, my brain cannot comprehend this. green cube, nope i am not playing this anymore. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glorious and far reaching logistical structure! Wife started playing this as well, and suggested another friend check back on this since they added Dark Fog. I didn't play before that, so I can't compare, but the challenge with the Dark Fog is a wonderful bit of motivation that keeps me wondering how the future will go with this. Setting up logistical systems on a planet was interesting, especially when things reached limits, ores started to run out, etc. But when you throw in logistics for the system? Its a whole new game. And then... reaching out beyond your home star? Holy crap! And always, the Dark Fog lurking in the shadows, trying to catch you off guard. Yeah... this is going to be a long labor of love for sure!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Though it takes a lot of time, it's very immersive.  Good way to spend a cold wintery day!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Can you make it playable for Steam Deck? \n\nFor those who want to buy, it Factorio but even better, love the theme, the technology, the vertical and horizontal stacks. It may be EA but really it's got a lot of content, deep systems and a very active team that release quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game, but hate the combat/hive addition. I just play without it, which is an option thankfully. Not many games accommodate choices like that these days, and I really appreciate it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great game, the only thing i would add is a way to mine ore indefinitely like asteroids or asteroid belts or even deep core mining on planets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm really enjoying the game so far. There is a large variety of items to make and types of infrastructure to build. In game documentation is easy to understand.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of, if not my favorite game. Its such a fun factory game and seeing a Dyson sphere build in front of you at real time is one of the coolest things i've ever done in a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome. So stable, bug free. And devs still have big plans. Comms are not often but when they do, it's detailed and great. Love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an addictive game. It's very important to know that if you're coming from Factorio or Satisfactory, the logistic is not the same. DO NOT make bus or long belts. You're supposed to quickly switch to PLS (Planetary logistics network) to create modular factories. After that, you're ready to leave the starter planet and bring the next level logistic, the ILN.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun. A bit complex but the right thing if you like automated production chains, a 3D enviroment and a bit of action",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely polished, fluid gameplay, fun progression, recently added PvE elements, cool seting, good graphics and a soundtrack to match it. Highly recommended position for all enjoyers of the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Очень приятная игра для любителей факторио подобного геймплея, разработчики активно продалжают ее развивать выпуская новые обновы и не забыва.т про оптимизацию, так что однозначная рекомендачия",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dyson Sphere program is one of those games that I keep coming back to over the years as the developers continue to add features and improvements or I just want another go at it.  At base it is a solid factory/builder game that adds the interesting dimension of managing a resource gathering and manufacturing effort that spans worlds and stars.  Plus, sometimes I just love the feeling of paving over an entire planet with foundations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, 1000 Hours and never truly finish the game... \nJust start new game, build, my PC become too hot.. Start new game, again...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played 100 hours of this game in the last three weeks. I stopped playing just because my computer was not able to keep up with the growth of my dyson sphere. If you have time, I 100% recommend playing it, if not, wait for the next vacations because it will completely overtake your free time. 10/10 recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing gameplay,soundtrack and still updating with better and more feature",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game rules! We get you addicted and consume a lot of your time as well :D!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, always seem to come back to it when i just want to chill and industrialize a galaxy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't believe this game was made by 5 people\nI can't believe this game costs 15 bucks\nI can't believe this game is in Early access\n\nThis is one of those that giving a 10/10 doesn't do it justice enough. It deserves to sit across kings of the genre like Factorio.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my favorite factory building games. The addition of the Dark Fog just made it that much more fun. The building mechanics are amazing and the graphics are top notch. I look forward to any and all new additions to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addictive.\nThisd game combines good graphics and good gameplay which its compatotrs lack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game that will suck you in and make you realize you played for hours. It can be slow and over whelming at first but the more you play the more you will have fun with it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent gameplay. Complex and engaging multi-planet factory builder with option combat mechanics for those that want it (yes you can opt out of combat during session setup if you choose to do so). Superb graphics that give you stunning screenshot options from actual gameplay. Fully customizable mech to make it look the way you want it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "300h in, waiting for some significant update, but what is there is already a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid factory sim that can take you for many hours straight if you like this type of games. Large galaxy to explore/exploit as you see fit. As a Satisfactory fan, this one is awesome too, a bit different yet great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has been in early acess in a pretty long time. Nothetheless, it has a pretty good gameplay with it thus far, with some the devs still adding/refining some of the other aspects (see: dark fog update) and game optimizations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From my opinion, one the best factory builder game. There is a lots of invation through the research tree. You can set enemies to be aggresive or passive, farm them for resources or turn them off. Every playtrough is a new experience and its teasing your brain to find a solutions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Outstanding game with rich graphics and possiblies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Automation Game ever made. Played hundreds of hours and is still fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No bugs, no micro-transactions, an almost infinite space to expand, optional enemies, a growth system for both you and your enemies, exceptional performance even with giant factories. Simply perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a really interesting factory game with few  undercooked mechanics (enemies in particular need a major overhaul which might be coming with the upcoming vehicle update). In contrast to factorio, the finite size of planets brings different logistical considerations which I find as a refreshing change. The actual goal of the game is to build a Dyson Sphere and it requires a lot of patience and resolve. At the moment of writing this review I am at the point where I am about to start working towards this goal, and I feel that the factory building is very fleshed out and worth it even if you do not plan to make such endeavor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super great game. If you like factoria or captain of industry this is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I prefer this aesthetics and the goal over factorio or satisfactory, really good automation game, will be better when they release it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and engrossing, definitely a lot to the game. If you're new, consider turning off the dark fog for the first run so you can actually figure out how to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice automation game with attention to details.\r\nI find it friendly to the player, and stable as well - no need to go to discussions forum to find out how to do something, or to complain about bug :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, always a fan of factory building and defending yourself against a growing enemy.\n\nOnly thing i wish is that it had a multiplayer/co-op mode so i could play this with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game with tons of replay-ability. No DLC microtransaction bullshit.  Many great updates and fixes.  This is a great simulation  and logistics game.  Wrote a thesis report using the grid system and optimization for placement and movement for facility design using this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if your into space and like slow, thought out progression with item handling then this is a great game for you. Although this is a time-heavy game and its not for everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, really fun to play. Only needs a Satelite/Radar camera system so I can actually preview the world I already have stuff built in when I'm on the other side of my cluster to not lose 10 minutes travelling just to see a coal miner died on me. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, can start getting overwhelming around purple science. I have yet to create a sphere until the game is more optimized (using NTFS compression as a work around for save games), but they're doing a great job with scaling. I've finally embraced DF. Keeps me from falling asleep with repetition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "once this game gets ahold of you, there is no hope for any chance at a healthy schedule ever again.\n\nJokes aside. I really like this game, Bought it a while ago but it failed to take my heart the first time, after a few months of it rotting in the library I decided to give it another shot and everything clicked this time.\n\nI especially like how the game gives you construction robots from the get-go, helps greatly reduce the early game tedium that many other comparable games suffer from (Looking at you factorio)\n\nthe game feels impeccable once you get the somewhat unorthodox controls down and it gives you a set of extremely powerful features to build your factory with, which surprisingly don't really feel like bloat.\n\nMy only gripe about this game is that there's no native multiplayer as I like to play these kinds of games with friends but I've heard there's a mp mod so I might give that a shot.\n\nEntirely worth the price if you ask me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Review as I go:\n(Updated as I play more)\n\n6 hours or so in, still in the early game:\nSo far so good. The difference between it and the other factory games I've played (mostly Factorio and Satisfactory) threw me off at first, but once you're used to how things connect, you're good to go. \n\nThe tutorial stuff is good but can be a little patronizing in the sense that if you are connecting stuff and move, say, a belt into a building the game will give you a little note that this isn't a valid connection and then the tutorial voice will say it and while it is a bit annoying, it only seemed to happen once, it's able to be turned off, and I think it would be helpful for people new to the genre. \n\nThe graphics are pretty good, I like the look of everything. The day night cycle is so pretty sometimes and I love the glow of the buildings. \n\nHonestly, probably the smoothest start to an automation game I've experienced. Quality of life stuff is already built in and it's just fun to do all the little activities the game has. Nothing feels restrictive and most stuff is straight forward. \n\nI have a few little complaints, but nothing worth going into honestly. It's more like usability stuff, like how when you finish a research you get a pop up every time, and I wish the audio guides were repayable as part of the log book. Also some of the stuff is missing from the guidebook. \n\nAll said, so far so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the game that simulates space systems like no other game, of this type at least. Orbits, planet rotation, stuff like that really matters in this game. Another outstanding feature is real time star cluster simulation: the whole cluster is being simulated all the time, this creates an outstanding immersion experience. Overall I love this game, highly reccomended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the flexibility in game play: I can play in sandbox mode like back in the day when we'd \"debug\" a game to get \"god mode\", so I can try out everything or just perfect an efficiency blueprint, or I can try the game as intended against the Darkfog at a level of aggression I'm comfortable with, or I can disable Darkfog  and enjoy the design and complexity of mining the galaxy to build a Dyson Sphere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like most of the builders, but this one might be my favorite. Many of them, like Satisfactory tend to get bogged down at some stage, with the next build being more work than is fun. This one hits the sweet spot of effort/complexity to keep me engaged, but not wear me out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Firstly Ill say this is the first type of factory city builder that Ive played. I come from more Frostpunk Anno type havent yet broken ground in to the Factorio and Terraria yet..\nThe learning curve was decent as first but once you get the flow of things it becomes pretty easy.\nTo keep this short I absolutly love this game. It scratches that itch that I keep look for in my city builders, giving me that feel of a world that I can dive into for hours at a time. Its quickly becoming one of my top played games. Honestly I have to reserve this game for weekends at this point cuz I end up staying up too late playing lol. Check this out if you like city builder/factory/creative type games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first Steam review in over 10 years, and Dyson Sphere Program deserves it. I loved this game. Even though it’s still in Early Access, it feels more complete and polished than many full-price titles, and it has quickly become one of the best games I’ve ever played. The atmosphere and music are incredible, the world is fully simulated, and the depth is astonishing. It’s simple to start, yet over time you uncover layers of complexity that completely draw you in. I can’t recommend it enough—truly a must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its ok. not the best thing ever. ive basically beaten the game hardly ever using a dyson sphere or being attacked and ive only visited one planet because I just didnt need to do any of those things. Combat is far too fast paced, its over in seconds and the turrets on the enemy bases are stupidly overpowered. Also re-charging your mech is painfully slow no matter what you do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Cool gameplay, awesome graphics, lots of stuff to do so it has a very good lifetime. Could use some QoL improvements here and there but apart from that it doesn't feel like an early-access game. 100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a $20 dollar game this might be one of the best values in all of Steam. I'm sure there are 1000's of hours worth of content to be experienced, but the game just isnt my cup of tea. Mandatory Standing around waiting for technologies to be researched in order for the game to progress is not for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game runs very well, over all a nice game.\nSpace travel, flying in and out of planets and how all that works in so amazing best i've seen yet :D\n\nit just gets so boring, i set game to rampage  and  can still fall a sleep in it.\nyou have really cool planetary turrets that can shoot into space but ive play the game for 185h and only had 2 attacks from space first attack sent 5 units and 2nd send 1 unit how lame built many plasma turrets with a large cargo full of ammo but it never gets used.\n\nover all game is so easy, just copy and past sucks....\nyou can only past it back to exactly same area where you copied it from or scale does is off :(\nand when pasting we dont have an option to just \"PAST THE DAMN THING\" and ignore if something is in the way just dont build that 1 building or what ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dyson Sphere Program is one of the very best factory games, allowing you to build stunning factories on a cosmic scale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Biggest con for me is no co-op / multiplayer - the most fun of similar games is playing with friends and family.\nGood progression, good visuals, a lot of unique takes vs games like Factorio and Satisfactory. I love the expanding across many planets and systems where games like satisfactory is rather constrained and only the same exact environment every time. I DO recommend for good gameplay but lacking multiplayer keeps me from wanting to go back or play again.. Time is limited more and more - if im gonna play games, id rather do it with friends or family..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down, for that price Ive never played such evolved game… many others should take an example",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is one of the best value games out there for the amount of hours of entertainment. I thoroughly enjoy enjoy this game and for anyone who likes factory and or simulation this is must have game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless possibilities and great replayability",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, in the automation vein of Factorio. Starting simple and growing more and more complicated, with the ability to tremendously scale up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from Factorio, its really good. I hope the EA acquisition doesn't negatively affect it. If its this good in  early access, can't wait to see what its like when fully released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This automation game has a very smooth learning curve. Easily transitioning from making your first conveyor belt to creating an interstellar logistic system! The tier system for the technology tree help keeps it from getting in over your head too fast. The logistic system is broken up into three main phases which helps to highlight how robust it can be and being easy to understand.\n\nWhile there are a lot of other automation games out there, Dyson Sphere Program has many dev hours put in rounding the corners of the gameplay to make it easy to avoid resource backlogs, shortages, and a great statistics page to view your overall production rates.\n\nOptions to either restrict map resources or introduce enemies with variable difficulty settings helps not only new players, but experienced players engaged and properly challenged!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The games performance has greatly increased after a very large multithreading update. The game itself is only 4gb big, looks incredible, runs very well, and is fun for hundreds of hours. It's frankly an excellent game and the devs are very talented, I'm looking forward to future updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: 90% Satisfactory - 10% Supreme Commander. Good game, not a great game.\r\n\r\nYAY! 60 hours into the game and finally get to start building the Dyson Sphere!\r\n\r\nThe game starts off easily enough to understand. Thing A + Thing B = Thing C, combine that with Thing D and you get Thing E, Thing A + Thing D = Thing.... and so on. If you have played Satisfactory you are going to get the hang of 'Things' quickly, pun intended. The added bit that Dyson Sphere does is add another planet into the mix for certain materials and further tech progression. Up to this point in the game it is fairly straight forward, after about 20-30 hours you should have a decent little economy going with interplanetary logistic routes and the ability to start making mid-level items without effort.\r\n\r\nThen you hit the wall. Mid-high level items take so many resources and you need so many of them the majority of the time you are just rebuilding bases and traveling between planets to get an ever more increasing need for more, more and more resources. Oh and did I mention? The resource nodes run out. Meaning you need find new nodes (which isn't hard) and re-route your belts to feed into current infrastructure. At about 50 hours (or at least for me) you finally get to start building the things that the game is named for, the Dyson Sphere. Don't know where to begin? How or what you should build? Don't worry there is a tutorial to help, actually no there isn't. Figure it out yourself. All that time you've spent with the production interface and all those base building skills you've developed over 50 hours. They mean nothing, welcome to an entirely new interface and building strategy. After a session of mucking about with the Dyson Sphere bits I am calling it quits. Is there more game here? Absolutely, I would even imagine it being quite rewarding. I may even come back to it at a later date to finish it, but for now I feel defeated. \r\n\r\nWhere the game needs work:\r\n\r\n1. The selection system - Needs work. Selecting a building or item requires multiple clicks and deselecting require multiple right clicks. It is sometimes unclear what you are doing. I can't count how many times I went to check how much of an item was in a depot or factory and click on it but only after realize I was in Delete mode and now I have to rebuild it, and its connectors. If the building was to highlight in red when I hover over it it would at least give me a chance to realize my mistake before I make it.\r\n\r\n2. Movement - The camera movement is always centered around your Commander. WASD moves you around in 3rd person holding middle mouse button rotates the camera around your Commander. You are always tethered to your Commander to build and he will run into buildings, a lot. When you get flying later on he will fly over buildings making the process easier but always being tethered to your Commander is quite frustrating at times. Imagine playing Supreme Commander and you have to walk your Commander around with WASD and he is always center screen. No panning, no checking another place on the map without you flying the Commander there to look. \r\n\r\n2.5 Movement is 'Cruise Mode' - Essentially fast flying mode. Needs major overhaul. There is no smoothness to this, the controls are atrocious at best. You'll find yourself maxing out your speed to go to a new planet and instead of slowing down and picking a good landing spot you'll just aim for the middle and hit the planet at max speed. You don't take damage and you will not likely be where you want to be on the planet. But that lack of accuracy sure beats the panic induced button mashing, flying inverted, spin-fest that will result if you try making the perfect landing right where you want to. Which undoubtedly result in landing no where near where you intended to land anyway.\r\n\r\n3. The skill Tree - Do you like 1000 options of tech trees and skill trees? So do I! Actually I really do and when I saw how massive it was I was in heaven. After about 10 hours of game play I just found myself queuing up whatever I could afford or could make and let it manage itself. No strategy, just keep the queue full with another project. No hard choices on which direction to take the technology or what upgrade I should get for my Commander. I think there is a lot of potential here, just under utilized at the moment.\r\n\r\n4. Combat - 10% of the game at best is combat. There is an enemy faction Dark Fog that is also attempting to build a Dyson Sphere and they want the same resources as you on the same planets so naturally you have to fight. Unfortunately they present such an underwhelming threat they can almost be ignored. How do you engage in combat, well, you don't have any ground units so it's air units only and those air units will be destroyed almost instantly in a fight, so don't bother. My approach was to simply build a small line of turrets just of of range from the base the 'almost' never leave and slowly inch closer and closer to wipe out their base. It's not hard and I only need turrets with the most basic ammo. The combat system either needs to present a tougher challenge or removed completely. Eventually I just setup bases with multiple turret batteries and let them come to me, predictably and without force, posing no threat.\r\n\r\n5. Dyson Sphere - It's a little disappointing to sink 60 hours into a game to only JUST start building the thing the game is named for. In Satisfactory building the Space Elevator happens so early and with great challenge and then as the game matures you get to see the goal materialize with each new step. It's continuously rewarding, motivational, plot focused and instructional. Dyson Sphere has none of that nuance. I would like to see earlier progression to the main goal. Functional, rational decision making for which next steps to take. Practical learned progression.\r\n\r\nWhat the game does well:\r\n\r\n1. Electrical Grid Balance - As I was base building I found myself always aware of my electrical needs. I was never in a position where I was frustrated (unlike the 'coal wall' in Satisfactory) with needs outpacing ability to make more but I still had to plan and account for for an ever increasing demand for electrical power. \r\n\r\n2. Moving Materials - Dyson Sphere has a good set of short, medium, long and interplanetary logistics tools to use. I though the implementation, design and function worked well with the pace of the game. \r\n\r\n3. Base Planning - The game does a good job of making you think about placement of buildings, belts and power as you progress. When you start it is just a matter of getting things to work. Mid-game you begin to think of, how do I make this work better. This is rewarding IMHO.\r\n\r\nOverall:\r\nFor the price I would, and do recommend Dyson Sphere, it is a good game with the promise of a great game lurking under the surface. I know it is in early access and development is ongoing. I am hoping a little more time for the fruit to ripen on the vine will mature this in to a fantastic experience. For now the wine tastes a little like vinegar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like Factorio, but better in every way. \r\n\r\nI cranked the Dark Fog up to max, and after a prolonged and arduous campaign, I emerged victoriuous!  Just kidding. I got my ass handed to me by the Dark Fog. ;)  Good thing the difficulty is customizable.  You can remove the enemies completely if you just want to build your factories.\r\n\r\nIf you like automation games, this is a must play. You may ask if it's worth spending dozens of hours building a Dyson Sphere around a star?  Ask me again when you've witnessed your Sphere as it emerges over the horizon. If such a majestic sight doesn't bring a tear to your eye, you may be a robot. If you are a robot, you should still play this game, as you play a robot in the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Like space factories and stuff and things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strongly recommend. Excellent Automation game.  Second to none.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good stuff. Impressive what a small team has done. I like this with and without the Dark Fog. Embracing blueprints is the way! Thanks developers!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Keeps getting better and better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun. However early game is so very manual I find new games to be a chore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Woo boy this is a wonderful time sink.  I came from factorio:SA and the difference in DSP is wonderful and fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can i build a dyson sphere to power my endless amount of vibrators and buttplugs?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very extensive and addicting. Factorio in Space with Science",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sleep is one thing but manufacturing glowing cubes tickles my brain in just the right way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A small team has been working away at this for years, with updates big and small and I've put in over 500 hours and all I can think of is the ever growing MORE. More mining, more production, more expansion, more Dyson Spheres, more MORE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Landing on a planet of my own creation, a drainer of worlds.  Having no memory of this place, wandering lost in the  galactic spaghetti of conveyor belts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My almost 10 year old machine able to run the game smoothly without any trouble",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the visuals and factory building in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "That kind of game that make you forget you have to eat and sleep.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's a smooth, remarkably well optimized game, and I've owned it a long time along side games like Factorio. What has led me to play only 60 hours in the last 4 years while playing 1500 hours of Factorio is primarily because at a certain point, you need logic circuits to distribute the expensive resources, Factorio has that, this game doesn't and has no plans to. I keep checking periodically if the devs could possibly get some sense and do it already, still waiting. \n\nMod support is the other side. While some QOL mods are available, come on now, Fatorio has them beat 100:1 if not 1000:1. Why? Factorio is one level! You can't even rotate the screen dynamically, the graphics are something to get used to while this game has great graphics, it's smooth and easy and has such potential to be better than Factorio but I believe the key lacking is the logic circuits. I personally never play with the biters and this game is no different, I wouldn't play with the annoyance of enemies, I want a casual gaming experience, I want to build the sphere, but I just can't get barely to the point of inter planetary travel before giving up as my expensive production fails to deliver to something important while something less important has to fill up first and no, I don't want to \"build a circuit\" with belts or pipes to solve this issue.\n\nIf you're like me, I don't recommend this game. It's meh, and the proof is in the hours played.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no 'undo' button. really just terrible interface feels like they don't want you to play the game easily.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really hard to get into. There's like 10 different menus, the controls are unintuitive, and the tutorial is more overwhelming than helpful. Jumping back and forth between too many menus is disorienting, and the controls aren't otherwise very intuitive or snappy.\n\nI also had a terrible framerate but could be my system. I wish there was graphics presets for low/med/high.\n\nIt's not really possible to remap keys since you can't create conflicts and most keys are already mapped.\n\nMaybe I would enjoy this game if it had a proper beginning that eased you into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to play it and I was excited because I read that they finally added the ability to rebind keys into the game, well to my biggest dissapointement that entire rebind key menu is useless because a lot of the more important keys are hardcoded, as an AZERTY user it was just not possible, the Q key that I would need to move left is hardcoded as the pipette tool like in factorio to quickly build mine on deposits, so everytime I would try to walk left it it would open construction menu and try to build mines, this is a huge oversight, and the fact that people have been asking for the ability to rebinding key since 2020 and they never did so, in an unity game too where it's piss easy to do so, is really infuriating, I had to refund the game, maybe i'll change my review if they even decide to fix this. Yes I know I could just alt+shift and play with US keyboard, but then when I need to type stuff it's all in us keyboard, If I alt tab out I need to change it back to AZERTY when I need to type out of the game, this should not be the player's burden, rebindable keys is not QoL feature, it's just pretty basic stuff that should be there right away in any pc games that uses a keyboard. \n\n\nMessage for the devs:\n开发者们，请允许重新绑定硬编码按钮。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seems neat on its face. I wanted to like it. The gameplay is just too slow and clunky. A few hours in, and I can't imagine investing the time into playing a game to completion. Maybe I'll come back to it when I hit a nursing home or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game feels pretty boring compared to other automation games like factorio, and lacked many QOL features.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not buy this game unless your eyes are under 30. The font is so small, it's unreadable and as far as I can tell, unable to increase it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having tried to play this game many many times now, i find mechanics of powering your exosuit to be one of the most daunting, infuriating items to exist. Not only that, but it feels difficult when starting out to produce any sort of non-manual automation to progress and it feels complex just to set up research for the first time. I really wanted to see the highs of what this game offers, but unfortunately the lows are too punishing to feel worth it. Looks like i'll buy the Factorio expansion after all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "meh.. ive never understood what is fun about making a factory for the sake of efficiency and nothing else.. there is nothing compelling me to do the work\r\n\r\ngames like this (and Satisfactory as well) will never compare to Factorio, Desync or Riftbreakers if you asked me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very Laggy for me and i cannot understand it, so i will be getting a refund. the time your seeing this i have already gotten my refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1. Flight controls are horrendously bad and result in you reloading autosaves half the time you fly, because you graze the invisible finite gravity well of some object vaguely between your origin and destination that throws you completely off course. Also, you cannot control the camera as you exit the atmosphere, and since the camera orientation controls your velocity, this makes it extremely difficult to aim, which is very bad in a flight control scheme that requires precise aim. If you miss your target, it is often so energy-intensive to make a u-turn you lose all your energy and have to reload your save.\n2. If you land on a gas giant with insufficient energy to escape (often as a result of issue #1), you are permanently stuck, and have to reload your save. There is not even a self-destruct option to escape.\n3. About 25%-50% of the time you place a miner, the belt auto-pathing does not allow you to actually place a belt from the output of the mine, meaning you have to keep deleting and adding the mine in a slightly different position and orientation and *hope* that the bug fixes itself. There is no way, prior to placing a mine, of predicting whether belts can actually attach to the mine or not.\n4. There is no way to skip specific tutorial hints. The game seems to indicate via an icon that using the left or right mouse button (unclear which from the icon) skips dialogue, but this has no actual effect.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Text size and font choice makes the game unplayable. The scaling option available resizes the entire UI, moving buttons off screen and hiding menus under other elements. There is no workshop support, so community fixes are scetchy at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tons of issues on proton experimental",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "HUGE learning curve......to involved",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my progres got deleted :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehhh it's alright",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a smooth, remarkably well optimized game, and I've owned it a long time along side games like Factorio. What has led me to play only 60 hours in the last 4 years while playing 1500 hours of Factorio is primarily because at a certain point, you need logic circuits to distribute the expensive resources, Factorio has that, this game doesn't and has no plans to. I keep checking periodically if the devs could possibly get some sense and do it already, still waiting. \n\nMod support is the other side. While some QOL mods are available, come on now, Fatorio has them beat 100:1 if not 1000:1. Why? Factorio is one level! You can't even rotate the screen dynamically, the graphics are something to get used to while this game has great graphics, it's smooth and easy and has such potential to be better than Factorio but I believe the key lacking is the logic circuits. I personally never play with the biters and this game is no different, I wouldn't play with the annoyance of enemies, I want a casual gaming experience, I want to build the sphere, but I just can't get barely to the point of inter planetary travel before giving up as my expensive production fails to deliver to something important while something less important has to fill up first and no, I don't want to \"build a circuit\" with belts or pipes to solve this issue.\n\nIf you're like me, I don't recommend this game. It's meh, and the proof is in the hours played.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve had this game in my library for a while, but I just can’t seem to get into it. Every time I try, I end up quitting after a few hours. I really enjoy the genre and love similar automation/factory games, but this one is just too frustrating to play.\r\n\r\nThe UI scaling is terrible at 1440p - the text is tiny, and adjusting the settings only breaks the layout further, with elements ending up in the wrong places. The controls are clunky and unintuitive; for example, pressing Escape doesn’t cancel some actions as you’d expect - it just opens the main menu.\r\n\r\nAnd honestly, the fact that the game is still in Early Access after more than 4 years isn’t a great sign. Maybe I’ll give it another try in a few years, but for now, it’s just not enjoyable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "no 'undo' button. really just terrible interface feels like they don't want you to play the game easily.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really hard to get into. There's like 10 different menus, the controls are unintuitive, and the tutorial is more overwhelming than helpful. Jumping back and forth between too many menus is disorienting, and the controls aren't otherwise very intuitive or snappy.\n\nI also had a terrible framerate but could be my system. I wish there was graphics presets for low/med/high.\n\nIt's not really possible to remap keys since you can't create conflicts and most keys are already mapped.\n\nMaybe I would enjoy this game if it had a proper beginning that eased you into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to play it and I was excited because I read that they finally added the ability to rebind keys into the game, well to my biggest dissapointement that entire rebind key menu is useless because a lot of the more important keys are hardcoded, as an AZERTY user it was just not possible, the Q key that I would need to move left is hardcoded as the pipette tool like in factorio to quickly build mine on deposits, so everytime I would try to walk left it it would open construction menu and try to build mines, this is a huge oversight, and the fact that people have been asking for the ability to rebinding key since 2020 and they never did so, in an unity game too where it's piss easy to do so, is really infuriating, I had to refund the game, maybe i'll change my review if they even decide to fix this. Yes I know I could just alt+shift and play with US keyboard, but then when I need to type stuff it's all in us keyboard, If I alt tab out I need to change it back to AZERTY when I need to type out of the game, this should not be the player's burden, rebindable keys is not QoL feature, it's just pretty basic stuff that should be there right away in any pc games that uses a keyboard. \n\n\nMessage for the devs:\n开发者们，请允许重新绑定硬编码按钮。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have tried - twice, two years apart - to get into this game, and twice I have failed. I think it's the interface; it just doesn't work with my brain and I feel like I'm often just looking at menus and confused on what to do next. \"Being overwhelmed\" is the best way to describe playing this game, and it's not in the fun way.\r\n\r\nMy least favorite part of the game is the conveyor belt, and that's not a good thing since they are such a basic component. I don't like that you can make them backward accidentally, I don't like that they take another item in order to move things into another building. This just makes no sense to me, especially after years of Satisfactory where everything just snaps into place so easily. I also don't like that for a game where placement is so important, you can't move anything; you have to delete and rebuild. While fairly standard for the genre, it makes less sense here.\r\n\r\nOne of the genius parts of Satisfactory is that they artificially gate you behind \"upgrades\" in the main story line, which widens and then (importantly) narrows your goals. You are never hit with a billion things all at once, and drip-fed how the game works. This game is the opposite. You get the full tech tree at the beginning and you're only limited by what items you can build - which is in another tree. Cross-coordinating them is a pain, and it's also incredibly overwhelming. There's... kind of a tutorial? A poorly-voiced actor just tells you the next thing to do - which again, just seems so harsh compared to Satisfactory's well-voiced and well-written \"AI\" character - but even then, it's not intuitive. The parts are also \"futuristic\" which makes them just seem like random wigits, and I guess they are. It's just hard to care about how many \"blue cubes\" you're making because it's so abstracted.\r\n\r\nI also hate how power works and how my character can't move without using power and I'm sure things get really cool eventually. But I just can't get there. And so I am giving up. And I encourage you, dear reader: give up before you start. Just don't buy it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really don't understand why the games native functions won't let you reassign all keybindings.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Seems neat on its face. I wanted to like it. The gameplay is just too slow and clunky. A few hours in, and I can't imagine investing the time into playing a game to completion. Maybe I'll come back to it when I hit a nursing home or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game feels pretty boring compared to other automation games like factorio, and lacked many QOL features.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not buy this game unless your eyes are under 30. The font is so small, it's unreadable and as far as I can tell, unable to increase it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having tried to play this game many many times now, i find mechanics of powering your exosuit to be one of the most daunting, infuriating items to exist. Not only that, but it feels difficult when starting out to produce any sort of non-manual automation to progress and it feels complex just to set up research for the first time. I really wanted to see the highs of what this game offers, but unfortunately the lows are too punishing to feel worth it. Looks like i'll buy the Factorio expansion after all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "meh.. ive never understood what is fun about making a factory for the sake of efficiency and nothing else.. there is nothing compelling me to do the work\r\n\r\ngames like this (and Satisfactory as well) will never compare to Factorio, Desync or Riftbreakers if you asked me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very Laggy for me and i cannot understand it, so i will be getting a refund. the time your seeing this i have already gotten my refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1. Flight controls are horrendously bad and result in you reloading autosaves half the time you fly, because you graze the invisible finite gravity well of some object vaguely between your origin and destination that throws you completely off course. Also, you cannot control the camera as you exit the atmosphere, and since the camera orientation controls your velocity, this makes it extremely difficult to aim, which is very bad in a flight control scheme that requires precise aim. If you miss your target, it is often so energy-intensive to make a u-turn you lose all your energy and have to reload your save.\n2. If you land on a gas giant with insufficient energy to escape (often as a result of issue #1), you are permanently stuck, and have to reload your save. There is not even a self-destruct option to escape.\n3. About 25%-50% of the time you place a miner, the belt auto-pathing does not allow you to actually place a belt from the output of the mine, meaning you have to keep deleting and adding the mine in a slightly different position and orientation and *hope* that the bug fixes itself. There is no way, prior to placing a mine, of predicting whether belts can actually attach to the mine or not.\n4. There is no way to skip specific tutorial hints. The game seems to indicate via an icon that using the left or right mouse button (unclear which from the icon) skips dialogue, but this has no actual effect.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Text size and font choice makes the game unplayable. The scaling option available resizes the entire UI, moving buttons off screen and hiding menus under other elements. There is no workshop support, so community fixes are scetchy at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tons of issues on proton experimental",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "HUGE learning curve......to involved",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my progres got deleted :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehhh it's alright",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a smooth, remarkably well optimized game, and I've owned it a long time along side games like Factorio. What has led me to play only 60 hours in the last 4 years while playing 1500 hours of Factorio is primarily because at a certain point, you need logic circuits to distribute the expensive resources, Factorio has that, this game doesn't and has no plans to. I keep checking periodically if the devs could possibly get some sense and do it already, still waiting. \n\nMod support is the other side. While some QOL mods are available, come on now, Fatorio has them beat 100:1 if not 1000:1. Why? Factorio is one level! You can't even rotate the screen dynamically, the graphics are something to get used to while this game has great graphics, it's smooth and easy and has such potential to be better than Factorio but I believe the key lacking is the logic circuits. I personally never play with the biters and this game is no different, I wouldn't play with the annoyance of enemies, I want a casual gaming experience, I want to build the sphere, but I just can't get barely to the point of inter planetary travel before giving up as my expensive production fails to deliver to something important while something less important has to fill up first and no, I don't want to \"build a circuit\" with belts or pipes to solve this issue.\n\nIf you're like me, I don't recommend this game. It's meh, and the proof is in the hours played.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve had this game in my library for a while, but I just can’t seem to get into it. Every time I try, I end up quitting after a few hours. I really enjoy the genre and love similar automation/factory games, but this one is just too frustrating to play.\r\n\r\nThe UI scaling is terrible at 1440p - the text is tiny, and adjusting the settings only breaks the layout further, with elements ending up in the wrong places. The controls are clunky and unintuitive; for example, pressing Escape doesn’t cancel some actions as you’d expect - it just opens the main menu.\r\n\r\nAnd honestly, the fact that the game is still in Early Access after more than 4 years isn’t a great sign. Maybe I’ll give it another try in a few years, but for now, it’s just not enjoyable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "no 'undo' button. really just terrible interface feels like they don't want you to play the game easily.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really hard to get into. There's like 10 different menus, the controls are unintuitive, and the tutorial is more overwhelming than helpful. Jumping back and forth between too many menus is disorienting, and the controls aren't otherwise very intuitive or snappy.\n\nI also had a terrible framerate but could be my system. I wish there was graphics presets for low/med/high.\n\nIt's not really possible to remap keys since you can't create conflicts and most keys are already mapped.\n\nMaybe I would enjoy this game if it had a proper beginning that eased you into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to play it and I was excited because I read that they finally added the ability to rebind keys into the game, well to my biggest dissapointement that entire rebind key menu is useless because a lot of the more important keys are hardcoded, as an AZERTY user it was just not possible, the Q key that I would need to move left is hardcoded as the pipette tool like in factorio to quickly build mine on deposits, so everytime I would try to walk left it it would open construction menu and try to build mines, this is a huge oversight, and the fact that people have been asking for the ability to rebinding key since 2020 and they never did so, in an unity game too where it's piss easy to do so, is really infuriating, I had to refund the game, maybe i'll change my review if they even decide to fix this. Yes I know I could just alt+shift and play with US keyboard, but then when I need to type stuff it's all in us keyboard, If I alt tab out I need to change it back to AZERTY when I need to type out of the game, this should not be the player's burden, rebindable keys is not QoL feature, it's just pretty basic stuff that should be there right away in any pc games that uses a keyboard. \n\n\nMessage for the devs:\n开发者们，请允许重新绑定硬编码按钮。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have tried - twice, two years apart - to get into this game, and twice I have failed. I think it's the interface; it just doesn't work with my brain and I feel like I'm often just looking at menus and confused on what to do next. \"Being overwhelmed\" is the best way to describe playing this game, and it's not in the fun way.\r\n\r\nMy least favorite part of the game is the conveyor belt, and that's not a good thing since they are such a basic component. I don't like that you can make them backward accidentally, I don't like that they take another item in order to move things into another building. This just makes no sense to me, especially after years of Satisfactory where everything just snaps into place so easily. I also don't like that for a game where placement is so important, you can't move anything; you have to delete and rebuild. While fairly standard for the genre, it makes less sense here.\r\n\r\nOne of the genius parts of Satisfactory is that they artificially gate you behind \"upgrades\" in the main story line, which widens and then (importantly) narrows your goals. You are never hit with a billion things all at once, and drip-fed how the game works. This game is the opposite. You get the full tech tree at the beginning and you're only limited by what items you can build - which is in another tree. Cross-coordinating them is a pain, and it's also incredibly overwhelming. There's... kind of a tutorial? A poorly-voiced actor just tells you the next thing to do - which again, just seems so harsh compared to Satisfactory's well-voiced and well-written \"AI\" character - but even then, it's not intuitive. The parts are also \"futuristic\" which makes them just seem like random wigits, and I guess they are. It's just hard to care about how many \"blue cubes\" you're making because it's so abstracted.\r\n\r\nI also hate how power works and how my character can't move without using power and I'm sure things get really cool eventually. But I just can't get there. And so I am giving up. And I encourage you, dear reader: give up before you start. Just don't buy it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really don't understand why the games native functions won't let you reassign all keybindings.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Seems neat on its face. I wanted to like it. The gameplay is just too slow and clunky. A few hours in, and I can't imagine investing the time into playing a game to completion. Maybe I'll come back to it when I hit a nursing home or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game feels pretty boring compared to other automation games like factorio, and lacked many QOL features.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not buy this game unless your eyes are under 30. The font is so small, it's unreadable and as far as I can tell, unable to increase it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having tried to play this game many many times now, i find mechanics of powering your exosuit to be one of the most daunting, infuriating items to exist. Not only that, but it feels difficult when starting out to produce any sort of non-manual automation to progress and it feels complex just to set up research for the first time. I really wanted to see the highs of what this game offers, but unfortunately the lows are too punishing to feel worth it. Looks like i'll buy the Factorio expansion after all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "meh.. ive never understood what is fun about making a factory for the sake of efficiency and nothing else.. there is nothing compelling me to do the work\r\n\r\ngames like this (and Satisfactory as well) will never compare to Factorio, Desync or Riftbreakers if you asked me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very Laggy for me and i cannot understand it, so i will be getting a refund. the time your seeing this i have already gotten my refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1. Flight controls are horrendously bad and result in you reloading autosaves half the time you fly, because you graze the invisible finite gravity well of some object vaguely between your origin and destination that throws you completely off course. Also, you cannot control the camera as you exit the atmosphere, and since the camera orientation controls your velocity, this makes it extremely difficult to aim, which is very bad in a flight control scheme that requires precise aim. If you miss your target, it is often so energy-intensive to make a u-turn you lose all your energy and have to reload your save.\n2. If you land on a gas giant with insufficient energy to escape (often as a result of issue #1), you are permanently stuck, and have to reload your save. There is not even a self-destruct option to escape.\n3. About 25%-50% of the time you place a miner, the belt auto-pathing does not allow you to actually place a belt from the output of the mine, meaning you have to keep deleting and adding the mine in a slightly different position and orientation and *hope* that the bug fixes itself. There is no way, prior to placing a mine, of predicting whether belts can actually attach to the mine or not.\n4. There is no way to skip specific tutorial hints. The game seems to indicate via an icon that using the left or right mouse button (unclear which from the icon) skips dialogue, but this has no actual effect.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Text size and font choice makes the game unplayable. The scaling option available resizes the entire UI, moving buttons off screen and hiding menus under other elements. There is no workshop support, so community fixes are scetchy at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tons of issues on proton experimental",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "HUGE learning curve......to involved",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my progres got deleted :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehhh it's alright",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a smooth, remarkably well optimized game, and I've owned it a long time along side games like Factorio. What has led me to play only 60 hours in the last 4 years while playing 1500 hours of Factorio is primarily because at a certain point, you need logic circuits to distribute the expensive resources, Factorio has that, this game doesn't and has no plans to. I keep checking periodically if the devs could possibly get some sense and do it already, still waiting. \n\nMod support is the other side. While some QOL mods are available, come on now, Fatorio has them beat 100:1 if not 1000:1. Why? Factorio is one level! You can't even rotate the screen dynamically, the graphics are something to get used to while this game has great graphics, it's smooth and easy and has such potential to be better than Factorio but I believe the key lacking is the logic circuits. I personally never play with the biters and this game is no different, I wouldn't play with the annoyance of enemies, I want a casual gaming experience, I want to build the sphere, but I just can't get barely to the point of inter planetary travel before giving up as my expensive production fails to deliver to something important while something less important has to fill up first and no, I don't want to \"build a circuit\" with belts or pipes to solve this issue.\n\nIf you're like me, I don't recommend this game. It's meh, and the proof is in the hours played.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve had this game in my library for a while, but I just can’t seem to get into it. Every time I try, I end up quitting after a few hours. I really enjoy the genre and love similar automation/factory games, but this one is just too frustrating to play.\r\n\r\nThe UI scaling is terrible at 1440p - the text is tiny, and adjusting the settings only breaks the layout further, with elements ending up in the wrong places. The controls are clunky and unintuitive; for example, pressing Escape doesn’t cancel some actions as you’d expect - it just opens the main menu.\r\n\r\nAnd honestly, the fact that the game is still in Early Access after more than 4 years isn’t a great sign. Maybe I’ll give it another try in a few years, but for now, it’s just not enjoyable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "no 'undo' button. really just terrible interface feels like they don't want you to play the game easily.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really hard to get into. There's like 10 different menus, the controls are unintuitive, and the tutorial is more overwhelming than helpful. Jumping back and forth between too many menus is disorienting, and the controls aren't otherwise very intuitive or snappy.\n\nI also had a terrible framerate but could be my system. I wish there was graphics presets for low/med/high.\n\nIt's not really possible to remap keys since you can't create conflicts and most keys are already mapped.\n\nMaybe I would enjoy this game if it had a proper beginning that eased you into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to play it and I was excited because I read that they finally added the ability to rebind keys into the game, well to my biggest dissapointement that entire rebind key menu is useless because a lot of the more important keys are hardcoded, as an AZERTY user it was just not possible, the Q key that I would need to move left is hardcoded as the pipette tool like in factorio to quickly build mine on deposits, so everytime I would try to walk left it it would open construction menu and try to build mines, this is a huge oversight, and the fact that people have been asking for the ability to rebinding key since 2020 and they never did so, in an unity game too where it's piss easy to do so, is really infuriating, I had to refund the game, maybe i'll change my review if they even decide to fix this. Yes I know I could just alt+shift and play with US keyboard, but then when I need to type stuff it's all in us keyboard, If I alt tab out I need to change it back to AZERTY when I need to type out of the game, this should not be the player's burden, rebindable keys is not QoL feature, it's just pretty basic stuff that should be there right away in any pc games that uses a keyboard. \n\n\nMessage for the devs:\n开发者们，请允许重新绑定硬编码按钮。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have tried - twice, two years apart - to get into this game, and twice I have failed. I think it's the interface; it just doesn't work with my brain and I feel like I'm often just looking at menus and confused on what to do next. \"Being overwhelmed\" is the best way to describe playing this game, and it's not in the fun way.\r\n\r\nMy least favorite part of the game is the conveyor belt, and that's not a good thing since they are such a basic component. I don't like that you can make them backward accidentally, I don't like that they take another item in order to move things into another building. This just makes no sense to me, especially after years of Satisfactory where everything just snaps into place so easily. I also don't like that for a game where placement is so important, you can't move anything; you have to delete and rebuild. While fairly standard for the genre, it makes less sense here.\r\n\r\nOne of the genius parts of Satisfactory is that they artificially gate you behind \"upgrades\" in the main story line, which widens and then (importantly) narrows your goals. You are never hit with a billion things all at once, and drip-fed how the game works. This game is the opposite. You get the full tech tree at the beginning and you're only limited by what items you can build - which is in another tree. Cross-coordinating them is a pain, and it's also incredibly overwhelming. There's... kind of a tutorial? A poorly-voiced actor just tells you the next thing to do - which again, just seems so harsh compared to Satisfactory's well-voiced and well-written \"AI\" character - but even then, it's not intuitive. The parts are also \"futuristic\" which makes them just seem like random wigits, and I guess they are. It's just hard to care about how many \"blue cubes\" you're making because it's so abstracted.\r\n\r\nI also hate how power works and how my character can't move without using power and I'm sure things get really cool eventually. But I just can't get there. And so I am giving up. And I encourage you, dear reader: give up before you start. Just don't buy it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really don't understand why the games native functions won't let you reassign all keybindings.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Seems neat on its face. I wanted to like it. The gameplay is just too slow and clunky. A few hours in, and I can't imagine investing the time into playing a game to completion. Maybe I'll come back to it when I hit a nursing home or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game feels pretty boring compared to other automation games like factorio, and lacked many QOL features.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not buy this game unless your eyes are under 30. The font is so small, it's unreadable and as far as I can tell, unable to increase it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having tried to play this game many many times now, i find mechanics of powering your exosuit to be one of the most daunting, infuriating items to exist. Not only that, but it feels difficult when starting out to produce any sort of non-manual automation to progress and it feels complex just to set up research for the first time. I really wanted to see the highs of what this game offers, but unfortunately the lows are too punishing to feel worth it. Looks like i'll buy the Factorio expansion after all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "meh.. ive never understood what is fun about making a factory for the sake of efficiency and nothing else.. there is nothing compelling me to do the work\r\n\r\ngames like this (and Satisfactory as well) will never compare to Factorio, Desync or Riftbreakers if you asked me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very Laggy for me and i cannot understand it, so i will be getting a refund. the time your seeing this i have already gotten my refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1. Flight controls are horrendously bad and result in you reloading autosaves half the time you fly, because you graze the invisible finite gravity well of some object vaguely between your origin and destination that throws you completely off course. Also, you cannot control the camera as you exit the atmosphere, and since the camera orientation controls your velocity, this makes it extremely difficult to aim, which is very bad in a flight control scheme that requires precise aim. If you miss your target, it is often so energy-intensive to make a u-turn you lose all your energy and have to reload your save.\n2. If you land on a gas giant with insufficient energy to escape (often as a result of issue #1), you are permanently stuck, and have to reload your save. There is not even a self-destruct option to escape.\n3. About 25%-50% of the time you place a miner, the belt auto-pathing does not allow you to actually place a belt from the output of the mine, meaning you have to keep deleting and adding the mine in a slightly different position and orientation and *hope* that the bug fixes itself. There is no way, prior to placing a mine, of predicting whether belts can actually attach to the mine or not.\n4. There is no way to skip specific tutorial hints. The game seems to indicate via an icon that using the left or right mouse button (unclear which from the icon) skips dialogue, but this has no actual effect.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Text size and font choice makes the game unplayable. The scaling option available resizes the entire UI, moving buttons off screen and hiding menus under other elements. There is no workshop support, so community fixes are scetchy at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tons of issues on proton experimental",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "HUGE learning curve......to involved",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my progres got deleted :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehhh it's alright",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a smooth, remarkably well optimized game, and I've owned it a long time along side games like Factorio. What has led me to play only 60 hours in the last 4 years while playing 1500 hours of Factorio is primarily because at a certain point, you need logic circuits to distribute the expensive resources, Factorio has that, this game doesn't and has no plans to. I keep checking periodically if the devs could possibly get some sense and do it already, still waiting. \n\nMod support is the other side. While some QOL mods are available, come on now, Fatorio has them beat 100:1 if not 1000:1. Why? Factorio is one level! You can't even rotate the screen dynamically, the graphics are something to get used to while this game has great graphics, it's smooth and easy and has such potential to be better than Factorio but I believe the key lacking is the logic circuits. I personally never play with the biters and this game is no different, I wouldn't play with the annoyance of enemies, I want a casual gaming experience, I want to build the sphere, but I just can't get barely to the point of inter planetary travel before giving up as my expensive production fails to deliver to something important while something less important has to fill up first and no, I don't want to \"build a circuit\" with belts or pipes to solve this issue.\n\nIf you're like me, I don't recommend this game. It's meh, and the proof is in the hours played.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve had this game in my library for a while, but I just can’t seem to get into it. Every time I try, I end up quitting after a few hours. I really enjoy the genre and love similar automation/factory games, but this one is just too frustrating to play.\r\n\r\nThe UI scaling is terrible at 1440p - the text is tiny, and adjusting the settings only breaks the layout further, with elements ending up in the wrong places. The controls are clunky and unintuitive; for example, pressing Escape doesn’t cancel some actions as you’d expect - it just opens the main menu.\r\n\r\nAnd honestly, the fact that the game is still in Early Access after more than 4 years isn’t a great sign. Maybe I’ll give it another try in a few years, but for now, it’s just not enjoyable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "no 'undo' button. really just terrible interface feels like they don't want you to play the game easily.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really hard to get into. There's like 10 different menus, the controls are unintuitive, and the tutorial is more overwhelming than helpful. Jumping back and forth between too many menus is disorienting, and the controls aren't otherwise very intuitive or snappy.\n\nI also had a terrible framerate but could be my system. I wish there was graphics presets for low/med/high.\n\nIt's not really possible to remap keys since you can't create conflicts and most keys are already mapped.\n\nMaybe I would enjoy this game if it had a proper beginning that eased you into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to play it and I was excited because I read that they finally added the ability to rebind keys into the game, well to my biggest dissapointement that entire rebind key menu is useless because a lot of the more important keys are hardcoded, as an AZERTY user it was just not possible, the Q key that I would need to move left is hardcoded as the pipette tool like in factorio to quickly build mine on deposits, so everytime I would try to walk left it it would open construction menu and try to build mines, this is a huge oversight, and the fact that people have been asking for the ability to rebinding key since 2020 and they never did so, in an unity game too where it's piss easy to do so, is really infuriating, I had to refund the game, maybe i'll change my review if they even decide to fix this. Yes I know I could just alt+shift and play with US keyboard, but then when I need to type stuff it's all in us keyboard, If I alt tab out I need to change it back to AZERTY when I need to type out of the game, this should not be the player's burden, rebindable keys is not QoL feature, it's just pretty basic stuff that should be there right away in any pc games that uses a keyboard. \n\n\nMessage for the devs:\n开发者们，请允许重新绑定硬编码按钮。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have tried - twice, two years apart - to get into this game, and twice I have failed. I think it's the interface; it just doesn't work with my brain and I feel like I'm often just looking at menus and confused on what to do next. \"Being overwhelmed\" is the best way to describe playing this game, and it's not in the fun way.\r\n\r\nMy least favorite part of the game is the conveyor belt, and that's not a good thing since they are such a basic component. I don't like that you can make them backward accidentally, I don't like that they take another item in order to move things into another building. This just makes no sense to me, especially after years of Satisfactory where everything just snaps into place so easily. I also don't like that for a game where placement is so important, you can't move anything; you have to delete and rebuild. While fairly standard for the genre, it makes less sense here.\r\n\r\nOne of the genius parts of Satisfactory is that they artificially gate you behind \"upgrades\" in the main story line, which widens and then (importantly) narrows your goals. You are never hit with a billion things all at once, and drip-fed how the game works. This game is the opposite. You get the full tech tree at the beginning and you're only limited by what items you can build - which is in another tree. Cross-coordinating them is a pain, and it's also incredibly overwhelming. There's... kind of a tutorial? A poorly-voiced actor just tells you the next thing to do - which again, just seems so harsh compared to Satisfactory's well-voiced and well-written \"AI\" character - but even then, it's not intuitive. The parts are also \"futuristic\" which makes them just seem like random wigits, and I guess they are. It's just hard to care about how many \"blue cubes\" you're making because it's so abstracted.\r\n\r\nI also hate how power works and how my character can't move without using power and I'm sure things get really cool eventually. But I just can't get there. And so I am giving up. And I encourage you, dear reader: give up before you start. Just don't buy it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really don't understand why the games native functions won't let you reassign all keybindings.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Seems neat on its face. I wanted to like it. The gameplay is just too slow and clunky. A few hours in, and I can't imagine investing the time into playing a game to completion. Maybe I'll come back to it when I hit a nursing home or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game feels pretty boring compared to other automation games like factorio, and lacked many QOL features.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not buy this game unless your eyes are under 30. The font is so small, it's unreadable and as far as I can tell, unable to increase it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having tried to play this game many many times now, i find mechanics of powering your exosuit to be one of the most daunting, infuriating items to exist. Not only that, but it feels difficult when starting out to produce any sort of non-manual automation to progress and it feels complex just to set up research for the first time. I really wanted to see the highs of what this game offers, but unfortunately the lows are too punishing to feel worth it. Looks like i'll buy the Factorio expansion after all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "meh.. ive never understood what is fun about making a factory for the sake of efficiency and nothing else.. there is nothing compelling me to do the work\r\n\r\ngames like this (and Satisfactory as well) will never compare to Factorio, Desync or Riftbreakers if you asked me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very Laggy for me and i cannot understand it, so i will be getting a refund. the time your seeing this i have already gotten my refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1. Flight controls are horrendously bad and result in you reloading autosaves half the time you fly, because you graze the invisible finite gravity well of some object vaguely between your origin and destination that throws you completely off course. Also, you cannot control the camera as you exit the atmosphere, and since the camera orientation controls your velocity, this makes it extremely difficult to aim, which is very bad in a flight control scheme that requires precise aim. If you miss your target, it is often so energy-intensive to make a u-turn you lose all your energy and have to reload your save.\n2. If you land on a gas giant with insufficient energy to escape (often as a result of issue #1), you are permanently stuck, and have to reload your save. There is not even a self-destruct option to escape.\n3. About 25%-50% of the time you place a miner, the belt auto-pathing does not allow you to actually place a belt from the output of the mine, meaning you have to keep deleting and adding the mine in a slightly different position and orientation and *hope* that the bug fixes itself. There is no way, prior to placing a mine, of predicting whether belts can actually attach to the mine or not.\n4. There is no way to skip specific tutorial hints. The game seems to indicate via an icon that using the left or right mouse button (unclear which from the icon) skips dialogue, but this has no actual effect.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Text size and font choice makes the game unplayable. The scaling option available resizes the entire UI, moving buttons off screen and hiding menus under other elements. There is no workshop support, so community fixes are scetchy at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tons of issues on proton experimental",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "HUGE learning curve......to involved",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my progres got deleted :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehhh it's alright",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a smooth, remarkably well optimized game, and I've owned it a long time along side games like Factorio. What has led me to play only 60 hours in the last 4 years while playing 1500 hours of Factorio is primarily because at a certain point, you need logic circuits to distribute the expensive resources, Factorio has that, this game doesn't and has no plans to. I keep checking periodically if the devs could possibly get some sense and do it already, still waiting. \n\nMod support is the other side. While some QOL mods are available, come on now, Fatorio has them beat 100:1 if not 1000:1. Why? Factorio is one level! You can't even rotate the screen dynamically, the graphics are something to get used to while this game has great graphics, it's smooth and easy and has such potential to be better than Factorio but I believe the key lacking is the logic circuits. I personally never play with the biters and this game is no different, I wouldn't play with the annoyance of enemies, I want a casual gaming experience, I want to build the sphere, but I just can't get barely to the point of inter planetary travel before giving up as my expensive production fails to deliver to something important while something less important has to fill up first and no, I don't want to \"build a circuit\" with belts or pipes to solve this issue.\n\nIf you're like me, I don't recommend this game. It's meh, and the proof is in the hours played.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve had this game in my library for a while, but I just can’t seem to get into it. Every time I try, I end up quitting after a few hours. I really enjoy the genre and love similar automation/factory games, but this one is just too frustrating to play.\r\n\r\nThe UI scaling is terrible at 1440p - the text is tiny, and adjusting the settings only breaks the layout further, with elements ending up in the wrong places. The controls are clunky and unintuitive; for example, pressing Escape doesn’t cancel some actions as you’d expect - it just opens the main menu.\r\n\r\nAnd honestly, the fact that the game is still in Early Access after more than 4 years isn’t a great sign. Maybe I’ll give it another try in a few years, but for now, it’s just not enjoyable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "no 'undo' button. really just terrible interface feels like they don't want you to play the game easily.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really hard to get into. There's like 10 different menus, the controls are unintuitive, and the tutorial is more overwhelming than helpful. Jumping back and forth between too many menus is disorienting, and the controls aren't otherwise very intuitive or snappy.\n\nI also had a terrible framerate but could be my system. I wish there was graphics presets for low/med/high.\n\nIt's not really possible to remap keys since you can't create conflicts and most keys are already mapped.\n\nMaybe I would enjoy this game if it had a proper beginning that eased you into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to play it and I was excited because I read that they finally added the ability to rebind keys into the game, well to my biggest dissapointement that entire rebind key menu is useless because a lot of the more important keys are hardcoded, as an AZERTY user it was just not possible, the Q key that I would need to move left is hardcoded as the pipette tool like in factorio to quickly build mine on deposits, so everytime I would try to walk left it it would open construction menu and try to build mines, this is a huge oversight, and the fact that people have been asking for the ability to rebinding key since 2020 and they never did so, in an unity game too where it's piss easy to do so, is really infuriating, I had to refund the game, maybe i'll change my review if they even decide to fix this. Yes I know I could just alt+shift and play with US keyboard, but then when I need to type stuff it's all in us keyboard, If I alt tab out I need to change it back to AZERTY when I need to type out of the game, this should not be the player's burden, rebindable keys is not QoL feature, it's just pretty basic stuff that should be there right away in any pc games that uses a keyboard. \n\n\nMessage for the devs:\n开发者们，请允许重新绑定硬编码按钮。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have tried - twice, two years apart - to get into this game, and twice I have failed. I think it's the interface; it just doesn't work with my brain and I feel like I'm often just looking at menus and confused on what to do next. \"Being overwhelmed\" is the best way to describe playing this game, and it's not in the fun way.\r\n\r\nMy least favorite part of the game is the conveyor belt, and that's not a good thing since they are such a basic component. I don't like that you can make them backward accidentally, I don't like that they take another item in order to move things into another building. This just makes no sense to me, especially after years of Satisfactory where everything just snaps into place so easily. I also don't like that for a game where placement is so important, you can't move anything; you have to delete and rebuild. While fairly standard for the genre, it makes less sense here.\r\n\r\nOne of the genius parts of Satisfactory is that they artificially gate you behind \"upgrades\" in the main story line, which widens and then (importantly) narrows your goals. You are never hit with a billion things all at once, and drip-fed how the game works. This game is the opposite. You get the full tech tree at the beginning and you're only limited by what items you can build - which is in another tree. Cross-coordinating them is a pain, and it's also incredibly overwhelming. There's... kind of a tutorial? A poorly-voiced actor just tells you the next thing to do - which again, just seems so harsh compared to Satisfactory's well-voiced and well-written \"AI\" character - but even then, it's not intuitive. The parts are also \"futuristic\" which makes them just seem like random wigits, and I guess they are. It's just hard to care about how many \"blue cubes\" you're making because it's so abstracted.\r\n\r\nI also hate how power works and how my character can't move without using power and I'm sure things get really cool eventually. But I just can't get there. And so I am giving up. And I encourage you, dear reader: give up before you start. Just don't buy it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really don't understand why the games native functions won't let you reassign all keybindings.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Seems neat on its face. I wanted to like it. The gameplay is just too slow and clunky. A few hours in, and I can't imagine investing the time into playing a game to completion. Maybe I'll come back to it when I hit a nursing home or something.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}