{
  "positive": [
    {
      "review": "Best $60 album I've gotten, and the fighting game is a nice plus.",
      "voted_up": true,
      "votes_helpful": 59
    },
    {
      "review": "As a person who disliked fighting games before this one, watching a ton of guides, one person helped me, and that would be a youtuber by the name of Toko, (Teaching You all of GGST In one video)",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "this game has uhhh pretty hot men and uhhh pretty hot women and uhhh pretty hot non-binaries and its pretty fun :)",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "Beautiful game honestly, really cool. My friend is fucking my mother through the screen in the room next to me and i can just sit back and watch that unfold as i still do not know to play the game and he likes to play zoning characters.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Strive is the Guilty Gear of fighting games.\nWait...\nOk, Guilty Gear Strive is the Guilty Gear of the Guilty Gear franchise. Yeah, that sounds better.\n\nIt is definitely worth playing even if you don't dump in hundreds of hours. It's incredible having so many wild offensive moves (like Venom playing billiards in a fight), as well as so many defensive options at your disposal, it makes the game so much more dynamic than just \"I block everything, then I do one of two strings, then I repeat\". The best part is that these usually aren't as hard to use as you'd imagine, there are plenty of easier characters to play with, and the core, universal mechanics are very simple to use. Of course, the high level gameplay is a lot deeper and richer, and so far, getting into this game seriously has been very rewarding, especially with good tutorial missions.\n\nThough, I gotta say, the game's publisher apparently doesn't know what regional pricing is, so it's very expensive for a Brazilian like me. If you're not BIG into fighting games, you should probably wait for a discount. For as great of a game as it is, it's nothing I couldn't have waited for.\n\nI also got a handful of DLCs, also at a discount, but that's just because I wanna make a fighting game of my own and wanted to experiment, you people shouldn't worry about DLCs unless there's something that really catches you (do your research before buying!)",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "The cast of these game can be separate in 3 tipes: Broken, the most easy and annoying zoners ever created and incredible hot characters. In rankets the only players you gonna encounter are in most cases Unikas, Happy Chaos (zoners in general), sol badguy, and in rare moments 1 guy playing Nagoriyuki, and hes going to lubricate your ass. Appart of that the musik of these games are a fucking 1000/10.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Guilty Gear Games I would often either play for short sessions or just when I was in the mood, not really been super huge with the series, but have often times then not enjoy their arcade fighting style gameplay. This Game Has Had Gotten Me To Really Get Into the game, Its got everything...Style, Amazing Soundtrack, Very Fun Combos & Cutscenes, The Sprites Are Very Rad...Something I'd like to See Darkstalkers Rock with. But Damn I gotta say, Guilty Gear Strive Is Amazing & Brutal With Friends. 10/10 Would Yo Yo My Friends off the Scr̸̰̥̗̗̯̯͛͒̈́̀̅̔͐͛͘͜͜͝͠͠ͅe̴̟̺̣̻͉̝̣͉̔̌͘ͅe̵͍͋̆͑̇̓̚͠ň̶̡̳̯̣̼̠̮̓̀̐͆͑͗̽͛́̌̈́̐  Again!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game's pretty funny to watch or have in the background while I'm waiting for other tournament games for any given FGC major. Thanks for the laughs. \n\nAlso, Millia's theme is still sick.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My first fighting game, which had the combined effects of making me love fighting games, and making me terrible at literally every other fighting game I try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While beginner friendly, there is still a lot of depth to the game. The announcement of a 2.0 gives hope of continued support for more years to come.\r\n\r\nA.B.A. is best girl.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great graphics and combo system, would highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game feels smooth and looks stunning. Faust has given me some in the bedroom cosplay ideas.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is fun with friends, being demolished and doing comebacks while being a big tiddy anime girl is fun. A really friendly game if you wanna try a fightin game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The charcters are gorgeus the game play is fluid, there is a low learning curve but  a really high mastery ceeling. The tgame is great and i firmly belive there is a charter for everyoine be it briget(My main), or Slayer im sure one of thew playstyles yoou will fint to you linking i highly recomend this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is by far without a doubt the best fighting game that I've ever played. everything down to the music, the gameplay Loop, even the online multiplayer whenever people aren't being b******, this game is one heck of a good time. Also bonus points points for the first collaboration being LUCY, very bold!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Diverse cast, good soundtrack, fast and exciting gameplay. A solid package!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a first fighting game i tried the design of the characters are really cool and the base command list is not too complicated but complicated enough to want to try and master it. And the combos come naturally when you start understanding a little bit on how your character works (even though i have a long road to master it).\r\n\r\nThe story is a little bit interesting but it's a little hard to follow, with the animation, so don't buy it for the story (that's a fighting game, so don't be focus on it)\r\n\r\nit's just weird that except from the 15 free playable characters the others are in dlcs, but i think it's common in fighting games ?\r\n\r\nbut 15 characters is already enough and you should have the choice to play one that suits you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to pick up fighting game that has a surprising amount of depth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just got this game but damn is it satisfying. Only complaint is that there seems to be no one in Oceania who plays, but that's not due to the game.\r\n\r\n(Also is it bridget x may or bridget x unika I'm confused)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING game, a lot of the stuff for it, not just the base game but also the DLC are a little expensive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best and easyest fighting game to get into nad they have lucy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just COOL. I'd never played a fighting game before this (like, actually tried to get into one) so I thought \"hey it's that one game with the cool anime music\" so I bought it. This game is really great. There's a lot of cool mechanics and each character has so much to them in terms of moveset and design. The vibe you get from the game encourages you to keep playing and doing something even mildly cool is catharsis unable to be described (I panic - mashed buttons and it did something hell yeah). Also some of the voicelines are just gold.\r\n\r\n\r\nMISTU FINAHHHHHHHH",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun fighting game that includes a variety of characters each with a unique kit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you have been looking at getting into fighting games, this is your SIGN.\nThis is a good game to learn the basics in, and to learn to STRIVE to be better.\nI thank you ArcSys for allowing me to get into fighting games, and I thank you for continuing to put out content for the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Opponents delaying internet connection to make matches in their favour is too common strategy, deal with it, or die to that one slayer main lagging entire match just when you had top comeback and were one hit from winning but instead you lost your hardest so far streak of 5 consecutive wins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very easy to get into for beginners and not as demanding as other fighting games whilst still holding a very high skill ceiling level. Play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Launch game\nSkip tutorial\nGo to online lobby match\nFight level 50+ players\nWon once\nExit\nVery fun game, need to play more than 100 hours 😃😃😃\n\n(Plz just let me have lucy for free)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is awesome, really good soundtrack and fun gameplay!! AND IT HAS MY GOAT AXL LOW. Best GG character ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dealing with a God-like cult, or a rampaging Gear and you need someone to stop them? Better Call Sol!\n\n\nI've been playing this series since XX on the PS2 (That must mean I'm good at the game, right? ...Right?) which was the Street Fighter 2, of Guilty Gear, getting numerous updates and revisions. But my love for this franchise didn't truly set in until my cousin and I were at Best Buy in the early 00s, around Christmas time, and we noticed Guilty Gear X2 Midnight Carnival Reload on Xbox and decided to pick it up, myself having a bit of prior understanding with the series, and assuming it to be an actual sequel. We must have put dozens of hours in to that game. But this review isn't about that original PS2 release, or the Xbox update.\n\n\nAs I said, I've been playing Guilty Gear on and off for 20+ years. I have a fascination with fighting games (especially the ones with intriguing characters, storylines and lore, like MK or GG), even if I don't excel at any of them, I love sinking time in to them. I played Xrd and Rev on PS4 a bunch, and Strive being the next evolution of the change in formula that started with Xrd, I can confidently say this game is great, and worth your time. There are a couple minor nitpicks, like how Asuka, or \"That Man\" 's storyline was dropped or should I say shifted in favor of  another character becoming “That man” and the UI on the character select screen which has always been innovative, is rather basic in Strive, but those are nitpicks and doesn't take away from the core experience. I can't speak much to the online, as I've only played a bit. For a series like Guilty Gear, as aforementioned I'm not good enough to play at high levels, or against players who have hundreds if not thousands of hours in to each one, but for the offline play, the AI will still push you to try. You better learn your roman cancels and your overdrives because they're going to bring it. The way the characters just pop against the gorgeous 2.5D artwork and character designs, which the series has always been notable for, but here it really does stand out.\n\nTo close this review off, Guilty Gear is a series created by a Japanese game director and musician who from his love of music, decided to create a fighting game to show off his appreciation for the genre, and created a great franchise underneath it all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best fighting games to get into with low skill floor and high skill ceiling.\r\nThe base roster of characters is great and most DLC characters have a fun and unique gameplay.\r\nA great pick up in 2025 as there's most likely 2 to 3 years of active support and new characters ahead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let's Rock! GG Strive has Baiken, so technically it’s already a 10/10. Everything else is just bonus content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You jump, I [h1] HEAVENLY POTEMKIN BUSTER. [/h1]\n\nI [h1] HEAVENLY POTEMKIN BUSTER [/h1], you quit the game.\n\n10/10 would recommend to fellow [h3] HEAVENLY [/h3] enthusiasts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's 5 attack buttons, I have no idea what any of the characters do. Lost 6 games in a row, best game ever 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those fighting games (besides smash bros) that I'd actually willingly play and thoroughly enjoy. \n\nThe controls aren't too complex to learn, but they're hard to master. Very fun with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As my first fighting game, I can solidly recomend this game to players new to the genre. specials have pretty lenient input windows, and the combo structure is pretty easy to understand as a new player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. not too hard to learn (compared to other fighters, anyway) but has a high skill ceiling, making it the perfect balance of accessibility and enjoyment overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had this game for a good couple years now, and I still find myself coming back to it after so long. Worthy of a good review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first fighter game, pretty fun, I hope they continue supporting this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My introduction to fighting games and I couldn't be happier.\r\nNever felt so cool while my friends were kicking my ass.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "despite what the fandom says, being trans does not give you advantage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a lot of care put into it! My favorite character is Dizzy because she is like a Disney princess... I like her story too... \n\nI admire Daisuke and their work a lot. I aspire to be like them one day.\n\nSending love to the Devs! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good and I love the artstyle + gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guilty Gear -Strive- the best game of its genre and a fighting game masterpiece. Everything about this game is absolutely gorgeous. Some of my favourite songs are from this game's soundtrack which was the reason I started playing Strive in the first place, they sure are all bangers. The player base, unlike most online competitive games is very kind and accepting, animations are top notch, smooth and attractive, character designs are cool as hell, and most importantly Strive is truly the most enjoyable game I've ever played. You definitely must give it a try, I'm sure you'll love it. Oh and losing almost every game at the beginning is alright and to be expected, especially for a newcomer so please don't let that take away from your fun and make improving your priority (or not, I'm not the one to say you how to play it lol) Hope you have fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The easiest good fighting game to get into besides Smash.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "prob the coolest lore ever.\nand the gameplay is the best ive ever played in a fighting game.\nprob the best 10/10 fighting game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME MADE ME BALD, NEVER EVER VERSE ANYONE NAMED BLAKE SMITH THEY ARE EVIL!!!!\n\nCool game tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the artstyle and gameplay. I'm just very bad at fighting games haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never have I loved a game so much that I sucked so hard at. words cannot describe the struggle it takes me to win a match. Peak and fun regardless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't usually play fighting games, but Guilty Gear won me over with it's unique looking characters and crazy good music. It's hard to learn and I really suck at it, but battling online opponents is a lot of fun. If you're ready to learn and don't mind being massaged into the floor quite a lot, give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game and the balancing if you play casually is quite good but if you do more than just a casual setting than the balancing is quite bad but at least the game mechanics are good however the only one that I have a slight issue with is the wall break simply because it seems like it just happens too fast to actually benifit from but I can tell there intention with having it in the game. Most of my issues are more or less just weird issues that dont actually effect the game. Moving on to the positives the characters are diverse with real differences that affect the gameplay and that makes for more diverse maches that feel like if you lose its either lack of knowledge, lack of skill or something else but I have never looked back so far on my matches and thought it was the games fault. But the best part of the game by far even above the character design is the music, the music is so good it is on my playlist and is just amazing and fits the characters so well it's just amazing. Hate Potemkin though even though I play Johnny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stage 9 arcade is the worst experience i've ever had the displeasure of going through.\r\n\r\nOther than that, this is truly a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very fun and great to play with friends i recon you try this game atleast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to pick up, hard to master. It is fast paced and forces you to find its unique rhythm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first fighting game ive played and i lost my first 100 games in a row fuck you saul",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and difficult game, steep learning curve but after your done its awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strive is polarizing for me since it completely changed the way my main from Rev 2 plays and no insta-kills, which both aren't a huge deal breaker though because none of that should take away how good of a fighting game it is still, and learning a new main in Venom gave me a new appreciation for this series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Something about this game is intoxicating to me, just playing with my friends are fun enough, but playing ranked as well. It isn't like other fighting games where, after a while, I feel despair and never pick it up again. Of course, DLC is a huge issue, but, really, just find a character you know from the memes and start playing them. There's not really a meta, as far as I know, just use what you like the best you can!\n10/10 five stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is kind of my start to fighting games. the controls feel good, but i've only played bridget so far (well, not really but shes my main). once i get more money i'll start trying out the others. really solid game though, even if you're not into fighting games this ones pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remember: If you lose the matchup, it was negative against your character, their character is S+ tier while yours is C-; If you win the matchup, you're just better and your opponent sucks and you are the greatest to ever do it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game I ever played, And I played Lots of game, So if u want game with anime stuff + Mortal Combat then buy this, Very good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trans girl plays yoyo and big man grabs you taking half of ur damage, i love the duality of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played with a heavy metal singer girl in all pink, a black vampire samurai, the guy who has like 30 specials and now the bed comes next. currently at like a 35% winrate, the game is peak, after the bed, the girl from CP comes next.\r\n\r\n10/10 what are these characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fighting game, nothing to really critique other than odd balancing choices but its still fun to learn and play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks, I hate this game, I hate Arc Sys, I hate playing Zato, I hate that I can't stop playing Zato...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game\r\ngreat music\r\ngreat artstyle\r\ngreat hand pain\r\n\r\nwhat more could you ask for in a game (it even got marine mammals !!!!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Un juegazo en todo aspecto, un gameplay frenetico y un estilo de arte muy hermoso.\r\n\r\nLo malo serian la cantidad exagerada de DLC's que tiene, pero eso ya parece ser norma en los juegos de peleas actuales, una verdadera pena",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean, cool game, a great one to start from if you're getting into guilty gear, tho kinda less on the technical level than previous games. There are also characters like Potemkin or Happy Chaos that genuinely need to be deleted out of the damn game. Or at least nerfed, idk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oh this game is so awesome, this is my first fighting game and I've been having so much fun! \r\n\r\nI love the art style and all of the weird things you can do, I look forward to this game taking over my life <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun to see yourself get better in real time. Idk how long till I hit a wall but I'm having fun for now",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is so fucking peak would recommend 100/10 !! i just dropped 70 big ones for this totally worth it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got to floor 10 spamming pot buster just to prove that labbing is for nerds and true clowns only need one input, 360p\n\nAs some guy once said\n\nI fear not the man who has practiced 10,000 kicks once, but I fear the man who has practiced one kick 10,000 times.\n\nI am that man, ill see you in tower.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game permanently altered my brain chemistry for the better, 10/10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "this game helped me realize that i do not have the brain capacity for fighting games\nUPDATE: i have gotten better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, better music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Entro al juego\nEntro a rankeds\nPrimera partida: un Goldlewis top player\nPierdo humillantemente\nEmpiezo a jugar Potemkin\n\"Am a fool I know nothing\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are not a fighting gamer, please do not be scared, for i will eat you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "strive 2.0 please :3 \n\nAdd more LGBTQ characters, I love this franchise so much.\n\nThank you for creating these experiences and stories. Me and my girlfriend will cherish them.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "still have no idea what im doing but god damn this music is fire, the character designs are incredible and the visuals are gorgeous",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If I can make music that makes other people feel half of what I feel when listening to this soundtrack, I can die happy.\n\nAlso Nago and Gio are my Goats",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been trying to learn AXL, hopped on online lobby and got my ass handed to me 7 times in a row by an Elphet player, laughed the entire time, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God hates Faust and Faust players. This is canon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Y a aucun autisme qui n'est pas satisfait dans ce jeu et ça c'est parfait",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Over 100 hours in, and I still suck ass. 10/10, would never recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Happy Chaos is a funny and honest character",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "more challenging than teken and has more satidfying mechanics than tekken",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everybody hates everybody, fun fighting game though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool music, characters and the online is solid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Characters are well designed and stages are beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a mentally stable Zato player and I can say this, GGST and the whole series has me by the balls and I love every moment of this game. I love getting zoned out from characters Axl, Venmon, and Dizzy. I love getting DPed by Sol, Ky, Sin, Dizzy, and Leo. I love getting out speed and mixed up by Chipp, I-No, Millia, and Gio. And more so characters having really unique gimmicks like Faust, Asuka, Nago, and Happy Chaos. But the big bodies are amazing like Pot, Bedman, and Goldlewis. It's all the more fun when you play one of the characters that's been consistently bottom tier in all the games(for the most part).\n\nIn all seriousness this game is genuinely one of the best fighting games out there, the gameplay is incredibly smooth and the unique mechanics make this game stand out very much from both Burst and Roman Cancel allowing for more offense and defense. Almost every single character is unique and so different from one another that they all stand out so much from one another, not only from a gameplay perspective but also character design. All the characters are so over the top with unbelievably crazy backstory set in a very interesting world. The whole world running off of magic set in the far future, giant state size zepplins, Japan got nuked again, pirate crew with jets and airships shaped like sea creatures, a weird dimension called The Backyard that contains everything from the Past, Present, and Future. The craziness of the characters and the world is all the better with the god tier Rock n Roll album like OST, I'm convinced there's no other fighting game out with an OST that can be compared to something similar like GGST OST. One of the few OST that I actually added to my playlist and I scream my lungs out too like Crawl, Subhuman, Hellfire, and more.\n\nOf course the games has it flaws like its servers being iffy at times and the story mode being a five hour long movie with mediocre animation and truth be told the story not making sense at times, but that's not to say that the where it lacks in those departments, it makes up for everything else. GGST stands out like like a kid having really dumb ideas and then making them work in ways that it shouldn't and I love it, the series is incredibly fun and different, the gameplay is addictive and overall just an amazing game. It's def worth picking up and playing even if you don't like fighting games, this one is worth a try.\n\n9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "leave me alone in a room with anji mito and baiken's gonna have to take care of another child",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "John Guilty Gear... uhhhh actually idk anything about this just a lot of trans people play this",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I strive... strive to guilt my gear till it's solid [Quque invisible]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game because its fun but i hate this game because im bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This world needs another review saying how great this album that comes with a game is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is cool n all but where is zappa bro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "she guilty my gear. good game good series im never going to recover from this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "floor 3 full of smurfs\r\ni cried\r\nfloor 2 a ghost town\r\nneed therapy\r\nmillia vs everyone",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Banger Rock/Metal Album disguised as a fighting game. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought this game just for Lucy, so i can cyber it all over the punks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gay type fighting game for gay people, i like it.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "EXTREMELY IMPORTANT: It's not listed anywhere for god knows why, but you should NOT BUY THIS GAME if you are still on Windows 10. You may experience connection errors, or, like me, literally just not be able to play the game at all. I'm going to refund, so I advise you spare yourself the time if you don't want to install the spyware of an \"upgrade\" Windows 11 is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Saw some gameplay online and thought it would be fun to try out. I knew it would be rough as my first time playing any fighting game other than smash bros (which I've played a lot casually over the last decade), but I wasn't ready for how demoralizing the beginner tutorial missions would be. All but one took me multiple tries, and I had to look up how to do the tension mission because the timer was too short to build up by mashing buttons (the strat that worked was just... sprinting forward???). Instead of letting you try to perform the task until you succeed X number of times, most all tutorials give you a short amount of time to accomplish the tutorial tasks, and you fail the tutorial if you don't. I know I suck, that's why I'm playing the beginner tutorials, why would you design the tutorials to be so punishing and rub my \"failure\" in??? This completely crushed any excitement I had for trying out the game. No thanks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Low player pool means fighting the same faces over and over again. The game itself is fine, but only the most dedicated fans are still playing, so as a new player you'll be matched with people who have been playing since launch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game took Dizzy's laser fish so it's ass.\n\nAnd if I wanted to play Noel Vermillion I'd play BBCF not Elphelt.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Definitely a step in the wrong direction. The overall game is not as good as GG Xrd was in my opinion.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "protip: dont interact with the community. the community of this game is more cancerous then the TCOAAL community",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Doesn't have Yor Forger as a guest character.\nCan't recommend at the moment.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "wallbreaks arent interesting and every character is less fun in this game than they were in the other games and the game is too zoomed in and air movement sucks and the ranked system sucks and the soundtrack sucks and the keychains suck and the ui SUCKS and i play anji & It was lag\r\n\r\n\r\nhop on bbtag?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "you know this game is good and i enjoy it when playing with friends but it has 2 main problems. 1 almost no one plays it anymore because by the time arcsys added the features fans were asking for, they all left because it took over 4 years so playing ranked takes a ton of time to find an opponent and one you do, you will end up fighting them for maybe 3-5 games . Second the people who stayed play happy chaos , faust, potemkin, and bedman.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is legit  so ass , you cant learn asuka on your own unless you are willing to swap screens 600000 times , 50 percent of the roster has no health and are skilles handless charachters , legit make blazblue games this is ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only played this game briefly a while back but really loved the aesthetic and everything, felt pretty good (overall) to play I thought, but I'm new to the series. Wanted to go pick it back up again because I've been itching to play a 2D fighter again and after seeing how MK1 is being monetized and refusing to be a part of it I thought I'd reinstall GGS and dive in for a while.\n\nOver half the roster is behind a paywall. I have 15 fighters available, there are 17 more that I can't play. I can only imagine what the online scene is like.\n\nNevermind.\n\nEDIT: Oh, AND there's a collab with that donkey-shit garbage Edgerunners? Holy shit, QUADRUPLE nevermind.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only fighting game I ever really got kinda into, but it kinda fell off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "theres nothing wrong with the game im just bad at it which makes me mad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "killed the entire characters backstory and motivation to conform modern audiences(mall cop trannie-jannies from twitter) \n\nThe village that kills twins just got\nvindicated. The problem isn't solved in the slightest. What should have happened is Bridget proving to the village that there's nothing wrong about his sex and that they should stop hurting kids because of their superstition. But no, instead we got Bridget admitting his abusive society was right.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "good fighting game, not a good Guilty Gear game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Smells like dog-feces. Feels like shit. Eyesore. Fire whoever made the lobby system.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when my friends win its because they can play but when i win its because they let me win I love my friends :) play this with your friends :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i got iron 1/1000 in my first placement im uninstalling",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "butt cheeks in playable form",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yea they nerfed my main idk what else to say",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not Kino. Quite awful, really.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the femboy in this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "THAT FUCKING YOYO THAT I HATE",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rock DaBaby in Bridget's command list has grammatical errors",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very weak BlazBlue-like.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cant find match that have good ping",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "blazblue better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst \"guilty gear\" of all time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "do not it has brought nothing but pain",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "disgusting",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "happy chaos",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Buff A.B.A ngl",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Downgrade over xrd rev2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, visually stunning, which is unfortunately ruined by the worst ALT-F4 community I have ever witnessed. Jfc, if you aren't going to fight irl, at least don't leave mid match when you are losing on an online fighter, rats.\nDoes this happen in every game? Yes. But it's on a WHOLE other level in this game. It's a clear change on the devs side, but it seems this game is willing to cater to the bottom of the barrel of the Fighting Game Community by providing NO REAL PUNISHMENT for being a coward, which in turn has made it unplayable. Yeah, it's just a game, but when it happens consistently, back-to-back for an hour straight, it becomes more than a waste of life than it already was. A huge pity.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "This game makes me want to kill myself so bad every time i get hit with some bullshit combo that is true and does 3 quarters of my bar just to get farted on afterwards and die",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "pretty nice fighting game but charging $40 ($60 at the time i bought it) and then also charging $7 per character is crazy. it's just wrong to have to pay that much for a game and only having like a quarter of the roster available.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Whoever decided it was a good idea to make Nago such a boring character to play deserves to lose their job",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can't give the game a recommendation until things are fixed:\n1. Nerf potemkin \n2. Fix ranked mode so that it actually works like a match maker and isn't just picking the same fking guy over and over!\n3. Optimise the laggy stages and animations\n4. Enforce a ranked mode benchmark that automatically lowers display settings on people's machines if they don't meet the standard. I call it the toaster compensation\n5. Reduce the \"connecting to server\" shit, what in christ are you people doing with this? Have never seen this in any other game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is dog water, and strivers will tell you it isn't, if it is your first fighting game, its decent, otherwise there are better options\n\n\nwishlist GunZ the Duel and play that instead brofams",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried to like it but the matchmaking is awful playerbase is low. Gameplay isn't what i'd expect the combos don't feel good to use or go against. The mechanics in the game aren't fun. it's just a worst blazblue. If you are west coast usa I wouldn't recommend it as the game is dead. East coast has players, but it's laggy and just not worth even attempting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "as a casual fg enjoyer and someone who has slight coordination problems, this game is a quite good.\nat the other hand, as someone who is a huge lover of guilty gear's themes and lore, this game feels like a downgrade. on first sight, it felt like a toned down guilty gear, and while gameplay wise it took away insta kills which I think of as an important element in gg, and dumbed down some characters, strive also had its improvements, mostly the roman cancel, but reminder that I am a VERY CASUAL fg player, so my view on gameplay can be taken with a grain of salt or even disregarded.\nnow as for the themes and the lore I'll just make a very quick not-well-thought-out explanation. the story is kind of mediocre, at least where I stopped. I am willing to finish it but... I just don't really want to, I will update this review in the future if I finish it. the story itself is basically carried by the new antagonist happy chaos. and somewhat by Jack-O' and Sol's relationship, which is my favorite part atm, probably being biased. the animation is... not awful but... this game definitely needed to released year later, I in general have not much problems with animation (I'm a winx club fan) but holy shit some parts are actually really bad, and when you compare it to xrd, you won't get too good results for a game released like 4 years after the last major update (that wasn't rollback) of the previous.\nnow the themes, as an avid enjoyer of the aesthetic of previous games, ESPECIALLY OVERTURE, I think... strive kinda lack. it has chains. but not enough chains. it has belts but NOT ENOUGH belts. Dizzy having no belts at all, you could say \"oh but she is queen now\" but I do not think it would be a good excuse, she can still look more modest while still integrating belts into it even if just one. now the menu: holy shit I hated it SINCE THE MOMENT I SAW IT. I'm not kidding both the menu itself and the menu music is disappointing. Xrd already had a pretty simplistic menu, while still having some guilty gear elements, and while I do say the xx games' menu is way more interesting, if they really wanted to go with something simple for the wider audience, they could have just went with something kinda like the xrd menu and make it more colorless. oh and the menu music, the first few times I heard it, it genuinely gave me some mild headache. I constantly play with headphones on and I am autistic with possibly other undiagnosed disorders for that matter. I don't think I need to explain the character select screen, it's just... boring, that's it. it also lack the chains and extras guilty gear had before. now let me talk about something I didn't hear people complain about. the arcade mode. now, the arcade mode is pretty decent by itself, but as someone who played both xx and xrd's (especially xrd's) arcade modes, this tries to follow both and end up making it worse in the way. making certain endings hardly possible for some players, strive follows xx by having multiple endings, and xrd in the cpu level system. xrd work in a way that the cpu level decreases or goes higher depending on your performance in each match. this is also used in strive (in a way it determines the difficulty based on your wins rather than actual performance) to determine which route you'll go on. there are 4 routes: extreme, hard, normal and easy. extreme must be achieved by flawlessly winning EVERY MATCH. by flawless I mean not losing a single round.. once you lose a ROUND, you cannot get back to extreme. you can go to any other difficulty but not extreme. this wouldn't be a big problem, if it didn't have different endings, meaning if you cannot achieve clearing extreme route, you are locked out of getting an ending until you can actually achieve it, which was me, impossible. ARC SYS NERF NAGO!!!! /j. ok I forgot the rest of my complains bye look foward to my full review on the story mode (will be slendering it). make sure to like and subscribe and hit that bell",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you wanna waste hours of your life practicing this game just to have most of your matches be cutscenes where all you do  is either win in 10 seconds or sit there waiting 30 seconds for whatever character to kill you in 2 interactions you will love this shitty fucking fighting game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EXTREMELY IMPORTANT: It's not listed anywhere for god knows why, but you should NOT BUY THIS GAME if you are still on Windows 10. You may experience connection errors, or, like me, literally just not be able to play the game at all. I'm going to refund, so I advise you spare yourself the time if you don't want to install the spyware of an \"upgrade\" Windows 11 is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Low player pool means fighting the same faces over and over again. The game itself is fine, but only the most dedicated fans are still playing, so as a new player you'll be matched with people who have been playing since launch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't have Yor Forger as a guest character.\nCan't recommend at the moment.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game took Dizzy's laser fish so it's ass.\n\nAnd if I wanted to play Noel Vermillion I'd play BBCF not Elphelt.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Definitely a step in the wrong direction. The overall game is not as good as GG Xrd was in my opinion.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "you know this game is good and i enjoy it when playing with friends but it has 2 main problems. 1 almost no one plays it anymore because by the time arcsys added the features fans were asking for, they all left because it took over 4 years so playing ranked takes a ton of time to find an opponent and one you do, you will end up fighting them for maybe 3-5 games . Second the people who stayed play happy chaos , faust, potemkin, and bedman.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is legit  so ass , you cant learn asuka on your own unless you are willing to swap screens 600000 times , 50 percent of the roster has no health and are skilles handless charachters , legit make blazblue games this is ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only played this game briefly a while back but really loved the aesthetic and everything, felt pretty good (overall) to play I thought, but I'm new to the series. Wanted to go pick it back up again because I've been itching to play a 2D fighter again and after seeing how MK1 is being monetized and refusing to be a part of it I thought I'd reinstall GGS and dive in for a while.\n\nOver half the roster is behind a paywall. I have 15 fighters available, there are 17 more that I can't play. I can only imagine what the online scene is like.\n\nNevermind.\n\nEDIT: Oh, AND there's a collab with that donkey-shit garbage Edgerunners? Holy shit, QUADRUPLE nevermind.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only fighting game I ever really got kinda into, but it kinda fell off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "theres nothing wrong with the game im just bad at it which makes me mad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "killed the entire characters backstory and motivation to conform modern audiences(mall cop trannie-jannies from twitter) \n\nThe village that kills twins just got\nvindicated. The problem isn't solved in the slightest. What should have happened is Bridget proving to the village that there's nothing wrong about his sex and that they should stop hurting kids because of their superstition. But no, instead we got Bridget admitting his abusive society was right.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "good fighting game, not a good Guilty Gear game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Smells like dog-feces. Feels like shit. Eyesore. Fire whoever made the lobby system.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when my friends win its because they can play but when i win its because they let me win I love my friends :) play this with your friends :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i got iron 1/1000 in my first placement im uninstalling",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "butt cheeks in playable form",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yea they nerfed my main idk what else to say",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not Kino. Quite awful, really.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the femboy in this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "THAT FUCKING YOYO THAT I HATE",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rock DaBaby in Bridget's command list has grammatical errors",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very weak BlazBlue-like.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cant find match that have good ping",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "blazblue better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst \"guilty gear\" of all time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "do not it has brought nothing but pain",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "disgusting",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "happy chaos",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Buff A.B.A ngl",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Downgrade over xrd rev2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, visually stunning, which is unfortunately ruined by the worst ALT-F4 community I have ever witnessed. Jfc, if you aren't going to fight irl, at least don't leave mid match when you are losing on an online fighter, rats.\nDoes this happen in every game? Yes. But it's on a WHOLE other level in this game. It's a clear change on the devs side, but it seems this game is willing to cater to the bottom of the barrel of the Fighting Game Community by providing NO REAL PUNISHMENT for being a coward, which in turn has made it unplayable. Yeah, it's just a game, but when it happens consistently, back-to-back for an hour straight, it becomes more than a waste of life than it already was. A huge pity.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "This game makes me want to kill myself so bad every time i get hit with some bullshit combo that is true and does 3 quarters of my bar just to get farted on afterwards and die",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "pretty nice fighting game but charging $40 ($60 at the time i bought it) and then also charging $7 per character is crazy. it's just wrong to have to pay that much for a game and only having like a quarter of the roster available.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Whoever decided it was a good idea to make Nago such a boring character to play deserves to lose their job",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can't give the game a recommendation until things are fixed:\n1. Nerf potemkin \n2. Fix ranked mode so that it actually works like a match maker and isn't just picking the same fking guy over and over!\n3. Optimise the laggy stages and animations\n4. Enforce a ranked mode benchmark that automatically lowers display settings on people's machines if they don't meet the standard. I call it the toaster compensation\n5. Reduce the \"connecting to server\" shit, what in christ are you people doing with this? Have never seen this in any other game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is dog water, and strivers will tell you it isn't, if it is your first fighting game, its decent, otherwise there are better options\n\n\nwishlist GunZ the Duel and play that instead brofams",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried to like it but the matchmaking is awful playerbase is low. Gameplay isn't what i'd expect the combos don't feel good to use or go against. The mechanics in the game aren't fun. it's just a worst blazblue. If you are west coast usa I wouldn't recommend it as the game is dead. East coast has players, but it's laggy and just not worth even attempting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "as a casual fg enjoyer and someone who has slight coordination problems, this game is a quite good.\nat the other hand, as someone who is a huge lover of guilty gear's themes and lore, this game feels like a downgrade. on first sight, it felt like a toned down guilty gear, and while gameplay wise it took away insta kills which I think of as an important element in gg, and dumbed down some characters, strive also had its improvements, mostly the roman cancel, but reminder that I am a VERY CASUAL fg player, so my view on gameplay can be taken with a grain of salt or even disregarded.\nnow as for the themes and the lore I'll just make a very quick not-well-thought-out explanation. the story is kind of mediocre, at least where I stopped. I am willing to finish it but... I just don't really want to, I will update this review in the future if I finish it. the story itself is basically carried by the new antagonist happy chaos. and somewhat by Jack-O' and Sol's relationship, which is my favorite part atm, probably being biased. the animation is... not awful but... this game definitely needed to released year later, I in general have not much problems with animation (I'm a winx club fan) but holy shit some parts are actually really bad, and when you compare it to xrd, you won't get too good results for a game released like 4 years after the last major update (that wasn't rollback) of the previous.\nnow the themes, as an avid enjoyer of the aesthetic of previous games, ESPECIALLY OVERTURE, I think... strive kinda lack. it has chains. but not enough chains. it has belts but NOT ENOUGH belts. Dizzy having no belts at all, you could say \"oh but she is queen now\" but I do not think it would be a good excuse, she can still look more modest while still integrating belts into it even if just one. now the menu: holy shit I hated it SINCE THE MOMENT I SAW IT. I'm not kidding both the menu itself and the menu music is disappointing. Xrd already had a pretty simplistic menu, while still having some guilty gear elements, and while I do say the xx games' menu is way more interesting, if they really wanted to go with something simple for the wider audience, they could have just went with something kinda like the xrd menu and make it more colorless. oh and the menu music, the first few times I heard it, it genuinely gave me some mild headache. I constantly play with headphones on and I am autistic with possibly other undiagnosed disorders for that matter. I don't think I need to explain the character select screen, it's just... boring, that's it. it also lack the chains and extras guilty gear had before. now let me talk about something I didn't hear people complain about. the arcade mode. now, the arcade mode is pretty decent by itself, but as someone who played both xx and xrd's (especially xrd's) arcade modes, this tries to follow both and end up making it worse in the way. making certain endings hardly possible for some players, strive follows xx by having multiple endings, and xrd in the cpu level system. xrd work in a way that the cpu level decreases or goes higher depending on your performance in each match. this is also used in strive (in a way it determines the difficulty based on your wins rather than actual performance) to determine which route you'll go on. there are 4 routes: extreme, hard, normal and easy. extreme must be achieved by flawlessly winning EVERY MATCH. by flawless I mean not losing a single round.. once you lose a ROUND, you cannot get back to extreme. you can go to any other difficulty but not extreme. this wouldn't be a big problem, if it didn't have different endings, meaning if you cannot achieve clearing extreme route, you are locked out of getting an ending until you can actually achieve it, which was me, impossible. ARC SYS NERF NAGO!!!! /j. ok I forgot the rest of my complains bye look foward to my full review on the story mode (will be slendering it). make sure to like and subscribe and hit that bell",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you wanna waste hours of your life practicing this game just to have most of your matches be cutscenes where all you do  is either win in 10 seconds or sit there waiting 30 seconds for whatever character to kill you in 2 interactions you will love this shitty fucking fighting game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EXTREMELY IMPORTANT: It's not listed anywhere for god knows why, but you should NOT BUY THIS GAME if you are still on Windows 10. You may experience connection errors, or, like me, literally just not be able to play the game at all. I'm going to refund, so I advise you spare yourself the time if you don't want to install the spyware of an \"upgrade\" Windows 11 is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Low player pool means fighting the same faces over and over again. The game itself is fine, but only the most dedicated fans are still playing, so as a new player you'll be matched with people who have been playing since launch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't have Yor Forger as a guest character.\nCan't recommend at the moment.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game took Dizzy's laser fish so it's ass.\n\nAnd if I wanted to play Noel Vermillion I'd play BBCF not Elphelt.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Definitely a step in the wrong direction. The overall game is not as good as GG Xrd was in my opinion.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "you know this game is good and i enjoy it when playing with friends but it has 2 main problems. 1 almost no one plays it anymore because by the time arcsys added the features fans were asking for, they all left because it took over 4 years so playing ranked takes a ton of time to find an opponent and one you do, you will end up fighting them for maybe 3-5 games . Second the people who stayed play happy chaos , faust, potemkin, and bedman.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is legit  so ass , you cant learn asuka on your own unless you are willing to swap screens 600000 times , 50 percent of the roster has no health and are skilles handless charachters , legit make blazblue games this is ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only played this game briefly a while back but really loved the aesthetic and everything, felt pretty good (overall) to play I thought, but I'm new to the series. Wanted to go pick it back up again because I've been itching to play a 2D fighter again and after seeing how MK1 is being monetized and refusing to be a part of it I thought I'd reinstall GGS and dive in for a while.\n\nOver half the roster is behind a paywall. I have 15 fighters available, there are 17 more that I can't play. I can only imagine what the online scene is like.\n\nNevermind.\n\nEDIT: Oh, AND there's a collab with that donkey-shit garbage Edgerunners? Holy shit, QUADRUPLE nevermind.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only fighting game I ever really got kinda into, but it kinda fell off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "theres nothing wrong with the game im just bad at it which makes me mad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "killed the entire characters backstory and motivation to conform modern audiences(mall cop trannie-jannies from twitter) \n\nThe village that kills twins just got\nvindicated. The problem isn't solved in the slightest. What should have happened is Bridget proving to the village that there's nothing wrong about his sex and that they should stop hurting kids because of their superstition. But no, instead we got Bridget admitting his abusive society was right.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "good fighting game, not a good Guilty Gear game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Smells like dog-feces. Feels like shit. Eyesore. Fire whoever made the lobby system.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when my friends win its because they can play but when i win its because they let me win I love my friends :) play this with your friends :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i got iron 1/1000 in my first placement im uninstalling",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}