{
  "positive": [
    {
      "review": "This game is fantastic because it is what you make it. If you don't want to grind quests, don't. If you don't like decorating, play quests. There are dozens of ways to spend your time. It can be overwhelming at first, but it is easy to pick up on the different game mechanics for players of all skill levels and ages.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "The downsides: \r\n- This game was originally supposed to release for free and never did. \r\n- Lasting bugs w/o fixes. The mailbox crash, the forever red dot in the menu, bugged quests for example. \r\n- Microtransactions via premium currency and items. More on this in the upsides. \r\n-Limited placed item limits (up to 3k individual types of item/6k total items on PC). This drastically limits decoration ability, but I can understand it to avoid lag in game. \r\n\r\nThe upsides: \r\n-Regular introduction of new content. New characters, new realms, new items, new DLC, etc. There is a lot to do. \r\n-Time limits aren't really a thing, outside of specific timed events. \r\n-Free premium currency all of the time. You'll find it around the valley in chests, you'll get it for entering DreamSnaps. In over 600 hours, I have never felt like I *had* to purchase premium currency. \r\n\r\nIf you enjoyed ACNH, but wished you had more to do, give this one a shot. You have all the crafting, fishing, gardening, decorating of ACNH with the addition of character and story quests. But catch it on sale. Full price in this economy? Nah.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "love this game. it's like if animal crossing met disney characters.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Disney Dreamlight Valley is an absolutely charming and delightfully cozy experience. It offers the perfect blend of relaxation, creativity, and adventure, checking every box for the type of game I love to play. With each update, it continues to grow and improve, making the world feel even more magical. I truly adore this game!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Constantly updating with cool new stuff and adding more and more Disney characters. You don't have to spend a ton of money to get premium shop stuff, you can tell the people who made this game are Disney fans themselves. The characters have more of a recognizable personality from their original media than most straight from Disney stuff nowadays, it's so sanitized and automated. This game gives me an excuse to let myself be a cringey Disney adult sometimes.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Such a fun game! I have been procrastinating from getting it since I;m not a huge Disney fan, but its better than  I expected! There isn't a time crunch, and you don't have to accomplish quests right away, its just a fun little go at your own pace kinda game.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game is so fun! There is so much to do and so many loveable characters! The graphics are amazing and the controls are easy to learn. This is such a great way to play!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Literatly can get lost in this for hours. I've tried to buy this for every person in my family that plays games.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love that this game is constantly being updated. If all you play is the base game, there will still always be new updates and more content to play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredible Cozy Game.\r\n\r\nThe community oriented events that are weekly help you get in game currency.\r\nThe stories we used to love and know, can be extended and you can adventure with your fav characters.\r\nThe cozy village style game is perfect with so much to offer. \r\nThe building and decorating and limitless styling is so unique and fun.\r\nThe constant ability for a company to hear their communities wants and needs and help meet those is reassuring!\r\nNot to mention a gorgeous game with bright colors and full of magic and life!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While I am greatly upset that they're refusing to fix the bug regarding Buzz's quest to locate Aliens in the Valley, it's been years either yeet and delete or fix it already, I still recommend this game. There's always something to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely LOVE this game. From being an Animal Crossing and Sims player this game has just the right amount of game play and customization to keep a player locked in for hours straight!!! Cannot wait to try Wishblossom ranch tonight on launch day!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing when I want over the course of like 3 years and it's had its ups and downs but 2k hours might do that. I'm in love with the game. Today's expac is amazing, as well. I def recommend especially if you like cozy and no need for pause or actual battle. Vanellope is the most aggressive character LOL (and she's not).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing since it first released in Early Access. If you enjoy the cozy life-sim concept, this game is for you, it allows you to gather, farm, and build at a leisurely pace with all of your favorite characters and fun companions that will follow you around. You can take a break from grinding for materials and quests through the Star Path's that they release quite often. The star paths are great to unlock new items. \r\n\r\nThey have added DreamSnaps - a weekly community-voted competition where you can earn moonstones, moonstones are needed to purchase items from the premium shops (paid currency). \r\n\r\nThe game is a live-service title with a steady stream of free updates, new characters,  features, and paid expansions offering new realms and story content, keeping the experience exciting. \r\n\r\nI give it a 10 out of 10 and I have been playing for over 1600 hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I avoided this game for a while because I was wary of the microtransactions being left in. I worried it would be one of those things where you can only get cool stuff or progress by throwing more money at a game you already spent money to even play. I did some research and found out it really isn't that bad, so I grabbed it on sale. I am so glad I gave it a chance. As someone who loves Animal Crossing and grew up on Disney, this game scratched that itch that Animal Crossing left. Dreamlight Valley takes some of the best things about ACNH and makes them better, plus... there's SO MUCH TO DO. I played for about 7.5 hours today and just barely began to even scratch the surface of the beginning stages of gameplay. The moonstones that came with the initial purchase were enough to unlock the premium star path, and I even earned back a lot of them. I got some pretty sweet stuff from it right away. If you're on the fence about the game because you were put off for the same reason I was, I recommend just playing it. You don't need to buy anything extra, unless you want DLC later (I read not to buy the DLC until I was done with the base game, since it would be an overload, and I can see what people mean). The game is really charming and nostalgic for me, and even though I'm not a fan of where Disney has gone with their style, I'm still enjoying the more modern Disney characters. Super happy to see all the originals around too, which was my childhood.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best \"Cozy\" game I've ever played. The mechanics are very forgiving which makes playing / taking a break very forgiving. The character and level design are adorable, and the constant Disney references show that the people are design the quests like the characters they're writing. The DLC is great, the store is pricey, but you can get by just fine without it. The base game has plenty for you to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "most of my free time im playing this game. love the disney inclustion but that one minni mouse quest that needs 200 clay im glad i stocked up",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game works wonderfully and is a nice relaxing game the only draw back is a lack of male outfits, this game is heavily geared to women and it shows, outfits for men are few and far between the item shop gets far more female clothing, and I as a male feel less welcome in the game because of it. i still do like the game but it makes me feel like an outcast as a male who wont cross-dress. I also should say i played on switch for a long time before upgrading to pc version. switch version did not work that well and load times made the game unplayable pc is far better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In general an amazing game. SO many lovingly designed details, so much to discover, very cozy, very cute but I agree, before releasing another expansion, please fix the bugs. Like, c'mon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my favorite game. I love how calm and beautiful it is.  I love that they continually update with free content in the original game.  I have bought A Rift in Time too, and i wish there was a way to make that more seamlessly integrated into the original map, so we don't have to leave Dreamlight Valley. Why couldn't they have just made the original map bigger, with more areas to unlock? It just feels clunky to have another whole realm.  the Mini Realms in the castle are great, but these huge extra realms are hard for me to get used to. I do want to add the two newest ones at some point, but it looks a little daunting to me.  I'm not a huge gamer - this is one of like three games i enjoy, so I suppose my opinion isn't normal, but I thought maybe it would be valuable to put out there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a casual craft and basic story game with disney characters. Sometimes the camera is wonky as hell, and it absolutely runs better on PC than Switch (I have both). You're paying for the Disney licensed game, so I think it's overpriced for what it provides. But! All that said, as I've gone through the storylines, it actually touches on a lot of emotional trials many of us go through, and I think the way it offers a small outlet to talk about it is really special.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nostalgic without changing anything about the old stories, kept true to the characters and added just more adventures with them. everyone's inner child is sighing in relief with this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing since testing, really cute game. Love how they keep adding to the game, even if I don't love the price tag that come with some of it xD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing DDLV for a few years now and it is my favorite game yet! I own it on every device we have. The visuals are amazing and the story lines just reel you in and keep you entertained. The new DLC (Wishblossom Ranch) has to be my favorite drop yet! Highly recommend this game to all the Disney lovers!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My girlfriend really loves this game tookover my account and asks for money for this game but anything to make her happy :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing game and i love getting to spend time with my favorite disney charecters they definetly matched the charectors personalities",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game so much! Such a calming, fun environment and extremely family friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing for almost 500 hours i still like the game. i recommend it. But there are alot that could be changed or made better. but that's for alot of games i think. but for me personally i really like to invest my time with playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game since it first released and have over 500 hours in it now. I truly love this game for the gameplay, characters, decor, & story and the fact there is so much to do. Even if I am not playing this game regularly I always find myself logging in every now and then to complete some quests or the starpath - I always find myself opening this game again and again. The price can be intimidating but with the free content updates and amount of content I think its worth it. You can also earn the in-game paid currency through dreamsnaps and I rarely have bought moonstones. I do also love some of the DLCs but understand they are expensive and its not easy for most people, however I enjoy the amount of content you get in each DLC and the new characters, spread out over a year it is doable for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for relaxing after a long day, or for playing on a weekend for a couple hours. Can be a bit grindy for some quests, but there's no time limit on getting things done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My only regret: not playing sooner.\nI bought the game shortly after release but only started playing like two or three months ago.\nOh all the star paths I missed ....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, it still has many problems to be solved, but even so it's very interesting and has a lot of potential to expand over time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So cozy and fun with lots to do. Can be a bit grindy, but you can always take a break and talk to your dream light friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After going so long without updates to ACNH I finally caved and bought this game. I'm happy to report it has scratched that \"itch\" of befriending villagers and decorating the island, with the bonus of it containing classic (and newer) Disney characters.\n\nMy BIGGEST ick of the game is the main story quest. [spoiler]I absolutely despise the actual villain of this game: \"The Forgetting,\" which is literally a purple, depressed version of your own character. WHY?? Thankfully, you can hide the character via the map once you've finished the main story but you'll still run into it at restaurants and other quests. It doesn't help that its voice lines are incredibly cringe and bounces between a masculine/feminine voice.[/spoiler] So, uh, TW: This game has moments where loneliness/depression/intense thoughts are discussed and the game advises you to NOT continue the quest if you are not in the right headspace. Would love to know why the devs thought this was the right direction for the main story. I still enjoy the game overall but man it's a bummer sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i left this this when it first came out cuz it was just annoying but later this month i came back and this game is mad fun been capturing every critter and doing almost everything in game so yes i urge people to give this game a go and play your own way 10 out of 10 tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game to play with my toddler she loves all the characters and helping me do there quests as well. If you are a Disney fan this game does the characters justice. Also love the fact that you can get the premium currency for free (albeit not a lot at a time). Most of my hours are on game pass but it does have cloud saving so you can share progress between platforms!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to just sit back and chill after a long day. I love Disney and recommend this to all the Disney adults out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy Disney game, highly recommend for people that like to decorate and do quests at their own pace",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game and all the updates that keep coming out for it! They are constantly adding new characters, items to the shops, and listening to feedback on how to make things better for players. I've been so impressed with the constant updates and that even after putting in so many hours, I still have TONS to do!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 would recommend! \n\nI'm not really a big fan of disney but this game is soo fun and addictive even for someone who knows very little about disney characters. The quests are the perfect balance of being just challenging enough to keep things interesting, but not too challenging to where they feel daunting. The story is soo good and well thought out, I wish I could experience it for the 1st time again. \n\nThere's something so satifying about turning this run down valley into a beautiful home for all your disney character friends by decorating and customizing furniture, placing trees, flowers, pathing, and bushes. Then there's the weekly dreamsnap challenges, it adds a nice little event to look forward to every week for free moonstones, which otherwise would have to pay for. The game is also updated quite regularly so there's always new free content to look forward to and the community is super sweet and helpful.\n\nDon't hesitate, just buy the game already! It's so worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is relaxing as it's a game that let's you do what you feel like doing. No pushing or forcing you in a  specific direction. Hop in and do what you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much, With all the Disney, pixar character it's like a dream games come true",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So cozy and nostalgic. Love that they give a lot of updates and keep a lot of content rolling in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly quite fun and enjoyable. Definitely nostalgic with many characters you'll recognize from popular Disney franchises. There's so many things to do and you can hang out with you favorites while doing them!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the coziest game with great, constant updates from devs! game started getting glitchy on my nintendo switch, so i got the game on steam and it runs great on my PC! love the amount of content; there’s a never ending supply of things to do and some great DLC’s",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Disney Dreamlight Valley is one of those rare games that immediately wraps you in warmth and nostalgia the moment you step foot into its magical world. It blends the cozy freedom of life-simulation games with the heart and personality only Disney can provide — creating an experience that’s both relaxing and surprisingly emotional.\nThe gameplay is a perfect mix of chill and engaging such as gathering resources, customizing your home, completing character quests, decorating the valley, cooking, mining, fishing, designing outfits, and more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. It has it's kinks, like any game. But, the devs do listen to the community. Which is more than I can say for many other games I have played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only thing i dont care for is the pricfe of everything when this was going to be a free to play!! otherwise the devs put in the most effort into a game ive ever seen. also thank yall sm for getting rid of that damn new game option bc i stopped playing for two/three years when i accidentally deleted my ENTIRE progress and didn't even get back my actual paid for rewards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game!  Currently my favorite!  I'm loving the new Wishblossom Ranch expansion!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. I've played this game for over 230 hours now and am absolutely in love with it. The visuals, the soundtrack, the recognisable characters... It's just so nostalgic. I absolutely recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've not missed a day of playing it since I got the game -- is that bad? Maybe; Is it worth it? Yes. \nFor a Disney lover, it's a perfect chill game to have in the library, especially for Steam Deck users. \n\nThe story unexpectedly hit me a little in the feels, but hey, maybe that's just me. Lmao. \n\nThe daily chores and tasks can be tedious and at times repetitive, as well as a little overwhelming and 'grind-y' especially in the beginning, but going about the game on your own pace is better than rushing through it. \n\nEnergy to doing tasks is consumed, but it's easily gained back by eating food, resting, or going into your house -- it's not time based regeneration. \n\nYou won't have to spend much money, if at all, unless you REALLY REALLY want to (DLCs). The in-game currency (Moonstones) can be earned through participating a weekly photo event which is a fun way to get involved in the game and the rest of the DDV community too. \n\nIt's cute and cosy, definite recommend for cosy-gamers, and a bonus if you're a Disney fan~ \nPlus as far as I'm aware, a majority of the voice actors in the films reprised their characters for the game which I found pretty cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, only downside is the time of in game is set in real time so if you play at night it will be night.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is massive. Yes, it’s expensive (it’s on sale right now though!) but you get an unbelievable amount of content for the price. I just finished leaving a not-so-nice review of the newest dlc so I thought I’d come here and counter my own review with a positive review for the base game (and the first two expansions, for that matter) \n\nI first tried this game through Apple Arcade and I was mad that I couldn’t use the premium shop or participate in the Star Paths (mad that I couldn’t give them money, I guess? lol) so I ended up putting it down for a while and then my husband and I bought each other Steamdecks for our anniversary and this game went on sale shortly after that and the rest was history, ha. I’ve got an embarrassing number of hours in this game and I’ve given Gameloft more money in premium shop purchases than any other game I’ve ever played (and I play MMOs!) The IP makes it a comfort game and there is literally no skill barrier of entry to play as the entire gameplay system is fetch quests, collection, hoarding (lol), and decorating. There is a storyline and it’s surprisingly poignant (I very much enjoyed the base game storyline and it made me feel even MORE attached to my valley and “everyone” in it (I’m aware of the problems with this, tyvm, haha)  It’s a super chill game that asks nothing of you in terms of skill or progression, everything is at your pace and it’s all easy to do, nothing is very difficult (puzzles, etc) \n\nI also like that Gameloft gives you a way to earn Moonstones (the aforementioned thing I have spent ungodly amounts of real money on, ie the premium currency) by way of daily bonus chests and weekly photo challenges. I suck at the photo challenges (not rly, I’m just lazy and never do them) so that’s why I buy moonstones, but people who do them consistently and do them well can score in the thousands of moonstones weekly and that adds up. You can buy most of what you want from the premium shop this way; again, if you’re not a bougie B like me and Pedro and don’t just buy your way to happiness 🩷 \n\nThe decorating options in this game are bonkers, I’d say it’s a decorating game at its heart, with a Storyline Lite sprinkled in and a super popular npc cast of Disney characters to keep you company and run around with. People who say the game feels “dead”, I have to wonder if they’ve unlocked all of the possible characters yet. Yes, they’re all surface-level interactions but there are SO many nice wandering around at any given time that it really almost feels like a town or village that’s actually alive, or at least it’s definitely not “empty and dead” - maybe it’s just me, but for a solo game, I never feel lonely because there’s always a nice and sweet Disney character around that’s saying some corny or cheeky. \n\nI definitely recommend this game if you want a simple fetch quest gameplay loop with extensive collection mechanics built in, a storyline that gives you the feels but isn’t super heavy on the “have to do”s, and plenty of paid and free decorating objects to adorn your Valley and biomes with. The DLCs add even more to the game and I’d recommend the first two wholeheartedly, but wait on Wishblossom for a bit. It’s very expensive for what you get. But the base game + first two expacs will easily keep you so so busy until they iron out the new one!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing since early access but I recently had to start over after I was unable to place Daisy's boutique in my valley. Had no issues after starting over and it's been interesting starting over with the DLC. It gives you so much more to do and as long as you don't let it overwhelm you which it definitely can. It's okay to take your time doing things. \nSome things are worded weirdly in the game and it's easy to just google a solution. Plus the DDV streamers are all super nice and friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game.  It's a great way to relax after a long day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy slow paced cozy types of games this is deffinetly a game to try out! There is loads of content to play in the base game, that's  before you even add on the now 3 DLC's witch each gives a whole new map with multiple areas to explore and new villagers to meet. \r\nI enjoy the relaxed time of getting on the game and choosing what I want to do, if I want to gather and make the gift's for my villagers, to farm and harvest, or to just take the time to sit back and decorate my village or house. I have quickly put many hours into the game and I didn't think I would enjoy it as much as I do. I did think I was going to get bored quickly, but I constantly find something new to explore or do and it keeps the game exciting because I can always change what I want to do in the game, and there is no time gating or having to go to bed in the game. If I run out of energy I can simply dip into my house or make a meal to regain the energy.\r\nThis is such a great relaxing game if you just want something for yourself to put time into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my favourite games, and I would highly recommend buying it. Talking to the characters (at least the ones I know) feels like you're actually talking to them and not just reading someone's interpretation of the character. There's always something to do, from collecting materials to doing friendship quests with the villagers to unlock cool rewards. This is one of the only games that I know of that gives its premium currency away for free too, you can get at least 700 moonstones in a week just by participating in the dreamsnaps challenge and collecting the daily moonstone chest, which is extremely nice for someone like me that can't spend loads of money on moonstones every week. On top of that, the customer service team was very helpful the one time I encountered a bug in a character's quest that left me unable to complete the mission: they responded within a week and sent me the item I needed to finish the quest.\r\n\r\nThe only downside I've experienced is having to buy the game and it's DLCs multiple times on multiple platforms, if you want to buy the game I'd recommend just buying it and it's DLCs on the PC since the difference in performance between that and console versions is INSANE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun, and quite well made. however i have expearianced some game stopping bugs. for example, i had to deal with remy not registering me talking to him until i logged off, did another quest, and then went and talked to him, for every. single. task. ive also had the issue of not being able to plant the orb of nurturing because the game wont register it as a seed. annoyying, but not world ending. i just want scar man... besides that, i suggest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great relaxing game! Expansions are fun but really wish they lowered the price a bit since there are so many.\nAll the Disney characters and decor really brings out the nostalgia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite cozy games. It isn't time gated like a lot of cozy games. I dont feel rushed with a daily timer and there is always something to do. Customization is key here. Unlike many cozy games, you can customize your entire village and make some AMAZING things. Only downside is that you can't romance anyone, like you can in many others of the genre. However, I cant say I want to romance Disney Characters so....\r\n\r\nAnyways, buy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always keep coming back to Disney I love the game and how much you can customize yes there are some bugs but they do try to fix them at least in my case with the few I had. if you want a sims style game but with Disney this is for you! hope you enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cute and cozy game, you can spent your days farming, chatting, looking at cute animals. no stress of having to do anything at certain times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly addictive cosy game that doesn't make you feel like there's a time crunch to complete all objectives . \nRainy days or a relaxing evening after a busy is the reason I keep returning and of course to see Jack Skellington everyday makes life complete hehe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun chill game. No major challenges and fun if you want to sit back and relax with nostalgic disney characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is soo much fun! So much to do! the characters and lands are amazing. I hope this game goes on and on with endless possiblities!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my gf started playing this game last year but it was the switch version... BOOOO to the switch version. It was so bad, I was literally pooping all over this game. but i caught it on sale on steam shortly after I got a brand new, high-spec computer. and Wawaawawoooooowwwiieewaaa! it's really freaking good. I mean, this game has so much Disney, you will end up buying yourself an ANNUAL PASS so you and your girlfriend can be HYPE together... IF you live in Florida, that is. Get this game if you dare, it's up to you, I really don't care!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most cozy game I've ever played! Love the million opportunities to build whatever cozy place I want! ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun. I like that there's lots of quests and things to do and customize.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cant recommend this game enough. Highly addictive and always somethkng to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the quests and decorating this game has. its relaxing but there are some puzzles along the way to keep it from being boring. its a great story about reliving and revisiting your childhood!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not only is it a relaxing game to play, there is some amazing story telling as well as customizations for your character. I have played since release and the fact there are 3 DLC now is AMAZING. I consistently come back to play when I need a chill moment to relax and mindless tasks as well.\r\n\r\n10/10 recommend and it would be a long time before I change my mind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable. Apart from the familiarity of the characters, this game provides more motivation to continue playing, than similiar games like Animal Crossing, through the stories of unlocking characters and new gameplay in expansions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Disney fans who enjoy light gaming are sure to love this. I love getting to help my favorite characters while also dressing my avatar and decorating my valley. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super cute game! Can be very overwhelming at first with all of the friendship quests, building your valley, etc... But if you just take your time and enjoy the game it is great and keeps you busy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great way to unwind from a long day. It's fun and you can decorate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. I have always been a big Disney fan. I love the characters, quests and story. Excited for more releases DLC and free. There is always more to do and build and design.\nWhether you love to collect everything or just casually play, there is something for every one. An easy pick up and put down game with no stress if you don't play for a few days or weeks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game, good storyline, continuesly updating with new content, overall fun and relaxing game to play. They give you lots of time to complete certain things such as the star pass they offer, as well as a way to earn paid currency for free by competing in decorating contests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great! A little bit grindy and a few bugs here and there. But it is a wonderful game. Pretty chill Disney adaptation of animal crossing with an interesting plot. Lots of fun things to decorate and dress up with, absolutely love the content you can get from the store!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is easy to play, fun, cute and they are doing something fun and extra a lot.  Very relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun cozy game. I like that I can play at my pace and not get punished for it, plus I get to see my favorite disney characters. The options for clothes and furniture are almost endless. There are some bugs in the game that could be fixed, but support is usually easy to contact, though it might take a few days for a response. I do wish that they would do more patches instead of waiting until adding content to the game, but other than that I'm happy with the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Title: A Magical Adventure I Can't Put Down!\n\nRating: ★★★★★\n\nDisney Dreamlight Valley has completely captured my heart! As someone who’s always loved Disney, this game is a dream come true. It’s the perfect blend of life-simulation, adventure, and Disney magic.\n\nThe world is beautiful and charming, with so many characters and areas to discover. It’s been so fun unlocking new characters and helping them with their quests. Whether it’s cooking meals for Goofy, fishing with Mickey, or gathering materials for crafting, there’s always something relaxing to do. The quests are engaging, and I love how each character has their own little story arc that adds depth to the game.\n\nThe customization options for both your character and your village are fantastic. I feel like I’m truly creating my own little Disney paradise. The art style is gorgeous, and I can’t get enough of how detailed everything is, from the flowers in the gardens to the sparkling waters around the valley.\n\nWhat really stands out is the sense of progression. There's always something to work towards—whether it's expanding your valley, upgrading your tools, or unlocking new areas. The game has a very cozy, rewarding feeling to it, and it's perfect for anyone who loves games that allow you to relax, be creative, and immerse yourself in a vibrant world.\n\nThe soundtrack is also lovely and fits the vibe of the game perfectly. I’ve found myself just wandering around the valley, enjoying the music and the atmosphere.\n\nIn short, Disney Dreamlight Valley is an absolute gem. If you’re a Disney fan, a lover of life-simulation games, or someone who enjoys relaxing but engaging gameplay, I highly recommend giving this game a try. I can’t wait to see what future updates bring!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried it out and quickly fell in love! I love the grind and getting to interact with my favourite characters, and I especially love the questing! As a designer I also enjoy the character and clothing customization part of it! <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are ups and downs to this game, however you play at your own leisure! \n\nI've played this mostly on my switch, i have 1,200 on switch but moved to PC because Switch is just bad for this game, maybe it will do better on Switch 2. But PC is where it is at! The graphics are better, fps is better and decorating isn't tedious and so much easier navigating! \n\nFor you to be able to get good things in game you must involve yourself with dreamsnaps and try to get a good score for moonstones as everything in the Premium shop is money related. Though the items do come back and you can keep 2 items pinned for when you want to buy them. But it's a pick and choose system if you don't buy moonstones. \n\nThe quests can be very time consuming and can become buggy, and there are always bugs in this game but they do their best to fix them, but it's a waiting game for that.\n\nIt's quite easy to get burnt out on this game if you play it too much ~ Which happened to me so i frequently go back to try to ease my way into it. \n\nI think it's worth it if you like cosy games, even though it's grindy the game plays smoothly and you can have a lot of fun. I'm not a Disney fan but i enjoy the game :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great and cozy game! It has multiple tasks and an interesting storyline! There's a lot of grinding needed but i enjoy it! And of course, it's Disney. Who wouldn't love it? Definitely recommend it if you like animal crossing or stardew!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great cozy game.  New content regularly with enough to keep a couple hours a week player like me going for years lol.  they keep improving and listening to the players, i LOVE that! Def worth the money.  I would encourage PC game play just for how much easier it is then on the switch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just recently picked it up and find it entertaining. The quests are straight forward and not too daunting to get through. The story line is a little vague but if you don't care and just want to decorate its a fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though quests can be longer at times the game is amazing and it's great to see each of the Disney characters they've added and continue to add.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun but I can only play in measurements to not feel burnt out. Quests can take a little while but overall fun. Give it a 4/5 stars. The horses help. I like to go fast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of my favorite games. I had it on switch, and finally grabbed it here on PC and it's been a lot of fun actually going through and doing all the stuff that this game has to offer. I highly recommend for a disney fan and even those that just enjoy a cozy time that has a lot to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Disney Dreamlight Valley combines elements from The Sims, Animal Crossing, and Stardew Valley, in a way that makes it a very good casual experience to return to regularly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! great for a chill night in especially for disney lovers! there are always new characters coming into the game and always something to do in the valley and DLCs!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has opened a door to healing that I never knew was waiting for me. It's a mixture of nostalgia, embracing your self, and reviving hope in an increasingly difficult world. This place is an amazing sanctuary for young and old alike, and it only continues to grow with time. I feel like a kid again, in the best way possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love that the game is regularly updated with expansion and fixes! Different characters and task/quests to complete! Always such a beautiful environment and ability to be create with characters and world!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 Recommend. Great gameplay, great visuals, great music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almost having played for 1,200 hours I can say that this game is very well worth it.\n\nThis game sure can be played by kids but the main story line touches subjects that only an adult would understand and I think having such a nice, well made game that brings a nostalgic touch to it is gold.\n\nThis game has so much to do in it, and the devs keep gifting us with great updates every few months so you never run out of stuff to do.\nThe amount of detail, love and care they put into this game is massive. They listen to the players when suggestions are made, always making the game better and better.\n\nI can't say enough good words about this game. 1000% recommend <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Contemplated getting the game for a long time for some reason, regret the contemplation. There is so much to do and it is very relaxing and fun! Just don't burn yourself out by playing 24/7 like me lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a good, cozy game for relaxing on the couch or a rainy night on the PC. always has new content and updates for you so you never get bored.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like that you can take your time with the game or knock everything out if you choose to. Even with just the base game there is a lot to do and they still add things for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Animal Crossing like game but with Disney characters and it's ACTUALLY fun and actually has so much content. Super easy to sink hours into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried on other platforms - can be relaxing.  However, the cost and time sink of acquiring more items for the game could be its undoing for me.  Still enjoyable with the base set.  Would recommend for the right price, such as nearly any Steam sale.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game as been nothing but lies and unkept promises, it started by them assuring people that it would eventually become free to play, and buyers were just getting early access, this was not true, as they backpeddled and continue to charge to this day, wouldn't have been a big deal if they hadn't shoehorned in a cash shop even during early access, with very expensive micro-transactions. Then they promised not to price wall story content, which they did with the DLCs they have released on top of buying the game, and their expensive DLC shop contents, finally there was FOMO battlepasses right out of the gate, so if you DIDN'T  buy in day 1, there is stuff you can't ever get access to, including limited time event items, so people waiting for F2P got screwed over, only for it to never actually go free to play, and finally to top it all off, they were offering teired purcheses at launch, so if you bought the ultimate edition, you'd think you would have gotten the DLC, but you don't, you can only get it from buying the ultimate edition now, so people who bought in early (and for a lot of money) still have to shell out for DLCs too. \nThis game was fun until it got bogged down in so much greed, unkept promises and FOMO exclusive content in a COLLECTION GAME, buy if you want a similar experience to going to a Disney park I suppose.\n\nAll my playtime is from the early access period before my opinion was soured by greed, backtracking and realising just how FOMO-y this game would be.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I've got a ton of hours in this game and the game itself - I do really like. However, I bought the first two DLCs about a month before the third DLC was announced, and I have HUGE regret. If I'd know they were going to pay wall an actual mechanic (riding a mount) behind the next DLC then I wouldn't have bothered to give Gameloft another cent of my money. \n\nThis game already did people dirty by promising \"free\" and then not delivering, but when you paywall a better playing experience it feels like the single-player version of pay to win. REALLY wish I could refund this game entirely tbh. Paywalling the ability to ride a mount is so skeezy to me.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "10 mins in and I'm introduced to my first microtransaction. I'm not a fan of half a game I paid for having everything meaningful locked behind a  wall of spending more money. Besides that, I was utterly bored and disinterested in the initial quests. It didn't seem as if any of my choices made a real difference to the outcome of anything. Very linear. This game may be for some but it's not for me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really like the game. I think its a nice cozy disney game. The reason why my review is negative is because of how monetization is being handled. You really only get 2/3 DLC's in the ultimate edition. You have to buy the first expansion by itself (For 30 bucks on top of getting the base game). They said this game was gonna be free to play. And I thought 'okay cool I'll buy the first expansion see what happens'  Then all of a sudden changed their mind. To get specific villagers you want you HAVE to buy the DLC that they're in. They could have simply made a new realm with Snow white. But no you have to pay 30 bucks to have her in your village. Want Maleficent in your village? Pay 30 bucks for the DLC that she's in. I really love this game I really do. It's just I can not support this game with the expansions its releasing and barely giving stuff for free.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "How hard would it have been to implement save files for a game like this? Steam family sharing doesn't work with this game's DLCs, so how many times do I have to buy this game and its DLCs so everyone in the family can play? Kids under 12 don't really need their own Steam accounts, why can't they share?\n\nIt's also not that special of a game, it's a sloppy Animal Crossing clone with really boring gameplay, minimal controls and character interaction, etc.\n\nThere are also reportedly game-breaking bugs where if you complete a quest out-of-order, it breaks the quest and you have to start your save file over. Utter slop for something with the Disney name. We know Disney can hire devs who create quality titles like Disney Adventures or Disney Epic Mickey: Rebrushed.\n\nThere are also microtransactions which is absurd for a full-priced game with full-priced DLCs aimed at children.\n\nDisney + greed = Gameloft, watch out for the Gameloft name because it means cash grab.\n\nDon't tolerate this behavior and don't let your kids watch/fall in love with the trailer. It's a trap.\n\nThis will be my last Gameloft title. Hopefully Disney feels the same.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "so many bugs some make progressing some quests impossible. other are just annoying, some bugs have been known for years and not been addressed seems like a cash grab to throw out new content but dont fix the bugs micro transactions are rampant the games fun but i cannot recommend with the amount of game breaking bugs id refund but i went past the 2 hour mark so was refused",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "First... please don't take my not recommending this as a bad review. This game is fun and it's cute being able to befriend so many Disney characters. But this game has essentially become a money grab. They initially said this game would be free but now it's $51 (CAD) for the base game and now there are editions that range from $76-102. And then there are DLCs costing around $40. It's just ridiculous at this point. And then on top of all of that you can buy ingame currency and premium starpaths to get better items (you can earn these in the game but the grind is a slog). It's become very clear what the devs of this game's priorities are. \n\nI will still play this game and maybe... maybe consider buying future DLCs if they ever go on a super sale. But this game is just so overpriced I can't really recommend it unless you've got money to burn. There are so many other games that are cozy with similiar mechanics that either are actually free or are much more affordable because with this the only thing you're paying for is the Disney branding and they haven't done anything to prove that it's actually wortht he price tag.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it was fun to start with but theres a lot of bugs. Some bugs aint fixed and they just release new expansions. My boyfriend got so much lag with the main game that he had to quit playing. No lag at the expansion maps but you cant use those maps for starpaths (gives a lot of loot and can take weeks-a month to make). They said they aint gonna fix the lag problem that ppl got. Which is sad, my boyfriend played since day one.\r\nMost ppl make storage rooms, but theres still 7-8 items u cant place on a table, items from the main game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What Works\n\nBase game: Fun and charming, with enjoyable exploration, quests, and Disney character interactions.\n\nSecond DLC content: Adds story and character moments that are engaging when experienced.\n\nWhat Falls Short\n\nFirst DLC: Uninteresting, lacking compelling content.\n\nSecond DLC structure: Splitting the content into two parts disrupts progression and reduces enjoyment.\n\nPricing: The high cost of additional content makes further investment less appealing.\n\nThe base game is enjoyable and full of charm, but DLC quality is uneven. The first DLC fails to excite, and the second DLC’s split format interrupts the experience. Considering the cost of further content, continued investment is less compelling.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I bought this game because I thought it looked cute and would be fun to play. I got as far as the Remy quest only to have it not register the completed dish. I tried everything I could find on the internet to get it to register to no avail. When I exited the game and came back in, Remy had me making the next dish but in the tracker, it said to make the fruit salad. So because I was frustrated I went to a different quest. I crafted the signs for McScrooge. I watched several videos to find out where to place them. I did that but it never registered. Soooooo Frustrating. I have asked for a refund. It is very disappointing for a game to have been out almost 2 years and have run into these glitches so early in the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was one of the players who bought this game in Early Access. Getting an Early Access deluxe version, I expected a few perks in the end, as well as being able to play the game before it went Free to Play.\r\nI love this game, and I want to recommend it to people. But I havent been able to play it since they announced their first DLC.\r\nInstead of going Free to Play, they raised the price and then announced a DLC. However, that DLC would not be given to the players who had (in good faith) bought an Early Access version of the game. Then they said you can buy the game and expansion pack for a discount. But absolutely no discounts were offered to the people who bought a 'deluxe' version of this game, back when it was new.\r\nNow they have the audacity to put out 2 more expansion packs, all for 30 dollars a pop. On top of the price of the regular game. Again, the people who got the 'deluxe' version back in the day were offered no discounts on the DLC. But new players could (and still can) buy the game and DLCs together, and get a discount in total. You see the rub here?\r\nI wsa hoping this studio would be different than the rest of Disney, but clearly not. I would take my money elsewhere, and I regret ever spending a penny in the first place.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm done with this game. After they messed up and didn't correctly launch the Deluxe Version of the Wishblossom Ranch (I was thinking maybe it would be an upgrade you could get later like in some other games) I sent in a help request asking them questions- do I need to purchase the full thing? Do I just upgrade it to get the items, etc. Instead of answering my questions- the CS Rep literally told me this issue was my fault for rushing to buy something that I didn't want. Didn't answer a single question. Just blamed me for spending my money on their game. Message received. Uninstalling. There are plenty of other games to spend my money on and in.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I would love to recommend this game. \n\nIn the past, I absolutely would have. At the beginning, this was a beautiful game full of nostalgia, a moving storyline, beautiful graphics.. just all around fun to play, a delight! \n\nNow? It's all about microtransactions, overly pricey expansions with small shallow storylines and a crazy grind, bugs all over the place.... and items we PAY for that we don't recieve. \nIt's become Disney Dreamlight Greed instead of Disney Dreamlight Valley. Game breaking bugs are ignored, things we never recieve and never will recieve show as not collected in game, the store RNG is extremely terrible.. I've played this game since it released and I STILL as missing items from the store that Scrooge refuses to sell....\nThe newest paid expansion is still extremely buggy, the past expansions marked finished are NOT finished and still very buggy. Storylines are abandoned, the order the characters have been released in are very odd choices to say the least... Cruella and Hades before Hercules and Pongo/Perdita? I know they need a \"conflict\" for the story but... there is so much more but.... well I digress. \n\nBugs and issues are not fixed in a timeley manner, frustrations abound... \n\nThe game is fun. It really is. The frustrations that are being experienced by players that are never resolved are really ruining what is a wonderful game underneath it all. \n\nI suggest the developers start sending out customer surveys... asking about experience and improvements, what players would like to see in game. If they did that and started implementing those fixes and additions I think the game could really turn around and become fun again and would restore some of our faith in Disney Dreamlight Valley. As it is, I'm not sure I will buy another expansion, or anymore real money purchases in game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I sometimes get nauseous from these type of games, but often there are settings available that prevent this from happening. Unfortunately this game has 0 settings that could possibly help. The only camera setting they have is the speed at which it follows with your mouse, which does not help whatsoever.\nSeems like a fun game and would love to play it with a friend, but unfortunately I cannot due to these missing settings",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bugs keep you from completing crucial missions. Lame. PLease, give me a refund. I",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "We are experiencing the same bugs many others are experiencing with villager's homes being closed and downgraded (Scrooge, Remy, others). Scrooge's is completely inaccessible! Merlin's house just up and vanished, like a fart in the wind. Who knows how many other problems there are? \n\nWe were so devastated that we've lost all interest in playing. This after spending over 200 hours in the game and buying a DLC. There's no way they're getting another penny out of us.\n\nMajor game-breaking save file issues THAT AFFECT MANY PAYING CUSTOMERS need to be addressed - TOP PRIORITY. We're warning anyone who would be interested in Dreamlight Valley to steer clear... at least until they make it right but we're not holding our breath.\n\nGameloft needs to be ashamed of themselves for being so careless and while also being so disgracefully greedy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For how much money the game cost, I expected the graphics to be better. It really feels like a cheap attempt at a cash grab. The plot seemed interesting but most of the mechanics reminded me of Palia, which I find to have better graphics and textures.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So- I get that it's day 1 launch of Wishblossom Ranch- but wouldn't you test your own project before launching something??? Especially something you're selling??\r\nIt's completely broken Dreamlight Valley.\r\n1. I can't even place furniture anymore.\r\n2. I've had to restart the game multiple times because I'm trapped in menus. \r\n3. Legitimately, got to wishblossom ranch and then it wouldn't let me name my horse lol\r\nPlease. Fix it. Then give me moonstones as an apology or smth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Money pit and costs too much for the play time you'll have after all quests are done. All you'll do is cleanup everyday.  There's no storyline. It's filled with quests for each new character, but after that's done there's nothing at all. Each day, you get to go clean up the purple thorny vines, mounds of stone, herbs everywhere, mushrooms, coral, mounds of ice, etc.  It's just nothing but a boring grind with no purpose or story.  \n\nHere are the current characters in base game and all DLC:\nAladdin/Jasmine/Jafar\nAlice/Cheshire Cat\nBelle, Cogsworoth, Lumiere, Beast, Gaston\nMerida\nfairy godmother\n\"The Forgetting\"\nHades\nAurora/Maleficent\nOswald\nMirabel\nAnna, Elsa, Kristoff, Olaf\nJoy/Sadness\nStitch\nDaisy, Donald, Goofy, Mickey, Minnie, Scrooge\nMaui/Moana\nMike/Sulley\nMulan/Mushu\nPeter Pan\nRemy\nMother Gothel, Flynn, Rapunzel\nNala, Pumbaa, Scar, Simba, Timon\nAriel, Eric, Ursula\nTiana\nMerlin\nJack Skellington/Sally\nBuzz Lightyear/Woody\nWALL-E/EVE\nVanellope\n\nThere's too much of ugly clothes, furniture, etc. Then there seems to be an obsession about turbans in Scrooge's store daily. One day, there were 7 among the three stores.  Never see a western style cowboy hat or anything much American, mostly turbans.  After you buy the few things you like, there'll be a vast amount of expensive ugliness.  In case you still like to go \"goo goo, gah gah\" there are little kids dragon pets and pegasus that look like they're made for someone 4 years old or younger.  This game has such little kiddie things in it, but is inappropriate for anyone under 12 or so.  \n\nDo you want your children walking around with a skeleton, witch or wizard?  Be warned that there are a lot of \"witch\" items in this game. From the middle of Sept until now, they had that witch stuff going and still do. Tim Burton's Nightmare Jack Skellington is in the game living in a tree house with a cauldron, Sally, and a Christmas tree made of BONES!  This is not an innocent children's game.  They even brought in, at the beginning, the \"fairy godmother\", but not Cinderella.  Evil Mother Gothel lives in a tree in the swamp and has a cauldron. Her long dress has a very low neckline, inappropriate for children. Ursula, the sea witch, also has a cauldron in her grotto. You decide. The player can even have a cauldron and make potions.  Is this game teaching children witchcraft?\n\nThe cost of Disney Dreamlight Valley and its DLC is as follows:\nBase Edition: $39.99. \nEnchanted Edition: $79.99 (base game, Rift in Time, Storybook Vale, exclusive items and 18,000 moonstones)\n\nWishblossom Ranch DLC: $29.00 (includes 5,000 Moonstones). \nDeluxe Edition: $49.99 (includes 10,000 Moonstones and exclusive items).\nDLC: A Rift In Time $29.99\nDLC: Storybook Vale $29.99\n\nThese prices change.\n\nMoonstones:\n$4.99/1200 moonstones\n$9.99/2500\n$29.99/8500\n$49.99/14500\n$54.99/16500\n\n\nThen, you can spend more in the Shop that changes every Wed. for more items. Don't worry you can spend real money on moonstones to buy what you want. Many people spend $20/week on moonstones.  You don't have to spend any though, but you won't get those extra clothes, tools, pets, houses, cauldrons, etc.  You can enter Dreamsnaps every week and get from 300 to 4,000 moonstones for them.  Daily, you'll get a blue chest with 50 moonstones in it.  Be advised that one house can cost 3750 moonstones though.  \n\nWould I buy this game for my children or grandchildren (if I had them)? NO!  Disney is not innocent anymore. (IF it ever was.)  People say that all of that is just for fun, but there's people asking that \"evil animals\" be added to the game.  Will they want PVP next?  (PVP is player versus player: player killing other players.)\n\nOne of the lastest gowns is so low cut that more than half the breast shows!  Then there's guys making dreamsnaps wearing girl's clothes and girls wearing mustaches and beards.  You decide what that is all about. One homosexual male did say he likes the game because he's allowed to wear female clothes. You decide.\n\nOne person's review says, \"its fun and kids get to be who they want to be even if that mean kids get to be inappropriate.\"",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a buggy mess. Quest imperitive items will disappear from your inventory and then you have to jump through all sorts of bullshit hoops to get help, not to mention they won't answer you inside of a week and a half, and when you bring that up: \r\n\r\n\"Let me kindly draw your attention to the fact that I have already responded to your request, but for your convenience I will duplicate the information for you\"\r\n\r\nInstead of actually addressing your frustrations. If you wanna be treated like trash by the people tasked with helping you, go ahead and buy the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love the game but it is to much money to have nice things in the game, so if you haven't started i would suggest you not if you don't want to spend a metric ton of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At this point, the game is basically unplayable. It freezes and has to be closed out 1) every time I try to open a clothing bag/the intro gift from Merlin, 2) try to purchase something required to complete a beginner quest which unlocks house/storage expansions, and 3) any time an animal has the option of becoming a companion/familiar which happens automatically and can't be avoided if you want to complete other animal-related requests. Load times to start the game each time it crashes near 5 minutes. So my 5 hours of play time is probably closer to 4 with a full hour since I started playing of resetting the game and waiting for it to load. I was hoping that I could just avoid the clothing bags, but now that it is other mandatory tasks for the main quest and non-optional cut scenes that are causing the issue, I am at a loss. I have lost progress every time. I feel anxious about any new unlock or level up because I don't know if it will trigger a crash. I reached out to GameLoft with this issue and they told me they were sorry it hadn't been fixed in the last hotfix and basically to wait. This game was over $40. It has been out for years. Why is it still experiencing issues as if it just released? And to this extent? Steam will also not refund me at this point because I played for too long, hoping that the bug would be peripheral and could be avoided. I'm so disappointed. I'd been looking forward to playing this game for a long time and finally saved up for it, just for it to be at least an hour of sitting, looking at a loading screen after experiencing another crash. I wish I could be refunded and come back when they get it together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not Recommended...\n✔️ 45+ hours played\n\nAt first, I loved this game. It was cozy, charming. But over time, it turned into one of the most frustratingly greedy games I’ve spent money on.\n\nIf you're a big Disney fan, you'll probably still find joy here. But be warned: this game is no longer about fun and creativity. It's become a monetisation machine.\n\n🎮 Gameplay\n\nThe core gameplay loop is relaxing and enjoyable\n\n- Complete quests with Disney characters\n\n- Decorate your valley\n\n- Farm, mine, cook, and craft\n\n- Explore themed realms\n\nThere's a ton of running back and forth, and certain quests feel like filler designed to slow you down and stretch playtime.\n\nPost launch, there hasn't been meaningful progress on the main story in over a year. Most updates are just seasonal events, reskins, or content locked behind another paywall.\n\n⚙️ Customisation & Progression\n\nCustomisation is the heart of the game. Outfits, furniture, valley layout, it’s all here and looks great. But so much of it is now locked behind:\n\n- Premium currencies!\n\n- FOMO-driven battle passes!\n\n- A high-priced cash shop!\n\nOh, and if you want your valley to look amazing? Be ready to either spend money or feel like you're constantly missing out.\n\n🪙 Monetisation Model\n\nHere’s where it really falls apart\n\nThe game was originally promised to be Free-to-Play\nThen they:\n\n- Made it Buy-to-Play permanently....\n\n- Kept the free-to-play-style monetisation system....\n\n- Introduced a $38.99 (CAD) DLC the same day it left early access....\n\n- Launched a premium shop with rotating FOMO items....\n\nContinued with seasonal Battle Passes (Star Paths) that offer little on the free tier and hide the best content behind the paid track....\n\nYou pay full price for the game!\nThen pay again for the DLC!\nThen keep paying if you want premium outfits, furniture, or to access better rewards during events!\n\nIt's the worst of both worlds, a full-priced game with the cash shop of a mobile gacha....\n\n📈 Content & Story\n\nContent updates are frequent but often shallow\n\n- New characters rarely have deep quests\n\n- Still waiting to unlock areas teased since launch\n\n- Events and new items mostly serve to push you into the shop or Battle Pass\n\nThere was a story about the Forgetting, the ruler of the valley, and mysterious magic, but it's barely moved in over a year. Everything since has felt like stalling.\n\n🔁 Development & Communication\n\nThe developers started strong\nBut communication has dropped off\n\n- Updates are often buggy\n\n- Multiplayer was added, but it’s extremely limited\n\n- Bug fixes are slow\n\n- Key issues remain unfixed for months\n\nWorse, they still show characters in trailers that aren’t in the game, even after two years\n\nIt really feels like the priority shifted from making a good game to maximizing profit.\n\n❌ Downsides\n\n- Microtransactions in a non-free game\n\n- $40 DLC for features that should’ve been base game\n\n- Star Path is FOMO-fueled and punishing if you skip it\n\n- Premium shop uses paid currency, with tiny drip-feed earn rates\n\n- Story is stagnant\n\n- Customisation is great but often locked behind paywalls\n\n- Major quality-of-life features still missing\n\n- Still buggy after two years\n\n- Very little depth once you’ve played 20-30 hours\n\n- You can’t even sit on most furniture\n\n✅ Final Thoughts\n\nIs the game fun? Sometimes, yes\nIs it worth the money? Not anymore\n\nWhat started as a wholesome, relaxing Disney life sim has become a pay-to-decorate cash grab. If this were free-to-play as originally promised, I’d be more forgiving. But charging players for a half-finished game and then nickel-and-diming them for everything else is inexcusable.\n\nIf you care about cozy sims and Disney, this might still hook you.\nBut if you care about ethical monetization and value for money? Skip this.\n\nThere are better, cheaper, and more honest cozy games out there.\n\n5/10\nFun at first, but ultimately a corporate disappointment wrapped in nostalgia.",
      "voted_up": false,
      "votes_helpful": 172
    },
    {
      "review": "Fix your game before releasing another expansion. \n\nI have lost hours worth of my time and energy. Every time i build areas and close the furniture mode it doesn't save correctly, Everything gets reset back to before i started decorating. I am tired of loosing all my work for dream snaps. I started this game for the build mode. and I am so close to uninstalling. I have spent so much on and in this game, I loved it but cannot keep making excuses for it. THIS IS A GAME BREAKING BUG which has been going on for over a year. I have been playing since day 1. I own all expansions. Bought moon stones. over 1200 hours in game play. \n\nThis game is no longer early access. These issues should have been solved months ago. \nclipping errors in premium items. \nItems not showing up properly. \nCamera Getting stuck in photo mode.\nCharacters not moving when you run into them so you get stuck.\nHiding characters or sending them to their homes doesn't work 90% of the time. \nMore issues to talk about but I am tired.",
      "voted_up": false,
      "votes_helpful": 125
    },
    {
      "review": "I love Disney characters as much as the next person, but this game is just fetch quests and grinding. There’s no real interaction with characters that matter, you can choose any dialogue option and it will not effect anything. There are micro transactions within the game, mainly cosmetic reasons but I don’t feel that is necessary when people have already spent $40+ on a game that was originally announced to be free to play at some point. Disney greed kill this for me, the worlds feel so lifeless.",
      "voted_up": false,
      "votes_helpful": 126
    },
    {
      "review": "I haven't touched this game in a long time and I enjoyed it at first, but for a game THIS EXPENSIVE to have microtransactions? It really , and I mean REALLY, rubs me the wrong way. I  dropped the game only because the amount of quests to keep track of are INSANE. I'm giving it a thumbs down which makes me sad, but it's not necessarily a bad game. It's just. . . meh. You do a lot of running around and a lot of waiting.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "This game as been nothing but lies and unkept promises, it started by them assuring people that it would eventually become free to play, and buyers were just getting early access, this was not true, as they backpeddled and continue to charge to this day, wouldn't have been a big deal if they hadn't shoehorned in a cash shop even during early access, with very expensive micro-transactions. Then they promised not to price wall story content, which they did with the DLCs they have released on top of buying the game, and their expensive DLC shop contents, finally there was FOMO battlepasses right out of the gate, so if you DIDN'T  buy in day 1, there is stuff you can't ever get access to, including limited time event items, so people waiting for F2P got screwed over, only for it to never actually go free to play, and finally to top it all off, they were offering teired purcheses at launch, so if you bought the ultimate edition, you'd think you would have gotten the DLC, but you don't, you can only get it from buying the ultimate edition now, so people who bought in early (and for a lot of money) still have to shell out for DLCs too. \nThis game was fun until it got bogged down in so much greed, unkept promises and FOMO exclusive content in a COLLECTION GAME, buy if you want a similar experience to going to a Disney park I suppose.\n\nAll my playtime is from the early access period before my opinion was soured by greed, backtracking and realising just how FOMO-y this game would be.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "I've got a ton of hours in this game and the game itself - I do really like. However, I bought the first two DLCs about a month before the third DLC was announced, and I have HUGE regret. If I'd know they were going to pay wall an actual mechanic (riding a mount) behind the next DLC then I wouldn't have bothered to give Gameloft another cent of my money. \n\nThis game already did people dirty by promising \"free\" and then not delivering, but when you paywall a better playing experience it feels like the single-player version of pay to win. REALLY wish I could refund this game entirely tbh. Paywalling the ability to ride a mount is so skeezy to me.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I hate the predatory in-shop prices. This should be free to play at the shop prices they charge, and I enjoyed it for a while, until the customisation became dependant on you splashing more money down and the devs went back on what the game was going to be (free to play), which, let's be honest, in these style of games, is everything. Another gotcha game on the market... Great! Don't get the praise, just another soulless cash grab--but I guess that sums up Disney pretty well right now. In-game currency, season passes and additional DLCs are milking this one sour as hell!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "10 mins in and I'm introduced to my first microtransaction. I'm not a fan of half a game I paid for having everything meaningful locked behind a  wall of spending more money. Besides that, I was utterly bored and disinterested in the initial quests. It didn't seem as if any of my choices made a real difference to the outcome of anything. Very linear. This game may be for some but it's not for me.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "First... please don't take my not recommending this as a bad review. This game is fun and it's cute being able to befriend so many Disney characters. But this game has essentially become a money grab. They initially said this game would be free but now it's $51 (CAD) for the base game and now there are editions that range from $76-102. And then there are DLCs costing around $40. It's just ridiculous at this point. And then on top of all of that you can buy ingame currency and premium starpaths to get better items (you can earn these in the game but the grind is a slog). It's become very clear what the devs of this game's priorities are. \n\nI will still play this game and maybe... maybe consider buying future DLCs if they ever go on a super sale. But this game is just so overpriced I can't really recommend it unless you've got money to burn. There are so many other games that are cozy with similiar mechanics that either are actually free or are much more affordable because with this the only thing you're paying for is the Disney branding and they haven't done anything to prove that it's actually wortht he price tag.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really like the game. I think its a nice cozy disney game. The reason why my review is negative is because of how monetization is being handled. You really only get 2/3 DLC's in the ultimate edition. You have to buy the first expansion by itself (For 30 bucks on top of getting the base game). They said this game was gonna be free to play. And I thought 'okay cool I'll buy the first expansion see what happens'  Then all of a sudden changed their mind. To get specific villagers you want you HAVE to buy the DLC that they're in. They could have simply made a new realm with Snow white. But no you have to pay 30 bucks to have her in your village. Want Maleficent in your village? Pay 30 bucks for the DLC that she's in. I really love this game I really do. It's just I can not support this game with the expansions its releasing and barely giving stuff for free.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "How hard would it have been to implement save files for a game like this? Steam family sharing doesn't work with this game's DLCs, so how many times do I have to buy this game and its DLCs so everyone in the family can play? Kids under 12 don't really need their own Steam accounts, why can't they share?\n\nIt's also not that special of a game, it's a sloppy Animal Crossing clone with really boring gameplay, minimal controls and character interaction, etc.\n\nThere are also reportedly game-breaking bugs where if you complete a quest out-of-order, it breaks the quest and you have to start your save file over. Utter slop for something with the Disney name. We know Disney can hire devs who create quality titles like Disney Adventures or Disney Epic Mickey: Rebrushed.\n\nThere are also microtransactions which is absurd for a full-priced game with full-priced DLCs aimed at children.\n\nDisney + greed = Gameloft, watch out for the Gameloft name because it means cash grab.\n\nDon't tolerate this behavior and don't let your kids watch/fall in love with the trailer. It's a trap.\n\nThis will be my last Gameloft title. Hopefully Disney feels the same.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Micro-transactions and bans people for just going on the multiplayer.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "so many bugs some make progressing some quests impossible. other are just annoying, some bugs have been known for years and not been addressed seems like a cash grab to throw out new content but dont fix the bugs micro transactions are rampant the games fun but i cannot recommend with the amount of game breaking bugs id refund but i went past the 2 hour mark so was refused",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i've played the entire og game and a rift in time. I've spent many hours with this game, and if it weren't for the fact there was a bug in storybook vale, i would absolutely recommend. however, i'm stuck on the quest to get aurora and can't move forward at all in the storyline. womp womp womp.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve been dealing with a major bug in DreamSnaps for ALMOST 5 MONTHS (so i can't unlock Vanellope at all), and it completely broke that part of the game for me.\n\nI’ve contacted Gameloft support with full details, including the fact that I’ve already tried every basic troubleshooting step: restarting my device, reinstalling the game, resetting my profile, and even starting from scratch SIX times.\n\nAfter waiting weeks for a reply, their “solution” was just to tell me to… RESTART, REINSTALL, and RESET — which I had clearly mentioned I already did.\n\nIt’s honestly exhausting to wait weeks for copy-paste answers instead of real help. I used to love this game, but this kind of support is unacceptable. Please actually read and address player reports.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game was fine until I finished the dream snaps tutorial. Now, the stupid notification to participate will not go away. It pops up every 30 seconds. I keep saying not now, and it keeps popping back up. I wish I could get my money back now because I can no longer make any progress in the game. I can't go back to a previous save and not finish the tutorial either.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really want to play this game but the head bobbing is too much, please consider making an option to turn it off. It causes eye strain, headache and nausea in many people. \n\nThe game itself is enjoyable but this one problem makes it unplayable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "For the most part, I have enjoyed this game, despite the fact that it's grindy, especially if you aren't putting in any more money than just buying the base game.\n\nRecently, however, I have had so many issues that have impacted any progress, and I haven't even bought any of the DLCs.\n\nI lost all of the upgrades I made on Remy's restaurant and Scrooge's shop. I was able to get Remy's open again, and some of the upgrades for free, but I am completely locked out of Scrooge's shop without any option to reopen it and try to upgrade it back to where it was. The only response I got back was that the engineering team was looking into the issue. Meanwhile, I can't receive rewards for tasks involving buying things from his shop.\n\nI have also had multiple issues where I can't make progress on getting new characters into my village (at least in Monster's Inc. and Beauty and the Beast for Cogsworth and Lumiere) because I can't interact with the items on the map that are needed for progressing. \n\nI'm still in contact with support on Monster's Inc, and the Beauty and the Beast issue was something I just encountered. I will update later if these issues are solved, but I'm just frustrated that there are still a lot of things wrong with the base game and they keep putting out additional things for people to buy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cute despite the horrid graphics. Nostalgic enough to cause me to excuse the red flags. It was fun until it wasn't.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really enjoy playing Dreamlight Valley, but I have to say I don’t appreciate the in-game purchases. One of my friends bought me the game as a surprise gift- it was much cheaper for them than it is for me- and I truly appreciate it. I love animation and Disney movies, and this game captures that at least to an extent. \n\nHowever, when I considered the prices, I realized that in my country- and for many others- I simply cannot afford the additional content. I cannot imagine paying full price for the base game, which already offers a lot, and then having to spend even more on in-game purchases. I don’t think that’s fair or adequate for a game like this, especially given the Disney brand.\n\nI even looked into the revenue, and honestly, it seems excessive. It feels greedy, and it’s difficult for players like me to fully enjoy the game because of the cost.\n\nI love the game itself, but the pricing for in-game content is a major barrier.\n\nI can’t wholeheartedly recommend it, as the price is so high, and yet I do not get the full game experience, not to mention the additional in-game purchases that I simply cannot afford.\nNote : \nYou can gather Moonstones daily, but I feel they don't give enough considering the amount you'd need to spend on one event for what you'd want.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "it was fun to start with but theres a lot of bugs. Some bugs aint fixed and they just release new expansions. My boyfriend got so much lag with the main game that he had to quit playing. No lag at the expansion maps but you cant use those maps for starpaths (gives a lot of loot and can take weeks-a month to make). They said they aint gonna fix the lag problem that ppl got. Which is sad, my boyfriend played since day one.\r\nMost ppl make storage rooms, but theres still 7-8 items u cant place on a table, items from the main game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The fact that I came back to the game for the new DLC, after not playing for a year, and it's literally littered with bugs is very telling. \n\nRemy's restaurant and Scrooge's store were all downgraded even though I had fully upgraded them before. Remy's restaurant could be \"fixed\" by upgrading it again via the sign, but Scrooge's Store is completely broken, and some of my NPCs are trapped in there. There is no way to upgrade it back to its previous state. \n\nThe wells are broken half the time as well. They literally just don't work. \n\nFix the game before pumping out new DLC.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Your world can never be clean and pretty you have to play constantly and constantly be cleaning and it never ends. Its just stressful now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Base game is enjoyable for a while, but it does get tedious faster than most village building games. The pricing for DLC is also wild and should not be supported.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I can't recommend buying the game at the moment. The game has a lot of bugs. And I mean a lot. You can get stuck and have to restart your game just by talking to certain characters seemingly at random. Any interaction has the possibility of softlocking your game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What Works\n\nBase game: Fun and charming, with enjoyable exploration, quests, and Disney character interactions.\n\nSecond DLC content: Adds story and character moments that are engaging when experienced.\n\nWhat Falls Short\n\nFirst DLC: Uninteresting, lacking compelling content.\n\nSecond DLC structure: Splitting the content into two parts disrupts progression and reduces enjoyment.\n\nPricing: The high cost of additional content makes further investment less appealing.\n\nThe base game is enjoyable and full of charm, but DLC quality is uneven. The first DLC fails to excite, and the second DLC’s split format interrupts the experience. Considering the cost of further content, continued investment is less compelling.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I bought this game because I thought it looked cute and would be fun to play. I got as far as the Remy quest only to have it not register the completed dish. I tried everything I could find on the internet to get it to register to no avail. When I exited the game and came back in, Remy had me making the next dish but in the tracker, it said to make the fruit salad. So because I was frustrated I went to a different quest. I crafted the signs for McScrooge. I watched several videos to find out where to place them. I did that but it never registered. Soooooo Frustrating. I have asked for a refund. It is very disappointing for a game to have been out almost 2 years and have run into these glitches so early in the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It got pay-to-play, don't buy it unless you are rich.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I was one of the players who bought this game in Early Access. Getting an Early Access deluxe version, I expected a few perks in the end, as well as being able to play the game before it went Free to Play.\r\nI love this game, and I want to recommend it to people. But I havent been able to play it since they announced their first DLC.\r\nInstead of going Free to Play, they raised the price and then announced a DLC. However, that DLC would not be given to the players who had (in good faith) bought an Early Access version of the game. Then they said you can buy the game and expansion pack for a discount. But absolutely no discounts were offered to the people who bought a 'deluxe' version of this game, back when it was new.\r\nNow they have the audacity to put out 2 more expansion packs, all for 30 dollars a pop. On top of the price of the regular game. Again, the people who got the 'deluxe' version back in the day were offered no discounts on the DLC. But new players could (and still can) buy the game and DLCs together, and get a discount in total. You see the rub here?\r\nI wsa hoping this studio would be different than the rest of Disney, but clearly not. I would take my money elsewhere, and I regret ever spending a penny in the first place.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm done with this game. After they messed up and didn't correctly launch the Deluxe Version of the Wishblossom Ranch (I was thinking maybe it would be an upgrade you could get later like in some other games) I sent in a help request asking them questions- do I need to purchase the full thing? Do I just upgrade it to get the items, etc. Instead of answering my questions- the CS Rep literally told me this issue was my fault for rushing to buy something that I didn't want. Didn't answer a single question. Just blamed me for spending my money on their game. Message received. Uninstalling. There are plenty of other games to spend my money on and in.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Broken and money grabbing. everything i surface level. lets say you put time in this game. Doing quests an making friends. Prepare to halt everything because some quests are so broken... it game breaking. Save your hard worked money and go for an actually game. That creators love.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would love to recommend this game. \n\nIn the past, I absolutely would have. At the beginning, this was a beautiful game full of nostalgia, a moving storyline, beautiful graphics.. just all around fun to play, a delight! \n\nNow? It's all about microtransactions, overly pricey expansions with small shallow storylines and a crazy grind, bugs all over the place.... and items we PAY for that we don't recieve. \nIt's become Disney Dreamlight Greed instead of Disney Dreamlight Valley. Game breaking bugs are ignored, things we never recieve and never will recieve show as not collected in game, the store RNG is extremely terrible.. I've played this game since it released and I STILL as missing items from the store that Scrooge refuses to sell....\nThe newest paid expansion is still extremely buggy, the past expansions marked finished are NOT finished and still very buggy. Storylines are abandoned, the order the characters have been released in are very odd choices to say the least... Cruella and Hades before Hercules and Pongo/Perdita? I know they need a \"conflict\" for the story but... there is so much more but.... well I digress. \n\nBugs and issues are not fixed in a timeley manner, frustrations abound... \n\nThe game is fun. It really is. The frustrations that are being experienced by players that are never resolved are really ruining what is a wonderful game underneath it all. \n\nI suggest the developers start sending out customer surveys... asking about experience and improvements, what players would like to see in game. If they did that and started implementing those fixes and additions I think the game could really turn around and become fun again and would restore some of our faith in Disney Dreamlight Valley. As it is, I'm not sure I will buy another expansion, or anymore real money purchases in game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I sometimes get nauseous from these type of games, but often there are settings available that prevent this from happening. Unfortunately this game has 0 settings that could possibly help. The only camera setting they have is the speed at which it follows with your mouse, which does not help whatsoever.\nSeems like a fun game and would love to play it with a friend, but unfortunately I cannot due to these missing settings",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bugs keep you from completing crucial missions. Lame. PLease, give me a refund. I",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "We are experiencing the same bugs many others are experiencing with villager's homes being closed and downgraded (Scrooge, Remy, others). Scrooge's is completely inaccessible! Merlin's house just up and vanished, like a fart in the wind. Who knows how many other problems there are? \n\nWe were so devastated that we've lost all interest in playing. This after spending over 200 hours in the game and buying a DLC. There's no way they're getting another penny out of us.\n\nMajor game-breaking save file issues THAT AFFECT MANY PAYING CUSTOMERS need to be addressed - TOP PRIORITY. We're warning anyone who would be interested in Dreamlight Valley to steer clear... at least until they make it right but we're not holding our breath.\n\nGameloft needs to be ashamed of themselves for being so careless and while also being so disgracefully greedy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For how much money the game cost, I expected the graphics to be better. It really feels like a cheap attempt at a cash grab. The plot seemed interesting but most of the mechanics reminded me of Palia, which I find to have better graphics and textures.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So- I get that it's day 1 launch of Wishblossom Ranch- but wouldn't you test your own project before launching something??? Especially something you're selling??\r\nIt's completely broken Dreamlight Valley.\r\n1. I can't even place furniture anymore.\r\n2. I've had to restart the game multiple times because I'm trapped in menus. \r\n3. Legitimately, got to wishblossom ranch and then it wouldn't let me name my horse lol\r\nPlease. Fix it. Then give me moonstones as an apology or smth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Money pit and costs too much for the play time you'll have after all quests are done. All you'll do is cleanup everyday.  There's no storyline. It's filled with quests for each new character, but after that's done there's nothing at all. Each day, you get to go clean up the purple thorny vines, mounds of stone, herbs everywhere, mushrooms, coral, mounds of ice, etc.  It's just nothing but a boring grind with no purpose or story.  \n\nHere are the current characters in base game and all DLC:\nAladdin/Jasmine/Jafar\nAlice/Cheshire Cat\nBelle, Cogsworoth, Lumiere, Beast, Gaston\nMerida\nfairy godmother\n\"The Forgetting\"\nHades\nAurora/Maleficent\nOswald\nMirabel\nAnna, Elsa, Kristoff, Olaf\nJoy/Sadness\nStitch\nDaisy, Donald, Goofy, Mickey, Minnie, Scrooge\nMaui/Moana\nMike/Sulley\nMulan/Mushu\nPeter Pan\nRemy\nMother Gothel, Flynn, Rapunzel\nNala, Pumbaa, Scar, Simba, Timon\nAriel, Eric, Ursula\nTiana\nMerlin\nJack Skellington/Sally\nBuzz Lightyear/Woody\nWALL-E/EVE\nVanellope\n\nThere's too much of ugly clothes, furniture, etc. Then there seems to be an obsession about turbans in Scrooge's store daily. One day, there were 7 among the three stores.  Never see a western style cowboy hat or anything much American, mostly turbans.  After you buy the few things you like, there'll be a vast amount of expensive ugliness.  In case you still like to go \"goo goo, gah gah\" there are little kids dragon pets and pegasus that look like they're made for someone 4 years old or younger.  This game has such little kiddie things in it, but is inappropriate for anyone under 12 or so.  \n\nDo you want your children walking around with a skeleton, witch or wizard?  Be warned that there are a lot of \"witch\" items in this game. From the middle of Sept until now, they had that witch stuff going and still do. Tim Burton's Nightmare Jack Skellington is in the game living in a tree house with a cauldron, Sally, and a Christmas tree made of BONES!  This is not an innocent children's game.  They even brought in, at the beginning, the \"fairy godmother\", but not Cinderella.  Evil Mother Gothel lives in a tree in the swamp and has a cauldron. Her long dress has a very low neckline, inappropriate for children. Ursula, the sea witch, also has a cauldron in her grotto. You decide. The player can even have a cauldron and make potions.  Is this game teaching children witchcraft?\n\nThe cost of Disney Dreamlight Valley and its DLC is as follows:\nBase Edition: $39.99. \nEnchanted Edition: $79.99 (base game, Rift in Time, Storybook Vale, exclusive items and 18,000 moonstones)\n\nWishblossom Ranch DLC: $29.00 (includes 5,000 Moonstones). \nDeluxe Edition: $49.99 (includes 10,000 Moonstones and exclusive items).\nDLC: A Rift In Time $29.99\nDLC: Storybook Vale $29.99\n\nThese prices change.\n\nMoonstones:\n$4.99/1200 moonstones\n$9.99/2500\n$29.99/8500\n$49.99/14500\n$54.99/16500\n\n\nThen, you can spend more in the Shop that changes every Wed. for more items. Don't worry you can spend real money on moonstones to buy what you want. Many people spend $20/week on moonstones.  You don't have to spend any though, but you won't get those extra clothes, tools, pets, houses, cauldrons, etc.  You can enter Dreamsnaps every week and get from 300 to 4,000 moonstones for them.  Daily, you'll get a blue chest with 50 moonstones in it.  Be advised that one house can cost 3750 moonstones though.  \n\nWould I buy this game for my children or grandchildren (if I had them)? NO!  Disney is not innocent anymore. (IF it ever was.)  People say that all of that is just for fun, but there's people asking that \"evil animals\" be added to the game.  Will they want PVP next?  (PVP is player versus player: player killing other players.)\n\nOne of the lastest gowns is so low cut that more than half the breast shows!  Then there's guys making dreamsnaps wearing girl's clothes and girls wearing mustaches and beards.  You decide what that is all about. One homosexual male did say he likes the game because he's allowed to wear female clothes. You decide.\n\nOne person's review says, \"its fun and kids get to be who they want to be even if that mean kids get to be inappropriate.\"",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's a buggy mess. Quest imperitive items will disappear from your inventory and then you have to jump through all sorts of bullshit hoops to get help, not to mention they won't answer you inside of a week and a half, and when you bring that up: \r\n\r\n\"Let me kindly draw your attention to the fact that I have already responded to your request, but for your convenience I will duplicate the information for you\"\r\n\r\nInstead of actually addressing your frustrations. If you wanna be treated like trash by the people tasked with helping you, go ahead and buy the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love the game but it is to much money to have nice things in the game, so if you haven't started i would suggest you not if you don't want to spend a metric ton of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At this point, the game is basically unplayable. It freezes and has to be closed out 1) every time I try to open a clothing bag/the intro gift from Merlin, 2) try to purchase something required to complete a beginner quest which unlocks house/storage expansions, and 3) any time an animal has the option of becoming a companion/familiar which happens automatically and can't be avoided if you want to complete other animal-related requests. Load times to start the game each time it crashes near 5 minutes. So my 5 hours of play time is probably closer to 4 with a full hour since I started playing of resetting the game and waiting for it to load. I was hoping that I could just avoid the clothing bags, but now that it is other mandatory tasks for the main quest and non-optional cut scenes that are causing the issue, I am at a loss. I have lost progress every time. I feel anxious about any new unlock or level up because I don't know if it will trigger a crash. I reached out to GameLoft with this issue and they told me they were sorry it hadn't been fixed in the last hotfix and basically to wait. This game was over $40. It has been out for years. Why is it still experiencing issues as if it just released? And to this extent? Steam will also not refund me at this point because I played for too long, hoping that the bug would be peripheral and could be avoided. I'm so disappointed. I'd been looking forward to playing this game for a long time and finally saved up for it, just for it to be at least an hour of sitting, looking at a loading screen after experiencing another crash. I wish I could be refunded and come back when they get it together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not Recommended...\n✔️ 45+ hours played\n\nAt first, I loved this game. It was cozy, charming. But over time, it turned into one of the most frustratingly greedy games I’ve spent money on.\n\nIf you're a big Disney fan, you'll probably still find joy here. But be warned: this game is no longer about fun and creativity. It's become a monetisation machine.\n\n🎮 Gameplay\n\nThe core gameplay loop is relaxing and enjoyable\n\n- Complete quests with Disney characters\n\n- Decorate your valley\n\n- Farm, mine, cook, and craft\n\n- Explore themed realms\n\nThere's a ton of running back and forth, and certain quests feel like filler designed to slow you down and stretch playtime.\n\nPost launch, there hasn't been meaningful progress on the main story in over a year. Most updates are just seasonal events, reskins, or content locked behind another paywall.\n\n⚙️ Customisation & Progression\n\nCustomisation is the heart of the game. Outfits, furniture, valley layout, it’s all here and looks great. But so much of it is now locked behind:\n\n- Premium currencies!\n\n- FOMO-driven battle passes!\n\n- A high-priced cash shop!\n\nOh, and if you want your valley to look amazing? Be ready to either spend money or feel like you're constantly missing out.\n\n🪙 Monetisation Model\n\nHere’s where it really falls apart\n\nThe game was originally promised to be Free-to-Play\nThen they:\n\n- Made it Buy-to-Play permanently....\n\n- Kept the free-to-play-style monetisation system....\n\n- Introduced a $38.99 (CAD) DLC the same day it left early access....\n\n- Launched a premium shop with rotating FOMO items....\n\nContinued with seasonal Battle Passes (Star Paths) that offer little on the free tier and hide the best content behind the paid track....\n\nYou pay full price for the game!\nThen pay again for the DLC!\nThen keep paying if you want premium outfits, furniture, or to access better rewards during events!\n\nIt's the worst of both worlds, a full-priced game with the cash shop of a mobile gacha....\n\n📈 Content & Story\n\nContent updates are frequent but often shallow\n\n- New characters rarely have deep quests\n\n- Still waiting to unlock areas teased since launch\n\n- Events and new items mostly serve to push you into the shop or Battle Pass\n\nThere was a story about the Forgetting, the ruler of the valley, and mysterious magic, but it's barely moved in over a year. Everything since has felt like stalling.\n\n🔁 Development & Communication\n\nThe developers started strong\nBut communication has dropped off\n\n- Updates are often buggy\n\n- Multiplayer was added, but it’s extremely limited\n\n- Bug fixes are slow\n\n- Key issues remain unfixed for months\n\nWorse, they still show characters in trailers that aren’t in the game, even after two years\n\nIt really feels like the priority shifted from making a good game to maximizing profit.\n\n❌ Downsides\n\n- Microtransactions in a non-free game\n\n- $40 DLC for features that should’ve been base game\n\n- Star Path is FOMO-fueled and punishing if you skip it\n\n- Premium shop uses paid currency, with tiny drip-feed earn rates\n\n- Story is stagnant\n\n- Customisation is great but often locked behind paywalls\n\n- Major quality-of-life features still missing\n\n- Still buggy after two years\n\n- Very little depth once you’ve played 20-30 hours\n\n- You can’t even sit on most furniture\n\n✅ Final Thoughts\n\nIs the game fun? Sometimes, yes\nIs it worth the money? Not anymore\n\nWhat started as a wholesome, relaxing Disney life sim has become a pay-to-decorate cash grab. If this were free-to-play as originally promised, I’d be more forgiving. But charging players for a half-finished game and then nickel-and-diming them for everything else is inexcusable.\n\nIf you care about cozy sims and Disney, this might still hook you.\nBut if you care about ethical monetization and value for money? Skip this.\n\nThere are better, cheaper, and more honest cozy games out there.\n\n5/10\nFun at first, but ultimately a corporate disappointment wrapped in nostalgia.",
      "voted_up": false,
      "votes_helpful": 172
    },
    {
      "review": "Fix your game before releasing another expansion. \n\nI have lost hours worth of my time and energy. Every time i build areas and close the furniture mode it doesn't save correctly, Everything gets reset back to before i started decorating. I am tired of loosing all my work for dream snaps. I started this game for the build mode. and I am so close to uninstalling. I have spent so much on and in this game, I loved it but cannot keep making excuses for it. THIS IS A GAME BREAKING BUG which has been going on for over a year. I have been playing since day 1. I own all expansions. Bought moon stones. over 1200 hours in game play. \n\nThis game is no longer early access. These issues should have been solved months ago. \nclipping errors in premium items. \nItems not showing up properly. \nCamera Getting stuck in photo mode.\nCharacters not moving when you run into them so you get stuck.\nHiding characters or sending them to their homes doesn't work 90% of the time. \nMore issues to talk about but I am tired.",
      "voted_up": false,
      "votes_helpful": 125
    },
    {
      "review": "I love Disney characters as much as the next person, but this game is just fetch quests and grinding. There’s no real interaction with characters that matter, you can choose any dialogue option and it will not effect anything. There are micro transactions within the game, mainly cosmetic reasons but I don’t feel that is necessary when people have already spent $40+ on a game that was originally announced to be free to play at some point. Disney greed kill this for me, the worlds feel so lifeless.",
      "voted_up": false,
      "votes_helpful": 126
    },
    {
      "review": "I haven't touched this game in a long time and I enjoyed it at first, but for a game THIS EXPENSIVE to have microtransactions? It really , and I mean REALLY, rubs me the wrong way. I  dropped the game only because the amount of quests to keep track of are INSANE. I'm giving it a thumbs down which makes me sad, but it's not necessarily a bad game. It's just. . . meh. You do a lot of running around and a lot of waiting.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "This game as been nothing but lies and unkept promises, it started by them assuring people that it would eventually become free to play, and buyers were just getting early access, this was not true, as they backpeddled and continue to charge to this day, wouldn't have been a big deal if they hadn't shoehorned in a cash shop even during early access, with very expensive micro-transactions. Then they promised not to price wall story content, which they did with the DLCs they have released on top of buying the game, and their expensive DLC shop contents, finally there was FOMO battlepasses right out of the gate, so if you DIDN'T  buy in day 1, there is stuff you can't ever get access to, including limited time event items, so people waiting for F2P got screwed over, only for it to never actually go free to play, and finally to top it all off, they were offering teired purcheses at launch, so if you bought the ultimate edition, you'd think you would have gotten the DLC, but you don't, you can only get it from buying the ultimate edition now, so people who bought in early (and for a lot of money) still have to shell out for DLCs too. \nThis game was fun until it got bogged down in so much greed, unkept promises and FOMO exclusive content in a COLLECTION GAME, buy if you want a similar experience to going to a Disney park I suppose.\n\nAll my playtime is from the early access period before my opinion was soured by greed, backtracking and realising just how FOMO-y this game would be.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "I've got a ton of hours in this game and the game itself - I do really like. However, I bought the first two DLCs about a month before the third DLC was announced, and I have HUGE regret. If I'd know they were going to pay wall an actual mechanic (riding a mount) behind the next DLC then I wouldn't have bothered to give Gameloft another cent of my money. \n\nThis game already did people dirty by promising \"free\" and then not delivering, but when you paywall a better playing experience it feels like the single-player version of pay to win. REALLY wish I could refund this game entirely tbh. Paywalling the ability to ride a mount is so skeezy to me.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I hate the predatory in-shop prices. This should be free to play at the shop prices they charge, and I enjoyed it for a while, until the customisation became dependant on you splashing more money down and the devs went back on what the game was going to be (free to play), which, let's be honest, in these style of games, is everything. Another gotcha game on the market... Great! Don't get the praise, just another soulless cash grab--but I guess that sums up Disney pretty well right now. In-game currency, season passes and additional DLCs are milking this one sour as hell!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "10 mins in and I'm introduced to my first microtransaction. I'm not a fan of half a game I paid for having everything meaningful locked behind a  wall of spending more money. Besides that, I was utterly bored and disinterested in the initial quests. It didn't seem as if any of my choices made a real difference to the outcome of anything. Very linear. This game may be for some but it's not for me.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "First... please don't take my not recommending this as a bad review. This game is fun and it's cute being able to befriend so many Disney characters. But this game has essentially become a money grab. They initially said this game would be free but now it's $51 (CAD) for the base game and now there are editions that range from $76-102. And then there are DLCs costing around $40. It's just ridiculous at this point. And then on top of all of that you can buy ingame currency and premium starpaths to get better items (you can earn these in the game but the grind is a slog). It's become very clear what the devs of this game's priorities are. \n\nI will still play this game and maybe... maybe consider buying future DLCs if they ever go on a super sale. But this game is just so overpriced I can't really recommend it unless you've got money to burn. There are so many other games that are cozy with similiar mechanics that either are actually free or are much more affordable because with this the only thing you're paying for is the Disney branding and they haven't done anything to prove that it's actually wortht he price tag.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really like the game. I think its a nice cozy disney game. The reason why my review is negative is because of how monetization is being handled. You really only get 2/3 DLC's in the ultimate edition. You have to buy the first expansion by itself (For 30 bucks on top of getting the base game). They said this game was gonna be free to play. And I thought 'okay cool I'll buy the first expansion see what happens'  Then all of a sudden changed their mind. To get specific villagers you want you HAVE to buy the DLC that they're in. They could have simply made a new realm with Snow white. But no you have to pay 30 bucks to have her in your village. Want Maleficent in your village? Pay 30 bucks for the DLC that she's in. I really love this game I really do. It's just I can not support this game with the expansions its releasing and barely giving stuff for free.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "How hard would it have been to implement save files for a game like this? Steam family sharing doesn't work with this game's DLCs, so how many times do I have to buy this game and its DLCs so everyone in the family can play? Kids under 12 don't really need their own Steam accounts, why can't they share?\n\nIt's also not that special of a game, it's a sloppy Animal Crossing clone with really boring gameplay, minimal controls and character interaction, etc.\n\nThere are also reportedly game-breaking bugs where if you complete a quest out-of-order, it breaks the quest and you have to start your save file over. Utter slop for something with the Disney name. We know Disney can hire devs who create quality titles like Disney Adventures or Disney Epic Mickey: Rebrushed.\n\nThere are also microtransactions which is absurd for a full-priced game with full-priced DLCs aimed at children.\n\nDisney + greed = Gameloft, watch out for the Gameloft name because it means cash grab.\n\nDon't tolerate this behavior and don't let your kids watch/fall in love with the trailer. It's a trap.\n\nThis will be my last Gameloft title. Hopefully Disney feels the same.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Micro-transactions and bans people for just going on the multiplayer.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "so many bugs some make progressing some quests impossible. other are just annoying, some bugs have been known for years and not been addressed seems like a cash grab to throw out new content but dont fix the bugs micro transactions are rampant the games fun but i cannot recommend with the amount of game breaking bugs id refund but i went past the 2 hour mark so was refused",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i've played the entire og game and a rift in time. I've spent many hours with this game, and if it weren't for the fact there was a bug in storybook vale, i would absolutely recommend. however, i'm stuck on the quest to get aurora and can't move forward at all in the storyline. womp womp womp.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve been dealing with a major bug in DreamSnaps for ALMOST 5 MONTHS (so i can't unlock Vanellope at all), and it completely broke that part of the game for me.\n\nI’ve contacted Gameloft support with full details, including the fact that I’ve already tried every basic troubleshooting step: restarting my device, reinstalling the game, resetting my profile, and even starting from scratch SIX times.\n\nAfter waiting weeks for a reply, their “solution” was just to tell me to… RESTART, REINSTALL, and RESET — which I had clearly mentioned I already did.\n\nIt’s honestly exhausting to wait weeks for copy-paste answers instead of real help. I used to love this game, but this kind of support is unacceptable. Please actually read and address player reports.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game was fine until I finished the dream snaps tutorial. Now, the stupid notification to participate will not go away. It pops up every 30 seconds. I keep saying not now, and it keeps popping back up. I wish I could get my money back now because I can no longer make any progress in the game. I can't go back to a previous save and not finish the tutorial either.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really want to play this game but the head bobbing is too much, please consider making an option to turn it off. It causes eye strain, headache and nausea in many people. \n\nThe game itself is enjoyable but this one problem makes it unplayable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "For the most part, I have enjoyed this game, despite the fact that it's grindy, especially if you aren't putting in any more money than just buying the base game.\n\nRecently, however, I have had so many issues that have impacted any progress, and I haven't even bought any of the DLCs.\n\nI lost all of the upgrades I made on Remy's restaurant and Scrooge's shop. I was able to get Remy's open again, and some of the upgrades for free, but I am completely locked out of Scrooge's shop without any option to reopen it and try to upgrade it back to where it was. The only response I got back was that the engineering team was looking into the issue. Meanwhile, I can't receive rewards for tasks involving buying things from his shop.\n\nI have also had multiple issues where I can't make progress on getting new characters into my village (at least in Monster's Inc. and Beauty and the Beast for Cogsworth and Lumiere) because I can't interact with the items on the map that are needed for progressing. \n\nI'm still in contact with support on Monster's Inc, and the Beauty and the Beast issue was something I just encountered. I will update later if these issues are solved, but I'm just frustrated that there are still a lot of things wrong with the base game and they keep putting out additional things for people to buy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cute despite the horrid graphics. Nostalgic enough to cause me to excuse the red flags. It was fun until it wasn't.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really enjoy playing Dreamlight Valley, but I have to say I don’t appreciate the in-game purchases. One of my friends bought me the game as a surprise gift- it was much cheaper for them than it is for me- and I truly appreciate it. I love animation and Disney movies, and this game captures that at least to an extent. \n\nHowever, when I considered the prices, I realized that in my country- and for many others- I simply cannot afford the additional content. I cannot imagine paying full price for the base game, which already offers a lot, and then having to spend even more on in-game purchases. I don’t think that’s fair or adequate for a game like this, especially given the Disney brand.\n\nI even looked into the revenue, and honestly, it seems excessive. It feels greedy, and it’s difficult for players like me to fully enjoy the game because of the cost.\n\nI love the game itself, but the pricing for in-game content is a major barrier.\n\nI can’t wholeheartedly recommend it, as the price is so high, and yet I do not get the full game experience, not to mention the additional in-game purchases that I simply cannot afford.\nNote : \nYou can gather Moonstones daily, but I feel they don't give enough considering the amount you'd need to spend on one event for what you'd want.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "it was fun to start with but theres a lot of bugs. Some bugs aint fixed and they just release new expansions. My boyfriend got so much lag with the main game that he had to quit playing. No lag at the expansion maps but you cant use those maps for starpaths (gives a lot of loot and can take weeks-a month to make). They said they aint gonna fix the lag problem that ppl got. Which is sad, my boyfriend played since day one.\r\nMost ppl make storage rooms, but theres still 7-8 items u cant place on a table, items from the main game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The fact that I came back to the game for the new DLC, after not playing for a year, and it's literally littered with bugs is very telling. \n\nRemy's restaurant and Scrooge's store were all downgraded even though I had fully upgraded them before. Remy's restaurant could be \"fixed\" by upgrading it again via the sign, but Scrooge's Store is completely broken, and some of my NPCs are trapped in there. There is no way to upgrade it back to its previous state. \n\nThe wells are broken half the time as well. They literally just don't work. \n\nFix the game before pumping out new DLC.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Your world can never be clean and pretty you have to play constantly and constantly be cleaning and it never ends. Its just stressful now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Base game is enjoyable for a while, but it does get tedious faster than most village building games. The pricing for DLC is also wild and should not be supported.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I can't recommend buying the game at the moment. The game has a lot of bugs. And I mean a lot. You can get stuck and have to restart your game just by talking to certain characters seemingly at random. Any interaction has the possibility of softlocking your game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What Works\n\nBase game: Fun and charming, with enjoyable exploration, quests, and Disney character interactions.\n\nSecond DLC content: Adds story and character moments that are engaging when experienced.\n\nWhat Falls Short\n\nFirst DLC: Uninteresting, lacking compelling content.\n\nSecond DLC structure: Splitting the content into two parts disrupts progression and reduces enjoyment.\n\nPricing: The high cost of additional content makes further investment less appealing.\n\nThe base game is enjoyable and full of charm, but DLC quality is uneven. The first DLC fails to excite, and the second DLC’s split format interrupts the experience. Considering the cost of further content, continued investment is less compelling.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I bought this game because I thought it looked cute and would be fun to play. I got as far as the Remy quest only to have it not register the completed dish. I tried everything I could find on the internet to get it to register to no avail. When I exited the game and came back in, Remy had me making the next dish but in the tracker, it said to make the fruit salad. So because I was frustrated I went to a different quest. I crafted the signs for McScrooge. I watched several videos to find out where to place them. I did that but it never registered. Soooooo Frustrating. I have asked for a refund. It is very disappointing for a game to have been out almost 2 years and have run into these glitches so early in the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It got pay-to-play, don't buy it unless you are rich.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I was one of the players who bought this game in Early Access. Getting an Early Access deluxe version, I expected a few perks in the end, as well as being able to play the game before it went Free to Play.\r\nI love this game, and I want to recommend it to people. But I havent been able to play it since they announced their first DLC.\r\nInstead of going Free to Play, they raised the price and then announced a DLC. However, that DLC would not be given to the players who had (in good faith) bought an Early Access version of the game. Then they said you can buy the game and expansion pack for a discount. But absolutely no discounts were offered to the people who bought a 'deluxe' version of this game, back when it was new.\r\nNow they have the audacity to put out 2 more expansion packs, all for 30 dollars a pop. On top of the price of the regular game. Again, the people who got the 'deluxe' version back in the day were offered no discounts on the DLC. But new players could (and still can) buy the game and DLCs together, and get a discount in total. You see the rub here?\r\nI wsa hoping this studio would be different than the rest of Disney, but clearly not. I would take my money elsewhere, and I regret ever spending a penny in the first place.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm done with this game. After they messed up and didn't correctly launch the Deluxe Version of the Wishblossom Ranch (I was thinking maybe it would be an upgrade you could get later like in some other games) I sent in a help request asking them questions- do I need to purchase the full thing? Do I just upgrade it to get the items, etc. Instead of answering my questions- the CS Rep literally told me this issue was my fault for rushing to buy something that I didn't want. Didn't answer a single question. Just blamed me for spending my money on their game. Message received. Uninstalling. There are plenty of other games to spend my money on and in.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Broken and money grabbing. everything i surface level. lets say you put time in this game. Doing quests an making friends. Prepare to halt everything because some quests are so broken... it game breaking. Save your hard worked money and go for an actually game. That creators love.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would love to recommend this game. \n\nIn the past, I absolutely would have. At the beginning, this was a beautiful game full of nostalgia, a moving storyline, beautiful graphics.. just all around fun to play, a delight! \n\nNow? It's all about microtransactions, overly pricey expansions with small shallow storylines and a crazy grind, bugs all over the place.... and items we PAY for that we don't recieve. \nIt's become Disney Dreamlight Greed instead of Disney Dreamlight Valley. Game breaking bugs are ignored, things we never recieve and never will recieve show as not collected in game, the store RNG is extremely terrible.. I've played this game since it released and I STILL as missing items from the store that Scrooge refuses to sell....\nThe newest paid expansion is still extremely buggy, the past expansions marked finished are NOT finished and still very buggy. Storylines are abandoned, the order the characters have been released in are very odd choices to say the least... Cruella and Hades before Hercules and Pongo/Perdita? I know they need a \"conflict\" for the story but... there is so much more but.... well I digress. \n\nBugs and issues are not fixed in a timeley manner, frustrations abound... \n\nThe game is fun. It really is. The frustrations that are being experienced by players that are never resolved are really ruining what is a wonderful game underneath it all. \n\nI suggest the developers start sending out customer surveys... asking about experience and improvements, what players would like to see in game. If they did that and started implementing those fixes and additions I think the game could really turn around and become fun again and would restore some of our faith in Disney Dreamlight Valley. As it is, I'm not sure I will buy another expansion, or anymore real money purchases in game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I sometimes get nauseous from these type of games, but often there are settings available that prevent this from happening. Unfortunately this game has 0 settings that could possibly help. The only camera setting they have is the speed at which it follows with your mouse, which does not help whatsoever.\nSeems like a fun game and would love to play it with a friend, but unfortunately I cannot due to these missing settings",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bugs keep you from completing crucial missions. Lame. PLease, give me a refund. I",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "We are experiencing the same bugs many others are experiencing with villager's homes being closed and downgraded (Scrooge, Remy, others). Scrooge's is completely inaccessible! Merlin's house just up and vanished, like a fart in the wind. Who knows how many other problems there are? \n\nWe were so devastated that we've lost all interest in playing. This after spending over 200 hours in the game and buying a DLC. There's no way they're getting another penny out of us.\n\nMajor game-breaking save file issues THAT AFFECT MANY PAYING CUSTOMERS need to be addressed - TOP PRIORITY. We're warning anyone who would be interested in Dreamlight Valley to steer clear... at least until they make it right but we're not holding our breath.\n\nGameloft needs to be ashamed of themselves for being so careless and while also being so disgracefully greedy.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}