{
  "positive": [
    {
      "review": "Playing since 2012 - its a fun little time waster and can get pretty competitive at later tiers\r\n\r\nThe game has had huge overhauls since launch, namely the gold rounds no longer costing actual gold, physics, graphical updates and more recently the introduction of wheeled vehicles, double barrelled tanks and now Tier XI\r\n\r\nThere is still some obvious pay2win in terms of rarer vehicles usually only exclusive to clan wars or the tedious campaign missions \r\n\r\nIts worth saying that this also isn't War Thunder, its an arcade free-to-play tank battle game - there isn't any simulation nor 'realism' at all.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "WoT 2.0 - Get yourself a free Tier X tank and play until your premium runs out comrade.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Overall good game. Total playtime 2000h+, just recently migrated from win to linux and it's easier to play through steam (proton) than wine and the wargaming client.\r\n\r\n++Tank RPG, if you like historical/theoretical tanks you'll love this game.\r\n++Mods\r\n+Gameplay\r\n+New content comes regularly\r\n+Well maintained\r\n\r\n-Matchmaking is sometimes total bs\r\n-Hidden elo system (XVM mod fixes this but it should not need 3rd party mod to see)\r\n-Monetization (everything is overpriced, but a small plus for \"not being pay2win\")\r\n-Crappy UI in garage. Hardest of all games to find things.\r\n\r\nI have uninstalled many times and reinstalled as many times.\r\nBest enjoyed in few month periods to avoid boredom.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "not as realistic or has as many vehichles as warthunder but i feel that both games are very different and both are good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have spent way too much time playing the smaller version of this game and could not wait to try this. The graphics and gameplay are as fun as they look in-store, and having hundreds of tanks to chose from is really nice as there is always something new to get (although there is no way you could ever master 1/8 of them). The maps are really nice (mainly because of their size, slamming people with an E100 from 2 miles away is something Blitz can't offer). However the game  definitely has it's problems. Pay to win is very real, the surplus of bots are annoying, nerfing/buffing almost all historical vehicles makes them unreconizable (e.g. the Tiger has the King Tiger's gun) and grinding takes forever. I realize that complaining about having to work a game to have fun in it is kind of dumb, as someone who has put one thousand hours into the lite version of this taking 100 hours to get a tier X is really stupid. I can also see why giving out free Tier Xs is annoying, but getting the E100, E75, King Tiger and more for free was really nice (note that I have played this line for 500 hours in blitz so hopefully I know what I am doing in X matches lol) but people who don't know how to scope yet with Xs are very annoying. Someone also mentioned how bad the UI is and they are very right. I still have no idea how to do 7/10s of the things in the garage. So yeah, overall, probably 7/10, if you want to put the time and effort into this you need to actually have fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great graphics and superb game paly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well this year 2025 is soon coming at an end, and I can't wait for this year Christmas. Merry Christmas to everyone. I love Death Stars tanks, and Cobra, alongside any tanks in my garage, and future ones too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game, for Years now. \nDevelopers was losing their grip over some years. but recently , they started to bring some positive upgrades,\nTier 11. Maps are rebalanced and rework, Tanks are rebalanced and so on\nso its worth trying out again. \ni hop the game keep get better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love tanks but you've gone astray with stupid decisions, but it's not too late to get back on track.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm playing since 2012, so add few thousand hours to my play time. Overall it's a good game. Despite its many flaws and questionable/controversial (greed) decisions made by the developers, I keep playing and I'm having fun.\nIt's a complex game which makes it hard for new players and after 15 years of this game's lifetime senior players will have many advantages. But on the other hand right now it's the easiest to get started and the most new player friendly this game has ever been.\nFree to play aspect is to be taken with a grain of salt as playing on higher tiers will bankrupt you sooner or later without premium account, but there are many ways to get many days for free, mainly through Twitch.\nAlso it's very well optimized, so it runs on a toaster without issues. It also runs fine on Linux with Proton.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "World of Tanks is a frustrating but fun Game, more frustrating for new Player because even with the Tutorial it takes a lot of Time to understand how to play properly.\n\nIt is obviously a Pay to Progress Game, (and since certain Tanks are locked behind Gold or Bundles a bit P2W) but with lots of Grinding (and mental Health) you can still do good Progress.\n\nBig Thing i like is that the Developer still show Love to their Game by adding new Stuff like Tanks, Maps, machanics and even adjusting current mechanics to make them better, more balanced and easier to understand.\n\nWhile it has some Positive Things it still has Flaws like the Matchmaking, it is very annoying to play with and against Tanks that are 2 Tiers over you because these Tanks are obviously way stronger than yours.\nAnother thing is the Progress, for someone that has a fulltime job, a family, real life hobbys or other games Grinding for better Tanks after reaching a certain Point takes a lot and i mean a lot of Time.\n\nSo do i want to keep playing that Game:                             YES\nDo i want to Cry because of my own stupidity:                    YES\nDo i want to rage on my stupid Teammates:                       YES\nDo i recommend this Game so others feel the same Pain: YES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, even with the tier XI what's in development. Makes it intresting to play more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.  Tutorials are a must but not compulsory as you can learn as you go.  10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "THE MAUS IS THE BEST TANK, ANYONE SAYING OTHERWISE IS LYING!!!!\n\nSoundtrack: 9/10\nGameplay:\n* Artillery 5/10\n* Heavy 7/10\n* Light 6/10\n* Medium 8/10\n* Destroyer 9/10\nTanks: 10/10\n\nMy favorite tank game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "1K+ hours, 30K battles — but that doesn't really matter in this game. Hours and battles played aren't metrics we use to determine skill. We use WN8 and win rate. So, as a 2600 WN8, 57% WR player, I have some pro tips for total newbies.\n\n1. Money spending: You don't need a premium account or premium tanks. At lower tiers (1–6), they're not necessary.\n2. Don't rush to higher tiers (7–11): You'll get destroyed if you do. That's fine — I enjoy my 5K+ damage games, thanks.\n3. Starting tank lines: You open the game for the first time — so many tanks to grind! Which line to start? USSR — go \n    for the IS-7 or Obj. 430U line. It's your best bet as a beginner. If you have a competent friend to teach and play with, \n    pick whatever line you like.\n4. What you need to succeed:\n   1. Study maps and positioning — learn key spawn points, flanks, and sniping spots for each map.\n   2. Learn vision and concealment mechanics, including view range and bush effectiveness.\n   3. Study penetration, shell types, and armor angling — these determine whether your shots deal damage.\n   4. Develop situational awareness: Constantly check the minimap for enemy movements and team positioning.\n5. That's a lot to take in, and you're probably too lazy to study — like most of us. Your best bet is to observe Unicum \n    players (top 1%) to understand decision-making, timing, and map control.\n6. Streamers/YouTubers worth checking out: QuickyBaby, Skill4ltu, Dakillzor, Kajzoo, Iyouxin — but above them all, \n    Chems, my Black-Asian mom YouTuber. Go subscribe to him — he's very entertaining.\nIf you have any questions, leave a comment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun even with the bad players and possibly being rigged to keep you playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game for years, not well, but still have fun most of the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Я не говорю, что игра относится к типу P2W,\nно вы вполне можете использовать свой кошелек как главное оружие.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has a high, high, high learning curve to be a good player, there are parts with matchmaking that should be resolved so u can compete against similar win rate players to get more even games, but all in all a nice game if u like tanks, a bad game if u have high bloodpressure xD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The suffering of the imbalanced map & old tanks. \r\nNew vehicles always have advantaged and more dust on your legacy one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game if don't mind losing and not getting rewards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 for time consumption and waste of my precious life hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Poetic Review: \"A tank consists of millions of parts. The most important one is you.\"\nThe synergy between sapiens and the machines forged from an altered, refined nature has always defined the arc of human conflict. In the long chronology of warfare, no clash mirrored this fusion more than Kursk. World of Tanks and World of Tanks Blitz extend this legacy into a digital arena, an endless Kursk, where the boundary between human and machine is tested again and again. Tech trees expand, armor lines evolve, and engines grow louder, yet one element remains unchanged: the trace of the self, the imprint of character, the role of the tool shaped by human intention.\n\nFormal Review: World of Tanks is a deliberate tactical vehicle shooter that rewards map knowledge, positioning discipline, teamplay harmony, and long-term battlefield awareness. With its extensive lineup of nations, tech trees, and vehicle classes (each offering distinct armor profiles, gun characteristics, and battlefield roles), the game delivers deep strategic variety, making every match genuinely unique. While balance patches, matchmaking, monetization practices, and RNG-dependent engagements can be frustrating at times, the core loop of observing, aiming, positioning, angling, spotting, and timing remains consistently engaging. Rotating events and alternative modes provide welcome diversity beyond standard random battles. Wargaming can be generous at times and overly profit-driven at others, but for players who enjoy calculated maneuvers, thoughtful engagements, coordinated teamplay, and drawn-out yet decisive firefights, World of Tanks stands as one of the strongest tactical-action strategy games in the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has caused me over 10 years of heightened autism, damn it's good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game play with equal level oponents.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing since the beta and even though I get mad playing it, I still love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game rewards grinders or people with money, but you still need skill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game with tanks and grown men crying every game so 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game in my opinion this is the best tank game for casual gamers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's just fun, though sometimes you won't last that long when starting out.   Be patient and build your arsenal up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starting over on a new account, it has been a lot of fun. The new PvE stuff is cool, and helps with the credit grinds. I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game would recomend watching streamers to learn game machanics tho as it is a very unforgiving game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played WOT Blitz for what seems like forever.  Just when the game started to feel old-timey, they launched WOT 2.0.  Fantastic graphics update to a time-honored game.  My only gripe is you must start over, nothing carries over from Blitz.  So, money spent on Blitz is lost in 2.0.  However, I've enjoyed starting over. Also, I think the maps are too small for the larger team play, you tend to get whacked by 6 tanks if you press your advantage to early.  It is best to use the noobs as bait in the large battles.  In the smaller arenas this game has the familiar feel of Blitz.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, jaw-brakingly hard but good, arcade-ish, game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game may have the steepest learning curve and level of entry of any game I've played, but once you get the hang of it, the game is very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aged well, solid gameplay core, though monetization is aggressive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is still a great game but it seems like the devs are actively trying to destroy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strategic and satisfying, but grind-heavy. Perfect for tank enthusiasts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this game for more then 10 year - بازی خوبه فقط pay to win اگه هزینه کنی پیشرفتت راحتتره",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game fun to play, but when u start u cant stop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "47hrs in and finally starting to get the hang of this game.  Eating a lot of lead lately.  Fun times, fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's one of the best games I played so far, both on PC and on mobile. But it is a little grindy because there are a lot of really good tanks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, teamplay is mixed for me that's about it see ya.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I installed this game yesterday. It's great. I really fell in love with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pay to Win, Uncs in the game be spending money on high pen gold ammos, premium equipment and consumables. I got no chance against those rich boomers. I shall return when I could financially compete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is awsome. One problem I see is tanks almost always putting their backs to other tanks when shooting which is the least armored part of the tank.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well I figured I would nominate WoT for the steam awards, and give it a review. I have been playing off and on since closed beta, and much has changed over the years. \r\n\r\nThe recent version 2.0 update and the gifts they gave were quite nice, it really got me back into the game a bit more. Another big change which happened a bit before that, was being allowed to finally play with an existing WoT account on steam. WoT had been on steam for some time, but only recently could we finally link our old accounts. There are several reasons to play WoT on steam, in my experience. Perhaps the biggest for me is that the steam platform seems a lot faster to download and update games than the WG center, especially for those of us with fast computers and fast internet (gigabit fiber). This is probably thanks partly to the fast steam download servers, but even patching after the download is also faster, so steam must just be more efficient in that regard. \r\n\r\nThe game isn't perfect, whether on steam or WG center, my main complaints are balance in some battles, and with the match maker overall, and powercreep/changing meta, particularly related to balance of light tanks/spotters. Also the grind can be tedious. And of course buying premium tanks is bad for your wallet. \r\n\r\nOverall though, I do like the game, and I think it is good that it has received continued support after all these years, particularly in terms of easy integration with steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game many choices of tanks and maps,All around a pretty good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is as it says on the tin.\n\nNow don't get me wrong, you will spend the upper tiers being bombarded by people with too much time and money invested in the game but in the lower tiers, you can have the fun. If you want to be free to play, stay under tier 7, if you are willing to spend money on the fancy ammo and all the upgrades, tiers 7 & above can be a blast. If you don't though, be prepared for a slog with the odd fun game to keep you hooked in a 15 year old game that somehow will still want £70+ for a single tank everyone will know the exact spot to shoot to remove you from the game 0.3 second after you get into a skirmish regardless as to how small that spot seems to you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very hard to learn and not for the free - to - play crowd who don't like to spend hours grinding and losing initially. I love this game for the history and the mechanics and even though it takes time to learn it is very satisfying when you hear that tank you own 'BOOM' and take out an opposing tank.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is one of the most addictingly frustrating games that I can't stop playing on a daily basis.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An enjoyable strategic tank game with decent f2p potential and progression mechanics. Trying to manipulate the statistics of your vehicle to get the most out of your games is an ongoing and fun endeavor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If the RNG-God is on your side, its simply the best game xD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am 70 years and I love this game. Helps being retired because I can play for hours. The game is well layed out it is very intuitive and easy to use.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first played World of Tanks more than ten years ago. Most of my complaints about the game back then are still true to this day - unlocking stuff can feel very grindy, the learning curve is tremendous, and the community is full of literal raging children and drunks who make muting team chat a wise choice.\r\n\r\nAnd yet, with the 2.0 update, and tons of free stuff thrown my way for having an old account, I can't help but find myself wanting to play every single day. \r\n\r\nWhile tank-based combat in games like Battlefield can feel pretty one-dimensional, WoT's physics based damage modeling makes good aim secondary to good decision-making and map and tank knowledge and awareness. Some elements of the game, such as having a fully-upgraded, crewed, and supplied tank, can be rapidly accelerated by spending real $$$ on the game, and do make playing the game significantly more enjoyable. So less pay-to-win and more pay-to-have-fun than others in the F2P space.\r\n\r\nDon't get too hung up on the silliness of the TI-III tanks and their go-kart experience, the game definitely gets more fun the higher you go on the tech tree, for better or worse. Finally, this is a game for relatively patient people - if you blindly rush into combat every game, you'll be literally bankrupted and forced to spend money to keep playing like a goon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Steep learning curve, but incredibly rewarding feeling to progress as a player and find ways to succeed.\nNo other game out there in terms of competitiveness, historical base, and overall game-play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "only player in team is you and other ones are as good as bots in game and then get spotted from other side of the map and insta killed because team sucks ass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and challenging. I wish the teams were more closely matched. It can be discouraging playing tanks two tiers above you. Makes it feel like your fodder. Also, can be expensive to stay competitive, so be prepared for that if you choose to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its just a fun game....quite easy to learn and you can get far without PTW.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you approach it with focus and strategy,world of tanks becomes  a truly amazing and deep experience,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, wonderful to play with comrades, recommend joining a Clan to help develop your skills.  Be selective though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i always enjoyed this game, but they need to put in a better server selection system and i would love it if there was a more functional default steam deck control scheme as there is already a perfectly good and optimised console version of the game. had trouble getting functional steamdeck controls. probably better on pc than on deck still.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great dive into a battlefield that no longer exist , lots of detail and large maps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play the \"other\" tank game (and I like it still) but this one offers different maps and even though I don't have a lot of experience playing this game, I like it. I have played the random battles only so far but\r\nI look forward to playing other formats soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this on wargaming before it came on steam, it has problems but overall fun (with friends) and the grinding doesn't ask for 50 years of my time (cough* War Thunder chough*) p.s. War thunder is not a bad game, but it take forever to grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has been more then a decate and i am always coming back to this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Intense tank battles, huge variety, deep strategy—even after 5,000 hours, still fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Only I would get rid of the Fortnite kids stuff !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good experience with joyful vehicle guns",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its easy to play until you get to the higher tier tanks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "real time strategy with other players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The aiming is very inaccurate. When I have full comlite aim circule, I miss 70% of the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game over 10 years. frustrating addictive game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game with my dad 10 years ago. This game still hits in 2025❤️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "all good until you have russians and kids in team",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very nice game.\nMake very much fun with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the new storyline mode.It is fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game pretty balanced other then the garbage team you get every now and then",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You're sitting drinking beer and playing, CHILLL",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best game for drinking beer and swearing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game grows with its population.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game evert(joke). Lots of fun at least.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quit for 8 years then came back with the advertised free tech tree. I'm hooked again. Gameplay hasn't changed. P2W elements have significantly increased, the time to reach tier 10 has plummeted, and the loot boxes ARE NUTS!!! For $300 bucks I stocked up on pure skill. With Holiday Ops coming around the corner I'm gonna swipe hella hard af.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want to sweat in arcade games but tanks, let's play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun but cn be tilting about hte rng and teammates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, lots of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feelin 40 opening this game, absolute cinema",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Side peek, hide and shoot, sometimes rush into enemies. \nNice avg experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and is a grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright, grindy p2w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME, JUST NEED BETTER BALANCE OF OPONENTS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Toujours aussi bon depuis le depart",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Veri stronk tenk gemplej big like KEK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game yes (give me the reward now)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game in all aspects",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is realistically good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes maybe good, sometimes maybe sheet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game to waste your money at",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FEDORA AND LINUX PLAYERS REJOYCE!\r\nWorld of Tanks is Compatible!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "played since valentine goes toes to toes with amx40",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Veteran since 2015, took a break and came back 3yrs later. Some people say its P2W but I don't see it. It's more like gambling. A lot of times it will feel rigged as many have pointed out. Matches often times end in the first 3 minutes, giving you no chance other than being a punching xp bag. To keep it short here is my list of issues with the game. \n\n1. Spot mechanics\n2. RNG\n3. MM\n4. tank balance \n5. Gold spammers \n6. Map layout\n7. Arty\n\nThose will be your biggest enemies. I could go into detail on each one but that will some time, plus there are other reviews pointing out at those issues. So, no I don't recommend this game. If you are new you will have to grind a lot, learn the tanks roles which often times it won't really matter and be in a world of pain. Just recently WG is giving a free tier X line as a tease. If you are a veteran coming back after a long absent you know what to expect because nothing has change really.",
      "voted_up": false,
      "votes_helpful": 106
    },
    {
      "review": "Bro this game is a certified war crime against fun. I’ve seen crack addicts with better life decisions than the clowns defending this garbage. “Free to play” my hairy asshole—unless you swipe the credit card harder than a porn star on OnlyFans you’re just free XP piñata for gold-spamming premium tryhards.\nMatchmaker is drunk, blindfolded, and actively hates you. It sniffs your tank, goes “lol this guy breathes oxygen,” and instantly drops you into a city map with your open-top paper TD or a fucking prokhorovka when you’re rocking a slow-ass heavy with 2000 HP and a wet noodle gun. Zero fucking warning, zero map vote, zero brain cells in the code.\nLoadouts? Cute. Consumables? LMAO pay up or eat shit, comrade. Half the team is bots or window-lickers who think holding W and left-click is peak strategy. Chat’s deader than my will to live after a few games, no VoIP, so good luck coordinating with 14 random mouth-breathers who play like they’re allergic to winning.\nPlatoons max at 3 so you need a premade duo just to not bleed IQ points every match, meanwhile the enemy has three unicum sweat-lords focus-firing your sorry ass the second you peek because the matchmaker saw you had a 51% winrate and decided “nah, fuck this guy in particular.”\nI’ve had more fun shoving pineapples up my ass than grinding this rigged casino of depression. Devs, either fix your dogshit game or just delete it and save the ozone layer from all the rage-heated PCs. I’m out. Peace. ✌️",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "https://steamdb.info/app/1407200/charts/#max\nthats the world of tanks playerbase according to steam numbers and they are rapidly shrinking.\nThe MM is clearly failing the forums get lit up with criticism over it and gatekeepers partner with forum moderators and CM's to derail and lock such threads, None of that explains why the game continues to rapidly lose numbers.\n\nif anything check out warthunders playerbase its steadily growing and improving.\nhttps://steamdb.info/app/236390/charts/#max\n\nPlayed the game since closed beta earned my stripes and had a 6100 PR in 2018/2019 and own the M4A2E4 among many other rare tanks both free and premium. WOT is dying rapidly and the MM struggles to pair the matches up evenly or is just outright broken to the point it deters players from continuing, as a returning player how can my 19 most recent matches all be losses and majority of the matches have idle players or team mates who just drive a top tier tank into the enemy with 0 damage. This combined with some of the most toxic playerbase and community managers you could think off its a nail in the coffin.\n\nGo look at all the steam announcements in the discussion they quickly lock and remove all the negative comments and run the entire discord, official forum, steam discussion with total censorship of negative content to the point its ludicrous. Is that really a company and game you want to be part off?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I've been playing this game since it first came out years ago. So long ago that the French tree was what everyone was getting excited about launching. Over the years, the quality of the game has gone downhill. Shots that you can see hit the tanks will miss, sometimes the shots wont even shoot out (gun will fire but no projectile will leave), you cannot play high tier tanks without losing money (even on a win!), some walls wont block shots even tho they are undestroyable walls, the community is the most toxic I've ever seen in any pvp game so you have to play with chat muted otherwise you are gonna get called every slur, insulted in every way possible, you name it (and if you don't have your private turned off, they will dm the insults to you after the match. This used to be a great game but now it's just not worth investing time or money in if you haven't already.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Solid 5/10, game itself is okay, RNG may sometimes feel awful, but it is what it is, sadly MM and other stuff is mainly broken\n\nI started playing in 2013, it was cool and nice. Now there are toxic no life players, unbalanced premium tanks, rigged mm, every third game is maybe playable, others are 4 min finishes that are after super major 2.0 update somewhat worse because new players got X tiers they cant play. Thank you wargaming for prefering money instead of actually making the game fun to play",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It’s just a pay-to-win game. There are so many RNG situations that it feels like WG decides whether you win or lose.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "in 2016, This game used to be good, \r\nuntil Wargaming decided Monetising this game take precedence and stop playing in 2019.\r\nBecause Garbage Game dont deserve a second chance even after overhaul.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you play solo you only get bot matches. The bots on your team are garbage while the enemy bots play like players. Kinda like friendly bots are set to easy while enemies are set to hard.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Old player who started with beta and returned with 2.0 launch, game is in an awful state, MM is drunk, gold ammo spam is atrocious, tank balance is all over the place, both with tech trees ones and premiums ones, and we sill have maps in 2025 which are just 3 lines choke points.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "defeats defeats and more defeats, not enjoying the game\nin one day i played 15 games and only got 5 victories, its just depressing at this point",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "New players might as well stay away. The skill gap is too large and the game creators still REFUSE to impose a soft skill based match maker. They still think balancing tank types is key. They ruined the majority of the maps turning them into one trick pony maps. Maps used to cater to a wide variety of tanks. Select brawler and press 2 (Premium ammo).  Spam and hope the RNG allows you to win. RNG is on everything. It's a big reason a lot of players quit. They refuse to reduce the RNG from 25%. This means if you have a shell that has 100MM of penetration, and you aim it for a weak spot.... But the weak spot is 80MM of armor... You could low roll the penetration and still bounce your shot (Another reason most people spam premium ammunition). I don't mind the RNG on damage. Penetration should be penetration or at least the % reduced. As well for people who take the time to aim in. Should be no reason for a fully aimed shot that fills the reticle to drop out.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I figured I'd give it a shot, but the bot lobbies are just ugh, I'm already at tier 7 and still get bot lobbies, if its either that only i have a new account or something else entirely then i guess, I already found this game boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you will have more fun in a casino, this game is a predatory money grab. and the EXTREME RNG of the bullets it's destroying the fun of the gameplay,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The gameplay iself is good enough and that is the only reason why people keep playing it. Nonetheless, there is not much depends on you if you want to win. It's basically a casino with tanks where you can win staying afk and doing nothing and easily lose 15 3 doing 3 kills. A winning streak follows with a losing streak, whatever you do is usually pre-determined. Fucking garbage, but at the same time you keep playing it. Probably, there are a lot of bots.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h2]Perfect game - for unemployed people only[/h2]\n\nOkay this game could be actually decent fun but there is a fundamental flaw in the game design. \n\nThis game is solely focussed on the \"whales\" of online-gaming so the playerbase is always dying and diminishing itself. The free to play gameplay is basically non-existent but even with a lot of money you won't get very far quickly because they don't even sell the good tanks most of the time. \n\nThere is a very large number of tanks in this game and a very small number of tanks that will not result in you dying immediately. But most of the good tanks are not only locked behind a paywall - you also need to put in 12 hours of gameplay with no sleep everyday to make some meaningful progress. \n\nOnslaught is one of the most abysmal game modes in the history of gaming because you will only get rewarded once you hit at least silver rank - which is an \"average rank\"in onslaught but it's not for average players because only the very best players of standard mode even bother playing it anymore. So basically you are up against people with no life playing this game for ten thousands of hours and if you can't achieve one of the best performances among them well ... bad for you ...you don't just earn slightly less rewards you basically get nothing. \n\nIf you think of playing this game for maybe 3 hours a day and can spent 20$ a month on it - go somewhere else. In order to have fun in World of Tanks you need about 10+ hours a day and also spent 100$ of your hard earned social welfare benefits every month.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's kinda fun, but they think of everything they possibly can to suck money from you. Think of every scummy microtransaction tactic and put it into a game.\r\n\r\nI'm thinking of blocking WoT clip channels on youtube just so they can stop psyoping me into reinstalling the game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "dogshit dead game without players. wargaming gives free tanks cos nobody wnat to play this garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not what it used to be. People like me play mostly because we are hooked so much time has already been spent on it. It used to have original take where your aim mattered. Now it is less so and it goes toward magic MOBA it used to branch away from. In spite many people claims It is not GACHA game in GACHA games you get more power for money, not in this game. Yes you can progress faster with money if you need all tanks in the game, but truth is there are some tanks that better than others and a few is enough to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got to tier 5 tanks and would still only get full bot lobbies despite having hundreds of players in Q. Very disappointing experience for a MMO.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont recommand to play Wot in steam platform.Event calendar missing,same events calendar.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having to start all over again is the worst. I came from Xbox and having to start at tier 1 is the absolute worst experience by far. Sit there and grind the garbage nobody likes since none of it has armor nor pen. You just sit there and left click someone a hundred times only to die by the other guy who just sat there for 5 minutes waiting for the last hit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed it at first but after 59 hours and on a losing team majority of the time as there is zero teamwork, artillery every match mostly 2 bombarding you, premium tanks with AP shells that I cannot afford consistently in every game as its mostly loses I'm afraid I have finally given up, you do have to have some skill but even then you will need to sink real money for in game silver just to afford AP shells most matches and then again you have to score high and win to make anything back and its far from 50/50 trust me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "put artillery back into platoons, me and a friend cant even use artillery together anymore. i'm a long time player, alpha tester on Xbox. 14 year old account over there. moved to pc and not happy with some of the changes after starting tanks back up. 2017 was the last time pc had this feature. Xbox took it away in oct this year lol. sort it out wargaming. instead of taking it away, figure out a way to make it work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried again cuz of 2.0 but the game still feels like it was made in early 2000's and cant even be compared to War Thunder. Controls, main menu and the UI literally feels like a cheap mobile game stuff, everything is disorganized and game has no realism...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent many hours on this game since it came out in 2011. But recently, game's gone to shit. WG FIX YOUR F*****G GAME! DELETE ARTILLERY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game COULD be good - if not matchmaking, players without any experience on high tiers and ARTY - this \"special\" (read: retarded) kind of player, who sits on the back and craps shells on you and you cannot do anything about it till the very end of the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game with big potential but is full of bots and shots are based on the stupid RNG so every shot is random.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wargaming 'World of Tank' is one of the most beautiful graphical interface game however, that is where the praise ends. The game and mechanics can be frustrating, along with the game progress to build powerful, versatile tanks. The maps loop regularly, and it's about 8-9 that rotate mostly by switching you to the opposite side of the map.\r\nAnother point is by playing with random people, to complete the battlement requirements in the queue you're placed with people whom have developed skills as well those whom don't give a f*** about winning and just go on their own leaving you vulnerable. Highly any teamwork in a team based game. \r\nI DO NOT recommend this game to anyone. Please refrain from downloading or spending much time in it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Повна нісенітниця, особливо останнє оновлення 2.0. Головне графіку та деталізацію підтягнули, але оптимізацію ні. Грати стало дуже не приємно, навіть не хочеться заходити в цю гру. Треба молитися щоб зарахувало твій постріл по ворожому танку. Навіть граючи через кабель.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game filled with inbred russian beings that are have brain eating ameobas. Dont play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2.0 is no different from its predecessor. Literally the same game with new maps and a new Tier XI which improves the most notable feature of Tier X: It's even MORE frustrating!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game play is ok but setting up an account is hell you might as well just fucking shoot yourself if you set up an account god damned bitches of a dev",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Looks like a very cool game. Worthy enough download the trail. \n\nHowever, even though I'm over 50, I don't have the patience to play the game completely via keyboard  which is the expected native controls. What the hell, who has time for that, especially people over 50?! I also don't have the patience to hack the controls with a 3rd party app to support a console controller or my preference...wait for it...a joystick with twist control...which seams to be perfect for this game!\n\nDamn, gonna have to uninstall it and have to be content reminiscing kicking ass in Recoil and other classic tank games",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no, very bad game the graphics or gameplay is kinda amazing, but the ping in random eu server is very shit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is WRONG. No government charges tank crews for ammo or damage to tanks. If fact, goverments pay tank crews to keep us safe. GET REAL WoT!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good game but GOLD SHELLS RUIN TANKS BALANCE.\nPay to win like all free games",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to be good back on the Xbox 360. Now its purely a money grab. Stupid made up tanks, Blind crew tanks disappear when looked at and why. All because Capitalism wants you to spend your cash. Fuck Wargaming Group.\n\nWant a good game this is not for you AVOID and BOYCOTT!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One-trick pony. Nothing new or interesting every year, gets boring after Tier 9. Events never seem to add anything interesting, always reusing same single map. Feels like League of Legends with 90% less features. The only worthwhile event I'd find is the battle royale \"Steel Hunt\" event. Otherwise, unbalanced, classic freemium business model. \r\n\r\nSame type of nonsensical RNG-dependant combat with the same type of tanks being released every year. Sit behind rock, expose turret with 0.5pixel wide weakspot with autobounce angles, shoot at other tanks sitting behind rock, exposing turret with 0.5pixel wide weakspot. Shoot at each other until out of ammo or one side decides to push into death.\r\n\r\nI'd play the WoT Classic event, if it were more common. Old game used to feel like something, now it's just worth no time. They add something, but honestly add nothing.\r\n\r\nNot to mention the ridiculous gambling support they add to a PEGI-12 game, backed by lame excuses, lead by the lamest community department leader eekeeboo.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "great until you Hit Cheaters...deleting this now............clean the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1. Download\r\n2. Play for 12 years\r\n3. Update 2.0 appears\r\n4. Uninstall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Finely polished graphics and production value, but one of the most greedy, predatory monetization schemes around. Some of the monetization behavior from this developer/publisher gives the worst of the mobile game industry a run for their money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Game feels incomplete and when I try to play with other players at tier 5 it's just 99% bots that do the same predictable movements and poking out and hiding moves.\r\n\r\nThis game is a Demo not a full game because this game's U.I is Atrociously bad, not user friendly and information on stuff is so poorly stated no wonder this game had died once already am not sure how world of warships did way better than this game despite this game getting a 2.0.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The UI looks really old and retro, even if the gameplay was good that really threw me off, maps have pretty annoying shaders and hitting enemies isnt satisfying, maybe because Im used to World of Warships lol, so from my experience, I dont recommend using up all your GB",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It’s a good game at heart, and I get the free-to-play design but the constant monetization pressure is just too much. It wears you down more than it engages you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hate this shit....but it's so stupidly addicting sometimes!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just play war thunder little timmys this is the arcade to next level , no weakpoints just health bars no mate im good",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "way to much RNG and luck skill just doesn't matter and thats just stupid game design",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "50k+ long time player and supporter of the game\r\nthis game is dead, not that there are no players there  are still quite a few but, but quality and the gameplay is gone, done, finished.\r\nit is mind numbing play style of 30 players camping at the base waiting for the clock to run out and press the W key with 2 min left, well at least some do it, most don't even bother, camping in their own corner for 15 min ,what a colossal waste of time.\r\nBut wait there is more, not sure if I prefer the above stupidity compared to the mind blowing idiocy of when players actually decide to play the match, team play what team play, map awareness forget \r\n it, positions  blah, support ha, tanks played according to their role, are you kidding me if you are not sniping from the back in a supper heavy you are a noob etc, etc.\r\nThis game has always been kind of a heated up toxic environment, but at least you could get some good and complex gameplay from time to time, not any more. Now a bunch of apes with keyboards and top tier tanks slinging shit at each other from the red line of the map.\r\nNot sure what happened did WG fucked all up by themselves or just the player base changed.\r\nAll I know is that if you want to keep your sanity steer clear of this game, unless the thing you were lacking is your sanity then you will feel right at home here\r\nCheers",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the only games i can think of which thinks removing content is good for the game with the complete removal of low tier tech tree. \nNot being able to play with real players until you reach a random amount of games completed (no one knows what number it is). \nThis game is not worth it and does not welcome to new or returning players. Just play blitz its actually better which is sad.\nI hope this game can change or it will fail in the next few years!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "battle pass is not giving zero-perk crews when you grinding all the stages....... dumb move again WG",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is just a pile of mess infested with cheaters and unplayeble after reaching IV and V tanks. The whole \"spotting\" system is litteraly just a joke when enemy players shoot u even before spotting u, the dmg is just some random dice toss if u hit or not and even the dmg numbers are totaly random, no real skill needet just a lot of luck + cheats.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is just pure shooter shit, and the random battle generator is also shit. You can expect 15-25% win rate regardless of your play. Total aggravation from this shit product. Do not recommend unless you like shit games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Since version 2.0 the devs have completely ruined the matchmaking by giving thousands of new players tier 10 tanks as well. This had the effect of making half of the battles completely unplayable.\r\n\r\nIt will take the game many months before matchmaking becomes even a little bit acceptable again, but it will never be as good as before.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "broken matchmaking, overpowered premium tanks, poor maps, artillery ruining intense battles",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A great concept of a multiplayer tank game, however most matches are characterized by frustration due to a number of issues.   Maps are not well balanced for vehicle type, so for any given map you usually find yourself functionally relegated to a small zone or else heavily handicapped.  If you are someone who values an historical experience you will find higher tier matches populated by hypothetical tanks with powerful mechanics (e.g. double barrels, gatling guns, fast autoloaders) that make you feel outmatched.  Lastly, players can pay money to purchase tanks and equipment that confer a significant advantage. \n\nThe lower tier matches (III - VI or so) do have vehicles and an experience that feels more equitable and historical so it can be fun, although map imbalance is a persistent issue.  Also, you can team up with friends and play together which increases the enjoyment in any given match.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bullshit matchmaking. All the time tier 8 and u get into tier 10 lobbies. Get your shit together wargaming wtf",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Started playing in 2012/13.... yeah its going downhill for a long time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Of all the games I played, only maybe three or four were with real people.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "very unbalanced gameplay do not recommend for anyone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pay to win.\r\n\r\nAlso Clickers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Probably only game that deserves dislike after 10+ years...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Random lag. My internet connection is good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The worst unbalanced video game ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Account recovery procedure designed by a retard.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is ok loot boxes are not",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "na picu hra mmmmmm a alex bienik je gay a jebe svoju staru mamu Miru Bienikovu",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash maps and matchmaking",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "servers always has high ping",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "donate, random, ur skill useless... sh1t",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst gaming experience of my life.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Toxic community.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No better than the first",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Пинг невозможно играть",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Attack the D point is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "play war thunder instead",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Stupid game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Remove artillery",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "stupid match making",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Why do I have to start from scratch when I already have an old War Gaming account? What's your problem?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SHIT!!! DON'T PLAY THIS SHIT GAME \nRNG IS BULLSHIT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pay to play or grind both suck ass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Atrocious matchmaking",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "мир глэков",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not recommended.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ripulivellipaskaa",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unbearable greed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fix your matchmaking",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "P2W",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "танкі танкулі танкусіки",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p2w",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am a 45 yo father, probably one of the oldest people playing this game. I am a single father to my Son, who is 14 now. My son got this game for Christmas in 2021 from his uncle, so we installed it on his computer and he started playing. By the end of the week he had 24 hours on this game. This was horrible for me, as it was already hard for me to find ways to spend time with my son, as he is always out with his friends or just watching YouTube. So i decided to make a Steam account and get this game to see if I could maybe play alongside him. I loaded into the game, picked my character and world and started playing but I was stuck on what you where supposed to do. I asked my Son for help and he hosted a game for me to join. I loved it as it was the best time I had spent with my Son since my wife had died. This game has ever since brought me and my son closer again and now we actually spend time together outside the house together as well. This game reminded me that there's fun to be had in everything, and it has brought both me and my Son many happy memories.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am a veteran player of nearly 10 years, so I think I know a thing or two about the game. Here's my take on the game:\n\nPRO\n\n- Graphics: The game looks great, running on a custom-designed graphics engine which has surprisingly moderate system requirements\n- There are many different tanks to research\n- WoT features lots of community events; there's something new almost every week\n- Games can be entered quickly, and servers are generally quite stable\n\nCON\n\n- Strong pay-to-win aspects. Some examples: new premium tanks are mostly stronger than researchable tech tree tanks (used to be different btw), playing high tier matches is hardly an option unless you invest money, premium ammunition and other consumables that provide a distinct advantage cost a lot of credits (which again are difficult to afford without paying real money) ... etc.\n\n- Premium tanks are very expensive, with a single tank often costing 30 Euros and more (To be fair, it is not really necessary to buy too many, though)\n\n- The WoT community is probably among the most toxic among all online games - certainly the worst I know, by a mile. So toxic, in fact, that there is a series of YouTube videos dedicated to demonstrate just how destructive players sometimes are\n\n- Poor map designs: Many maps are one-sided (i.e. favour spawn points), offer little variation or are really too small for the capabilities of the tank tiers that can play on them. Note that this is not true for all of them, of course; some are really great, but notably the more recent ones are mostly really poor\n\n- Extremely poor game balancing: This is the easily worst aspect of the game, and it comes in many shapes. Some examples:\n\n* Although there are exceptions in every tech tree, it is an open secret that certain nations are quite consistently better than others in the game. Not that Wargaming would ever admit that, of course.\n* Wargaming has a policy of rewarding the strongest players with the strongest tanks, so in high tier matches inexperienced players are put at an extra disadvantage\n* Some tank classes are extremely difficult to counter (artilleries, wheeled tanks with an absurd auto-aim while moving).\n* Due to the nature of matchmaking you will frequently find yourself in matches where you can do next to nothing\n* The disparities in strength between tanks of the same Tier are often hair-raising. On Tier VIII, for example, a handful of tanks (mostly premium, of course) are so utterly dominant that the rest might as well not be in the game.\n\nand and and ...\n\nAll in all, I would not recommend WoT to any new players anymore. It really isn't a particularly good game now; Wargaming have made too many poor design decisions over the past few years - the introduction of the stupefyingly idiotic wheeled tanks was just one example among many. It is true that it still has no equal in its niche, so if somebody wants to play a fast-paced tank shooter, it's probably this or nothing. However, those new players who are giving it a go should prepare for a game experience that is 10% fun and 90% frustration, and that frustration will way too often not be caused by their own inadequacy, but by poor game design.\n\nTL,DR: Spare yourself the frustration, play something that is actually fun. It's not like there aren't plenty of great games out there.",
      "voted_up": false,
      "votes_helpful": 235
    },
    {
      "review": "New players will get clobbered in T3 with gold ammo from all directions. The spotting mechanic is completely unintuitive and the gap between trained crews and starters is still ridiculous, bordering on unplayable. Even 2.0 is not really worth the time. Take the gifts, play a couple games and uninstall.\n\nWorld of Warships is the superior game in basically every aspect.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "Veteran since 2015, took a break and came back 3yrs later. Some people say its P2W but I don't see it. It's more like gambling. A lot of times it will feel rigged as many have pointed out. Matches often times end in the first 3 minutes, giving you no chance other than being a punching xp bag. To keep it short here is my list of issues with the game. \n\n1. Spot mechanics\n2. RNG\n3. MM\n4. tank balance \n5. Gold spammers \n6. Map layout\n7. Arty\n\nThose will be your biggest enemies. I could go into detail on each one but that will some time, plus there are other reviews pointing out at those issues. So, no I don't recommend this game. If you are new you will have to grind a lot, learn the tanks roles which often times it won't really matter and be in a world of pain. Just recently WG is giving a free tier X line as a tease. If you are a veteran coming back after a long absent you know what to expect because nothing has change really.",
      "voted_up": false,
      "votes_helpful": 106
    },
    {
      "review": "WG merged my EU and NA accounts.  They made my EU account with one premium tier 8 i purchased and deleted my NA account which had 12 yrs and hundreds of vehicles.  My NA account also had almost 40 premium vehicles i purchased over the years.  Tried to get it undone but the response was mostly confusion, frustration and finally consigned to the fate they left me.  THEY.DO NOT. CARE",
      "voted_up": false,
      "votes_helpful": 618
    }
  ]
}