{
  "positive": [
    {
      "review": "Absolute cinema. Worth every penny. Don't even need to buy a copy for your friend. EA did something right for once.",
      "voted_up": true,
      "votes_helpful": 82
    },
    {
      "review": "10/10 game! Just be careful when your wife gets the hammer, they become extremely aggressive and destroys everything, including yourself.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "This is one of the best co-op games ever created. Its high replay value makes it enjoyable to play with anyone — your partner, friends, or family members",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Undoubtedly, It Takes Two is a coop masterpiece. Its extremely diverse gameplay is held to such a high standard from beginning to end. The visuals are stunning, the story is immersive, and the sound is memorable. \n\nPlayed this with my girlfriend and would highly recommend. Or play with your homie and kiss him. Though I probably need therapy after that Cutie the Elephant part, IYKYK.\n\nPros\n+ Exceptionally diverse, smooth and genre-bending gameplay.\n+ Detailed, gorgeous and bright visuals across a myriad of differing environments.\n+ Simple but relatable and charismatic story about marital woes.\n+ Copious interactive environments and mini-games to explore.\n+ Logical, simple puzzles to conquer.\n+ Friend's pass that allows friends to play the game for free with a player that owns the full copy of the game.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "It Takes Two isnt just a game; its a masterpiece of cooperative play. The level design is incredibly creative and varied, ensuring u re always experiencing something new and delightful. Its a must-play for anyone with a gaming partner!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "This game is absolute brilliance. The whole plot is incredibly beautiful and well-written, the balance between the fun of the gameplay itself and the emotional baggage of the story is utterly captivating. I've never had this much fun in so long. It's a perfect roller-coaster and an incredible palette of emotions and feelings.\n\nWould definitely RECOMMEND it with my WHOLE HEART!  ♡",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "One of the funniest experiences I have ever had playing video games with my girlfriend. One of the most notable things is that it's a game with dozens of mini games inside that do not feel like mini games themselves. Also... teamwork! Nothing better to destroy or make a relationship stronger.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is a great game. It’s really the kind of game that I enjoy playing. No grindy achievements, a good story, fun game mechanics, and a great couch co-op.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It Takes Two is an amazing co-op adventure with super creative level design and constantly changing mechanics, so nothing ever feels repetitive. The story is funny but also emotional, and it really shines when played with someone you’re close to. Easily one of the best co-op games out there.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The story about Cody and May’s relationship struggles resonated with us. While the narrative is about repairing a marriage, it also reminded us of the importance of patience, compromise, and laughter in real life. There were moments when we disagreed on puzzle solutions, but solving them together felt like a small victory for us as a couple.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "really fun game to play with your partner, or friends. love  games that have a story and the art is quite pretty too, its a perfect mix of different game styles. allows both parties to feel happy in the role they're playing",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Two players?\nIn this post local co-op world?\n\nGreat game good luck finding a friend to play it",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the top games out there to play with someone hands down. The playthrough is omega fun, the mini games are great as well and we were having a blast with this game 10/10.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I had an amazing time playing this with a close friend. We were laughing nonstop, yet the story hit surprisingly deep in all the right places. It’s rare when a game feels this alive pure cinema from start to finish. Every moment felt worth it, every penny well spent. And the best part!! You don’t even need to buy a second copy. For once, EA actually delivered something beautiful.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It takes two was absolutely fantastic. incredibly creative with a fresh and engaging storyline. it’s the best co-op game you can play with a friend and truly enjoy!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Super cute game, some parts are tricky.  Playing it with my children, a lot of fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played this with my girlfriend and we LOVED it. Highly recommend this game for any couples who wanna play.\nP.S. You dont necessarily need a lover to play this game, you can play it with your friends as well i tried that too but for me it was more enjoyable and lovely to play it with my girlfriend ^^",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "超级完美的双人游戏！！就是剧情值得吐槽的地方有点多……",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a beautiful co-op game with nice graphics and sceneries. I had a fun time playing it with my boyfriend. I definitely recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a masterpiece. It's the best game I've ever played (at the time of writing this review and ill be sure to change it if that statement is ever untrue)\r\n\r\nI played most of this game with my cousin on PS4 originally and later decided to now recently 100% the game with my friend.\r\n\r\n Even though I was playing this game on my potato-like laptop, i was getting full consistent 30fps which was amazing (THAAANK YOU for optimising :) This game is also on NVIDIA GeForce Now, so you can also play this on the cloud for free (although there is a 1h limit which you can just then close the session and restart it).\r\n\r\nAmazing visuals, amazing mechanics, such an unique game. And the story - the best of all. It's breathtaking, with so much depth.. i cant even explain it. the concept of the minigames is very unique, and i love how each chapter is focused around the characters. \r\n\r\nI HIGHLY recommend you to play this game with your sibling, cousin, best friend, classmate, fiancée, spouse, father, daughter, mother, son, anyone who knows how to work a controller or keyboard.\r\n\r\n(P.S. 100%ing the game is actually not that hard, just make sure to keep track of every acheivement so that you can get them all simply in one playthrough like me!)\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Fun and engaging co-op[/h1]\nI highly recommend this game. Puzzle difficulty was good. Each character controls a different mechanic for each puzzle, so you always have the option of trading characters if stuck. \n\nThe story was an overall great experience and I thoroughly enjoyed its theme of exploring empathy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best coop games, if not the best coop game out there. If you have a friend and free time, it is the best quality time you can spend together.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It Takes Two is a cooperative adventure that relies on tight coordination and continuous mechanical variety. The game builds each chapter around a distinct theme and introduces new mechanics that last just long enough to stay fresh without overstaying their welcome. This constant rotation gives the experience a steady forward momentum.\n\nLevel design is focused on collaboration. Most challenges force both players to contribute in complementary ways, and many puzzles only work when timing and communication align. The structure rewards cooperation over individual skill, which gives the game a clear identity among co-op titles.\n\nThe narrative centers on a couple working through conflict, with moments that mix humor, tension, and character growth. While the story is simple, it frames the gameplay effectively and ties the shifting themes to the emotional beats of the characters.\n\nVisual presentation is bright and imaginative. Every environment leans into exaggerated scale and playful worldbuilding, turning mundane household spaces into large interactive playgrounds. The art direction supports both readability and variety.\n\nControls are responsive and remain consistent across the many mechanics introduced throughout the game. Despite frequent changes in abilities, the game maintains clear instructions and smooth transitions, which helps both players adapt quickly.\n\nSound design and music reinforce the tone of each chapter. The score supports the whimsical style without overpowering the action, and voice acting delivers enough personality to carry the narrative.\n\nOverall It Takes Two offers a highly polished cooperative experience built on creativity and constant mechanical evolution. Its commitment to teamwork and variety sets it apart as one of the strongest co-op adventures in its genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best played with friends or romantic partners. Even better if both of you havent played it before",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best local co-op games ever made! Great for couples or for a parent to play together with their kid. It can be little bit hard sometimes and the theme of the game is sort of sad but I would say kids over 7yo will enjoy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the best game to ruin a relationship xD\nthe game never got finished, but the relationship did",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was not sure what to think when I saw this game. I did not get it for a long time. Then when I did have it, I was not sure who to play with. Finally found someone to play with (thanks Pepsi) for joining me. I hated that I had to go through EA launchers. But then I started to play.\n\nIt is very unique in the way it plays and I found I really had to work with Pepsi to get through the game. I would even say I felt like I bonded with him more playing it. It honestly reminded me of when I was young playing games with my older brother sitting next to him so lost in whatever game we were playing in the middle of the night when we were supposed to be sleeping. The story is cheesie but heart warming. I had so much fun playing it. I find when someone shows interest in playing it, I am right there wanting to join. What is even better is the person that plays with you doesn't even have to own the game. Just one person does.\n\nThis company made such an amazing game. They didn't put micro transactions in, it is not over priced. To me they did every thing that a company should. focus on the story and the gameplay and not try to milk the player for every penny they had. Two thumbs up",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is beautiful. Gameplay is awesome and the story is very nice and emotional at times, if you have a partner I HEAVILY recommend you play it with them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐ 10/10 – A joyful reminder that teamwork is magic\r\n\r\nI don’t usually tear up during co-op games, but It Takes Two got me—more than once. What starts as a messy story about two parents trying to fix a broken relationship turns into one of the most imaginative adventures I’ve ever shared with another person.\r\n\r\nEvery level feels like the developers bottled pure creativity and shook it until fireworks came out. One moment you’re solving puzzles with mismatched abilities, the next you’re flying through a snow-globe memory that’s so unexpectedly emotional you both go quiet for a second. And that’s the real magic here: the game keeps nudging you to communicate, laugh, fail, try again, and celebrate small victories—kind of like real relationships.\r\n\r\nMy co-op partner and I started this game “just for fun,” but by the time the credits rolled we were trading favorite moments like they were inside jokes. It’s rare to find a game that isn’t just entertaining, but actually brings you closer to the person sitting next to you.\r\n\r\nIf you want something that warms your heart, strengthens your teamwork, and reminds you why sharing an adventure matters… play this. Together. ❤️\r\n\r\nWould I recommend it? Absolutely—with both hands on the controller.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much, it is the best game I have ever play.\nIt was amazing that you had to build on team work to get through it.\nIt was immersive and fun\n10/10 experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely fantastic - perfect for couch coop with your partner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Co-Op game. The gameplay itself isn't ground-breaking but it's incredibly varied from beginning to end. If you've got a good friend to play through it together it's an easy 9-10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story rich game, unfortunate for me I don't have anyone to play with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you've got a plus one you can play with, this is an absolute must have and a brilliant relationship builder. Get ready to be frustrated together, but it's worth it. \r\n\r\n10/10 for gameplay, graphics, and story!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun gameplay and amazing story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game of all time. I've now played through it 3 total times, twice on my switch and once on steam. Truly amazing story, soundtrack, voice acting. Just all around a phenomenal game. I think this game is better than split fiction (though that is a great game as well) and it has such a special place in my heart.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute masterpiece of a game. Beautiful graphics, a moving story and a huge amount of variation in gameplay. Did not encounter a single bug or glitch. Played with 13yr old son and had a blast. Both of us were captivated from start to finish",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"It Takes Two is an absolutely amazing game! The story, gameplay, and creativity are incredible. You definitely need a friend to play with, but if you do, it’s an unforgettable experience. Highly recommend!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i highly recomend for long distance relation ships or sibling personally i played this game on console {which is a better experience in my opinoin} but can have so much fun on pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that’s even more enjoyable when played with your girlfriend. It’s impressive how each level offers new gameplay mechanics and level designs. You can also connect with both characters. The game has a story that tries to convey a message, which is important for today’s world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply the most entertainiong game I have played in ages. \r\nWell done!\r\n\r\n(...Was actually suprised it was from EA)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best legendary two-player cooperative games that won the 2021 Game of the Year award.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So it turns out that it actually DOES take two players to beat this game.\r\nYeah, I know it's in the name, but I thought one was enough.\r\nIt's not true, it takes two of us.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love love love this game sm!! \r\nthe story is heartwarming and the gameplay is super fun! I think of the three hazelight games i prefer this over the other two. All three games are awesome ofc but the emotion behind this one I think pushes it just that little bit forward. Plus, although this only matters for some, I didn't get very motion sick playing some of the segments in this game! I loved split fiction but admittedly there were certain aspects that. while fun, made me sit down and have a breather (coming from someone who has mild motion sickness) \r\nvery fun game, left me feeling very fuzzy :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay: 10/10\nVisuals: 10/10\nMusic & Sound: 8/10\nStory: 9/10\nWorld & Atmosphere: 10/10\nPacing: 10/10\nReplayability: 8/10\nCreativity: 10/10\nTechnical Quality & Bugs: 10/10\nGrind: 10/10\n\nFinal rating: 95/100 (A | Excellent)\n\nThis is probably the best teamwork, co-op game I have ever played. The game isn't long, but every part of the game is just simply perfect. This game requires you to use your brain a little bit while keeping it fun, just blend in these puzzles so perfectly. The main thing about the game is no longer the story it tryna tell, because this game is just FUN. The creativity in this game is out of the roof. I am just so impressed by this game, because this is some next-level design. One feature I hope they add on is the option to make your character's screen full-screen. If you are not playing on the same monitor as your friend, you are likely only going to focus on the part of the screen your character is on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a very fun way to spend time with my significant other. It barely glitches at all and the graphics are very nice. I love the way the characters move!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is fun and the puzzles are easy enough for a partner who is inexperienced with video games. The level design and themes are super interesting and creative. However the main characters are downright awful to each other and it quickly becomes annoying. The main storyline is also depressing and the ending is not satisfying. There is basically zero character development throughout the entire game. 10/10 co-op game but the story and characters drag it down to a 6/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please add crossplay to this game. I know it is good so I won't leave a negative review. To play with friends on other consoles would be fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very good, super fun to see all the little hidden achievements. It is certainly a very beautiful game that is worth buying! Had lots of fun playing with my friend! (*^v^*)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It Takes Two is one of the best cooperative gaming experiences you can have. The gameplay variety is amazing, with each level offering a completely different concept, making every moment fresh and enjoyable. The graphics in most environments are stunning and vibrant, and the story is simple yet touching, addressing marital issues in a gentle and engaging way. The world is also full of interactive minigames that add plenty of fun and challenge.\n\n*Pros:\n- Exceptional gameplay variety with excellent execution from start to finish.\n- Beautiful graphics and rich detail in most environments.\n- A sweet, touching, and easy-to-connect story.\n- An interactive world full of secrets and fun minigames.\n- Simple puzzles suitable for any duo.\n- A friend card that lets you invite another player for free.\n\n*Cons:\n- Some scenes in Rose have lower graphics quality than the rest of the game.\n- The repetition of some minigames sometimes diminishes the feeling of novelty. \n- Some scenes were too far away from the player, especially in stages with lots of detail and bright colors, making it difficult to see the character clearly during gameplay.\nOverall, I'd rate It Takes Two an 9/10. It's a great game and worth playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game to play with friends. And the story was super good!\ni was entertained throughout the whole game, and it was really well polished and the story was thought out! Even better is that only one person needs to own the real game!, you should buy it if you consider it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes its good but too short. like too short....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing co-operate game totally suggest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun but the story can be a little campy at times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10 hours of very good gameplay for for couples or children",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, a little bizarre at times. The elephant queen has been done DIRTY.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very fun and challenging (sorta) game for your and your girlfriend and/or boyfriend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Co-op games I've ever played. Story, Graphics, Plot, Gameplay, Animation, Sound loved each and every bit of it. It teaches us we can fix ourselves ina beautiful way rather letting go. The happy ending was satisfactoy and worthwhile. 10/10 Recommend to everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is a masterpiece. Based on the reviews I expected some solid puzzles but the game is so much more. Great writing, great voice acting, some adult jokes at the right time, the message is very strong throughout. The chapters go from fairy tale to weird as shit psychedelics, it's basically a wild ride from the first minute. The amount of creative energy that has gone into it is astounding.\n\nLocal co-op works very well, although in a very few situations the cameras can get confusing.\n\nI wish it was a bit more difficult.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The variety of gameplay is insane and i think that most of the characters are either really cute or really funny. It's a great time! me and my girlfriend have loved it so far :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far its been really fun i'm at the middle of the fourth chapter, my only gripe is that whenever we stand together the camera doesn't merge and stays as two different screens",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wasn't sure what to expect, but it's actually a really fun game, challenging but not too hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story line! Didn't have high expectations at first for the game but after playing it with my husband we both rate it 10/10 of a game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "didnt have strong expectations for this game to start. but me and my wife were absolutely blown away by this game and its attention to detail. 10/10 would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game.\nim son sahar listen to son sahar on spotify",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best couples game ever, but so much more.\r\n\r\nFantastic level design, progression, sound design, writing... So many things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is beautiful, diverse, and filled with a multitude of different aspects that are all well thought out. It is visually stunning, too - when you can see through the tears. 10/10, 5/5, 100/100",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game with the worst co-op partner of the year. Would highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not what I expected. Only thing I regret was not recording gameplay to talk about it on my YT channel. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Went in blind and it was better than expected! 10/10 game. Story, gameplay, mechanics are smooth, and more! I enjoyed it thoroughly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "never fails to make me cry, whoever thought it was a good idea to kill an innocent elephant...you owe me five boxes of kleenex. 10/10 either way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Adorable and funny. Some challenges, but all fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Бесподобная игра, проходим с лучшим другом, получаем невероятное удовольствие от процесса. После этой игры наши отношения стали намного крепче XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly beautiful game, perfect game to play as a couple.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dva kokoti kteří mají spolupracovat=spousta srandy.Vřele doporučuji pokud mate stejně debilniho kamarada jako jste vy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most visually stunning games I have ever played. It forces you to work together and it'll bring back that child-like feeling (it did for me). Recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game to play with your friends and family, although best with your SO. This game has A LOT of variety and fun moments. Beware of one moment though... that kept us scarred for life LOL.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hats off to the developers for creating such an amazing game. i had a lot of fun playing it with my friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very very very good story very very good gameplay very very good character development very very good mini games very very good textures",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best couch 2 player game, period! Everything from the design, variety and cooperative mechanics is top notch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply 10/10. Each chapter feels unique and each character is well-written. I despised the protagonists, but I loved the antagonists and side characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 Masterpiece and one of the best games I have ever played so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very awesome game and interactive, never keeps one of the 2 people bored. though there are connection problems, too much id say. random freezes on both people, kicks out on of the people, clearly not a wifi issue but all in all great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked that you needed a partner to play, so you are practically forced to engage within the game with someone else.   In some parts, I believe that you were not allowed to switch objectives because the objective was dependent on the character you chose in the beginning and what items they were equipped with. I wish that a pair could exchange items when trying to accomplish tasks because it was difficult for me to accomplish and not my partner because he had a control and I didn't. The game was definitely easier with a control. Great game to find out if one is compatible with another, :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for couples and possiable partners warning may end up hateing one another",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this through with my 10 year old daughter.  Genuinely super impressed with the entirety of this game.  The controls are tight, and make sense.  The story is great.  The length (we spent 28 hours!).  It was challenging in the best way as well.  Creativity was on another level - and it meant there was a massive level of variety to how the game is enjoyed.  Great bonding time with my little girl.  Probably the best co-op game ever made.  In my book, it certainly is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this with my partner and we both loved it and we always looked forward to playing it together the next day! Beautiful game and highly recommend to everybody! - not just couples! :D\r\n\r\n[spoiler] I wish there was a better outcome for the beetle that sacrificed his life for us :( and we cried when the red toy dinosaur got squished :( RIP Terry the beetle, you will be missed [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Must-play! My gf and I loved it, and it's a relationship test too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It take two has good story good game mechanics and puzzles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of THE BEST GAMES I have ever played. Everything from the graphics to the story line was awesome!! I would totally play this again and 100% recommend it. Hope this game wins game of the year. Every world and chapter was incredibly made and the visuals were STUNNING!! It was really funny at some points too. Awesome game to play with friends. Decently challenging too!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an amazing game to play with someone else. So creative start to finish. I will be playing all Hazelight Studios games after playing this. it's that good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish I could give this game more than one thumbs up.  Game devs did an amazing job making a platformer / side scroller / minigame / shooter mashup of a game that is simply put, fun to play.  Well executed in that only one person has to own the full version of the game.  The controls are smooth, the gameplay combines elements from all kinds of genres.  If you are looking for co-op play start here!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everytime you think the story ends it actually has just started! and it somehow doesn't feel repetitive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very good game, worth it because the game is very long, not too difficult. I like it very much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great and flawless game to play with your significant other! no heavy, nor difficult tasks and lots of fun especially when you only need one copy to play together, great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun. The puzzles are unique, graphics are great, and it's clear the developers really loved the game they were making. There's so many amazing details in every nook and cranny, my girlfriend and I had a blast exploring each level to the fullest. If you have a friend or partner, I highly recommend playing this game together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best co-op games me and my husband have played. Beautiful, clever puzzles and hillarious story. PLEASE BE WARNED FUTURE COUPLES.. my hubby and i fought many times insisting the other one to jump at the right time, had dramatic pauses.. BUT we passed hehe. Overall 10/10 its a perfect game for couples who want to laugh, team up and argue. Highly recommended\nAlso 11/10 (one point extra) because finally my hubby for once wasn't better than me hehehehe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best co-op games ever created. Its high replay value makes it enjoyable to play with anyone — your partner, friends, or family members",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of if not THE best co-op puzzle game of all time.\r\nThe story is great, it runs well, and it's a blast to play with someone else.\r\nThe game stays fresh the entire time and never feels repetitive.\r\nI cannot recommend this game enough.\r\nI'm on my second playthrough with a friend and I never really play games twice.\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, often play with my wife, so spectacular. Highly positive game to play with family. \nRecommend everyone who loves adventure story extraordinary games .\nWorth to purchase.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This is a really fun game to play with a friend but it crashed for me and my duo countless times. It didn't always save the progress so we had to replay a chapter over and over again. I looked up the issue, and many other people have experienced the same thing but the developers have yet to fix it years after. We both tried several methods but none of the solutions stuck. It's basically unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i've been wanting to play this game for so long so I was over the moon when it went on sale.\nit has beautiful graphics and uh... a story i guess...\nthat's all i can say about it as it crashed my PC 3 times and it was obvious that it was unplayable for me. \nevery time there was a cutscene, my pc was off. i had to refund it. maybe i'll buy it on PS and try playing it there.\nnever had a this kind of problem with any other games i've played",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is amazing but it is from the garbage of a company called EA. You have to Install EA app that is going to waste your hour(s). So if you buying this to play with a friend or a loved one for an hour or two please don't because often it will just be frustration instead of good times.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Shitest game i have ever played, forced myself the finish the game and it felt like torture. Do not play this game unless u want to feel like ripping us skin off from how cringe it is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got it because the Dev said he doesnt care about any political stuff, which is why I usually avoid games from the bigger mainstream companies. Its a french developer, there IS some eyerolling moments. A little nod here in there to things that definitely are a checkmark somewhere. But nothing to take away from the slow gameplay.\n\nEDIT:\nThe slowest game Ive played in a long time. The puzzles are so brain dead Id jump off a cliff for fun. Unlikable characters that never earn any emotional tugs. The game makes sure to let you know Cody is useless and May is the smart engineer that gets things done. It fails at being an interesting puzzle platformer and it fails at telling a story.\n\nThe best part was how fast you can traverse to finish the game.\nI expected puzzles on par with maybe portal, but this is for like single moms and their 5 year olds.\nNever believe the hype. The bar is so low for games like this, that it gets a pass from a lot of people.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't disable split screen even in online play. It is causing motion sickness for my wife.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While fun with friends, It Takes Two lacks a strong pull to come back to the game after your first playthrough. While it has tons of different gameplay gimmicks and styles, it rarely stays with any of them long enough for the devs to polish the mechanic/make it fun. there are a lot of puzzles which have one player having to solve the whole thing or gets to do a unique gameplay sequence as the other just kinda sits there waiting for them. the writing ranges from extremely forgetable to laughably awful - i ended up turning the voices off. this game is a one and done, something to play through once with a good friend while goofing off and never come back to.\n\nThat said, its genuinely incredible this game goes for so much content. you can tell the devs had passion and wanted to do this right, as tons of unique setpieces and a interesting visual style make up for some of the game's bigger flaws. making the game only have to be purchased by one player is also an amazing, pro-consumer move that should be commended. we need more games like this, this one just needed a drastically better writer and to narrow its focus so that mechanics could get more time spent making them fun.  I'm interested in seeing what the devs end up making next.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get the hype. I thought it was a pretty OK game overall, but I would rank it a 6/10. Maybe it's because I have played team puzzle type games before (Portal 2 is one of my top favs), but it felt boring to me and had major lulls in the storytelling, and was shockingly unpolished. All the cut scenes felt WAY too long to the point that I found myself bored with the game when I was only about 50% through due to the fatigue of these long drawn out scenes. Dialogue was cringy, repetitive, and in most cases unnecessary. Cutting the talking and singing down by half would be a good start. Most of the time, I was annoyed at the characters more than enjoying it. The voice acting was soooo over the top, rarely it worked and was funny but oftentimes it took me out of the gameplay and felt campy in a bad way. The graphics were also so disappointing to me. The cartoony land we are in -- they were great and seemed polished! But every cut scene back to the \"real world\" was uncanny valley to me with a lack of detail that made it feel like it was a totally different game! Not sure if there was a rushed schedule, or budget cuts but it really took me out of the game. It is a shame because I really was looking forward to playing this based on what people were saying, but it felt disjointed and incomplete to me. No idea how anyone could give this a 10/10. I would recommend buying this on sale, not full price. Would probably feel great about this for $10, but for $40 I expected a lot more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "while it is a good game for co-op, i didn't find this as enjoyable as i thought i would. I recently played a way out with a buddy of mine and enjoyed it immensely. But this game lacked the thing to attach me to the game and to keep me enticed. While there are good parts of the game there was more then enough to make me board and not wanting to go on. while i think it could be better with a partner i just could not find it immensely entertaining past a specific part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just part way in a boss fight it will get stuck and not move. the giant beetle level.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible story, They should rename the game to \"May's Story\" since the May character gets all the agency. Player 2 gets to tag along and somehow the narrative is antagonistic to the Cody character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Neither the story nor mechanics are engaging enough to be fun for two experienced gamers. If you aren't a gamer & non-gamer pair, this game probably isn't for you",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fun gameplay, but it just keeps crashing for no apparent reason. after the first crash i lowered the graphics and verified the files and it worked, after that it just kept crashing without reason nor result. ea should fix their game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game can be very frustrating and there is nothing in the accessibility settings to ease motion sickness for certain parts. Some sections are buggy, sometimes things are not clear enough.\nOnce we beat this game, I doubt I will ever open it again. Watch a playthrough if you are interested in the story, Jacksepticeye played it with Gab ages ago.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I put nearly 6.5 hours into this game. The main characters had not learned a single thing by that point of the story and my friend and I just could not bring ourselves to continue. There is a good game in it, the gameplay up to the town and the clocktower were really fun. But pretty much from the elephant scene and beyond it just became worse and worse for us as we played it. It's got the art style down, gameplay is fun up to a point then it just felt like it fell off, and as for the writing...well, I stand by what I said.\n\nIt's one thing for the characters to be getting taught lessons by the events of the story, but unless we somehow missed something these two hadn't learned a single thing by the 6 hour mark and were just repeatedly creating more trauma for their kid(and us too, really) and had so far learned absolutely nothing as they just kept repeating the exact same mistakes over and over, so I don't know if the goal of the writing was just to make us really hate these two or what.\n\nI see the love this game gets and honestly I'm just kinda confused because from what we saw after 6 hours the writing alone ought to get it some negative points. If somehow we managed to stop playing JUST before it started turning around then maybe that's another point against it too, since how on earth does something take 6 hours to make a point or show any sign of improvements in its writing of the main characters without anyone else pointing out that that's a problem? Even the gameplay had started to wear on us by then, though that may have been attributed to how much we'd come to just despise listening to these two fail to learn a single thing or even see the painfully plainly written points being made to them.\n\nAnd you know what, no, I'm gonna talk about the elephant too. What the hell was the point of that scene? Why did the developers make us torture the kid's elephant toy? Again, were you trying to make me hate these two going forward from that point because that's all you actually managed to do there. It left such a sour taste in our mouth that all we were able to do after it was keep noticing how absolutely trash the kid's parents are and how they just refused to acknowledge a single fault of their own or learn a god damned thing. I'm not judging a product based off one scene but that one scene really did make us start taking notes of how many times these two just absolutely shat the bed regarding their capacity for parenting and the writing of them as a whole up to the 6 hour mark. I just don't get the praise the game gets when it takes such a nose dive after your first handful of hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you don't like platform games, avoid.  It's pretty and cute and has co-op, but at its heart it is a 50 year old game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "maybe it's because i'm in a good relationship, but may and cody are horrible people and they talk like they're in an E3 demo. every time we were met with a cool mechanic, the characters exclaim how cool it is and it just made me want to turn down the dialogue volume. i feel like im watching hoodwinked whenever the book is on screen\n\npsychonauts 2 should've been goty",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game got game of the year? the most overrated game oat. do not listen to the glazers who say this is the best co op game ever its so bad me and my friend wanted to end it all while playing the last part of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Broke up not long after, got near the end not a bad game for ex's to play with other partners",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash. Friends pass doesn't work so that was a lie. The game constantly crashes on my friend's PC. I have spent hours troubleshooting trying to get this to work. EA is one of the worst companies on the planet. Just stay away from this hassle.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is first time I see developers so desperately trying to teach players a moral lesson, and so utterly failing at that. It could be more productive if they actually decided what lesson to force in the first place, and how does it actually relate to the story told. As it is, they 100% match the cringy book Hakim, and do not even seem to realize the irony. There is no character in the game that I can feel empathy (or even pity) for - it [i]should[/i] have been the daugther, but she is too deep in the uncanny valley.\nThere are some good design choices, but there are as many abysmally bad ones, and even more are just 'meh'.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Elephant part absolutely ruined the game for me and my boyfriend. It is very very dark and we felt sick to our stomachs. You are forced to tear a sweet elephant apart limb from limb while the elephant in a sweet, childlike voice begs for mercy. It is sick. There is absolutely no point to that scene as well. It adds nothing to the game except for an absolutely horrid experience that leaves you feeling like a terrible person. The game was very cool up to this point and this scene was put in for no other reason than to just scare people with horrible dark \"humor\" if you can even call it that. I would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You need to remove the movies content of the nuts in order to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A good game to play with your partner... until the Elephant chapter. We had to stop. I felt bad, she felt bad, she was very upset and I was getting upset because she was upset. Don't play with your girlfriend if she likes stuffed animals or cute things. Will it be a game you can finally play together? Yes. Will she ever play a game again if this is her first one? Eh, probably not. That's how rough the scene is.\n\nA shame because we really wanted to finish the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decently fun platformer combined with an abusive parent simulator. \nThe writing is remarkably bad.  The tone was all over the place.  In this colorful cutesy world, you are made to commit random acts of horrible violence while a talking book periodically shows up to aggressively pelvic thrust at you and shout idiocy.   The main objective is to help a couple of negligent, self-centered, undeveloped assholes traumatize their child because they believe they will benefit from such a thing. It was like war crimes done in the style of children's television.  We couldn't finish it.  \nThe actual gameplay was kind of fun.  So if you can handle bad storytelling with a total lack of empathy, check it out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great co-op, cringe story. 0/10 didn't come with a girlfriend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely hate the dynamic between the two main characters.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't save the chapter after getting all the way to the end of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the kid doesnt die and a shit ending",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don’t recommend this game because I don’t have friends",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game doesn't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Justice for Cutie!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cant load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "хуйня",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "`tfyrtey",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fr67b uj/ fvbt; 8gyihbunjomk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly only half of a game for me. If designers don't allow you to save the elephant, your only choice is tho turn off the game - that way she will not die. If you want to go in with your kids, be warned of the torture scene.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is a really fun game to play with a friend but it crashed for me and my duo countless times. It didn't always save the progress so we had to replay a chapter over and over again. I looked up the issue, and many other people have experienced the same thing but the developers have yet to fix it years after. We both tried several methods but none of the solutions stuck. It's basically unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i've been wanting to play this game for so long so I was over the moon when it went on sale.\nit has beautiful graphics and uh... a story i guess...\nthat's all i can say about it as it crashed my PC 3 times and it was obvious that it was unplayable for me. \nevery time there was a cutscene, my pc was off. i had to refund it. maybe i'll buy it on PS and try playing it there.\nnever had a this kind of problem with any other games i've played",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is amazing but it is from the garbage of a company called EA. You have to Install EA app that is going to waste your hour(s). So if you buying this to play with a friend or a loved one for an hour or two please don't because often it will just be frustration instead of good times.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Shitest game i have ever played, forced myself the finish the game and it felt like torture. Do not play this game unless u want to feel like ripping us skin off from how cringe it is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is fun in some parts wjhere they mimic other games like dungeon crawlers or mario kart, but all missions otherwise feel like 'fetch' missions.\r\n\r\nIt has some really stunning parts. and others where you want to desperately finish the chapter.\r\n\r\nAlso, as a tip to couples playing this; whoever has more gaming experience should play as May.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "We tried this game with a friend. Playing together was fun, there are a lot of activities, and the game is quite rich in gameplay mechanics, you always do something new: one minute you're flying a plane, 10 minutes later you solve 3 3-dimensional puzzles in space. The setting always changes to something new, too.\n\nBut not everything is ideal. The narrative/story makes so little sense, and they could have been so much better. It tries to show you how the divorce of parents affects their daughter, but it's so blunt and straightforward that you could swap the \"divorce\" topic to pretty much anything else, and it would still be the same game.\n\nAlso, we never finished the game. There is a very cruel scene when you and your partner torture and basically dismember an in-game character. There is no way to skip it, and it looks like a horrifying episode from Happy Tree Friends. My buddy and I decided not to do it because we don't want to, so, unfortunately, I will never know what happens after the 6th hour of gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an incredibly dark story that may end better, but the cut scenes are full of the player characters constantly bickering and there is a moment where you are not able to have any agency as the parents of this poor child (and thus the players controlling them) destroy something very precious to their child little by little as she cries for the parents (and thus you as the player controlling them) to stop. This is not a cut scene you can walk away from. This is forced to be actively done and the only other option is for the **players** to walk away.\r\n\r\nThe gameplay between terrible story beats is good. It's staggering how well you and your friend or partner can have a great time cooperating to the next story beat just to have the characters constantly devolve back to bickering and blaming as soon as the current challenge is completed. Even if they decide to stay together after the experience, it will only last until something goes wrong again.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I got it because the Dev said he doesnt care about any political stuff, which is why I usually avoid games from the bigger mainstream companies. Its a french developer, there IS some eyerolling moments. A little nod here in there to things that definitely are a checkmark somewhere. But nothing to take away from the slow gameplay.\n\nEDIT:\nThe slowest game Ive played in a long time. The puzzles are so brain dead Id jump off a cliff for fun. Unlikable characters that never earn any emotional tugs. The game makes sure to let you know Cody is useless and May is the smart engineer that gets things done. It fails at being an interesting puzzle platformer and it fails at telling a story.\n\nThe best part was how fast you can traverse to finish the game.\nI expected puzzles on par with maybe portal, but this is for like single moms and their 5 year olds.\nNever believe the hype. The bar is so low for games like this, that it gets a pass from a lot of people.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some very nice designed levels, but some puzzles with zero indications about what you are supposed to do.\r\nAs if the designers were so happy with their clever ideas that they did not feel compelled to share them with their players. Not even a pointer like \"you are supposed to go up there\".\r\nOf course this may be only due to my measurably below-average IQ. \r\nI will stick with first person shooters, thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't disable split screen even in online play. It is causing motion sickness for my wife.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While fun with friends, It Takes Two lacks a strong pull to come back to the game after your first playthrough. While it has tons of different gameplay gimmicks and styles, it rarely stays with any of them long enough for the devs to polish the mechanic/make it fun. there are a lot of puzzles which have one player having to solve the whole thing or gets to do a unique gameplay sequence as the other just kinda sits there waiting for them. the writing ranges from extremely forgetable to laughably awful - i ended up turning the voices off. this game is a one and done, something to play through once with a good friend while goofing off and never come back to.\n\nThat said, its genuinely incredible this game goes for so much content. you can tell the devs had passion and wanted to do this right, as tons of unique setpieces and a interesting visual style make up for some of the game's bigger flaws. making the game only have to be purchased by one player is also an amazing, pro-consumer move that should be commended. we need more games like this, this one just needed a drastically better writer and to narrow its focus so that mechanics could get more time spent making them fun.  I'm interested in seeing what the devs end up making next.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get the hype. I thought it was a pretty OK game overall, but I would rank it a 6/10. Maybe it's because I have played team puzzle type games before (Portal 2 is one of my top favs), but it felt boring to me and had major lulls in the storytelling, and was shockingly unpolished. All the cut scenes felt WAY too long to the point that I found myself bored with the game when I was only about 50% through due to the fatigue of these long drawn out scenes. Dialogue was cringy, repetitive, and in most cases unnecessary. Cutting the talking and singing down by half would be a good start. Most of the time, I was annoyed at the characters more than enjoying it. The voice acting was soooo over the top, rarely it worked and was funny but oftentimes it took me out of the gameplay and felt campy in a bad way. The graphics were also so disappointing to me. The cartoony land we are in -- they were great and seemed polished! But every cut scene back to the \"real world\" was uncanny valley to me with a lack of detail that made it feel like it was a totally different game! Not sure if there was a rushed schedule, or budget cuts but it really took me out of the game. It is a shame because I really was looking forward to playing this based on what people were saying, but it felt disjointed and incomplete to me. No idea how anyone could give this a 10/10. I would recommend buying this on sale, not full price. Would probably feel great about this for $10, but for $40 I expected a lot more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "while it is a good game for co-op, i didn't find this as enjoyable as i thought i would. I recently played a way out with a buddy of mine and enjoyed it immensely. But this game lacked the thing to attach me to the game and to keep me enticed. While there are good parts of the game there was more then enough to make me board and not wanting to go on. while i think it could be better with a partner i just could not find it immensely entertaining past a specific part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just part way in a boss fight it will get stuck and not move. the giant beetle level.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible story, They should rename the game to \"May's Story\" since the May character gets all the agency. Player 2 gets to tag along and somehow the narrative is antagonistic to the Cody character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Neither the story nor mechanics are engaging enough to be fun for two experienced gamers. If you aren't a gamer & non-gamer pair, this game probably isn't for you",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fun gameplay, but it just keeps crashing for no apparent reason. after the first crash i lowered the graphics and verified the files and it worked, after that it just kept crashing without reason nor result. ea should fix their game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game can be very frustrating and there is nothing in the accessibility settings to ease motion sickness for certain parts. Some sections are buggy, sometimes things are not clear enough.\nOnce we beat this game, I doubt I will ever open it again. Watch a playthrough if you are interested in the story, Jacksepticeye played it with Gab ages ago.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I put nearly 6.5 hours into this game. The main characters had not learned a single thing by that point of the story and my friend and I just could not bring ourselves to continue. There is a good game in it, the gameplay up to the town and the clocktower were really fun. But pretty much from the elephant scene and beyond it just became worse and worse for us as we played it. It's got the art style down, gameplay is fun up to a point then it just felt like it fell off, and as for the writing...well, I stand by what I said.\n\nIt's one thing for the characters to be getting taught lessons by the events of the story, but unless we somehow missed something these two hadn't learned a single thing by the 6 hour mark and were just repeatedly creating more trauma for their kid(and us too, really) and had so far learned absolutely nothing as they just kept repeating the exact same mistakes over and over, so I don't know if the goal of the writing was just to make us really hate these two or what.\n\nI see the love this game gets and honestly I'm just kinda confused because from what we saw after 6 hours the writing alone ought to get it some negative points. If somehow we managed to stop playing JUST before it started turning around then maybe that's another point against it too, since how on earth does something take 6 hours to make a point or show any sign of improvements in its writing of the main characters without anyone else pointing out that that's a problem? Even the gameplay had started to wear on us by then, though that may have been attributed to how much we'd come to just despise listening to these two fail to learn a single thing or even see the painfully plainly written points being made to them.\n\nAnd you know what, no, I'm gonna talk about the elephant too. What the hell was the point of that scene? Why did the developers make us torture the kid's elephant toy? Again, were you trying to make me hate these two going forward from that point because that's all you actually managed to do there. It left such a sour taste in our mouth that all we were able to do after it was keep noticing how absolutely trash the kid's parents are and how they just refused to acknowledge a single fault of their own or learn a god damned thing. I'm not judging a product based off one scene but that one scene really did make us start taking notes of how many times these two just absolutely shat the bed regarding their capacity for parenting and the writing of them as a whole up to the 6 hour mark. I just don't get the praise the game gets when it takes such a nose dive after your first handful of hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you don't like platform games, avoid.  It's pretty and cute and has co-op, but at its heart it is a 50 year old game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "maybe it's because i'm in a good relationship, but may and cody are horrible people and they talk like they're in an E3 demo. every time we were met with a cool mechanic, the characters exclaim how cool it is and it just made me want to turn down the dialogue volume. i feel like im watching hoodwinked whenever the book is on screen\n\npsychonauts 2 should've been goty",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game got game of the year? the most overrated game oat. do not listen to the glazers who say this is the best co op game ever its so bad me and my friend wanted to end it all while playing the last part of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Broke up not long after, got near the end not a bad game for ex's to play with other partners",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash. Friends pass doesn't work so that was a lie. The game constantly crashes on my friend's PC. I have spent hours troubleshooting trying to get this to work. EA is one of the worst companies on the planet. Just stay away from this hassle.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is first time I see developers so desperately trying to teach players a moral lesson, and so utterly failing at that. It could be more productive if they actually decided what lesson to force in the first place, and how does it actually relate to the story told. As it is, they 100% match the cringy book Hakim, and do not even seem to realize the irony. There is no character in the game that I can feel empathy (or even pity) for - it [i]should[/i] have been the daugther, but she is too deep in the uncanny valley.\nThere are some good design choices, but there are as many abysmally bad ones, and even more are just 'meh'.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Elephant part absolutely ruined the game for me and my boyfriend. It is very very dark and we felt sick to our stomachs. You are forced to tear a sweet elephant apart limb from limb while the elephant in a sweet, childlike voice begs for mercy. It is sick. There is absolutely no point to that scene as well. It adds nothing to the game except for an absolutely horrid experience that leaves you feeling like a terrible person. The game was very cool up to this point and this scene was put in for no other reason than to just scare people with horrible dark \"humor\" if you can even call it that. I would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You need to remove the movies content of the nuts in order to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A good game to play with your partner... until the Elephant chapter. We had to stop. I felt bad, she felt bad, she was very upset and I was getting upset because she was upset. Don't play with your girlfriend if she likes stuffed animals or cute things. Will it be a game you can finally play together? Yes. Will she ever play a game again if this is her first one? Eh, probably not. That's how rough the scene is.\n\nA shame because we really wanted to finish the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decently fun platformer combined with an abusive parent simulator. \nThe writing is remarkably bad.  The tone was all over the place.  In this colorful cutesy world, you are made to commit random acts of horrible violence while a talking book periodically shows up to aggressively pelvic thrust at you and shout idiocy.   The main objective is to help a couple of negligent, self-centered, undeveloped assholes traumatize their child because they believe they will benefit from such a thing. It was like war crimes done in the style of children's television.  We couldn't finish it.  \nThe actual gameplay was kind of fun.  So if you can handle bad storytelling with a total lack of empathy, check it out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great co-op, cringe story. 0/10 didn't come with a girlfriend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely hate the dynamic between the two main characters.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't save the chapter after getting all the way to the end of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the kid doesnt die and a shit ending",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don’t recommend this game because I don’t have friends",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game doesn't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Justice for Cutie!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cant load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "хуйня",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "`tfyrtey",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fr67b uj/ fvbt; 8gyihbunjomk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly only half of a game for me. If designers don't allow you to save the elephant, your only choice is tho turn off the game - that way she will not die. If you want to go in with your kids, be warned of the torture scene.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is a really fun game to play with a friend but it crashed for me and my duo countless times. It didn't always save the progress so we had to replay a chapter over and over again. I looked up the issue, and many other people have experienced the same thing but the developers have yet to fix it years after. We both tried several methods but none of the solutions stuck. It's basically unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i've been wanting to play this game for so long so I was over the moon when it went on sale.\nit has beautiful graphics and uh... a story i guess...\nthat's all i can say about it as it crashed my PC 3 times and it was obvious that it was unplayable for me. \nevery time there was a cutscene, my pc was off. i had to refund it. maybe i'll buy it on PS and try playing it there.\nnever had a this kind of problem with any other games i've played",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is amazing but it is from the garbage of a company called EA. You have to Install EA app that is going to waste your hour(s). So if you buying this to play with a friend or a loved one for an hour or two please don't because often it will just be frustration instead of good times.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Shitest game i have ever played, forced myself the finish the game and it felt like torture. Do not play this game unless u want to feel like ripping us skin off from how cringe it is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is fun in some parts wjhere they mimic other games like dungeon crawlers or mario kart, but all missions otherwise feel like 'fetch' missions.\r\n\r\nIt has some really stunning parts. and others where you want to desperately finish the chapter.\r\n\r\nAlso, as a tip to couples playing this; whoever has more gaming experience should play as May.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "We tried this game with a friend. Playing together was fun, there are a lot of activities, and the game is quite rich in gameplay mechanics, you always do something new: one minute you're flying a plane, 10 minutes later you solve 3 3-dimensional puzzles in space. The setting always changes to something new, too.\n\nBut not everything is ideal. The narrative/story makes so little sense, and they could have been so much better. It tries to show you how the divorce of parents affects their daughter, but it's so blunt and straightforward that you could swap the \"divorce\" topic to pretty much anything else, and it would still be the same game.\n\nAlso, we never finished the game. There is a very cruel scene when you and your partner torture and basically dismember an in-game character. There is no way to skip it, and it looks like a horrifying episode from Happy Tree Friends. My buddy and I decided not to do it because we don't want to, so, unfortunately, I will never know what happens after the 6th hour of gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an incredibly dark story that may end better, but the cut scenes are full of the player characters constantly bickering and there is a moment where you are not able to have any agency as the parents of this poor child (and thus the players controlling them) destroy something very precious to their child little by little as she cries for the parents (and thus you as the player controlling them) to stop. This is not a cut scene you can walk away from. This is forced to be actively done and the only other option is for the **players** to walk away.\r\n\r\nThe gameplay between terrible story beats is good. It's staggering how well you and your friend or partner can have a great time cooperating to the next story beat just to have the characters constantly devolve back to bickering and blaming as soon as the current challenge is completed. Even if they decide to stay together after the experience, it will only last until something goes wrong again.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I got it because the Dev said he doesnt care about any political stuff, which is why I usually avoid games from the bigger mainstream companies. Its a french developer, there IS some eyerolling moments. A little nod here in there to things that definitely are a checkmark somewhere. But nothing to take away from the slow gameplay.\n\nEDIT:\nThe slowest game Ive played in a long time. The puzzles are so brain dead Id jump off a cliff for fun. Unlikable characters that never earn any emotional tugs. The game makes sure to let you know Cody is useless and May is the smart engineer that gets things done. It fails at being an interesting puzzle platformer and it fails at telling a story.\n\nThe best part was how fast you can traverse to finish the game.\nI expected puzzles on par with maybe portal, but this is for like single moms and their 5 year olds.\nNever believe the hype. The bar is so low for games like this, that it gets a pass from a lot of people.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some very nice designed levels, but some puzzles with zero indications about what you are supposed to do.\r\nAs if the designers were so happy with their clever ideas that they did not feel compelled to share them with their players. Not even a pointer like \"you are supposed to go up there\".\r\nOf course this may be only due to my measurably below-average IQ. \r\nI will stick with first person shooters, thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't disable split screen even in online play. It is causing motion sickness for my wife.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While fun with friends, It Takes Two lacks a strong pull to come back to the game after your first playthrough. While it has tons of different gameplay gimmicks and styles, it rarely stays with any of them long enough for the devs to polish the mechanic/make it fun. there are a lot of puzzles which have one player having to solve the whole thing or gets to do a unique gameplay sequence as the other just kinda sits there waiting for them. the writing ranges from extremely forgetable to laughably awful - i ended up turning the voices off. this game is a one and done, something to play through once with a good friend while goofing off and never come back to.\n\nThat said, its genuinely incredible this game goes for so much content. you can tell the devs had passion and wanted to do this right, as tons of unique setpieces and a interesting visual style make up for some of the game's bigger flaws. making the game only have to be purchased by one player is also an amazing, pro-consumer move that should be commended. we need more games like this, this one just needed a drastically better writer and to narrow its focus so that mechanics could get more time spent making them fun.  I'm interested in seeing what the devs end up making next.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get the hype. I thought it was a pretty OK game overall, but I would rank it a 6/10. Maybe it's because I have played team puzzle type games before (Portal 2 is one of my top favs), but it felt boring to me and had major lulls in the storytelling, and was shockingly unpolished. All the cut scenes felt WAY too long to the point that I found myself bored with the game when I was only about 50% through due to the fatigue of these long drawn out scenes. Dialogue was cringy, repetitive, and in most cases unnecessary. Cutting the talking and singing down by half would be a good start. Most of the time, I was annoyed at the characters more than enjoying it. The voice acting was soooo over the top, rarely it worked and was funny but oftentimes it took me out of the gameplay and felt campy in a bad way. The graphics were also so disappointing to me. The cartoony land we are in -- they were great and seemed polished! But every cut scene back to the \"real world\" was uncanny valley to me with a lack of detail that made it feel like it was a totally different game! Not sure if there was a rushed schedule, or budget cuts but it really took me out of the game. It is a shame because I really was looking forward to playing this based on what people were saying, but it felt disjointed and incomplete to me. No idea how anyone could give this a 10/10. I would recommend buying this on sale, not full price. Would probably feel great about this for $10, but for $40 I expected a lot more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "while it is a good game for co-op, i didn't find this as enjoyable as i thought i would. I recently played a way out with a buddy of mine and enjoyed it immensely. But this game lacked the thing to attach me to the game and to keep me enticed. While there are good parts of the game there was more then enough to make me board and not wanting to go on. while i think it could be better with a partner i just could not find it immensely entertaining past a specific part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just part way in a boss fight it will get stuck and not move. the giant beetle level.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible story, They should rename the game to \"May's Story\" since the May character gets all the agency. Player 2 gets to tag along and somehow the narrative is antagonistic to the Cody character.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Neither the story nor mechanics are engaging enough to be fun for two experienced gamers. If you aren't a gamer & non-gamer pair, this game probably isn't for you",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fun gameplay, but it just keeps crashing for no apparent reason. after the first crash i lowered the graphics and verified the files and it worked, after that it just kept crashing without reason nor result. ea should fix their game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game can be very frustrating and there is nothing in the accessibility settings to ease motion sickness for certain parts. Some sections are buggy, sometimes things are not clear enough.\nOnce we beat this game, I doubt I will ever open it again. Watch a playthrough if you are interested in the story, Jacksepticeye played it with Gab ages ago.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I put nearly 6.5 hours into this game. The main characters had not learned a single thing by that point of the story and my friend and I just could not bring ourselves to continue. There is a good game in it, the gameplay up to the town and the clocktower were really fun. But pretty much from the elephant scene and beyond it just became worse and worse for us as we played it. It's got the art style down, gameplay is fun up to a point then it just felt like it fell off, and as for the writing...well, I stand by what I said.\n\nIt's one thing for the characters to be getting taught lessons by the events of the story, but unless we somehow missed something these two hadn't learned a single thing by the 6 hour mark and were just repeatedly creating more trauma for their kid(and us too, really) and had so far learned absolutely nothing as they just kept repeating the exact same mistakes over and over, so I don't know if the goal of the writing was just to make us really hate these two or what.\n\nI see the love this game gets and honestly I'm just kinda confused because from what we saw after 6 hours the writing alone ought to get it some negative points. If somehow we managed to stop playing JUST before it started turning around then maybe that's another point against it too, since how on earth does something take 6 hours to make a point or show any sign of improvements in its writing of the main characters without anyone else pointing out that that's a problem? Even the gameplay had started to wear on us by then, though that may have been attributed to how much we'd come to just despise listening to these two fail to learn a single thing or even see the painfully plainly written points being made to them.\n\nAnd you know what, no, I'm gonna talk about the elephant too. What the hell was the point of that scene? Why did the developers make us torture the kid's elephant toy? Again, were you trying to make me hate these two going forward from that point because that's all you actually managed to do there. It left such a sour taste in our mouth that all we were able to do after it was keep noticing how absolutely trash the kid's parents are and how they just refused to acknowledge a single fault of their own or learn a god damned thing. I'm not judging a product based off one scene but that one scene really did make us start taking notes of how many times these two just absolutely shat the bed regarding their capacity for parenting and the writing of them as a whole up to the 6 hour mark. I just don't get the praise the game gets when it takes such a nose dive after your first handful of hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you don't like platform games, avoid.  It's pretty and cute and has co-op, but at its heart it is a 50 year old game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "maybe it's because i'm in a good relationship, but may and cody are horrible people and they talk like they're in an E3 demo. every time we were met with a cool mechanic, the characters exclaim how cool it is and it just made me want to turn down the dialogue volume. i feel like im watching hoodwinked whenever the book is on screen\n\npsychonauts 2 should've been goty",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game got game of the year? the most overrated game oat. do not listen to the glazers who say this is the best co op game ever its so bad me and my friend wanted to end it all while playing the last part of this game.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}