{
  "positive": [
    {
      "review": "Game is good, albeit it has shitton of bugs. Only one affected gameplay though. Too bad devs prefer to make cosmetics rather than patching the product.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I love this game so much. I always want to start it over and over again. I played part of it with my best friend, and we created such a beautiful save together. That’s why no matter when I log in, I always feel happy ❤️",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you like farming games i cant recommend this one enough it has almost everything you could want in a farming sim. I go as far to say its better than Stardew. 100/100",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played this game since it was in early access. It's come a long way. Having always been a fun game. They've added a lot of content to it over time. I'm also very much a fan of the inclusion of same-sex romancable characters. I love the humor in this game. Like the wolf boy whose loved gifts are bones, meat, and hardwood.\n\nThis is a fun game worth playing~",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a nice break from Stardew Valley, same cozy vibe but with magic, races, and a fantasy twist. \nIt's not perfect, but super chill and fun if you want something a bit different.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's like Stardew Valley but without the annoying energy bar; It's my favorite game to relax to after work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I originally started playing Sun Haven on another system (I'd estimate combined total is probably right about 200hrs thus far) but eventually purchased here on Steam and I am so glad that I did! It runs so much better and the graphics are just absolutely gorgeous. The ability to alter the amount of time a day is in game was absolutely game changing for me. The fact that I can spend an entire day mining or chopping trees if I want without needing to worry about a dang stamina bar opens up my gaming time for way more productive things, which makes the grind much more enjoyable. My husband recently picked up a copy of Sun Haven up and playing together has been so much fun. Highly recommend for fans of the genre, it has its own Sun Haven charm which has been a blast to experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stardew Valley, but with monsters! Personally I had more fun in this game. I hope more content is added soon :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, I even paid over $100 bucks for it in the bundle pack, for some reason I just end up getting bored with it, the characters just don't have the interaction I really want from them, they feel to empty after awhile, I feel this way about every farm sim game though, its the only complaint I ever have about them, I love the graphics, it is super cute to look at, I will give it a try again at some point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for quite some time now and it's completely captivated me. I love how relaxed it is and how involved multiplayer can be. You and your friends can do pretty much everything together. This game now holds a special little place in my heart. Keep up the good work! <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played quite a bit of the genre of farming sims: Stardew Valley, Fields of Mistria, Coral Island, and Mirthwood. Sun Haven is the one that I keep coming back to over and over again. The character design is diverse, there are multiple ways for you to achieve your goals, and there are true rewards for befriending the villagefolk. If you're a fan of any of the aforementioned games, then you HAVE to give Sun Haven a shot. \n\nThe only thing that I have found that I dislike about Sun Haven is the combat choices. The melee option is just so much stronger than magic or crossbow. It is a pretty wide gap of damage output, even if you fully upgrade magic and crossbolts with their armor. Sword will easily outdo both with half the skill levels and no armor buffs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sun Haven is a game that gave more than I was expecting to receive. While I wouldn't recommend it for deep romance or the most engaging story, it shines in how fun the gameplay is and the sheer amount of stuff to do. I highly recommend playing it with friends so you can sit back, chill, and talk about how overpowered magic is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely game with nice graphics and chill music. \nIts \"a must play\" game!.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the creative freedom this game provides, as well as the storyline. Overall, felt a little less stressed than I would be playing Stardew Valley. And the lack of energy bar is great, I'll take mana anytime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game a few months before I learned of the drama behind the scenes. I didn't want to waste my money so I just dove into it, wanting to find out what it's like. So this review is about the game, not the dev drama. I also don't know much about it myself.\n\nWhat I like:\nI actually enjoy it way more than Stardew Valley. The characters are enjoyable, the gameplay is pretty fun, and I am a HUGE fan of the fantasy-centric themes. I gotten too far into it but I like the story so far. I also very much appreciate the gorgeous art. As an artist myself, I love the bright colours and very creative character and creature designs. I also adore the character customization menu. The different fantasy races are so cool and I get to play as races most other games, even fantasy ones, don't offer! (Angel and elementals are my favourites)\nI also like that they give you the option to turn off things like seasonal bosses. They're very annoying but the loot is decent. Oh, and I adore all the different pets you can get!\n\nWhat I dislike:\nThe game can be pretty buggy sometimes, and I really dislike the fact you have to actively tend to more than 1 or 2 farms at once. It's stressful and they should be more automated when you're not there. I also think it's weird that characters from way later in the story show up to events. I don't even know who some of these characters are yet, it kind of feels like spoilers. Not a fan.\n\nThat's pretty much it. I recommend it for the game itself. If you don't feel right buying it cause of the drama, then simply don't get it. Don't feel guilty if you do want to buy it, though. It's a very fun game and life is short. It's really up to you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THIS. this game is now how i spend all my time. such a creative story, i love the characters and everything about this game is unique and pretty to look at. sometimes slightly buggy, but nothing that affects playing. my favorite game <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great take on a cozy farming game with lots of additional features to keep you interested and entertained.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun! Had it in my cart forever, got it on sale, its even better than anticipated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like stardew valley on steroids, Basically a ton more to do, more items, more equipment, better fighting. Having a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and lots of characters and story modes to play through!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its so adorable! Loving the sense of humour and the early game story line so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has an amazing world feel to it and its so good in multiplayer. It has something for everyone be it farming or combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly such a cute and fun game, I love that there isn't a Jealousy system so you can explore any romances you want in one save",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loveee it! Surprising but this game has teached me life lessons. Lesson on just showing up, doing the work every day. It showed how patience and time do the magic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has really been helping with my mental health. \nIt makes me feel calm and relaxed and I love it. \nSuper cozy game that I can just sit down and chill with for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sun Haven has distinct charm in its play style, open feeling world, and large array of options. I've been very grateful that I can alter how difficult the game is and the length of the day in the game! I find it less stressful to play casually and this game allows me to do so while still retaining some modicum of difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sun haven is fun, adorable, and amazing game! I recommend it for those who like cozy games. Super fun with friends as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very much like Stardew Valley in it's design. however it has a MUCH more in depth storyline, multiple farms, and a much better RPG SNES feeling combat system with almost and MMO feeling level-up system. your character is also saved Client Side, not Server Side. so you can join friends at any time with that same character you've been playing in your Single Player World for the last 30+ hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game, if you like Stardew, Rune Factory, Harvest Moon, Fields of Mistria, etc. you're likely gonna like this too, I wish some of the dialogues were a bit more interesting though. Also kind of a shame you have to pay 200 coins when you misclick on someones wheat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember when I first saw this game while looking for something similar to Stardew Valley. In terms of content and story, I think Sun Haven surpasses Stardew because of the shear amount of stuff you can do. There are similar aspects: you're a new farmer, mining system is similar, fisher is similar. However, when I first started, I did NOT realize there were 4 towns you could interact with (something that mods can do for SDV), the crafting system is extremely wide and creative, and you have the choice to not do a lot of it until you're ready. It's a little overwhelming and it took me 3 saves to finally settle and continue through but I truly love the customized nature of this game. There are several ways to get new armor/clothing/appearances. The festivals offer several opportunities to get new items and see various characters. You can even remove seasonal annoyances like pests or weather and even make yourself invincible if you just don't want to deal with damage. I currently play on the longest time setting so I can get the most out of my day and I really love that. \r\n\r\nIf you're looking for something like Stardew Valley, you'll get all that and more with game. Totally worth the price and time, just be patient with your quests and have that wiki open of course!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a nice twist on the farming, city game, so mini games are a grind, and it'd be nice to be able to leave the festivals, but over all I enjoy the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A more exciting version of Stardew. I like both games, but this one is just different enough to be a new experience. Love how theres no fatigue, story is cute. Only thing is one of the dlc's didnt let the game work. I think it was the christmas one. Otherwise it's a nice game. Someone tell Gab Smolders on youtube to play this since she loved Stardew Valley so much!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not going to lie, if you're coming from Stardew, it's going to take a bit longer to sink into it than you'd think and you are definitely going to want a character portrait reskin, but the actual writing is pretty fun and immersive, and the depth of the mechanics is fun. \r\n\r\nI will say, the quite literally, physically slow start to tools and other things is a big turnoff. Progression should absolutely not be based on every rock or tree I hit having a goddamned HP bar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sun Haven is a delightful game, it has an insane amount of character customization, storylines, romance and most definitely a peer to Stardew Valley, Coral Island, and Field of Mystria.   Plus multiplayer makes it easy to have a farm with a total of eight people!   Definitely recommend you play it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun farming sim with a fantasy twist. Just what I was looking for. \r\nCurrently invested in the story and I love getting to know all the villagers without it getting stale so far!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and cute af, a little hard to play solo but great regardess, great visuals esp when im stoned",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Stardew Valley and I even much so love fantasy so merging the two together is all means awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love sun haven! I really enjoy pixel cozy games and this one is just such a cool and amazing concept, the story so far is amazing, I just can’t get over how cute it is too, once you start playing, you won’t stop. It’s literally that good :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stardew valley but a lot more niche stuff in it and magic and stuff. also has a story line to guide you along the world. pretty good\r\n\r\nvaan please bring back the kids I promise it wasn't what it looked like I'm so sorry :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So much fun! I'm having a blast with all the different tasks and interactions with the towns people. Pacing is really good- you can take your time or grind, your choice. I really like that you can choose to focus on anything you want and can change your mind at the drop of a hat without sacrificing any progress or route option. Just mind the seasons when planting seeds! And get a scarecrow ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It might be weird starting with a comment about Stardew Valley, but I tried at least 5-6 times to get into Stardew (even recently) but it only took half an hour in Sun Haven for me to be hooked. I think that says it all about how much I like this game. I especially love that you don't have to watch your energy levels, and there are a diverse range of fantasy characters to interact with.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Seperate the art from the artist. Amazing game. Stop with review bombing a game for shit a dev did <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, but the ridiculous amount of cosmetic DLC is...concerning",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story 8/10\ncharacter stories 10/10\npixel art 10/10\nsit back and farm 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like a lot like Stardew Valley - but with magic spells, combat and no energy limit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game its very cheerful and interesting!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Farming Crops and Exp with my sword",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its simple gameplay that you can get lost in for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All i can say is thank you pixel sprout studios your company made the best pixel game out there in my opinion i spent weeks on this game and i absolutely love it thank you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "had so muchh fun farming and forgot all about time playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this one but still can't decide if it's better than Stardew Valley",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love Stardew Valley but think it needs dragons? This game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun game i really like it as i can do pretty much any thing i like thats in the game like farming and stopping monster   and mining  and i would like for the skin color customization  screen to possibly having more colors to choose for skin like purple or green among other colors  but i also think it would be really cool to add more to the character creation thingy like being able to be a zombie or part dragon ,as well as being able to be a vampire or some others creatures and i know for the Amari creation one i would like to be a bunny and  or a tiger and also being able have a craft-able water sprinkler  too and i also would like to have more places to explore like being able to go to the great city or some others place.. i think that could be a good use of the train station and i would also like it if a person could add their own custom characters as npcs into the game as romance characters in the game that along side the player character to have more of a choice But thats just my opinion, and i really love this game a lot and in my opinion this game might be better then Stardew Valley so thank you for  making a really fun game its the best , and keep up the good work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun farming sims that I've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly enjoyed this game very relaxing and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing although i wish there was an option to hire help/ automate things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun and cozy game, yuh!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So cozy, even after years i always enjoy coming back to it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almost like stardew. Its good if you can ignore the fkin furries running around.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game, shitty company",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My absolute favorite cozy farming sim!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its like stardew valley on fantasy drugs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FOR SOME REASON THIS GAME IS SO SATISFYING",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game i jump in every once in a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST FAVORITE GAME EVER BESIDE STARBOUND\r\n\r\nI HIGHLY RECOMMEND",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this is my favorite game of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 20 elves living in my home, they each were 100 gold coins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the polygamy of this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So far, I have enjoyed this game A LOT!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxing to play after work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yep it's good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than stardew fs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "epic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100/100",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love love love love love love yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "💕💕 cozy and cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the cool sprties",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun farming sim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im enjoying it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Baller",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "squirt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "░░▄▄░░░░▄█████▄\r\n▐▀▄█▌░░▐▓▓▓▓▓▓█▌\r\n░▐█▌░░░█████▓▓██\r\n░██▄▓▓▓▓▓▓▓██▓█▌\r\n▐▓▓▓████▓▓▓███▌",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Not a fan. At first the game is cute and fun. But after playing for awhile, you soon realize how much was not thought-through. 3-4 farms you can manage alone, but damn near impossible to do without playing in multiplayer mode. If multiplayer mode is so recommended, why is the story heavily single player? no body in town acknowledges that there are multiple players. You spawn on top of each other in the cutscenes. But it is hard to manage all the farms, animals and socialize with townsfolk unless you have multiple players. And you do need to do everything to progress in the game. \n\nOh, and don't get me started on the lack of depth in utilizing the items in the game. Not a single recipe for cranberries?! cmon. cranberry juice, cranberry scones, cranberry sauce are all legit recipes in the real world. I noticed that only the crops from the first couple seasons have a plethora of recipes. After that, nothing.\nWhy allow the player to have a special class and a special race if it is not used in dialogue? Only in the beginning of the game was it used. I created a Nara character, but when brimestone update was added, not a single fishman acknowledged I was one of them. They actually talked like I wasnt! \n\nI stopped playing after the first brimestone update. That was my last straw. I don't know if they fixed any of these things I mentioned. But I could clearly tell after unlocking all the areas and doing a bit of the brimestone update that they were rushing the content and not actually fleshing it out. Then come to find out they didn't want to credit the devs. Crazy. No wonder they weren't fleshing things out. The idea was cool in theory, on kickstarter. But the execution? Trash.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "I've played almost 70 hours in and I can honestly say-\nDO NOT BUY THIS GAME!\n\nYou can tell the devs, AT THE START, really cared about their game.\nThey had a great game going, but after the money rolled in and a few years passed by, the care for the game just vanished and they only cared about continuing to line their pockets with more of people's money with DLC packs and other nonsense that was added for furniture and clothes and mounts.\nThe child you can have is such a pathetic addition to the game. They don't have ANY meaningful addition or dialogue or anything. NOT A SINGLE PERSON IN THE TOWN EVEN ACKNOWLEDGES THEY EXIST AFTER THEY ARE GROWN ENOUGH TO BE ABLE TO HANG OUT WITH THE OTHER CHILDREN.\n\nIt's really, really, REALLY sad. The devs should really be ashamed that they stopped caring for the game like this.\n\nSuch a good premise and idea that ALMOST reached the pinnacle of this genre of game, but then the care just vanished after the middle of the game and the end game content is just non-existent. This game HAD the potential to be THE Stardew Valley Destroyer, but it was squandered...\n\nI say again- DO NOT BUY.\n\nThe only reason I'm still playing is cause my girl really likes the game and likes the time spent together.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "I actually liked the game, was hyped to play it coop with my friends and held such high hopes for it, cause at the start you could feel the love from the founding team for its own creation.\nBut i really really advise against buying this game cause of..\n\n- a looooooooot of bugs, which never got adressed , but bringing a lot of expensive DLC \n- coop is working so damn badly, its unbelievable. (couldnt see my hairstyle at the hairdresser, crashes, bugs like things vanishing, being invisible to eatch other, and so many more)\n- bringing out a catastrophal Nintendo Switch port , when the game doesnt even work properly on PC, just to make more money\n- the team deleting negative discord feedback and asking questions about transparency\n- but the worst is the horrible treatment of their own team/artists (payment, credits, etc)\n\nDon´t support this greedy man.\nThere are enough great cozy games out there for every taste. (fields of mistria, stardew valley, my time at sandrock, ova magica, story os seasons, etc etc.)\n\nKurz nochmal auf deutsch:\n\nKauft das Spiel auf keinen Fall!\n\nEinen Mann zu Supporten, der sein eigenes Team/Mitarbeiter so schlecht behandelt, verdient nicht euer Geld. ( Nutzt Google für mehr).\nDas Spiel ist voller Fehler und technischer Probleme, vorallem der Multiplayer und es werden keine Anstalten gemacht das zu beheben.\nLieber überteuerte DLCs und einen Switch Port rausbringen, die ebenfalls schwerwiegende Probleme aufweisen um mehr Kohle zu scheffeln.\nDiscord Nachrichten in denen nach fehlenden Credits, Bugs etc gefragt werden, werden gelöscht.\n\nUnterstützt solches Verhalten nicht - kauft eins der tausend tollen anderen Farm Sims.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Normally I don't feel compelled to leave negative reviews for games. I typically feel, even if *I* personally didn't like the game, that doesn't mean it's necessarily a *bad* game, it's just not for me, and that's ok. Sun Haven is an exception, because I really, really didn't like this one. Cozy gaming is pretty female forward, so please tell me why all the women in this game are giant-breasted anime waifus? It's honestly gross and excessive? I'm not a prude, I swear, the female portraits in this are truly egregious to the point that, as a woman, I am offended. Also the amount of DLC for this game is so excessive that the developers feel the need to obfuscate how much there is- what is listed on the Steam page is not even all of it, there is actually more available in-game that they were, presumably, too embarrassed (rightfully so) to admit to how much cosmetic DLC they had created. And if I needed more reason, the developers for this game have a long history of gross behavior that is easily google-able. As I said, I don't usually leave a bad review just because I don't like a game, but this one, deserves it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Not supporting Devs that can't fix a product or interact with their users.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "bro is trying to be him soooooo bad (stardew valley)\n\nbut fr I really dislike the class thing. it just makes the start unnecessarily confusing and I absolutely hate the wannabe animeass parts of it. there are more characters than stardew valley which is on paper great, but some characters are actually part of the game and some are just place holders. and there is no way to distinguish them except to memorize them by trial and error. just a cheap way to make it seem like it has more characters than it actually has. \n\nand also the fact that some character designs are unnecessarily sexualised? how dumb do you think your players are? what does it really add to the game?\n\nthe game tries to be so many things at the same time which makes it an incoherent mess. you can't just try to put every single mechanic you can think of and expect it to make the game better. \n\nit's such a soulless cash grab that it's offensive. I bought it at a sale and I wish I could refund it. don't get baited by tik tok. I know you are here trying to find a similar experience to when you played stardew valley, but this is not it. \n\nand also I just found about the controversy regarding the devs. fuck everything about this game\n\n\n\n\n\nin short dogshid game dogshid company \ndo not buy do not play",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Theres no way to redo a day, even if you close the game and don't save it saves for you. Its a pretty chill game, like a lighter version of Coral Island or StardewValley but there are time a date specific events (Meet so-and-so and X time or start the event on this day) but if you mess up and leave the game unpaused or accidently skip an event you cant just reload, you have to restart you save file if you dont want to stand up a date or miss an entire festival/event.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely trash. Playing game, click on a vendor jumps out to steam asking for microtransaction. Hard no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very dissapointing and buggy. took forever to figure out how to play multiplayer with my partner just for me to lose all items when transferring them to storage. i literally lost EVERYTHING. not a good first impression at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This may seem like a small gripe, but it actually kills me how many stunning patterns the artists have packed into this game, that I can't use to the fullest.\n\nI want to put decorative stone tiling around rustic wood planks without grass growing between them. A huge part of farming/life sim games, for me, is making my area look personalized to my liking, which I don't feel like I can really do here. There are SO many options for ground tiles, it's incredible. Some of them are costly to make. All of them have this issue. None can seamlessly lay side-by-side.\n\nIf I had looked harder, I would have seen it in the preview images for this game. My issue with Sun Haven is clearly visible in the very first still-image of a farm displayed on the store page.\n\nAfter all the stress and mistreatment the artists went through, to make a game feel so enchanting and alive, and I can't even enjoy all their hard work. What a disappointment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game i remember even you man in this game you can make a romantic love both sex, so yeah this game makes you gae\nthat why i stop playing it, if there any refund possible i would.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "KEEPS EXITING OUT BEFORE SAVING",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "pay your artists",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pay your artists",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Awful studio that's clearly driven by greed. Pity. \n\nThis game could have been great if they'd just refined what worked instead of screwing over artists to continuously pump out half assed DLC. \n\nAside from that, the game also gets needlessly grindy at multiple points to keep you from progressing too quickly through the story. For example, needing to spend multiple in game days mining up a resource that's only ever used for one quest and then never used again. Can't just hand the guy a bunch of stone that you've got lying around. Nope, have to hand him a ton of super special stone that takes for ever to mine and will at no point be useful for anything else going forward. And that's just one of the times they pull shit like that. \n\nI really liked this game initially, but it just got worse as they continued updating it and shifted focus from refining gameplay to hammering out more cosmetics to sell. Definitely recommend avoiding this one at all cost.",
      "voted_up": false,
      "votes_helpful": 285
    },
    {
      "review": "I liked this game, but can't support it after the way the dev team has been behaving and the poor treatment of their artists, not to mention releasing a hundred stupid paid cosmetic DLCs while ignoring the numerous bugs and issues with the game. It's extremely disappointing, and I do not recommend it.",
      "voted_up": false,
      "votes_helpful": 186
    },
    {
      "review": "The game itself is very good - good replayability, cute graphics, great OST. It had the potential to be one of the best farming sim games that focused a lot more on combat. I have played a measly amount of 270+ hours (compared to Stardew and similar farming sim games with a combined total of thousands of hours), and I did enjoy my time with it.\n\nBut considering the recent information leak/updates regarding mismanagement and exploitation of artists, and their mass censorship regarding the topic, I cannot, in good faith, recommend the game. If you really want to play the game, I can't stop you. But if you're not planning on playing it co-op, then just pirate the game. Don't support the developers.",
      "voted_up": false,
      "votes_helpful": 208
    },
    {
      "review": "It was a really fun game with a unique flavor for a stardew-like! I loved the amount of farming I get to do, the fantasy race love interests, areas to explore, cute creatures, mounts, modding support, and more. I clocked at least 100hrs before learning about the shadiness of the studio. It's a real shame how this game fell off due to the alleged mistreatment of its artists, suppression of criticism within its community, and complete silence on the situation. Not to mention all the unaddressed bugs and issues.",
      "voted_up": false,
      "votes_helpful": 123
    },
    {
      "review": "Nah, not recommended after what happened at the Studio. Really takes the fun away every time you start the game and see Pixel Sprout Studios and the first thing that comes to mind is Los Angeles and Greed, oh such irony.",
      "voted_up": false,
      "votes_helpful": 200
    },
    {
      "review": "I've played almost 70 hours in and I can honestly say-\nDO NOT BUY THIS GAME!\n\nYou can tell the devs, AT THE START, really cared about their game.\nThey had a great game going, but after the money rolled in and a few years passed by, the care for the game just vanished and they only cared about continuing to line their pockets with more of people's money with DLC packs and other nonsense that was added for furniture and clothes and mounts.\nThe child you can have is such a pathetic addition to the game. They don't have ANY meaningful addition or dialogue or anything. NOT A SINGLE PERSON IN THE TOWN EVEN ACKNOWLEDGES THEY EXIST AFTER THEY ARE GROWN ENOUGH TO BE ABLE TO HANG OUT WITH THE OTHER CHILDREN.\n\nIt's really, really, REALLY sad. The devs should really be ashamed that they stopped caring for the game like this.\n\nSuch a good premise and idea that ALMOST reached the pinnacle of this genre of game, but then the care just vanished after the middle of the game and the end game content is just non-existent. This game HAD the potential to be THE Stardew Valley Destroyer, but it was squandered...\n\nI say again- DO NOT BUY.\n\nThe only reason I'm still playing is cause my girl really likes the game and likes the time spent together.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Not a fan. At first the game is cute and fun. But after playing for awhile, you soon realize how much was not thought-through. 3-4 farms you can manage alone, but damn near impossible to do without playing in multiplayer mode. If multiplayer mode is so recommended, why is the story heavily single player? no body in town acknowledges that there are multiple players. You spawn on top of each other in the cutscenes. But it is hard to manage all the farms, animals and socialize with townsfolk unless you have multiple players. And you do need to do everything to progress in the game. \n\nOh, and don't get me started on the lack of depth in utilizing the items in the game. Not a single recipe for cranberries?! cmon. cranberry juice, cranberry scones, cranberry sauce are all legit recipes in the real world. I noticed that only the crops from the first couple seasons have a plethora of recipes. After that, nothing.\nWhy allow the player to have a special class and a special race if it is not used in dialogue? Only in the beginning of the game was it used. I created a Nara character, but when brimestone update was added, not a single fishman acknowledged I was one of them. They actually talked like I wasnt! \n\nI stopped playing after the first brimestone update. That was my last straw. I don't know if they fixed any of these things I mentioned. But I could clearly tell after unlocking all the areas and doing a bit of the brimestone update that they were rushing the content and not actually fleshing it out. Then come to find out they didn't want to credit the devs. Crazy. No wonder they weren't fleshing things out. The idea was cool in theory, on kickstarter. But the execution? Trash.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "Unethical developer.\n\nI purchased and played the game early on before the controversies began to surface, but I regret contributing to this exploitation project more than I regret having to uninstall/shelf it.\n\nThe art is charming, and there's a lot of stuff. (Wide array of crops and decorations, for example.) However, even setting aside the bad business practices, Sun Haven never quite made it into my \"top tier\" of farm sims. It's not a total dud, but are plenty of more compelling options available.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "cannot in good faith recommend this\n\nedit: the studio is under fire for their greedy business practices and mistreatment of their employees",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "I like this game, but the FPS sometimes randomly drops to 25 or 5, so I cannot recommend it. Oh, also the thing where the studio didn't pay their staff.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I had 0 knowledge about the controversy surrounding the game until I searched up the bugs (there were loads and I was frustrated). I happen to read the reviews which led me to do my own research. I cannot in good faith recommend this game even though it’s fun. For those who don’t know what I’m talking about, watch MRIZ videos.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "[h3]🧙♀️ Sun Haven – Enchanting on the Surface, Disappointing at the Core 🌾 [/h3]\n⭐️⭐️ (2/5)\n\n[i]Sun Haven[/i] initially felt like it had a lot of promise - a pixel-style farming sim with magical, witchy vibes and multiplayer support. My friends encouraged me to give it a try (even though I’m not usually a fan of pixel graphics), and I did enjoy some of it. The farming [i]can[/i] be satisfying, and the overall aesthetic is charming.\n\nBut that’s where the positives mostly end.\n\nThe dialogue is flat and often skippable, and the progression is extremely grindy. You’ll spend a lot of time farming specific items just to unlock the next step, and while there are more efficient ways to play, it still feels padded and slow. It borrows a lot from [i]Stardew Valley[/i], but without the same heart or character depth.\n\n[b][u]However[/u][/b], the main reason I’m rating it 2/5 and choosing not to recommend it goes [b]beyond the gameplay[/b].\n\n[i]Pixel Sprout Studios[/i], the developer, has been involved in ongoing lawsuits involving [b]serious allegations[/b]: underpaying workers (reportedly as low as $7/hour), not crediting artists and designers for their work, and creating a hostile, exploitative work environment. All this while continuously pushing expensive cosmetic DLCs - which feels like [i]pure greed[/i], especially when their team isn’t being fairly compensated or acknowledged.\n\nIt’s deeply disappointing to see a game that had potential be overshadowed by unethical business practices. As players, I believe it’s important to think critically about [i]who[/i] we’re supporting. Art doesn’t exist in a vacuum, and when studios mistreat their creators, it reflects in the integrity of the product.\n\nI genuinely enjoyed parts of Sun Haven, but I won’t continue to play it or support the studio behind it. If [i]Pixel Sprout[/i] wants to be taken seriously, they need to pay their artists, credit their teams, and start acting with basic decency.\n\nUntil then, this game is a pass. Please think about who you choose to support.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I actually liked the game, was hyped to play it coop with my friends and held such high hopes for it, cause at the start you could feel the love from the founding team for its own creation.\nBut i really really advise against buying this game cause of..\n\n- a looooooooot of bugs, which never got adressed , but bringing a lot of expensive DLC \n- coop is working so damn badly, its unbelievable. (couldnt see my hairstyle at the hairdresser, crashes, bugs like things vanishing, being invisible to eatch other, and so many more)\n- bringing out a catastrophal Nintendo Switch port , when the game doesnt even work properly on PC, just to make more money\n- the team deleting negative discord feedback and asking questions about transparency\n- but the worst is the horrible treatment of their own team/artists (payment, credits, etc)\n\nDon´t support this greedy man.\nThere are enough great cozy games out there for every taste. (fields of mistria, stardew valley, my time at sandrock, ova magica, story os seasons, etc etc.)\n\nKurz nochmal auf deutsch:\n\nKauft das Spiel auf keinen Fall!\n\nEinen Mann zu Supporten, der sein eigenes Team/Mitarbeiter so schlecht behandelt, verdient nicht euer Geld. ( Nutzt Google für mehr).\nDas Spiel ist voller Fehler und technischer Probleme, vorallem der Multiplayer und es werden keine Anstalten gemacht das zu beheben.\nLieber überteuerte DLCs und einen Switch Port rausbringen, die ebenfalls schwerwiegende Probleme aufweisen um mehr Kohle zu scheffeln.\nDiscord Nachrichten in denen nach fehlenden Credits, Bugs etc gefragt werden, werden gelöscht.\n\nUnterstützt solches Verhalten nicht - kauft eins der tausend tollen anderen Farm Sims.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The dev team behind the game (Pixel Sprout Studios) do not deserve your money.\n\nSearch \"THE SUN HAVEN CONTROVERSY\" on youtube for more info.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I already have almost 50 hours in this game and I cannot tell you how much I'm in love with it. The vibes, the gameplay- everything about it. However, just from reading the other reviews, I cannot in good conscience recommend it. \nPAY. YOUR. FLIPPING. ARTISTS. I wish I had seen the reviews before I bought the DLCs.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Normally I don't feel compelled to leave negative reviews for games. I typically feel, even if *I* personally didn't like the game, that doesn't mean it's necessarily a *bad* game, it's just not for me, and that's ok. Sun Haven is an exception, because I really, really didn't like this one. Cozy gaming is pretty female forward, so please tell me why all the women in this game are giant-breasted anime waifus? It's honestly gross and excessive? I'm not a prude, I swear, the female portraits in this are truly egregious to the point that, as a woman, I am offended. Also the amount of DLC for this game is so excessive that the developers feel the need to obfuscate how much there is- what is listed on the Steam page is not even all of it, there is actually more available in-game that they were, presumably, too embarrassed (rightfully so) to admit to how much cosmetic DLC they had created. And if I needed more reason, the developers for this game have a long history of gross behavior that is easily google-able. As I said, I don't usually leave a bad review just because I don't like a game, but this one, deserves it.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Well... it is fun(ish), and can absorbe you for many hours BUT! I really can't recommend it. \n\nIt's very unpolished - the devs are keep releasing new content but don't care to repair the one that's already out. Istg the races feel like a mod with how much clipping is going on (a bad mod on top of that - most modders actually update their content so it doesnt happen...). Why are nagas' tails clipping through mounts and dresses? Why do demons' horns dissapear when you wear any head accesorry? Not mentioning that even some hairstyles are simply clipping through the body.... Frame rate drops rappidly at times and won't go back to normal unless you restart the whole game. Some spells don't work correctly - especially when there is many enemies around - which is the whole thing of a few boss fights. \n\nAND! You have to deal with all of that just to witness some really lazy writing. There is so many places that feel empty and useless, there is just nothing to do there (especially looking at the new underwater region, once you do the main story quest, you can chase the romancable npcs there but thats about it?), boss fights don't have second phases, a few have more than one attack pattern and all of them are overall pretty boring. The dialogues choices are written with 0 effort - it's always \"challange what the character said (-heart), compliment the character (+heart)\"... at this point i believe everyone there is a narcissist who takes offence at even a slight hint of having a differnet opinion. The heart events... if you can even call them that... are exteremely short and boring. On our second date i got to compliment Jun 3 times sitting on his couch. woaw. \n\nOverall Sun Haven feels artifically inflated at the cost of substance. There is so many places you can visit, so many farms and houses you can have, so many people you can meet - but none of it is really captivating. It has it's moments, but they are mostly drown in the sea of mediocrity.\n\nI really wanted to love it - Stardew with a fantasy twist sounded like dreams come true. But unfortunately, I have to keep waiting for my perfect game. \n\nPS. Also as it turns out the devs suck, so even if my words didn't convince you, still consider not supporting them lol",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Not supporting Devs that can't fix a product or interact with their users.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Suffers from lack of direction, poorly designed skill trees, and EXTREME item bloat. To give an example, there are something like 5 or 6 different crafting stations just for food plus each crafting station has both an \"Elven\" and \"Monster\" counterpart with its own craftable items. Not only that, but farming isn't well designed nor do I believe is it the focus of the game. It appears more like a cover for the fact that one of the head designers REALLY wanted to make an adventure game, but was forced to work on a team that was making a farm sim.\n\nIt honestly feels like a bloated mobile game that intended to sell \"themed cosmetics\"... which it kinda is if you look at the DLC section.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a fun game but the devs seem scummy and greedy there are always new issues especially in co-op. My partner and I couldnt play for over a week because the multiplayer was broken and we also lost all of our animals and pets as did many others.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Its a good basegame. But the devs seems shady and way too many DLCs.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I played this game a long time ago and didn’t know about the controversy surrounding the studio. This negative review is only about the studio’s management, not the artists and writers who were underpaid or silently banned by the leadership",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Decent game but Pixel Sprout Studios and Bruce have a lot of allegations against them. Just reading Meg \"Yako\" Ziegler post about ex-developers at Pixel Sprout Studios gives me the impression that this studio is not great.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love this game, but sadly I cannot recommend buying this game because this company does not pay or credit their artists. :(",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Had high hopes for this game early on, but game seems to have broke more and more over time with shoddy updates and it's just become a shallow dlc cash grab, on top of the company being complete garbage refusing to credit the devs/artists or pay them properly. On top of releasing actually unplayable ports and refusing to fix them. Because why work on the foundations of your game when you can rake in more cash with skins! And trying to pressure you and push you to the dlc page in game, how immersive and fun!  I recommend staying away from anything Pixel Sprout Studios",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Ultimately, I can't recommend this game because of the scummy business practices and exploitation behind it.\n\nAs for the game itself, it's all right but ultimately feels... shallow. There's so many different locations/farms to manage and so many npcs that you don't really develop any deep relationship with any of them compared to similar games like Story of Seasons, Stardew Valley, Rune Factory, etc.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just couldn't get into it at all, and heard that the creator wasn't paying his artists after I broke the refund rules... (2 hours played at most). I wouldn't recommend, it's boring.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "game is fun. But studio embraces harmful corporate practices. check other reviews on that.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really wanted to like this game and during the first couple of hours it really felt like the perfect game. But sadly it turned out to be a buggy mess. All of the sudden some of my tools would stop working completely and not even restarting the game or buying new tools could fix this problem. I read that these bugs arent a new issue and that people have reported this problem before but it looks like pixel sprout studios doesnt really care to fix these bugs.  I hope i get a refund even if i played more than two hours.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "would have been good if thedevs actually paid their workers\n\n Main allegations against Pixel Sprout Studios:\n\n1. CENSORSHIP & DAMAGE CONTROL\n- After MRIZ's exposé video in January, Pixel Sprout went into full censorship mode\n- Mass-deleted criticism on Reddit and Discord\n- Instructed moderators to remove any mentions of the controversy\n- Changed Discord rules to suppress \"rumors\" and criticism\n- Current Discord moderators report feeling unvalued and describe the studio as \"very secretive\"\n\n2. MISSING CREDITS & UNPAID WORK\n- Sun Haven has NO credits anywhere in the game (even past version 2.0)\n- Former community manager promised credits \"in a future update\" for 2 years - never happened\n- Team credits were mysteriously removed from the original Kickstarter page\n- Used \"community volunteers\" to translate 30,000 lines of dialogue for free (this violates U.S. labor law - for-profit companies cannot use volunteer work)\n\n3. RESTRICTIVE NDAs & SECRECY\n- Artists forced to sign NDAs that prevented them from publicly acknowledging their work\n- Many couldn't even mention working on Sun Haven on LinkedIn or social media\n- One artist was labeled \"untrustworthy\" for wanting to mention Sun Haven on TikTok\n- Artists told they were in \"trial periods\" that never ended\n- Artists felt isolated and anxious about saying the wrong thing\n\n4. UNDERPAID ARTISTS (5 Former Artists Interviewed)\n- Pay rates: $10-22.50/hour (well below industry standard)\n- Helly: $17-18/hour, told raises would come but minimal progression\n- John: Started at $10/hour, worked ~30hrs/week max\n- Kyle: $15-18/hour + minimal profit sharing (~$1000 total)\n- Lucas: $20-22.50/hour (Bruce thought $20 was \"too high\")\n- Naomi: $10-18/hour, believes they targeted artists from lower-wage countries\n\n5. EXPLOITATION & POOR WORKING CONDITIONS\n- Artists worked as \"independent contractors\" (no benefits, sick pay, etc.)\n- Constant \"burndown\" urgent tickets and impossible deadlines\n- Lucas worked 14-hour days during UI revamp, severe burnout\n- Kyle: \"felt like a cog in the art machine,\" took 6+ months to love art again after leaving\n- Micromanagement and excessive revisions\n- Artists isolated from main team, moved to separate Discord\n- Culture of praising overwork and crunch\n- Artists describe feeling like \"asset production machines\" rather than valued team members\n\n6. FINANCIAL SUCCESS VS. WORKER TREATMENT\n- Sun Haven is estimated to have sold ~1 million copies, grossing $12.8-22.5 million\n- ⮤ That's only Steam base game sales - excluding Nintendo Switch and DLCs\n- 57 paid cosmetic DLCs have been released so far (worth $427.44 in total) - none of which provide royalties to the artists\n- Company clearly has money but chose not to pay workers fairly\n- One week of Steam sales = more than artists earn in a full year\n- Studio constantly hiring while underpaying existing workers\n\n7. TOXIC MANAGEMENT\n- Bruce/Taylor reportedly yelled at female employees in meetings\n- Made concerning comments about race (\"BLM is a fad,\" resisted diverse character options)\n- Forbade use of the word \"morale\" when workers complained about burnout\n- Surrounded himself with \"yes-men\" and avoided accountability\n- Lucas: \"made me hate pixel art and game development, two things I'm passionate about since I was a child\"\n- Naomi: had to consult a lawyer about quitting due to fear of retaliation\n\nARTISTS FINAL WORDS:\n- Helly: Emphasizes need for open communication and good leadership to create healthy work environments\n- John: Believes studio started with good intentions but became a money-churning operation benefiting only leadership\n- Kyle: Refers to previous statements made to MRIZ\n- Lucas: Challenges Bruce directly and urges players to demand answers\n- Naomi: Warns others not to work for Pixel Sprout and prioritizes health over any job",
      "voted_up": false,
      "votes_helpful": 263
    },
    {
      "review": "Cons:\nVery grindy for no reason. Quests don't make sense, or follow seasons. Characters aren't interesting. Random monsters keep obstructing the farm to be annoying, but you don't have to farm so it does't matter. You can shoot through walls. \n\nPros:\nYou can crit strike trees.\n\nIf you are looking to scratch that stardew itch, this isn't it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "My friend and I couldn’t connect to the same game, which caused a bug. The mechanics also don’t resemble Stardew Valley. Lower your expectations. I’m requesting a refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "where stardew valley was made with love and care, as a loveletter to fans of harvest moon. sunhaven was made to bilk the success of it. \r\n\r\ngame breaking bugs dont get patched or fixed, you will see 10 releases of monetized skin packs before you see them actualy put any code work and fixes in the game, because again this isnt something made to be enjoyed, its here to be milked for cash.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "bro is trying to be him soooooo bad (stardew valley)\n\nbut fr I really dislike the class thing. it just makes the start unnecessarily confusing and I absolutely hate the wannabe animeass parts of it. there are more characters than stardew valley which is on paper great, but some characters are actually part of the game and some are just place holders. and there is no way to distinguish them except to memorize them by trial and error. just a cheap way to make it seem like it has more characters than it actually has. \n\nand also the fact that some character designs are unnecessarily sexualised? how dumb do you think your players are? what does it really add to the game?\n\nthe game tries to be so many things at the same time which makes it an incoherent mess. you can't just try to put every single mechanic you can think of and expect it to make the game better. \n\nit's such a soulless cash grab that it's offensive. I bought it at a sale and I wish I could refund it. don't get baited by tik tok. I know you are here trying to find a similar experience to when you played stardew valley, but this is not it. \n\nand also I just found about the controversy regarding the devs. fuck everything about this game\n\n\n\n\n\nin short dogshid game dogshid company \ndo not buy do not play",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game is very overwhelming and confusing at times. The dialogue can be shallow and very cheesy. It's almost impossible to play this game without choosing the longer day options, but at that point I don't want to spend 40 real time minutes for a single day to pass in this game.\n\nThe combat is kinda clunky as well, and the first slime boss I fought felt uninspired. Just a big enemy with a big health bar. Magic is stiff and feels awkward to use imo.\n\nSome of the art is very stiff, too. Apparently they were reworking character portraits, but that was a WHILE ago I heard that. They've since released new characters with the old art style since, and you can tell which characters were added after release. For example, the character portrait for Liam is so embarrassing, with how stiff it looks and how he just awkwardly hides his hands so the artist can avoid drawing hands. Most of the character portraits have their hands in an awkward pose or outright hidden. This is true for the majority of the male character portraits. \n\nAlso, my personal opinion, some of the winter/fall outfits are HORRENDOUS, like who decided to dress Lucius like that for winter? A lot of the clothing have these weird shines to them, and you can tell a lot of the outfits were an afterthought. Hats and hoodies will outright cover hair as if the hair was the contour of their head, and you end up with bulbous head proportions. Good examples of this are with Iris, KItty, Zaria, Vivi, Kai, and Shang.\n\nI appreciate the effort to try to incorporate such an ambitious project of seasonal clothing, but you end up with really nice looking characters like Miyeon having the oddest winter outfit. Sometimes less is more. \nAlso, the game doesn't really give non-romanceable chatacters portraits, they're just sprites, which breaks some immersion because you'll probably forget them.\n\nThe landscapes and buildings, however, are very pretty and look amazing. Character customization is great too, and you have a lot of choices with cosmetics and decor that looks really good. It's a very beautiful atmospheric game at times, which makes the character portrait and ugly UI issue stand out so much more. The UI reminds me of a mobile game.\n\nArt aside, having to manage 3 farms all growing their own crops and having their own crafting tables, multiple mines to explore and finish, many fetch quests, and the main story line makes the game a little too overwhelming. No single mechanic feels in depth, and everything is a bit of a surface level system. ADHD nightmare game aha. \n\nI really really really wanted to like this game!! But it's just too much; They tried doing everything, and it just ended up feeling cramped.\n\nAnd edit to add: It felt annoying to explore! You wasted so much time exploring such a big map, and then felt like you spent a day doing nothing. Most of this traveling is replaced later with flying, maybe if I played longer I would've seen teleportation, but It isn't very respecting of your time and even blocks off shortcuts in a very big map where time is valuable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Theres no way to redo a day, even if you close the game and don't save it saves for you. Its a pretty chill game, like a lighter version of Coral Island or StardewValley but there are time a date specific events (Meet so-and-so and X time or start the event on this day) but if you mess up and leave the game unpaused or accidently skip an event you cant just reload, you have to restart you save file if you dont want to stand up a date or miss an entire festival/event.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have had a problem for a while with the game. When I sleep, I face the problem.The problem is that the screen goes black and does not change.Which makes me unable to play",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really like they majority of the game like how some areas are locked behind certain goals and such, But at sometimes it feels like they tried to hard to make it way too large like the part where you unlock both new farm plots/city at the same time. Most of the base game without time modifier is made for multiplayer, it seems almost impossible to do most of the quest, manage daily task, etc as one player. The greatest pain point imo is the museum, it feels unnecessarily tedious, like there should at least be some way to better keep track of it and make the task simpler. \n\nIn general the game would have been recommended by me, but there's also the issue that everyone else is talking about with the artist situation.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely trash. Playing game, click on a vendor jumps out to steam asking for microtransaction. Hard no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This may seem like a small gripe, but it actually kills me how many stunning patterns the artists have packed into this game, that I can't use to the fullest.\n\nI want to put decorative stone tiling around rustic wood planks without grass growing between them. A huge part of farming/life sim games, for me, is making my area look personalized to my liking, which I don't feel like I can really do here. There are SO many options for ground tiles, it's incredible. Some of them are costly to make. All of them have this issue. None can seamlessly lay side-by-side.\n\nIf I had looked harder, I would have seen it in the preview images for this game. My issue with Sun Haven is clearly visible in the very first still-image of a farm displayed on the store page.\n\nAfter all the stress and mistreatment the artists went through, to make a game feel so enchanting and alive, and I can't even enjoy all their hard work. What a disappointment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "KEEPS EXITING OUT BEFORE SAVING",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "pay your artists",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pay your artists",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Awful studio that's clearly driven by greed. Pity. \n\nThis game could have been great if they'd just refined what worked instead of screwing over artists to continuously pump out half assed DLC. \n\nAside from that, the game also gets needlessly grindy at multiple points to keep you from progressing too quickly through the story. For example, needing to spend multiple in game days mining up a resource that's only ever used for one quest and then never used again. Can't just hand the guy a bunch of stone that you've got lying around. Nope, have to hand him a ton of super special stone that takes for ever to mine and will at no point be useful for anything else going forward. And that's just one of the times they pull shit like that. \n\nI really liked this game initially, but it just got worse as they continued updating it and shifted focus from refining gameplay to hammering out more cosmetics to sell. Definitely recommend avoiding this one at all cost.",
      "voted_up": false,
      "votes_helpful": 285
    },
    {
      "review": "I liked this game, but can't support it after the way the dev team has been behaving and the poor treatment of their artists, not to mention releasing a hundred stupid paid cosmetic DLCs while ignoring the numerous bugs and issues with the game. It's extremely disappointing, and I do not recommend it.",
      "voted_up": false,
      "votes_helpful": 186
    },
    {
      "review": "The game itself is very good - good replayability, cute graphics, great OST. It had the potential to be one of the best farming sim games that focused a lot more on combat. I have played a measly amount of 270+ hours (compared to Stardew and similar farming sim games with a combined total of thousands of hours), and I did enjoy my time with it.\n\nBut considering the recent information leak/updates regarding mismanagement and exploitation of artists, and their mass censorship regarding the topic, I cannot, in good faith, recommend the game. If you really want to play the game, I can't stop you. But if you're not planning on playing it co-op, then just pirate the game. Don't support the developers.",
      "voted_up": false,
      "votes_helpful": 208
    },
    {
      "review": "It was a really fun game with a unique flavor for a stardew-like! I loved the amount of farming I get to do, the fantasy race love interests, areas to explore, cute creatures, mounts, modding support, and more. I clocked at least 100hrs before learning about the shadiness of the studio. It's a real shame how this game fell off due to the alleged mistreatment of its artists, suppression of criticism within its community, and complete silence on the situation. Not to mention all the unaddressed bugs and issues.",
      "voted_up": false,
      "votes_helpful": 123
    },
    {
      "review": "Nah, not recommended after what happened at the Studio. Really takes the fun away every time you start the game and see Pixel Sprout Studios and the first thing that comes to mind is Los Angeles and Greed, oh such irony.",
      "voted_up": false,
      "votes_helpful": 200
    },
    {
      "review": "I've played almost 70 hours in and I can honestly say-\nDO NOT BUY THIS GAME!\n\nYou can tell the devs, AT THE START, really cared about their game.\nThey had a great game going, but after the money rolled in and a few years passed by, the care for the game just vanished and they only cared about continuing to line their pockets with more of people's money with DLC packs and other nonsense that was added for furniture and clothes and mounts.\nThe child you can have is such a pathetic addition to the game. They don't have ANY meaningful addition or dialogue or anything. NOT A SINGLE PERSON IN THE TOWN EVEN ACKNOWLEDGES THEY EXIST AFTER THEY ARE GROWN ENOUGH TO BE ABLE TO HANG OUT WITH THE OTHER CHILDREN.\n\nIt's really, really, REALLY sad. The devs should really be ashamed that they stopped caring for the game like this.\n\nSuch a good premise and idea that ALMOST reached the pinnacle of this genre of game, but then the care just vanished after the middle of the game and the end game content is just non-existent. This game HAD the potential to be THE Stardew Valley Destroyer, but it was squandered...\n\nI say again- DO NOT BUY.\n\nThe only reason I'm still playing is cause my girl really likes the game and likes the time spent together.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Not a fan. At first the game is cute and fun. But after playing for awhile, you soon realize how much was not thought-through. 3-4 farms you can manage alone, but damn near impossible to do without playing in multiplayer mode. If multiplayer mode is so recommended, why is the story heavily single player? no body in town acknowledges that there are multiple players. You spawn on top of each other in the cutscenes. But it is hard to manage all the farms, animals and socialize with townsfolk unless you have multiple players. And you do need to do everything to progress in the game. \n\nOh, and don't get me started on the lack of depth in utilizing the items in the game. Not a single recipe for cranberries?! cmon. cranberry juice, cranberry scones, cranberry sauce are all legit recipes in the real world. I noticed that only the crops from the first couple seasons have a plethora of recipes. After that, nothing.\nWhy allow the player to have a special class and a special race if it is not used in dialogue? Only in the beginning of the game was it used. I created a Nara character, but when brimestone update was added, not a single fishman acknowledged I was one of them. They actually talked like I wasnt! \n\nI stopped playing after the first brimestone update. That was my last straw. I don't know if they fixed any of these things I mentioned. But I could clearly tell after unlocking all the areas and doing a bit of the brimestone update that they were rushing the content and not actually fleshing it out. Then come to find out they didn't want to credit the devs. Crazy. No wonder they weren't fleshing things out. The idea was cool in theory, on kickstarter. But the execution? Trash.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "Unethical developer.\n\nI purchased and played the game early on before the controversies began to surface, but I regret contributing to this exploitation project more than I regret having to uninstall/shelf it.\n\nThe art is charming, and there's a lot of stuff. (Wide array of crops and decorations, for example.) However, even setting aside the bad business practices, Sun Haven never quite made it into my \"top tier\" of farm sims. It's not a total dud, but are plenty of more compelling options available.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "cannot in good faith recommend this\n\nedit: the studio is under fire for their greedy business practices and mistreatment of their employees",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "I like this game, but the FPS sometimes randomly drops to 25 or 5, so I cannot recommend it. Oh, also the thing where the studio didn't pay their staff.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I had 0 knowledge about the controversy surrounding the game until I searched up the bugs (there were loads and I was frustrated). I happen to read the reviews which led me to do my own research. I cannot in good faith recommend this game even though it’s fun. For those who don’t know what I’m talking about, watch MRIZ videos.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "[h3]🧙♀️ Sun Haven – Enchanting on the Surface, Disappointing at the Core 🌾 [/h3]\n⭐️⭐️ (2/5)\n\n[i]Sun Haven[/i] initially felt like it had a lot of promise - a pixel-style farming sim with magical, witchy vibes and multiplayer support. My friends encouraged me to give it a try (even though I’m not usually a fan of pixel graphics), and I did enjoy some of it. The farming [i]can[/i] be satisfying, and the overall aesthetic is charming.\n\nBut that’s where the positives mostly end.\n\nThe dialogue is flat and often skippable, and the progression is extremely grindy. You’ll spend a lot of time farming specific items just to unlock the next step, and while there are more efficient ways to play, it still feels padded and slow. It borrows a lot from [i]Stardew Valley[/i], but without the same heart or character depth.\n\n[b][u]However[/u][/b], the main reason I’m rating it 2/5 and choosing not to recommend it goes [b]beyond the gameplay[/b].\n\n[i]Pixel Sprout Studios[/i], the developer, has been involved in ongoing lawsuits involving [b]serious allegations[/b]: underpaying workers (reportedly as low as $7/hour), not crediting artists and designers for their work, and creating a hostile, exploitative work environment. All this while continuously pushing expensive cosmetic DLCs - which feels like [i]pure greed[/i], especially when their team isn’t being fairly compensated or acknowledged.\n\nIt’s deeply disappointing to see a game that had potential be overshadowed by unethical business practices. As players, I believe it’s important to think critically about [i]who[/i] we’re supporting. Art doesn’t exist in a vacuum, and when studios mistreat their creators, it reflects in the integrity of the product.\n\nI genuinely enjoyed parts of Sun Haven, but I won’t continue to play it or support the studio behind it. If [i]Pixel Sprout[/i] wants to be taken seriously, they need to pay their artists, credit their teams, and start acting with basic decency.\n\nUntil then, this game is a pass. Please think about who you choose to support.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I actually liked the game, was hyped to play it coop with my friends and held such high hopes for it, cause at the start you could feel the love from the founding team for its own creation.\nBut i really really advise against buying this game cause of..\n\n- a looooooooot of bugs, which never got adressed , but bringing a lot of expensive DLC \n- coop is working so damn badly, its unbelievable. (couldnt see my hairstyle at the hairdresser, crashes, bugs like things vanishing, being invisible to eatch other, and so many more)\n- bringing out a catastrophal Nintendo Switch port , when the game doesnt even work properly on PC, just to make more money\n- the team deleting negative discord feedback and asking questions about transparency\n- but the worst is the horrible treatment of their own team/artists (payment, credits, etc)\n\nDon´t support this greedy man.\nThere are enough great cozy games out there for every taste. (fields of mistria, stardew valley, my time at sandrock, ova magica, story os seasons, etc etc.)\n\nKurz nochmal auf deutsch:\n\nKauft das Spiel auf keinen Fall!\n\nEinen Mann zu Supporten, der sein eigenes Team/Mitarbeiter so schlecht behandelt, verdient nicht euer Geld. ( Nutzt Google für mehr).\nDas Spiel ist voller Fehler und technischer Probleme, vorallem der Multiplayer und es werden keine Anstalten gemacht das zu beheben.\nLieber überteuerte DLCs und einen Switch Port rausbringen, die ebenfalls schwerwiegende Probleme aufweisen um mehr Kohle zu scheffeln.\nDiscord Nachrichten in denen nach fehlenden Credits, Bugs etc gefragt werden, werden gelöscht.\n\nUnterstützt solches Verhalten nicht - kauft eins der tausend tollen anderen Farm Sims.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The dev team behind the game (Pixel Sprout Studios) do not deserve your money.\n\nSearch \"THE SUN HAVEN CONTROVERSY\" on youtube for more info.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I already have almost 50 hours in this game and I cannot tell you how much I'm in love with it. The vibes, the gameplay- everything about it. However, just from reading the other reviews, I cannot in good conscience recommend it. \nPAY. YOUR. FLIPPING. ARTISTS. I wish I had seen the reviews before I bought the DLCs.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Normally I don't feel compelled to leave negative reviews for games. I typically feel, even if *I* personally didn't like the game, that doesn't mean it's necessarily a *bad* game, it's just not for me, and that's ok. Sun Haven is an exception, because I really, really didn't like this one. Cozy gaming is pretty female forward, so please tell me why all the women in this game are giant-breasted anime waifus? It's honestly gross and excessive? I'm not a prude, I swear, the female portraits in this are truly egregious to the point that, as a woman, I am offended. Also the amount of DLC for this game is so excessive that the developers feel the need to obfuscate how much there is- what is listed on the Steam page is not even all of it, there is actually more available in-game that they were, presumably, too embarrassed (rightfully so) to admit to how much cosmetic DLC they had created. And if I needed more reason, the developers for this game have a long history of gross behavior that is easily google-able. As I said, I don't usually leave a bad review just because I don't like a game, but this one, deserves it.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Well... it is fun(ish), and can absorbe you for many hours BUT! I really can't recommend it. \n\nIt's very unpolished - the devs are keep releasing new content but don't care to repair the one that's already out. Istg the races feel like a mod with how much clipping is going on (a bad mod on top of that - most modders actually update their content so it doesnt happen...). Why are nagas' tails clipping through mounts and dresses? Why do demons' horns dissapear when you wear any head accesorry? Not mentioning that even some hairstyles are simply clipping through the body.... Frame rate drops rappidly at times and won't go back to normal unless you restart the whole game. Some spells don't work correctly - especially when there is many enemies around - which is the whole thing of a few boss fights. \n\nAND! You have to deal with all of that just to witness some really lazy writing. There is so many places that feel empty and useless, there is just nothing to do there (especially looking at the new underwater region, once you do the main story quest, you can chase the romancable npcs there but thats about it?), boss fights don't have second phases, a few have more than one attack pattern and all of them are overall pretty boring. The dialogues choices are written with 0 effort - it's always \"challange what the character said (-heart), compliment the character (+heart)\"... at this point i believe everyone there is a narcissist who takes offence at even a slight hint of having a differnet opinion. The heart events... if you can even call them that... are exteremely short and boring. On our second date i got to compliment Jun 3 times sitting on his couch. woaw. \n\nOverall Sun Haven feels artifically inflated at the cost of substance. There is so many places you can visit, so many farms and houses you can have, so many people you can meet - but none of it is really captivating. It has it's moments, but they are mostly drown in the sea of mediocrity.\n\nI really wanted to love it - Stardew with a fantasy twist sounded like dreams come true. But unfortunately, I have to keep waiting for my perfect game. \n\nPS. Also as it turns out the devs suck, so even if my words didn't convince you, still consider not supporting them lol",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Not supporting Devs that can't fix a product or interact with their users.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Suffers from lack of direction, poorly designed skill trees, and EXTREME item bloat. To give an example, there are something like 5 or 6 different crafting stations just for food plus each crafting station has both an \"Elven\" and \"Monster\" counterpart with its own craftable items. Not only that, but farming isn't well designed nor do I believe is it the focus of the game. It appears more like a cover for the fact that one of the head designers REALLY wanted to make an adventure game, but was forced to work on a team that was making a farm sim.\n\nIt honestly feels like a bloated mobile game that intended to sell \"themed cosmetics\"... which it kinda is if you look at the DLC section.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's a fun game but the devs seem scummy and greedy there are always new issues especially in co-op. My partner and I couldnt play for over a week because the multiplayer was broken and we also lost all of our animals and pets as did many others.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Its a good basegame. But the devs seems shady and way too many DLCs.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I played this game a long time ago and didn’t know about the controversy surrounding the studio. This negative review is only about the studio’s management, not the artists and writers who were underpaid or silently banned by the leadership",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Decent game but Pixel Sprout Studios and Bruce have a lot of allegations against them. Just reading Meg \"Yako\" Ziegler post about ex-developers at Pixel Sprout Studios gives me the impression that this studio is not great.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love this game, but sadly I cannot recommend buying this game because this company does not pay or credit their artists. :(",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Had high hopes for this game early on, but game seems to have broke more and more over time with shoddy updates and it's just become a shallow dlc cash grab, on top of the company being complete garbage refusing to credit the devs/artists or pay them properly. On top of releasing actually unplayable ports and refusing to fix them. Because why work on the foundations of your game when you can rake in more cash with skins! And trying to pressure you and push you to the dlc page in game, how immersive and fun!  I recommend staying away from anything Pixel Sprout Studios",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Ultimately, I can't recommend this game because of the scummy business practices and exploitation behind it.\n\nAs for the game itself, it's all right but ultimately feels... shallow. There's so many different locations/farms to manage and so many npcs that you don't really develop any deep relationship with any of them compared to similar games like Story of Seasons, Stardew Valley, Rune Factory, etc.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just couldn't get into it at all, and heard that the creator wasn't paying his artists after I broke the refund rules... (2 hours played at most). I wouldn't recommend, it's boring.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "game is fun. But studio embraces harmful corporate practices. check other reviews on that.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really wanted to like this game and during the first couple of hours it really felt like the perfect game. But sadly it turned out to be a buggy mess. All of the sudden some of my tools would stop working completely and not even restarting the game or buying new tools could fix this problem. I read that these bugs arent a new issue and that people have reported this problem before but it looks like pixel sprout studios doesnt really care to fix these bugs.  I hope i get a refund even if i played more than two hours.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "would have been good if thedevs actually paid their workers\n\n Main allegations against Pixel Sprout Studios:\n\n1. CENSORSHIP & DAMAGE CONTROL\n- After MRIZ's exposé video in January, Pixel Sprout went into full censorship mode\n- Mass-deleted criticism on Reddit and Discord\n- Instructed moderators to remove any mentions of the controversy\n- Changed Discord rules to suppress \"rumors\" and criticism\n- Current Discord moderators report feeling unvalued and describe the studio as \"very secretive\"\n\n2. MISSING CREDITS & UNPAID WORK\n- Sun Haven has NO credits anywhere in the game (even past version 2.0)\n- Former community manager promised credits \"in a future update\" for 2 years - never happened\n- Team credits were mysteriously removed from the original Kickstarter page\n- Used \"community volunteers\" to translate 30,000 lines of dialogue for free (this violates U.S. labor law - for-profit companies cannot use volunteer work)\n\n3. RESTRICTIVE NDAs & SECRECY\n- Artists forced to sign NDAs that prevented them from publicly acknowledging their work\n- Many couldn't even mention working on Sun Haven on LinkedIn or social media\n- One artist was labeled \"untrustworthy\" for wanting to mention Sun Haven on TikTok\n- Artists told they were in \"trial periods\" that never ended\n- Artists felt isolated and anxious about saying the wrong thing\n\n4. UNDERPAID ARTISTS (5 Former Artists Interviewed)\n- Pay rates: $10-22.50/hour (well below industry standard)\n- Helly: $17-18/hour, told raises would come but minimal progression\n- John: Started at $10/hour, worked ~30hrs/week max\n- Kyle: $15-18/hour + minimal profit sharing (~$1000 total)\n- Lucas: $20-22.50/hour (Bruce thought $20 was \"too high\")\n- Naomi: $10-18/hour, believes they targeted artists from lower-wage countries\n\n5. EXPLOITATION & POOR WORKING CONDITIONS\n- Artists worked as \"independent contractors\" (no benefits, sick pay, etc.)\n- Constant \"burndown\" urgent tickets and impossible deadlines\n- Lucas worked 14-hour days during UI revamp, severe burnout\n- Kyle: \"felt like a cog in the art machine,\" took 6+ months to love art again after leaving\n- Micromanagement and excessive revisions\n- Artists isolated from main team, moved to separate Discord\n- Culture of praising overwork and crunch\n- Artists describe feeling like \"asset production machines\" rather than valued team members\n\n6. FINANCIAL SUCCESS VS. WORKER TREATMENT\n- Sun Haven is estimated to have sold ~1 million copies, grossing $12.8-22.5 million\n- ⮤ That's only Steam base game sales - excluding Nintendo Switch and DLCs\n- 57 paid cosmetic DLCs have been released so far (worth $427.44 in total) - none of which provide royalties to the artists\n- Company clearly has money but chose not to pay workers fairly\n- One week of Steam sales = more than artists earn in a full year\n- Studio constantly hiring while underpaying existing workers\n\n7. TOXIC MANAGEMENT\n- Bruce/Taylor reportedly yelled at female employees in meetings\n- Made concerning comments about race (\"BLM is a fad,\" resisted diverse character options)\n- Forbade use of the word \"morale\" when workers complained about burnout\n- Surrounded himself with \"yes-men\" and avoided accountability\n- Lucas: \"made me hate pixel art and game development, two things I'm passionate about since I was a child\"\n- Naomi: had to consult a lawyer about quitting due to fear of retaliation\n\nARTISTS FINAL WORDS:\n- Helly: Emphasizes need for open communication and good leadership to create healthy work environments\n- John: Believes studio started with good intentions but became a money-churning operation benefiting only leadership\n- Kyle: Refers to previous statements made to MRIZ\n- Lucas: Challenges Bruce directly and urges players to demand answers\n- Naomi: Warns others not to work for Pixel Sprout and prioritizes health over any job",
      "voted_up": false,
      "votes_helpful": 263
    },
    {
      "review": "Cons:\nVery grindy for no reason. Quests don't make sense, or follow seasons. Characters aren't interesting. Random monsters keep obstructing the farm to be annoying, but you don't have to farm so it does't matter. You can shoot through walls. \n\nPros:\nYou can crit strike trees.\n\nIf you are looking to scratch that stardew itch, this isn't it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "My friend and I couldn’t connect to the same game, which caused a bug. The mechanics also don’t resemble Stardew Valley. Lower your expectations. I’m requesting a refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "where stardew valley was made with love and care, as a loveletter to fans of harvest moon. sunhaven was made to bilk the success of it. \r\n\r\ngame breaking bugs dont get patched or fixed, you will see 10 releases of monetized skin packs before you see them actualy put any code work and fixes in the game, because again this isnt something made to be enjoyed, its here to be milked for cash.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "bro is trying to be him soooooo bad (stardew valley)\n\nbut fr I really dislike the class thing. it just makes the start unnecessarily confusing and I absolutely hate the wannabe animeass parts of it. there are more characters than stardew valley which is on paper great, but some characters are actually part of the game and some are just place holders. and there is no way to distinguish them except to memorize them by trial and error. just a cheap way to make it seem like it has more characters than it actually has. \n\nand also the fact that some character designs are unnecessarily sexualised? how dumb do you think your players are? what does it really add to the game?\n\nthe game tries to be so many things at the same time which makes it an incoherent mess. you can't just try to put every single mechanic you can think of and expect it to make the game better. \n\nit's such a soulless cash grab that it's offensive. I bought it at a sale and I wish I could refund it. don't get baited by tik tok. I know you are here trying to find a similar experience to when you played stardew valley, but this is not it. \n\nand also I just found about the controversy regarding the devs. fuck everything about this game\n\n\n\n\n\nin short dogshid game dogshid company \ndo not buy do not play",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game is very overwhelming and confusing at times. The dialogue can be shallow and very cheesy. It's almost impossible to play this game without choosing the longer day options, but at that point I don't want to spend 40 real time minutes for a single day to pass in this game.\n\nThe combat is kinda clunky as well, and the first slime boss I fought felt uninspired. Just a big enemy with a big health bar. Magic is stiff and feels awkward to use imo.\n\nSome of the art is very stiff, too. Apparently they were reworking character portraits, but that was a WHILE ago I heard that. They've since released new characters with the old art style since, and you can tell which characters were added after release. For example, the character portrait for Liam is so embarrassing, with how stiff it looks and how he just awkwardly hides his hands so the artist can avoid drawing hands. Most of the character portraits have their hands in an awkward pose or outright hidden. This is true for the majority of the male character portraits. \n\nAlso, my personal opinion, some of the winter/fall outfits are HORRENDOUS, like who decided to dress Lucius like that for winter? A lot of the clothing have these weird shines to them, and you can tell a lot of the outfits were an afterthought. Hats and hoodies will outright cover hair as if the hair was the contour of their head, and you end up with bulbous head proportions. Good examples of this are with Iris, KItty, Zaria, Vivi, Kai, and Shang.\n\nI appreciate the effort to try to incorporate such an ambitious project of seasonal clothing, but you end up with really nice looking characters like Miyeon having the oddest winter outfit. Sometimes less is more. \nAlso, the game doesn't really give non-romanceable chatacters portraits, they're just sprites, which breaks some immersion because you'll probably forget them.\n\nThe landscapes and buildings, however, are very pretty and look amazing. Character customization is great too, and you have a lot of choices with cosmetics and decor that looks really good. It's a very beautiful atmospheric game at times, which makes the character portrait and ugly UI issue stand out so much more. The UI reminds me of a mobile game.\n\nArt aside, having to manage 3 farms all growing their own crops and having their own crafting tables, multiple mines to explore and finish, many fetch quests, and the main story line makes the game a little too overwhelming. No single mechanic feels in depth, and everything is a bit of a surface level system. ADHD nightmare game aha. \n\nI really really really wanted to like this game!! But it's just too much; They tried doing everything, and it just ended up feeling cramped.\n\nAnd edit to add: It felt annoying to explore! You wasted so much time exploring such a big map, and then felt like you spent a day doing nothing. Most of this traveling is replaced later with flying, maybe if I played longer I would've seen teleportation, but It isn't very respecting of your time and even blocks off shortcuts in a very big map where time is valuable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Theres no way to redo a day, even if you close the game and don't save it saves for you. Its a pretty chill game, like a lighter version of Coral Island or StardewValley but there are time a date specific events (Meet so-and-so and X time or start the event on this day) but if you mess up and leave the game unpaused or accidently skip an event you cant just reload, you have to restart you save file if you dont want to stand up a date or miss an entire festival/event.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have had a problem for a while with the game. When I sleep, I face the problem.The problem is that the screen goes black and does not change.Which makes me unable to play",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really like they majority of the game like how some areas are locked behind certain goals and such, But at sometimes it feels like they tried to hard to make it way too large like the part where you unlock both new farm plots/city at the same time. Most of the base game without time modifier is made for multiplayer, it seems almost impossible to do most of the quest, manage daily task, etc as one player. The greatest pain point imo is the museum, it feels unnecessarily tedious, like there should at least be some way to better keep track of it and make the task simpler. \n\nIn general the game would have been recommended by me, but there's also the issue that everyone else is talking about with the artist situation.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely trash. Playing game, click on a vendor jumps out to steam asking for microtransaction. Hard no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This may seem like a small gripe, but it actually kills me how many stunning patterns the artists have packed into this game, that I can't use to the fullest.\n\nI want to put decorative stone tiling around rustic wood planks without grass growing between them. A huge part of farming/life sim games, for me, is making my area look personalized to my liking, which I don't feel like I can really do here. There are SO many options for ground tiles, it's incredible. Some of them are costly to make. All of them have this issue. None can seamlessly lay side-by-side.\n\nIf I had looked harder, I would have seen it in the preview images for this game. My issue with Sun Haven is clearly visible in the very first still-image of a farm displayed on the store page.\n\nAfter all the stress and mistreatment the artists went through, to make a game feel so enchanting and alive, and I can't even enjoy all their hard work. What a disappointment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "KEEPS EXITING OUT BEFORE SAVING",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "pay your artists",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "pay your artists",
      "voted_up": false,
      "votes_helpful": 7
    }
  ]
}