{
  "positive": [
    {
      "review": "How do you stop crying when the game is over?\n\nScrew all those long reviews, just know that this collection completely remasters every part, adds incredible blackish style, and gets rid of all those damn achievements for pointless crap, so you can simply enjoy the story.\nAnd what a story it is...",
      "voted_up": true,
      "votes_helpful": 87
    },
    {
      "review": "Not gonna lie, this game is an easy 10/10 for me. The story hits insanely hard. It actually sucks that Telltale isn’t around anymore, because stuff like this is almost impossible to find now. I don’t think any other game has ever made me cry like an actual kid and leave me sitting there feeling messed up for a while. Absolute masterpiece.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "telltale at its peak.\r\n\r\nSeason 1 start the series really good. \r\nLee - Clem \r\n\r\nSeason 2 ? a little bit downfall, but still good.\r\nClem story and character building are top notch.\r\nAJ is a very lucky boy!\r\n\r\nNew Frontier. what a twist. we see clem in another POV. \r\n\r\nand finallyyyy, Season Finale, complete all the things. \r\nimprovement graphics, story, twist, characters. \r\nClem=Lee. and the feeling to make [spoiler] AJ not becoming Clem [/spoiler] is very satisfying.\r\n\r\nMichone season is also very good. as expected with more action, cos why not, is Michonee.\r\n\r\nThis definitive series make me complete this backlog game. \r\nThanks Telltale!\r\n\r\nthat emptiness after completing the game.......",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "one of the best games i've EVER played, so emotional but so beautiful :(\ni love the choices and how they have different consequences and outcomes, makes the game feel more real.\n\nhonourable mentions for kenny, lee and louis <33 mwa\n\nILY TWDG u are pure cinema",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This genuinely was the first story based game I  ever played and was invested from the first episode. The characters and their back stories really pulled on the heart strings in some episodes, but it’s one of those games that you can play multiple times and still experience a different outcome. Recommend adding this to your library even if it’s something outside your normal genre..",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It was perfect. Perfect. Down to the last minute details. *insert homelander meme*\n\n\nI played first season earlier in my mobile phone and it was definately a rollercoaster of emotions, which can explain why I have less hours here in this version. This one has all the seasons combined and all the episodes too. So its value for money.\n\nNow I am playing it again and this time, the entire series. Trust me , you are in for a treat. Story, Soundtrack, Dialogues everything is just goated. Choose your choices wisely. They do matter and get carried forward to the next seasons.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "goodness me i've only finished season one and i feel so heavy and burdened with emotions i rarely even come across , clementine oh poor clementine you precious little girl , all of this just wasn't meant to happen to you , your little hands were meant to play with toys , but so early in your life have they been used to reap life away , oh poor clem your life looks so grim , if only i could be there for you to shield you from these evil dead and the wicked living , go and find peace for it is peace that man so wishes to be in\r\n\r\n\r\ni have never made such and emotional review before but it just so happens to show how much this game gives you an emotional and consciousness test , i will gladly and confidently say get this game , but if you are sensitive and emotionally unstable just don't , it's a masterpiece but for those who can handle it",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Only Game that has ever made me cry This is a wonderful well crafted game Its so Emotional the music is perfect the horror as a Zombie lover myself I perfer the Running Rage Virus zombies like in Dying light Left 4 dead 2 Etc. but this was a Damn good Zombie Series sometimes it felt peaceful like in the Hershels Farm or at the School in Season 4 If you want something emotional Sad Scary something too make you Angry This is a great game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "одна из лучших в жанре интерактивное кино. прекрасная и захватывающая история длинной в 4 сезона.\r\nдаже не смотря на то, что выборы по большей части не влияют на сюжет)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "TWDG, good game. DAMN fine game. Powerful story, one of the greats.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "beautiful games, one of the most touching and interesting stories and amazing art style",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I just finished season one and this game has me crying at 1 in the morning bro. This game is the definition of redemption. Lee went from being a murderer to a leader, a father figure, and a good man. You shape Clementines story and this is just the beginning. I cant wait to start season 2.\n\nEdit: Yeah i finished all 4 seasons now and wow, this game man was so beautiful I loved every second of it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’m honestly shocked I never played this game earlier.\nThe moment the first episode started, the art style hit me — it looks like a living comic book, and it’s beautiful. The characters feel real, the voice acting is amazing, and the story makes you forget that you’re even playing a game.\n\nI went in expecting a zombie game…but this is really a human story.\nThe choices actually matter. I found myself pausing, thinking about what to say, because every decision feels important. It’s less about shooting and more about surviving, trusting, protecting, and caring.\n\nBy the end of Episode 1, I was completely attached to the characters.\nIf you love story-driven games, emotional moments, and decisions that stick with you — this is a masterpiece. Absolutely worth every rupee and every minute.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Walking Dead: The Telltale Definitive Series Review — 11/10 (Emotional Damage Simulator)\n\nThe Walking Dead: The Telltale Definitive Series isn’t just a game—it’s an emotional rollercoaster designed specifically to destroy your heart, rebuild it, and then shatter it again for good measure. It’s a storytelling masterpiece that grabs you by the soul and refuses to let go, long after the credits roll.\n\nAcross all four seasons, you follow Clementine—one of the greatest characters in gaming history—through a world where every choice matters, every decision haunts you, and every friendship feels fragile and precious. The writing is phenomenal, the performances are unforgettable, and the relationships you build feel real. You don’t just play this game—you live it.\n\nThe Definitive Series brings updated graphics, improved lighting, developer commentary, and all the DLC in one package, making it the best way to experience the full journey. The visual upgrades make the art style even more striking, and the preserved documentary-style extras give fans a deeper look into the incredible work behind the scenes.\n\nAnd oh boy—the decisions. No other game makes you pause the screen for five agonizing minutes while you question your morality, your intelligence, and your entire existence. The pressure is real. The tears are real. The trauma is real.\n\nIf you think you’re emotionally strong, The Walking Dead will prove you wrong.\n\nPros\n\nStorytelling at its absolute peak\n\nDeep, unforgettable characters—especially Clementine and Lee\n\nMeaningful choices with serious emotional weight\n\nGorgeous updated visuals and a complete collection in one place\n\nA soundtrack that will ruin you (in the best way)\n\nCons\n\nYou’ll cry. A lot. Like, multiple times. Maybe daily.\n\nPermanent emotional damage (but worth it)\n\nFinal Verdict:\nA masterpiece of narrative gaming that delivers some of the most powerful storytelling ever created. If you finish without crying, check your pulse.\n\nScore: 11/10 — “Keep that hair short.”",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "made me question every decision i've ever made in my life, absolutely beautiful game, amazing writing, character building and character depth. the game is very good at keeping you on your toes with quick time actions forcing you to be 100% invested, if you're not, it possibly risks losing a character you like and changing the entire story completely. changed the way i think - 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah, duh, of course you should play this game.\nWas a masterpiece in 2012, still a masterpiece in 2025 and will stay a masterpiece until the IRL zombie apocalypse comes.\nDoesn't mater how cool and brutal you might think you are - you will cry like a little baby.\nInsane worth even when non-discounted.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I barely play choice dependent games, and I can still say this one of the best games of all time. While 400 days and Michonne are fine, the main four seasons are peak entertainment. I can not recommend it enough/",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played, from the Season 1 all into Michonne story. I get it why people say this game offer some kind of illusion of choices. but i still recommend this game. The storytelling is really what you will expect from Telltales. It's really intrigueing and always deal with your emotion. I really enjoyed every second of it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10. The kind of game that leaves you feeling empty after finishing it, in a good way",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played hundreds of games. hundreds of stories, memories, adventures...\n\nand yet, no matter what, I dont think i'll ever forget this one.\n\nthis is the one story ill never forget. the first to bring me to tears, and not just a couple, this series had be bawling my eyes out. \n\nGoodbye, Telltale. Thank you for the memories.\n\nill aim for the head.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I fucking love this game and I adore it too no end. I have deep nostalgia for this game cause as a kid I watched jacksepticeye and pewdipie play the games and It always freaked me out. But now that I have actually played the seasons I have a new appreciation for it and they have both taught me and angered me from time to time. I reccomend it to others whole heartedly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "From start to finish one of the most thrilling games I have ever played. Grabbed my heart from season 1 all the way to the final season. Will probably never forget this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Oh my [u] lordy lord [/u].\ni love this game with all my hearts content <3\nts game made me cry, some may say \"cry in joy\". others cry in idk sadness? it was sad at times but we love that\n[spoiler] GODBLESS KENNY MY KING [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best if not the best choice driven game I've ever played. \nClementines story is so both so heartwrenching but also so wholesome it really is such a masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute cinema.\n\nTelltale really reminds us that anything is possible. Over the course of 4 major games, they have managed to perfectly craft a world and story that is compelling and draws you in at every corner. These games are a staple and perfect example of how story games should be made. I will admit, Season 1 & 2 are very good but Season 3 is when the fall off starts. It's not a bad game but the story takes a shift and the characters get a lot more forgettable. Season 4 is the middle child, It's not as bad as Season 3 but nowhere near as good as Season 1 or 2 level. All in all however, every season deserves at least one play.\n\nBuy the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very Well made Game. Worth it if you get it on discount or love  TWD franchise. Storyline is different from the books and show, its engaging in a way that makes you feel you are in control. \r\nPros\r\n- Zombieeeees\r\n- Engaging roleplay \r\n- You can play it slow and take your time.\r\n\r\nCons\r\n- Feels very restrictive in terms of character movements\r\n- Feels a bit too slow sometimes\r\n- character POV and shooting mechanics could be better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "這是我此生最愛的game. Just give it a try guys. \nI recommend you to play this game. The Walking Dead is my favorite game of all the time. Since the moment I played, I just couldn't stop coming back and finishing it. Every choice you made, you just gotta accept the consequences. I will never forget this moment. Finally, a true farewell to TWDG. Love this game for all of my life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have never played a game that made me feel so many emotions. The characters are so well made and the story is amazing. I love this game so much, I recommend it to anybody.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I know I'm late to the party, but I just finished the first episode and wow, what an experience!\r\nOh man, where do I even begin?\r\n\r\nThis game actually cares about your choices. Every decision, every conversation… it all matters. (Something most modern “choice-based” games seem to have forgotten.) And the best part? The story doesn’t hesitate to k*ll off characters you thought were untouchable.\r\n\r\nThe writing is phenomenal, every character feels real, layered, and human.\r\nHonestly, it’s a must-buy. And at this price? An absolute steal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best 5€ spent, it's a game with a very good story, worth every penny, I recommend it with all my heart.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was never really into interactive story-driven games, but I decided to buy The Walking Dead for €5 - why not? It’s still a great bargain for five games and one DLC. I thought I wouldn’t get past the first episode, but I was so wrong. Day after day, I found myself finishing season after season, getting emotionally attached to characters I never thought I could cry over. This game is a masterpiece of writing not just in gaming, but maybe in the entire entertainment industry. If you think you can’t get attached to fictional characters, this game will likely prove you wrong. Thank you, Telltale and Skybound, for creating such a masterpiece. And thank you, Lee, Clem, and Kenny, for getting me into this journey. It’s been one hell of a ride.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The greatest story game made. Hands down. This blows everything else out of the water. Don't play the dlc's (400 days and michonne) till after you play every season. They are not important in any way and will just ruin the immersion. 10/10 would erase my memory just to experience this for the first time again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Playing after it released for so long isn't the main point here.\r\nIt's this game really did give the time and its price a more than enough payback, regardless quality of story, characters and also consequence carrying arc.\r\n\r\nDefinitely a worth playing game for TWD, choice making lovers etc.\r\nNo wonder its called AAA game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Do I recommend this game? Absolutely. It's Telltale's magnum opus: The Walking Dead games. Get it while it's on sale! \r\n\r\nIf I were to rank each game, I'd list them in this order from best to worst: Season 1 > Season 4 > Season 2 > Season 3 > Michonne\r\n\r\nI enjoy all of these games really, even though Michonne feels disconnected from the others and I kinda don't like the way Clementine behaves in Season 3.\r\n\r\nBut anyway yeah, this game is highly recommended. Has lots of replay value too, so you can see how different the story goes based on your choices.\r\n\r\n[h1] 🧟 [/h1]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful game, hard to describe but the experience is what makes this game great, it makes you feel everything connect with every character and bear the weight of your actions, this is something you have to experience good ass game, art, music, story, everything, it's just perfect, except for the achievements glitching our but other than the I love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Try not to CRY simulator :) \nI finished this series for the second time, and my review is still the same this game is the G.O.A.T.\ninfinite out of 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game series is the peak of its genre, I constantly find myself deeply ingrained into Clementines story and constantly on the edge of my seat holding my breath at the hard choices you have to make along the way. This is easily in my opinion one of my favorite game series of all time and cry every time a season finishes lol",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great story, kind of sad it ended. The ending is a little bit questionable, but I much prefer it from the game being abandoned mid-season as it almost ended up being.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Every chapter, episode, and season of Telltale's The Walking Dead in one package.\n\nSeason one is a bit rough around the edges, but without going back to the original game to check, it seems to be a step up from it.\n\nFor those who didn't get to experience some exceptional storytelling (or even those who did), look no further than this collection... I only wish this title had Steam Cloud saves.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The ending was amazing, The story is great, the choices feel like they have an actual impact on the story. \nSome might even say this game is phenomenamal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most impactful story games I’ve played. Even years after release, the writing and character moments still hold up. Following Clementine from the beginning and seeing how she grows feels meaningful and emotional. Lee and Clementine’s bond is especially unforgettable and remains the heart of the whole series.\r\n\r\nThe choices really make you think. Some decisions stayed with me even after I stopped playing. Not everyone can be saved, and that’s what makes the experience feel real.\r\n\r\nDespite the age of the games, the storytelling, voice acting, and atmosphere are still strong. If you enjoy narrative games or character driven stories, this collection is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really don't have any words that how good this game is. I mean the story, the way it directed and the narration everything was on point. It just not a game its a emotion, each season, each ep I played gives me chill. It really connects to your actual life and teaches you a lot. I don't know about others but you do not play this game as player, you play it like your entire life is depending upon it.\n\nA truley a materpiece.\n\nSkybound Games & Telltale - you people did a great job. Thank you for making this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if your into a story game that your decisions impact.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't just a game, it is a lifetime lived in a few dozen hours. I have never felt this emotionally connected to a piece of media before it truly wrecked me in the best way possible. The writing and character development forced me to weep and smile throughout the entire journey, balancing the horror of the world with the warmth of its characters. Watching the evolution of the story was heartbreakingly beautiful, but my biggest takeaway remains the same - I am so incredibly proud of my daughter, Clem ʕ•́ᴥ•̀ʔっ♡",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!!  Meaningful choices that can be difficult.  This game is emotionally taxing, but I couldn't wait to hop back on. Solid purchase!! I should have played this already and makes me sad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really good game i recommend but you have to free up some time to actually play each part cause theyre like an hour long at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Boring Overloading Drama\" succeeds not because it is good, but rather because people today are emo.\n\nLook, I get it. Shock and awe through horrible difficult acts. But you need to understand something: If the tidal of drama and tragedy keeps coming, real people with real emotional depth get numb. It's 101. That's the mistake Games of Throne did and that's what this game does. Sprinkle the ever cumbersome QTE, illusion that your choices matter, and characters I wish I could personally kill: Kenny, Ben, Duck... pretty much every ungrateful whiny childish ***hole other than the actual child - Clem. And yeah, I actually did kill them without a second thought for those I had a chance to do so.\n\nThe result is ... well.. boring.\nI slog through this because of my OCD, not because I am having fun.\n\nBy the end of this game I'll be a walking dead.\n\nHuh... I guess that's what they were going for. Good publicity!\nThumbs up for cleverness!\n\nP.S. The fact that this game has 4 seasons while the legendary-much-better Wold Among Us is benched just makes me sad for the culture of the world I'm living in...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] HONEST REVIEW [/h1]\r\nI always wanted to play this game when I was a kid, and I never guessed I would cry all the time throughout the playthrough. It's just so peak to see a Telltale series getting the hype that it deserved. 10/10 recommend the story, is just the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very overrated 4 games here 1 is amazing 2 is doo-doo 3 isn't about the main character of 1 & 2 but decent on its own and finally 4 is pretty great but not worth 20 hours of ass (2) or filler (3)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts was a masterpiece holy, my new favorite story game. i had one issue, THEY WERE KILLING OFF SO MUCH GOOD CHARACTERS. lee, kenny, mariana. still a really good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game, replayed it after many years and it was even better than i remember",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seasons with Clementine are the bests. <3 Story is great and you really get invested in the caracters.\r\n\r\n100 days is ok since it goes by fast, but Michonne is quite bad... I just did not care about the people in that Michonne season.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the greatest story game I've seen, the characters are great and the choices shape the story for the protagonist. The visual of the game makes it better and the atmosphere. 10/10  Rest In Peace Lee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive only got through the first game but if the others are anything like the first they will be greate genuinly one of the most heart gripping games I have ever played 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've completed S1 and S2, its been freaking amazing. One of the best story games I've ever played. The game makes you feel like everythings your fault and every choice you make is the wrong one. But I love that about the game, because it makes it easier to replay it later. I might update the review after I complete the other seasons, but so far its a 10/10 I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly such a fun game. \nI got it on sale during Halloween and have been playing since I got. \nI enjoyed the story a lot. (Ended up crying a lot of times lmao)\nIf this game comes on sale again I would recommend picking it up if u haven't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its an awesome sauce game;-):-)!!!1Iam glad that me and all of my fam and friends and everyone and everything loves playing this game its the best!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the greatest TellTale game with one of the best video game stories ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is one of the best games i have ever played, the story is so peak, this game is a masterpiece, i would recommend everyone to try it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played all of em and TWDDE. But playing TWDDE on pc is such an great experiance ty Telltale for this gem  also great graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im only at the begining of chapter 2 with 15 hours! I really love this game so far, the story feels so real, as if it was from the real TWD! Trust me this is worth buying although I got it on sale for 6 dollers, I HAD to buy it. There are in total 5 chapters included with special episodes so in every chapter is about 4-5 epidsodes (included special episodes). And every episode is about 1-2hours.\r\n\r\nSo trust me its  really long game, which is 100% worth the money even if you have watched the gameplay as a kid, (what I did). DONT THINK BUY IT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been waiting for like 5 years to finally play and finish this game. By no means is the story or game perfect, but I have been following the franchise for so long I can't help but love it. Personally I loved every season, even season 3 it was interesting to see Clem from another perspective. The other 3 seasons are just really good in their own ways, it's hard to describe it without spoiling anything really.\r\nI feel like the ending does a good job to wrap up the franchise. I know a lot of people want another season, but it left on a good note and I hope it stays that way. It truly was a journey to finish the game, and one that left a good memory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game. good memories but sometimes it does feel like my choices didnt matter since some events that give the illusion of choice is still a canon event that is supposed to happen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome Story, one of the best games i have ever played. Enjoyed every moment of this wonderful game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you're a newcomer to the series or a returning veteran, this, as the name implies, is THE definitive way to experience probably one of telltale's best stories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man. After beating this game I'm just left with a feeling of \"I wish there was more\". After playing all of the episodes including the Michonne and 400 days side stories I can happily say I enjoyed every single episode. The final episode of The Walking Dead had me in tears. I wish I could go back and play more and experience this story one more time without knowing a thing, but unfortunately it doesn't work that way. My only 2 major gripes with these games are  season 2's chapter 5 with character writing, and the illusion of choice. Your choices in the game hardly dictate anything when it comes to  what happens in the game. Other than that, this is one of the most beloved stories to my heart. I'm definitely sad that there wont be any more TWD Telltale but this is one of the very few games that mean everything to me. Buy it on sale because its pretty old, but definitely play it. I don't think you'll regret it. I didn't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an amazing and captivating story, I would recommend to others, especially when it's on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got this game on a huge discount and its just a great experience... Story is engaging, there is not much gameplay to this really but its like choosing the path of your own walking dead experience. Pretty cool concept and definitly recommend it especially if you can get it at a good price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't think I've ever cared as much for any other video game character as I have for Clementine and AJ. What a beautiful Journey, Season 4 is my favorite, the art direction/art style/story are done beautifully. This is the kind of emotional depth that a writer should strive for, truly amazing work by telltale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This series tells a very emotional and memorable story. It’s sad, fun and intense at the same time, and it really makes you care about the people trying to survive in this fucked-up world.\n\nOne thing that feels off is how some characters show up once and then disappear forever with no real explanation. Also, even though the game focuses on making choices, most of them don’t actually affect the story. Only in Season 4, especially the last two episodes, your decisions matter.\n\nIn Season 2, many characters end up being frustrating because they rely on Clementine for basically everything, which makes them feel weak or annoying at times. And in Season 3, I honestly wish Clementine had been the main protagonist again. The main cast just isn’t as interesting.\n\nMy personal ranking is: Season 1 (unbeatable because of the bond between Lee and Clementine), Season 4, Season 2, Michonne, and Season 3, which is decent but weaker than the rest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While this game is known to be peak, id say there are def some flaws, as some will die for literally on plot, like if it were real life, theyd be alive and well.  other than that its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven’t finished the game yet, but I already feel like leaving a review. This isn’t a game about zombies, it’s a game about people and about choices - really tough choices. Whatever you pick during the playthrough, it won’t feel like the \"right\" choice, only a hard one. Huge thanks to the developers for their work. Strongly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a really good game so much hard decisions and a lot of twists really like the first two seasons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visually stunning, the story still delivers damn good. So once you get invested into it after a few episodes, buckle up for an unforgettable journey ahead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The walking dead is such a nostalgic game for me. I love it from the bottom of my heart and always go back to playing it every once in awhile. \n\nI can't say much without spoiling but if you like heavy storytelling it would be my first game to recommend.\n\nThe definitive series contains all games in the series including the spin offs so 5 games (+1 episode), so definitely worth it's price point. \n\nIt's a shame we never got a season 5, there has always been a potential for it. \n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Definitive way to play this game series.\n\n The story and characters brought back so many memories and the comic style, while not a look I'd keep on for repeat playthroughs, is a welcome add on.\n\nThe accessible music player, character viewer are great ways to listen to the great soundtracks and view character models along with being able to see different animations and voice lines.\n\nI can't recommend this game enough and if you haven't it yet please do, the game goes on sale regularly so grab it when you can",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "лучшая игра\nтвои выборы приводят к последствиям которые будут либо веселые,или грустные,тут зависит от тебя. есть моменты,когда от твоих действий ничего не зависит,а плохой конец лишь вопрос времени. скорее всего ты делаешь выбор лишь для собственного морального удовлетворения и понимания того,что ты бал прав",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a fucking masterpiece. If u still have not play this game just shut up and give ur money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Played through the whole game and finished every story it offered. It's a great experience with various degrees of writing. Sometimes it's excellent, then other times it's a bit weak. But overall the experiences is great and it's a must play for those who love visual noval games. \r\n\r\nMy only strong critique is that whenever you lie to someone, it will ALWAYS be found out and negatively affect you. You can never ever get away with a lie. The second thing is that if you have to choose between two characters where one lives and one dies, the other character will always die. So your choices do not matter much in terms of saving anyone. Still, it's a great experience when looking at the game as a whole.\r\n\r\nThe ending is controversial however. I'll try to be vague as to not spoil the game for anyone. Some would argue it's a good ending to the series, others might feel like it is too forced. I thought it would be better if the game would have ended the expected way at the barn. That's all I will say on that matter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally the best story game ever, I only just finished the first one. 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a Huge longtime fan of The Walking Dead, I can tell you without the shadow of a doubt that this is absolutely worth the playthrough, Great story, great characters, great writing(aside from dialogue choices). I can't really complain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good package for the entire telltale's walking dead series. Worth it to play season 1 and 2 alone. Those are hallmarks of interactive storytelling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "grew up with it. still amazing \n- season 4 10/10\n- season 2 10/10\n- season 1 10/10\n- season 3 8/10\nPlay if you want to cry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, I played the whole definitive season (almost finished at the time of review) and I always left wanting more, the choices you make seem to have a big and lasting impact on your playthrough, some of the characters are relatively deep and unique. This type of game is like a glove that suits every size.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game i have played in a while if you looking for a GREAT story buy this it will not disappoint",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a solid 10 out of 10 from start to finish. Yes, sometimes the animations can be pretty bad and sometimes the characters can be annoying. Hell outside of the final season, basically every bit of gameplay where you can move your character around is boring and tedious. But, despite all that the emotional impact this game leaves on you cannot be overstated. I think everyone should play this game at least one time in their life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "these games are an emotional rollercoaster. i own them on every system i have including my phone. absolute masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "some of the best story telling ever in a video game, only complaint is i hate the controls, but atleast they got better from how bad it was in the first game. highly recommended otherwise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A AMAZING game I actually love it and heavily recommend for people who like story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best story game out there to be honest, and I've played quite a bit of story games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can guarantee that I cried during EVERY season of this game................holy peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best series ever released. Those games, they are... Something. I am happy that Telltale are back, but they will never do anything better than this. The only season that I personally dislike is Michone, but I get why others like it. But... Yeah. I usually do funny reviews, joking about it, but... This is truly the best series. One of the best stories ever managed. Better than the original I would say. \n\nThank you Telltale and Skybound for an unforgettable experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Walking Dead: The Telltale Series – Emotion in Every Choice 🧟♂️\n\nThe Walking Dead: The Telltale Series is a truly emotional masterpiece in the world of interactive gaming. Its strong narrative, memorable characters, and tense moral choices immerse the player in the merciless world of zombies in a way that is rarely seen. The game successfully combines a dramatic story with engaging interactive gameplay, creating an experience that lingers long in the mind. A true example of how video games can tell world-class stories.\n\nScore: 10/10 ⭐",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want your emotional guts getting ripped out (in a good way), the whole series is perfect.\r\n\r\nAbsolutely worth your time as the post-apocalyptic, gruesome setting constantly keeps the stakes high and, more importantly, it teaches you about moral/ethical choices (or makes you question them) and their consequences, grey-areas, nuances, and gets you heavily invested into the characters.\r\n\r\nEveryone should play this at some point - regardless whether you're a fan of the Walking Dead universe or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story driven classic! This game made me so invested in the characters that it can be a rollercoaster of emotions. One minute you're sharing a heartwarming moment with a friend. Then that same friend dies a horrific death in front of you. Seeing clementine grow up and become an ultimate badass thanks to all the people that helped and guided her was so gratifying. All that said there were some lame moments in the story that I SHOULD be able to influence in some way. They kind of force you to do or say things that are stupid as fuck. Also, I don't care much for season 3 and I'm not sure why they even made it. It was cool and everything but I'd much rather have an adventure with the people I know and care about from the seasons prior. All in all it was still an awesome experience with a lot of heavy hitting choices to make.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that makes a grown man regret he cannot cry, no matter how desperately he tries",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "no words can describe how much I love seasons 1 and 4, best beginning and ending to a game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "zajebista gra, tylko coś jest z grafiką bo jest w chuj ciemna w porównaniu do zwykłej wersji",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought this game for 9 dollars on a sale, I have over 40 hours of playtime and I still haven't fnished every chapter. You can replay the game and make different choices for even more playtime. I love the story, graphics, characters, just the enitre game is amazing and I heavily recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game had no reason to be SO SAD. i had so many times where i almost cried... but 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "it's 2025 and there's no option to change keybinds?!?!?! make it EASY for people with disabilities to play your game! there's like 6 inputs and the game has been out for ages.... like it's such a simple thing to do for your players. had to find some 3rd party software to remap my keys.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Story[/h1]\r\n\r\n★★☆☆☆ Okay!\r\n\r\nI’ve loved the first season. I don’t care that the choices proved to be an illusion in the end. You didn’t know that back in the day, and the gameplay thus was very tense in all episodes. Yet still, the game's main appeal was the heavy emotional investment you made for it’s characters. That was where the game was extremely successful, in making us all care extremely for the fates of Clementine, Kenny, Duck, Lee's etc.\r\n\r\nThis I could also acknowledge primarily for seasons 2 and 3, though the main story of these was weaker than season 1. Season 4 was on all aspects by far the worse, for it deviated from the characters you had come to love and care for. \r\n\r\nThere are two reasons to buy this game. The first reason, and especially if you are a newcomer, is that you can have the whole series in one neat package with upgraded graphics, in the same style as the final season. Reason number two are the easy achievements!\r\n\r\nNow, also included, are the Michone episodes: terrible and bland story/game, completely unjustified to be included with the other 4 seasons of Lee and Clementine, even if they are extra content for your money.[h3][hr][i]If you are a very big fan of Telltale Games and want to support their developers, you can buy this definitive series. But otherwise, if you’ve played Walking Dead in the past and your feelings for it were like \"its ok, nice, fine, whatever\" etc. then it is not worth buying it![/i][/hr][/h3]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seasons 3 and 4 are just awful. I think it's really clear by Season 3 that none of your choices really matter and it's just more fun to be a jerk.\r\n\r\nSeason 4 is the ultimate insult. Felt like \"Hook\" with Rufio at helm of the the lost boys. No clue what they were thinking with this season but I'm glad it's all over. The cowards at skybound might think otherwise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My negative review is not about the games themselves (which overall are great...except for New Frontier), but specifically this \"definitive\" edition. It's buggy as sh*t, even more so than the original releases. I would frequently run into scenarios where the controls would completely stop working after a cutscene, requiring me to quit to the main menu. That isn't such a big deal assuming you didn't go back an episode to change options, but if you did you have to restart the entire thing instead of reloading from the last checkpoint. There were also multiple instances of visual glitches such as the wrong colors being rendered and audio glitches where characters would be repeating lines or the same lines overlapping. Overall, this is yet another example of a publisher releasing a piss poor remaster that was given minimal effort.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having somebody you like hate you is worse than all the zombies in the world.\n\n\n\nEdit: I have changed this review to a thumbs down. At some point, the game just stops being fun, because it feels like emotional CBT. I stop caring about characters dying because the game gives me no reason to  believe they will survive the next hour. One of my friends said it best when I was discussing the game with them, saying what I liked and didn't like and debating whether I should start the third season:\n\"You sound like you're in an abusive relationship\"\n\nSorry, This game made Telltale what it is today, but very much not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played The Walking Dead Telltale Series expecting a powerful story and meaningful choices. What I got instead was something that felt more like a chore than a game. Even after all these years, the technical issues are still everywhere. The animation looks stiff, the graphics feel like an oil painting filter pasted on top of everything, and the facial expressions are so awkward that they end up looking funny in scenes that are supposed to be serious. The bugs never stopped either, from weird character movements to broken achievements, and they killed any sense of immersion the game tried to build.\n\nFans will say, \"It is old, you have to look past the flaws.\" And? A buggy game is still a buggy game. Age does not magically excuse poor execution, especially when the whole experience relies on storytelling and emotion. When the presentation constantly breaks the mood, the impact is gone.\n\nThe biggest disappointment for me was the “choices matter” idea. I went in expecting my decisions to shape the story, but it quickly became clear that nothing I picked actually changed anything important. The major events happen no matter what. You can slightly shift relationships or delay a character’s death, but the outcome is always the same. After a while, it felt like the game was just taking my opinions and giving me nothing in return. I could not even skip dialogue, so every slow scene dragged on.\n\nNow for the story, because that is the one thing people praise the game for. It is fine. Not amazing, not groundbreaking, just fine. It is one long sad journey where people die around you and there is nothing you can do to change it. Some characters are decent, but most of them felt forgettable to me, and the voice acting did not help. I never connected to anyone the way players said I would.\n\nI finished Season 1, but it was a struggle. The gameplay is basically clicking around and picking dialogue options, the pacing feels slow, and nothing I chose felt meaningful. The Walking Dead Telltale Series ends up being interactive cinema that tries to pretend it is a choice-driven game. My brief opinion is simple: I do not like it, and it was not worth playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My brief opinion about this game: I don't like it. The whole game is one long sad story where your “comrades” die and there's nothing you can do about it.\n\nObviously, the game has its advantages. Here's what I liked:\n•    Beautiful graphics\n•    Interesting storyline\n•    The ability to interact with the surrounding world\n•    Good musical accompaniment\n\nBut honestly, I expected that in a game with “choices matter,” my decisions would influence the plot and the ending. I was wrong. In the game, most of the important events happen regardless of the decisions made by the player. With their decisions, the player can either improve/ruin relationships with characters, or delay their deaths. I would say this game is simply interactive cinema.\n\nThe second major drawback of the game is the excessive amount of violence, which is very unpleasant to watch. Severed limbs, cannibalism, child abuse, scenes where people are eaten alive—these are just the tip of the iceberg. Murders, corpses in the streets, walking rotting dead, and constant quarrels are the norm in this game. If you're not a sadist, such scenes will leave you with unpleasant feelings.\n\nAnd the last serious drawback of this game, which I have already mentioned, is that the entire game is permeated with a sense of despair and hopelessness. The main characters' companions literally die in every episode, no matter what you do. Due to a lack of food, water, medicine, and shelter, people turn into animals, ready to kill and rob anyone, and there is constant fighting. Those who survive the struggle for resources often envy those who have already died, and the survivors often have suicidal thoughts. Of course, there are pleasant moments in the game: walks in nature, communication with friends, moments of fun — but there are far fewer of them than negative ones.\n\nMy rating for the game is 2/5.\nThis game is a safe purchase for anyone who appreciates visually stunning interactive cinema with a focus on violence and despair.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the amount of money they probably wasted making this by just slapping the new mid filter on the old TWD games instead of just finishing wolf among us 2 is crazy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "6 out of 11 bojankles\n\ntelltale would love nothing more than to tell you your choices matter, and then have the most obnoxious morons pander and whine straight to your face REGARDLESS of your choice. at least with season one it had the best writing and characters, which makes it the *good* one. but at that point just buy the original game instead of this load of crap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is overrated, it's completely linear so you just end up clicking all the options by trial and error on screen, and there is only ever 1 real solution. Character walks really slowly, and there is no way to skip dialog and cutscenes, and no way to check when the last save was or load saves. You can't even chill because each dialog has a 3 second timer and you get random scenes where you have to mash a button or click your mouse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First Season: Excellent story and amazing characters.\nSecond Season: Within 5 minutes, one of the characters randomly gets shot and dies.\nI quit. If you're gonna make me fall in love with your characters, Telltale, just to immediately kill them off like they were nothing in the sequel, you don't deserve my attention.\nThe pulled a \"Last of Us 2\" before \"Last of Us 2\" even came out.\nUnbelievable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its an ok game, but i downvote because it's mega over rated. The \"gaming\" aspects are a joke and 50% of the characters are so bad to create braindead drama.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot recommend this game at all; they didn't let you replay a choice in a chapter. If you get something wrong, you have to replay it all over. And the worst part? After you replay, the save didn't even register right. Is wrong. \nFor example, I have to replay the whole chapter to choose not to cut Serita's arms. But the game register, I cut her arm anyway, which is bullshit.\n\n0/10, buy a separate version instead!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very poorly made. Loses save game data. Don't waste your time or money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They killed all of the bad bitches off. I couldnt keep 1 bad bitch. Wallahi this is why telltale went bankrupt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Making a single mistake choice by accident will have you restart the whole season, not episode. SEASON.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game lacks Negan",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "man, f*ck this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Walking Sh!t!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overrated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Choices Matter\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You'd think with how old the first season is, they would've fixed all of the game-breaking bugs.\n\nWhatever you do, do not interact with the car that has the zombie in it by the train in S1 E3. It for whatever reason makes it impossible to reach the far right side of your screen. No matter what you try, it does not fix itself, which means you cannot reach the last switch to turn the train on and progress the game. \n\nOn top of that, they removed the option to reload the save from a specific part, and you can't restart the episode either. So your only option is to make a new save file and restart from the very first episode. And even better, you can't skip cutscenes or dialogue.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "First of all, I have to say this is a very enjoyable game so far and you really fall in love with Lee and Clem. But there are 2 major issues with the way the definitive edition works that make this grueling at times. Also keep in mind this is a Walking Dead game so the vast majority of characters will die within a few chapters except a select few. That may annoy some people.\n\n1: There is no rewind ability. If you look up something about the game you may read about the ability to \"rewind\" and redo a section, but they got rid of it in this edition. That means if you want to redo a single decision you regret, you have to replay the entire chapter. In s1 ep6, I chose ONE regular dialogue option that made two characters decide not to come with you. A single wrong timed dialogue option made me redo an hour and a half of game play where you cannot skip anything at all because I wanted those characters to show up in season 2.\n\n2: There are issues where the stats from an episode sometimes are not saved. This means for me, from season 1, two of the chapters have no stats and I cannot play season 2 now with my decisions unless I replay both chapters which can be hours long because again, no skip option.\n\nIt is a good story and if you can endure the bad it is worth it, especially on sale for cheap. But maybe get the episodes separately if you want to play it. I'm so annoyed with replaying chapters at this point it'll be a while til I finish this game. I'm letting it sit til I get the motivation to fix it again",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great landmark of a game that pioneered a genre. However the definitive edition deletes saves. You can play for hours only for your saves to disappear. Something to do with Onedrive or steam cloud. Definitive edition causes this to happen. You might have better luck but there's a chance your saves will not work or get corrupted.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really don't want to spend any more money right now but after having my saves corrupted several times, I feel like I have to get a refund and buy the games individually.\nEdit: Steam rejected my refund but I went ahead and bought the other games immediately. So now I'm completing this whether I like it or not.\nI played through all of the first season with only a few graphical errors to speak of...\nBut when I reached season 2, the saving issues became very apparent. I replayed S2E1 to change a decision (which took longer than it should have due to the missing rewind feature) and found out that no matter what I do, the choices from my first run will always be carried into the next episode on this save slot.\nAnd after saying \"screw it\" and playing episode 2 with my original choices, I reached episode 3 and found that I could no longer press \"Continue\"! The only option to play now is \"Restart Episode\" or to skip the chapter.\n\nI'd like to also note that this game is \"Deck Verified\" so if any of these issues could be due to playing on Linux (which I am), that should lower its rating for the Steam Deck.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Season 1 was great 10+ years ago when i first played it... but on replay now it doesn't hit like it did back then. It's still worth a playthrough if you haven't already, but not the entire series. Seasons 2+ are really bad, the story and dialogue make no sense most of the time and some of the characters are so annoying that you hope they get killed off. 'Michonne' is a short, decent side season, better than 2-4 but not by much. Like most of these \"choices matter\" games, your choices really don't affect much outside dialogue. the stories are the same no matter what you choose, aside from a few exceptions, you're not changing much.  The developers commentaries included in this bundle don't play in the game as they're meant to, and besides they are already available on Youtube if you want to listen to that. Also, this Bundle doesn't come with the \"400 Days\" DLC, which it should, and there is a bug where if you own this in your library, you can't purchase that DLC because it doesn't detect that you have \"The Walking Dead\" base game. Don't bother with this bundle, just get the first season if you haven't already played it and skip the rest.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very sad and story rich and i love it but the way they do the save files and the episode is so stupid and you end up replaying a episode which takes forever and there is no saving so you just have to pray that it save and it sometimes does not and other times it does, but all i want is for my progress to be saved so i dont have to waste a hour just for it not to work.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's 2025 and there's no option to change keybinds?!?!?! make it EASY for people with disabilities to play your game! there's like 6 inputs and the game has been out for ages.... like it's such a simple thing to do for your players. had to find some 3rd party software to remap my keys.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Story[/h1]\r\n\r\n★★☆☆☆ Okay!\r\n\r\nI’ve loved the first season. I don’t care that the choices proved to be an illusion in the end. You didn’t know that back in the day, and the gameplay thus was very tense in all episodes. Yet still, the game's main appeal was the heavy emotional investment you made for it’s characters. That was where the game was extremely successful, in making us all care extremely for the fates of Clementine, Kenny, Duck, Lee's etc.\r\n\r\nThis I could also acknowledge primarily for seasons 2 and 3, though the main story of these was weaker than season 1. Season 4 was on all aspects by far the worse, for it deviated from the characters you had come to love and care for. \r\n\r\nThere are two reasons to buy this game. The first reason, and especially if you are a newcomer, is that you can have the whole series in one neat package with upgraded graphics, in the same style as the final season. Reason number two are the easy achievements!\r\n\r\nNow, also included, are the Michone episodes: terrible and bland story/game, completely unjustified to be included with the other 4 seasons of Lee and Clementine, even if they are extra content for your money.[h3][hr][i]If you are a very big fan of Telltale Games and want to support their developers, you can buy this definitive series. But otherwise, if you’ve played Walking Dead in the past and your feelings for it were like \"its ok, nice, fine, whatever\" etc. then it is not worth buying it![/i][/hr][/h3]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seasons 3 and 4 are just awful. I think it's really clear by Season 3 that none of your choices really matter and it's just more fun to be a jerk.\r\n\r\nSeason 4 is the ultimate insult. Felt like \"Hook\" with Rufio at helm of the the lost boys. No clue what they were thinking with this season but I'm glad it's all over. The cowards at skybound might think otherwise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My negative review is not about the games themselves (which overall are great...except for New Frontier), but specifically this \"definitive\" edition. It's buggy as sh*t, even more so than the original releases. I would frequently run into scenarios where the controls would completely stop working after a cutscene, requiring me to quit to the main menu. That isn't such a big deal assuming you didn't go back an episode to change options, but if you did you have to restart the entire thing instead of reloading from the last checkpoint. There were also multiple instances of visual glitches such as the wrong colors being rendered and audio glitches where characters would be repeating lines or the same lines overlapping. Overall, this is yet another example of a publisher releasing a piss poor remaster that was given minimal effort.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having somebody you like hate you is worse than all the zombies in the world.\n\n\n\nEdit: I have changed this review to a thumbs down. At some point, the game just stops being fun, because it feels like emotional CBT. I stop caring about characters dying because the game gives me no reason to  believe they will survive the next hour. One of my friends said it best when I was discussing the game with them, saying what I liked and didn't like and debating whether I should start the third season:\n\"You sound like you're in an abusive relationship\"\n\nSorry, This game made Telltale what it is today, but very much not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played The Walking Dead Telltale Series expecting a powerful story and meaningful choices. What I got instead was something that felt more like a chore than a game. Even after all these years, the technical issues are still everywhere. The animation looks stiff, the graphics feel like an oil painting filter pasted on top of everything, and the facial expressions are so awkward that they end up looking funny in scenes that are supposed to be serious. The bugs never stopped either, from weird character movements to broken achievements, and they killed any sense of immersion the game tried to build.\n\nFans will say, \"It is old, you have to look past the flaws.\" And? A buggy game is still a buggy game. Age does not magically excuse poor execution, especially when the whole experience relies on storytelling and emotion. When the presentation constantly breaks the mood, the impact is gone.\n\nThe biggest disappointment for me was the “choices matter” idea. I went in expecting my decisions to shape the story, but it quickly became clear that nothing I picked actually changed anything important. The major events happen no matter what. You can slightly shift relationships or delay a character’s death, but the outcome is always the same. After a while, it felt like the game was just taking my opinions and giving me nothing in return. I could not even skip dialogue, so every slow scene dragged on.\n\nNow for the story, because that is the one thing people praise the game for. It is fine. Not amazing, not groundbreaking, just fine. It is one long sad journey where people die around you and there is nothing you can do to change it. Some characters are decent, but most of them felt forgettable to me, and the voice acting did not help. I never connected to anyone the way players said I would.\n\nI finished Season 1, but it was a struggle. The gameplay is basically clicking around and picking dialogue options, the pacing feels slow, and nothing I chose felt meaningful. The Walking Dead Telltale Series ends up being interactive cinema that tries to pretend it is a choice-driven game. My brief opinion is simple: I do not like it, and it was not worth playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My brief opinion about this game: I don't like it. The whole game is one long sad story where your “comrades” die and there's nothing you can do about it.\n\nObviously, the game has its advantages. Here's what I liked:\n•    Beautiful graphics\n•    Interesting storyline\n•    The ability to interact with the surrounding world\n•    Good musical accompaniment\n\nBut honestly, I expected that in a game with “choices matter,” my decisions would influence the plot and the ending. I was wrong. In the game, most of the important events happen regardless of the decisions made by the player. With their decisions, the player can either improve/ruin relationships with characters, or delay their deaths. I would say this game is simply interactive cinema.\n\nThe second major drawback of the game is the excessive amount of violence, which is very unpleasant to watch. Severed limbs, cannibalism, child abuse, scenes where people are eaten alive—these are just the tip of the iceberg. Murders, corpses in the streets, walking rotting dead, and constant quarrels are the norm in this game. If you're not a sadist, such scenes will leave you with unpleasant feelings.\n\nAnd the last serious drawback of this game, which I have already mentioned, is that the entire game is permeated with a sense of despair and hopelessness. The main characters' companions literally die in every episode, no matter what you do. Due to a lack of food, water, medicine, and shelter, people turn into animals, ready to kill and rob anyone, and there is constant fighting. Those who survive the struggle for resources often envy those who have already died, and the survivors often have suicidal thoughts. Of course, there are pleasant moments in the game: walks in nature, communication with friends, moments of fun — but there are far fewer of them than negative ones.\n\nMy rating for the game is 2/5.\nThis game is a safe purchase for anyone who appreciates visually stunning interactive cinema with a focus on violence and despair.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the amount of money they probably wasted making this by just slapping the new mid filter on the old TWD games instead of just finishing wolf among us 2 is crazy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "6 out of 11 bojankles\n\ntelltale would love nothing more than to tell you your choices matter, and then have the most obnoxious morons pander and whine straight to your face REGARDLESS of your choice. at least with season one it had the best writing and characters, which makes it the *good* one. but at that point just buy the original game instead of this load of crap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is overrated, it's completely linear so you just end up clicking all the options by trial and error on screen, and there is only ever 1 real solution. Character walks really slowly, and there is no way to skip dialog and cutscenes, and no way to check when the last save was or load saves. You can't even chill because each dialog has a 3 second timer and you get random scenes where you have to mash a button or click your mouse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First Season: Excellent story and amazing characters.\nSecond Season: Within 5 minutes, one of the characters randomly gets shot and dies.\nI quit. If you're gonna make me fall in love with your characters, Telltale, just to immediately kill them off like they were nothing in the sequel, you don't deserve my attention.\nThe pulled a \"Last of Us 2\" before \"Last of Us 2\" even came out.\nUnbelievable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its an ok game, but i downvote because it's mega over rated. The \"gaming\" aspects are a joke and 50% of the characters are so bad to create braindead drama.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot recommend this game at all; they didn't let you replay a choice in a chapter. If you get something wrong, you have to replay it all over. And the worst part? After you replay, the save didn't even register right. Is wrong. \nFor example, I have to replay the whole chapter to choose not to cut Serita's arms. But the game register, I cut her arm anyway, which is bullshit.\n\n0/10, buy a separate version instead!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very poorly made. Loses save game data. Don't waste your time or money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They killed all of the bad bitches off. I couldnt keep 1 bad bitch. Wallahi this is why telltale went bankrupt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Making a single mistake choice by accident will have you restart the whole season, not episode. SEASON.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game lacks Negan",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "man, f*ck this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Walking Sh!t!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overrated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Choices Matter\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You'd think with how old the first season is, they would've fixed all of the game-breaking bugs.\n\nWhatever you do, do not interact with the car that has the zombie in it by the train in S1 E3. It for whatever reason makes it impossible to reach the far right side of your screen. No matter what you try, it does not fix itself, which means you cannot reach the last switch to turn the train on and progress the game. \n\nOn top of that, they removed the option to reload the save from a specific part, and you can't restart the episode either. So your only option is to make a new save file and restart from the very first episode. And even better, you can't skip cutscenes or dialogue.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "First of all, I have to say this is a very enjoyable game so far and you really fall in love with Lee and Clem. But there are 2 major issues with the way the definitive edition works that make this grueling at times. Also keep in mind this is a Walking Dead game so the vast majority of characters will die within a few chapters except a select few. That may annoy some people.\n\n1: There is no rewind ability. If you look up something about the game you may read about the ability to \"rewind\" and redo a section, but they got rid of it in this edition. That means if you want to redo a single decision you regret, you have to replay the entire chapter. In s1 ep6, I chose ONE regular dialogue option that made two characters decide not to come with you. A single wrong timed dialogue option made me redo an hour and a half of game play where you cannot skip anything at all because I wanted those characters to show up in season 2.\n\n2: There are issues where the stats from an episode sometimes are not saved. This means for me, from season 1, two of the chapters have no stats and I cannot play season 2 now with my decisions unless I replay both chapters which can be hours long because again, no skip option.\n\nIt is a good story and if you can endure the bad it is worth it, especially on sale for cheap. But maybe get the episodes separately if you want to play it. I'm so annoyed with replaying chapters at this point it'll be a while til I finish this game. I'm letting it sit til I get the motivation to fix it again",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great landmark of a game that pioneered a genre. However the definitive edition deletes saves. You can play for hours only for your saves to disappear. Something to do with Onedrive or steam cloud. Definitive edition causes this to happen. You might have better luck but there's a chance your saves will not work or get corrupted.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really don't want to spend any more money right now but after having my saves corrupted several times, I feel like I have to get a refund and buy the games individually.\nEdit: Steam rejected my refund but I went ahead and bought the other games immediately. So now I'm completing this whether I like it or not.\nI played through all of the first season with only a few graphical errors to speak of...\nBut when I reached season 2, the saving issues became very apparent. I replayed S2E1 to change a decision (which took longer than it should have due to the missing rewind feature) and found out that no matter what I do, the choices from my first run will always be carried into the next episode on this save slot.\nAnd after saying \"screw it\" and playing episode 2 with my original choices, I reached episode 3 and found that I could no longer press \"Continue\"! The only option to play now is \"Restart Episode\" or to skip the chapter.\n\nI'd like to also note that this game is \"Deck Verified\" so if any of these issues could be due to playing on Linux (which I am), that should lower its rating for the Steam Deck.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Season 1 was great 10+ years ago when i first played it... but on replay now it doesn't hit like it did back then. It's still worth a playthrough if you haven't already, but not the entire series. Seasons 2+ are really bad, the story and dialogue make no sense most of the time and some of the characters are so annoying that you hope they get killed off. 'Michonne' is a short, decent side season, better than 2-4 but not by much. Like most of these \"choices matter\" games, your choices really don't affect much outside dialogue. the stories are the same no matter what you choose, aside from a few exceptions, you're not changing much.  The developers commentaries included in this bundle don't play in the game as they're meant to, and besides they are already available on Youtube if you want to listen to that. Also, this Bundle doesn't come with the \"400 Days\" DLC, which it should, and there is a bug where if you own this in your library, you can't purchase that DLC because it doesn't detect that you have \"The Walking Dead\" base game. Don't bother with this bundle, just get the first season if you haven't already played it and skip the rest.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very sad and story rich and i love it but the way they do the save files and the episode is so stupid and you end up replaying a episode which takes forever and there is no saving so you just have to pray that it save and it sometimes does not and other times it does, but all i want is for my progress to be saved so i dont have to waste a hour just for it not to work.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's 2025 and there's no option to change keybinds?!?!?! make it EASY for people with disabilities to play your game! there's like 6 inputs and the game has been out for ages.... like it's such a simple thing to do for your players. had to find some 3rd party software to remap my keys.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Story[/h1]\r\n\r\n★★☆☆☆ Okay!\r\n\r\nI’ve loved the first season. I don’t care that the choices proved to be an illusion in the end. You didn’t know that back in the day, and the gameplay thus was very tense in all episodes. Yet still, the game's main appeal was the heavy emotional investment you made for it’s characters. That was where the game was extremely successful, in making us all care extremely for the fates of Clementine, Kenny, Duck, Lee's etc.\r\n\r\nThis I could also acknowledge primarily for seasons 2 and 3, though the main story of these was weaker than season 1. Season 4 was on all aspects by far the worse, for it deviated from the characters you had come to love and care for. \r\n\r\nThere are two reasons to buy this game. The first reason, and especially if you are a newcomer, is that you can have the whole series in one neat package with upgraded graphics, in the same style as the final season. Reason number two are the easy achievements!\r\n\r\nNow, also included, are the Michone episodes: terrible and bland story/game, completely unjustified to be included with the other 4 seasons of Lee and Clementine, even if they are extra content for your money.[h3][hr][i]If you are a very big fan of Telltale Games and want to support their developers, you can buy this definitive series. But otherwise, if you’ve played Walking Dead in the past and your feelings for it were like \"its ok, nice, fine, whatever\" etc. then it is not worth buying it![/i][/hr][/h3]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seasons 3 and 4 are just awful. I think it's really clear by Season 3 that none of your choices really matter and it's just more fun to be a jerk.\r\n\r\nSeason 4 is the ultimate insult. Felt like \"Hook\" with Rufio at helm of the the lost boys. No clue what they were thinking with this season but I'm glad it's all over. The cowards at skybound might think otherwise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My negative review is not about the games themselves (which overall are great...except for New Frontier), but specifically this \"definitive\" edition. It's buggy as sh*t, even more so than the original releases. I would frequently run into scenarios where the controls would completely stop working after a cutscene, requiring me to quit to the main menu. That isn't such a big deal assuming you didn't go back an episode to change options, but if you did you have to restart the entire thing instead of reloading from the last checkpoint. There were also multiple instances of visual glitches such as the wrong colors being rendered and audio glitches where characters would be repeating lines or the same lines overlapping. Overall, this is yet another example of a publisher releasing a piss poor remaster that was given minimal effort.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having somebody you like hate you is worse than all the zombies in the world.\n\n\n\nEdit: I have changed this review to a thumbs down. At some point, the game just stops being fun, because it feels like emotional CBT. I stop caring about characters dying because the game gives me no reason to  believe they will survive the next hour. One of my friends said it best when I was discussing the game with them, saying what I liked and didn't like and debating whether I should start the third season:\n\"You sound like you're in an abusive relationship\"\n\nSorry, This game made Telltale what it is today, but very much not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played The Walking Dead Telltale Series expecting a powerful story and meaningful choices. What I got instead was something that felt more like a chore than a game. Even after all these years, the technical issues are still everywhere. The animation looks stiff, the graphics feel like an oil painting filter pasted on top of everything, and the facial expressions are so awkward that they end up looking funny in scenes that are supposed to be serious. The bugs never stopped either, from weird character movements to broken achievements, and they killed any sense of immersion the game tried to build.\n\nFans will say, \"It is old, you have to look past the flaws.\" And? A buggy game is still a buggy game. Age does not magically excuse poor execution, especially when the whole experience relies on storytelling and emotion. When the presentation constantly breaks the mood, the impact is gone.\n\nThe biggest disappointment for me was the “choices matter” idea. I went in expecting my decisions to shape the story, but it quickly became clear that nothing I picked actually changed anything important. The major events happen no matter what. You can slightly shift relationships or delay a character’s death, but the outcome is always the same. After a while, it felt like the game was just taking my opinions and giving me nothing in return. I could not even skip dialogue, so every slow scene dragged on.\n\nNow for the story, because that is the one thing people praise the game for. It is fine. Not amazing, not groundbreaking, just fine. It is one long sad journey where people die around you and there is nothing you can do to change it. Some characters are decent, but most of them felt forgettable to me, and the voice acting did not help. I never connected to anyone the way players said I would.\n\nI finished Season 1, but it was a struggle. The gameplay is basically clicking around and picking dialogue options, the pacing feels slow, and nothing I chose felt meaningful. The Walking Dead Telltale Series ends up being interactive cinema that tries to pretend it is a choice-driven game. My brief opinion is simple: I do not like it, and it was not worth playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My brief opinion about this game: I don't like it. The whole game is one long sad story where your “comrades” die and there's nothing you can do about it.\n\nObviously, the game has its advantages. Here's what I liked:\n•    Beautiful graphics\n•    Interesting storyline\n•    The ability to interact with the surrounding world\n•    Good musical accompaniment\n\nBut honestly, I expected that in a game with “choices matter,” my decisions would influence the plot and the ending. I was wrong. In the game, most of the important events happen regardless of the decisions made by the player. With their decisions, the player can either improve/ruin relationships with characters, or delay their deaths. I would say this game is simply interactive cinema.\n\nThe second major drawback of the game is the excessive amount of violence, which is very unpleasant to watch. Severed limbs, cannibalism, child abuse, scenes where people are eaten alive—these are just the tip of the iceberg. Murders, corpses in the streets, walking rotting dead, and constant quarrels are the norm in this game. If you're not a sadist, such scenes will leave you with unpleasant feelings.\n\nAnd the last serious drawback of this game, which I have already mentioned, is that the entire game is permeated with a sense of despair and hopelessness. The main characters' companions literally die in every episode, no matter what you do. Due to a lack of food, water, medicine, and shelter, people turn into animals, ready to kill and rob anyone, and there is constant fighting. Those who survive the struggle for resources often envy those who have already died, and the survivors often have suicidal thoughts. Of course, there are pleasant moments in the game: walks in nature, communication with friends, moments of fun — but there are far fewer of them than negative ones.\n\nMy rating for the game is 2/5.\nThis game is a safe purchase for anyone who appreciates visually stunning interactive cinema with a focus on violence and despair.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the amount of money they probably wasted making this by just slapping the new mid filter on the old TWD games instead of just finishing wolf among us 2 is crazy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "6 out of 11 bojankles\n\ntelltale would love nothing more than to tell you your choices matter, and then have the most obnoxious morons pander and whine straight to your face REGARDLESS of your choice. at least with season one it had the best writing and characters, which makes it the *good* one. but at that point just buy the original game instead of this load of crap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is overrated, it's completely linear so you just end up clicking all the options by trial and error on screen, and there is only ever 1 real solution. Character walks really slowly, and there is no way to skip dialog and cutscenes, and no way to check when the last save was or load saves. You can't even chill because each dialog has a 3 second timer and you get random scenes where you have to mash a button or click your mouse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First Season: Excellent story and amazing characters.\nSecond Season: Within 5 minutes, one of the characters randomly gets shot and dies.\nI quit. If you're gonna make me fall in love with your characters, Telltale, just to immediately kill them off like they were nothing in the sequel, you don't deserve my attention.\nThe pulled a \"Last of Us 2\" before \"Last of Us 2\" even came out.\nUnbelievable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its an ok game, but i downvote because it's mega over rated. The \"gaming\" aspects are a joke and 50% of the characters are so bad to create braindead drama.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}