{
  "positive": [
    {
      "review": "one of the most incredibly atmospheric, beautifully crafted, and full of emotional storytelling. A must-play game for sure",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Should've stayed true to the third book and used this as a 4th entry still an amazing game though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The environment is surreal, a thing of beauty. The game feels so immersive even for me who got the focus of a potato. I love how the game wants you to be stealthy and not an outright gunner, it makes it interesting and makes sense given the state of the world in the game. This is the first game of the series that i played, will be playing the other two soon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Как-будто культовый статус всей серии сильно преувеличен. Понравилось больше предыдущих частей за счет \"открытого\" мира, но некоторые главы были до того душными, что проходились через силу. В остальном неплохо, есть классные моменты, но проходить dlc или саму игру еще раз - нет никакого желания",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "(SPOILERS!!!)\r\n\r\nHow does anyone rate these things anymore?\r\n\r\nIt's really hard to think of how this could have been any better. Horror. Adventure. Story. Lore. Incredible graphics. Very strong RPG gameplay mechanics. Stealth. Shoot-outs. Monsters. Puzzles. Semi-open world exploration. And, in the end, even a dash of classic Metro.\r\n\r\nA very poignant ending. As Artyom, on my first play-through, I didn't make it. But my sweet Anna did. Miller paid the price fate demanded for his arrogance. Still, a hero's end. A father's end.\r\n\r\nMarvelous game. Bravo.\r\n\r\nPlay it, you fool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "21 hrs to play through. it was fantastic and id 100% recommend to anyone looking for a good singleplayer shooter/openworld adventure full of side quests , cool items and an a mzing storyline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So I don't free one slave because I missed it so Damir stays, I kill the people (and spare the ones that surrender) that are actively shooting at me in the church (Which somehow causes Duke to die later in the game), and get the bad ending. Great. But other than that I do think the gameplay, gun customization is good, and so are a bunch of other things, but there are also a few things I am a little annoyed about in this game. Also even though Duke was shot once he could still have jumped on the train, and if it hurt to much to move Artyom could have just threw him over. In both endings Stepan gives Artyom but depending on whether or not you killed people or whatever you end up dead. In my opinion when games base the ending off whether or not you killed somebody even if they are trying to kill you or your teams not completely best friends kind of like new tales from the borderlands it isn't great. I just don't get why not being able to save everyone gets the main or one of the main characters killed. Also Artyom doesn't say a single word throughout the whole story but that doesn't really bother me just letting people know just in case it might bother someone else. Despite all that I will most likely be playing new game+ and buying/playing the 2 dlcs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really liked the new direction of the game series and the story was very enjoyable. Gameplay is solid. A little disappointed that some pretty obvious bugs have not been patched after all this time and I experienced quite a few crashes. DLC was pretty good as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good and intresting game too bad i got the bad ending wich suck so dam much other then that B+",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Самая красивая игра, даже по меркам 2025-го (enhanced edition с RTX)!\r\n\r\nСовет:\r\nЕсли играете с RTX, настоятельно рекомендую запускать с параметром \"-deependark\", RTX очень сильно засвечивает помещения, которые в оригинале были тёмными и мрачными, без этого параметра, атмосфера теряется.\r\n\r\nЯ прошёл эту игру уже не раз, вариативности никакой (к сожалению), но визуально, я лучше игры не знаю, плюс, Intel Arc B580 (видюха) выдаёт стабильные 140 fps на ультрах и 60 fps с коэффициентом шейдинга 2.0 (это более тяжёлый режим расчёта освещения, и игра начала выполнять гораздо больше операций при рендеринге), что поразительно, оптимизация к этому году феноменальная!\r\n\r\nПо игре:\r\nВсё на высоте, от геймплея и картинки, до звука и сюжета, но без ложки дёгтя в этой бочки не обошлось...\r\n1. Бесконечный респ. Врагов - если вы идёте не по сюжету и обходите все точки интереса до того прохождения сюжетки, готовьтесь в одних и тех же местах встречать врагов из раза в раз. В этой игре в принципе тратить патроны и стрелять как оголтелый не желательно (ресурсов мало), так ещё и спавн, это не много расстраивает. Ты старался, чистил локацию, потратил ресурсы и патроны, отошёл от локации, вернулся, а все враги стоят на своих местах.\r\n\r\n2. Вы, главный супер герой - пока все сидят у костра, курят грибы, клеят баб, вы, пойдёте один, самые горячие точки что может предложить игра (парой доходит до смешного). Вы как местный Рембо, и с десяток бандитов зачистит и хату размутит, и бабам поможет.\r\nТакже, не забуду и до мозга костей стереотипных второстепенных персонажей, Американец с комичным акцентом, тупой вояка, горячий на голову зумер который стремится всех на тряпки порвать... Вспоминаем золотой фонд цитат: \"Всё что тут есть, всё это есть\" (кто знает, тот поймёт XD)\r\nСюжетные ходы читаются, персонажи прозрачные и плоские, чёткое разделение, вы - хорошие, они - плохие, в наше время такой подход к нарративу очень расстраивает.\r\n\r\n3. Жёсткое навязывание стелса - тут важно отметить, игра не будет вам руинить прохождение, если вы начнёте убивать всё направо и налево, но в определённых местах, если вы этого не делали, то это скажется на сюжете и концовке и без открытого прохождения на втором мониторе, понять что и в какой момент надо сделать, очень сложно.\r\n\r\n4. Крайне тупой AI - видно что игру делали в первую очередь с упором под консоли и геймпады.\r\nВраги почти не двигаются, часто стоят по 3-5 секунд между атаками и смотрят на вас, стоит вам присесть в тени, как враги слепнут и не видят огромного мужика в боевой экипировке сидящего в (буквально) метре от себя. Всё, что-бы вы успели стиком навестись и выстрелить\r\n(ДАЖЕ НА МАКСИМАЛЬНОЙ СЛОЖНОСТИ).\r\n\r\n5. Лут не видно - тут всё просто, понять что вы можете поднять, а что нет, практически невозможно, единственный способ, это упираться лицом в каждый стол, шкаф или дырку, это конечно мелочь, но на максимальной сложности, без интерфейса, понять с чем вы можете взаимодействовать, а с чем нет, невозможно. Это мелочь, но раздражает сильно. Особенно если вы ставите перед собой цель собрать все журналы... Чуваки, без гайда, это невозможно, клянусь!\r\n\r\nНо даже не смотря на все те минусы что я описал выше, это всё равно одна из лучших игр, сюжет и персонажи хоть и банальны, но история и темы поднимаемые автором крайне актуальные и цепляющие. Графика - отвал башки, стрельба - ощущается отлично, звуковое сопровождение - бальзам для ушей, всем советую!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fitting conclusion to the Metro trilogy. Easily my favorite of the three. The story is way more focused in this one, and the attachments between Artyom and his companions are way more emphasized. \r\n\r\nThe real difference in feeling between Exodus isn't just the obviously top-tier graphics, but the semi-open world areas that are packed well and not needlessly expansive. If you don't like the first area, just play on... the theme is awesome but the water portions make it easily the most annoying.\r\n\r\nAnother huge upgrade is the gunplay and dialogue. Finally it felt good to shoot a gun in this series. True to it's predecessors, it also didn't hold back thematically or pull any sanitization BS that a lot of other big name series do from this era and beyond. Exodus is extremely faithful to the old entries, and is even more sadistic in a lot of areas.\r\n\r\nRegardless, I had a blast with this series. Highly recommend. Easy 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "second time playing through. Still alot of fun, and you have alot of different ways to approach or handle every situation. Great series!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After much though after finishing game in various modes, some times in russian. This would have to be my favourite single player game of all time - Play it fast, play it slow, loud or quiet or somewher in between. always fun, always runs well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "*issure reguarding the dlc it opens the store page when i try to access them even though my account has the dlcs though i think that it may be a time sensitive issue though i got a prompt about halfway though my playthough mentioning the dlcs being available and did not click the dlc tab til i finished the main storyline\nessentially open world with survival elements metro crafting resources is really prevalent though the world building is really quite nice like the others metro games the vehicles and boats feel awful though though fortunately they do not play a big role not to mention the story is really quite ponderous for the critical thinkers and reality perceivers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished metro exodus enhanced, the good ending this time, the first time I finished the game, I get the bad ending, so I experienced both, hard hitting ending even if its the second time I finished the game, very nice story and game overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bitirdiğim oyunları sevmeme rağmen nadiren tekrar açıp oynarım. Bu oyunu ilk çıktığında bitirmiştim ve o zaman çok iyiydi, şimdi oldu 2025 sıkıntıdan tekrar indirdim ve hala çok iyi. Hatta şu an daha da iyi geldi çünkü bazı oyunların b*ktanlığını gördükten sonra bunu açıp tekrar deneyim etmek çok iyi geldi. \r\n\r\nAtmosferi, karakterleri, dialogları ve temposu oldukça yerinde çok güzel çiçek gibi oyun. Yer yer keşke buda olsaymış diyebileceğim tek şey ana karakter Artyom un konuşabilen bir karakter olması. Sonuçta bir miktar karakteristiği olduğu oyun boyu belirtilen ve çokta RPG tarafında olmayan bir oyunda karakterin sessiz kalıyo olması o sinematik ve dialogu biraz bozabiliyor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game series is special to me, and I am quite happy to have finished it. Gun Play is very good compared to Metro 2033 or Last Light. Story wise is not as bleak but much more hopeful. Overall, I would recommend anyone who has played Metro 2033 and Last Light but not Exodus to take the plunge and enjoy this experience. Oh, don't play this game unless you have seen a recap (which I highly suggest you don't) or haven't played any of the previous games as there is so much lore and character development you will not understand",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buggy at times but it is a great story and worth the play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing,with this game i think series of metro are done unfortunately.\r\nLet's hope for one more release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good story, good grapichs with update/enhanced. Moody atmosphere that makes you seek out light. Varied game mechanics and likable characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a story that can incapsulate you for a day or few, an amazing story and gameplay that doesn't feel repetetive. There is though some problems with the animations and english speach not lining up, but since it wat intendet to be in russian there isn't anything you can do there. Anyhow, this is an amazing game and i propose that you take your time playing through it, not just killing everything in your path but taking time to look at the areas, explore and strategize.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely brilliant game. It made me feel. Game play was great. I loved the random talking and story line parts that you chose to experience. Meaning, none of the connections you make with your team was scripted. You picked to listen and it felt important. Shooting was great. Story was capturing. I hope there is another.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's crazy how well they optimized the enhanced version of the game. they could teach all the \"AAA\" studios a lesson in quality control",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game mostly bc of the scenery/graphics which looked amazing. good storyline and just wished there was more. also I liked the whole small-medium open world locations per mission.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Metro trilogy are some of the best games I've played and maybe it's because I played it last but Metro Exodus made a significant impact on me. I wasn't sure about the openness at first but the game is amazing, beautiful, emotional, and very immersive. A must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game awesome story graphics and gameplay were excellent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very different to the other two games but I can appreciate that they are trying to expand the game. Unfortunately some areas fall flat because we simply don't see enough of it, I feel like each area could honestly be it's own game and it feels a bit wasted here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game to continue the Metro story. Guns and gameplay feel really solid and chunky, however if you are a fan of Ranger Hardcore in the previous titles i'd recommend staying away from it in this game. The game plays great most times but on RH you get one tapped by snipers at any range, shotguns at medium to close range, and any melee from a human enemy and all enemy AI aim bot tracks you through walls once you've aggro'd them and will kill you the millisecond you peek out of cover at any distance. It's a coin toss on if the angle you have on an enemy allows you to get the prompt to knock them out so sometimes you have to shoot or use a throwing knife when you shouldnt have to and that death noise attracts enemies. Speaking of throwing knives, the hitboxes are bad. Every human has the hitbox of their skeleton and you will regularly find bullets, bolts, and knives flying straght through models and then the enemy auto detects you and 360 no scope one shots you. Which isn't bad if the auto save system wasn't another coin toss. You could go an hour without an auto save if you dont manually run back to a safe house to save, and if an enemy AI tracks you trough a wall and one taps you when you didnt even know he was there then guess who gets to restart the entire level.\r\nSounds like a lot of complaining but i genuinelly love the game, just don't do Ranger Hardcore unless you want that achievement, and even then i can say from experience it really isn't worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but has some issues. If you use arrow keys you will have to switch back WASD to do a couple of things.  I get stuck from time to time on the map such as going under stuff.  But, overall, an excellent game - would buy again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't let my hours fool you. I first played this on Xbox with the rest of the Metro games. This is hands down the best in the series. Do not let anyone fool you. Open world, deeply emotional and lore so in depth and fitting of the Metro series. Play this game, you will not regret it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great single player story driven campaign with some structured open world in each level to explore. You have to choose the good or bad actions that will affect your ending outcomes. You can play quietly or stealthy. You'll need to manage your resources carefully since there are limited resources.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic, i can not put into words the sheer joy i had playing this game it is pure perfection down the the minute detail. It is possibly the best game i have played if not definetly top 5. highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got this on a crazy discount - 3 games from the metro series for 10 bucks and this shit is fire\r\ndont think it would be worth full price though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best single player FPS I've ever played. Just finished it for the second time. Can't wait for the next part of the Metro series (or another 4A Games title).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good, but Only for a one time playthrough. Isn't a game to get into",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game differs from the other story games and unfortunately i got the bad ending it broke me :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most immersive first person shooter game I have ever played! I enjoyed playing main game, and 2 DLC. I will definetly go for a 2nd run for nostalgia in future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is ONLY metro, nothing else\r\n\r\n\r\n10/10 would love my game and pc crashing for the 50th time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely great game. The graphics still hold up very well in 2025, and some very nice music choice. I just escaped the desert, and not only is Stepans singing great, right after the celebrations, Кино started playing, and 2 of my most loved tracks as well. Genuinely just stood there for 10 minutes singning along",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "into the barren wasteland, fought raiders, mutants and more. Then I came home and played this game and damn its worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Metro Exodus is a triumph. it's an emotional, atmospheric, and deeply engaging experience that stands as one of the best story driven games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE ABSOLUTE BEST of the Metro trilogy, truly amazing game, this coming from a gamer who -does not- like FPS titles in the least! 10/10 *****",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an emotional rollercoaster. I loved every bit of it. Sad to know that this might be the end of this series, but we get closure knowing they made it to a better place to live.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is compeling, the game play is great. My only issue is that this game can be super buggy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Combat is great, so is stealth, the game is incredibly immersive espesially with no reticle. Very diverse environments and a large amount of play time with tons of side missions. Totally recommend, incredible game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really recommend the game!\r\nThe story really got into my heart, and the gameplay was extremely enjoyable.\r\nIf you've played Metro 2033 Redux, you'll fully understand the lore of the series!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game that made me hate swamp puppies even more, but still, this is peak game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good story and gameplay, great atmosphere. DLCs stories a bit to stupid in main antagonist department. \"I'm gonna kill everybody, just because\" in 2 colonels and completely nonsensical plan of restoring civilization thru piracy in Sam's story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Metro Exodus is a wonderful mixture of the first two Metro games, bringing along with its own fresh ideas. I'm a big fan of how they've woven the traditional claustrophobic tunnel exploration segments with new, far more open areas.  The Volga is probably my favorite level in this entire series, the game is worth it for the opening and that section alone. \r\n\r\nThe gunplay and firearm customization in this game is awesome. Playing on Ranger Hardcore felt satisfyingly lethal for both myself and the enemy, guns felt very powerful as they should. I also had to think strategically about what to craft, as supplies were typically very limited. Enemy design was good and brought back many favorites, but I wish there was a little more variety and a few new species. Humanimals, Wolves and Blind Ones are the only new creatures I can remember. \r\n\r\nMy one big complaint about this game is the Taiga level. I know that many people were drawn to this level from the initial trailers like I was, it looked phenomenal. While I still think the level is fun, it has clearly been cut back to a fraction of what was initially envisioned for that area. If Caspian had been followed by a shorter, more linear level (such as Yamantau) and Taiga had been fully developed into an open area equivalent to Volga, I think this game would be near perfect. Additionally, I loved that I could be respectful to the locals of the Volga and they returned that respect, which led to a better ending for that chapter. To me, the \"good endings\" to later chapters felt less natural. \r\n\r\nOverall, when played on Ranger Hardcore, this game is incredibly immersive and satisfying, I would definitely recommend it. I would also recommend playing the first two games before this one, I felt very rewarded having paid attention to the story up to this point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun and interesting addition to an already great franchise. I enjoyed the light crafting mechanics and quasi open world nature of the main areas. The only criticism I have is that I find the game rewarding stealth gameplay with a \"good ending\" or if you take a more guns blazing approach you'll get the \"bad ending\" to be trite at best. If a group of people are going to kill you on sight and to progress you need to get through their camp, taking them down & passing through just made sense to me, I don't appreciate feeling told how I \"should\" play. Mind you, I was 100 % happy with the ending I got so maybe it's a wash in the end? Great fun to play through, anyway.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay. Very addicted story and areas to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished my first playthrough in ranger hardcore mode for full immersion. Here are my thoughts.\n\n[h3]Pros:[/h3]\n\n[b]+ Interesting story with characters you care about[/b]. In good metro fashion. I liked that player actions affect the story.\n[b]+ Gun gameplay was fun[/b]. In ranger hardcore mode, every bullet counted. Only one bullet could end you but so could it also end the enemy. You always needed to think about risk-reward ratio of engaging in a firefight. Quite often it was better to just sneak around.\n[b]+ I liked the map variety and different sub-stories and atmosphere in them[/b].\n[b]+ I liked that all the tools had their usage[/b]. I like that I had to think a little what gear I will bring with me in this environment.\n[b]+ The atmosphere of survival and resource scarcity was great in ranger hardcore mode[/b]. Every loot you found felt rewarding.\n[b]+ Game has good length[/b], not too long to become boring but not too short either.\n\n[h3]Cons:[/h3]\n\n[b]- Lack of tutorial in ranger hardcore mode[/b]. I loved that the ranger hardcore had barely any HUD and you had to rely on you gear, iron sights etc. However, I still think there should be tutorial windows in the early game just so that the player can learn the gameplay mechanics.\n[b]- Physics engine sucks[/b]. I’ve died so many times when I tried to sprint in open environment, causing it to catapult me into sky and killing me.\n[b]- The time between autosaves is too long and random in open-world[/b]. In ranger hardcore mode, you can save the game only by sleeping and via autosave. While exploring it felt really frustrating to lose ~30 mins of gameplay due to sudden instakill. I don’t mind dying in hardcode mode but running back every time was just not fun experience.\n[b]- There are graphic cliches[/b], especially in the first semi-open world map. Doesn’t totally ruin the experience but are silly.\n\nIf you like post-apocalyptic games, I’d highly recommend this one. The game focuses on exploration and action (especially at lower difficulties) but the harder difficulties also include survival-”horror” elements in it. It can be played without knowing previous two games but but story might not feel as impactful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good story line, was not expecting artyom to die, i thought anna would die instead be artyom clutched up a 1v5 for the medcine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cyka Blyat! We going for the outside world while showing the radioactive wilderness that the russian is still on the top of the food chain!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game! I hate that I just discovered this series. Would absolutely play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved this game, the story sucks you in and you feel attached to the characters 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you can get past the carriage mission without crashing out you might enjoy this game, fortunately you can",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too peak of an emotional story and too hot of an in-game wife",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "道德点机制依托,游戏还是好玩",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El mejor juego con modo historia que he jugado, ahora es mi favorito. 9/10 porque habían bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good got now it started crashing on my laptop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good story line with a wide range of sub plots to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was very fun and moving, i recommend this gmae to everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game quite difficult but very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game but novosibirsk is fucking scary",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 ive played the story twice no words can do justice!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "definitely worth it, the ending was amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a wonderful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hele goede gameplay, best goed verhaal :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best story games that I have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love me pneumatic gun, love me precision, good day all around",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks the same as non-enhanced version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 trust me on this. Play this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game. It doesn't get better than this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good saga with ALOT of content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great immersive game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest saga i've ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is pretty good. 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY FUN BUT THERE ISNT NAZIS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak game 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome story + gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game so far <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool Game, awesome story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's so hard to drive when you're crying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved it! Great Game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The russian nuclear metro",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "Just finished exodus\r\n\r\nbought the series cause i saw so many good reviews\r\n\r\nbut i didn't care for it\r\n\r\n2033 was \"realistic\" to the point of being not fun. while at the same time having terrible AI. having post apocalyptic AND aliens in the same story was not interesting to me ( i know they're based off books\r\n\r\nlast light was a good balance between realistic and fun, except for terrible on-rails sections. still didn't care for the aliens plot\r\n\r\nexodus was like fallout but not fun. spending time looking around just to find scrap and lame gun parts. there's no fire swords or nuke miniguns (not that there needs to be, but when you're searching around that much for nothing of interest) took WAY longer to beat than necessary considering the amount of actual story points there were. great graphics except for some shitty textures and charecters eyeballs that looked ridiculous.\r\n\r\nand now the aliens aren't even mentioned??\r\n\r\nthat sludge tunnel was a terrible section. i had more fun in blighttown\r\n\r\ncompletely anticlimactic ending\r\n\r\ni don't know, this series gets so much praise but it wasn't for me and i'm glad i'm done with it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not have steam cloud.\nMakes you sit through super long launch videos every time you boot it.\nUses way too many different random buttons, terrible accessibility. \n\nThere is a cool game buried in a mountain of ****.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is ok, the gameplay is fine.\r\n\r\ncant recommand it though due to it's technical state. game crashes a lot. wont even launch if you have any wireless devices connected to your pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the series but this one is just not polished enough. Enemies keep walking through walls and dropping through floors. I also have a feeling that sometimes they see you through walls as well. The idea of free exploring in a Metro game is awesome and I'll probably finish this one out of respect for the series, but disappointed I have to say this one is undercooked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is genuinely fun, but I ran into a game-breaking bug that ruined my experience. When you go to the oasis with Damir to get water, you need him to give you a boost to reach the cave. Unfortunately, his AI can break at this point, leaving you soft-locked and there are invisible walls that prevents you from jumping into the cave yourself, (you also can’t leave the area either). To make matters worse, the save system only keeps saves from a few minutes ago and is not like Fallout where it keeps the save till you overwrite it yourself. So, if the game decides to autosave during this section, you’re stuck — you can’t reload to an earlier point before this random bug or load a savefile from the steam cloud (because it doesn't have this feature). So, I lost 2+ hours of progress and the only way to fix it is by restarting the level and pray it doesn't happened again. So, I'm keeping this review negative till they fix it (which I doubt)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My save file keeps disappearing I've played the first 5 hours of this game 3x (1on EE, 2 on base). You cant skip cutscenes and there is so much time spent not being able to control your character. It's frustrating to say the least. The game would be decent if it wasn't for this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate gasmasks with time limit , for a stealth-exploring games it is most retarded game mechanics possible .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played through the first 2 maps, stopped after finishing Caspian as the game just got very stale!\n\nWhile the guns feel nice to shoot the game just doesn't want you to use them. \nToo much focus on looting the same 4 components to craft scarcely looted ammo. Gotta loot the body then disassemble the gun, if you can find it, everytime!!! \nThe constant gun cleaning maintenance was also slowing down progression. Having to return to a safe house/camp after firing 2 mags of ammo or the gun starts to jam. Got worse in the desert map.\n\nFeel like the close and more linear maps of the first 2 games work better for atmosphere than the open map layout. That car was awful to drive with all the bouncing everywhere!\n\nCould not get this enhanced edition to work on windows 10 without heavy stuttering. \nRan fine on windows 11 with the exact same pc!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Purchased this on sale a while back. Tried running it today and it constantly crashed on load. Can't even boot the game. What a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game soft locked in an area that I can't load out of. Tried every \"fix\" suggested but no luck. Apparently it's a common problem that will also lock you out of certain endings even if you do find a way to fix it in game. Don't waste your money or your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the dev's must be afraid of the dark... the moon is so damn bright that night is just day 2.0. it makes stealth REALLY annoying and breaks the vibes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game's pretty boring and the writing's laughable. I like the designs and graphics though, so I'll probably power through it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I would love to recommend this game to anyone but despite saying they fixed the flashlight bug in dead city it is still broken making getting around a nightmare. I still believe this is a great game but I refuse to give a good review after it made a 15 minute section take 4 hours just because of lighting. Plz fix",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dawg, the morality system is broken. No matter how much good you go, mess up once and apparently that's enough for game to punish you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've loved the past games. For me, this game just didn't land as well. The story felt clunky, the chemistry between all characters felt very scripted. The graphics were also unusually lackluster. I think there could have been some issue with it, as I had frequent crashes. Tried to re-install, double checked display issues. But still, couldn't stop annoying crashes, and the story just wasn't interesting enough to keep me fighting through it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mecânica ultrapassada. Lore desinteressante.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupid bugs, enhanced pc edition my as*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not the same as the other two I don't like this one. But I will finish it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so shit man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so shit man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like this game. It makes me think of an unpolished gem. Every time I want to inspect the beauty of its facets I find that its rough edges have cut my hands to ribbons. I like the characters and the narrative. Metro Last Light felt stilted, with Colonel Miller being an egregious example of character assassination between the two games. Shoutout to Pavel for being one of the best NPCs ever. I digress. In this game I have been happy to see how they have treated Miller and Anna, as well as the rest of the Spartans. I appreciate how much extra dialogue is available for those who decide to stick around and listen to people talk for longer than is required. I also like the visual design and scenes in this game, the Aurora carries an especially enjoyable atmosphere. Where the game is a severe letdown, however, is in its gameplay. \n\nMy main concern playing this game is always when my next save point is going to appear. The game is designed around the fact the players now have the option to quicksave. This would not be a major problem if Ranger Hardcore difficulty did not dispense of this option. This means the player now must wait for the caprices of the game to charitably bestow upon them a save point. Due to this game incorporating several open world areas, this problem is exacerbated as players can explore for extended periods of time without autosaves triggering. I recognise that this difficulty is meant to be a great challenge, but there is nothing challenging in making the player repeat tedious content over and over again without granting them save points. There is no difficulty running from point A to point B ten times over, it's just boring. \n\nThis leads on to my next issue with the game. If the player wishes to progress through the game and acquire the good ending, almost all of their interactions with human enemies requires a stealth-led approach. Level design in this game, when it comes to tackling stealth, is not predictive. It is something you must learn through trial and error. To one extent or another this was the case in previous metro titles, but with the linearity of the game and the frequency of saves on each level this problem was significantly mitigated. What Metro Exodus expects the player to do is either quicksave frequently, or suffer. In Ranger Hardcore, you have only one option. I have experienced on several occasions the frustration of dying during a stealth section, respawning at my most recent save point (which I have personally triggered by sleeping in a safe house) and spending a few minutes travelling back to the start of the section I had previously failed. This becomes extremely grating on one's patience. Stealth sections have, at times, bloated enemy counts shielded by a copious number of lights. When no autosave triggers, it means that you have no way of knowing where the 'correct' angle of approach is and that you will likely need to load a save 5-10 minutes old until you map out your route. Enemy sight + torch cones feel gigantic and there are times when Artyom's watch signifies that he should be obscured from vision but is detected anyways.\n\nWeapons in this game do not feel responsive. I make sure that they are maximally cleaned at every opportunity that I have and have been building my attachments for stability and accuracy. Still, I have often found - especially with the Tikhar - that shooting with the reticle of the red-dot sight directly in the centre of an enemy's head results in a total miss 25% of the time, even when they are standing still. Alerted enemies also seem to possess some form of Spidey Sense whereby they are able to dodge bullets as they are being shot, regardless of range or weapon type. When you combine these shooting issues with the above comments on stealth sections, what you have is a game that feels unresponsive to player inputs and is incapable of rewarding thoughtful judgements. \n\nWhen I complete a stealth section I do not feel rewarded for playing well, nor do I feel like I have deftly navigated my way through a maze of enemies by perceiving weaknesses in patrols and lighting. All I have succeeded in doing is merely throwing myself at a problem until I eventually overcome it, that I have been lucky and not skilled in so doing.\n\n\nThere is also a bug in this game that prevents you from using stealth takedowns on certain enemies. It is endlessly frustrating to have one of the core gameplay mechanics of the Metro series fail to work on such a fundamental level. I have lost progress as a result of not being able to take down enemies stealthily, only for them to spin round and alert everybody by shouting.\n\nI'm going to finish this game regardless, because I am a compulsive completionist, but I would not recommend anybody else playing it. If you are a fan of the Metro series, this game is the least 'Metro' of the bunch - and by a great margin. If you are a fan of open world shooters, there are better options than Metro.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hate games that make it so fun to kill people and then penalize you for killing people. I hate games where I don't kill anyone, do all the side objectives and still get the bad ending because of some arbitrary system that is barely defined. Seriously, look up different guide on how to get good ending in each zone, they all say something different. I just can't with Metro's morality system, it can go dig a ditch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just finished exodus\r\n\r\nbought the series cause i saw so many good reviews\r\n\r\nbut i didn't care for it\r\n\r\n2033 was \"realistic\" to the point of being not fun. while at the same time having terrible AI. having post apocalyptic AND aliens in the same story was not interesting to me ( i know they're based off books\r\n\r\nlast light was a good balance between realistic and fun, except for terrible on-rails sections. still didn't care for the aliens plot\r\n\r\nexodus was like fallout but not fun. spending time looking around just to find scrap and lame gun parts. there's no fire swords or nuke miniguns (not that there needs to be, but when you're searching around that much for nothing of interest) took WAY longer to beat than necessary considering the amount of actual story points there were. great graphics except for some shitty textures and charecters eyeballs that looked ridiculous.\r\n\r\nand now the aliens aren't even mentioned??\r\n\r\nthat sludge tunnel was a terrible section. i had more fun in blighttown\r\n\r\ncompletely anticlimactic ending\r\n\r\ni don't know, this series gets so much praise but it wasn't for me and i'm glad i'm done with it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not have steam cloud.\nMakes you sit through super long launch videos every time you boot it.\nUses way too many different random buttons, terrible accessibility. \n\nThere is a cool game buried in a mountain of ****.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is ok, the gameplay is fine.\r\n\r\ncant recommand it though due to it's technical state. game crashes a lot. wont even launch if you have any wireless devices connected to your pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the series but this one is just not polished enough. Enemies keep walking through walls and dropping through floors. I also have a feeling that sometimes they see you through walls as well. The idea of free exploring in a Metro game is awesome and I'll probably finish this one out of respect for the series, but disappointed I have to say this one is undercooked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is genuinely fun, but I ran into a game-breaking bug that ruined my experience. When you go to the oasis with Damir to get water, you need him to give you a boost to reach the cave. Unfortunately, his AI can break at this point, leaving you soft-locked and there are invisible walls that prevents you from jumping into the cave yourself, (you also can’t leave the area either). To make matters worse, the save system only keeps saves from a few minutes ago and is not like Fallout where it keeps the save till you overwrite it yourself. So, if the game decides to autosave during this section, you’re stuck — you can’t reload to an earlier point before this random bug or load a savefile from the steam cloud (because it doesn't have this feature). So, I lost 2+ hours of progress and the only way to fix it is by restarting the level and pray it doesn't happened again. So, I'm keeping this review negative till they fix it (which I doubt)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My save file keeps disappearing I've played the first 5 hours of this game 3x (1on EE, 2 on base). You cant skip cutscenes and there is so much time spent not being able to control your character. It's frustrating to say the least. The game would be decent if it wasn't for this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate gasmasks with time limit , for a stealth-exploring games it is most retarded game mechanics possible .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played through the first 2 maps, stopped after finishing Caspian as the game just got very stale!\n\nWhile the guns feel nice to shoot the game just doesn't want you to use them. \nToo much focus on looting the same 4 components to craft scarcely looted ammo. Gotta loot the body then disassemble the gun, if you can find it, everytime!!! \nThe constant gun cleaning maintenance was also slowing down progression. Having to return to a safe house/camp after firing 2 mags of ammo or the gun starts to jam. Got worse in the desert map.\n\nFeel like the close and more linear maps of the first 2 games work better for atmosphere than the open map layout. That car was awful to drive with all the bouncing everywhere!\n\nCould not get this enhanced edition to work on windows 10 without heavy stuttering. \nRan fine on windows 11 with the exact same pc!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Purchased this on sale a while back. Tried running it today and it constantly crashed on load. Can't even boot the game. What a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game soft locked in an area that I can't load out of. Tried every \"fix\" suggested but no luck. Apparently it's a common problem that will also lock you out of certain endings even if you do find a way to fix it in game. Don't waste your money or your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the dev's must be afraid of the dark... the moon is so damn bright that night is just day 2.0. it makes stealth REALLY annoying and breaks the vibes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game's pretty boring and the writing's laughable. I like the designs and graphics though, so I'll probably power through it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I would love to recommend this game to anyone but despite saying they fixed the flashlight bug in dead city it is still broken making getting around a nightmare. I still believe this is a great game but I refuse to give a good review after it made a 15 minute section take 4 hours just because of lighting. Plz fix",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dawg, the morality system is broken. No matter how much good you go, mess up once and apparently that's enough for game to punish you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've loved the past games. For me, this game just didn't land as well. The story felt clunky, the chemistry between all characters felt very scripted. The graphics were also unusually lackluster. I think there could have been some issue with it, as I had frequent crashes. Tried to re-install, double checked display issues. But still, couldn't stop annoying crashes, and the story just wasn't interesting enough to keep me fighting through it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The same crashing issues as the last two games.  Stale Plot and dull dialogue, terrible karma system oh and also the gun jamming mechanic...DUMB",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bugged mess with no console, requires cheat engine to fix despite the fact that the devs know what's up.\r\nCompletely random crashes showcases that something is seriously wrong with this game, mind that this is not fixed by choice and left there as it is for us to enjoy such an experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "have had to start over sevreral times because i had to reinstall operating system and lost all my progress so stupid that the original game has cloud saves but for some fucking reason this \"enhanced\" version doesn't seriously disappointing and has left a somewhat sour taste in my mouth since you can't skip the cutscenes or the parts of the game where they make you stay in place and listen to exposition that you have already hear five times before, it really sours my opinion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mecânica ultrapassada. Lore desinteressante.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupid bugs, enhanced pc edition my as*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not the same as the other two I don't like this one. But I will finish it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "map keys have to be wasd, if you remap them then you can't use map.  dev fail.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so shit man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like this game. It makes me think of an unpolished gem. Every time I want to inspect the beauty of its facets I find that its rough edges have cut my hands to ribbons. I like the characters and the narrative. Metro Last Light felt stilted, with Colonel Miller being an egregious example of character assassination between the two games. Shoutout to Pavel for being one of the best NPCs ever. I digress. In this game I have been happy to see how they have treated Miller and Anna, as well as the rest of the Spartans. I appreciate how much extra dialogue is available for those who decide to stick around and listen to people talk for longer than is required. I also like the visual design and scenes in this game, the Aurora carries an especially enjoyable atmosphere. Where the game is a severe letdown, however, is in its gameplay. \n\nMy main concern playing this game is always when my next save point is going to appear. The game is designed around the fact the players now have the option to quicksave. This would not be a major problem if Ranger Hardcore difficulty did not dispense of this option. This means the player now must wait for the caprices of the game to charitably bestow upon them a save point. Due to this game incorporating several open world areas, this problem is exacerbated as players can explore for extended periods of time without autosaves triggering. I recognise that this difficulty is meant to be a great challenge, but there is nothing challenging in making the player repeat tedious content over and over again without granting them save points. There is no difficulty running from point A to point B ten times over, it's just boring. \n\nThis leads on to my next issue with the game. If the player wishes to progress through the game and acquire the good ending, almost all of their interactions with human enemies requires a stealth-led approach. Level design in this game, when it comes to tackling stealth, is not predictive. It is something you must learn through trial and error. To one extent or another this was the case in previous metro titles, but with the linearity of the game and the frequency of saves on each level this problem was significantly mitigated. What Metro Exodus expects the player to do is either quicksave frequently, or suffer. In Ranger Hardcore, you have only one option. I have experienced on several occasions the frustration of dying during a stealth section, respawning at my most recent save point (which I have personally triggered by sleeping in a safe house) and spending a few minutes travelling back to the start of the section I had previously failed. This becomes extremely grating on one's patience. Stealth sections have, at times, bloated enemy counts shielded by a copious number of lights. When no autosave triggers, it means that you have no way of knowing where the 'correct' angle of approach is and that you will likely need to load a save 5-10 minutes old until you map out your route. Enemy sight + torch cones feel gigantic and there are times when Artyom's watch signifies that he should be obscured from vision but is detected anyways.\n\nWeapons in this game do not feel responsive. I make sure that they are maximally cleaned at every opportunity that I have and have been building my attachments for stability and accuracy. Still, I have often found - especially with the Tikhar - that shooting with the reticle of the red-dot sight directly in the centre of an enemy's head results in a total miss 25% of the time, even when they are standing still. Alerted enemies also seem to possess some form of Spidey Sense whereby they are able to dodge bullets as they are being shot, regardless of range or weapon type. When you combine these shooting issues with the above comments on stealth sections, what you have is a game that feels unresponsive to player inputs and is incapable of rewarding thoughtful judgements. \n\nWhen I complete a stealth section I do not feel rewarded for playing well, nor do I feel like I have deftly navigated my way through a maze of enemies by perceiving weaknesses in patrols and lighting. All I have succeeded in doing is merely throwing myself at a problem until I eventually overcome it, that I have been lucky and not skilled in so doing.\n\n\nThere is also a bug in this game that prevents you from using stealth takedowns on certain enemies. It is endlessly frustrating to have one of the core gameplay mechanics of the Metro series fail to work on such a fundamental level. I have lost progress as a result of not being able to take down enemies stealthily, only for them to spin round and alert everybody by shouting.\n\nI'm going to finish this game regardless, because I am a compulsive completionist, but I would not recommend anybody else playing it. If you are a fan of the Metro series, this game is the least 'Metro' of the bunch - and by a great margin. If you are a fan of open world shooters, there are better options than Metro.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hate games that make it so fun to kill people and then penalize you for killing people. I hate games where I don't kill anyone, do all the side objectives and still get the bad ending because of some arbitrary system that is barely defined. Seriously, look up different guide on how to get good ending in each zone, they all say something different. I just can't with Metro's morality system, it can go dig a ditch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just finished exodus\r\n\r\nbought the series cause i saw so many good reviews\r\n\r\nbut i didn't care for it\r\n\r\n2033 was \"realistic\" to the point of being not fun. while at the same time having terrible AI. having post apocalyptic AND aliens in the same story was not interesting to me ( i know they're based off books\r\n\r\nlast light was a good balance between realistic and fun, except for terrible on-rails sections. still didn't care for the aliens plot\r\n\r\nexodus was like fallout but not fun. spending time looking around just to find scrap and lame gun parts. there's no fire swords or nuke miniguns (not that there needs to be, but when you're searching around that much for nothing of interest) took WAY longer to beat than necessary considering the amount of actual story points there were. great graphics except for some shitty textures and charecters eyeballs that looked ridiculous.\r\n\r\nand now the aliens aren't even mentioned??\r\n\r\nthat sludge tunnel was a terrible section. i had more fun in blighttown\r\n\r\ncompletely anticlimactic ending\r\n\r\ni don't know, this series gets so much praise but it wasn't for me and i'm glad i'm done with it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not have steam cloud.\nMakes you sit through super long launch videos every time you boot it.\nUses way too many different random buttons, terrible accessibility. \n\nThere is a cool game buried in a mountain of ****.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is ok, the gameplay is fine.\r\n\r\ncant recommand it though due to it's technical state. game crashes a lot. wont even launch if you have any wireless devices connected to your pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the series but this one is just not polished enough. Enemies keep walking through walls and dropping through floors. I also have a feeling that sometimes they see you through walls as well. The idea of free exploring in a Metro game is awesome and I'll probably finish this one out of respect for the series, but disappointed I have to say this one is undercooked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is genuinely fun, but I ran into a game-breaking bug that ruined my experience. When you go to the oasis with Damir to get water, you need him to give you a boost to reach the cave. Unfortunately, his AI can break at this point, leaving you soft-locked and there are invisible walls that prevents you from jumping into the cave yourself, (you also can’t leave the area either). To make matters worse, the save system only keeps saves from a few minutes ago and is not like Fallout where it keeps the save till you overwrite it yourself. So, if the game decides to autosave during this section, you’re stuck — you can’t reload to an earlier point before this random bug or load a savefile from the steam cloud (because it doesn't have this feature). So, I lost 2+ hours of progress and the only way to fix it is by restarting the level and pray it doesn't happened again. So, I'm keeping this review negative till they fix it (which I doubt)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My save file keeps disappearing I've played the first 5 hours of this game 3x (1on EE, 2 on base). You cant skip cutscenes and there is so much time spent not being able to control your character. It's frustrating to say the least. The game would be decent if it wasn't for this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate gasmasks with time limit , for a stealth-exploring games it is most retarded game mechanics possible .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played through the first 2 maps, stopped after finishing Caspian as the game just got very stale!\n\nWhile the guns feel nice to shoot the game just doesn't want you to use them. \nToo much focus on looting the same 4 components to craft scarcely looted ammo. Gotta loot the body then disassemble the gun, if you can find it, everytime!!! \nThe constant gun cleaning maintenance was also slowing down progression. Having to return to a safe house/camp after firing 2 mags of ammo or the gun starts to jam. Got worse in the desert map.\n\nFeel like the close and more linear maps of the first 2 games work better for atmosphere than the open map layout. That car was awful to drive with all the bouncing everywhere!\n\nCould not get this enhanced edition to work on windows 10 without heavy stuttering. \nRan fine on windows 11 with the exact same pc!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Purchased this on sale a while back. Tried running it today and it constantly crashed on load. Can't even boot the game. What a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game soft locked in an area that I can't load out of. Tried every \"fix\" suggested but no luck. Apparently it's a common problem that will also lock you out of certain endings even if you do find a way to fix it in game. Don't waste your money or your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the dev's must be afraid of the dark... the moon is so damn bright that night is just day 2.0. it makes stealth REALLY annoying and breaks the vibes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game's pretty boring and the writing's laughable. I like the designs and graphics though, so I'll probably power through it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I would love to recommend this game to anyone but despite saying they fixed the flashlight bug in dead city it is still broken making getting around a nightmare. I still believe this is a great game but I refuse to give a good review after it made a 15 minute section take 4 hours just because of lighting. Plz fix",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dawg, the morality system is broken. No matter how much good you go, mess up once and apparently that's enough for game to punish you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've loved the past games. For me, this game just didn't land as well. The story felt clunky, the chemistry between all characters felt very scripted. The graphics were also unusually lackluster. I think there could have been some issue with it, as I had frequent crashes. Tried to re-install, double checked display issues. But still, couldn't stop annoying crashes, and the story just wasn't interesting enough to keep me fighting through it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The same crashing issues as the last two games.  Stale Plot and dull dialogue, terrible karma system oh and also the gun jamming mechanic...DUMB",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bugged mess with no console, requires cheat engine to fix despite the fact that the devs know what's up.\r\nCompletely random crashes showcases that something is seriously wrong with this game, mind that this is not fixed by choice and left there as it is for us to enjoy such an experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "have had to start over sevreral times because i had to reinstall operating system and lost all my progress so stupid that the original game has cloud saves but for some fucking reason this \"enhanced\" version doesn't seriously disappointing and has left a somewhat sour taste in my mouth since you can't skip the cutscenes or the parts of the game where they make you stay in place and listen to exposition that you have already hear five times before, it really sours my opinion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mecânica ultrapassada. Lore desinteressante.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupid bugs, enhanced pc edition my as*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not the same as the other two I don't like this one. But I will finish it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "map keys have to be wasd, if you remap them then you can't use map.  dev fail.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so shit man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like this game. It makes me think of an unpolished gem. Every time I want to inspect the beauty of its facets I find that its rough edges have cut my hands to ribbons. I like the characters and the narrative. Metro Last Light felt stilted, with Colonel Miller being an egregious example of character assassination between the two games. Shoutout to Pavel for being one of the best NPCs ever. I digress. In this game I have been happy to see how they have treated Miller and Anna, as well as the rest of the Spartans. I appreciate how much extra dialogue is available for those who decide to stick around and listen to people talk for longer than is required. I also like the visual design and scenes in this game, the Aurora carries an especially enjoyable atmosphere. Where the game is a severe letdown, however, is in its gameplay. \n\nMy main concern playing this game is always when my next save point is going to appear. The game is designed around the fact the players now have the option to quicksave. This would not be a major problem if Ranger Hardcore difficulty did not dispense of this option. This means the player now must wait for the caprices of the game to charitably bestow upon them a save point. Due to this game incorporating several open world areas, this problem is exacerbated as players can explore for extended periods of time without autosaves triggering. I recognise that this difficulty is meant to be a great challenge, but there is nothing challenging in making the player repeat tedious content over and over again without granting them save points. There is no difficulty running from point A to point B ten times over, it's just boring. \n\nThis leads on to my next issue with the game. If the player wishes to progress through the game and acquire the good ending, almost all of their interactions with human enemies requires a stealth-led approach. Level design in this game, when it comes to tackling stealth, is not predictive. It is something you must learn through trial and error. To one extent or another this was the case in previous metro titles, but with the linearity of the game and the frequency of saves on each level this problem was significantly mitigated. What Metro Exodus expects the player to do is either quicksave frequently, or suffer. In Ranger Hardcore, you have only one option. I have experienced on several occasions the frustration of dying during a stealth section, respawning at my most recent save point (which I have personally triggered by sleeping in a safe house) and spending a few minutes travelling back to the start of the section I had previously failed. This becomes extremely grating on one's patience. Stealth sections have, at times, bloated enemy counts shielded by a copious number of lights. When no autosave triggers, it means that you have no way of knowing where the 'correct' angle of approach is and that you will likely need to load a save 5-10 minutes old until you map out your route. Enemy sight + torch cones feel gigantic and there are times when Artyom's watch signifies that he should be obscured from vision but is detected anyways.\n\nWeapons in this game do not feel responsive. I make sure that they are maximally cleaned at every opportunity that I have and have been building my attachments for stability and accuracy. Still, I have often found - especially with the Tikhar - that shooting with the reticle of the red-dot sight directly in the centre of an enemy's head results in a total miss 25% of the time, even when they are standing still. Alerted enemies also seem to possess some form of Spidey Sense whereby they are able to dodge bullets as they are being shot, regardless of range or weapon type. When you combine these shooting issues with the above comments on stealth sections, what you have is a game that feels unresponsive to player inputs and is incapable of rewarding thoughtful judgements. \n\nWhen I complete a stealth section I do not feel rewarded for playing well, nor do I feel like I have deftly navigated my way through a maze of enemies by perceiving weaknesses in patrols and lighting. All I have succeeded in doing is merely throwing myself at a problem until I eventually overcome it, that I have been lucky and not skilled in so doing.\n\n\nThere is also a bug in this game that prevents you from using stealth takedowns on certain enemies. It is endlessly frustrating to have one of the core gameplay mechanics of the Metro series fail to work on such a fundamental level. I have lost progress as a result of not being able to take down enemies stealthily, only for them to spin round and alert everybody by shouting.\n\nI'm going to finish this game regardless, because I am a compulsive completionist, but I would not recommend anybody else playing it. If you are a fan of the Metro series, this game is the least 'Metro' of the bunch - and by a great margin. If you are a fan of open world shooters, there are better options than Metro.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hate games that make it so fun to kill people and then penalize you for killing people. I hate games where I don't kill anyone, do all the side objectives and still get the bad ending because of some arbitrary system that is barely defined. Seriously, look up different guide on how to get good ending in each zone, they all say something different. I just can't with Metro's morality system, it can go dig a ditch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just finished exodus\r\n\r\nbought the series cause i saw so many good reviews\r\n\r\nbut i didn't care for it\r\n\r\n2033 was \"realistic\" to the point of being not fun. while at the same time having terrible AI. having post apocalyptic AND aliens in the same story was not interesting to me ( i know they're based off books\r\n\r\nlast light was a good balance between realistic and fun, except for terrible on-rails sections. still didn't care for the aliens plot\r\n\r\nexodus was like fallout but not fun. spending time looking around just to find scrap and lame gun parts. there's no fire swords or nuke miniguns (not that there needs to be, but when you're searching around that much for nothing of interest) took WAY longer to beat than necessary considering the amount of actual story points there were. great graphics except for some shitty textures and charecters eyeballs that looked ridiculous.\r\n\r\nand now the aliens aren't even mentioned??\r\n\r\nthat sludge tunnel was a terrible section. i had more fun in blighttown\r\n\r\ncompletely anticlimactic ending\r\n\r\ni don't know, this series gets so much praise but it wasn't for me and i'm glad i'm done with it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not have steam cloud.\nMakes you sit through super long launch videos every time you boot it.\nUses way too many different random buttons, terrible accessibility. \n\nThere is a cool game buried in a mountain of ****.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is ok, the gameplay is fine.\r\n\r\ncant recommand it though due to it's technical state. game crashes a lot. wont even launch if you have any wireless devices connected to your pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the series but this one is just not polished enough. Enemies keep walking through walls and dropping through floors. I also have a feeling that sometimes they see you through walls as well. The idea of free exploring in a Metro game is awesome and I'll probably finish this one out of respect for the series, but disappointed I have to say this one is undercooked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is genuinely fun, but I ran into a game-breaking bug that ruined my experience. When you go to the oasis with Damir to get water, you need him to give you a boost to reach the cave. Unfortunately, his AI can break at this point, leaving you soft-locked and there are invisible walls that prevents you from jumping into the cave yourself, (you also can’t leave the area either). To make matters worse, the save system only keeps saves from a few minutes ago and is not like Fallout where it keeps the save till you overwrite it yourself. So, if the game decides to autosave during this section, you’re stuck — you can’t reload to an earlier point before this random bug or load a savefile from the steam cloud (because it doesn't have this feature). So, I lost 2+ hours of progress and the only way to fix it is by restarting the level and pray it doesn't happened again. So, I'm keeping this review negative till they fix it (which I doubt)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My save file keeps disappearing I've played the first 5 hours of this game 3x (1on EE, 2 on base). You cant skip cutscenes and there is so much time spent not being able to control your character. It's frustrating to say the least. The game would be decent if it wasn't for this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate gasmasks with time limit , for a stealth-exploring games it is most retarded game mechanics possible .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played through the first 2 maps, stopped after finishing Caspian as the game just got very stale!\n\nWhile the guns feel nice to shoot the game just doesn't want you to use them. \nToo much focus on looting the same 4 components to craft scarcely looted ammo. Gotta loot the body then disassemble the gun, if you can find it, everytime!!! \nThe constant gun cleaning maintenance was also slowing down progression. Having to return to a safe house/camp after firing 2 mags of ammo or the gun starts to jam. Got worse in the desert map.\n\nFeel like the close and more linear maps of the first 2 games work better for atmosphere than the open map layout. That car was awful to drive with all the bouncing everywhere!\n\nCould not get this enhanced edition to work on windows 10 without heavy stuttering. \nRan fine on windows 11 with the exact same pc!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Purchased this on sale a while back. Tried running it today and it constantly crashed on load. Can't even boot the game. What a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game soft locked in an area that I can't load out of. Tried every \"fix\" suggested but no luck. Apparently it's a common problem that will also lock you out of certain endings even if you do find a way to fix it in game. Don't waste your money or your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the dev's must be afraid of the dark... the moon is so damn bright that night is just day 2.0. it makes stealth REALLY annoying and breaks the vibes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game's pretty boring and the writing's laughable. I like the designs and graphics though, so I'll probably power through it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I would love to recommend this game to anyone but despite saying they fixed the flashlight bug in dead city it is still broken making getting around a nightmare. I still believe this is a great game but I refuse to give a good review after it made a 15 minute section take 4 hours just because of lighting. Plz fix",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dawg, the morality system is broken. No matter how much good you go, mess up once and apparently that's enough for game to punish you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've loved the past games. For me, this game just didn't land as well. The story felt clunky, the chemistry between all characters felt very scripted. The graphics were also unusually lackluster. I think there could have been some issue with it, as I had frequent crashes. Tried to re-install, double checked display issues. But still, couldn't stop annoying crashes, and the story just wasn't interesting enough to keep me fighting through it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The same crashing issues as the last two games.  Stale Plot and dull dialogue, terrible karma system oh and also the gun jamming mechanic...DUMB",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bugged mess with no console, requires cheat engine to fix despite the fact that the devs know what's up.\r\nCompletely random crashes showcases that something is seriously wrong with this game, mind that this is not fixed by choice and left there as it is for us to enjoy such an experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "have had to start over sevreral times because i had to reinstall operating system and lost all my progress so stupid that the original game has cloud saves but for some fucking reason this \"enhanced\" version doesn't seriously disappointing and has left a somewhat sour taste in my mouth since you can't skip the cutscenes or the parts of the game where they make you stay in place and listen to exposition that you have already hear five times before, it really sours my opinion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mecânica ultrapassada. Lore desinteressante.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupid bugs, enhanced pc edition my as*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not the same as the other two I don't like this one. But I will finish it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "map keys have to be wasd, if you remap them then you can't use map.  dev fail.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so shit man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like this game. It makes me think of an unpolished gem. Every time I want to inspect the beauty of its facets I find that its rough edges have cut my hands to ribbons. I like the characters and the narrative. Metro Last Light felt stilted, with Colonel Miller being an egregious example of character assassination between the two games. Shoutout to Pavel for being one of the best NPCs ever. I digress. In this game I have been happy to see how they have treated Miller and Anna, as well as the rest of the Spartans. I appreciate how much extra dialogue is available for those who decide to stick around and listen to people talk for longer than is required. I also like the visual design and scenes in this game, the Aurora carries an especially enjoyable atmosphere. Where the game is a severe letdown, however, is in its gameplay. \n\nMy main concern playing this game is always when my next save point is going to appear. The game is designed around the fact the players now have the option to quicksave. This would not be a major problem if Ranger Hardcore difficulty did not dispense of this option. This means the player now must wait for the caprices of the game to charitably bestow upon them a save point. Due to this game incorporating several open world areas, this problem is exacerbated as players can explore for extended periods of time without autosaves triggering. I recognise that this difficulty is meant to be a great challenge, but there is nothing challenging in making the player repeat tedious content over and over again without granting them save points. There is no difficulty running from point A to point B ten times over, it's just boring. \n\nThis leads on to my next issue with the game. If the player wishes to progress through the game and acquire the good ending, almost all of their interactions with human enemies requires a stealth-led approach. Level design in this game, when it comes to tackling stealth, is not predictive. It is something you must learn through trial and error. To one extent or another this was the case in previous metro titles, but with the linearity of the game and the frequency of saves on each level this problem was significantly mitigated. What Metro Exodus expects the player to do is either quicksave frequently, or suffer. In Ranger Hardcore, you have only one option. I have experienced on several occasions the frustration of dying during a stealth section, respawning at my most recent save point (which I have personally triggered by sleeping in a safe house) and spending a few minutes travelling back to the start of the section I had previously failed. This becomes extremely grating on one's patience. Stealth sections have, at times, bloated enemy counts shielded by a copious number of lights. When no autosave triggers, it means that you have no way of knowing where the 'correct' angle of approach is and that you will likely need to load a save 5-10 minutes old until you map out your route. Enemy sight + torch cones feel gigantic and there are times when Artyom's watch signifies that he should be obscured from vision but is detected anyways.\n\nWeapons in this game do not feel responsive. I make sure that they are maximally cleaned at every opportunity that I have and have been building my attachments for stability and accuracy. Still, I have often found - especially with the Tikhar - that shooting with the reticle of the red-dot sight directly in the centre of an enemy's head results in a total miss 25% of the time, even when they are standing still. Alerted enemies also seem to possess some form of Spidey Sense whereby they are able to dodge bullets as they are being shot, regardless of range or weapon type. When you combine these shooting issues with the above comments on stealth sections, what you have is a game that feels unresponsive to player inputs and is incapable of rewarding thoughtful judgements. \n\nWhen I complete a stealth section I do not feel rewarded for playing well, nor do I feel like I have deftly navigated my way through a maze of enemies by perceiving weaknesses in patrols and lighting. All I have succeeded in doing is merely throwing myself at a problem until I eventually overcome it, that I have been lucky and not skilled in so doing.\n\n\nThere is also a bug in this game that prevents you from using stealth takedowns on certain enemies. It is endlessly frustrating to have one of the core gameplay mechanics of the Metro series fail to work on such a fundamental level. I have lost progress as a result of not being able to take down enemies stealthily, only for them to spin round and alert everybody by shouting.\n\nI'm going to finish this game regardless, because I am a compulsive completionist, but I would not recommend anybody else playing it. If you are a fan of the Metro series, this game is the least 'Metro' of the bunch - and by a great margin. If you are a fan of open world shooters, there are better options than Metro.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hate games that make it so fun to kill people and then penalize you for killing people. I hate games where I don't kill anyone, do all the side objectives and still get the bad ending because of some arbitrary system that is barely defined. Seriously, look up different guide on how to get good ending in each zone, they all say something different. I just can't with Metro's morality system, it can go dig a ditch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just finished exodus\r\n\r\nbought the series cause i saw so many good reviews\r\n\r\nbut i didn't care for it\r\n\r\n2033 was \"realistic\" to the point of being not fun. while at the same time having terrible AI. having post apocalyptic AND aliens in the same story was not interesting to me ( i know they're based off books\r\n\r\nlast light was a good balance between realistic and fun, except for terrible on-rails sections. still didn't care for the aliens plot\r\n\r\nexodus was like fallout but not fun. spending time looking around just to find scrap and lame gun parts. there's no fire swords or nuke miniguns (not that there needs to be, but when you're searching around that much for nothing of interest) took WAY longer to beat than necessary considering the amount of actual story points there were. great graphics except for some shitty textures and charecters eyeballs that looked ridiculous.\r\n\r\nand now the aliens aren't even mentioned??\r\n\r\nthat sludge tunnel was a terrible section. i had more fun in blighttown\r\n\r\ncompletely anticlimactic ending\r\n\r\ni don't know, this series gets so much praise but it wasn't for me and i'm glad i'm done with it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not have steam cloud.\nMakes you sit through super long launch videos every time you boot it.\nUses way too many different random buttons, terrible accessibility. \n\nThere is a cool game buried in a mountain of ****.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is ok, the gameplay is fine.\r\n\r\ncant recommand it though due to it's technical state. game crashes a lot. wont even launch if you have any wireless devices connected to your pc.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}