{
  "positive": [
    {
      "review": "STALKCAR. My Summer Zone. Escape From Carkov. Roadtrip Picnic. Play it already.",
      "voted_up": true,
      "votes_helpful": 59
    },
    {
      "review": "90% of the time, it's a relaxing game about driving through a mysterious stalker-style anomoly zone. The vibes are heckin cozy, the scenery is beautiful, the radio is playing, and everything just feels nice.\r\n\r\n9% of the time you're on the edge of your seat, trying to desprately protect the one thing that keeps you protected from the dangers of the zone. Maybe you'll be trying to get up/down a steep hill without sliding and crashing, maybe you'll be desprately trying to stop your damaged car from falling apart completely while carefully rationing your limited resources; and maybe you'll be trying to escape an anomoly without crashing into a tree, or worse, another anomoly.\r\n\r\n1% of the time your car will somehow be several dozen meters up in the air, flying at 80mph, completely out of control, and that will be the least of your concerns.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "A really nice driving based singleplayer game. I can't find any good reason not to buy this if it goes on sale and here's my \"best\" moment to sell it further. Could be spoilers about the game below so be wary.\n\n-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~\n\n[spoiler] I finally reaching the point of my exploration where I wanted to leave so I opened the gateway for home, The map goes crazy and all it tells me is to drive. The zone slowly shrinks as I approach the gateway and the Instability theme begins to ramp up and soon I'm in the yellow zone. The car slowly starts to deteriorate under me as I floor the gas through a highway-like road. \n\nSuddenly, I hit a spike anomaly and both left wheels get punctured. I struggle to keep the car in control as I can see the red zone closing in quickly through the rear view mirror. The theme kicks up a gear as the remnant hits 80 mph and the parts go into the red. I finally get through the gateway and take a breath in relief, only to ram the closed garage door. [/spoiler] 10/10 would drive again.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "What always begins as a peaceful, atmospheric drive through the woods inevitably turns into a Top Gear challenge episode where you've lost your driver's door and the headlights only work when you're accelerating.\n\nI love this game loop so much but I would recommend everyone to take a look at the gameplay and accessibility settings to fine tune the experience for their tastes",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is both incredibly chill and creepy at the same time, and I love it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Overall gameplay and especially the feeling of the car gameplay was incredible, it felt really well made. No part of the game felt \"plastic\" compared to its price point, this game climbs high as one of the best scary adventure games you can play. On top of that if you like driving and upgrading vehicles then you got yourself a good drive.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not sure what devs are doing every time I open steam, have a 16gb update for this game (happened twice in a single week), but game is running smooth for me",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Spookiest defensive driving course available and the driving physics are pretty accurate. Teaches basic troubleshooting and car maintenance while creating a pretty convincing alternative universe to explore.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun game with a great story, gameplay, and soundtrack i highly recommend playing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This Game is truly fun and enjoyment to pass the time i honestly would keep playing this even if i beat the game soon.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[i][url=https://store.steampowered.com/curator/35145066/] My review page.[/url][/i] \n[i][url=https://www.twitch.tv/nightserg] Follow me on twitch![/url][/i]\n\n[h1]The gist of it:[/h1]\nHad no idea what to expect going in blind with Pacific Drive, but I do enjoy taking risks sometimes with certain purchases, and it's safe to say that this was quite an enjoyable ride. \n\n👍 [u]The good parts:[/u]\n+Great atmosphere\n+Enjoyable gameplay loop(except the dlc)\n\n👎[u]The bad parts:[/u]\n-The main story is underwhelming\n\n[h1]Story[/h1]\nEssentially, you're a dude who ends up stuck in a post-apocalyptic zone filled with tons of deadly anomalies, and your only hope is the car you're driving, which is also a supernatural object. You'll meet some characters over the radio that have lived most of their lives in the Pacific zone, and they'll try to help you survive and escape the area while also uncovering some of its mysteries. \n\nThere's a lot of lore to find regarding all anomalies and the zone itself, but a lot of things never get properly explained, and the ending is quite unsatisfactory. It is understandable considering the mystery genre; however, there's a difference between leaving things ambiguous and just ending it for the sake of ending it. I don't think the game does a good job at making you \"think\" about the zone. As I explored, I just wished I would uncover some super secret entity, anything really, but nothing truly mind-blowing ever happens. The DLC isn't that great in explaining things; it just adds a plot about a certain character and their past, and that is it. \n\nStory rating: 7/10\n\n[h1]Gameplay[/h1]\nThe gameplay is essentially a survival game, similar to others such as Subnautica and whatnot, except the survivor is the car. The car is your life, and you must treat it exceptionally well. You'll have a ton of upgrades for it from the engine and its chassis to its wheels. The loop involves going on a run through several areas, looting all sorts of parts, and then escaping/surviving back to your main base. This loop can be endless if you wish, however, you can also just follow through the main story. \n\nExploration is a big aspect of the game, and you'll encounter a ton of anomalies that will make your life worse, and sometimes better. These anomalies can range from shocking traps to blocks of concrete falling from the sky. For the most part, it's a chill game as long as you loot and upgrade your car accordingly. Very rarely did I feel in danger, and I did not play on the standard difficulty that the game launched with, but instead I picked a harder one, which increased the anomalies and whatnot. \n\nLoot, upgrade, repeat, the end. If you don't like driving, then this game is certainly not for you. You'll be walking 20% of the game at best. I would not recommend getting the DLC as it does its own thing, and you'll probably get bored with its annoying new mechanic loop. \n\nGameplay rating: 8/10\n\n[h1]Audio[/h1]\nVoice acting is great, and all the characters that talk through the radio do a fantastic job at immersing you into their world. The music is licensed stuff, I think, but overall it fits well, and it is quite enjoyable to listen to, whether exploring or in your garage. \n\nAs for the sound effects, they're all pretty good as well, and a big part of making the game's atmosphere shine. In fact, I absolutely recommend you boost them when exploring, it'll creep you out a lot of times. \n\nAudio rating: 8/10\n\n[h1]Graphics, performance and tech analysis[/h1]\nOptimization is not that great, and the game is not exactly a demanding looker. It looks like your standard UE indie game, colorful, varied, and whatnot. The atmosphere is fantastic, though for the first hours when you have no idea what to expect. It's eerie and at times might even scare you a bit. It's a shame its consistency falters around mid-game towards the end, when there really isn't anything unexpected aside from new anomalies to encounter. \n\nHaven't had any major bugs, and for the most part, it was stutter-free. \n\nGraphics, performance, and tech analysis score: 8/10\n\n[h1]Conclusion[/h1]\nIt's a pretty good game, it doesn't do anything better than other survival games, but it's a safe bet if you're into the genre and love driving around. \n\n[h1]Final score: 7.7/10[/h1]",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Kellemes látványvilág, tényleg jól egyensúlyozott nehézségi fokozatok. Ha szereted a survivor játékokat akkor ajánlott.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surprisingly good, and adds a different spin on a driving game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game gets CRAZY difficult VERY quickly, and very dicey but that makes it absolutely, incredibly fun to play. one of my absolute favorites! x3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a great game, very well thought out, very well designed .. except for one quite glaring problem .. the Save Game system.\r\n\r\nYou can only save when you are in the Garage, and if you get stuck in a zone where you cannot leave because it is Stable and you choose to 'Suspend' on the Menu, it overwrites your last Save .. which means, you can very EASILY lose a good few hours of exploring, getting junk and progression for the Log.\r\n\r\nEverything about this game is great, really, except this one absolutely terrible thing .. and again, it's a terrible Save Game system set up by Developers who think they know better than the players of their games about what they want.\r\n\r\nThis was going to be a solid 10/10 game, but it loses a digit because of the crapulous save system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10\nWould (and did on hard after i beat the game) take my car through the Olympic Exclusion Zone again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly underrated, easily. Pacific Drive is an immersive crafting and driving roguelite, with clear inspiration drawn from the STALKER series but built in its own unique style that sets it apart. A clearly well designed gameplay loop takes the stage of the game. Where players set out to collect loot from the ruins of the zone to ferry back to the safety of their hideout to customize and accessorize their favorite stationwagon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Reminds me of Stalker crossed with a rally racing game. \nAtmosphere 10/10.\nSound Design 10/10.\nSolid driving mechanics and gameplay loop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While the main story is a bit short, the game itself is really clever. Give's a bit of Welcome to Nightvale vibes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unique, spooky, and challenging.  Definitely keeping my interest... Can't wait to get the station wagon hopping with racing stripes and mag wheels!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a relaxing drive through the zone.\r\n\r\nA lot of difficulties options for those who just want to enjoy the scenery... or be eaten by it.\r\n\r\nHighly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the atmosphere of Stalker and the gameplay of Jalopy or any other game where you have to maintain your failing car, this game is def for you.\n\nYou will have to repair and replace the parts of your car, race against time to escape or get to the next zone in this rogue-lite. With more challenges you to face, and upgrades to obtain as you go further into the zone.\n\n[i]tldr: drive and take care of your lemon in exclusion zone[/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun. I enjoy this SOOOO much, its features and mechanics are very cool and unique, I really find it challenging too, in a good way. I highly reccomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, if only there was a 2 player - my son would love to sit in the back seats and hide from all the beasties! Have some screens with stats and camera feeds to give him something to do and look out for me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably one of the most innovative survival games iv ever played. The environments are beautiful, the gameplay goes from chill to tense all the time, and taking care of your car can be tricky. The lore isn't to bad either, and it sort of gets you thinking. If your just now checking this game out, I 100% recommend you play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game map is the only problem with the game. They needed to make the roads a different color than the topography, and clearly visible even in a storm. It's artificial difficulty in a game that already has plenty of difficulty. Otherwise the game is 5 stars. Great sense of accomplishment even in Expedition mode. The restrictions in that mode are doable, and as you do more of them, get items to bypass restrictions which makes that part easier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great gameplay, lots of fun, good updates, the ending was a bit underwhelming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very fun if very complicated game. It goes super in depth with the game mechanics and the world building, which I appreciate, but it also does not do a very great job at explaining how some mechanics work. It definitely took some trial and error and internet searching to get 100% confident in how everything works, but it is worth it in the end and an overall very enjoyable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game. Very atmospheric. Very pretty. Do recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you like driving around solo , just collect thing , and repair your car and upgrade your car . \r\nAnd due with different problems and environment .\r\n\r\nIt is a Good game for you .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is simple but effective... it sets the mood. But the ending... I won't spoil it, but after such an incredible journey, I guess I just expected a bit more of a punch. It felt a little flat compared to the amazing build-up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game but it's weird how it's all broken up into small areas to explore. I mean, they give you this car but nowhere to enjoy driving it. And the controls for it are not intuitive.\r\nThis game still really needs some QoL features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! Beautiful, full of character, fascinating story, unique gameplay. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great, I love the story, the lore, the atmosphere, the gameplay itself. Its a well rounded game that I dont have a single complaint about",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been such an amazing masterpiece since even before launch and the devs have done a great job to continue taking care of it and creating new content like the DLC. I made my initial playthough earlier this year and really enjoyed the game but I moved on to other games afterwards. With the release of the DLC, and getting a new GPU, I decided it was time to take another run through the Olympic Peninsula. While I haven't purchased the DLC yet, I will say that going up in difficulty completely changes the game and forces you to think in many ways you never have. I just completed my second playthough on Olympic Gauntlet and oh boy did it kick my butt. It was some of the most fun I've hard with a challenge run through a game and it made me truly utilize all the various elements of the game. For anyone looking to pick up a new game and get absolutely obsessed this is definitely the game for you, and the infinite replayability with the addition of expeditions, and the devs continual dedication, means you get endless amounts of fun with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great atmosphere. Originally tried the standard experience but repairing out in the field was a pain and the rarity of some items needed to repair was annoying. Decided to look at the options since so much of the game is customizable. Huge props to the developers on that. The amount of things you can change is just amazing. Later upgrades in the garage made it obvious repairing wouldnt be as bad but with the option to auto repair and refuel after runs, adjusting fuel spawns in the world and vehicle consumption you can pretty much tailor the whole experience.\r\n\r\nA few down sides, \r\n-Scanning things doesnt always seem helpful? Or Im missing any helpful info under a bunch of flavor text.\r\n-Too many car parts. 18+ which was the main pain point that almost had me quit early on.\r\n-Loot isn't varied enough. Scrapping cars and looting the trunks, lockers, boxes, always the same loot. Making important items like chemicals which are (and shouldnt be) required for repairs more rare. Those are mostly going to come from chemical cabinets in mobile lab buildings. Removing that component from the repair putty would be nice.\r\n-Hazard effects on the screen are a bit strong for my liking. With how much customization there is to this games options the ability to lower the intensity of the screen blurring/distorting effects would be nice\r\n-Smart loot for cosmetic stuff would be nice. Gather Goldshell stuff for shop cosmetics is annoying when you get duplicates. I imagine theres enough cosmetics to have a unique one in every location but without some kind of bad luck protection its gonna take too long to be enjoyable.\r\n-I had a stash of goldshells early on cause I assumed they were a rare crafting resource. Would be nice if you could open them in the garage, like a device or room dedicated to busting them open. Only a few can  opened back when youre just trying to chill with the radio on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the Most Entrancing games i've ever played. Gushing Atmospheres through Various different biomes - corresponding Anomalies. Countless upgrades. You could play the game however you want it to, whether if its for the worst or for the best. its lowkey a Roguelite but with a car",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After finishing the game I found myself feeling like this game belongs in the \"games I wish I could play for the first time again\" list. Not necessarily the biggest fan of the story (though it isn't bad) but the gameplay and the soundtrack makes this a great time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is so hard to rate. I'm probably done playing it, however, I'm rating it with charity as, if you're okay with the things I point out I think you'll love the game.\r\n\r\nHonestly, it is so close to being one of my top games,... BUT...\r\n\r\nIt lacks depth where I desperately want it to have more. So, please note that every single point in the negative is extra dissapointing to me because it's SO CLOSE to being great.\r\n\r\nFirst, the format of the game. I don't mind the excursions based missions, BUT it would have been so much better as either a small open world, or, simpler and just as satisfying being done in a \"road trip\" format. Remove the home base. The car is the home base. This is what I expected from the game. The home base really tanked the vibe for me. Perfect vibe would have been to find a safe place to stop each leg of the journey through this place, set up your radio and your tools, and work on the car.\r\n\r\nSecond. The actual repairs are hit and miss. I love how simulation based it is, forcing you to do things step by step and creating a connection to the car, but I think they were too afraid to commit. I want more. Slapping putty on everything for repairs? Blah. I would have been pumped to remove the tire, apply patches, put tire back on, etc. \r\n\r\nThe driving is also simulation based, and I think hits exactly the right level of detail to fun ratio.\r\n\r\nNow to the biggest miss for me. Looting is painful. it has such potential, but it ends up being a massive grind almost immediately. I want to find things that make me excited. I don't want to repeatedly discover garbage represented by base icons. Oh look, my 500th rubber duck icon (rubber). Listen, I get that crafting comes down to using base elements (Plastic, metal, rubber, etc) to create other things, but more thought needed to be put into this to make looting not feel like an absolute chore.  By my second mission I already didn't WANT to stop for cars. That's not good. a game where you expect your player to spend A LOT of time looting needs to have enough exciting things thrown in with the hum drum nessecities to make your player think, \"Just one more trunk.\" 90% can be boring icons if 10% is really exciting stuff. Give us more cosmetics! Something. Anything. I'm working on the second mission, and I already can't remember anything special I looted that didn't have to do with a predestined mission event. Maybe this works out later as more blueprints start to show up, but I couldn't stick it out to find out.\r\n\r\nLike I said. This was SO NEAR to being one of my go to experiences. I want to love it. I could love it with a few (admittedly hard to implement) tweaks. If the things I mentioned here don't bother you, you MAY love it. Lots of people seem to. However, for me it just makes me sad that it's not a slightly different game. I literally went on a desperate search to see if something existed that WAS the game I wanted this one to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stalker on the wheels with excellent music on the radio. Just what I always wanted. If only we could have giant openworld instead of small junctions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not sure where to begin with this game, perhaps the only \"\"roguelike\"\" I've ever liked.\n\nThis game front-loads all the mechanics in tooltip hell for half an hour but the remaining 16 or so hours are a flowstate balance of chill driving and intense survival, weaved together with a story that's as complex as you want it to be whilst remaining powerful regardless, set in one of the best looking environments I've ever seen in a game, almost entirely off art style. Just about the only mechanical gripes I have are skill/gamepad issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, from the art to the story! Rather easy to learn mechanics. Soundtrack is lovely. The world is immersive. I did not expect just how much I would love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Initial Thoughts. After playing a PRE RELEASDE DEMO I wishlisted the game, and then bought it within the year. I have played it on Steam Deck a bit and it controls just fine and is a fun way of eating away some time but I have not yet completed the game or indeed progressed that much further than the initial demo. I am eager to pick it up again when I have more free time as it is very enjoyable and I am curious how the story progresses.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An oddly entrancing scavenging game with a satisfying game loop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pacific Drive is one of those games that lives rent free in your head.\nI've played this game for a while now, but I've come back to it for the DLC, and I have to say that it's must as much fun now as it was back then.\n\nThe gameplay is centered around your car, which makes things quite interesting honestly.\nThe gameplay is solid, but some choices, like when to hold the interact key and when to just press it, make the play a bit clunky.\nThe driving, which is arguably the most important gameplay aspect, is super fun and feels good, the sections without the car are good as well.\nThe crafting is good, nothing more to say about it honestly.\nInventory management is solid, but a liiiiitle bit clunky/whacky at times, but nothing major.\n\nThe story is... limited, shall we say. It's explained through the radio for like 90% of the time, a bit of in-world story here and there while you're out and about in the Zone.\nBut it's fine honestly, the characters are good and the dialouges are really fun at times.\nBut don't expect the most in-depth story with cutscenes and stuff.\nThe appeal of this game is it's gameplay, and it does that quite well.\n\nThe graphics look good, but the performance is a bit on the slower side.\nThe game renders three mirrors on the car, which is quite taxing, so there goes a good chunk of the performance I suppose.\n\nThe game is super fun overall and I can't recommend it enough.\nIt's one of those games you just have to experience yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. The game settings let you actually choose in detail how hard you want the game to be. And the music is on point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For what it is this game is alright. If you like tinkering with your car irl you'll feel right at home because the game is all about tinkering with your car, blinging it out etc.\nBy far, my biggest gripe with the game are performance. Even if you meet the requirements, even if you crank everythig down to low, the game refuses to run smoothly and stutters are abound.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story rich game, that has this \"driving and fixing your car while exploring\" vibe just right",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I havent played much but this game is already just a blast, it's fun, replayable, very immersive and i love the car mechanics. and also the custom radio songs is just such a great feature. absolutely amazing art style and direction. very very good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really like the game, It is very well optimized and runs decently on lower end pcs, would recommend playing in a darker environment for better immersion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't skip on this absolute gem, It looks amazing, sounds great and feels like a thriller with its atmosphere!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god, it's about time i got around to reviewing this. long overdue, i'd say.\n\ni honestly didn't know what to expect going into this game. saw a friend stream it for a couple hours, and thought the premise was interesting enough to take a look for myself! i definitely was NOT expecting the main plot of a game centered around keeping your car in tip-top shape to survive The Horrors™ to make me cry three times in the span of an hour, however. but here we are!\n\nif you're on the fence about getting it, and enjoy rich story, interesting characters, funny little doodads to trick out your car with, and stopping every couple hundred miles to change your tire in a storm of unfathomable danger, then this is DEFINITELY the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play this game. escape from carkov... i mean pacific drive is amazing! at first i was a bit overwhelmed and upset at all the \"bugs\". my stupid car horn would honk when i closed the trunk of my car amongst other things i precieved as bugs. they were in fact a really cool and funny game mechanic and not actually bugs at all! this game has so much personality and is so great. best played in a dimly lit room for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyed everything about this game. No complaints. Plenty of settings for adjusting difficulty if that fits your fancy as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a good game, I love the progression, the retrofuture aesthetic, the story is great. Is it perfect? No. Is it a blast no matter how seriously you take it? Certainly. Solid 8 or 9 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A wonderful experience, scenic, intuitive, and something my friends enjoy watching along side (from the back seat) as we travel. Plenty of moments that can put you on the edge of your seat. I personally would say that the whispers in the woods dlc should be played after the base game as yes you may understand the game mechanics and your car by that point but the DLC puts a spin to it I found quite enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I live on the pacific in Canada, and I can confirm that this game is 100% acurate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An exploration game full of weird, roguelike, very absorbing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So I stayed away from any gameplay and playthrough to experience this myself and boy, was it worth it. It has the right mixture of My Summer Car and Stalker, where you start barely scrapping together and getting better each run.\r\n\r\nGet it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kinda regret not playing it a year ago when a friend introduced me to it. I thought i wouldn't really like this game because i'm not a big fan of \"car games\" or cars themselves. The game was overall fun and enjoyable which i didn't expect (apart of the guessing the quirks, i can't imagine doing it without infinite guesses)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It really reminded me of the book Roadside Picnic. It's a fantastic game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am really enjoying some of the game mechanics (pun intended) this game has. Runs smooth, challenging without being punishing (so far!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Un véritable coup de coeur ! \r\n\r\nDe base, je n'apprécie jamais les jeux de voiture (un peu comme les jeux de foot..). Non pas que je trouve ça naze, simplement, c'est moins mon style. \r\n\r\nMais ici, c'était un véritable plaisir de prendre soin de ma bagnole. J'avais envie de sortir du garage vraiment pour aller chercher du matos et améliorer ma caisse haha. \r\n\r\nLa boucle de gameplay m'a convaincu à 200%. \r\n\r\nJe dois avouer que c'est parfois répétitif, parfois ça manque de diversité dans le bestiaire et au bout d'un moment, on a tout simplement plus peur de rien et d'aucune situation. Certes. \r\n\r\nMais dans l'ensemble, c'est une véritable expérience unique que je recommande à 200%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic imo, its chill but with enough energy and \"Oh f--k me, I misjudged that,\" moments that you get excitement out of it. Then you get into customizing you car, no spoilers but it goes FAR from what I can tell, both in style AND function, the decals are personal fave to try out cause they can effect the entire vehicle! Be warned though the anomalies kinda team up by accident I think, I have been forced to drive through some pretty nasty ones cause the alternative is too long, steep or dangerous. still 9/10 well worth the price!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and hope they give it so much more love (wouldn't mind sequel with familiar voices)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, very different. The gameplay loop of looking for components, scanning anomalies and upgrading the different parts and equipment. It's compelling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The driving is great, the atmosphere is incredible. The ending felt a bit anti-climatic but overall 9/10 game. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an indie masterpiece. It's ALMOST cozy, and man... what a game-loop. Oddly immersive and wonderful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the overall feel of this game. And it's so in depth, I feel like I could play this game for months, trying to get the best car ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time, the atmosphere cannot be beaten. The soundtrack is great, visuals great, there is a mean old woman, Live Laugh Love #MyCar. I love my car....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pacific drive is a very fun game. I'm quite addicted you could say. Do know that the game can be difficult in some parts I've come to find out but it's apart of the fun. \r\n\r\nDefinitely a game I'd recommend to check out. \r\nSafe travels Driver.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay loop of driving around, finding weird things, and upgrading your car is fun for quite a while. The story is… there. It ends up being a radio drama of flat, annoying characters that could have talked way less and given us a much better story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lovely game. While not perfect, it has its flaws and I will be honest it is not a game for everybody, if you like fast pace action then don't buy this. It is an amazing game but only if you love games like it, it can be calming at times while being headache inducing at others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i suck at scary games, evident by my hours. I have completed it once and working on a new playthrough now, but because i am a total coward i can only play so long before my heart can't take it anymore and i have to put it on hold for days/weeks/months before i'm ready to play another couple of hours. \r\nyet, i love it. \r\ncruising down the road to my favorite tunes, scavenging for scrap that'll help me make stronger parts so my car-buddy and i can keep doing increasingly more insane stunts, because i'm a shit driver, probably, and then find just the right song to abuse the speed pedal on while chasing the giant beam of light that is life? Yes please. \r\n\r\nnote i haven't mentioned the anomalies. they aren't what is terrifying , not for me at least. some i find annoying, others rage inducing, most are just adorable though. kinda like how when little kittens stick their claws in you to climb your legs, you may have that second of finding that torture more than a little irritating, but then you look at them and their little faces all eager for your attention and you go \"aaaawrh\". That is my relationship with them all. \r\n\r\nno thanks to car quirks though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorites. The atmosphere, gameplay, and music are incredible. My only real complaint is the optimization. For a game with this visual style, a GTX 1060 6GB should be plenty, yet it still struggles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down one of the most innovative and creative survival games I have played in a long while. I haven't played a survival game this fun since Subnautica definitely worth every penny especially considering the price and lack of micro transactions and the fair price for dlc makes this a game worth playing. Loved it so much I bought it for my PS5 as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GADDAMN.\nI didn't know I still had it in me to enjoy games as much as I enjoy playing Pacific Drive.\nI thought my passion for gaming was DEAD, but it proved me wrong.\nClose to the end, and you bet I'll try replaying in Hardcore mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a lot of things to say about the game but not a lot of time\nI have yet to play a game like this.\nDoing the extraction phase for the first time is one of the most coolest and memorable experience i've had.\none of the times, my heart was racing, and it felt so cinematic.\nit feels as if this game is alive...\nthis game has a special place in my heart.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After the 100 hours I have placed in this game, I can gladly say I highly and I mean HIGHLY recommend this masterpiece, It is and has been one of my favorite games for a long time and is was so afraid of beating the game because I didn't the fun to end, so today i finally got every achievement and finished the game. This is by far one of the best games I have ever played and 100% guarantee you that if your looking for a good horror game that'll last you a long time, this is your game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a generally good time with Pacific Drive. The world-building is really the star here - that twisted, surreal take on the Pacific Northwest feels alive, unpredictable, and full of weird details that make exploring genuinely fun. The whole loop of scavenging, upgrading your beat-up station wagon, then heading back out into the zone stays satisfying pretty much the whole way through.\n\nVisually and atmospherically, the game absolutely nails it. The lighting, weather, and sound design all come together to create this eerie, creepy vibe that’s weirdly chill despite all the danger. Luckily, when the story wasn’t grabbing me, the atmosphere totally did. It’s just really fun experiencing this world, whether you’re creeping past anomalies or just speeding along the roads while listening to the radio.\n\nStory-wise… yeah, it didn’t land for me. The game leans so heavily on radio chatter and audio recordings to explain everything that, after a while, it just feels like background noise. At some points I ended up zoning it out altogether, which made it pretty hard to care about the narrative or the characters. Same goes for the spooky DLC - great mood, but the plot feels paper-thin.\n\nOn the bright side, all the recent updates added a lot of replayability, and I genuinely appreciate that. It gives you more reasons to come back, try different builds and challenges, and push your luck on runs. The game is so much better for it.\n\nVerdict: Not perfect, especially on the story front, but if you enjoy survival games with a unique setting, great atmosphere, and a satisfying gameplay loop, Pacific Drive is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a really good but short story and is great to sit back and relax to when there isn't something crazy going on.\nThe gameplay loop can get boring at times but the artstyle the customisation and the driving is great, a very special game for me cause it was a lot of fun playing it and finding some more story pieces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Somehow this game found balance between meditative resource gathering and thrilling survival.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with roguelike elements. Gets repetitive but hopefully the DLC gives it new life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay game is a little finicky and a little rough around the edges but overall not bad just not my thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the story. Alternate history centering around sci-fi \"horrors within your comprehension\" and paired with journalistic world-building made for a lot of suspenseful lore.\r\n\r\nI didn't enjoy the Expeditions, and much to my chagrin, you do not get anything meaningful from completing the 20 unique difficulties. The only lore here is [spoiler]Francis's research was legitimate and the ZETI is proof that the zone can be dynamically mapped.[/spoiler] Do not do what I did and waste hours grinding purple-tier car parts to reach Expedition level 20, just to lose them all in one fell swoop. Play any other rogue-like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game that blends driving and survival. And it does this beautifully. The anomalies will annoy you at first (that's what they're designed for anyway) but soon you learn how they work and use your experience to navigate them. Driving is a real pleasure in this game, even when you go offroading (especially when you go offroading). The only gripe I have with the game is that the story feels a little weak, but that's a matter of perspective and it would not decrease your enjoyment of the gameplay at all. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People could enjoy the survivor elements to it only if they care about the drive pressented in game.\r\nI just didn't feel connection with the car style and the art in general.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a weird vibe, but worth the time. \r\nThe story is solid, and despite the lack of physical contact you do get a sense of the other characters. \r\nMechanics have a few weird quirks on deck, but nothing game ending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game changed me. I love it as much as Tobias and Francis loves each other.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it would be awesome if the option to have the car needing to have some battery in order to start to be added to the settings menu kind of like the option for needing the car in park in order to start the car",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyable, unique experience. Grabbed me right from the get go. Enjoyed the gameplay loop slowly improving the car and building it to suit my style. Great vibes all around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic game, i dont know what else to say than this is one of the most fun games i've been obsessed with lately",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may be not for everyone, but I do enjoy the loop of gathering resources, evading anomalies and upgrading the car.\nMusic is pretty fire too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was such an amazing game. If you are a fan of driving games I highly recommend this one. It was also awesome that this game has dualsense support, specifically with adaptive trigger. It made the experience so much better. \n\nThis is just overall one of my favorite driving sims out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story, insane graphics and so addictive! Def worth a try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Fun, interesting story/lore, and great visuals and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so calming for some reason. i love just driving around and collecting supplies. also the car looks so detailed like your driving a car in real life, 9/10 great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my go-to game for when i want to unwind at the end of the day.  Which is kind of a funny thing to say because one minute you're driving around the Northwest enjoying some dimensional anomaly tourism, and the next thing you know you're barreling through the forest desperately trying to locate the exit before an energy field wipes you off the map.  There's a lot to see and do, and the car customization options are seemingly endless.  If I had any gripes I guess it'd be that the controls feel a tad over-complicated so if you haven't played for a while you kinda sorta need to re-learn things.  But other than that it's a good time.  Just watch out for exploding mannequins...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty chill and atmospheric driving game. The vibe of the game is its best feature with its mysterious, supernatural exclusion zone setting. Its also fun to get the different car parts and turn the station wagon from a piece of junk into a makeshift tank. The story started off interesting but it kinda lost me in the climax. One important thing to note is the gameplay loop is relatively static throughout, so if you don't like driving and scavenging for parts in the first hour of the game than you aren't gonna like it throughout the whole game. Its worth checking out if you are into the supernatural sci fi setting and like relatively chill experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with alot to explore, easy enough to learn but enough depth to captivate you especially if you let your car consume your brain ;3",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "TLDR the gameplay loop is incredibly boring and left a LOT to be desired. I kept pushing through the story hoping that something would change, but never did. Every mission was just mindlessly gathering resources in a pretty uninteresting world and then using them to pretty minor upgrades to your car.\n\nI will say the atmosphere is incredible, and is the entire reason I bought the game in the first place. The maps are gorgeous and the sound design is extremely well done, which only makes me more disappointed in the complete lack of substance in the gameplay. If there was more to do and more variation in the world the game would absolutely be 10/10.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "[b]I desperately wanted to love Pacific Drive. It's a crafting, driving game set in an interesting and mysterious world. There are some truly amazing moments, and well thought out mechanics - but a huge chunk of the game is grindy, laggy and repetitive.[/b]\n\n[h3]What you'll want to know:[/h3]\n[list][b]Unoptimized[/b]. Shadows set to low fixes it, but makes it look awful.[/list]\n[list]If you get stuttering, try the fix in [url=https://www.reddit.com/r/pacificDrive/comments/1egcv7u/pacific_drive_performance_fix_the_real_deal_no/]this Reddit post[/url]. Crazy that this has to be done manually.[/list]\n[list][b]Controller support is great[/b], but a lot of the analogue control inputs (IE starting the cars engine, releasing handbrake) require manual selection; there are no hotkeys, so it makes it [b]slow and clunky[/b] unfortunately.[/list]\n[list][b]Screenshots make it seem like a horror game, but it's not;[/b] it's just set at night quite a lot.[/list]\n[list]The difficulty options are meaningful. I recommend vibe checking an hour or so and restarting harder/easier if necessary.[/list]\n\n[h3]Things I loved:[/h3]\n[list]Driving the jalopy at night through the rain is peak.[/list]\n[list]The game has some great ludonarrative cognizance, specifically about you, the player, and the Jalopy.[/list]\n[list]Minor mechanics - such as the quirks - are fascinating.[/list]\n[list]There are some amazing moments - such as escaping zones - frenetic and tense.[/list]\n\n[h3]Things I liked:[/h3]\n[list]Despite how it's presented, I really liked the story. The game world is very well constructed.[/list]\n\n[h3]Things I disliked:[/h3]\n[list]Some of the game mechanics are pretty poorly explained.[/list]\n[list]There's weird thematic dissonance. It's superficially scary, but also quite meta, and sometimes comedic. It makes the world less immersive when you know the world is kind of just a facade.[/list]\n[list]The way the story is presented is not good. I'm not a fan of characters I'll never meet talking over me at each other.[/list]\n[list]Progression grinding is badly paced. I get that you're slowly expanding through the game world, but you have to do the same first areas over and over.[/list]\n\n[h3]Things I hated:[/h3]\n[list]The runs last way too long and they're way too repetitive, both in-run and per-run[/list]\n[list]I can't excuse the performance. It's so bad honestly. Please fix this, devs; it overshadows the game whenever it's mentioned.[/list]",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Usually don't leave a review, but since the dev wanted to highlight the fact we have to basically re-download the game every time they update something, and chalk it up to \"re-organization of game files\"\n\nhow about re-optimize your game so that I don't have to waste my entire internet bandwidth just to download your game. Will never recommend this game until updates are appropriately sized.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I heard a lot about this game from friends and I tried to like it but I fell asleep three times playing it. The UI is clunky the menus and actions are just not very intuitive. The game lacked any feeling of danger or thrill I just felt like I spent most of my time listening to voice narratives and ripping apart rusted junk older cars to get goop to build a car I didn’t care about. I guess this game is not for me.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "I want to like it so bad. but I wish the maps had like 3 times the empty space. I want to drive damn it, not get out of my car every 30 seconds to collect junk!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game. Everything about it resonated with me, but there’s just too many bugs for it to be fun. I can only imagine this is unbearable on the higher difficulties.\n\nA major one is that the route planner frequently stops responding to input when you’re ready to leave the garage. Happened in the tutorial and I had to watch some videos to ensure I wasn’t missing something major. Then now and again, it’ll just happen again. \n\nThere’s so much to like here, but I can’t.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Seems nice at first, but i cant even replace a tire. \nThanks for nothing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game. Has a LOT going for it on everywhere but the gameplay loop itself. The atmosphere is amazing, the world itself is nice, the concept itself is cool too. But something about the issue itself is so... intentionally grindy, where it stops feeling like I'm doing a thing to progress, and instead doing things to maintain. I WANT to feel safe in my car. Not like \"ugh I'm gonna drive it and break it what a pain\" It needs more. I hope it gets more",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Pacific Drive dares to ask, what if STALKER was in a car, and it was a bit reddit.\r\n\r\nThe Good:\r\nThe wish-brand zone itself is very well represented as a living breathing character, and the temu-procured anomalies are inventive and well realized. I was impressed that they've managed to make a game where your main obstacles are \"passive\" and environmental, yet also feel like both benevolent and malevolent actors in your environment. The car is fairly fun to drive and doesn't feel too \"authentically\" weighty nor like you're driving a bouncy castle.\r\n\r\nThe game is very much about preparing and preserving your car, which is essentially your character, and taking calculated risks vs reward. That, and the mystery of the zone itself is very compelling.\r\n\r\nThere will be moments where you stop the car and get out and stare at the wind in the trees in the rain and you'll notice in the corner of your eye that a petrified human silhouette resides there now where one did not reside before, that is compelling.\r\n\r\nThe Bad:\r\nHowever, if STALKER has shown anything, it's at its best when it shuts up. Pacific Drive demonstrates this aptly. A lot of the fun of gradually unravelling what's happening yourself by context, is ruined by both characters talking over each other incessantly, and putting all the details in a big (highly unpleasant to use in-game appendix). This is theatre: plays do not have appendices, if you have to send me to the wiki to get the context, that's a failure to storytell. Even better, just don't tell me, I don't need to know, it's often better that way.\r\n\r\nIn a similar vein, the misremembered 1980s stranger things ghostbusters-reboot portland-vegan-bookstore thing it's doing with its aesthetic, I can kind of take or leave. I see what they were going for, I don't think they completely sell it. The game is trying very hard to pull a Portal, but it is not pulling off a Portal. It's not quite finding the narrow sliver between eerie and farcial.\r\n\r\nI don't particularly care for some of mad-science aspect of the game's setting or aesthetic, I think a lot of it robs the player of feeling responsible for their own survival, ends up feeling more akin to magic than ingenuity, and exists more to justify the game's mechanics than for story reasons.\r\n\r\nThe Ugly:\r\nLastly, I'm sorry to say gentlemen, that this game has terminal rogueliteis. Many many games with great concepts and even partially great execution have fallen prey to the allure of \"your potential adventures are unlimited\", only for every adventure to feel like the same blended, grey porridge. Game feels a bit thin on complexity? Toss a few random status effects in there, slap it on the ass- she'll be right.\r\n\r\nI would have preferred an eighth of the content presented to me a series of stops on a linear roadtrip, with more time to smell the roses and 400,000,000 fewer things to pick up. This is essentially an inventory tetris crafting game where the playable areas or \"junctions\" on the road are the rooms in the dungeon, and you can teleport home if you have enough of the game's rare-resource.\r\n\r\nYou can feel the hands of the designer artificially creating arbitary limitations to gate your progress and pad it out a bit more- hurrying you through to create a sense of artificial tension. I was disappointed that I couldn't pick a junction to explore and just drive there based on the routes on the map- under certain circumstances you'll just have no exits and you'll have to teleport home.\r\n\r\nThis essentially exists to make sure that you're returning to your base to recuperate and upgrade, picking up new story and building up to progressively longer runs rather than just driving as far as you can go. I generally try to refrain from being critical of a game for being \"grindy\" because it's reductive and passe- but it's very much at odds with the sense of mystery the game is trying to project.\r\n\r\nYou'll find that a lot of the \"interesting choices\" you're presented with gradually reveal themselves to be mandatory choices. Rather than taking in what you're seeing, you're gonna spend a lot of time anxiously looking at your inventory to ensure you got what you need before hitting a dead end and coming home- rather than being in the moment or choosing to be a pioneer and press on into the unknown. \r\n\r\nAlso, performance is a bit ropey for how it looks, I think this is a probably an unreal engine thing more than a Pacific Drive thing. Sometimes the game is very pretty and very striking looking due to good stylistic choices and running fine- other times you'll be standing inside your garage wondering why your temps are a bit warm.\r\n\r\nBuy on sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game saves are so few and scarce. In-game instructions lead you into certain death and therefore waste of your playing hours. The concept is nice but it teaches you the hard way; you lose your time...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Amazing casual game focused on driving and exploration that i just cannot recommend with the horrible performance and lack of response from the devs about any of the game breaking issues plaguing the majority of the player base.\n\nThese money hungry grubs of a dev team would rather keep releasing dlc than fix a single performance issue.\n\nEven if you have a rig with a 4090 or any more powerful graphics card your fps is going to dip constantly and the stuttering and screen tearing is utterly unbareable!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Repetitive grindy gameplay.\n\nIncredibly clunky interface and controls. Some of the workstations are cluttered and filled with all kinds of nonsense, that makes using them a pain. Very clear case of console stupidity in design.\n\nWorst of all is the constant unending yapping from people you don't give a single F about - especially because they are so very unlikable. Would be a thousand times better if the npcs were all just deleted from the game entirely. The yappers removes all mystique and constantly being berated and insulted by one of them makes me actively not want to play.\n\nTutorial is waaaaaay too handholdy with \"do this, then this, then go here, do that, and then this, etc.\". Would be a massive improvement, if you could just turn it off and let the user do things on his own.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, but holy fuck, it runs so poorly it's nuts. Most of my playtime has been on PS5, but I've tried playing it on my laptop as well. They need to hire someone to optimize the game. It's such an excellent game, I really wish I could give a positive review, but with the performance somehow getting WORSE in the last few months, not better, I have to leave a negative review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Makes even the hardest games out there look like a walk in the park. You get 0 explanation about anything in the world and if you die you basically start from waaaaaay back. I dont recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i really like this game unfortunately the dlc has broke my save with a infinite load screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So confusing with no real tutorial on how to do anything. If you have to try to consult the internet within five minutes asking 'how do I...<do any basic thing>\" then it is not a good game. Interesting premise but literally no guidance on how to progress until you are just hitting keys like a monkey hoping something happens. I give up as life is too short to give time to a game where the only challenge is figuring out how to do ANYTHING.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It seemed like a really relaxing first 5 minutes and i was enjoying it until about 30 minutes in of constantly getting out the car to collect something to then get in the car for all of like 4 feet and get back out again to collect craft replace and not really get any of the driving experience part of the game.\nReal let down for me\nReal grindy feel to the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seems nice at first, but i cant even replace a tire. \nThanks for nothing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game makes no sense, having to google every 3 minutes wtf anything does, how to use any item or install anything on your car.\n\nthe constant yapping during the most intense moments, making me unable to listen to a single thing being said does not help either",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible optimisation, every time I try to play it needs a 10GB+ update.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "What is it about modern games where they just don't tell you where to go. I understand handholding can be bad, but I don't play God of war anyway, Just tell me where to go, stop wasting my time on deciphering what the fuck you want me to do",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a thumbs down for me, and I likely won't reinstall or continue playing.\r\n\r\nI loved the atmosphere and overall premise. Patching together an old car, and driving around the map had it's appeal, but it gets old fast. The story line isn't compelling enough for me, and inventory management takes far too much effort.\r\n\r\nUltimately it was the overly cumbersome inventory management and constant \"rush\" to gather materials, and escape the harsh conditions of the zone, to return to the safety of the garage that ended it for me. \r\n\r\nHad there been more whitespace to enjoy the journey without the \"constant feeling of impending doom\", I may have been able to look past the awful inventory management, but I also recognize that the \"constant feeling of impending doom\" is likely what some players enjoy, so to each their own.\r\n\r\nIt wasn't for me, although I did have fun patching together that old wreck of a car. (I use the term car loosely.)\r\n\r\nHaha - Peace and Love!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a fun and engaging story, but I want more and there isn't more. I hear the DLC is lame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Man this looks like a great game, but I can't get past the intro because keybinds just arent working.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pacific Drive looked like the perfect game for me, since I love non-AAA building, crafting, survival, exploration titles.\n\nBut it turned me off pretty hard very quickly. First it was blastic that honestly annoying music into my ears without an apparent ability to turn it off... I was looking for a radio control inside the car, since it sounded like that sort of a music, but haven't found any. And then everything just felt so controlled and limited, sorely lacking the player freedom I'm used to. Even certain objects were uninteractable until the annoying voice told me to do something. I didn't like the voice acting btw, I think it's annoying. I also hated the inventory UI design, with those god awful icons.\n\nThen, the final blow was when I realized that the gameplay loop is that annoying \"mission\" system where you have to do separate, fragmented excursions, instead of having a properly explorable game world. I think the game description and the videos should explain and highlight this fact a lot more. Too bad, because the environmental design is beautiful, and the vehicle handling was surprisingly superb for a non-racing game.\n\nIt's definitely not a \"Subnautica on land\" experience for me personally. Subnautica has incredibly amounts of player freedom in that beautifully crafted world, which you can freely explore as a cohesive experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yeah, I donno, fuck this game.\n\nJust played it for an entire afternoon and i have no idea what the fuck it wants from me.\n\nThe menu UI is terrible. It's samey, difficult to navigate, and needlessly categorised beyond usefulness.\nEvery time I was left to do something the hardest part about doing it was finding out what the fuck it was I was supposed to do. \"Go to town.\" No blip on the horizon, no marker on the map, nothing labelled \"town\" anywhere. Drive to the end of all the roads, can't access the road I suspect I'll need to be on because of barriers. Fuck around in the shop then OH! Right! The route planner! Proceed to plan the route then the bay door opens to the previously locked out road I needed to go on. \nMission: EAT THE CAKE.\nWhere's the cake?\nI've looked everywhere for the cake!\nI've tried thinking outside the box for the cake!\nWhich cake is it even talking about?\nOoooh, you mean I need to find the recipe to make the cake before making the cake so I can eat it!\nMission is to do something you can't do before doing something else yet, which you aren't directed towards at all.\n\nEverything felt tedious. I feel like this has so many good things going for it and it just got in it's own way. Why the fuck do I need to SCAN EVERYTHING to know what it is? And beyond that, I have to open my menu, navigate to the logbook, then navigate to the appropriate tab which I only really have to guess at SINCE I DON'T KNOW WHAT IT IS YET, then scroll down until I find the thing before finding out what it is. The dots on the tabs indicating a new item in there are helpful, and would be a lot more helpful if they went away after you opened all the new items. Most of the time they did/do, but sometimes they wouldn't even after exhausting every single tab and sub tab available.\n\nI didn't realise after planning a route that most of it would be fast travelled. Why did I come out of fast travel with my vehicle health so low? What the fuck happened? Is there a way around that? I just spent however long tediously scrapping everything I could and crafting what I needed to get my car in top shape. Is this just the price to pay for playing the game?\n\nThe other characters are so far only over the radio, I don't expect that will really change, but so far they're already a little annoying. It's one thing to be doing fetch quests for an NPC, it's another for it to be a mildly ambivalent voice with nothing to lose which is outwardly annoyed you even exist and could care less if you fail. I've been given no reason as to why I'm here or how I got here, either the story means nothing and just cut to the game play or explain what's going on in a more concise manner. \n\nI still don't know what harvesting the orange nodes on the map and setting them on the thing in the passenger seat does. Absolutely no idea. It charges something? What does it charge? why is that useful? Can I store more than one charge? I have no idea. What about the red nodes on the map? Why the fuck is it so difficult to find answers to these things? I'm SURE the dialogue tells me or at least hints at it, but I need to read things, sorry! \nAnd boy! do the item descriptions or whatever in the logbook sure go out of their way to make you feel like you're on your own and wasting time. Instead of telling you what it is and what it does you'll get some flavour text in the form of a transmission from someone earlier. If you're lucky they'll include enough details for you to know what's what you want about it. Can it be scrapped? not sure. Is it a part I just can't use yet? not sure. Is it important? no idea. Is it dangerous?? shrug. \n\nI found an anomaly with an inventory, scanned it, looked it up, found some transmission text about it being friendly, etc. That's it. Okay, well maybe it upgrades items? I put some materials in it's inventory. They disappear. \n\nFuck me, fuck this game. I bought this ages ago and have been looking forward to playing it and cannot adequately express my disappointment. \n\nHours in and it still feels like it's micromanaging a tutorial to explain a menu they've exploded into the world. \nWhy, WHO thought it was a good idea to have to first-person take all your gear out of your car storage, place it in a box, pick up the box, carry it over to a wherever you want to story your shit, then put it down, pick up the items in it, open the storage container you've chosen, and place the items in there? On what planet do players prefer this over simple menu swapping? I don't need to experience the tedium of owning a 2000sqft mechanic shop with shit laid out on opposite ends. \n\nBusted.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "You'll spend more time downloading \"small patches\" than you will playing. The small one today is *merely* 16GB. The one yesterday...also 16GB. Utterly incompetent.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not for me. Driving the car is too difficult to be fun. It's a lot of work following a very linear path. I'm not a big fan of crafting/survival, but I'd heard good things. The graphics are so basic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want a Roadside Picnic road trip.\nI got timed resource collection and crafting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game a year ago and deleted it because the game is horribly optimized\nNow I thought to give this game a second try after a year sure it got several updates might fix it right?\nNO ... This game still garbage ..... on medium settings still barley gives me 25fps and I playing it on Lenovo legion go\nStill regretted that i didn't refund the game at the time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wasted 60 minutes trying to save and couldn’t figure out how to save. Read online you need to be at a mechanic place and I was.\nWaste if time and will not play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very poorly optimized. Gameplay is pretty subpar.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This has a left wing political agenda baked into the game, it is very buggy and the game crash's constantly. It is extremely grindy with a word salad for most of the story.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The moment I saw the woke(+BLM) cr*p in the detailing station I could not recommend it.\nI mean WHY??????\nIn a game like this why the HELL do the devs have to put the woke(+BLM) cr*p in???????\nAlthough the game is fine the UI is a mess.\n4 example when you research something the game:\n- kicks you out from the research machine\n- you must watch an animation of arriving of the add-on\n- you must watch a reading animation after you pick up the add-on\n- then you have to go back into the research machine \nAnd ofc you have to go through this stup*d process again and again and again!!!!!\nBuy it only at sale (50% or more)!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Keep crashing after encountering the fkn manhacky enemies, that stick to your car. \r\nLiterally everytime they show up, I crash, sometime while they're around. Gamebreaking bug like this with as much dlc as they have released is just lazy and inexcusable. Lost so much progress im actually tweaking rn holy shit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "spend 2 hours looting zone fully loot make sure cars perfect and ready to go (i have tier 2-3) on every item. finally charge the arc device!! instantly die to zone because it's speed is just random. lose all the loot you looted and spend 10 minutes fixxing your car and all items and hope you get a better zone speed next time. horrible mechanic. (spend 3 hours moving to the new zone finally as your about to get their your car gets a quirk that instantly draisn your battery legit soft locking you so you have to die on purpose congrats you just lost all your loot and a few hours. this games mechanics are horrible MY GAMES NOW SOFT LOCKED great. i can't fix this quirk as im out of attempts on the machine and i can't recharge my car",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So many woke flags, seems this game support trans terrorsim.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to love this game - there is much I do love about it! However, almost half my time playing this was me realizing there was a bug that was totally preventing my progression and not finding a solution. As such, my journey ended waaay to early by factors out of my hands.\r\n\r\nWill happily change my recommendation if the issue is fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Listen to the hype and gave it a try. Wish I hadn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "was hyped for it but its kinda boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "$30 to crash your pc every 10 minutes. I have a mid range pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hey Steam, nobody is going to read this so why do I have to write anything?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrible steam deck performance",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Atmosphere > Gameplay",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "not fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"I guess we're walking some more...\"\r\n\r\nPacific Drive boasts a really neat concept at first glance: a lonesome road trip through the haunted roads of a mysterious walled-off exclusion zone, where the player must evaluate their routes, scavenge for supplies and maintain their vehicle in order to achieve their goals and escape.\r\n\r\nBut once the game gets going the reality of what this game offers turns out to be something rather different. Pacific Drives gameplay quickly boils down into a fairly short and repetitive cycle. You spend an inordinately long time fixing up and maintaining your car in a garage, then drive off. You then drive for a distance so short you'd probably have made it faster on foot before having to dismount to explore and collect stuff, then hop into the car again, drive another short hop and repeat, repeat, repeat.\r\n\r\nThe act of turning the engine off, putting on the parking brake, opening the door, exiting the car, closing the door and doing all that again in reverse order is what most of the time in this game seems to be made up of. It gets tedious quickly and the rewards gained don't really make it all feel worthwhile.\r\n\r\nThe game tries to spice up its gameplay with obstacles and anomalies, unpredictable dangers to the players progress, but these also become known, repetitive and dull very quickly as it becomes clear the challenges are quite static and easily avoided. Sure, you'll get zapped or bumped from time to time to ensure you'll need to repair your car or replace a part, but it never really felt truly threatening as the difficulty level seems quite low by default.\r\n\r\nStory and character mostly come via radio conversations you get to listen in on as the silent protagonist. Scientists who chose to stay inside the walled off Zone ramble off technobabble, bicker and argue and act shocked and surprised at every point of story progression, but their lack of direct involvement in anything makes what story and drama there is feel distant and hollow, the characters forced stereotypes crafted to fill out base archetypes.\r\n\r\nWhile I did complete the game, it left me feeling quite disappointed and exhausted, and I can't really recommend Pacific Drive in the end. The game never cashes in the promise of a haunted road trip, but instead turns a fairly basic scavenging game into a tedious hassle with the inclusion of a car that feel unnecessary and tacked on, rather than feeling like the glorious centerpiece it should have been.\r\n\r\nPlaytime: 18+ hours (A single playthrough)\r\n\r\nRatings (1-10)\r\nVisual: 8\r\nAudio: 7\r\nStory: 4\r\nGameplay: 5\r\nOverall: 5",
      "voted_up": false,
      "votes_helpful": 405
    },
    {
      "review": "I love the idea of the game, the atmosphere, the vibe. But it's just not super fun to play.",
      "voted_up": false,
      "votes_helpful": 187
    },
    {
      "review": "[b]I desperately wanted to love Pacific Drive. It's a crafting, driving game set in an interesting and mysterious world. There are some truly amazing moments, and well thought out mechanics - but a huge chunk of the game is grindy, laggy and repetitive.[/b]\n\n[h3]What you'll want to know:[/h3]\n[list][b]Unoptimized[/b]. Shadows set to low fixes it, but makes it look awful.[/list]\n[list]If you get stuttering, try the fix in [url=https://www.reddit.com/r/pacificDrive/comments/1egcv7u/pacific_drive_performance_fix_the_real_deal_no/]this Reddit post[/url]. Crazy that this has to be done manually.[/list]\n[list][b]Controller support is great[/b], but a lot of the analogue control inputs (IE starting the cars engine, releasing handbrake) require manual selection; there are no hotkeys, so it makes it [b]slow and clunky[/b] unfortunately.[/list]\n[list][b]Screenshots make it seem like a horror game, but it's not;[/b] it's just set at night quite a lot.[/list]\n[list]The difficulty options are meaningful. I recommend vibe checking an hour or so and restarting harder/easier if necessary.[/list]\n\n[h3]Things I loved:[/h3]\n[list]Driving the jalopy at night through the rain is peak.[/list]\n[list]The game has some great ludonarrative cognizance, specifically about you, the player, and the Jalopy.[/list]\n[list]Minor mechanics - such as the quirks - are fascinating.[/list]\n[list]There are some amazing moments - such as escaping zones - frenetic and tense.[/list]\n\n[h3]Things I liked:[/h3]\n[list]Despite how it's presented, I really liked the story. The game world is very well constructed.[/list]\n\n[h3]Things I disliked:[/h3]\n[list]Some of the game mechanics are pretty poorly explained.[/list]\n[list]There's weird thematic dissonance. It's superficially scary, but also quite meta, and sometimes comedic. It makes the world less immersive when you know the world is kind of just a facade.[/list]\n[list]The way the story is presented is not good. I'm not a fan of characters I'll never meet talking over me at each other.[/list]\n[list]Progression grinding is badly paced. I get that you're slowly expanding through the game world, but you have to do the same first areas over and over.[/list]\n\n[h3]Things I hated:[/h3]\n[list]The runs last way too long and they're way too repetitive, both in-run and per-run[/list]\n[list]I can't excuse the performance. It's so bad honestly. Please fix this, devs; it overshadows the game whenever it's mentioned.[/list]",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "TLDR the gameplay loop is incredibly boring and left a LOT to be desired. I kept pushing through the story hoping that something would change, but never did. Every mission was just mindlessly gathering resources in a pretty uninteresting world and then using them to pretty minor upgrades to your car.\n\nI will say the atmosphere is incredible, and is the entire reason I bought the game in the first place. The maps are gorgeous and the sound design is extremely well done, which only makes me more disappointed in the complete lack of substance in the gameplay. If there was more to do and more variation in the world the game would absolutely be 10/10.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "I'm sure its a great game, but damn it's un-optimized as all hell",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "To be honest, it's not a bad game. The aesthetics and theme of it are well done. However, under the hood, it's a grindy resource gathering roguelite. Most of it is busywork of managing resources and routes. It's about driving a car in the same way Skyrim is about riding a horse. You will never spin out, fall off a cliff, get stuck in the mud, or oversteer. There is no tuning, and the upgrades follow a straightforward tier list. You press forward and the car goes forward, magically sticking to whatever terrain you're on, and moving you to the next loot spot where you'll find a couple more generic materials you'll need to slightly upgrade your stats so when you hold forward the next time, the car goes faster. It's just not what I was looking for. Still, the game might be worth it if you enjoy the vibe of it or want the fantasy of scrapping together your sci-fi car.",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "Usually don't leave a review, but since the dev wanted to highlight the fact we have to basically re-download the game every time they update something, and chalk it up to \"re-organization of game files\"\n\nhow about re-optimize your game so that I don't have to waste my entire internet bandwidth just to download your game. Will never recommend this game until updates are appropriately sized.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I heard a lot about this game from friends and I tried to like it but I fell asleep three times playing it. The UI is clunky the menus and actions are just not very intuitive. The game lacked any feeling of danger or thrill I just felt like I spent most of my time listening to voice narratives and ripping apart rusted junk older cars to get goop to build a car I didn’t care about. I guess this game is not for me.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Pacific Drive dares to ask, what if STALKER was in a car, and it was a bit reddit.\r\n\r\nThe Good:\r\nThe wish-brand zone itself is very well represented as a living breathing character, and the temu-procured anomalies are inventive and well realized. I was impressed that they've managed to make a game where your main obstacles are \"passive\" and environmental, yet also feel like both benevolent and malevolent actors in your environment. The car is fairly fun to drive and doesn't feel too \"authentically\" weighty nor like you're driving a bouncy castle.\r\n\r\nThe game is very much about preparing and preserving your car, which is essentially your character, and taking calculated risks vs reward. That, and the mystery of the zone itself is very compelling.\r\n\r\nThere will be moments where you stop the car and get out and stare at the wind in the trees in the rain and you'll notice in the corner of your eye that a petrified human silhouette resides there now where one did not reside before, that is compelling.\r\n\r\nThe Bad:\r\nHowever, if STALKER has shown anything, it's at its best when it shuts up. Pacific Drive demonstrates this aptly. A lot of the fun of gradually unravelling what's happening yourself by context, is ruined by both characters talking over each other incessantly, and putting all the details in a big (highly unpleasant to use in-game appendix). This is theatre: plays do not have appendices, if you have to send me to the wiki to get the context, that's a failure to storytell. Even better, just don't tell me, I don't need to know, it's often better that way.\r\n\r\nIn a similar vein, the misremembered 1980s stranger things ghostbusters-reboot portland-vegan-bookstore thing it's doing with its aesthetic, I can kind of take or leave. I see what they were going for, I don't think they completely sell it. The game is trying very hard to pull a Portal, but it is not pulling off a Portal. It's not quite finding the narrow sliver between eerie and farcial.\r\n\r\nI don't particularly care for some of mad-science aspect of the game's setting or aesthetic, I think a lot of it robs the player of feeling responsible for their own survival, ends up feeling more akin to magic than ingenuity, and exists more to justify the game's mechanics than for story reasons.\r\n\r\nThe Ugly:\r\nLastly, I'm sorry to say gentlemen, that this game has terminal rogueliteis. Many many games with great concepts and even partially great execution have fallen prey to the allure of \"your potential adventures are unlimited\", only for every adventure to feel like the same blended, grey porridge. Game feels a bit thin on complexity? Toss a few random status effects in there, slap it on the ass- she'll be right.\r\n\r\nI would have preferred an eighth of the content presented to me a series of stops on a linear roadtrip, with more time to smell the roses and 400,000,000 fewer things to pick up. This is essentially an inventory tetris crafting game where the playable areas or \"junctions\" on the road are the rooms in the dungeon, and you can teleport home if you have enough of the game's rare-resource.\r\n\r\nYou can feel the hands of the designer artificially creating arbitary limitations to gate your progress and pad it out a bit more- hurrying you through to create a sense of artificial tension. I was disappointed that I couldn't pick a junction to explore and just drive there based on the routes on the map- under certain circumstances you'll just have no exits and you'll have to teleport home.\r\n\r\nThis essentially exists to make sure that you're returning to your base to recuperate and upgrade, picking up new story and building up to progressively longer runs rather than just driving as far as you can go. I generally try to refrain from being critical of a game for being \"grindy\" because it's reductive and passe- but it's very much at odds with the sense of mystery the game is trying to project.\r\n\r\nYou'll find that a lot of the \"interesting choices\" you're presented with gradually reveal themselves to be mandatory choices. Rather than taking in what you're seeing, you're gonna spend a lot of time anxiously looking at your inventory to ensure you got what you need before hitting a dead end and coming home- rather than being in the moment or choosing to be a pioneer and press on into the unknown. \r\n\r\nAlso, performance is a bit ropey for how it looks, I think this is a probably an unreal engine thing more than a Pacific Drive thing. Sometimes the game is very pretty and very striking looking due to good stylistic choices and running fine- other times you'll be standing inside your garage wondering why your temps are a bit warm.\r\n\r\nBuy on sale.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I want to like it so bad. but I wish the maps had like 3 times the empty space. I want to drive damn it, not get out of my car every 30 seconds to collect junk!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game. Everything about it resonated with me, but there’s just too many bugs for it to be fun. I can only imagine this is unbearable on the higher difficulties.\n\nA major one is that the route planner frequently stops responding to input when you’re ready to leave the garage. Happened in the tutorial and I had to watch some videos to ensure I wasn’t missing something major. Then now and again, it’ll just happen again. \n\nThere’s so much to like here, but I can’t.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game. Has a LOT going for it on everywhere but the gameplay loop itself. The atmosphere is amazing, the world itself is nice, the concept itself is cool too. But something about the issue itself is so... intentionally grindy, where it stops feeling like I'm doing a thing to progress, and instead doing things to maintain. I WANT to feel safe in my car. Not like \"ugh I'm gonna drive it and break it what a pain\" It needs more. I hope it gets more",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A supernatural road trip crafting game where you're avoiding anomalies while upgrading your car is a very appealing concept that (ironically) fails to go anywhere past the tutorial. \r\nAt the end of the game you're collecting the same materials you collected at the start, driving around the same extremely non-threatening hazards in a car that feels the same but looks way uglier with junk stapled to every surface and you're still stopping every 15 seconds to get out and hold E on the same crates in the same three copy-pasted buildings that got stale 10+ hours earlier.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I bought the game, but maybe it hasn't got the best optimization right now.\nThat's the main reason I refunded it. The game itself is great; you can play at your own pace, but not too slowly. After entering a zone, the storm will spawn, and then you need to exit the zone. I really like the car, the atmosphere, and everything.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I am sure this game gets good, but if you only have a steam deck please, please, PLEASE save your money as it does not work at all. The frame rate struggles so badly no matter what settings I try. The devs have not tried to optimise this for the steam deck, even though it's not a particularly intensive game. Hell the steam deck can run cyberpunk but it can barely get 20fps on this one.\n\nAvoid if on steam deck",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So tired of buying these promising looking games, launching them, and finding out it's another survival crafting game. \n\nStory and graphics originally gave me Firewatch vibes during the first 30 mins - I was excited to see where this would go.\n\nThen the gameplay loop was:\n\n-Gather resources by breaking stuff and looking in crates.\n-Use those resources to craft things at the crafting table (ooooh! never seen that before)\n-Use the things you crafted to fix your car and build antennas.\n\nThen you get to drive for maybe a minute before you have to get out of the vehicle again to gather more supplies for crafting.\n\nDreadfully dull. Incredibly boring.\n\nI don't want to do chores, I want to have fun.\n\nA driving survival sim, but you barely get to drive? LMAOOO what a joke. \nDriving physics were sub-par as well. Didn't feel quite right. \n\nI requested a refund after an hour.\n\nDigster's rating?\n\n3/10",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Game saves are so few and scarce. In-game instructions lead you into certain death and therefore waste of your playing hours. The concept is nice but it teaches you the hard way; you lose your time...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very disappointed in this game. It looks really cool and from what I've seen the mechanics and vibe are really cool. On my first save the game bugged in the introduction, in oppys shop. I couldn't progress after an hour of trial and error, and tried a restart. Got further in the next attempt but upon entering the first 'junction' i spent 4 hours thinking I was supposed to figure out how it worked. In the end I watched a walkthrough and found out this save is bugged too, the missions are not appearing and no voice guide, so once again I cannot progress without restarting. After seeing the glowing reviews, I would've never expected it to be so buggy and even if I did play again I just couldn't trust it to save my data. Very unfortunate.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm sure it's a very nice game, but I wouldn't be able to tell as I'm soft-locked in the first mission, with no way to progress the mission. I'll wait and see if the devs manage to fix it, but if not at least I still have the refund card... I'll amend when I hear back from them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pacific Drive is a foot & vehicle exploration game, based around sci-fi adventures in the Pacific Northwest (PNW).\n\nI really wanted to like this game.  I know the PNW well.  I like the era of the volkswagon hatchback.  And who doesn't like sci-fi?\n\nUnfortunately, it doesn't do the PNW well.  The environment is overall not amazing.  The vehicle is a pain to maintain and upgrade after the first 1/3 of the game.  The gameplay loop stays fairly static for the entire game.  And the story kind of stinks.  I couldn't even finish it.\n\nNot great.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "5/10, gameplay loop wasn't fun anymore after couple of hours, tried to keep going but the story missions aren't enough to keep me going. The world is pretty cool tho, and the intensity of driving into the zone was fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is extremely badly optimized and unplayable on the Steam Deck. The Steam Deck can run other games like Cyberpunk or Monster Hunter fine, but this game runs like a potato despite not even having close to the graphics to justify the lagfest. Save your money if you want to play this game on a Steam Deck.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Pacific Drive is maybe the biggest bait and switch I've ever bought on Steam.\n\nI was expecting an atmospheric, narratively driven linear game about driving into the heart of a reality-distorting mystery zone. I thought I would be doing things like avoiding weird creatures and phenomena, have a group of NPCs on the radio leading me through the world and story, and a series of tense levels with some tense moments.\n\nWhat I got was a very uninspired open world survival game... with no open world. To their credit, closed-world survival game is a new genre.\n\nThe gameplay loop is: go back to the garage, repair your car, pick a series of levels to drive through to whatever story objective you have. These levels are barren wastelands for the most part, and they aren't even procedurally generated (though I think the points of interest move around some, the map itself is static -- which causes all sorts of fun issues like an item that you have to pick up and return to your car while you take constant damage spawns two miles from the nearest road in a deep forest up steep cliffs your car can't handle). They're empty on purpose. Except of course for the junk and car parts you have to grind up for scrap metal to build... car parts. Did you bust a tire and want to take one from an abandoned car? Tough. Either grind it up for rubber and build a brand new wheel and tire on the \"crafting mat\" in the back of your car or use a tool that requires mid-game crafting materials that literally uses explosives to blow pieces off (and therefore, heavily damaging them). On a related note, for a Zone that supposedly causes technology to not work, there sure is a lot of working lights, televisions, and computers that you literally grind up for copper wire.\n\nOh, and progressing the story involves driving to a specific zone (and anywhere from 0-3 zones between them that are just time wasting since, again, no real threats exist). Then you do a thing there, have the standard garage reset, and have a new zone to go to, usually a stop or two beyond where you just were. But the devs made it so the zones you went through in the last run are wracked with instability and cause constant damage. So you're forced to do these completely unproductive baby runs just to be allowed to play the main game again.\n\nThe \"anomalies\" are almost entirely static, unmoving zones of either damage or radiation (aka different damage). How scary, I have to drive around them. The few mobile ones are, at worst, nuisances (with the exception of the Tourist, who you meet very early on, and I kid you not is the only good one). Like \"I stole the item you were carrying and ran away 20 feet tee-hee\" levels of little brother behavior. The biggest antagonists you have to face are how pitch black the game is at night and the hilly terrain. I died exactly once, because my car fell into a ditch I couldn't see while headed to the exit (which creates a battle-royale style shrinking circle). \n\nIf the Zone is supposed to full of all these reality-warping effects, why the hell is each level an empty, normal forest (the second of three areas is mostly swamp with some glowy plants like Zangarmarsh in WoW or a biome called The Scorch which is like... The Scorch in Fallout 76). Shouldn't there be cool gouges in the land where reality torn a mountain in half? Bridges made of teeth across a forest of moving, carnivorous trees? Nope, just different color circles to stay out of. If you've played Too Human, it's almost exactly like that, but without enemies (note that I like that there's no guns or traditional combat in Pacific Drive, but that doesn't mean there should not be conflict or meaningful adversaries at all).\n\nThe story is like someone was told about Roadside Picnic (the same novel that inspired the movie and game Stalker, which are wildly different in their own right) then decided to make a game with the same premise 10 years later after they forgot everything interesting that happened. Naturally, the NPCs can talk to you on the radio, but you have no radio transmitter, so it's all one-sided, despite the fact you have direct access to all of them through the pneumatic tubes you send and receive mission items through. I guess the main character never learned how to write, or you could send notes that way.\n\nTrue kudos to the voice actors though, they do a magnificent job turning a script with glaring plot holes (like a character telling us her motivation, only for the other characters to get mad at her for hiding her motivation -- WHAT?) and loads of filler dialogue into some enjoyable performances. But in 25 hours playing through the first two zones, there were maybe 3 actual points where the plot moved forward, and always in the most obvious way possible.\n\nWhat a waste of a good premise.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I really wanted to like this game. I've given it countless chances, but it just becomes such a chore to play. Later down the line, even with lots of extra batteries my car would die and I'd get stuck having to push it (and having no chance to escape). Certain items are always gone, while others clog up my inventory space. It just feels like such a chore to play which is a shame given the atmosphere, driving, and characters are all fun. I also wish the systems like making clothes/bag and your car's quirk problems were explained better and executed in a more fun fashion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Amazing casual game focused on driving and exploration that i just cannot recommend with the horrible performance and lack of response from the devs about any of the game breaking issues plaguing the majority of the player base.\n\nThese money hungry grubs of a dev team would rather keep releasing dlc than fix a single performance issue.\n\nEven if you have a rig with a 4090 or any more powerful graphics card your fps is going to dip constantly and the stuttering and screen tearing is utterly unbareable!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Boring gameplay loop. It's a solid idea, but after a few hours you'll have all the resources you could want, and then it becomes very boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For some reason the car would randimly decide that every direction was right and cause my car to go in circles. This was not a quirk nor an issue with tires since it only seemed to happen at random times and I had to abandon multiple runs because of it. Honestly just a very frustrating experience where I lost an hours worth of driving because of something I could not explain.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is still horribly optimized, devs clearly rather delete the comments on that mater rather then actually committing to that.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The game just stopped functioning on Fri 24th Oct 2025. No amount of re-installs of the software and my video card driver fixes the problem\n\nTotal crap\n\nUninstalling and never playing again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game was not what I thought it would be. Based on the trailer and description it seemed like it was an atmospheric spooky horror adjacent game similar to Metro Exodus or Dredge. It is actually just a resource gathering game where most of your time you are on foot and the danger is in \"anomalies\" that are not unnerving in the slightest. Very disappointed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really want to love this game. The mechanics are solid, the driving feels great, the soundtrack slaps and the story, while forgettable, was not awful. But the end game for this is just fucking bad and ruins the entire experience. This game has the same problem that every other rogue-like has where it gives no quarter to the player in their time of need. The game bullies and punishes you for simply existing. If you don't die the map gets more and more corrupted until you eventually are forced to die. The game offers you little to no recourse to recover the corrupted areas (except for dying) and you have nothing that you can do to save yourself when the game decides it is your time to die. I've failed twice out of 20 or so runs, once because the game told me \"Dead End\" despite the map clearly showing me a path I have taken in the past to leave a zone but decided that was suddenly not an option for me... for some reason. The 2nd time, it just put me in a corrosive zone then spawned no fucking vehicles with siphonable gas. Fuck this game. I don't even care to find out what happens in the end. Losing 2h+ of progress (90m run + w/e to rebuild) because the game just said go fuck yourself is a perfect example of a game that can go fuck itself. If runs were 10-15m, it's whatever... but you just wasted an afternoon in the worst way possible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After the October 2025 update with all of the wonderful optimizations, it still runs like a fat kid with a limp that drank a bottle of robitussin. EXACTLY as poorly as it did before. ZERO fps change no matter what you do.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A game about cars and driving, without steering wheel support.\nGuys, this is a real problem.\n\nI'll correct the review as soon as you add it.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Repetitive grindy gameplay.\n\nIncredibly clunky interface and controls. Some of the workstations are cluttered and filled with all kinds of nonsense, that makes using them a pain. Very clear case of console stupidity in design.\n\nWorst of all is the constant unending yapping from people you don't give a single F about - especially because they are so very unlikable. Would be a thousand times better if the npcs were all just deleted from the game entirely. The yappers removes all mystique and constantly being berated and insulted by one of them makes me actively not want to play.\n\nTutorial is waaaaaay too handholdy with \"do this, then this, then go here, do that, and then this, etc.\". Would be a massive improvement, if you could just turn it off and let the user do things on his own.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, but holy fuck, it runs so poorly it's nuts. Most of my playtime has been on PS5, but I've tried playing it on my laptop as well. They need to hire someone to optimize the game. It's such an excellent game, I really wish I could give a positive review, but with the performance somehow getting WORSE in the last few months, not better, I have to leave a negative review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Makes even the hardest games out there look like a walk in the park. You get 0 explanation about anything in the world and if you die you basically start from waaaaaay back. I dont recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i really like this game unfortunately the dlc has broke my save with a infinite load screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So confusing with no real tutorial on how to do anything. If you have to try to consult the internet within five minutes asking 'how do I...<do any basic thing>\" then it is not a good game. Interesting premise but literally no guidance on how to progress until you are just hitting keys like a monkey hoping something happens. I give up as life is too short to give time to a game where the only challenge is figuring out how to do ANYTHING.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It seemed like a really relaxing first 5 minutes and i was enjoying it until about 30 minutes in of constantly getting out the car to collect something to then get in the car for all of like 4 feet and get back out again to collect craft replace and not really get any of the driving experience part of the game.\nReal let down for me\nReal grindy feel to the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seems nice at first, but i cant even replace a tire. \nThanks for nothing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game makes no sense, having to google every 3 minutes wtf anything does, how to use any item or install anything on your car.\n\nthe constant yapping during the most intense moments, making me unable to listen to a single thing being said does not help either",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible optimisation, every time I try to play it needs a 10GB+ update.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "What is it about modern games where they just don't tell you where to go. I understand handholding can be bad, but I don't play God of war anyway, Just tell me where to go, stop wasting my time on deciphering what the fuck you want me to do",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a thumbs down for me, and I likely won't reinstall or continue playing.\r\n\r\nI loved the atmosphere and overall premise. Patching together an old car, and driving around the map had it's appeal, but it gets old fast. The story line isn't compelling enough for me, and inventory management takes far too much effort.\r\n\r\nUltimately it was the overly cumbersome inventory management and constant \"rush\" to gather materials, and escape the harsh conditions of the zone, to return to the safety of the garage that ended it for me. \r\n\r\nHad there been more whitespace to enjoy the journey without the \"constant feeling of impending doom\", I may have been able to look past the awful inventory management, but I also recognize that the \"constant feeling of impending doom\" is likely what some players enjoy, so to each their own.\r\n\r\nIt wasn't for me, although I did have fun patching together that old wreck of a car. (I use the term car loosely.)\r\n\r\nHaha - Peace and Love!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a fun and engaging story, but I want more and there isn't more. I hear the DLC is lame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Man this looks like a great game, but I can't get past the intro because keybinds just arent working.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pacific Drive looked like the perfect game for me, since I love non-AAA building, crafting, survival, exploration titles.\n\nBut it turned me off pretty hard very quickly. First it was blastic that honestly annoying music into my ears without an apparent ability to turn it off... I was looking for a radio control inside the car, since it sounded like that sort of a music, but haven't found any. And then everything just felt so controlled and limited, sorely lacking the player freedom I'm used to. Even certain objects were uninteractable until the annoying voice told me to do something. I didn't like the voice acting btw, I think it's annoying. I also hated the inventory UI design, with those god awful icons.\n\nThen, the final blow was when I realized that the gameplay loop is that annoying \"mission\" system where you have to do separate, fragmented excursions, instead of having a properly explorable game world. I think the game description and the videos should explain and highlight this fact a lot more. Too bad, because the environmental design is beautiful, and the vehicle handling was surprisingly superb for a non-racing game.\n\nIt's definitely not a \"Subnautica on land\" experience for me personally. Subnautica has incredibly amounts of player freedom in that beautifully crafted world, which you can freely explore as a cohesive experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yeah, I donno, fuck this game.\n\nJust played it for an entire afternoon and i have no idea what the fuck it wants from me.\n\nThe menu UI is terrible. It's samey, difficult to navigate, and needlessly categorised beyond usefulness.\nEvery time I was left to do something the hardest part about doing it was finding out what the fuck it was I was supposed to do. \"Go to town.\" No blip on the horizon, no marker on the map, nothing labelled \"town\" anywhere. Drive to the end of all the roads, can't access the road I suspect I'll need to be on because of barriers. Fuck around in the shop then OH! Right! The route planner! Proceed to plan the route then the bay door opens to the previously locked out road I needed to go on. \nMission: EAT THE CAKE.\nWhere's the cake?\nI've looked everywhere for the cake!\nI've tried thinking outside the box for the cake!\nWhich cake is it even talking about?\nOoooh, you mean I need to find the recipe to make the cake before making the cake so I can eat it!\nMission is to do something you can't do before doing something else yet, which you aren't directed towards at all.\n\nEverything felt tedious. I feel like this has so many good things going for it and it just got in it's own way. Why the fuck do I need to SCAN EVERYTHING to know what it is? And beyond that, I have to open my menu, navigate to the logbook, then navigate to the appropriate tab which I only really have to guess at SINCE I DON'T KNOW WHAT IT IS YET, then scroll down until I find the thing before finding out what it is. The dots on the tabs indicating a new item in there are helpful, and would be a lot more helpful if they went away after you opened all the new items. Most of the time they did/do, but sometimes they wouldn't even after exhausting every single tab and sub tab available.\n\nI didn't realise after planning a route that most of it would be fast travelled. Why did I come out of fast travel with my vehicle health so low? What the fuck happened? Is there a way around that? I just spent however long tediously scrapping everything I could and crafting what I needed to get my car in top shape. Is this just the price to pay for playing the game?\n\nThe other characters are so far only over the radio, I don't expect that will really change, but so far they're already a little annoying. It's one thing to be doing fetch quests for an NPC, it's another for it to be a mildly ambivalent voice with nothing to lose which is outwardly annoyed you even exist and could care less if you fail. I've been given no reason as to why I'm here or how I got here, either the story means nothing and just cut to the game play or explain what's going on in a more concise manner. \n\nI still don't know what harvesting the orange nodes on the map and setting them on the thing in the passenger seat does. Absolutely no idea. It charges something? What does it charge? why is that useful? Can I store more than one charge? I have no idea. What about the red nodes on the map? Why the fuck is it so difficult to find answers to these things? I'm SURE the dialogue tells me or at least hints at it, but I need to read things, sorry! \nAnd boy! do the item descriptions or whatever in the logbook sure go out of their way to make you feel like you're on your own and wasting time. Instead of telling you what it is and what it does you'll get some flavour text in the form of a transmission from someone earlier. If you're lucky they'll include enough details for you to know what's what you want about it. Can it be scrapped? not sure. Is it a part I just can't use yet? not sure. Is it important? no idea. Is it dangerous?? shrug. \n\nI found an anomaly with an inventory, scanned it, looked it up, found some transmission text about it being friendly, etc. That's it. Okay, well maybe it upgrades items? I put some materials in it's inventory. They disappear. \n\nFuck me, fuck this game. I bought this ages ago and have been looking forward to playing it and cannot adequately express my disappointment. \n\nHours in and it still feels like it's micromanaging a tutorial to explain a menu they've exploded into the world. \nWhy, WHO thought it was a good idea to have to first-person take all your gear out of your car storage, place it in a box, pick up the box, carry it over to a wherever you want to story your shit, then put it down, pick up the items in it, open the storage container you've chosen, and place the items in there? On what planet do players prefer this over simple menu swapping? I don't need to experience the tedium of owning a 2000sqft mechanic shop with shit laid out on opposite ends. \n\nBusted.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "You'll spend more time downloading \"small patches\" than you will playing. The small one today is *merely* 16GB. The one yesterday...also 16GB. Utterly incompetent.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not for me. Driving the car is too difficult to be fun. It's a lot of work following a very linear path. I'm not a big fan of crafting/survival, but I'd heard good things. The graphics are so basic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want a Roadside Picnic road trip.\nI got timed resource collection and crafting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game a year ago and deleted it because the game is horribly optimized\nNow I thought to give this game a second try after a year sure it got several updates might fix it right?\nNO ... This game still garbage ..... on medium settings still barley gives me 25fps and I playing it on Lenovo legion go\nStill regretted that i didn't refund the game at the time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wasted 60 minutes trying to save and couldn’t figure out how to save. Read online you need to be at a mechanic place and I was.\nWaste if time and will not play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very poorly optimized. Gameplay is pretty subpar.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This has a left wing political agenda baked into the game, it is very buggy and the game crash's constantly. It is extremely grindy with a word salad for most of the story.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}