{
  "positive": [
    {
      "review": "Can’t relate to people’s complaints, such a great and memorable game. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 50
    },
    {
      "review": "This game is such a masterpiece and so well crafted. You can see plenty of love went into this and it's tons of fun seeing more about Midgar. Must be my favorite part of the lore. The graphics are gorgeous and the OST is amazing, all of the characters have so much personality and it's just so good I cannot recommend this enough.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "I'd recommend this purely for the god tier soundtrack but everything else is pretty good too",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "A good game that could have been a great game if the devs cut down/reworked certain elements. Everything from the graphics, combat, music, and overall presentation is really well done.  The story and dialogue has enough cheesiness while also being heartwarming and earnest. Certain moments in this game contain some really high highs, yet there some stinkers, which come from pacing. The pacing has issues that come from too much padding in certain elements. These elements can be: enemies having way too much health that they are just damage sponges, unnecessary segways that lead to nothing, long ass animations (opening chests, picking up items, etc.), and bland side quests that do nothing.\nI think on its own as an adaptation of the Midgar section of the OG, the story and its changes are pretty good. But pertaining to the issues mentioned, sometimes less is more.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Completed 20 November, 2025\n\nFirst final fantasy game I completed, tried starting with ff7 rebirth a while back because I heard rebirth gives a pretty good recap and bad reviews convinced me ff7 remake wasn't worth playing. I was so wrong because 6 hours into rebirth I didn't understand the combat and button mashing wasn't working so I dropped it and got into remake instead. Remake explains itself really well, there were still some parts of the combat I didn't understand that youtube explained to me pretty well but finishing remake explained it enough that I'm not gonna be lost in rebirth anymore. \n\nFinal fantasy 7 remake was a really fun journey, although it only took me 18 hours to finish the main storyline (haven't played intermission yet). The world looks beautiful, the whole \"living under a big metal pizza that can be dropped on us any minute\" isn't something I expected to be appealing at first and lowkey another reason I wanted to skip ff7remake was because of this industrial hell hole setting but I gotta say its grown on me, I enjoyed playing this game and being so emotionally invested in the story. Prolly gonna play rebirth and do another run of ff7remake and actually do the side content.\n\n---{ Graphics }---\n☑ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "The story gets confusing around second half of the game but its peak gameplay",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "TL;DR\nOverly padded gameplay, annoying characters, beautiful yet heavily padded game.\n\nLong Review:\nAt first I was in love with it. Within the first few minutes I was like take my money and bought Rebirth. Then I actually got into the game and realized it was irritating. \n\nAi/Combat: \nThe combat ranges from it's alright, to OMG just work already! The mix of active time battle (wait your  turn) with real time movement is disjointed. The rest of the party either has to be micromanaged or is a liability. Also your Ai companions WILL walk into hazards. Learned that the hard way in the very first mission as Barrett enjoyed face slamming into frickin' laser beams like an Alien Face Hugger trying to escape it's jar. But as annoying as he was, I wanted him to die.\n\nStory:\nIf there are two words I'd describe the story, it'd be \"heavily padded\". Instead of getting right to the story, there are  filler quest like you'd find in an MMO. There are changes to the original story and ends before you even get to Kalm. I played 17 ingame hours and still wasn't at Don Corneo. Most of it were silly side quests and watching Dementors attack the party. Also the bad guy is revealed almost immediately, with pretty much no context.\n\nI did however, like how the devs portrayed how terrible the bombing of reactors would be. \n\nNow comes the worst part, the characters. Many of the characters are annoying.\nCloud simps over Tifa who uses her vasts tracks of land shall we say to mind control him. She's openly manipulative. Aerith is very pushy. Barrett is so rude that he should be thrown out of an airlock, and Red XII is mostly forgettable (as he was in the original).\nTifa is an airhead who openly uses Cloud and mismanages money. She strings him along to get what she wants. She knows the WMD's she's packin' and isn't afraid the use them. But at least she's fun, if not a little overbearing.\n\nI suggest only buying it on sale. O and it worked on Linux thanks to the hard work of the boffins at WINE and Proton. I use Arch by the way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great intro to FF7s world, focusing totally on the Midgar part of the story. Characters are great, especially the side characters of avalanche. Combat is fantastic with it's hybrid action/semi-turn based (ATB) system. There is so much to do in this game with side quests/scenarios, difficult combat challenges, and even a hard mode after completion for those who want to get more out of the game after a first play through. I'd definitely recommend picking it up, especially if you see it on sale.\n\nEDIT: Just wanted to say I forgot to mention how breathtaking this games visuals are, both inside and outside of cut scenes,",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "...This was a double-dip purchase, no regrets. I've already played this game back in 2020 but it was time to play it again. There are only a handful of games I will replay, because time is limited and there are a million other games to be played. This game is special though. I booted it up on my PS5 (originally played it on PS4) and noticed how blurry it was and went right back to my PC. \n\nI love this game. The original on PS1 was my first real foray into RPGs. I had followed its development but didn't think much of it. I had no idea how big of a release it was at the time, though everyone kept talking about it. One of my online friends recommended it to me and told me I had to play it. I rented it from Blockbuster. 3 times. Then I finally bought it used at the Record Exchange. I was 12 years old. \n\nI played the mess out of the original. It hits hard for me. This game does the same! It's a beautiful game, like its original (back then...those backgrounds??? Those FMVs??????? WOW). The soundtrack is amazing...and again true to the original. Lots of remixes and they are not holding back. The love put into this game is overflowing. \n\nI think this game is great and respectful of its origins. It's an all around good time to be had. The battle system is awesome, definitely an accumulation of Final Fantasy's gameplay over the years. It's stylish (it's cool af) and fast paced. It's a mix of turn and action and I think SE got it right. Having played almost every FF up through its current 16 release it's my favorite battle system of them all.  \n\nI haven't had many problems with performance and it looks great at 1440p, 120FPS. Stutters seldom, no drops so far, no crashes in the few hours I've played. I did get a white screen but reloaded and that was gone. It's been a smooth experience for the most part.\n\nI love all the characters...even more. Jessie, Wedge, and Biggs get more fleshed out. When they first announced the remake I was worried the characters would lose some charm due to how they looked...The original graphics had chibi like characters in the world but more serious models for battle. At times they act a bit cartoony and I'm glad that aspect was kept. The game can get quite serious but also quite wacky, and it keeps a good balance. Good job SE! \n\nThe story is ongoing but a bit easier to follow. I've played Rebirth and will only form an opinion when they release the last game. The original story still stands and is best described as a sequel...and I want to replay the original soon too so maybe I'll update the story later. It will keep you interested though, just a fun ride. Make sure you play Rebirth!\n\nAnyway, I hoped to play it on hard mode but I will whenever I come back to it in a couple of years (it only unlocks after you beat the game).\n\nUpdate 11/25/25\nSo I'd like to comment a bit more on the battle system because I'm at a point now where everything is fluid and familiar. Once you really understand the battle flow and get comfortable you will seamlessly switch between characters, inputting actions and then moving on to the next while you constantly build your ATB (active time battle) gauge, in between blocking, parrying, and dodging. The animation in this game is strong, silhouettes dynamic af so while you're changing it up it looks so cool. At least for me it took a second to get back into it but yeah I almost forgot how fun it is.  \n\nThe materia system also adds plenty of depth and you are truly able to customize your characters as you see fit. I continue to recommend this game, even if you've never played an RPG. Stick with it and when it clicks it clicks.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "As a longtime fan of the Final Fantasy franchise, I genuinely enjoyed playing this remake. While I understand and even sympathize with some of the negative opinions others have shared, I found both the story and the gameplay to be very engaging. I’ll admit that the main story included a fair amount of filler content that wasn’t always necessary, but it was also a welcome change—one that I believe can help draw both veteran fans and new players back to the game that first launched the franchise in the late ’90s.\n\n10 out of 10 would play again!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I Love this game my favorite best remake ever Square and Capcom have real top remake this is not cringe of ass this game real movie better marvel and emotion I love all persons.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A fantastic game that immediately made me buy part 2 the moment I saw the end credits.\n\nI recently completed the original FFVII and loved it, so I checked this one out. It absolutely does the original justice while also adding onto the original plot with boss fights and additional story beats. This both gives me the joy of seeing my favorite moments in that game remade in a modern style, while also changing just enough to keep me very engaged with the new take on the plot I already experienced, all without losing out on experiencing those original parts.\n\nAt worst, I had myself thinking \"I kind of liked how the original did this part better\". Mostly due to insubstantial small things, like not using the track I wanted during a certain sequence. At best, the game has my eyes glued to the screen, and volume to the max for climactic battles with its fantastic combat system, hilarious scenes that made me adore certain characters I previously glossed over, and emotional, engaging writing that made me fall in love with the story all over again.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Final Fantasy VII Remake takes everything great about the original and elevates it to a whole new level. The gameplay feels dynamic and modern, blending real-time action with strategic elements that keep every battle exciting. The visuals are stunning, and the cutscenes are beautifully crafted, bringing the story and characters to life like never before.\n\nI’d highly recommend this game to anyone who enjoys RPGs—whether you’re a longtime fan of the series or a newcomer looking for an epic adventure.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Final Fantasy VII Remake is visually stunning and has some incredible soundtracks, however it fails as a video game in creating engaging gameplay and establishing consistent story telling. \n\nThe game has terrible pacing and bad writing, it does not value your time, and between every actually meaningful narrative, is filled with meaningless side quests and slow, tedious, repetitive actions. The combat mechanic is very interesting on its own, it is able to hold enough depth and attacks feel satisfying. But everything about it gets worse when you realize every enemy is made out of sponges and most of the time its just smashing the same button to fill up ATB. (Also which genius from SE thinks using item consumes ATB is a good idea?) Enemy types are very limited in this game and encounters suffer from repetition. Boss designs are horrible, honestly some of the worst boss fight experiences for me, most of them are filled with weird tracking attacks that you cannot dodge, massive area damage that you can not dodge, and crazy hit detection that you cannot dodge. Evading doesn't do anything and blocking is extremely ineffective. It feels like the designers of this game had never considered how the players will actually engage with those enemies, the only thing they seem to care about is how cool are the attacks, (which a lot the results are actually cringy). \n\nIn my opinion, FF7 Remake has an appealing story, excellent combat foundation, which are all backed up by breathtaking visuals and music, however the poor execution in pacing and lazy padding in game design ruins the experience for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lovely game. A lot longer than the Midgar portion in the original. This game has ALOTTTT of extra content compared to the original, but I like it. I liked getting to know the characters better and explore parts of the game we didn't get to in the original. There's side quests and extra stuff u do that can be a little boring at times, but tbh the whole experience was so worth it. \n\nSide note: If all of you would stop nostalgia fiending then maybe ppl could learn to enjoy a beautiful game such as this and appreciate how good it is. Yes the game is different than the original ff7, doesn't mean it's \"ruined\" or can't be enjoyed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "in a day and age where a lot of games lack heart, this ones got it. the graphics are beautiful, the characters really pull you in and make you care for them. i can't wait to continue the story with Rebirth! as far as combat and games being linear, i really didnt think id like it that much but they did it pretty well implementing a hybrid action/ turnbased! and the world while although not open was big enough to still explore! i hope you guys enjoy it as much as i did.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "(new to ff7) started out thinking i would absolutely never play the og ff7 and immediately bought the og ff7 20 hours into this remake so yeah it's that good i would die to replay this again for the first time sigh, time for rebirth",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was really enjoying the game. The first 3-4 chapters were great, the gameplay felt good in the beginning, the characters were fun, and the overall vibe pulled me in almost immediately. But the more I played, the more disappointed I got.\nThe gameplay overall is very boring and you just don't feel the satisfaction of progressing or leveling up. You use the same 3-4 abilities the whole game and maybe maybe change your weapon 2 times max. Yeah, you can change characters and play with them in fights but what's the point when I just simply spam the same button and use the same abilities over and over again.\nLeveling up also feels like it does nothing at all, it mostly just adds more HP, and that’s it. I never felt like I was getting stronger or evolving my playstyle. Everything stays the same from beginning to end. Even the materia system, which could’ve been amazing, ends up feeling very basic, limited, and pretty useless. That’s my biggest issue gameplay wise.\nNow, the story is different.\nThe story was great, and it really kept me interested. I was into the whole mystery around Sephiroth, who he is, why he appears in Cloud’s visions, and how they’re connected. Sephiroth edging us by appearing for 2 seconds every few chapters was great honestly. The world building, the atmosphere, the city design, all of that was really well made.\nNow, what ruins the story for me is the pacing.\nSome chapters drag on forever and feel completely unnecessary. Moments like Cloud dressing as a female and dancing forever, or climbing 50+ floors of stairs even though there’s literally an elevator right next door, just killed the flow for me and dragged the story on for way too long unnecessarily.\nSo I'm honestly only giving this game a positive review because the story piqued my interest and the characters are great. There’s crazy potential here for something way better. But for me personally, the gameplay just wasn’t enjoyable at all.\nI’m really hoping Rebirth improves the pacing and delivers a better, more engaging gameplay system because the foundation is already strong, it just needs to be used properly.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Final Fantasy VII Remake is honestly close to being a masterpiece. You can feel the love behind every part of it. It shows in the interactions, the dialogue, the animations, the menus, the way NPCs talk,. It is obvious that the people who made this genuinely cared about the original and wanted to bring it into the modern era with passion, not like another remake.\n\nAs someone who played the original almost twenty years ago, I can say this with confidence. It is not a perfect game. Some chapters drag for a bit and there are moments that feel like pure filler. The story also takes a new direction that not everyone will agree with. But I actually appreciate that they tried something more ambitious instead of just retelling the exact same plot with nicer graphics. The results are mixed, but it's new and the OG game will always exists.\n\nThe combat system is on another level. It feels original, fast and incredibly satisfying. It blends action and strategy in an unique way, and I have yet to see this system on another game. Each character plays completely differently and the game encourages you to switch between them constantly. Add the depth of the materia system and the countless ways to build your team and it becomes something  special. This combat system is easily one of the best in the genre and IMO the first FF to blend action and strategy flawlessly.\n\nAnd the soundtrack. My god. It is one of the best soundtracks in gaming history. The new music, the remixes, the rearranged themes, everything sounds incredible. Every so on, I used Shazam to add the songs to my playlist, it's that good!\n\nSo yes, it has flaws. But the heart behind this game is undeniable. It is fun, emotional, creative and full of care. If you loved the original, you absolutely need to play this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game so far. first time playing FF 7 remake and I am glade I waited until now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Played on Ps4 and Ps5 now time for PC. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's no ultrawide support but there are programs out there that help with it, this port was really fun to play through and the combat was very entertaining",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid fun and a nice reimagining of Midgar. I prefer OG still but this is a well-done remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, little repetitive at the end but it's ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The port is absolute garbage and is almost unplayable without a 5 hour investment into tweaking mods and cvars. you NEED the vv7ri hook to play this, its the most downloaded on nexus mods. \r\n\r\nThat being said, game is beautiful and perfect and amazing\r\n\r\nI just dont understand how you can release a game for pc and not have dlss or literally any more advanced settings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an awesome game! The graphics are amazing, not to mention the game play is super beginner friendly. I'm not super into gaming, and am mostly playing for the story. It's been great so far!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have to admit that at the beginning i was skeptical about the new fighting system as i prefer turn based in this game but it is engaging and not bad at all. Just love the go through the story again with new graphic style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I believed I wouldn't enjoy spending an entire game within the walls of Midgar....I see now that I was wrong. \r\n\r\nThis game is excellent, and there is very little that I dislike. Although I enjoy your traditional, turn based RPG's, I also enjoy being able to fully control everyone on the battlefield and handing out beatdowns, through a fun balance of base attacks, abilities and spells. \r\n\r\nThere's not much I can say that hasn't been said already, as it released years ago, but if you're on the fence...I recommend taking that leap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been play like an hours and it is really good since I already beat the original one like 5th times lol.\n\nThe gameplay is good, soundtrack and the graphic was really damn good. 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I did not expect how great the game is! Started playing FF12 on PS2 and tried playing FF10 on PC before playing this FFVII. Amazing gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an awesome experience from start to finish. The story is really engaging and keeps you hooked the whole time. The cutscenes show up at the right moments, with a great balance between storytelling and actual gameplay, so it never feels like you're just watching instead of playing.\r\n\r\nThe graphics are gorgeous, easily some of the best out there. The combat is fun and stylish, and the difficulty feels just right, not too easy, not too punishing. The soundtrack is incredible too, with amazing new versions of the classic themes that stay true to the original.\r\n\r\nSpeaking of staying true, the game does a great job respecting the original FF7 while expanding the world and characters in meaningful ways. \r\n\r\nThe only thing I didn’t like is that you can’t control other characters outside of battles. It’s a small gripe, but it would’ve made exploring and replaying even better.\r\n\r\nOverall, it’s a fantastic game that blends nostalgia and modern design really well. Totally worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first ever Final Fantasy gameplay and its become my favorite game of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was initially extremely excited about the remake of Final Fantasy 7 when it was announced back in the ancient time of 2015. The excitement waned a little as time went on. I had gotten rid of my PS4, so the chances of me getting to play the initial release back in 2020 was low. Which was a bit of a bummer, but I had played the original, so at least there was that. \n\nThe original Final Fantasy 7, while perhaps an over-rated one, was one of my favorites of the series. I specifically saved birthday and Christmas money, bought a used PS1 at my local game shop back in 1999 (two years after the OG release) along with this game. I was so enamored with it that I played all the way up to the first time you go to Shinra HQ. In one sitting... Then realized I couldn't save the game because I neglected to get a memory card. So I went back to the shop, got a memory card and came home to find that the PS1 got turned off and all my progress lost. So I started over immediately and managed to make it through the Slums before I had to save and go to bed for school.\n\nLong story short, I loved the game. The music, the character design, the world. Everything about it. I played it multiple times through. I can see the flaws of the original now that I'm grown up, but I still very much have it as one of my core gaming experiences. I figured I wouldn't be missing anything by skipping the Remake, but Square did some very intriguing things with it. The soundtrack manages to be close to, but not exactly equal to, FF7 OG. It's still very good don't get me wrong. The battle system is fun, albeit pretty much the same as FF15 (which I am cool with. I liked that game, despite its problems.) Graphically, it's really nice to look at. The particle effects, lighting and artistic direction are all great. It's very polished.\n\nThe English voice acting manages to (mostly) be good to very good. I find Aerith, Jessie, Biggs, TIfa and Barrett's voice acting to be very good. Cloud also sounds good, and while I have now come to enjoy Sephiroth's VA, he had to grow on me a little bit. I won't delve into spoilers, but I will say there's an awful lot of Sephiroth much earlier on in this game than there was in the original. That manages to be both a criticism and also a positive. On one hand, it changes the flow of the story, but it also gives a little more character to the... Well, the character.\n\nI've actually played through this particular game twice. Once on the PS5, and then again on Steam when I was waiting for Rebirth to release. Both times I enjoyed the experience. Since this is the first in a trilogy of games, they really stretched the Midgar section significantly to where it is the sole location in the game. For those that played the original, Midgar really wasn't AS significant of the story as it is in this version. But they did so in a way that gave some lesser used characters more development and it didn't really hamper the overall experience. Unlike Rebirth, it is a strictly linear game with some side quests. But that does keep it to a more focused experience. \n\nIt's not exactly Final Fantasy 13 hallway simulator (I still think that game gets too much hate) but it is very much focused on keeping you on a path with some back and forth between locations. I don't think it's a bad thing, but it is something to keep in mind. The fair criticisms people have made towards FF13s linearity do apply to this one. If you loved the original game, or you are experiencing the world of FF7 for the first time, this is a definitively good one to play. I was particularly intrigued to see where the story changed compared to the PS1 version. \n\nNumbered ratings are so arbitrary, but I'd give this game an 8.5 inching ever so close to a 9 out of 10. It refreshes the story and visuals while still staying true to much of the core things OG FF7 did well. Character design, setting, and music.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's quite good. Free-ish combat with abilities and targetting works pretty well here.. Only caveat is.. well, I can't mention much without bringing spoilers.\r\n\r\n\r\nI imagine you already know that the whole point of this 'remake' is that it diverges from the original. That is okay, I don't have a problem with that, i didn't even play the original. But I am aware of how it goes, more or less.\r\n\r\nAt least, I recognized when stuff was really skewing off what was the original plot, and personally, I did not like it much/found it nonsensical. Not a \"This is not like the original\" rant, I just did not like where it headed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought this remake was just going to be the old game over again, but it is insane. They went so much further in depth with the story and character development that I am amazed. If you loved the old FF7, I would highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing open world game with so many different techs and strategies, so fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this entire game despite owning it on PS4, just to play the Intergrade DLC chapter, and I don't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, shame that the white screen problem still exists. If you do suffer this, do the following:\n- Pause the game\n- Enter camera mode\n- Reset the camera\n\nThen your game comes back. This still needs to be fixed, but the workaround is fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for me who has played the PS1 version, it's really nostalgic. I can feel the vibes of midgar and the character. Very recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has a few rough edges, but they can be cleaned up with a little modding. It's still one of the best Final Fantasy games I've played, and definitely worth replaying if you've already played it before.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lo he disfrutado mucho, amplía mucho la historia original y añade cosas tanto del original como del Dirge of Cerberus y Crisis Core para explicar mejor lo que se está jugando. Me ha gustado mucho el desarrollo tan amplio que tiene Midgar en este juego así como la segunda oportunidad que tienen Jessie, Biggs y Wedge. Destacar al personaje Sonon en el DLC Intermision, un personajazo que no esperaba y que se me ha quedado grabado en la memoria. Audiovisualmente es una pasada. Recomiendo este juego tanto a los fans veteranos como a los nuevos, no os vais a arrepentir.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing to play! Stunning, very well optimized.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of fun and very cool if you were a fan of the original. havent played a game this much in years. lots of enemies. lots of challenges. not for the faint of heart. i cant wait to get the second game. seriously deserves a better meta score",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played the original FFVII and I can completely understand why so many people love the characters from this game.  The music is iconic, some of the best in gaming ever.  The FFVII Remake really sets a great pace for the story.  Combat took a while to get used to for me personally.  Overall a great game and one of few I would rate as a \"must play\" experience due to the broad impact the original had on gaming.\n\nPros:  Great characters, interesting and deep story development.  \nCons: Some combat encounters can be ruined if party members are not fully prepared.  Also there is a lot of slow walk escorting.\n\nEdit: Game completed at 74 hours including the Intermission (Yuffie) Addon.  Yuffie ninja gameplay was incredibly fun and the 6-10 hours of extra story offers a unique perspective on the events of VII Remake.  I do recommend playing the DLC with the optional Head Start which will set Yuffie to a level 45.  The DLC is great, but not long enough to acquire the EXP/AP to develop the characters and materia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All in all, the game is worth it, combat takes some time to get used to, but it's enjoyable. The story is great so far and the game runs well.\r\n\r\nParts that i disslike the most were those slow sections where you have to crawl in between tight spaces, just a waste of time for no reason at all, they also seem to be quite overused.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FF7:RE \n9/10\n\nLiked:\n- The seamless blend of real time combat and turn based strategy.\n- Story and Characters.\n- Assortment of minigames and interactions. \n\nDisliked:\n- All the walking sim sections. We have modern technology, we don't need to hide loading screens, stop making me slowly walk through areas. \n- This is on me, but I built out my characters in the hopes that they carried over in some way to the next part of the game. Knowing now that the impact between games is minimal, it feels kind of hollow and like I shouldn't have bothered.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything is stunning! Adds greatly to the FF7 Midgar portion of the story line.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The combat system in this game is awesome. It rides a narrow line between traditional party turn based combat and an action oriented system. Simply seeing how I could find new uses for the Materia in the game kept me engaged throughout. The story was a lot of fun, with Barrett being a real standout for me personally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, beautiful graphics and cinematics, the new combat takes a little getting used to but one you do its amazing, captures the atmosphere of the original game and expands on it, really well done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played the original more than I care to admit, and, while it still has a prominent place in my heart, this is a better game.  The art and environments are fantastic (no pun intended), expanding on the story in a way that still lets the nostalgia shine through but gives expansive depth and life to the world.  The plot is fleshed out with details that were left to speculation and the characters given dimensions previously unexplored.  The side quests added to the overall immersion and gave it a little of the old-school exploratory feel that the later games have been lacking.\n\nI admit the ending seemed a little off, and, while I won't spoil it here, I hope they tie it in a little better in the next two.  I did, however, get a laugh out of the length of the credits - \"Is this **still** going???\"  X-D\n\nI can only hope there's a official or fan made option down the line to play through all three parts sequentially, at this expansive length for a crazy long game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing, fantastic just like the original and goes just as deep into the story line, highly recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good final fantasy game with a lot of good things. it does have some flaws in it's gameplay and story pacing.  But still very much worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] It's a fresh take, I liked it for the most part. [/h1] \n\nIt's beautiful and stunning, everything I could ever want artistically and aesthetically. The characters and models are probably the best I have ever seen in a game. As a game designer myself, I can see just how much blood sweat and tears went into this game. Nothing short of amazing on these fronts.\n\nLoved the combat system after getting used to it. A shame I had to wait almost 5 years to play this game because it wasn't available on other platforms for a long time.\n\nSome things just don't add up versus the original, the whispers for a start are a convenient plot armour for directing character motivations going against fate etc. Not sure how I feel about it, mostly I think it is alright but sometimes a bit jarring or annoying.\n\nGameplay is incredibly slow at points, side quests are rather boring for the most part and lack real substance, you have to do them for decent rewards though. Overall I think the writing could be better and some of the voice actors don't do it for me, especially Sephiroths, it feels off. The rest are decent.\n\nThe ending of Remake made absolutely no sense to me at all and I have played the OG many times. I am curious what Rebirth with hold as I am now about to play through it too. Zack is somehow alive??? While I am curious about these decisions, I wonder how I will feel because the original story is so powerful and emotional regarding what happens to Zack etc. I dunno how I feel about it yet, time will tell.\n\n[h1] Intermission Yuffie and Sonon [/h1] \n\nWas nice, new characters, really fun combat. Extra cheesy though! Sometimes too much for me with the way Yuffie acts but I guess it is what it is, she is a kid and she deserves to act like one. The content did feel lacking, after I did Remake I played through this and I ONLY did the happy turtle side quest because the rest I just couldn't be bothered with I wanted more story! \n\nThe Zhijie main scenario  was boring and dragged on for way too long. The Shinra parts in the main building were decent. Sonon and Yuffie just eat bullets during the cutscenes and I was rolling my eyes because it just lacked seriousness, it lacked danger and tension for me.\n\nThe Concord type game I just could not give a damn about, it was cool for the first time but having to do collectables and stuff to build was too much for me. \n\nFinally, not enough time to flesh out the characters of Sonon or other NPCs. Aso Zhijie has yellow hair, I almost didn't make it through the beginning because it was honestly throwing me.  I also felt like the ending of Intermission was super abrupt and just weakly coming to a unsatisfying conclusion, Sonon gets fried, Yuffie just immediately spawns outside the Shinra building and then the plate falls. Nothing on Weiss nothing on how tf Nero just can spawn again after getting demolished. \n\nI still recommend but I wanted it to be a lil different.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like most games, a little slow at first but gets really fun the further you go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the game that hooked me into trying all the other Final Fantasy games. It was an adjustment to what I was used to at first, but eventually I fell in love with the characters, the world and the creative chaos the is often present in FF. I wish I could experience it again for the first time! Also, Aerith is best girl!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(TL,DR at the end, details below.)\n\nThere are few games I've fully delved into, and I'm happy to say that FF7 Remake is one of them! There is so much about this game that is incredible: the characters are phenomenally written, the graphics are clean (even on Steam Deck!), bosses are unique and challenging, and music is nigh unparalleled. If I had to pick one reason to convince a friend to play this game, it would definitely be the story. The antagonistic relationship between Cloud and Sephiroth is one of the best written hero-villain arcs out there, and I've played few games that can match the amount of incredible world-building that Remake does.\n\nTHAT BEING SAID, the game does have some stark flaws, the most notable being its length. It took me the better part of 25-30 hours to beat this game and another 55ish hours to 100% it, with most of the achievements being INCREDIBLY specific and hard to get. The middle part (specifically Wall Market) can be INCREDIBLY tedious, feels waaayyy unnecessary, and unfortunately seems more like a crowd-pleaser fever dream than an actual contribution to the story. The movement outside of combat is a little annoying too - you will spend a majority of this game running from place to place, with occasional fights scattered here and there. I didn't mind that too much since I enjoyed seeing all the different skyboxes and surrounding areas, but I can see how other players would find it boring.\n\nTL,DR: FF7 Remake is an amazing game with a phenomenal story and visuals that is well worth playing, but you will get a lesson in patience in some sections of the game. At base price, it's pretty decent value, but if you're just getting into Final Fantasy 7 for the first time I'd wait for a sale. Otherwise, this game has a special place in my heart and I hope other people will love the cinematic moments just as I did!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had not played the Original FF 7, so In this case, I was not looking for a 1 to 1 direct remake. This game  has made changes to the Original in regards to combat and story, that are in fact still playing out in the remake trilogy as a whole, I am a huge fan of turn based combat and going in, i did wish Square had kept it. However I wanted to experience the world of Final Fantasy 7, So I dove in. \r\n\r\nThere is a reason fans still talk about  Final Fantasy VII 30 years later, this world and these characters are so iconic. The voice acting in this game is some of the best acting I've ever seen, Barrett is one of the most lovable and interesting characters I've ever come across in gaming. \r\n\r\nThis game Oozes production quality from every turn. I'm not always in awe at expensive game design or the most cutting edge graphic, however i constantly found myself blown away by game mechanics and zones that were incredibly cool, only to be left in the dust for the next thing to capture me the same way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games I've ever played.\r\n\r\nInsanely good story, characters, and gameplay. A game so essential and legendary everyone here should at least give this a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Loved the original from the day it came out. Very happy with how they incorporated \"changes\" and fit it in while preserving much of the original.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a lot of mixed feelings about this game.  I finished my first playthrough of the original about a month ago and jumped straight into this.\n\nFirst, I'll say the combat system is quite good. It does feel a little raw, like a first draft of a pretty new idea, but it works well and if Square is determined to abandon the fully turn-based/ATB style of old (I'd prefer they did not, but that's just me), then I think this is a pretty good compromise between that style and a third-person action game.\n\nThe presentation in this game is very good as well. The character design is amazing and it was really fun to see the classic characters from the OG FF7 get fully fleshed out with high quality models and motion capture animation. The voice work is excellent, which is a relief because I tend to be very picky with English dubs for JRPGs and anime. I am glad I went with the dub though because the art direction and graphics are really pretty and it would have been unfortunate to be staring at subtitles the whole time.\n\nAs you probably know, the section of the game that takes place in Midgar in the OG is only about 5 hours of the game, and here it is stretched into 30-40 hours. I don't mind this in theory, but it really does drag (as I feared it would) VERY frequently. It might be made worse by the fact that I have the OG fresh in my mind, so it's easier for me to think \"man, this section  took like 15 mins in FF7 and it's taking hours in the remake\", but I still think many people who haven't played FF7 will feel the story meanders a lot just for the sake of tacking on playtime hours.\n\nThe \"hallway sim\" accusations that are popular to make towards FFXIII I think could be applied just as fairly here because there is a ludicrous amount of running through linear paths with nothing in them in between fights. A lot of these very linear levels are also full of  mindless busywork that felt like they were just there to pad the playtime. Just lots of sections that feel so, so slow to progress through for no reason.\n\nThe sidequests I also found to be a pretty big waste of time. I did all of them in the first area, about half of them in the second area, and then just gave up after realizing they were all painfully boring fetch quests or \"kill x number of this monster\" quests, and the rewards for the quests didn't seem to be all that important.\n\nAs far as the Intermission DLC goes--it's fine. I can't imagine paying $20 for it on release, as it only took me like 4ish hours to play through (although I didn't do much of the side content in it). I thought the way they remixed the combat in it made things feel very fresh, and Yuffie is by far the most fun character in the whole game to control, so that helped a lot too. Sadly, Yuffie is extremely annoying, and I couldn't stand her any time she opened her mouth. That'll be a bummer to have to put up with when I eventually play Rebirth.\n\nIt's a good game with some kind of baffling flaws that were surprising to see in a game that was released in 2020. Boring level design, lots of padding, but great combat and a fun reimagining of the story and characters. I'd personally probably give it something like a 3/5, so not a hearty recommendation but if you like the original FF7, the FF series, or JRPGs in general, you'll probably have a good time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with beautiful graphics and engaging story. Some achievements are UNNECESSARILY annoying (Dressed to the Nines..) but its still fun to plat the game. The game builds depth on Cloud's character and I cant wait to see if Zack comes back in the next game.\n\nalso its funny how in Yuffie's chapters Fort Condor is literally just 3D Clash Royale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the first part of a legacy sequel trilogy that isn't complete yet. Maybe come back when Part 3 gets announced. Or don't.\nThe hack and slash gameplay is solid but nothing special. Also crossdressing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i am a fan of FF series. I have played many of the originals IV, V, VI, VII, and X. I have seen may complaints from people about this game being different than the OG and its worst, that it needs to be ATB again, how dare they make it a hack and slash tactical, etc.\n\nI disagree with all this. The game is fun. People are too busy  trying to chase nostalgia with this game, but its a remake. Things will be different. Overall many of the interactions and funny dialogue is present. Foreshadowing is good for people who know the original and new fans a like. Best of all, the combat fits how I would imagine being a SOLDIER would be. Its obviously not perfect, but I loved seeing characters come to life more. I was happy with the expansion of Jessie, Briggs, and Wedge's stories (made them feel less like throw away characters), deeper dive into wall market, the slums, and other story building locations.\n\nIf your an OG fan that likes games because they are games not just because they can invoke a feeling of nostalgia, this is it. If you care about things being the same, then play the OG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game for the price, though you kinda need to invest in the other two games, If you want to get the full story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fucking incredible, the level of depth with the characters is great as well as their designs, the story is very interesting, the world is incredible, and the boss fights are some of the most fun of any game I have played. Seriously if you enjoyed the original or like this style of game its a must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My god what a slog. This part of the original game was a slog as well and it didn't need to be extended into a 30 hour standalone game. The graphics are top notch, and it's nice to hear all of the dialogue but the game part of the original has been removed and discarded for this drudgery. There is so much derpy aspect to the revised game mechanics that it sucked out all of the fun. Exploring is pointless, the distracting grind sessions are missing having been replaced with what feels like a way too long rail shooter. I'm giving it a thumbs up because the story is still mostly in tact, and the updated visuals are very nice. I'd much rather have had an exact replica of the original with all of the updates being done to visuals, and sound design. \n\nIf you like this game for the story please go and play the original. It's hard on the eyes now as it was when it released but it's a whole lot more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have loved playing this game, and it's also been introduced to me about when I was 5 or 6. I always watched my dad play the game, and when our system fried, I couldn't watch him play it. He never actually finished the game, but now I got to play it. 100/10! This was an amazing game, and my favorite thing about the game is the effects, shaders, and the music. I would definitely recommend this game for anyone who loves the Final Fantasy franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good remake that's much better if you have consumed all FF7 content available before this like I did. At least play the original game and watch Advent Children. This is more of a reboot/sequel than a remake. The gameplay took a bit to get used to but once I did it was great. Use Japanese voices as they are much better. Sadly the translation itself is fairly bad and inaccurate and many liberties are taken with the script.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I pre-ordered this game when it first released on PS4, i got the full deluxe (£79.99) best money i ever spent, i then got intergrade and it was the best shit id ever played, this port holds up, there IS however an AWFUL glitch where the screen will randomly turn white... itll fix itself but it can become a pain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I did not play the OG, but this game is incredible. The combat system is revolutionary blending real time and turn based, it does not get enough flowers imo. Midgar and its characters are beautifully realized, this is AAA gaming at its best. An absolute must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Final Fantasy 7 on the original Playstation is my favorite RPG ( like many others. ) I was pretty excited when they announced this game so many years ago. Treating this game as its own entity helped me to not compare it so much to the almost perfect original game. I beat it on PS4, then ordered it here on Steam for another playthrough. We all love the characters, story and lore from the game, but you never played the original game, I still think you will enjoy playing through this game.. Its great for first timers of the FF series..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, the game is mind numbingly easy on Normal difficulty. The game really shines through on Hard mode once it is unlocked.\r\n\r\nThe gameplay ramps up and you have to actually think about what you're doing instead of just mashing attack and spamming abilities. The game is more of an action game than an RPG imo, and unfortunately the anime grunts are incredibly consistent.\r\n\r\nI never did like the original FF7 story too too much and the game does drag a bit in some sections. The visuals are absolutely nice and it is a gorgeous game. The backdrops/skyboxes do pale in comparison to the actual field you're playing in though.\r\n\r\nWeiss is a horrible optional superboss and so is Pride And Joy Mk 0.5 - still beat'em.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ll start off by saying that this is my first ever Final Fantasy game. I know there’s people out there who recommend playing through the other games, but I felt this one was calling to me because I was interested in getting into the world of FF7. I thought Cloud seemed like an interesting character, so I got myself this copy a long time ago. I finally decided to sit down and play through it, and 30 hours after the main game and the Yuffie DLC, I ended up really enjoying the adventure this took me on. \n\nI will say that it took me some time to get into the game because the beginning does feel a bit slow. The gameplay was also very different from what I’m used to so it took me some time to get a handle of it, especially once I started playing with up to three party members. The gameplay system took some time to grow on me, but I ended up enjoying it, and I can really only speak from the experience of playing on Normal mode since you unlock Hard mode after beating the game, so take this with a grain of salt. \n\nWhile the combat did take some time to grow on me, once you get it, it feels very flowy, especially as you’re choosing from multiple different characters' abilities, and trying to figure out what works together in a fight. I never felt at any point that any boss fight was just straight up unfair, and if I messed up, I could easily try again with different strats in mind. \n\nIn terms of side content, there wasn’t a whole lot, but I heard that Rebirth expands on what this game did so that’s probably for good reason. The side quests themselves aren’t too bad, and they add more to the world of the game and getting to know its characters. There are some fetch quests that seem annoying, but I don’t think they’re egregious and don’t take too much away from the game. There aren’t that many side quests either. \n\nI don’t want to say a lot about the story to avoid spoilers but what I will say is that there were moments where the game made me genuinely laugh and have a good time as I got to experience what the characters were going through in the story. The end of the story left me wanting more, and it made me immediately go and wishlist Rebirth because I would have never thought about playing that game until I went through this. \n\nThe music of the game is pretty solid, and dialogue was pretty good overall.  The pacing did feel slow at times, but there’s a 1.5 speed up feature you can use if the game feels slow. I’ll admit I used it a couple of times but it’s because I’m the type of person who wants to get to the action right away. \n\nI’ll also say that the game is beautiful. The graphics, character designs, and the world around you look amazing. The game just looks GREAT! \n\nI would recommend this game to anyone interested, and I think you’ll find it as enjoyable as I did. I got excited to tell my friends some of the crazy scenarios that happen in this game, and so I hope that experience is the same for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game manages to take one of the greatest RPGs ever made and molds it into a brand new experience that not only stands up to the original, but also ages like fine wine. The game retains the deep customization of the PSX game while adding even more new mechanics, finally giving every character a completely unique playstyle with their own niches. The environments are beautiful - even five years on, this is probably the best looking game I've ever played, better than even later entries in this very series. Up until near the end of the game, every new area you go into is unique, fun to traverse, and filled with secrets to find. Boss fights are cinematic, intense, and always have some way to surprise you. Just going in and swinging blindly will not work, each encounter will take some strategy to get through.\r\n\r\nThe new content specific to the remake is unfortunately somewhat hit or miss. The hits include more screentime for some of the more sidelined characters like Yuffie and the AVALANCHE crew, the fun new sidequests and most of the new or more fleshed out dungeons. On the other hand, the minigames are somewhat lame, I found the way they handled summons to be pretty useless, and they dropped the ball in the final few hours of the game. While the overall story is close to perfect in execution, I wish that they gave a bit more extra time to the villains, especially Rufus as I think he's a very interesting character that gets next to nothing in this game. The final dungeon of this game, while tying in more to the overarching plot of Rebirth and the upcoming third remake, doesn't stand on its own nearly as well as its original counterpart. Every change they made from around Chapter 16 to the final boss was for the worse, in my opinion. The final boss itself was pretty unnecessary, as the ending portion of the final dungeon would've served perfectly fine as the climax already. It also sorely needed to have some checkpoints added, as I managed to abruptly die to an unavoidable party-wide attack around 20 minutes in and had to restart the fight from the very beginning.\r\n\r\nOverall though, absolute must play despite its faults. You will not regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game and a great sequel to the original FF7!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy shit the music dude oh my god, wait why the fuck is sephiroth here so early, but wait aww dude the gameplay with its commands and fluidity, and why the fuck does aerith know shes going to get... well you know, but the graphics! wow these character models look so good and midgar is such a cool environment and its such a spectacle, and okay hold on what the fuck are the whispers why are we doing this like I get it we have to make this a trillogy but did we have to be this on the nose about it? but man the characters are so fun to play and......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The classic RPG of my childhood now brand new full character 3d models and world... man it was already epic back in 1997 when I played the original, this new version brings back nostalgia but in super duper nice modern graphics, definitely a must play! \r\n\r\nCan't wait for the full trilogy to complete soon!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PRETTIEST GAME EVER. despite having only 6 hours on this game its incredible. definitely worth ur money. the gameplay is easy to understand just like the storyline. LIKE SERIOUSLY BUY THIS GAME GNG! also graphics are amazing. so far no bugs!! cutscenes are also very good!! and the battles are amazing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "'this calls for a song, dun dun dun dun dun dun dun dun duuuuun'",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fell in love with this game!!!\r\n\r\nThis year has been a truly special one for me, because it’s been one of those rare years filled with incredible gaming experiences. For the first time in my life, I played a turn-based game (*Expedition 33*), and with *Final Fantasy VII Remake*, I had my very first JRPG experience — and honestly, it was just phenomenal. To me, this game is a masterpiece!\r\n\r\nI love hack-and-slash games, and this one delivers that experience in the most satisfying way possible. It’s not just about swinging your sword left and right — you have a party, and you need to strategically use each member’s unique abilities to pull off some absolutely stunning combos. Just watching those combos play out feels like a visual feast.\r\n\r\nSpeaking of visuals, the graphical effects in this game are breathtaking. They completely draw you in. As someone who never played the original game, I can say I really enjoyed the story. The *Remake* basically covers the Midgar section of the original, and it does it brilliantly. The game is packed with boss fights, and the cinematic quality of those battles absolutely blew me away. I went crazy for this game — I’m completely in love with it, bro!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never played any FF game until this great game. It is a visually stunning and highly engaging reimagining of the classic RPG. The only two downsides are that has a lot of unnecessary quests that don’t add anything relevant and the dodge system needs more work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After spending over 140 hours in Final Fantasy VII Remake, I can confidently say that this game isn’t just a remake — it’s a reimagining, a tribute, and a bold new chapter in one of gaming’s most iconic stories. What Square Enix has done here is nothing short of breathtaking. It manages to honor the soul of the 1997 classic while reshaping it into something modern, cinematic, and emotionally powerful.\n\nFrom the moment I stepped into the neon glow of Midgar, I knew this game was special. The atmosphere is dense — every alley, every flickering sign, every echoing voice in the slums feels alive. The world isn’t just remade; it’s reborn with detail and care that shows deep respect for fans who grew up with the original. Even after 140+ hours, I still find myself wandering through the city, soaking in the ambience, listening to NPCs talk about Shinra’s propaganda or their daily struggles. It’s immersive storytelling at its best.\n\nAnd then there’s the combat — an incredible fusion of real-time action and strategic command-based systems. It’s fast, flashy, and deeply satisfying. You can feel the weight of every swing of Cloud’s Buster Sword, the precision of Tifa’s martial arts, and the explosive power of Barret’s gun arm. Switching between characters mid-battle adds a layer of tactical depth that keeps every fight dynamic and fresh. Once you master the synergy between abilities, Materia builds, and limit breaks, it becomes almost like a dance — fast, beautiful, and endlessly rewarding.\n\nThe characters are where this remake truly shines. Cloud isn’t just a brooding soldier anymore; he’s layered, vulnerable, and at times surprisingly funny. Tifa and Aerith, both so different in spirit, are brought to life with stunning emotional realism — and their friendship feels genuine, warm, and beautifully written. Barret, once a bit of a caricature, now feels grounded and human, his fierce ideals tempered by compassion. Even minor characters like Jessie, Biggs, and Wedge have been expanded into people you genuinely care about. By the end, I felt deeply attached to all of them — and that’s rare in any game.\n\nVisually, it’s absolutely stunning. Every texture, every lighting effect, every cinematic sequence is crafted with the kind of polish that makes you stop and just stare. The music is another masterpiece — the reimagined soundtrack gives goosebumps. Hearing the updated “One-Winged Angel” during that final battle made my heart race like it did when I was a kid. Nobuo Uematsu’s compositions, rearranged with modern orchestration, are pure perfection.\n\nAnd the story… what can I even say? Without spoiling anything, Final Fantasy VII Remake takes the familiar and twists it in unexpected ways. It dares to surprise players who think they know what’s coming. Some of those narrative choices are bold — even controversial — but they make the story feel alive again. This isn’t just a retelling; it’s a conversation between past and present, between nostalgia and new beginnings.\n\nI’ve spent over 140 hours not because the game is short, but because I wanted to see every side quest, max out every Materia, replay boss fights, and relive emotional moments. Every chapter feels handcrafted, every character moment meaningful. The attention to detail is astonishing, and even after all this time, I still find new little things — hidden lines of dialogue, subtle animations, or environmental clues that expand the world.\n\nBy the time the credits rolled, I felt both heartbroken and hopeful — the exact same emotions that made the original Final Fantasy VII legendary. But this remake isn’t content to just copy the past. It’s building toward something bigger, more ambitious, and deeply emotional.\n\nIf you’re a fan of the original, this is everything you could hope for — and if you’re new to the series, it’s one of the best RPG experiences you can have today. It’s not just a game; it’s an experience that stays with you long after you put down the controller.\n\nFinal Verdict:\n⭐ 10/10 — A stunning, emotional, and masterfully crafted reimagining that proves Final Fantasy VII still has the power to define a generation.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not even a huge fan of the original but I've played Remake twice and love it (Rebirth is even better!).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's ok. I'd say I liked this less than FF 10, 13 , 15 and 16. Weakest out of all of them. Combat just did not click with me, pretty boring.\nStory is fine, characters are great and OST is amazing. \nCool on sale!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Played through all of Remake previously on another platform.  The game is a good reproduction of a well-loved classic.  The devs added to an already great game without leaving a bad taste with their choices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, no issues with perf using a low mid pc",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Didn't play the OG FF7 but the remake has a very good story telling and the cutscenes looks superb. The combat system is fun, fast and a lot more than simple button mashing. The music is phenomenal especially in chapter 17 of the Jenova Dreamweaver fight. Can't wait to start Rebirth.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Childhood memories upgraded to emotional damage in HD.\nIncredible combat, legendary music, and visuals that go way harder than my GPU can handle\nStory hits like a truck  even when you already know what’s coming.\n9/10 nostalgia slaps hard",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Score: 94.6 (gameplay and story get counted as 2x, then everything is averaged)\r\n\r\nGameplay: 90/100\r\nPros: The side quests felt fresh, the combat mechanics were familiar but not dated, and the game ran almost flawless on a GTX 3050 at 2K-60 high shadows, high graphics\r\n\r\nCons: The hair can get a little weird at times (this is mitigated if you up-res the graphics), wide shots cause (a little) lag for a small amount of time.  During some battles, the screen goes white on me.  I couldn't see anything, but I can still control characters.  I don't know if this is supposed to be the blind condition or not, but I don't see a condition marker on the character bars when it happens.  The game (on a 3050), never hits 60FPS, but it always seems to be above 30, so it still works to smooth out the gameplay.  This would have been a perfect opportunity to have Biggs, Wedge, and Jesse as part of your party instead of NPCs, but oh well.  Also, not a fan of not being able to use items from the menu, and I wish we could set non-active characters to do certain things themselves (for instance, if health gets low, focus on healing).  If this is in the game, I don't see where.  Juggling all this while also real-time attacking is a little hard.  Lastly, the voice doesn't sync with the mouth movements.  I'm playing in English, so this may be because the mouth movements are synched to Japanese, but just in case I'm wrong, I'm posting it here.\r\n\r\nGraphics 95/100\r\nThis game was made in 2022 so it's not surprising that the graphics look amazing but can play on (what is now) a mid-range video card.  I don't need graphics better than this.  With the RAM and video card situation happening in 2025, game creators need to focus on gameplay and story while relying on graphics not much higher than this.  I mean my 3050 can run this game on high 60 at 4K (it's maxed when I do this, but it's possible), and the game looks flawless.  Why games in 2024 and 2025 require 16GB or more VRAM and a 4080 to run on ultra for a marginal increase, I can't fathom, especially when we can rely on AI upscaling.  The only reason this didn't get a 100 is because of the weird hair issues as lower resolutions (1080p, even thought this isn't low).  Top notch Square, top notch.\r\n\r\nStory: 99/100\r\nI was skeptical.  I just picked this game up (Black Friday 2025) because for a long time the idea that I was going to pay the equivalent of over $120 for FF7's remakes because the story was split over three games didn't sit well with me.  Then this went on sale for $20.  I'm not a kid anymore, but when I started playing this game, I couldn't stop.  I lost sleep because I just wanted push the story a little more before bed.  The combat felt so familiar but I couldn't place it, and  I would be looking at cloud's facial animations but seeing Sora.  Then it hit me; the combat mechanics work almost the same as Kingdom Hearts.  This was also a game that when i was a kid, I would stay up until sunrise playing because the story was so good.  The expanded content of Remake lends well to fleshing out bit characters from the original and Midgar actually feels like a city.  People are milling about talking about the state of things, enemies have their own conversations when they don't notice you, the little shops and music make the slums feel alive.  Wedge taking one for the team by having a bunch of hounds chase him so I can whittle them down as Cloud was Hilarious.  In this world, I'd be Wedge, 100%.  I'm docking 1 point because you made me fall in love with Biggs, Wedge, and Jesse and it doesn't seem like their presence will migrate to the other games in any significant capacity.  I was hoping for a deviation from the original here, especially with Jesse.  These three's personalities are so infectious, that if they were extra party members, it would have only enhanced the game more.  Damn you Square for making me fall in love with more FF7 characters that aren't coming with me for the whole journey.  The tally is currently at 5 is you count the two you lose from the original and it's prequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The combats good and the storys good too\nI just wish the air combat was better, the flying enemies are really annoying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the original FF& was the first RPG i ever played./ And i was obsessed after. So far this has been an incredible recreation. It feels really good, from the amazing graphics, to the combat system, to the updates int he story. Great job Square!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story and nice graphics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah, not as good as the original, im still salty my PSX copy got stolen when i moved houses, Aerith is cute tough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most importantly the combat is superb, creativity inspiring and deep! Both in the menus/preparation, as well as in the action.\r\nMusic and visuals excellent!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you played the original, this will make you connect even deeper with the story and the characters. only have 3 hours in and im hooked!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "not a 1:1 of the 1997 original with different playout of certain events but still an enjoyable story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im stuck at chapter 9 the town never sleep, at the 2nd stage of using the machine arm, does anyone know how to fix it? the screen just freeze after i let down the container.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely incredible music and pacing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maybe JRPG is not for me. First 30 hours were pretty good but I find it so repetitive to finish it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the original on PS1 and this was totally worth the purchase and play through.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game isn't bad but it still disappointed me in a lot of ways.\n\nPerhaps it's because of the insane praise this game has gotten that made my expectations too high. Perhaps it's because i never played the original so I don't have nostalgia bias. The fact of the matter is I can't judge this game or praise it by how faithful it is to the original version. I can only tell you if it's a good game, or a bad game. And I don't think it's a good game.\n\n[h2] GAMEPLAY [/h2]\n\nBy far the biggest disappointment was the gameplay. The fundamentals here are good. It feels satisfying to swing your sword as cloud, to swap materia and synergize abilities, to experience the unique playstyle of every character. But it falls short in building upon those good foundations, choosing instead to rely heavily on basic upgrades and surface level abilities that dont feel very creative or rewarding to master. \n\nThe systems that are supposed to enhance the combat just don't feel flushed out enough to keep your interest, especially not for a game padded out to a 30-hour runtime. The new weapons and materia I got never felt exciting or powerful enough to peak my interest. Most of them are always \"deal more damage\", \"have higher mana\", \"have higher luck\". The armours and items suffer from the same issue, with the necklaces and rings having such little creativity that most of them boil down to \"Don't die once per battle\", \"deal 5% more damage\", \"deal 5% more magic damage\". \n\nIt speaks to a design philosophy that abandons creativity in favour of pure stat progression, and it results in a combat experience that, when stretched out to this game's run time, very quickly begins to feel monotonous and disconnecting. You just never feel any motivation to fully engage in its systems because its basic design discourages you from doing so. It's so detrimental to the experience that once you hit the 8-hour mark, you find yourself just going through the motions on auto pilot as the game keeps throwing combat encounter after combat encounter at you.\n\n[h2] LEVEL DESIGN [/h2]\n\nWhat really pushes the monotony of this game the most is the level design. I don't want to underscore how much work and effort has gone into this game's environments and their details. This game truly is gorgeous, the cut scenes are impeccable, the lighting and environment design is breath taking. But it's all severely hijacked by an insanely oppressive level design that discourages any exploration outside of its scripted sequences. The sheer number of times I wanted to go out to explore and discover new places just for the game to c0ck block me with a warning and force my character back to the scripted zone is ridiculous. \n\nAnd when you do finally get permission to explore some areas, you'll quickly realise there is literally nothing worth exploring. No interesting caves to discover, no hidden bosses to find, no fascinating side quests tucked away to be found. Just extremely linear levels with constant dead ends and the odd few chests that have a boring item inside that you'll forget you ever got. \n\nit's just not good and by the time you hit the mid section, it begins to suck the life out of everything in this game. Long, padded out corridors that look gorgeous, but are so empty and lifeless. Endlessly re-used sections, like the sewer system, with re-skinned monsters and uninspired traversal that forces you to watch your character slowly squeeze through cracks for the 100th time. There are some puzzles sprinkled in to break the monotony, but they are so basic and worthless. They are literally \"go grab the key in the other room to open this door\" \"move the arm to open up the exit\". It is so low effort.\n\nLook some of my favourite titles are linear. I have no problem with linear game design, so long as it's done well and in a way that makes the limited exploration feel rewarding, not oppressive.\n\n[h2] STORY [/h2]\n\nThat leaves the biggest offering here and what I believe made most people like this game, the story. The story really does have great highs, but my god is it completely sabotaged by its horrendous pacing. There is so much world & character building here that is developed really well, only for it to crumble under the heavy weight of boring plot points, on the nose dialogue, and dark themes never fully explored. I can see a great story here, I really can. But it is so tragically decimated by its poor execution.\n\nBy poor execution, I mean poor pacing with over 10 hours of filler content, Random side characters taking center stage for no reason and rehashed plot beats that completely disconnect you from the story. By poor execution, I mean a lack of subtlety in dialogue, with every character just announcing their feelings, every complexity simplified, every theme spelled out to you as if you're a third grader that can't read between the lines yourself. By poor execution, I mean character archetypes so boring and predictable, you basically know everything about them from their first introduction. Like pretty women that's very kind and caring. Buff man that's a hard ass but also loves his daughter. Main character that's always nonchalant and too cool for school but has a dark past. \n\nI think by far the worst of it was the weird love triangle the game is so insistent on in-cooperating throughout the story. Its such a bizarre tonal shift when put in contrast with the game's themes of terrorism and corporate greed. Like not 10 minutes after completing a terrorist attack on Shinra, you're on a date with tifa, roaming the city and doing chores as she flirts with you. It is such a jarring experience and it completely defuses any stakes build by the narrative. \n\nThe side missions are also really uninspired. They are literally just fetch quests dressed in a narrative gown, except the narrative gown also still sucks. Go find 5 kids, go kill this monster, go find 3 chocobos. It is bottom of the barrel low effort chores disguised as missions. I have completed all of them and i can confidently tell you they changed absolutely nothing in my experience. Some even made the experience much more monotonous if anything. The minigames were okay atleast.\n\nLook there's a good skeleton here, there really is. But the meat around it is rotten. And unless you have a good tolerance for rotten meat, you will not like this. I certainly did not.\n\n[h2] POSITIVES [/h2]\n\nI know this review has been majorly negative, but I can't stress enough how impressive some things in this game are. The graphics truly are gorgeous, with immersive lighting and vibrant colours that really brings the world and its environments to life. The sound design is crisp, clean, realistic and eargasmic, making every footstep, every spell and every swing of the sword incredibly immersive. The combat fundamentals truly are so satisfying. You can feel the impact of cloud's sword, the recoil of Barret’s gun, the punches and kicks of Tifa's attacks. It is, on the most basic level, very fun. The sheer scale of content here really is insane, with well over 30 hours of content to sink your teeth into. It's just such a shame a lot of the content is executed poorly or just filler.\n\n[h2] CONCLUSION [/h2]\n\nThis game feels like a project with tremendous potential that never managed to leverage its own strengths. The combat has flashes of brilliance but becomes stale long before the credits roll. The world is beautiful but designed in a way that actively works against curiosity. And the story, which should have been the game’s saving grace, collapses under weak pacing, shallow characterization, and dialogue that refuses to trust the player.\n\nThere is a good game buried somewhere under all of this, but it’s constantly overshadowed by decisions that make the experience feel padded, predictable, and ultimately not fun.\n\nFor all the praise surrounding Final Fantasy VII Remake Integrade, I walked away feeling more frustrated than fulfilled. \n\nAnd because of that, I do not recommend it.\n\n6.8/10",
      "voted_up": false,
      "votes_helpful": 245
    },
    {
      "review": "Expected way more from the critically acclaimed FF7 remake, essentially its an glorified movie game with heavy corridor walking simulator elements. Gameplay is lackluster action rpg style not turn based, buy at an steep discount and play with nude mods.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is my second Final Fantasy game. After playing games like Witcher 3, Expedition 33 and Octopath Traveler; this game feels like a joke. But even if I didn't play them, the acting, story and lore are mid for a AAA title. The interactions feel cheesy and cheap. The music is good, gameplay is enjoyable. Lots of mini-games.\nThe game has some occasional huge frame drops.\nSide quests forcing you to traverse the same maps over and over again, like in a MMORPG.\nQuests that don't make sense: Secret Medicine. Doctor asks me for usual ingredients that Aerith brings him, then includes the most ridiculous ingredients ever, that forces you to kill a monster in a secret lab. This is what Aerith \"usually\" does?\nI just couldn't connect with the characters.\nFor me, FF 7 Remake is like a comedy movie that tries very hard to be sad, dramatic and serious.\nIf you're not a Final Fantasy fan or very bored, I would suggest to consider other games before you even think of buying this. It is not a bad game, but a situational buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The opening is really nostalgic and feels fun, until you progress further and realise the combat amounts to nothing but irritating nonsense and the level design falls short of anything that can resemble fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's very mid. As a big fan of the original I don't mind the story changes, it's really cool actually.\n\n I'm trying to keep playing because it's nice to relive a childhood favourite with modern graphics and epic cut-scenes, but between all the dumb, monotonous Ubisoft side quests and half-action-half-turn-based combat that just feels clunky and does neither well it's just really dull and soulless. \n\nI'm just suffering through the sh*tty gameplay to get to the next cut-scene and at this point I'd rather watch a let's play. Makes me wish I could erase my memory of Clair Obscure and play that again.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game's horrible writing makes grown up, traumatized characters facing serious life thretening situations talk and act like children. Not to mention it is bloated with unmeaningful sidequests and side charaters you cant'give a fuck about.\n\nOnly thing that holds this game together is it's combat and the general fantasy of seeing this story retold(and rewritten) in modern technology.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "100% in ~62 hours. [spoiler]Requires running through base game + DLC  twice (normal & hard).[/spoiler]\r\n\r\nStory & graphics were good, but everything else felt shallow. I wouldn't recommend this to a friend even at a deep discount.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Like many FF7 was my favorite game growing up and it had a formative impact on me in many ways. When the remake was released I bought a PS4 just to play it... and I was pretty disappointed back then. The action game type just feels like a boring slog to me. The real killer was the garbage filler content.\n\nAfter reading that much of the filler can be bypassed I decided to give it a try on PC, since consoles are a pain anyways. I'm keeping a more open mind about the action system and this time around I think it's OK. Nothing special, no real strategy to anything but hey I'm really just here to get to explore the locations I loved in better detail and to see the characters who I accounted friends with real animation so I don't mind.\n\nThen you get to Sector 7 and hit the filler again. So you can't skip it right away. You pretty much need to do one or two basic quests before it gives you the option to bypass the rest. Do so and select yes on a several warnings and great things proceed... right into another whole filler content area (Jessies' arc). It's so cartoonishly dumb. The new characters thrown in are forgettable trash (motorcycle SOLDIER guy). There are no stakes, you pretty much just arcade your way through defeating (not killing, I'll get to this in a bit) hundreds of guards and dozens of mechs to steal weaker explosives for Jessie to use on the next reactor.\n\nOk boring action aside. Terrible filler aside. There are three absolutely unrecoverable problems with the remake-\n1. No stakes. You're eco-terrorists living in a corporate controlled authoritarian tech Polis in the slums crushed under wealth inequality... but there's now no risk. Apparently you and all the characters right at the beginning of the game can defeat any number of opponents without suffering serious injury or death. There are a bunch of side characters doing the eco-terrorism gig too and them vs Shinra might as well be a sport league. It takes the darkness and hopelessness of Midgar that Avalanche is the idealistic core of dreamers who are the few who actually risk everything to make change (and are demonized for it) and ... now everyone in the city is on your side practically. Most everyone is on an Avalanche team it seems and regularly beats up Shinra guards with no consequences.\n\n2. No death. There are scenes specifically clarifying that after cloud slices a group up with his sword that they are just knocked out and not dead. The story would have you believe that you in your violent idealistic terroristic assaults kill nobody. It's all just black and white, good guys vs bad guys with no hard choices and no real consequences. It takes heady topics and complex grey areas of the original and washes them into mindless nothing.\n\n3. The characters don't act consistently. I, like many of you, feel like I know these characters. Not just from replaying the original multiple times but from other content that came out as well (Dirge of Cerberus, Advent Children, Crisis Core [where some of these problems started]) and the core of these characters is not maintained at all in this rendition. Cloud has been softened from a JPop unsociable sociopath who learns to love and care to instead just be a milk-warm nothing of a protagonist. He helps everyone with little to no hope of a reward. He's politely joking and silly all the time from the start. There's no journey without his beginning misanthropy. He's not relatable without the unraveling of his spiky (heh) exterior  as you learn about his traumatic history. I could provide dozens of examples for lines or other characters but this is already getting long.\n\nThe gameplay could have sucked (as it does) and I wouldn't have minded. They could have filled it was more garbage filler than actual game and since it's skippable (if you know when and how to select those skips) I wouldn't mind too much. But as this is, it's lost all of its meaning, all of its gritty risk and introspective philosophy (hell the whole story is about being eco-terrorists trying to save the world while innocent bystanders sometimes end up as collateral damage!) and it's lost the core motivations and complex nuances of the characters.\n\nOverall it's a shameless cash-grab most of the time, with some really lovingly recreated content that requires you struggling through so much useless garbage to get to.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I applaud SE for trying something new with this. Unfortunately the new is worse than what came before. Setting a whole game solely to Midgar kills the pacing of the game. What kills the rest of the game is the combat. I'll admit I'm not the biggest fan of 3rd person combat in general, but this game manages to combine the worst parts of realtime and turn-based. ATB system slows down the realtime combat, and realtime combat kills most of the tactical levity of turn-based one. Very much doubt this one will be fondly remembered as classic.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Avoid at all cost. Game is too annoying to even begin with.\n\nLets start with the good: visuals and voice acting are decent. Plus there are 2 reasons to actually play it and 2 smaller ones if u count Aerith. But thats it.\n\nWriting completely sucks, main story feels like a filler with dialogues about nothin rly interesting or important. Side content completely skippable.\nWhenever u enter puzzle area companions will give u solution before u even realize. Cutscene to everything like entering or leaving elevator with talking bout how happy or sad everyone is.\n\nThe amount of hidden loading screens where ur forced to walk, crawl or whatever slow af is crazy. Sometimes it feels like its closer to walking sim than action game.\n\nWell, im just disappointed, rly wanted to like this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good\n- Graphics are ok\n- Voice acting is good\n- Combat is sometimes fun\n\nBad\n- Lighting is strange\n- Sephiroth used to be mysterious badass, now he's just Cloud's BFF\n- Full of unnecessary filler content and stupid minigames\n- Sometimes feels like a comedy musical instead of FF7\n- Changes to the OG main story makes no sense\n\nIf you are looking for the OG story with a facelift, this is not it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I never played the original FF7, my first venture into the FF series was with 8 but I always heard of 7 was much better so I'm a little late to the party here having bought the remake like 30 years after the original so perhaps it's the 30 years of people telling me how amazing it was that left me expecting too much. I enjoy the combat system and the gameplay itself is pretty fun, the materia stuff is cool and the weapons, graphics and aesthetics of the world are decent - but Christ I am struggling to stomach the overwhelming amounts of 'anime bulls**t' and fanservice... Every female character is beyond ditzy and has to have a cute little giggle every 3 seconds they're on screen, they all punctuate every damn thing they say with a fist in the air or a little pose and it's just gratuitous at this point. I've got to like chapter 10 now and it gets worse and worse the further we go on, Tifa was bloody awful but now I've met Aerith I want Tifa back at least she didn't constantly try to do cute things... I've played anime style games before so I know they can be a little on the nose and subtly and decent writing are non existent but this game is by far the worst for it. (And you people have the audacity to mock FFX's dialogue!) I'm currently playing in like 2 hour intervals because I need a break from it all or I feel I'll blow my brains out.\r\n\r\nYes I'm an old man yelling at a cloud, what of it?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was fun at first, graphics are beautiful and combat is fun, but the pacing is so antagonistically slow I had to give up. Won't buy the rest of these.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Summary of why I dont recommend this game.\n1 Game lives on the fact its a pilgrimage for ff7 fans, beyond that it is not a final fantasy game, it is some sort of fast paced hack and slash 3rd person japanese style as other games of that type, not ff7\n2 Game consists largely of enormous labyrinths and mazes with no clues, often in poor visibility, expect to be totally lost and confused due to disorienting effect of the camera angle. Not fun. Expect to spend hours traversing a small segment of some maze, and for maze quests to go on and on and on before you can exit the maze, after exiting the  bonus mazes after that. It is frustrating and tedious in extreme.\n3 Camera rotating is a skill that is vital in combat and for sense of bearings in traversing maps, and you will very often be disorientated and lose bearings even on short trips. Not fun.\n4 Plot differs from the original in some extra content, but it is ridiculous what theyve added and not believable and totally off the wall wacky. I suppose it is cannon coz square made it but this tainted my opinion of FF7 devs in a major way if this is the sort of people they are, then it turns out ff7 original was sort of a fluke and not a trademark.\n5 Combat consists entirely of button mashing , you do not have the option to use spells or abilities or items unless the ATB bar has filled up, meanwhile you can be hit during that time, and it is a long time to fill up 1 of the 2 bars so that you can use 1 spell or ability.\n6 Again combat is horrendous , there is zero strategy in it, there is no pausing to think what is the best move, you roll around the area button mashing, thats it basically. If you fill one bar you can use 1 spell. \n7 Look past the wow factor that comes from nostalgia , coz in the first few hours you will be posting \"this game is awesome\" but after several chapters the reality hits you, this game consists of labyrinths which if it wasent for the ff7 theme and story would make a horiffically frustrating bad game. Imagine if this game was not ff7 but reskinned to some other story and had no ff7 trademark label on it to sell it, the game would not be popular at all and would have mostly negative reviews on steam. The trademark and the nostalgia is what gets the positive reviews and temporary \"wow this is epic\" feeling, but without living on the ff7 nostalgia to make a totally different game this game would be nothing and very bad experience.\n8 Combat versus ghosts is very frustrating coz they go invulnerable for prolonged periods and you can not hit them and your ATB bar charges so slowly that all you can do is run around to dodge, meanwhile you cannot dodge effectively in this game coz if an enemy move is going to hit you then it does regardless of if you run or roll around. The rolling therefore is for dramatic rolls into combat but in practice it does little else. Barret also has a very short distance roll which doesnt even remotely dodge anything.\n9 The maps are full of mazes which are hard to navigate , even towns (sectors of midgar) are quite large maps, and after being wowed with how they rendered the slums for example, there is only so much filler content of *slum house *slum alleyway etc that you can be wowed by before you settle on the fact that \"ok this map is huge and almost all of it is uninteractable filler content that is just more alleyways in the maze\" and the wow effect does not last forever. I have played for 23 hours apparently and it has already worn off and I find myself angrily trying to skip quests and get out of a level / chapter as fast as possible.\nThis does not bode well for replay value.\n10 The soundtrack apparently won some award but I suspect that is due to pressure on steam to give ff7 remake the award, because the soundtrack is not like the original, it is some japanese fast paced RPG take on the original soundtrack and it sounds wrong and tiresome to listen to. There are times when battle music plays loudly for prolonged periods as you rush around still stuck in some maze looking for some ladder or switch and it does not fit the mood or setting at all. There is also jazz remakes of original songs which play on music machines in certain locations but why a player would want to listen to such crap music mutilating the great songs of the original i dont know. But fanboys and sicophants will do anything.\n11 There is no ability to grind battles to get a high level character on your own merits, once a certain enemy/s in a certain location are defeated, thats it, they do not respawn more, EVER, which means that your level of characters is set to a certain level and limit and there is no opportunity to grind hard for extra EXP. The only option to increase stats through voluntary battles is to take side quests which all show up in a list, so they cannot be discovered as you wander the map, rather they are all given in a list to you immediately, and in some of these quests there is battles.\n12 Due to the games horriffic combat and button mashing and robbing players of the ability to strategize or control the battle as they could in the original, the boss fights are very hard, even early bosses are OP, and worse, you cannot use a heal spell or item unless your ATB gauge charges up, and sometimes your melee attacks will do little damage, so you can only use spells, which also take 1 ATB bar to be able to cast.\n13 there is no farming your materia to increase your materia levels, they upgrade way too fast, and there is no supply of enemies on tap for you to farm to increase your materia. So you cannot end up with OP spells as a result of hard grinding work early on, you will be stuck with basic spells until the game decides you can have sufficient enemies to increase your materia level.\n14 Again, bosses are OP, and they pull off special moves and attacks which require a dodge , many of which cannot be dodged, but which seem to demand that you interact with the boss in battle according to some strategy, which you cannot develop in the first place because there is no time, no prior experience of the boss, and you dont know what the bosses OP attack will do until it does it, which means your dodging, even if dodging by means of a roll works sometimes, always comes at the risk of the boss getting several OP hits and moves on you before hand so that you are always reacting to the boss and never outsmarting it with a supposedly clever use of rolls and back hits.\n15 The chapters / levels of this game go on for quite a while and when trapped in one of the many maze levels it becomes a truly tedious and frustrating grind and it is not fun at all and does not bode well for replay value, this point is so important i say it again.\n16 If concerned about avoiding \"woke ideology\" there is some but not much, there is subtle subversive things in there and in the chapter where cloud dresses up as a woman and basically goes to the moulin rouge strip club, this is all exuding gay vibes in a way that was not comfortable to sit through this long level and i wanted to get past this chapter ASAP.\n17 bonus note. This game is incredibly short, 18 chapters and then its over. Your stats dont carry over into the other remakes. There is no point or way to grind exp or materia. I looked it up and apparently the game is nearly over for me. It was expensive but all I got was this crummy appetizer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐  You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n⚔️ Don‘t look too long at it --cutscenes are beautiful but it runs ugly everywhere else unless you got mods\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n⚔️ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n⚔️Eargasm --even went to the orchestra\n☐  Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐  Teens\n⚔️  Adults\n☐ Grandma \n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☐  Rich boi\n⚔️ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n⚔️ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐  Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n⚔️Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐Average\n☐ Good\n⚔️  Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n⚔️ Long\n☐  To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n⚔️  If it's on sale -- like $20 range\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐  Minor bugs\n⚔️ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n⚔️ 5 -- just want it as graphically beautiful here as on playstation \n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The narrative pacing feels off. The story often doesn’t match the character design or the world building, making some moments feel jarring. Certain levels are poorly designed and feel disconnected from both the characters and the setting. Playing through the game, you often wonder why the protagonist can’t simply do something obvious, he clearly could, but the game forces him into unnecessarily convoluted actions just to make certain narrative events happen. Many plot developments feel forced and hard to believe, which makes the story feel inconsistent at times.\r\n\r\nOn the positive side, the graphics are solid and visually impressive, capturing the atmosphere of the world well.\r\n\r\nOverall, while it has strong visuals, the game struggles with narrative coherence and level design, which can make it a frustrating experience for players seeking a story that flows naturally.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I feel like most of the effort was put into making everything look as life-like as possible.\n\nThis remake is eye candy, there's no denying that, but when everything else is either mediocre or just down right awful, I fail to see why this game even got made (aside from money).\n\nThis unholy obsession that modern games have with replicating this GTA/RDR2 style movement where everything has to look as realistic as possible really has to go. Wanna do an action? You have to wait until you character settles into an idle position, which will basically happen every single time. I seriously don't see an issue with making sure regular gameplay doesn't require such animation, it can just be saved for cutscenes, since there are a TON of them. If I wanted to see how cool it is to observe intricate movements and realistic sun beams, I'd go outside.\n\nThe combat, while flashy, gets repetitive especially when you have to repeat the same three things every encounter. I understand turn based RPGs are like this in nature, but this ditches that formula in favor of something more action oriented.\n\nThe music is great. I was really fond of the Collapsed Expressway theme. To be honest I'm not really all that impressed since this is a Final Fantasy game.\n\nWe have GOT to get Nomura out of the director chair.\n\nThis is just a personal nitpick but why the hell do I have to find an alternate route when a 3 foot high obstacle gets in the way as if my blonde anime dude can't leap thirty feet in the air and wield a 300 pound sword like it's paperweight?\n\nCharacter writing is good, I liked seeing Cloud go from selfish dick to someone who cares deeply about his newfound family. Everyone else was great, because Jesse, Biggs, and Wedge had actual backstory instead of 10 lines of dialogue. \n\nThe actual story is questionable. Sephiroth shows up every other two hours and it feels like they only incorporated him for fan service. Instead of being something that is accessible for people who have or haven't played the original FFVII, it's weirdly catered towards OG fans especially because Zack shows up near the end alive and well, and I really doubt newcomers know who Zack is.\n\nI'm also unsure why they sometimes opt for pre rendered cutscenes when there are already so many in-engine cutscenes that look as good if not better.\n\nYou might enjoy this, I sure didn't. I can see why someone would, but I think anyone who was played this can also see why me and many others didn't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The original FF7 is acclaimed as a game with a great story so I was quite surprised when 10 hours into this remake I hadn't encountered any story. There's not even that much combat either, most of my time has been spent running between plot devices and watching cutscenes impressively bereft of any substance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring. The gameplay is too plain, you cant dodge attacks, you can only parry or block them and even so you would still take damage. The battle system itself is somewhat a semi turn based RPG. In order to use abilities or even items, you would need to hit the enemies for a certain amount of time to gain 'action' cost. Then finally you can use a single item or single skill/magic. Just make it fully turn base at this point, it makes no sense. Story is meh, narratives are funny and interesting sometimes and the acting from the VA is solid. But the game limits so much you can do, in some areas you arent allowed to sprint for no apparent reason, the map has no gps tracking/guiding feature which means you need to move and check the map constantly to guide yourself to the destination. If you like modern rpgs that are face paced, this game is definitely not for you. Even the gimmicks in Genshin impact feels more interesting/rewarding to finish. I have 13 hours in I havent gotten anything that seems useful from looting chests, finishing the gimmicks where I cant even skip. Couldnt believe this was a highly rated game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Be aware of this issue the game suffers badly from a glitch that blinds your screen white. I don't know anyway to remove the issue but I have googled it and I come across many threads of this game having the white screen issue. I would honestly avoid purchasing because the game should be working correctly not a broken mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I constantly get \"FATAL ERROR\" randomly when playing the game. Apparently it's a fairly common problem for players with tons of snake oil fixes such as trying to mod the game, edit .ini files or move save files around. The game just works randomly for a bit then crashes again. The game randomly is washed out on boot because something is wrong with the HDR implementation. Even when it does work there are dozens of mods trying to fix the washed out filter the port has on randomly with different ReShades. I've spent probably the same amount of time trying to fix the problems with this game as I have playing it and just gonna give up now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not a remake of Final Fantasy VII. It's a rehashing of Final Fantasies XIII and XV with a rather thin layer of Final Fantasy VII paint sprayed on top. Whatever meaty story(ies) they wanted to flesh out of this game's intro is just GAS (Generic Anime Slop). I've had better cafeteria food.\n\nThat being said: It's not a bad game, but I can't recommend this title because there's too many other better games out there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you enjoyed the original Cloud and thought he should be weirder than before, you're in luck!\r\nIf you enjoy 5-10 seconds of gameplay intermixed with cutscenes, you're in luck!\r\nIf you enjoyed Johnny and thought he should have a bigger role, you're in luck!\r\n\r\nIf you enjoy barely being able to move between the cutscenes and also would enjoy moving slower during random points of the game because... reasons, well you're in luck!\r\n\r\n... My finger hurts from holding down fast-forward.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "absolute garbage, they didn't not stick to the original story line of FF7 that we all came to love. graphics are ok, combat metrics is lacking, weapons, spells, summons, items, & quest all lacking, not open world like the original.  it's an insult to the original FF7. not worth the price, i expected better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrendously bad PC port. I'm used to modding and jumping through hoops to get games to work but this one broke me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It crahsed every time I tried to play. It said I had corrupt files, and I needed to reverify them. I did that, and steam said everything was good. Just to open the game and have it give me the same error\n\nlowlevelfatalerror [file:d:\\j\\workspace\\B\\b_BuW64MSt\\cs\\Engine\\Source\\Engine\\Runtime\\CoreUObject\\Private\\Serialization\\AsyncLoading.ccp] [Line3883]\n\nThen eithee crash outright or freeze up a few minutes in. This game also caused my pc to reboot at random with no event logs to look at for issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes constantly on a 9800X3d with a 9070XT with \"Fatal error Game thread timed out after render thread\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very old gameplay, no matter how good the story is, I just can't give it a chance",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really surprised SE never fixed the stuttering issues. It's such a problem with so many people. Can't recommend this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This would be great, if the controller set up wasn't completely fubar. It's unplayable with a controller and the M+K controls are definitely not optimized. Total regret buying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ehh. don't like the combat system. i dont see the point of magic being restricted by both MP and ATB in an action-based system. most enemies can hard counter you or have straight up invulnerability. literally everything costs atb resulting in you either spending all of your time waiting or all of your time spamming the attack buttons until you can actually hit something, assuming you didn't already get hit by the usually unavoidable power attacks resulting in you spending most your resources on healing leading to combat being heavily drawn out; if they really wanted ATB they could have done FF12's and if they REALLY wanted Action, they could have done Kingdom Hearts, but i really dont think combining ATB and Action really fits very well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The combat. [b][i]How[/i][/b][i] [/i]can you make the [b][i]COMBAT [/i][/b]so [b][u]broken[/u][/b]? And your [b][u]companions[/u][/b] in combat sucks. \nThey won't do a thing by them self, and you need to switch around like a crackhead. \nWhy change the combat to this shit?? I loved the old games, and I want to love this too, but I can't. \nNot when you kill one big part of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I will no longer be supporting this company with their stance on AI replacing workers. \n\nDo not buy their games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Boring. On Rails. Dumb Story. Filler Galore. 5/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't even play the game on 1080p with Nvidia 2080TI GPU, terrible PC port.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is the longest tutorial I played in my life. For 10 hours straight, I feel like I am playing a new version of the beginning. It has its moments and the conversations have something nostalgic on me, but after the time I spent I thought I would head to new threats and not back to rats on a scrapyard like in the beginning (again and again).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "pros:\nLooks pretty\nGreat soundtrack\nsome cool enemies\n\nCons:\nthe \"plot\"\nthe ending\nsome parts are drawn out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, as a fan of the original (one of my favourite ever games), I found this boring. Despite the advantage of nearly 30 years of games in between....\n\nWhats good: Graphics\n\nWhats Bad:\n1. On rails - so much of it feels like an extended cinematic where you can't influence the narrative/game. You're forced to walk/run down a linear path - no real choices or consequences.\n2. Changes - There's nothing so far for me that is an improvement on the original story-line, neighbour/Aerith intro, shadowy creatures. Sephiroth intro\n3. Combat - most mobs are too easy/quick and then bosses/mini bosses are too long/boring/repetitive - the original had repetitive encounters but the combat felt varied...\n4. Basic gameplay - its simple and repetitive\n\nThe last session I managed about 10 mins of on rails, linear gameplay before I got bored, and logged out. FFVii original I could play for hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Modern slop. At least I got it on sale.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The biggest weakness of the remake, for me, is the completely overblown pacing. If you inflate a six-hour section into more than thirty hours, you inevitably lose exactly what made the original so strong. The scenes that are actually faithfully recreated do work — but in between them there’s far too much filler, ranging from harmlessly boring (side quests, chapter padding) to downright embarrassing (Chadley, Roche). And the ending is simply a disaster. The whole “AAA-ness” also rubbed me the wrong way. It feels like the Japanese Uncharted — and I don’t mean that in a positive way.\n\nI also keep wondering what this weird in-between approach is supposed to be. New players who don’t know the original are robbed of one of its strongest scenes (the end of the Shinra HQ section). Returning players who want a faithful remake get interrupted by the Nomura-Nojima nonsense. And returning players who actually wanted something new (for whatever reason, given these writers…) get a minimal amount of content.\n\nBut to end on a more conciliatory note: the combat system is the best the series has had in a very long time (since X / X-2). I hope they build on it again in another new (!) title, because there’s a ton of potential here. I especially enjoyed how varied both the enemy design and your own party members are. It’s leagues better than XVI — and not just because Normal Mode isn’t a sleeping pill. Still, it’d be nice if SE finally moved on from the “Hard only in NG+” funnel. While the remake isn’t undertuned on Normal, the bit of Hard Mode I played was genuinely fun. But I’m not doing another full playthrough immediately after finishing Normal.\n\nI also really liked the selection of short, snappy minigames. The chemistry between some characters is fleshed out more than in the original, where you had to (and could, which I want to emphasize!) read a lot between the lines. The main example is the friendship between Tifa and Aerith. The dialogues are entertaining as well — at least for the characters who already existed in the original. For all the others, I guarantee nothing.\n\nNow I’m reconnecting myself to the Valium so that one day I’ll be ready to tackle Rebirth. From Sony-style Uncharted design straight into Ubisoft-open-world busywork — woohoo!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You can't loot the first two guards you kill for potions. REMAKE RUINED",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mid. Just Mid. The Combat is hot garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The pacing is painfully slow and the combat system gets old after at most 2 hours.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "quite disappointing over all",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A nonsencial fantasy game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its quite boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I fuckin hate this game. Its objectively bad and you'd only like it if you've never played the original, and you want to pretend like you're an ff7 fan or you have shit taste. Mostly likely both. Diarrhea dump in my ear",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "DONT BUY IT",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "garbage for babies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mini Games are Crap.  Simple as that. They are grossly flawed, and somewhere along the line, between the original release on Epic to Steam, they made it 10 times worse.  Darts Game told me I had a perfect bullseye, but only gave me 1 point, saying PERFECT.  Perfect my white ***. Really wish follow up developers would quit breaking games just because they think tis too easy, so that have to make it impossible for everyone else.\n\nGame also has super weird lag spikes now.  Again, I own two copies of this game, one on Epic (which i wont play simply because Epic is worse than EA Games) and this one, and I am using a better GPU, but with reduced graphics, only to find that the Steam version stutters horribly for no reason, especially during video cut scenes. \n\nIts like they know that they have something good, so they need to tweak it in an attempt to make something great, but when that fails, instead of reverting the changes to fix the bad, they just leave it, shrug their shoulders with the words \"my bad haha\" and then tell their players to go **** themselves\n\nGot to the end of Chapter 11 only to have the game glitch out, crash and force me to go through the Rude/reno Fight 3 times before it actually managed to count it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "خياس",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn't bad but it still disappointed me in a lot of ways.\n\nPerhaps it's because of the insane praise this game has gotten that made my expectations too high. Perhaps it's because i never played the original so I don't have nostalgia bias. The fact of the matter is I can't judge this game or praise it by how faithful it is to the original version. I can only tell you if it's a good game, or a bad game. And I don't think it's a good game.\n\n[h2] GAMEPLAY [/h2]\n\nBy far the biggest disappointment was the gameplay. The fundamentals here are good. It feels satisfying to swing your sword as cloud, to swap materia and synergize abilities, to experience the unique playstyle of every character. But it falls short in building upon those good foundations, choosing instead to rely heavily on basic upgrades and surface level abilities that dont feel very creative or rewarding to master. \n\nThe systems that are supposed to enhance the combat just don't feel flushed out enough to keep your interest, especially not for a game padded out to a 30-hour runtime. The new weapons and materia I got never felt exciting or powerful enough to peak my interest. Most of them are always \"deal more damage\", \"have higher mana\", \"have higher luck\". The armours and items suffer from the same issue, with the necklaces and rings having such little creativity that most of them boil down to \"Don't die once per battle\", \"deal 5% more damage\", \"deal 5% more magic damage\". \n\nIt speaks to a design philosophy that abandons creativity in favour of pure stat progression, and it results in a combat experience that, when stretched out to this game's run time, very quickly begins to feel monotonous and disconnecting. You just never feel any motivation to fully engage in its systems because its basic design discourages you from doing so. It's so detrimental to the experience that once you hit the 8-hour mark, you find yourself just going through the motions on auto pilot as the game keeps throwing combat encounter after combat encounter at you.\n\n[h2] LEVEL DESIGN [/h2]\n\nWhat really pushes the monotony of this game the most is the level design. I don't want to underscore how much work and effort has gone into this game's environments and their details. This game truly is gorgeous, the cut scenes are impeccable, the lighting and environment design is breath taking. But it's all severely hijacked by an insanely oppressive level design that discourages any exploration outside of its scripted sequences. The sheer number of times I wanted to go out to explore and discover new places just for the game to c0ck block me with a warning and force my character back to the scripted zone is ridiculous. \n\nAnd when you do finally get permission to explore some areas, you'll quickly realise there is literally nothing worth exploring. No interesting caves to discover, no hidden bosses to find, no fascinating side quests tucked away to be found. Just extremely linear levels with constant dead ends and the odd few chests that have a boring item inside that you'll forget you ever got. \n\nit's just not good and by the time you hit the mid section, it begins to suck the life out of everything in this game. Long, padded out corridors that look gorgeous, but are so empty and lifeless. Endlessly re-used sections, like the sewer system, with re-skinned monsters and uninspired traversal that forces you to watch your character slowly squeeze through cracks for the 100th time. There are some puzzles sprinkled in to break the monotony, but they are so basic and worthless. They are literally \"go grab the key in the other room to open this door\" \"move the arm to open up the exit\". It is so low effort.\n\nLook some of my favourite titles are linear. I have no problem with linear game design, so long as it's done well and in a way that makes the limited exploration feel rewarding, not oppressive.\n\n[h2] STORY [/h2]\n\nThat leaves the biggest offering here and what I believe made most people like this game, the story. The story really does have great highs, but my god is it completely sabotaged by its horrendous pacing. There is so much world & character building here that is developed really well, only for it to crumble under the heavy weight of boring plot points, on the nose dialogue, and dark themes never fully explored. I can see a great story here, I really can. But it is so tragically decimated by its poor execution.\n\nBy poor execution, I mean poor pacing with over 10 hours of filler content, Random side characters taking center stage for no reason and rehashed plot beats that completely disconnect you from the story. By poor execution, I mean a lack of subtlety in dialogue, with every character just announcing their feelings, every complexity simplified, every theme spelled out to you as if you're a third grader that can't read between the lines yourself. By poor execution, I mean character archetypes so boring and predictable, you basically know everything about them from their first introduction. Like pretty women that's very kind and caring. Buff man that's a hard ass but also loves his daughter. Main character that's always nonchalant and too cool for school but has a dark past. \n\nI think by far the worst of it was the weird love triangle the game is so insistent on in-cooperating throughout the story. Its such a bizarre tonal shift when put in contrast with the game's themes of terrorism and corporate greed. Like not 10 minutes after completing a terrorist attack on Shinra, you're on a date with tifa, roaming the city and doing chores as she flirts with you. It is such a jarring experience and it completely defuses any stakes build by the narrative. \n\nThe side missions are also really uninspired. They are literally just fetch quests dressed in a narrative gown, except the narrative gown also still sucks. Go find 5 kids, go kill this monster, go find 3 chocobos. It is bottom of the barrel low effort chores disguised as missions. I have completed all of them and i can confidently tell you they changed absolutely nothing in my experience. Some even made the experience much more monotonous if anything. The minigames were okay atleast.\n\nLook there's a good skeleton here, there really is. But the meat around it is rotten. And unless you have a good tolerance for rotten meat, you will not like this. I certainly did not.\n\n[h2] POSITIVES [/h2]\n\nI know this review has been majorly negative, but I can't stress enough how impressive some things in this game are. The graphics truly are gorgeous, with immersive lighting and vibrant colours that really brings the world and its environments to life. The sound design is crisp, clean, realistic and eargasmic, making every footstep, every spell and every swing of the sword incredibly immersive. The combat fundamentals truly are so satisfying. You can feel the impact of cloud's sword, the recoil of Barret’s gun, the punches and kicks of Tifa's attacks. It is, on the most basic level, very fun. The sheer scale of content here really is insane, with well over 30 hours of content to sink your teeth into. It's just such a shame a lot of the content is executed poorly or just filler.\n\n[h2] CONCLUSION [/h2]\n\nThis game feels like a project with tremendous potential that never managed to leverage its own strengths. The combat has flashes of brilliance but becomes stale long before the credits roll. The world is beautiful but designed in a way that actively works against curiosity. And the story, which should have been the game’s saving grace, collapses under weak pacing, shallow characterization, and dialogue that refuses to trust the player.\n\nThere is a good game buried somewhere under all of this, but it’s constantly overshadowed by decisions that make the experience feel padded, predictable, and ultimately not fun.\n\nFor all the praise surrounding Final Fantasy VII Remake Integrade, I walked away feeling more frustrated than fulfilled. \n\nAnd because of that, I do not recommend it.\n\n6.8/10",
      "voted_up": false,
      "votes_helpful": 245
    },
    {
      "review": "Hot take but this is kind of boring, combat not that great, atrocious pacing. I'm usually easily pleased with videogames but if you're not already a big fan of FF7 not sure I recommend this.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Expected way more from the critically acclaimed FF7 remake, essentially its an glorified movie game with heavy corridor walking simulator elements. Gameplay is lackluster action rpg style not turn based, buy at an steep discount and play with nude mods.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I haven’t actually finished this game. Honestly, it’s been tough to keep playing. Maybe I’ll change my review if something suddenly clicks, but I doubt it. I’ve played through the original Final Fantasy VII at least 20 times over the years, so I’d call myself a pretty big fan.\n\nThe graphics are obviously nice, and the sheer amount of dialogue from random NPCs is impressive. But even with the visuals, I kept noticing \"immersion\" breaking details little filler assets that felt out of place. Things like a tipped-over modern ambulance just sitting there, which doesn’t fit the FF7 theme at all. Once you start looking, you see more of those throw-in objects, and it pulls you out of the world.\n\nIn the original, Midgar was just the intro a way to establish the characters and story before the real journey began. Here, they stretched it into a full game, and I think it just doesn’t work. Instead of adding meaningful story to support the length, most of my time felt like running errands: fetch quests, side missions, and “go here, kill this type of monster.” That or they drag out a part of the game by just making a long path with some tedious things like moving stuff around with mechanical arms like 5 times, one time would of been neat or new, but then you put it in multiple times and its an obvious filler. Some people enjoy that grind, but for me it’s just tedious and it drags the story down. With the original, I couldn’t put the game down. With this remake, I often don’t even want to boot it up because I know it’s just going to be another slog of sidequests.\n\nThe battle system is modern, but it doesn’t feel special. Most of the time I just stick to one character and only swap when I need to trigger a specific ability. It’s too much micromanagement to constantly juggle everyone, and I play games to relax. Summons are another letdown. In the original, they were epic moves that felt powerful. Now they float around for a while, you take turns using them, and you can only summon when the game lets you. It feels clunky and less impactful.\n\nWhat really disappointed me is what I found out after buying the first and second parts: you can’t carry your character forward. Why would that ever be a good idea? The excuse I heard was that characters would be too over geared, but to me it just feels lazy. In the original, you could blast through and finish around level 30 if you knew what you were doing, or you could grind all the way to 99 and make the final boss scale with you. That freedom was part of the charm.\n\nI know I sound harsh, but it’s because I expected so much more. At this point I’d honestly rather replay the original. Not even out of nostalgia, it just plays more fluidly and keeps me engaged. The only downside now is the dated graphics, which feel even worse after seeing the remake. In a way, this remake actually made the original worse for me, and that’s probably the most disappointing part of all.\n\nI would give it a mixed review somewhere in the middle, but since i can't pick that I just say I don't recommend it. \nIf I had a choice, I would say if your a big FF7 fan I can't recommend it, if your younger and you like those grindy games then it is a pretty game, it runs smooth, it has a lot of positives for a normal game, just not ff7, and was a let down for me personally. I would refund the game if I could, I might still be able to refund the second part.",
      "voted_up": false,
      "votes_helpful": 113
    },
    {
      "review": "final fantasy 7 remake : the filler years. sigh...\n\nfirst of all, lets get the good stuff out of the way. the graphics are super clean and top notch, the characters are gorgeous and have excellent voice acting, the music is just as nostalgic as I remembered and the new re-imagined story is pretty good.\n\nin fact, it is the story mainly that kept me going through all the way till the end. so what's bad?\n\nthe combat, it just plainly sucks. it is trying to be both and action game, and a turn based game, and the result is a half baked, boring combat, which goes 'spam basic attack till atb bar fill, use skill', repeat with the other character. \n\nspeaking of that, the companion AI is absolutely useless for attacking, they do a good job at defending but hardly do any attacks by themselves. thus there is a lot of babysitting involved and makes combat tedious.\n\nnext, it's the filler stuff, dumb, menial side quests, a result of trying to add more padding to an otherwise very short story... just like cloud, I was groaning at almost every one of it.\n\nand finally, the lazy pc port. the amount of graphic options you can adjust is just a joke. I had to install a mod, then resort to editing an ini file just to turn on anisotropic filtering, turn off motion blur and depth of field. thank god for pc modding!\n\nreally hope rebirth is better than this. 4/10.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "100% in ~62 hours. [spoiler]Requires running through base game + DLC  twice (normal & hard).[/spoiler]\r\n\r\nStory & graphics were good, but everything else felt shallow. I wouldn't recommend this to a friend even at a deep discount.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "All they had to do was copy the original story, and make it pretty.\n\nAs I looked down on the Midgar Slums, I thought \"maaaaan, this is SO COOL!\"\n\nThat was one of the few highlights in the game. The rest of the time I was just waiting to finish. I don't remember having any fun during my playthrough.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "While the original is a 10/10 I would give this remake a 5/10. It's a game like many others that feels very stretched and full of \"extra\" stuff to do to fill it up. I don't understand why they didn't make a proper remake with fixed camera and the old combat system, it would be an absolute banger.\n\nI played some hours and then started the original - modded with better graphics and audio and it is still an amazing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really didnt want to leave a negative review for anything ff7. Kid me would lose his mind.\nBut they ruined my favourite game. \nI wanted a remake more than anybody, but to me final fantasy is a strategic game not an arcade beat em'up. \nPlus, the point of Sepheroth is that you only see the damage he inflicts for the first 3 hours, he's super mercurial they lost that in this game.\nHad they done this game like Clair Obscur: Expedition 33 or even like Yakuza 7, both fantastic games, it would have been legendary.\njust another example of them wanting to take a  beloved media form and remake it, not for those to whom it is beloved, but for this imaginary \"universal audience\"",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Honestly, calling this a remake feels misleading. It covers only the first 5 hours of the original Final Fantasy VII, stretched into over 30 hours, and it’s only part 1 of 3 — meaning this story started on PS4 and might not finish until the PS6 era. Remake (Part 1) is currently 40€, Rebirth (Part 2) is 70€, and you’ll have to pay for Part 3 when it comes out. I understand it’s up to each player, but this feels like a strange way to stretch costs and development time.\n\nThere are many slow moments, forced walking, and tight corridors that drag down the experience, breaking pacing and immersion.\n\nThe game also adds too many new story beats that contribute almost nothing meaningful. Some changes drastically alter characters, themes, and events, making the story feel less impactful than the original. While a few elements shine, most additions dilute the charm and emotion of the classic game.\n\nSome design choices, like longer cutscenes and altered pacing, feel like unnecessary padding. If the goal was to change story, music, characters, and combat, then calling it a remake is questionable — why not make something new instead? Fans deserved the original’s core intact.\n\nOverall, the game has good moments and impressive visuals, but the combination of forced pacing, unnecessary story changes, and a misleading “remake” label makes it hard for longtime fans to fully enjoy. If you’ve never played the original, it’s worth trying, but if you expected a faithful retelling, you’ll likely be disappointed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I keep playing hoping that I will get an actual ff7 experience. But some retard thought hey lets remove all the iconic elements of ff7 and call a game ff7 remake.... TOTAL GARBAGE!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The combat is so hilariously clunky and slow, the enemies spam unblockable and undodgeable attack genuinely what was the point of adding a dodge if it doesnt dodge anything? Its literally so useless without I-frames. Never played the original so this game doesnt get any nostalgia points from me. Its a very pretty and cinematic game but the combat system is so awful. Not to mention how drawn out every single action is, everything has a long and grueling animation, simple things like pulling levelers is so annoying.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The opening is really nostalgic and feels fun, until you progress further and realise the combat amounts to nothing but irritating nonsense and the level design falls short of anything that can resemble fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good\n- Graphics are ok\n- Voice acting is good\n- Combat is sometimes fun\n\nBad\n- Lighting is strange\n- Sephiroth used to be mysterious badass, now he's just Cloud's BFF\n- Full of unnecessary filler content and stupid minigames\n- Sometimes feels like a comedy musical instead of FF7\n- Changes to the OG main story makes no sense\n\nIf you are looking for the OG story with a facelift, this is not it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Avoid at all cost. Game is too annoying to even begin with.\n\nLets start with the good: visuals and voice acting are decent. Plus there are 2 reasons to actually play it and 2 smaller ones if u count Aerith. But thats it.\n\nWriting completely sucks, main story feels like a filler with dialogues about nothin rly interesting or important. Side content completely skippable.\nWhenever u enter puzzle area companions will give u solution before u even realize. Cutscene to everything like entering or leaving elevator with talking bout how happy or sad everyone is.\n\nThe amount of hidden loading screens where ur forced to walk, crawl or whatever slow af is crazy. Sometimes it feels like its closer to walking sim than action game.\n\nWell, im just disappointed, rly wanted to like this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A painful reminder of how games have overly focused on filling your time instead of telling a compelling story. this game has a lot of content that is not about the main characters that is also not important to the plot.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game is like seeing a big beautiful burger on your plate but once you bite into it, it's completely hollow. Nothing but air and a waste of my time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would say I don't recommend the game for fans of FF. While the game has everything that triggers that nostalgia in all of us who played the original on Playstation after school each day, this is not the remake we deserved. \r\n\r\nThe game is not true to the original. It is an absolute SLOG to get through. Literally 70+ Hours just in Midgar. There are so many areas they did not need to put into the game but they did to just continue the length of the game. \r\n\r\nThe number one complaint about the game is the combat. It is absolute TRASH. I promise you will find the die hard fanbois who are obsessed saying they beat the game on super mega impossible hard and it wasnt hard enough and they never got hit and we all suck and need to git gud but for the classic RPG turn-based experience, this aint it. Its some kind of hybrid action game pause system where you have to constantly switch characters to build up ATB. The mobs and bosses do not have to follow the same rules you do so they are constantly knocking you down interrupting you. Its a nightmare. \r\n\r\nEssentially Easy mode is stupid easy an 8 year old could kill the baddest boss while you will struggle to stay alive on normal mode; there is no middle ground its either too easy or too hard and its stupid bad.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This is the most god awful slap in the face I've ever had from a video game, absolute gutter trash piece of shit. The fact that this game is called a remake is reason enough i should be entitled to a full refund. This is not a remake of Final Fantasy 7, it's a betrayal of that name for one, but it's also literally a sequel with stupid timeline shit going on. I could live with the betrayal of the turn based format, stupid as it was that they decided \"it just can't work now cause graphics are good\", but the massacre of one of the best written video game stories ever, that managed to stay relevant the entire 30 years since it was released, is just completely unforgivable. we didn't spend almost two decades begging you to remake this game because it needed a story adaptation, we begged you for a remake because all ff7 ever needed was a fresh coat of paint, which it got in the advent children movie, and we wanted to see the game look like that instead of looking like a lego simulator running on windows 95. Calling this an FF7 remake is literally false advertising. i would have preferred you literally took a crap in my hands than sell me this slop.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Clearly ported under duress with extra effort being put in to create a deliberately worse experience.  One of those situations where its glaringly obvious noone bothered to play through it  once in the entire development cycle.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fuck the motorcycles, fuck the slow walking, fuck the camera being wrenched out of my hands every 30 seconds or so to stare at a set peice and fuck the weird, repetitive quests that are there to pad the run time of the game because they sure don't add anything to the story.  I wanted to like this game so bad, but by the time i got to the end, i was praying for it to be over.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I wouldn't recommend this by itself at any price. It's an extended tutorial the game never opens up it's a long hallway with 3 areas into a separate final empty building. The length of the game is purely from backtracking and obstacles inhibiting movement walking the straight line. It's constantly removing party members so any sort of build you may be going for or setting up a proper party goes out the window. The game boils down to heal and attack better without any reason to do anything other than waiting till the enemy dies while spamming heal since a big issue with the combat is there is way too much damage flying around you are either getting chunked or oneshot or doing the chunking and oneshotting making the limits/summons are pointless for the most part if you are using them you've already won since they're only available at the end of boss battles by they time you pull them out the boss is already at 5% health. \r\nI think this is the most padded game I have ever played the actual gameplay content here is around 10 hours. And SquareEnix tried to sell this at full price, out of their minds.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Main story and Combat are great. However you barely get to actually play the game, being forced to stop every 5 minutes to stare at the other characters while they say pointless crap completely ruined it for me",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's very mid. As a big fan of the original I don't mind the story changes, it's really cool actually.\n\n I'm trying to keep playing because it's nice to relive a childhood favourite with modern graphics and epic cut-scenes, but between all the dumb, monotonous Ubisoft side quests and half-action-half-turn-based combat that just feels clunky and does neither well it's just really dull and soulless. \n\nI'm just suffering through the sh*tty gameplay to get to the next cut-scene and at this point I'd rather watch a let's play. Makes me wish I could erase my memory of Clair Obscure and play that again.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game's horrible writing makes grown up, traumatized characters facing serious life thretening situations talk and act like children. Not to mention it is bloated with unmeaningful sidequests and side charaters you cant'give a fuck about.\n\nOnly thing that holds this game together is it's combat and the general fantasy of seeing this story retold(and rewritten) in modern technology.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was going to give this game a weak recommendation, but on writing this review, I can't really find enough good to outweigh the bad. But let's start with some stuff the game did right. And that's pretty much the visuals (very cool) and the music (decent ambient music but pretty forgettable). Some of the boss fights and enemies felt pretty unique. I actually started playing this game as the MTG set for Final Fantasy released, having known absolutely nothing about the franchise, and it was really cool to see all the references to characters in this game. Unfortunately, that's pretty much where the good ends.\n\nLet's start with the overall gameplay. Combat feels clunky. Dodging is useless for like 90% of the game. A lot of enemy attacks will hit regardless of where you dodge so you really are better off just blocking most of the time or trying to hide behind cover. Some enemies have weaknesses/resistances and you can cast spells but since most fights just were not very engaging, it devolves into mashing the attack button and occasionally throwing in a basic spell or ability. They have a \"summon\" system, which was pretty cool but without much variety, and if the fight doesn't go long you don't even get to use it.\n\nMovement is pretty bad as well, and even worse outside of combat as you're forced to run long distances with a really crappy minimap (which on keyboard controls is really unintuitive to enable). There's a lot of \"forced movement cutscenes\", like moving through a tight gap, trying to climb over something. While that's cool the first time, when it happens for the 100th time you wish you could just skip it (you can't). There's not really a simple way to backtrack, so you end up just having to run there. \n\nThis segues nicely into side quests, which is probably among the worst things in the game. Actually, part of the reason I couldn't get into FF14 was because it just felt like an endless train of fetch quests. Well, they brought that into FF7 Remake and they are largely just glorified fetch quests without discernible quest markers. I actually had to take breaks after certain chapters because they were so excruciatingly boring and tedious. There was a *lot* of running around without easy backtracking (except on quest completion, they let you teleport). I would say don't bother with these, they are a complete waste of time and often offer incredibly little narrative value.\n\nThe entire narrative was riddled with more plot holes than Cloud should be after getting peppered by Shinra reinforcements  cotton bullets. The villains (Heidegger, Don Corneo, Hojo) are so comically incompetent at their jobs and so moustache-twirling evil it's impossible to take them seriously. If any of these villains rubbed their 2 brain cells together none of the plot would have happened, because our heroes would have gunned down. There's no nuance in their characters, no real logic in their motivations. A classic case of evil for evil's sake. \n\nHow about the heroes? Cloud and Tifa feel pretty much like non-characters. Cloud starts off aloof and is generally dismissive of others. Cloud ends slightly less aloof and is sort of nicer to his friends. Tifa starts off as a nice person who cares for her friends, and ends in the exact same place. She doesn't have any memorable moments and is basically there to look pretty. Barret does undergo a minor arc, and despite starting out hating him, he seemed to allow his ideals to change as he saw the consequences of his actions. Aerith was also a nuanced character and had more complex motivations, though acts more to change Cloud and Barret than actually changing herself.\n\nI was talking with a friend the other day about this, and came to the realization that if I compared this game to Genshin Impact, it does almost nothing better. Visuals are maybe slightly worse, but everything else? For Genshin, gameplay is deeper, story is rich, characters have nuance, quests are more interesting. So aside from getting some cultural education for playing this game, it really doesn't offer very much. Overall, I'd give this a 5/10, bumped up to a 5.5/10 since at least they made Aerith and Tifa pretty attractive.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Like many FF7 was my favorite game growing up and it had a formative impact on me in many ways. When the remake was released I bought a PS4 just to play it... and I was pretty disappointed back then. The action game type just feels like a boring slog to me. The real killer was the garbage filler content.\n\nAfter reading that much of the filler can be bypassed I decided to give it a try on PC, since consoles are a pain anyways. I'm keeping a more open mind about the action system and this time around I think it's OK. Nothing special, no real strategy to anything but hey I'm really just here to get to explore the locations I loved in better detail and to see the characters who I accounted friends with real animation so I don't mind.\n\nThen you get to Sector 7 and hit the filler again. So you can't skip it right away. You pretty much need to do one or two basic quests before it gives you the option to bypass the rest. Do so and select yes on a several warnings and great things proceed... right into another whole filler content area (Jessies' arc). It's so cartoonishly dumb. The new characters thrown in are forgettable trash (motorcycle SOLDIER guy). There are no stakes, you pretty much just arcade your way through defeating (not killing, I'll get to this in a bit) hundreds of guards and dozens of mechs to steal weaker explosives for Jessie to use on the next reactor.\n\nOk boring action aside. Terrible filler aside. There are three absolutely unrecoverable problems with the remake-\n1. No stakes. You're eco-terrorists living in a corporate controlled authoritarian tech Polis in the slums crushed under wealth inequality... but there's now no risk. Apparently you and all the characters right at the beginning of the game can defeat any number of opponents without suffering serious injury or death. There are a bunch of side characters doing the eco-terrorism gig too and them vs Shinra might as well be a sport league. It takes the darkness and hopelessness of Midgar that Avalanche is the idealistic core of dreamers who are the few who actually risk everything to make change (and are demonized for it) and ... now everyone in the city is on your side practically. Most everyone is on an Avalanche team it seems and regularly beats up Shinra guards with no consequences.\n\n2. No death. There are scenes specifically clarifying that after cloud slices a group up with his sword that they are just knocked out and not dead. The story would have you believe that you in your violent idealistic terroristic assaults kill nobody. It's all just black and white, good guys vs bad guys with no hard choices and no real consequences. It takes heady topics and complex grey areas of the original and washes them into mindless nothing.\n\n3. The characters don't act consistently. I, like many of you, feel like I know these characters. Not just from replaying the original multiple times but from other content that came out as well (Dirge of Cerberus, Advent Children, Crisis Core [where some of these problems started]) and the core of these characters is not maintained at all in this rendition. Cloud has been softened from a JPop unsociable sociopath who learns to love and care to instead just be a milk-warm nothing of a protagonist. He helps everyone with little to no hope of a reward. He's politely joking and silly all the time from the start. There's no journey without his beginning misanthropy. He's not relatable without the unraveling of his spiky (heh) exterior  as you learn about his traumatic history. I could provide dozens of examples for lines or other characters but this is already getting long.\n\nThe gameplay could have sucked (as it does) and I wouldn't have minded. They could have filled it was more garbage filler than actual game and since it's skippable (if you know when and how to select those skips) I wouldn't mind too much. But as this is, it's lost all of its meaning, all of its gritty risk and introspective philosophy (hell the whole story is about being eco-terrorists trying to save the world while innocent bystanders sometimes end up as collateral damage!) and it's lost the core motivations and complex nuances of the characters.\n\nOverall it's a shameless cash-grab most of the time, with some really lovingly recreated content that requires you struggling through so much useless garbage to get to.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A Legacy Betrayed by a Broken Port\n\nI want to love this game. I did love this game — back when it ran smoothly on my 2080. But on my 4080, with a stronger CPU and more RAM, it stutters through combat starting in Chapter 6. I’ve tried everything: affinity tweaks, FFVIIHook, custom Engine.ini, disabling overlays, even monitoring thread behavior. Nothing fixes it.\n\nThis isn’t a hardware issue. It’s a broken PC port. The game underutilizes modern systems, mismanages threads, and chokes on its own particle effects during combat. Cutscenes are cinematic gold — but the pacing collapses the moment you engage in battle.\n\nI’m not just disappointed. I’m heartbroken. This game meant something to me. I built a legacy playthrough around it. And now I can’t even enjoy the emotional payoff I worked so hard to preserve.\n\nI don’t recommend this game — not because it’s bad, but because it refuses to respect the players who care the most.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They force you to play minigames and there is no way of skipping. This is plain disrespectful of paying customers time. I regret paying for this, watch the story on youtube.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I applaud SE for trying something new with this. Unfortunately the new is worse than what came before. Setting a whole game solely to Midgar kills the pacing of the game. What kills the rest of the game is the combat. I'll admit I'm not the biggest fan of 3rd person combat in general, but this game manages to combine the worst parts of realtime and turn-based. ATB system slows down the realtime combat, and realtime combat kills most of the tactical levity of turn-based one. Very much doubt this one will be fondly remembered as classic.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "if you are trying play all the FF games then yeah play this but the game doest seem to flow like the others. story is ok side quest are failed and missed without and option to go back, traveling before end game isnt worth it and playthrough isnt fun when im forced to follow a narrow path the hole game and if i wonder off to grind i get my butt kicked or no xp that helps. graphics are nice but the story is Too PG for me . overall it was ok but im at CH. 14 and bored, but i want all the FF games so maybe ill beat it later",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not a remake.    The combat doesn't feel very strategic or thoughtful.  Wayyy too fast pace and repetitive.  It's gone from RPG to reflex based hack 'n slash.  Visually it's great but the dialogue is mostly childish with a few bright spots.    I'll probably still finish it eventually.  Feels like a missed opportunity.  Hopefully the next part is better.\n\nUpdating my review after 20 more hours.  The combat in this game is hot garbage.   I thought it would get better further in, but it just gets worse.  Even if you bring the right elemental materia, enemy attacks perpetually interrupt and disable you or they just resist until you hit the right combination of conditions in a timing structure where your characters don't respond immediately.  Dodging is mostly pointless when most enemy attacks can't miss or they just move way faster than you.  I've never been more disappointed in a remake.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First of all, the characters and graphics are great, voice acting is great, but this game is just not fun to play, combat is terrible, half of the materia is useless because the combat is bad. the weapons you buy or find are never better than what you currently have, just different. I actually wish i had not purchased this game. I will probably play through it, but only because I'm invested in the story and kinda want to see where it goes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game has beautiful graphics and atmosphere/story is interesting and compelling\n\nthe combat system however SUCKS.\nit tries to do both turn based and real time combat at the same time and it excels at neither. the combat feels like a clunky hot mess. Your having to constantly pause and switch between characters and it just feels tedious and not satisfying.\n\nthe other issue is the amount of filler content is kind of atrocious. i didnt enjoy a lot of the mini games and side quests. most of them felt disconnected from the main story, repitive and not fun to do.\n\ni played the original ff7 and i really wanted to like this game but the game leaves a lot to be desired",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well I hesitated and was waiting for a sale, I was kinda waiting for 75 % but given how much time has passed I was fine with 50 % now.\n\nFor those who have played the original FF VII, I don't recommend buying this, first disc content stretched over roughly 32 hours filled with stupid side quests and whatnot, there're also some story parts that feel off from the original title. Some parts of the story are great tho, they're now more detailed and you can immerse yourself better but then a rework of the original with this games graphic would've been just fine imo.\n\nFor those who haven't played the original FF VII, go play the original, sure it's old and graphics aren't as nice but at least the original had > 50 hours of gameplay and the story was great and most importantly: complete (in terms of the game)\n\nThis one simply doesn't have the charm the original game had and splitting the game into 3 different titles is the biggest atrocity they could've come up with, even worse is that playing one game is completely meaningless for the next one.\n\nIn the original you finished the game but you weren't done yet, you went for max level characters afterwards, hunted down all the weapons (enemies, not equippable weapons), mastered tons of materia (if you master materia here, you don't get a new one so don't even try) so that you ended up having 3 or more mimics, unlocked all the summons and more. But in remake integrate? There's no point, why would you right now grind materia when you have to start from scratch in rebirth anyway?\n\nI mean overall the game's quality is solid, nice graphics, gameplay is fine, full audio dialogs and whatnot, kinda what you'd expect from an SE game these days but I just don't get how anyone would come up with the idea of splitting FF VII into three titles and then not have your savegame carry over at all.\n\nI had the trilogy on my wishlist but now after remake integrate I'm not gonna get rebirth or the one after that. I'd rather wish they would've just remake the original one while keeping almost all mechanics of the original and just update the graphics and audio dialogs. Like this it feels like something you loved has been put in a stall and getting milked every second, I don't like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is an absolute bore fest. \n\nEverything is horrendously slow paced, even walking in narrow spaces or interacting with some elements where you have to hold a button is a chore with how slow it is. I've rarely felt so forced by level design than in this game. Maps are just some corridors leading to more corridors. \n\nNot to forget how everything feels and play the same for more than 15 hours: new area with little to no exploration available, a few not so hidden crates with potions and other stuff you already have, some enemies to fight, sometimes a miniboss/boss fight with little to no challenge > rince and repeat. This is clearly meant to be a fan service game to make money.\n\nEquipment system is lazy and doesn't offer much, gameplay is ok, but the whole submenu and team members management is nothing but practical. Team members AI is sadly close to useless. \n\nThe game looks ok, characters are looking great, the rest of the NPC are a bit lackluster. Overall, nothing spectacular. I'd even say it looks kinda generic. It has no soul.\n\nKBM controls for menus are a nightmare, there's no consistency and not enough room for customization in the settings.\n\nI'm gonna force myself into finishing it even if I got this on sale, then play Rebirth hoping it's better than this sloggish subpar FF.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TOO MANY BOSS FIGHTS!!!! There are times that you will literally have to fight like 6 bosses one after the next. For example you will fight destiny in like 5 or 6 forms followed by fighting sephiroth in his 6 forms with no rest or break in between. Many of the bosses use back to back attacks that will leave you unable to recover and basically playing the revive and try to heal game over and over and over. Great concept for the story but an absolutely terrible combat system. Basically the developers must of been going through a divorce and just wanted to ruin everybody else's life.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hard to recommend this game. Poor controls, weird dialog (so many random grunts), and annoying bugs (screen goes white until game is restarted).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you have no prior knowledge of the original FF7 and you are ok with Xenoblade style side quests that are fight/fetch quest, boring and worthless then you will probably like this modern take. For me, having played the original and knowing the lore and story, stretching one game into 3 games means its just filler garbage nobody cares about and is so damn slow I couldn't ink out any enjoyment. The amount of times I was forced to follow an NPC at walking pace, slide slowly throw a crevice or go from cutscene to 6 seconds of gameplay before another cutscene is too high. Everything about this game is slow and a drag. I was entirely confident by chapter 8 that this entire game is going to take place in Midgar and I googled it to confirm I was correct. In the original game you are in Midgar for the first 6-7 hours before you leave. I'm 12 hours in and probably not even halfway done with this game and nothing left ahead of me but more filler, more damage sponges and more walking sections.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It doesn't even feel like a final fantasy game. I'm playing a video game/movie simulator. They could have just made a mini tv series instead. However, I will say something good, and that is the game does look beautiful graphics wise. This game wouldn't be terrible if the battle system wasn't done so poorly. Complete opposit to the original version. They had a winning recipe from the original and butchered it in every imagineable way possible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is my second Final Fantasy game. After playing games like Witcher 3, Expedition 33 and Octopath Traveler; this game feels like a joke. But even if I didn't play them, the acting, story and lore are mid for a AAA title. The interactions feel cheesy and cheap. The music is good, gameplay is enjoyable. Lots of mini-games.\nThe game has some occasional huge frame drops.\nSide quests forcing you to traverse the same maps over and over again, like in a MMORPG.\nQuests that don't make sense: Secret Medicine. Doctor asks me for usual ingredients that Aerith brings him, then includes the most ridiculous ingredients ever, that forces you to kill a monster in a secret lab. This is what Aerith \"usually\" does?\nI just couldn't connect with the characters.\nFor me, FF 7 Remake is like a comedy movie that tries very hard to be sad, dramatic and serious.\nIf you're not a Final Fantasy fan or very bored, I would suggest to consider other games before you even think of buying this. It is not a bad game, but a situational buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I never played the original FF7, my first venture into the FF series was with 8 but I always heard of 7 was much better so I'm a little late to the party here having bought the remake like 30 years after the original so perhaps it's the 30 years of people telling me how amazing it was that left me expecting too much. I enjoy the combat system and the gameplay itself is pretty fun, the materia stuff is cool and the weapons, graphics and aesthetics of the world are decent - but Christ I am struggling to stomach the overwhelming amounts of 'anime bulls**t' and fanservice... Every female character is beyond ditzy and has to have a cute little giggle every 3 seconds they're on screen, they all punctuate every damn thing they say with a fist in the air or a little pose and it's just gratuitous at this point. I've got to like chapter 10 now and it gets worse and worse the further we go on, Tifa was bloody awful but now I've met Aerith I want Tifa back at least she didn't constantly try to do cute things... I've played anime style games before so I know they can be a little on the nose and subtly and decent writing are non existent but this game is by far the worst for it. (And you people have the audacity to mock FFX's dialogue!) I'm currently playing in like 2 hour intervals because I need a break from it all or I feel I'll blow my brains out.\r\n\r\nYes I'm an old man yelling at a cloud, what of it?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was fun at first, graphics are beautiful and combat is fun, but the pacing is so antagonistically slow I had to give up. Won't buy the rest of these.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The narrative pacing feels off. The story often doesn’t match the character design or the world building, making some moments feel jarring. Certain levels are poorly designed and feel disconnected from both the characters and the setting. Playing through the game, you often wonder why the protagonist can’t simply do something obvious, he clearly could, but the game forces him into unnecessarily convoluted actions just to make certain narrative events happen. Many plot developments feel forced and hard to believe, which makes the story feel inconsistent at times.\r\n\r\nOn the positive side, the graphics are solid and visually impressive, capturing the atmosphere of the world well.\r\n\r\nOverall, while it has strong visuals, the game struggles with narrative coherence and level design, which can make it a frustrating experience for players seeking a story that flows naturally.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I feel like most of the effort was put into making everything look as life-like as possible.\n\nThis remake is eye candy, there's no denying that, but when everything else is either mediocre or just down right awful, I fail to see why this game even got made (aside from money).\n\nThis unholy obsession that modern games have with replicating this GTA/RDR2 style movement where everything has to look as realistic as possible really has to go. Wanna do an action? You have to wait until you character settles into an idle position, which will basically happen every single time. I seriously don't see an issue with making sure regular gameplay doesn't require such animation, it can just be saved for cutscenes, since there are a TON of them. If I wanted to see how cool it is to observe intricate movements and realistic sun beams, I'd go outside.\n\nThe combat, while flashy, gets repetitive especially when you have to repeat the same three things every encounter. I understand turn based RPGs are like this in nature, but this ditches that formula in favor of something more action oriented.\n\nThe music is great. I was really fond of the Collapsed Expressway theme. To be honest I'm not really all that impressed since this is a Final Fantasy game.\n\nWe have GOT to get Nomura out of the director chair.\n\nThis is just a personal nitpick but why the hell do I have to find an alternate route when a 3 foot high obstacle gets in the way as if my blonde anime dude can't leap thirty feet in the air and wield a 300 pound sword like it's paperweight?\n\nCharacter writing is good, I liked seeing Cloud go from selfish dick to someone who cares deeply about his newfound family. Everyone else was great, because Jesse, Biggs, and Wedge had actual backstory instead of 10 lines of dialogue. \n\nThe actual story is questionable. Sephiroth shows up every other two hours and it feels like they only incorporated him for fan service. Instead of being something that is accessible for people who have or haven't played the original FFVII, it's weirdly catered towards OG fans especially because Zack shows up near the end alive and well, and I really doubt newcomers know who Zack is.\n\nI'm also unsure why they sometimes opt for pre rendered cutscenes when there are already so many in-engine cutscenes that look as good if not better.\n\nYou might enjoy this, I sure didn't. I can see why someone would, but I think anyone who was played this can also see why me and many others didn't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The original FF7 is acclaimed as a game with a great story so I was quite surprised when 10 hours into this remake I hadn't encountered any story. There's not even that much combat either, most of my time has been spent running between plot devices and watching cutscenes impressively bereft of any substance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring. The gameplay is too plain, you cant dodge attacks, you can only parry or block them and even so you would still take damage. The battle system itself is somewhat a semi turn based RPG. In order to use abilities or even items, you would need to hit the enemies for a certain amount of time to gain 'action' cost. Then finally you can use a single item or single skill/magic. Just make it fully turn base at this point, it makes no sense. Story is meh, narratives are funny and interesting sometimes and the acting from the VA is solid. But the game limits so much you can do, in some areas you arent allowed to sprint for no apparent reason, the map has no gps tracking/guiding feature which means you need to move and check the map constantly to guide yourself to the destination. If you like modern rpgs that are face paced, this game is definitely not for you. Even the gimmicks in Genshin impact feels more interesting/rewarding to finish. I have 13 hours in I havent gotten anything that seems useful from looting chests, finishing the gimmicks where I cant even skip. Couldnt believe this was a highly rated game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Be aware of this issue the game suffers badly from a glitch that blinds your screen white. I don't know anyway to remove the issue but I have googled it and I come across many threads of this game having the white screen issue. I would honestly avoid purchasing because the game should be working correctly not a broken mess.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}