{
  "positive": [
    {
      "review": "I’ve played this entirely on a Steam Deck.\n\nIf you wish there was another Morrowind, Oblivion, or Skyrim, then this is probably the closest thing you can get.\n\nIt seems a bit more Oblivion-ish because it isn’t quite as overdone as Skyrim, and it’s also a bit more “old school” in the sense of not being too easy and dumbed down to attract a larger audience.\n\nTechnical implementation: I didn’t really have any performance problems but I was using a steam deck which is hardware the game is specifically targeted for. The only FPS problem happens when you summon 3-5 wolves. It seems like a problem specifically with wolves for some reason. Other people sometimes have problems but these are usually solvable by reducing 2 graphics settings like vegetation quality. The game is built using Unity but you can’t really tell when playing it.\n\nCombat is a bit more difficult and action-oriented than Skyrim and Oblivion, though not complicated. The main thing is that you have dash (dodge), block, and parry as defensive options and parry rewards you for exact timing.\n\nThe design of the game mechanics seems pretty good and it seems like they addressed some of the weaknesses in Skyrim especially. Like in Skyrim you can get sneaking to the point where you’re practically invisible. In this game you can’t do that. Backstabbing is sometimes possible but not usually very practical. Sniping things with a bow from a distance can handle mobs maybe 80% of the time. (But beware that there are required “boss fights” where you are locked into an arena, so you have to be able to handle melee or short range combat.)\n\nUnlike Skyrim, 2H (two-handed) weapons aren’t completely useless compared to just dual-wielding 1H weapons. You can parry and block with either loadout, and both equally prevent you from using a shield. Daggers have their own skill tree and are focused on speed; they’re not just some thing for extra backstab damage and they don’t usually give you a huge backstab advantage. (Generally speaking, the sneak attack damage bonus is about the same for all weapon types.) So all of this stuff is balanced out a lot better with no obviously useless or superior weapon types.\n\nMagic is pretty simple and you don’t really have “schools” of magic other than summons vs direct damage spells. There are only four magic skill trees and the other two are wands/cubes (magic weapons) and a general tree for mana point bonuses and such.\n\nDue to the lack of requirement for magic specialization, a ‘spellsword’ (referred to as a “battle mage” in the game) type character is more practical than usual.\n\nThere are still some weaknesses to the game which I think are mostly in the content;\n\n- I think the game could use more side quests. There are a decent number, but only maybe 1/3rd of what Skyrim has, for example. (Skyrim is a bit overloaded with them compared to everything else though.)\n\n- The character system is classless, but like similar systems you’re going to have to focus on two main skill strategies to be effective. This is fine, but there aren’t really any side quests dedicated to specific skill areas. Like there’s no “mage guild” or “assassin guild” or similar quest line that requires the use of certain skills to get associated rewards of some sort. The only ones kind of like this are for alchemy and crafting wyrdstone, but they’re rather underwhelming.\n\n- Most of the “dungeons” seem too small and too few to me. The ones in Skyrim seem much bigger.\n\n- The overland areas are divided into three maps instead of one big overland map. So it’s not really 100% open world. It’s more like 33% open until you unlock the next region, then it’s 66% open until you unlock the last region. This isn’t really that big of a deal though.\n\n- The overall game scenario of “King Arthur needs to save Avalon” and such is a bit too closed to further expansion. It’s a bit difficult to imagine how a DLC for this game would work, and if I were developing a content add-on mod it would be difficult to fit anything into the narrow lore. Basically the world is too small and simple to allow for much creative expansion.\n\n- There are a few awkward consistency errors. These are hard to entirely avoid where player choices make all permutations of choices hard to test, but they might have done better if they had some sort of dedicated continuity checker.\n\nThere are fewer bugs overall than the average Bethesda game.\n\nSo in short, this is not the “be all end all” FPS RPG and it doesn’t blow everything else away, but it’s pretty good given its limitations and I’d still recommend it even though I wish the world was bigger with more side quests and such.",
      "voted_up": true,
      "votes_helpful": 168
    },
    {
      "review": "Man, those devs seriously deserve some praise. Even though the game can be quite buggy and wanky at times, they at least did what shitty Bethesda couldn't do for over a decade with a sky-high budget and a couple hundred or more developers, and they don't even try to milk us players with some mad pricing.",
      "voted_up": true,
      "votes_helpful": 77
    },
    {
      "review": "For years, I’ve been wandering the gaming wilderness searching for something to scratch that ever elusive Skyrim itch...and I think I’ve finally found it. Tainted Grail: The Fall of Avalon doesn’t just scratch the itch; it digs in with both hands and gives it a satisfying medieval back scratch.\r\n\r\nAfter sinking what I can only assume is over 5,000 hours into Skyrim (across every possible console and at least three lifetimes’ worth of modded playthroughs), it’s refreshing to breathe some new, slightly cursed air. It truly captures that same sense of adventure, freedom, and atmosphere and I quite enjoy it.\r\n\r\nIf you’ve spent years Fus Ro Dah-ing your way through Tamriel like I have and need a new realm to get lost in, this one’s well worth your time.",
      "voted_up": true,
      "votes_helpful": 37
    },
    {
      "review": "Genre - It's basically a fancy Daggerfall series mod\n8/10\nI'm really enjoying it so far.\n+ The Arthurian legend setting.\n+ Character development.\n+ Varied skill Trees.\n+ Good balance on normal, I am having to be careful on normal as my build isn't meta.\n+ Familiar mechanics for Daggerfall fans.\n+ Quests and characters are well voiced in most instances, and you can relate to them. e.g. The racist in the tavern was just like going to a British Pub and finding the local Brexit voter.\n- Graphics are a bit dated.\n- Can be janky and you can get stuck, but that's why they included autosave and quicksave.\n- Random crashes, but again use that save feature. Although if you just finished sorting your stash, can be frustrating.\n- Game doesn't handhold you as well as much as they could. e.g. I had to Google how to craft items, as I was clicking on everything at the blacksmiths except the table I needed, which was labelled as a grindstone. Meanwhile the grindstone didn't do anything, lol.\n- Can use summons, but no companions.\n- Compiling shaders took a while on first load, but no issues since.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "Yup just as people say... its like a dark version of skyrim but also the game doesn't hold your hand either so come prepared to be trying battles a few times or come across someone or something that just mops the floor with you. it is satisfying to learn new things and win at a battle you've been struggling at and snag up their sweet looking armor you wanted.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Amazing game, the sheer amount of content is crazy for this price tag. A few key points:\n+ Combat is way better than most FPS melee games I've played so far\n+ Main Story is actually interesting and touches up on quite mature themes in a way that pushes the player to think and form their own opinions about the world and what's right/wrong\n+ There's quite a lot of great music tracks, the bgm in Main Menu is amazing\n+ Huuuuuge game with a lot to discover\n\nThere are some issues that could lower some people's enjoyment, so for the sake of being fair I'd list them out too:\n- The game's visuals fall behind in terms of quality in comparison to other features, it's mostly comparable to Skyrim or even slightly worse visually. One thing that stands out positively are pre-rendered cutscenes, which are few and far between, but look amazing\n- Balancing is not great in some instances; Mage build makes the game trivial at many times; it's fine for those who want to feel like a powerful god and is fun for a bit, but it gets boring after a while. It's sort of an easy-mode baked into the game's design (similarily to how wearing Havel's armor is an easy-mode in DS1)\n- The game is visibly unpolished in some aspects (despite being made by a Polish studio ... badum tss...)\n\nOverall I can fully recommend buying and playing the game - it's more than 50hrs of good fun for quite a low price.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "If you want a new Elder Scrolls style game, look no further, this is it. You will feel right at home with the gameplay, exploration, and especially losing yourself in the side quests. I found the side quests in this game to be substantial, leading to huge, really cool areas to explore and find more story. The music is really nice and wildly varies from atmospheric to full on battle chanting combat music.\nI would say that if you play this game, it sort of softly warns about you about respeccing not being easily done. You do so with potions that you will find throughout the world and ultimately, in the late game to be fair, you'll find a recipe for the potion so don't feel like you're locked into a character you can't respec, it just takes some before you can do it.\nYou get a huge stash to store items, so if you ever want to change up your character, you can have a ton of items ready or if you like crafting and cooking you can hoard everything. Also when you're crafting the game pulls all the ingredients from your stash so you don't have to carry around a bunch of stuff to a crafting station but if a quest calls for something you have stashed you have to bring that with you.\nI enjoyed all the time I spent with this game. Thank you Questline and Awaken Realms.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "This game is a wonderful successor to such great titles as Gothic or New Vegas. Giving off a slight whiff of AI-slop, it literally grabs you at the end of the introduction with its visuals and style. One could talk a lot about the flaws of its combat or role-playing mechanics, or about its bugs, but instead I’d rather show its strengths through the example of a single quest: a witch has bewitched the husband of a certain maromoika, turning him into a pig. Naturally, the maromoika asks you to save him. \r\nWhen you find the pig-husband, something incredible happens — he actually likes life as a pig so much (he eats, he sleeps, he roots, he talks to chertopolokh) that he asks you not to unspell him. And he’s so fed up with his maromoika that he prefers to live as a pig with the witch. You can try to convince him, argue that pigs live much shorter lives than humans, but even here the game manages to pull you deeper into its world: he counters your point by saying that an average peasant in Avalon doesn’t live much longer than a pig anyway. And you’re left standing before a moral choice of what to do with him…\r\nIn fact, this single quest alone is enough to understand the greatness and superiority of this game over all other gaming products of recent years. I’d compare it to Nier: Automata or Disco Elysium in terms of greatness.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I'm only 3.5 hours in, but this game is incredible. It's like Elder Scrolls: Skyrim on steroids. I'm so glad I found this gem.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This was a fun game!  Reminded me a lot of Skyrim in gameplay, but better magic mechanics.  Overall, a fun game!  Though, I wished it didn't have so many side quests that didn't add anything (a common complaint from me about these open world games).  Nice balance of dark and bright visually too.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h3]\"Few dare to seek answers in shadows. And now, here you are. A truly rare and joyful occasion.\"[/h3]\n\nTruly an amazing game, with gorgeous aesthetic, jaw-dropping scenery, and intriguing moments - both in the gameplay, and in the metaphorical/philosophical sense.\n\nThe open world is great for exploration, the combat is intense, and the early game difficulty go me hooked in the game.\n\nStorytelling is on point, with such rich lore based on the story of King Arthur, Merlin, Kamelot and the Knights of the Round Table... but with a grim, gritty, dark fantasy twist that makes it much more unsettling and interesting.\n\nSpecial mention to the sound department - the sound design and specially the soundtrack are insane, and definitely matches the experience in a surreal, perfect manner.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Scratches that skyrim itch!\nAlmost all the quests are fun. combat gets a bit repetitive still good thou.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After 1.1 patch indeed it is more complete than before - both for 1 playthrough and more longevity with NG+. \nAlthough still - Act1 and pregame cutscenes set the ground for expectations which definitely underdeliver in Act 3 (no cutscene I could really remember despite being it the last act.. + wits of dialogue writing is infantile, without any depth). \n\nSetting Your expectations not to be too much - You will have fun.\nStill - would recommend it 8/10.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It took a minute - but I am now fully immersed and enjoying my adventure! \nYou can tell this game wasn't made by a huge company with tons of employees.\nTo be honest; that's part of this game's charm - it's so well done and I can only imagine that it will get better with development and mod support.\nIt just proves that you don't need flashy animations and weighty combat to tell a good narrative and have fun gameplay and exploration.\n\n\nMy vote for oustanding story rich game 2025",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is how dual wielding in Skyrim and Avowed should have worked. This game is great, much better than skyrim - more focused; better writing; combat is way more engaging; the art style and soundtrack are wonderful - but as others have said, falls off in act 3 (as we know, most dev time goes into early parts of games that every player will see). \n\nThe difficulty is also a mess - starts off too hard and then somewhere around the end of act 1 you cross a threshold where everything gets steamrolled from that point on. The Custom Difficulty mod on Nexus is an absolute must.\n\nToo bad there's almost no modding community, despite the dev's efforts to encourage one.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "25ish hours of progress in and I just beat Act I. I truly cannot recommend this game enough. We all have been futilely hoping for Bethesda to return to their glory days, but we don't need to hope for that anymore. While Bethesda are artistically dead and buried, this game delivers exactly what we have hoped for. It is *it*.\nIf you are willing to put up with the eurojank at times (nothing gamebreaking whatsoever, in 40 hours of total gameplay I have had only one crash), you'll find such an incredibly mature game that isn't afraid to tackle big things. Where Bethesda games fall absolutely flat (story/writing), this game fucking excels. The entire theme is ethical greyness. There really are no 'good' or 'bad' guys, there's just different factions you can side with who have their own justified ideals which are at odds with others. One of the big themes of the game is utilitarianism, questioning at what point is sacrifice for the greater good not worth it anymore. I'm not even joking that essentially every last NPC I have encountered (and it's been a damn lot) has oozed with character - obviously some are much more important and fleshed out than others, but they all have memorable traits, quirks, and characteristics. And, at least regarding the main cast, they all have been complex and very well written.\nAnd this all isn't even to mention how truly next-level the art direction is, with very clear inspiration ranging heavily from the likes of Frazetta to Giger.\nTaking the template of perhaps the most lasting fantasy legend of all time - Camelot, Avalon, the Knights of the Round Table, King Arthur, etc. - and looking at it through a modern cynical, grey, grimdark lens, makes for a truly captivating and deep adventure. What if one were to drain the glamour of the chivalrous knight fairytale of all its vibrant color, look at it through a realistic lens as opposed to an idealized one of mythology, a la Watchmen to the superhero genre? That's the core of it.\nBut a big aspect of this game, to its benefit in my opinion, is that it doesn't take itself *too* seriously. It would be very easy to come off as such in such a dark setting, but as I said earlier, this game has an abundance of character around every corner. It balances the bleakness with quirkiness and humor, of which it has a lot of, but never at the cost of changing the overarching mood and emotional landscape (I'm looking at you, Larian).\n\nBasically, I really cannot recommend this enough for Bethesda fans who have been disappointed in their downfall the past 10+ years. I will admit that I have read the common consensus of this game suffering from the same syndrome that basically all grand RPGs which spent many years on early access have (including the universally beloved child of the modern RPG genre, Baldur's Gate III) - namely, that Act I is easily the most fleshed out and impressive section of the game. But honestly, even if that turns out to be the case, I will be so far from disappointed in the end. In the 40ish hours I have spent in Act I, I have been so impressed at every corner, it easily alone makes up for the cost and makes for a gaming experience I will always revere. And I fully expect to at the very least very much enjoy the remainder of the game, even if it perhaps is not as fleshed out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The storytelling of this game is what you wished every bethesda game felt like and the gameplay goes cray cray. well worth the money fr.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I know I haven't played enough, but I have to drop this review.\r\nPicture this in your mind: what if Skyrim and Elden Ring had a lovechild? This is it.\r\nIt's certainly not as complex as those two masterpieces, but it's really good. The graphics are on point and they will remind you of Elden Ring. Plus the combat and magic feel like Skyrim in first person.\r\nThe story is interesting and it feels like it's a game made with love, dive in.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I hate comparing games to other games, but I found this by specifically looking for RPG questing/exploration \"like Skyrim\". & Yes, it fits this label in vibe and design. I just wish I had watched that \"survival-horror\" tag. It does not want you to have fun with combat on higher difficulty. If you want a Skyrim instead of a Darksouls then please do just start the game on easy and don't be a me that picks the middle one thinking it's normal RPG scaling.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Crazy that I don't see RPG crowd raving over this game.\nIt might look a little dated, like it was released about a decade ago, and the RPG elements are straight from Oblivion, but better. AND IT'S GREAT.\nSo despite the visual flaws, or maybe because of them, this game wrapped me like a warm blanket (I think 6hrs is wrong bcs I went offline to let my bestie play as well, and it didn't count like +4hrs offline). \nWhere it doesn't have your horse's sack shrivel from the cold it has STYLE. Some scenes are very Giger-esque, the setting is very crunchy (I knew that from the board game, which I supported on Kickstarter and how I got this game). It's got heart, it's got soul, combat is engaging, dialogues are funny, I am creeped out by everything outside of the safe zones, in the best way possible.\nIf you like Arthurian legends reimagined, Oblivion, original designer of the Alien and have been craving some straight-forward adventuring with crafting and questing- highly recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game and I really enjoyed my play through. Combat was fun. Dialogue and voice acting were well done. Overall I will be following what Questline makes next.\n\nFor future projects I would like to see the devs focus on balance more. I played as a caster and the game had wild difficulty swings requiring me to lower and raise the setting multiple times in each zone. Healing items are expensive to buy/craft which encourages lower difficulty setting as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tainted Grail: The Fall of Avalon left me with the same feeling as finishing an exceptional novel. It's that quiet moment where you sit back and realize the story is going to stay with you.\n\nAvalon isn’t just a setting; it’s a living, haunting world that pulls you in with its atmosphere and moral weight. Every choice feels meaningful, the characters are well written with depth, and the branching choices land with impact. The quests unfold like chapters of a dark fantasy epic forcing to take pauses before many choices, and the ending ties everything together with a bittersweet, memorable final note depending on what you choose.\n\nIt’s rare for a game to feel this personal — like you didn’t just play through a story, but lived in it for a while. Tainted Grail: The Fall of Avalon is one of those rare journeys that lingers with you after all is said and done.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely fucking adore this game.\n\nI put it down for a while pretty quickly after I bought it because the devs said there were some big patches coming down the pipe, and I didn't want to start over.\n\nIt's amazing. I'm not gonna say perfect, but it's so much fun,and it's interesting. I'm not one for deep analysis and explaining each detail I love, but the game is wonderful. The soundtrack is awesome. The voice acting is 7/10. The story is great so far, the level up system is enjoyable and rewarding, and there's meaningful non-quest content to take part in. \n\n\nIt's got a demo, you should try it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Far better than boring level-scaling oblivion remaster. 40 h. in game so far, act 2. No minor bugs detected post 1.1 patch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A really good RPG in the Elder Scrolls style. What's to love:\n\n- beautiful graphics\n- well-designed map and dungeons\n- level-scaling doesn't seem to be as crazy as Elder Scrolls\n\nWorks perfectly in Linux.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a fantastic game. It feels as if Skyrim, Elden ring and The Witcher made a baby. Interesting story with multiple choices. Classical options of builds (Tank, ranger, mage, rogue, assassin, etc). I can't really find anything to complain about. It's just really good through and through.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Comparisons to the Elder Scrolls are given as first person RPGs, but this game is so much more than a \"scrolls-like\", it's genuinely fantastic as a standalone RPG.\n\nThere's meaningful choice and decision-making in the quests which are well written and engaging, definitely worth checking out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is great! Totally came out of nowhere but had loads of fun with it. Imagine Skyrim but a bit bleaker and the combat designers had been playing a lot of Dark Souls recently as there's a focus on blocking, parrying and stamina management in melee combat. \nWhether melee, magic or stealth archer (or any combination) combat has a very satisfying heft to it. The world is mostly caves and ruined castles but you're frequently whisked away to magical realms where the art design can shine a bit more. The main story is solid, only let down by your ending being decided by picking it out of a list of options which is always a bit of an anticlimax. There are no companions in the traditional sense but a fun and fairly lengthy list of side quests that are good enough to make you actually care about the characters, even if the outcomes are not always clear in a moral sense.\nThe game looks fine graphically, has a good soundtrack, ran well and I only encountered 1 CTD in 50+ hours (I've heard people complain about bugs but they seem to be generally fixed by this point it seems).\nAll in all, really good game, hope it does well enough to get a sequel or the devs get to keep working. 8/10 for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For me this is one of the best games i have ever played, The lore, the artwork, the music, the voice acting... i love it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really solid solo game, I definitely recommend if you like games like oblivion or skyrim but in a darker spirit. when i finally finished it with almost all quests done other than some hidden ones, i had this feeling of coming back from a long journey full of adventures and that was satisfying as not many games still make you feel this way.\n\nI just wish there was a bit more to do in the world other than the questing. you can have a house and decorate it but i never needed to use it or do anything with it really. Also i found it usually or a bit too hard or too easy, not really in the middle. Also many armors felt useless as effect only activate when low life or low mana and you usually don't stay like this for more than a second or two so you don't really use the effects or bonuses. \n\noverall, I loved it !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game after watching someone on Youtube playing it and decided to try it.  Once I began playing it, I found it to be strangely addicting and couldn't put it down.  \r\n\r\nBackground:\r\n- I have over 180 hours played\r\n- I have completed New Game plus\r\n- I have 100% the game (All achievements)\r\n\r\nWhile there are notable glitches with cloaks and other parts of armor that will wildly swing all over the place, they are fixable by unequipping the item and reequipping.  Outside of that, there are some enemies that will glitch through the ground and attack you, but I only experienced it a few times while in Forlorn Swords area.\r\n\r\nThe only advertising I remember seeing of this game was during The Gamer awards.  I hope the development team sees a ton of success and either produce DLC (Which I will buy upon release) or another game which I am very excited to see.\r\n\r\nThis is my first review and I hope this helps.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A wonderful love letter to classic Elder Scrolls games. If you've ever wanted to explore the world of Avalon with Skyrim's gameplay, this is your game. It's a faithful 'clone' with a compelling open world, familiar mechanics, and an epic, prison-start story.\n\nI chose this over a Skyrim replay and have zero regrets. A 27-hour hidden gem made with clear passion. Definitely recommended for any RPG fan.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was lured into this from a Spiffing Brit video, and I loved it.  The challenge balance is a little wonky, after the beginning it's either too hard too easy, sometimes between two back to back enemies.  But don't let that detail fool you, the story is a blast, the ending was worth it, exploration is rewarded, the game is big big big but you choose how much you want to complete or if you want to power through to the end.\r\n\r\nI wrecked the game with a duel-shield build of Duelist Shield + Bramble Shield and made the game trivial after exploiting the perk multiplications.\r\n\r\nDefinitely worth 2 weeks of your life.  I would have some notes to developers, but I'd be coming to that meeting quite late.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is by no means perfect. However, it is the only scrolls like not made by Bethesda, and it feels far better than any of the SLOP Howard and his team has pushed out. Good gameplay loop, engaging environment, and made by a few slavs in their basement. Buy it so they can afford a studio.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really great game so far. The story, dialogue and music are immersive!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can wholeheartedly recommend this game. It feels like a darker version of skyrim and honestly I love it for that.\n\nThe cons up front is that unfortunately the games final act doesn't have as much development as the previous areas. However that doesn't mean it isn't well made IMO as I personally didn't really notice it until I came back. \n\nThe pros are as I mentioned it feels like a darker version of skyrim. Its story is focused and really has the RPG mindset of \"live with the consequences of your actions\" that I love. It leads to may replay-ability.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In the first game, you can pet the dog and dog gets stronger with every pet.\nIn this game, you can pet the axolotl and the axolotl gets stronger with every food you feed it.\nTruly an amazing sequel.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Alright so i dont typically write reviews for games UNLESS they fall into an extreme on a scale. This game does in fact do that. Its in no way earth shattering, it has not reinvented the wheel, it may not win a GOTY any time soon. BUT it has been one of the best RPG experiences i have had in a long time. It is solely itself, you can see and feel the inspiration from other games but it is ITS OWN PIECE. The maps and the exploration is heavily rewarding, combat is basic in mechanics but allows for decently complex character class design decisions, the gear is all nicely crafted and rewarding to get even if you just throw it in a box, the world itself is and does capture a dark fantasy vibe perfectly. The graphics while not the most mind blowing are still very picturesque at times and honestly i could continue going on and on about this games design. but i wont. \n\nBasically. if you want a gritty slightly buggy ( no buggier then a bugthesda game) that sticks to its own style and goes back to the roots of older RPG's while giving them a major facelift. THIS is your game. \n\n9/10 Easily.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is janky and looks outdated. The difficulty scaling is off as it starts as Dark Souls, but becomes trivial towards mid-end game, BUT i still had an amazing time.\n\nBuy it if you need to satisfy your Skyrim itch - exploration is fun and rewarding. \nItemization is very varied mostly creative. \nThe quests are mostly interesting (apart from the usual fetch nonsense). \nIt has mature humour, cool landscapes and i would describe the general vibe as \"grimdark\".\n\nBig props for the really cool armor designs.\n\nIf you catch it on sale for around 30 bucks you will definitely have multiple dozens of hours of quality entertainment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall, I would say that this is a pretty good game. It's worth a try. Is it perfect? No, but that's okay.\n\nI'd say that the quests and story in this game is a highlight. There were only a handful of fetch quest missions, most quests were actually pretty interesting, and I did enjoy the main story. The main story asks some pretty hard questions, especially the ending. While this game is nowhere near as expansive as Skyrim or Oblivion, what is in the game feels a lot more impactful. \n\nI played a mage in my play through, it is my favorite play style in fantasy RPG games. I'd say that this game sea saws in difficulty rather quickly. When you start each region, the combat feels quite lethal and fun, but after some quests, you outpace everything and you become a killing machine, which while that can be fun, I think the combat is not very well balanced. I think a problem I had as a mage is that by the mid point of Act 2, I never got any betters spells, because every spell scales with your spirit attribute (significantly, I might add) by the end of the game my spells were doing 3.5 times their base damage, and I'd been using those spells since mid to early act 2... which gets a little boring after awhile. I think this scaling is part of the balance problem, I think the scaling should have focused more on reducing spell cost, so that there is still room to find cooler spells. And you need a good spirit attribute to be able to effectively cast those big awesome spells.\n\nPerformance and bug wise, I didn't really notice any serious issues until act 3. A bit in act 2, but nothing major. But in act 3, I ran into a persistant issue where it would take longer and longer to get out of menues until I restarted my game, which was annoying. I also saw the most frame drops in act 3. It could use some optimization work for sure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An upgraded skyrim with souls-like elements, a vastly superior combat (in comparison to skyrim), a good story and well made environments to complement the setting. \r\n\r\nPerks, active and passive, are satisfying to upgrade and obtain. There are multiple unique weapons and armor ingame. Slight downside to it is it places less emphasis on crafted items mid-late game due to most unique looted items having outright better stats to include unique/exclusive ones. Necromancy (aka, pikmin simulator), blows skyrim out of the water as mid-late game nets you stupidly powerful allies.\r\n\r\nThere are no 'companions' other than a pet but I consider this a plus. It does make 'mule-ing' junk items back to merchants a slog for a majority of the game. Merchants have unlimited money so you can dump as much as you want. \r\n\r\nThere are far less NPCs compared to skyrim; although, it does make it more immersive concerning the world building at a cost of making 'towns' less exciting to explore. NPCs (or most of them) are unique with a multitude of voice acting. Quality varies for a select few but its negligible. \r\n\r\nDecision making is moderately standard but offers enough variety with choices and morality. Good/ evil ending are available and dialogue with NPCs are not forced (i.e. it does not force you to roleplay a space cowboy out of the blue).\r\n\r\nDue to the decrease in NPCs (and overall size of the maps), thieving not as good as skyrim. Pickpockting is especially worse as you can only pickpocket when NPCs are sleeping. \r\n\r\nSneaking is more challenging but has an assortment of perks and builds to compliment it. I can't comment much else as I opted for melee/necro build.\r\n\r\nSuperpowers is extremely limited (you have only 1). It does come with additional perks as you progress in the story, but you will rely more on your regular perks in combat. Its a good/bad as it decreases how much you can spam it but it really becomes a 'get out of jail free' card for a lot of interactions. Powerful but it doesnt last as long and no other options to choose from compared to dragon shouts in skyrim.\r\n\r\nFast travel is very nice and becomes easier as you farm during night.\r\n\r\nExploration is better as the environment is made for it and most areas feel unique and rewarding to explore (most areas have unique items as a reward for exploring). Maps are much smaller and the overall story/content is about half to a quarter of what skyrim offers. The game does offer NG+ to allow you to go nuts in an OP run.  You will have plenty of room to get more points and level up when you beat the game due to the length. Good or bad depending on how you look at it.\r\n\r\nPerformance is enough of an issue to address. It is shaky at some points and can get quite bad at times. Ingame DLSS helps a little bit, but I will have to recommend using Lossless Scaling to help inject the fancy 'fake frames' for a more stable experience. I also recommend regulalry restarting the game as you might face performance drops when entering caves/dungeons when the game has been running for a while. \r\n\r\nOverall, it is not a COMPLETE skyrim killer. Does a lot good, and some things not so good to include the performance and limited size of the game (which is probably and intentional design). \r\n\r\nFairly good experience on my end and I look forward to NG+ and hope to see future expansions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Grabbed the Demo. Played for 4 minutes. Found a smut book. Closed game and immediately bought the game. \nWill update as I continue to play. <:",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Feels a LOT like playing Skyrim for the first time, including the annoying bugs (6 hours played)\n\nEdit: I got 59/60 achievements and found nearly everything fun, super good game. Buggy and needs some changes but worth your time if you liked playing skyrim/oblivion. (63 hours played)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tainted Grail: The Fall of Avalon is that rare phenomenon of a game that feels both like a homecoming and a revelation. It inherits Skyrim’s open-world spirit, but filters it through a bleaker, more introspective imagination. The island of Avalon is not a playground of heroes but a haunted relic of what once was: a world choking on myth, superstition, and the ghosts of lost ideals. And it is glorious.\n\nFew games dare to stand beside Bethesda’s titan, yet Fall of Avalon does so with quiet confidence. It doesn’t mimic Skyrim’s grandeur; it answers it. Where Skyrim was the story of a world awakening to prophecy, Avalon is the story of one suffocating under its own legends. The architecture of exploration remains familiar, but every discovery feels heavier, more meaningful, as if carved into stone rather than written in snow.\n\nThe combat may feel rough around the edges due to its somewhat clanky combat, but in truth, it suits the tone of the world. Violence in Avalon is not a spectacle; it’s a conversation between exhaustion and will. And beneath that blunt surface lies a remarkable depth of systems. The variety of builds and mechanical combinations is astonishing. Whether you fashion yourself a blade-bound zealot, a plague-brewer, or a scholar of corruption, every path feels viable, deliberate, and rewarding. The game’s design rewards invention — it’s less about perfect execution than creative mastery.\n\nIn an era when most RPGs fear player power, Tainted Grail hands you the reins and dares you to overreach. There is no level cap. Your growth, your excesses, and your restraint are entirely your own. This freedom doesn’t make the game easy; it makes it intoxicating. Power becomes a moral question as much as a mechanical one. How far do you go before the world stops resisting? That’s a choice most games never let you ask.\n\nWhat truly cements Fall of Avalon as a future classic is its replayability. The NG+ mode is not a perfunctory loop but a deepening spiral. Each return to the island feels different — familiar, yet stranger. The difficulty curve is tuned with a scholar’s hand: it keeps you alert without stripping away the pleasure of mastery. The rhythm between challenge and indulgence is rare, almost musical.\n\nTainted Grail: The Fall of Avalon is not perfect — but perfection was never the goal. It is beautiful in its weight, confident in its gloom, and quietly revolutionary in how it trusts the player to write their own downfall or redemption. For those who once scaled the Throat of the World and wondered what came after prophecy — Avalon is your answer.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Love this game. Hope it blows up as much as it deserves. When my only complaint is I wish the game was longer thats a good thing. Give us more of this. Even DLC ill happily pay for. Much less another game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you like Skyrim, this game is everything that Skyrim is and more. Better combat, WAY better magic, a denser and more artistically refined world filled with tons of quests. The character building is fantastic, the story is fantastic, I haven't encountered a single bug in 40 hours, and the voice acting is great. \n\n10/10, if you haven't bought the game just do it, you won't regret it. Support devs like these, they are the ones that will keep pumping out gems while Bethesda re-releases Skyrim for the 14th time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bethesda should take some notes.\r\n\r\nNot a perfect entry in the First Person Action RPG genre, but a really good one.\r\n\r\nMy biggest gripe is certainly that the gameplay does get stale after 20 or so hours.\r\nNothing really changes up anymore after the first few hours, you will just learn stronger variants of spells (or weapons) and... that's it.\r\nYou'll be fighting the last few enemies in the exact same way you fought the first ones.\r\n\r\nNot that eg Skyrim was much better in this regard, mind you, but it is something this kind of game should work on. \r\nMore powerful abilities, more game changers - both for the player and the enemies - to keep things fresh would be very welcome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "From my time playing through Act 1, this is pretty much an Arthurian Skyrim, but with an entirely different \"feel\" of \"jank\".\r\nWhereas Skyrim has established itself as the absolute pinnacle of \"mod it until it breaks, then mod it some more\", I'm playing this almost modless.\r\n\r\nThe game has solid bones - combat feels alright (apart from parrying, not sure why it's not just a perfect block => parry, here it's an entire different type of input on the same button, which is extra jank).\r\nLooting feels good, but a mod to remove the carryweight from everything but weapons & armor is a must for me, there are so many different reagents and just \"stuff\", the early levels (up to 20) feel terrible.\r\n\r\nStory-wise the game is exceptional. So many interesting quests & characters with well-written stories! There are also some really, really difficult choices within the quests, some even gated behind stats - I'll definitely be doing NG+ or a new game entirely to see all of the outcomes.\r\n\r\nMy biggest gripe is just how bad magic is compared to any form of melee (1h/dual wield/1h+shield/2h) or ranged (bows) early game. You dump so much into your magic for such little return AND you neglect every other stat - you can't carry stuff, your health is pitiful, your armor is a joke, and your damage output is an entire circus.\r\n\r\nEven on Adventurer (Normal), I was struggling with just how MUCH I had to cast to down an enemy - swapping to a 1h+shield instantly got me 1-shotting most enemies and dealing with bosses/minibosses without any trouble. Early game magic is just bad... until you get the proper items (armor, accessories, rings, wands/cubes) - then it gets better, but you're still worse off stat-wise than melee/ranged.\r\n\r\nOverall, it's an 8/10 for me, definitely worth buying. It's not Skyrim, it's not Oblivion, and it's absolutely not Morrowind (nothing ever will be), but the game's solid and stands on its own and very effectively scratches my itch for a good, captivating RPG.\r\n\r\nP.S. I really hope the Devs finish 3rd person mode. The armor design is superb (if you know Fashion Souls you know), and they put in Transmog options - it's wild that 3rd person was an afterthought, an \"accessibility\" feature - it absolutely shouldn't have been... why make the armors look so good?! Please finish up the animations and add gestures and poses for 3rd person.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "excellent game which goes a long way to satisfy the scrollslike itch i have",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A new category, scrollslike, has been born and I am here for it. Haven't had this much fun since the first time playing oblivion/skyrim. The voice acting is pretty good, the lip flaps are a little jank, but most importantly the RPG elements and the dialogue has been fantastic.\n\nUpdate: The game was going great until a bug happened during the \"Grail cycle\" quest in Act 2 which unfortunately caused me to stop my playthrough as it halted all progression with the main quest. Really unfortunate as I was loving the game. Just a word of warning/advice to future players - the game still has game/story breaking bugs which can cause a lot of frustration, ultimately still a great game but would be a little hesitant about buying it full priced because of this as it soured my experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A janky, unpolished, masterpiece. I've encountered so many bugs and yet they don't dissuade me from enjoying the game. The writing, atmosphere and gameplay are just THAT engaging. Should the devs continue to update the game post launch, it will stand the test of time as something phenomenal. As is, it is a good experience, but do expect the occasional jank to throw off your immersion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is best described like a single player MMORPG. \nJanky but pretty fun. Only the fun bits of a MMO are retained. \n\nIf there is a MMORPG that is similar to Tainted Grail, it would probably be as successful as WoW during it's golden age.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well, had no real expectation from this RPG, but it's really good!\n\nThe story, setting, music, European's folklore. All done very well to make an excellent Dark-open-world-RPG with interresting quests and lore. Even with such a dark setting, some quests are really fun. Sometime you start a quest by making something stupid, most NPCs have a lot of dialog, even if they don't give quests (sometimes you're like \"what?\"). Or you end up with a really good weapon by talking a to drunk in a cabin.\nI like the fact that the quests doesn't always have a happy ending, that you have to live with the consequences. Especially the ability to kill important NPCs, remind me of olds Elder Scrolls. The story is deep, sometimes, there's no good/bad choice, just the one you make.\n\nSometimes challenging, not a Souls-like,not a Elder-Scrolls-like, something new.\n\nStill, as an archer I think some items would need rework regarding their hitboxes.\n\n\"T'is but a scratch\"! :D (it gets me every time)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An RPG, Bethesda can't do anymore. Playing it gives same feeling as playing Skyrim for first time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A mix of skyrim and gothic with a unique and occult scenario, it's great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game play, great atmosphere, side quests are fun.\nWould do fishing in the blood lake again,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game was a breath of fresh air. While the graphics are not the best the story is very immersive. It does not feel like a dungeon crawl like Skyrim, however you can definitely see the influence Elder Scrolls has in the game. I HIGHLY recommend RPG fans to buy this game. Every decision you make has a consequence and the further you go into the game the more it becomes obvious.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good RPG. We need more of these games, instead of just waiting decades for another AAA title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an unexpected gem. The random encounters are just...always fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Я долго ждал пока ее подлатают но она до сих пор кривоватая...И все равно это не мешает ей удивлять, это старая школа. \nОдни из лучших побочных заданий которые я видел в играх и уйма продолжительных, проработанных и полностью хорошо озвученных диалогов, конкретный залипон.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is good.\n\nPros\n*The first 2 arcs are great\n*The story is cool and writing is solid (not incredible mind you)\n*The world is interesting and combat is fun but it does get more stale and repetitive.\n*Worth the price\n\nCons\n*The game feels a bit outdate. Like it released a bit before skyrim\n*The third act is decent but its a fall off.\n*The conclusion is a bit meh.\n\nRating 8.3/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its kinda like skyrim, scratches the same itch. I have a lifesteal sword that lets me cheese bosses with my build but I already was cheesing bosses because any build in this game is like that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game hooked me really quick. But as much fun I had in the first couple of hours, it fell off quickly. Mainly because of two reasons:\n- NPCs, their dialogues and side quests are generic and boring. In fact, I feel like speaking to the same NPC all over again and no narrative really is consequential.\n- The world is empty. Fits the premise but not what I desire \n\nBuy at discount, don't bother grinding side quests and just go for the main story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I find the game to be really fun. There's a free demo, I recommend you check it out. Having just reached Cuanacht, I can not see myself putting this game down anytime soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting story with engaging characters, challenging and rewarding combat and great exploration. Tainted Grail has picked up the torch where Elderscrolls dropped it and really ran with it. The build variety is top tier as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far Ive enjoyed this quite alot. graphics and gameplay are both solid with an interesting story. Many different ways to play and while it may be dark at times there are many instances of humor that remind me fallout. *SPOILER BELOW*\n\n\n\n\n\n\n\nCurrent favorite is where a god offers to give you a bit of her remaining power if you steal a minor object from someone like a spoon which is her whole thing. ever wonder why you can never find the matching pair for your favorite sock? she has it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's essentially Oblivion with essential parry and dodge mechanics. I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game was fun, darker Skyrim for those who want to know the play style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having a great time! It's a great challenge yet rewarding, definitely planning to play the most I can out of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the sense of exploration I feel from this game. I know the combat can have it's weird little quirks, but I personally enjoy that charm. I see great potential for this studio if they decide to expand on this IP.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First of all, like many of us, if you're looking for a TES type of experience, this is not it. It's clearly very inspired by it and overall feel of the game is pretty similar. However, it's not a multi million dollar franchise and it is not fair to compare it to one. If you felt like Skyrim was a buggy mess, this is like at least 10 times worse, which is expected of a game with such size. I can best describe the game as a game made by clear western rpg fans that took inspritation from everything in the genre I've ever played. The whole feel is very similar to DOS weirdly enough, even a bit of Cyberpunk is in there, the idea isn't that original. It kinda took all the worse parts of all of those wrpgs and somehow made them fun, it's as repetitively grindy as Skyrim, it's as lonely as Kenshi, it's as broken as launch Cyberpunk, it's as endearing and forward as DOS; However, it's actually somehow pretty good.\n\nI think it's the little things that make you connect to the game with these types of games so I will tell you a little story of my first few days I've spend in the game: \"When I first started, it was confusing, the game didn't hold my hand at all which I do like but seeing a massive world which has a massive lack of non-hostile npcs it felt kind of bland. I jumped and walked passed everything and I would die with just 2 hits from all the enemies. I made my way up to the main starting area game wants you to eventually arrive at, it was as empty as the wasteland, the area is just too big for like at max 10 npcs that live within it. It had this feel of an abandoned mmorpg that no players was left in sight, the npcs were pretty generic and the voice acting felt like it was done by one dude. Anyhow, I decided that I wanted to build a mage so I went around trying to find a place that sold spells, after like few hours I've finally found a medic, who was the main person to sell spells. I bought my spells, happy that I finally had some variety in my spells, I asked him if he needed help with anything. He told me he had learned of a ritual, however to research it further could cause issues for him since the ritual was done by druids, a pursuit forbidden at this time, so he asked me to go to that ritual place and finish it. I rushed there in joy, finally having an interesting quest since I've started about 4-5 hours ago, then I saw the requirements \"2 garlic, 2 onion and a venison\" which felt more like a delicacy than a ritual however, I didn't have any of those. Venison was easy I just hunted some deers but 2 garlic and 2 onions had me hopping around from place to place. In pursuit of common vegetables I've found the best set in the arc, became completely overpowered, killed tons of bandits, accidentally completed the bandit leader quests and I only had 2 garlics to my name which I've found in random barrels. I was at this point a god amongst man, most enemies died in 2 hits now and my quest to find 2 onions still persisted. I jumped around, did nothing but search for onions for 4 straight days irl. Finally I have accepted defeat and decided to just explore the world, out of nowhere I was attacked by a mist creature which covers your whole screen with mist so I thought it was the end of the map. Then I killed it, the mist was gone and I found a blighted village, I was so optimistic about finding 2 onions there, despite my attempts to focus on something else, all I could think about were onions. Sadly, there were none in the whole village, so bummed, I was going back to finally start another quest, however on my way I came across two skeletons towing the fields, I rushed to see if there was any onions, I didn't see any then I clicked on the skeleton, I had the option to talk to it, I would've never guessed, then I saw the option \"May I buy the things you grow?\", I jolted in joy, I bought all the onions AND the garlics they sold. I was like a little kid gifted a ps4 for Christmas, I rushed to the ritual area, finally completed the ritual. IT WAS DONE I WAS FREE! Then two dudes appeared and made fun of me for 5 minutes straight for thinking there would be a boss or some reward, appearantly it was a joke made by 2 druids. I sat there for a second frozen, then laughed my bottoms off.\"\n\n It's that kind of game where you randomly create stories, the world around is not very alive, nor vibrant but recognises you as an inhabitant. It's filled with nostalgic things for sure, but it isn't too afraid to stand it's own ground either. So, I reccomend you recognise it as it's own thing too despite drawing inspriations from every single popular rpg.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Refreshing to see such an RPG since Bethesda and Co. can't deliver anymore [/h1] \r\n\r\nFor such a small dev studio, this game is such a gem of an RPG game. \r\n\r\nThe devs took the most important RPG ingredients from \"Elder Scrolls\", \"Witcher\" and \"Dark Souls\" and made \"Tainted Grail: The Fall of Avalon\".\r\n\r\nThe atmosphere, lore, world-building, sound/music, story and art style fit perfectly together and make such a great, mature, medium-sized RPG game with meaningful decisions. Although there is a little junk because of the small budget in this game, it does not ruin the fun.\r\n\r\nI have played the 1.1 version of the game. I hope that the devs will do a (paid) story DLC (maybe Kamelot?) or directly do a sequel with a bigger budget.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having completed the main story and moving into NG+, I can now confidently say this game is a contender for one of my favorite games of all time, only being beaten slightly by Elden Ring and Skyrim. (Skyrim is barely hanging on as a contender, hb is gonna get replaced by this soon) Epic story, very cool looking weapons (There is a hand on a stick as an early game weapon, it has hand physics too!!!), and some of the most drippy drip to ever drop. I am a very big fashion enjoyer, especially in fromsoft games. I truly believe this game is god damn masterpiece and you NEED to buy it. Elevators will kill you more than you'd expect, so save before getting on one. BUY THIS GAME OR I'LL FEED YOU TO MY CAT.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Occasionally janky and buggy, but this is a wonderful CRPG of a different take on Arthurian myths. An 85/100 effort.\r\n\r\n[b]The good[/b]\r\n\r\nMassive game world with many different environments\r\nGame can be challenging at times, especially with boss fights\r\nCombat is well done\r\nCrafting that's meaningful and feels impactful\r\nVoice acting is pretty good\r\nExcellent variety of weapons and spells\r\nGood upgrade and skill system\r\nSome wonderfully dark moments and places\r\nThe Wyrd makes travelling at night interesting\r\nLittle if any handholding - no dungeon maps, game lets you figure things out for yourself\r\nIntriguing adaptation of the King Arthur legend\r\n\r\n[b]The bad[/b]\r\n\r\nAnimations can be stiff and janky\r\nSome clipping through the world\r\nEnemy AI can be variable\r\nAlthough the devs added stuff, there still isn't as much content in areas two and three as there is the first one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "How does Tainted Grail The Fall of Avalon compare to other Open worlds? Should you even do so ? \nIndeed the game borrows many things from Elden Ring, Skyrim and The Witcher 3 mostly... Unlike Skyrim or Elden Ring it is divided in zones. It resembles The Witcher 3's layout but its zones are much smaller. \nBut, What else should you expect? \n- A truly inspired take on the Arthurian Legends and an original story \n\n- Great art design on environments, enemies or special NPCs\n\n- A free gameplay just like Skyrim but way simpler (Magic is down to Conjuration and Destruction schools, No pickpocket system....)\n\n- Not a vast world, but filled with secrets, special locations and equipment \n\n- Combat closer to Elden Ring, which is a great thing ! Fights are quick but deadly\n\n- Many quests have non-Manichean development or conclusions, there isn't an obvious right or wrong choice like TW3\n\n- Good enemy variety! \n\n- Very pleasant optimisation, few/rate bugs and fast load times (SSD)\n\n- 66h for a 100% playthrough, more than enough yet not too short! \n\n🚨BUT the game has in my opinion a few shortcomings:\n\n- Mainly for me.... The dialogues! NPCs talk way too much and to say unnecessary things, it will for example take 3/4 sentences for an NPC to just say \" yes\" or develop unasked lore. I wish it had taken inspiration from the Souls series in this regard, teasing the player with very few elements and to encourage understanding through exploration and observation \n\n- By trying to take inspiration from Skyrim, they also neglected NPC development, Arthur excepted, all NPCs are quest related or quest givers, nothing more. So no one with whom to bond with. \n\n- Gameplay wise, the hack and slash gets kinda repetitive since you have very few different moves. One heavy strike and a short one, that's basically.... It. \n\n- Consequences of your choices will only be explained in the epilogue. It's not bad, but it means your choices will nearly never affect gameplay. Yes I know this isn't AAA budget game, but if it tries to play in the same field as AAA you have to be fair.\n\n- Great setting but I would have liked the game to fully embrace it's horror elements \nAll in all I know I will come back to the game a few times to explore the dungeons I didn't go to and that's great!\n\nI highly recommend the game to Open World fans, if they want to discover a very special universe, mainly for it's visuals, designs and overall tone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game !!!\r\nFun Magic use.\r\nIts not like Skyrim at all.\r\nSome features feels like they were added just to be there, like housing or pet for example. \r\nWhich does not fit the overall design of the game which is very dark fantasy.\r\nBut overall very fun gameplay, good quest design, it feels like your choices matter, the best FPS magic system i have ever seen. Great visuals (most of the time), game also runs great.\r\nIf you like Action RPGs its a must buy. Worth the price :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool atmosphere, good gameplay, worth checking out if you enjoy open world RPG's with visceral combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a beautiful gem, rough around the edges but shining bright! It is a shame it was missed by so many as it is a game on par with Skyrim. I absolutely adore the stories the people the aesthetics of this crafted world, I have a new love and deep desire for more arthurian legends. What a dark macabre world! Beautiful scary and majestic in its own right.\r\nOne thing I will mention. Your actions have consequences, beware as I thought I could live with them myself and that led me to miss out on a bunch of content and story. But then again such was my choice and I decided to continue and end the game with it. Interestingly that choice followed me to new game plus which makes me curious if I could repeat it again - what then :D\r\nI will return to play this again some time later, this playthrough was fantastic and delivered all I wanted from open world RPG, more than that I even had dreams of this world I thought so much about this game.\r\nTL:DR Its worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a solid game, especially for trying to be something like an Elder Scrolls game.\r\n\r\nThe game wears its inspirations proudly, some dark souls, some elder scrolls, and a few other RPGs.\r\n\r\nHonestly, this is a game worth trying out for yourself and seeing if you like it. I didn't think it was a spectacular mind-opening game, but I wholly don't regret the time I spent on it getting all the achievements, and seeing the different story beats.\r\n\r\nI've seen different reviews say it doesn't have enough side quests, or this or that from Skyrim. But I 100% Skyrim, and besides the fishing achievement, this was more fun. \r\n\r\nIf you are looking for another Bethesda-like that isn't from Bethesda, this is really really good. It is more linear, and I actually appreciated that, but exploration was almost always rewarded, and a good chunk of the quests gave me a chuckle or an eyebrow raise of \"huh, impressive\"\r\n\r\nThere is some weird comments about bullet sponges, game is too hard even on normal, having to change difficulty. I did not experience that whatsoever once I went all in on whatever build I was going for. I've tried a bit of melee, and you can have crazy sustain and damage with melee. Those reviews feel more like self-reports for the ability to make a build more than anything.\r\n\r\nThis does go into my main critique, the game does get REALLY easy the more stuff you get, but it's a neutral one. For story reasons, it makes a lot of sense the way your character grows and the power that comes with it, and honestly, it does feel good in that final stretch with the amount of damage you're able to put out. If you're the type of person who doesn't like power ramps in RPG's, of which many RPG's do, this one might not suite the type gameplay you're into.\r\nThat is due to my main critique magic feels too powerful, and kinda boring, I used the same spell (And it's 1 upgraded variant that has basically the same animation) throughout basically the entire game 3/4ths of it. I think the game shines more in its melee combat allowing you to actually engage with enemies than whatever build I used. \r\n\r\nIf the devs ever make another game like this. Not even in this world, I'd love to see the ability to modify spells like you could modify equipment, or even upgrade spells in different ways. You get so many awesome melee weapons, armor, etc and there are a lot of spells, but I could only find a few that I had fun with. Summoning is pretty cool though, no complaints on that. There are a lot of awesome summons.\r\n\r\nOverall, It's definitely worth the full price, but on sale it's definitely worth an experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While rough around the edge's this game is a great time. If you go in expecting a fun rpg developed by a small team you'll get what you expected.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game especially as an Elder Scrolls fan. However the optimization of this game leaves me crying. Even after upgrading from a Rtx 2060 to a rx 9060 XT 16gb, stable 60 fps on this game shall still remain a distant dream for me. I have resigned to the fact that I will only be able to enjoy this game ~40 fps medium setting at most.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, a bit like a Dark Souls themed world (in terms of it being bleak and dark) with gameplay and combat similar to The Elder Scrolls games. The world is fun to explore, there are many quests often with varying outcomes and decisions to make and the building of your character is fun. Combat is so so, melee and archery were meh but a mage build with dodging was pretty fun and with the right combo of items downright OP in the endgame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game if your looking for a modern skyrim. first couple hours hard, then gets easier",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this is one of the best games I've played in recent years. Like many have said, strong elder scrolls vibe but with a much darker tone. I find the combat to be overall more interesting than Skyrim's; however, it can be frustrating at times because the hitboxes are weird, arrows will shoot trees that are not in the way, and enemies can hit you on their backswing (really annoying when you're facing a boss that can one-shot you). I've enjoyed the story and the setting quite a bit. There are some souls-like elements to boss fights, but not nearly as punishing as souls. \n\nIt isn't as well polished as many AAA games like Skyrim. There are some bugs (I've not encountered any that were game breaking, but you can get stuck on nothing, especially when swimming. Fortunately there is an unstuck button in the menu to fix it). I wish it had a stronger modding community to fix some of the minor details. But I've had a ton of fun playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the music.\n\nI like the theme of Dark King Arthur.\n\nI found the skill tree interesting at first. (Skill tree is broken down really well, but many playstyles feel totally unviable or useless without MASSIVE perk investment and equipment bonuses.)\n\nI like how magic feels and plays, for the most part. (Magic was amazingly strong and powerful, but it also feels rather cheesy. Spawn a bunch of dudes at basically no downside who can tank for you, while you spam fireball or something.)\n\nI like how equipment works, mostly. (Equipment has unique passive bonuses that boost up certain playstyles, however they have stat requirements which you can't see until after you buy/make the item.)\n\nI like the first area quite a bit. (Lots to do. Super fleshed out. Tons of funny side quests with their own lore and story, like the guy with his war on seagulls.)\n\nI do not like ranged/bows damage or needing so much ammunition. (Crafting assists with ammunition.)\n\nI do not like crafting, though did not find it difficult, just a needed evil for damage scaling. \n\nI do not like the weird investment into sneak basically making it useless without sneak gear. (You pretty much have to find and join the games equal of the Dark Brotherhood to be able to do anything sneaky and be able to keep up with damage to other playstyles.)\n\nI do not like some of the optimization. (Game runs fine but in a lot of places it looks real blurry.)\n\nI do not like the second area at all, especially when compared to the first area. (The charm vanishes and it becomes a pretty large McGuffin quest with little direction. It also felt, story wise, kinda like you were no longer in charge of your own actions.)\n\nI do not like quest progression, or \"choices\" for those quests. (Choices do not matter, and most quests are go here, kill that, bring me back the thing.)\n\nI do not like the base price. (For almost $50, I suppose 30hrs of gameplay before you get irritated/bored is okay, but I vastly prefer 1:1 on cost per hour.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels like Skyrim. Literally everything I wanted for a fantasy RPG. However, there are still a few problems withing the game. But hopefully the developers continue to update and fix these issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Havent played much (most of it offline), but I can see the pattern.\n\nIf you love Skyrim (and maybe Formsoft games with it, I wouldnt take Oblivion or Morrowind here to comparison with heavy waight), this is game for you. \nLore is interesting and deep, open world with loot worth of exploring, lot's of NPC with different personality and intrests (had many good laughts and investments already).\n\nThe start of the game is a bit boring, but the more you explore the more you will find ways to unlock new, interesting and fun things - I tell you, exploring really is the key here! Don't let any turn unchecked, you will always find something to help you with previously locked path. And boy, when you find them, the story will grow and you get cool armor and shet. \n\nMusic and voice acting are amazing, the trailer aint fooling you. Animations not so good all the times, but not too bad eather.\n\nThis game gives you a spoonfull of options to choose from about difficulty - \"i dont take any damage\" to \"oh, he one-hitted me, the hell?\".\n\nIt is a bit of \"oldy schooly\", but in my opinion it is in good way. \n\nMy only meaningfull complain about it, is that moving around is really clunky. I'm playing on PC with Xbox controller, and I hate that I can move only sideways or straight - nothing else between. Just keep looking at the direction where you want to go. \nSome glitches with NPC moving, but as ES fan, I do see those as features, not bugs.. \n\nI mentioned Formsoft, because this lore and surroundigs have a lot of common with Dark souls I, but world and gameplay is closer to Elden ring. And boi, if you want difficulty, you can have it. But I would say, that NPC got more common with Elden ring than Skyrim.\n\nI will keep playing and exploring, and i will update this review once i myself had experienced more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros: The gameplay is fun, the items definitely leave room for creativity. The skill tree expansion/redesign definitely makes everything feel more impactful without feeling like ridiculous powercreep. Music is fantastic (as expected)\n\nPro/con: , the difficulty is a bit... difficult to understand - what I mean is that it's hard to size up your opponent until he's balled you up and tossed you in the trash. Overcoming these difficult encounters is satisfying, however... but slightly better signaling would be appreciated. \nCharacter customization is lacking, the female faces all look deformed. \n\nCons: The story... this is ultimately why I think I'm done with the game for now. Spoiler warning ahead. The majority of quests and NPC interactions are extremely railroaded, exhausting dialogue doesn't really add anything to what was already stated initially a large majority of the time. \n\n\nSpoiler: However, the biggest issue I ran into was with the Captain of the Keepers... He wanted to \"expose\" King Arthur for betraying his best friend but his apparent reasoning was \"just because\". Literally just to fuck with his people and to confuse them enough to unite with a completely different faction. Perhaps I missed something but this felt so forced and completely ridiculous so I decided to refuse to take part in it. Only to find out that once you reach the main city you basically start in is now irreparably hostile towards you. These same people who i've run countless errands for, literally saved from illnesses or other peril and now they're attacking me without so much as a piece of dialogue. It's completely immersion breaking and it's ultimately ruined my desire to continue playing the game, which is a massive shame because I was genuinely enjoying the experience. I've decided to restart my playthrough and take this as a lesson learned to just go with the flow, I'd urge others to do the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice game to scratch the Elder Scrolls itch with many things to do, but i feel its kinda rushed towards the end",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I almost never leave reviews but this game and studio needs all the help and visibility they can get.\r\n\r\nI haven't had that much fun since Witcher 3 - this game does not hold your hand and it got the old feeling of \"go on your own adventure, the story will wait.\" The graphics works for me, and the feeling of Elden Rings inspiration is very strong (albeit the game is based on this studio's older BOARD Game). \r\n\r\nI could try to go into details, but the most important for me is the feeling of exploration: you want to make just one more quest, and you take the turn left instead of right - and suddenly you are diving in the blood lake and find hidden doors. I need to use an alarm clock when playing it, and I was quite good with keeping my gaming in check over the years. The game pulls you in, and lets you sink in it on your own therms, be it exploration, chasing that crafting recipe or trying to kill the monster you should NOT try to kill at your level. It gives the Elden Rings vibe without the From Software skill bar - just a fedora nod to gaming parents who can't afford building muscle memory between gaming sessions too far in between. \r\n\r\nAnd one more thing, that happens quite rarely in games: stuff you craft is USEFUL. The armour sets look great, they convey the game style and the source material (if you make a corpse-based armour it looks like it ETC.) Waaay too many games make you craft useless crap or make most of the weapons you find subpar compared to quest rewards. \r\n\r\nTL;DR\r\n\r\nBetter written Skyrim with the Elden Rings flair",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OK I have not even left the opening dungeon but I literally exited the game to give it a thumbs up.  \nFirst of all the controller setup was clearly made by someone who actually has played games with a controller before.  There are some minor tweaks I personally would do but it feels very intuitive and playable just using default settings.  That may not sound like a lot but SOOOOO many games post that they have controller support just to put another check mark in the \"game features\" box - and then they're controller bindings are atrocious and they MIGHT give the option to rebind 3 random buttons lol.  Just horrible.  Being able to play a long, rich in-depth game requires the comfort of a couch and thus controllers.  This game really nails that basic game design necessity.  \nSecond - the sheer amount of adjustable features in this game brings a tear to my eye.  \nThird - I LOVE the atmosphere and as already stated, I haven't even left the opening dungeon lol.  \nFourth - the tutorial is very helpful and I loved the cooking option to just cook whatever optimal recipe you have the ingredients for.  I have the feeling this list is going to continue to grow as I play more but an enthusiastic thumbs up so far.\nFifth - swimming underwater feels dangerous, like something is just waiting to ambush you...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best rpg game i have played since fall out new vegas. I personally think its better then skyrim. the story is rich characters have depth and there is so much to explore. The best part is even though the game is complete with its 3 acts the developers are still working on the game and adding new content. These are the developers we deserve and i cant wait to see what they are cocking next. If you liked skyrim you would love this game dont hesitate to buy this game and enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game, it's like playing Skyrim, Witcher, or Might and Magic for the first time again. Combat is smooth and satisfying, story is well told, and the art style is fantastic. The inventory UI and skill trees are user friendly and easy to understand as well and I feel a lot of build freedom in that area. \r\nThere is only one major problem I have had so far, boss fights. The major ones in the Horns of the South are mostly ogres, giant beasts, and such and while a couple of them are interesting (the giant corpse eater was particularly fun, as was the necromancer) Many of them are super boring and repetitive. Moves are telegraphed like crazy and do outrageous damage, plus the bosses have SOOOO much health. The fights aren't difficult in a fun way they're just 15min long and repeat over and over because you're fighting a sponge. The biggest example of this is Galahad, I like this game a lot but if more major boss fights are like him I'm going to quit. He's easy to dodge and parry but takes 20min of wailing on him to damage him substantially and then he has THREE health potions. He's not difficult to read just so tanky that you have to spend 30min not messing up at all cause he does enough damage to kill you in 3-4 shots (at lvl 18 when I fought him) Also the fact that you have to fight a large group of minions immediately after his fight (which alreay is 30min) and CAN'T SAVE AFTER KILLING HIM OR RUN FROM THE FIGHT is absurd. I get it, \"Oh just grind\" or \"Get good\" but like I said, I dodge and parry nearly everything he does for 25 straight minutes, then mess up once and die and have to start all over and GO THROUGH THE CONVERSATION WITH HIM AGAIN. \r\nSo yeah, overall I love this game, I hope it keeps growing and gains more popularity and I think you guys have made something truly spectacular, but most of the bosses suck. That's literally my only complaint though so I would highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is honestly the first single player game that really made me want to keep playing in a long time. Its by no means perfect, but the atmosphere, story, and gameplay are quite good! You can parry in this game, and it feels pretty good when you land it. The soundtrack is great. I wish they had made third person a bit more fleshed out but its passable. Definitely worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is exactly what scratches the Skyrim itch. It gives the feel i'm looking for with a great level of innovation to the usual formula. The story is fun and compelling and the side quest have enough story to make them feel better than the traditional fetch quest. This is such a refreshing experience and well developed game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game took all the best from The Elder Scrolls! A wide selection of builds and the ability to change them at any moment during the game. The atmosphere and story are at the highest level. The musical accompaniment is fantastic, many tracks have been added to my playlist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Post-Ending Review:\nIt's rough around the edges. \nCertain mechanics and bugs can leave you scratching the head sometimes. You can see the effects of the limited budget at times.\nBut the combat is really fun, the world is pretty and the story is really bloody good -- enjoyed every second of it.\n\nMore than looking forward to whatever these lads make next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game so far, loving a lot of the game play mechanics. Magic is OP, even on survival, so making is magic sword and shield combo. When night falls, the fog comes in and you hear the bell ring... run.\n\nRuns exceptionally on Steamdeck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT story, but way too much dialogue to keep up your interest.  I love all things King Arthur / Merlin / Camelot etc, and I was reading every dialogue tree up until about halfway when I pared it down to main quest choices.  There are lots of choices that effect the story, but I don't think they were interesting enough to make me wanna run it again for a new ending.\r\n\r\nThe world seems huge at first, but the 50ish hours it took me to explore EVERYTHING made it seem smaller than I was hoping by the finish.  The map needs a LOT of work.  The quest markers are hit-and-miss whether they show up or are accurate.  There are three main zones and if you're in zone 1, you can't see quest markers in the other two zones.  It's just wonky.  Why haven't any gamemakers made the ability to make notes on a map the new standard?  This seems like it would be so easy and make half of my issues with the map seem much less significant.  I remember doing this WAYYYYY back in the Krondor days and I haven't seen it since.\r\n\r\nThe combat is fun, but unbalanced.  I decided to go two handed weapons from beginning to end and in the beginning it was tough.  You make your way through the first chapter and feel like you're getting the hang of it and the end of chapter one / beginning of chapter two slaps you right in the face.  I almost quit after trying to beat Galahad 1000 times.  I found a way to avoid fighting him which involved taking on a tribe of guys that could kill me and my workaround was just running.  It felt dirty, but it progressed the story and I didn't have to quit.  Then by the time you get to act three, you're slaughtering villages with little effort.  In the last run of the game, you end up running a gamut of baddies and I was murdering most with three or four swings of my axe.\r\n\r\nCrafting was meh.  Alchemy was handy, as was cooking, but crafting weapons and armor was pointless.  I did every crafting quest and bought every book and didn't use one sword, shield, or suit of armor ever.  Finding materials was pretty easy (except wood, for some reason) but again kinda pointless. \r\n\r\nThe skill trees were one of my favorite things about the game.  Your standard strength/agility/magic was changed and broken down into 7-8 trees that felt unique and could be mixed to make some interesting combinations.  The king's soul skills were a little underpowered, but helpful on occasion.\r\n\r\nThe biggest offender in the game for me was loot.  It is abysmal. Countless chests to be picked, every one of them have a potion, some arrows, and some food.  NOT A SINGLE good weapon or piece of armor to be found.  I love exploring, but after 100 houses packed to the rim with nothing but food for loot, I quit looking.  I even found secret passages in mineshafts that required mining a very subtle spot, crawling quite aways, and digging it up with my trusty shovel all for some food or crafting materials.  Stupid.\r\n\r\nOverall, it scratched my Skyrim itch for a couple of weeks, but I can't see myself playing through it a second time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I just finished Tainted Grail: Fall of Avalon after 61 hours, and overall I would recommend it to anyone interested. I completed every quest in my log, though it’s clear there’s still optional content I missed. [spoiler]Possibly some quests involving chickens, the lost knights, and a sea monster in Act 1.[/spoiler] There’s a solid amount to explore, and the world rewards curiosity.\r\n\r\nMy summoner build became overpowered around mid–Act 2; once I could rely fully on magic instead of stamina, the rest of the game felt pretty easy. Still enjoyable, but definitely unbalanced in favor of summoners.\r\n\r\nI did run into one game-breaking bug in Act 3 where I couldn’t speak with King Arthur, but reloading fixed it. Compared to Skyrim, this game is nearly bug-free, which honestly impressed me.\r\n\r\nThat said, I would have liked more NPCs, more dialogue flags to follow up on later, and deeper story quests. Some narrative beats felt like they happened off-screen when they could have been major moments. For example, I expected to [spoiler]go on the Act 2 Grail quest, take part in the push to conquer Avalon or lead a skirmish against Galahad, and attend the Moot before entering Arthur’s dungeon so I could argue my way inside.[/spoiler]\r\n\r\nInstead, those sequences either didn’t happen or were simplified. The game also set up interesting lore around [spoiler]Arthur being a reincarnated Princling Foredweller[/spoiler] but didn’t fully explore it. I would have loved a quest that let me interact with the different facets of Arthur’s soul.\r\n\r\nThe game does excel at atmosphere—Avalon genuinely feels ruined, empty, and on the brink of apocalypse. Dungeon design was a highlight, with several areas showing real creativity. But overall, I hoped for a bit more dramatic flair in the storytelling. It feels like the developers took Skyrim’s formula and simplified many parts to create a more cohesive narrative. It works, but the emotional range stays fairly flat.\r\n\r\nCombat shares that simplification. Nearly every boss fight happens in a circular arena, which becomes predictable. The duel with [spoiler]Galahad and Percival[/spoiler] stands out specifically because it takes place on more interesting terrain. In contrast, the final battle with [spoiler]Arthur[/spoiler] loses emotional weight by being staged in the same round arena. Even the [spoiler]Giants[/spoiler], while tanky, lack unique mechanics.\r\n\r\nDespite its shortcomings, I genuinely enjoyed my time with Tainted Grail: Fall of Avalon. The world is compelling, the exploration is satisfying, and the core idea is strong. I just think the story and encounters could have pushed further, because the foundation here is excellent—and with more dramatic highs, it could have been truly great.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Don’t buy this game unless you want to stop progress due to bad game development. Because of their bounty system it happens that you cannot remove the bounty on you and progress with the game. Happens to a lot of people in different areas. BTW you get a bounty just by being close to a place and when you get it you cannot progress anymore on the same save. Checked on-line and had so many people with the same issues 4months ago and still not fixed.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Starts off strong, only to quickly show its cracks after the initial area: irrelevant choice making, inconsistent voice acting (voice actors unintentionally pronouncing the same word differently in the same dialogue, actors restarting their sentences after a mistake); a very narrow set of viable builds, due to how certain weapons and stats work; awful hitboxes that aren't properly represented by their triggers' corresponding VFXs; an easily broken economy. All in all, it loses its steam around 4-6 hours into the game and it never recovers.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Act 1 is interesting, Act 2  starts feeling like they lost the plot and just stated putting in fluff to keep content going, Act 3 is more of Act 2 style fluffing. If they compressed this game, it would probably be great. There are good moments in Act 2 and 3, but it just feels like a grind/running simulator.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Skyrim mod for 40$ 3/10. \n\nScore: 3/10 - Not Recommended\n\nThe game feels unfinished, technically unstable, and mechanically shallow.\n\nVisually, the game resembles RPGs from more than a decade ago. Textures are repetitive, geometry is simple, and lighting is inconsistent. The world is largely empty, with long stretches of terrain that contain little to no meaningful content. Exploration often feels like running through wide, unpopulated spaces.\n\nThe story lacks engagement and emotional weight. NPCs have no personality, no unique interactions, and no memorable traits. Dialogue is flat and functional at best. Characters feel static, with no sense of belonging to a living world.\n\nClass balance is poorly executed. On higher difficulty settings, the mage is practically the only viable class. Melee and hybrid builds fall off quickly. Stealth is completely dead in the water and non-viable\n\nPhysics create additional problems. Fire spells launch enemies into the air, sometimes 20-30 meters away. When a quest boss is involved, this leads to situations where the body lands in tall grass, behind terrain, or outside the immediate zone, forcing reloads because the required loot cannot be retrieved.\n\nCharacter progression is basic and lacks impactful choices. Loot is repetitive and unbalanced. \n\nCrafting and alchemy have almost no practical purpose. Potions offer minor benefits, and crafting materials accumulate without meaningful use. The in-game economy is fundamentally broken: items valued at 1000 coins sell for 50, and crafted items sell for similarly low amounts. After finally locating a crafting station and producing a full batch of armor pieces, the total profit barely reached 200 coins. \n\nAt some point I stopped selling anything whatsoever and just stored all the crap I've found it in my camp stash.\n\nThe game suffers from numerous bugs: enemies launching into the sky, clipping through terrain, getting stuck in geometry, losing aggro randomly, and breaking combat loops. Collision issues, disappearing bodies, and unstable physics further contribute to the impression of an unfinished build.\n\nConclusion\n\nThe game shows potential, but its current state is unbalanced, technically weak, and lacking depth across all major systems. I don't recommend it, even for discounted price.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I am tacitly not recommending because the game is a lot of fun, but is also equal parts frustrating and flawed. The final nail in the coffin was that I was about halfway through the game and my save became corrupted and unplayable. I have never had this issue with any game before and while i have not played the most games, I have played a fair few so this is an unacceptable issue for me. \n\nI would be willing to try a game from this developer in the future to see what they can do with a better budget and improvements because honestly, the game does hint at some good design and philosophy. I was so caught up with side quests that getting to the main quest later did feel natural and acceptable. I normally do not enjoy first person but this actually felt quite good to me for some reason, encouraging me to give it more of a shot in the future in other titles. \n\nThe game does feel janky, and IYKYK and so that is a problem, especially at 40 dollars. The lack of polish is totally fine, but the jank is unfortunate. Fighting a bear that glitched up into a tree is quite hilarious but also shouldnt happen. You can certainly get used to and accept the jank, but it also is unignorable that it is absolutely there, That aside the menus can be a bit unorganized and frustrating but are not absolute garbage. More or less anything bad about this game is acceptable on some level, but is more worth a $25 and under pricepoint, not $40. All that side, if not for the save corruption that completely blocked me from being able to play any furhter meaning I would have to start again, I would have recommended, but that is a show stopper for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'd like to give it a neutral rating, because from my research into the game the devs certainly gave it depth and effort (aside from the balance, apparently), but since I have to choose...\n\nLook, it's certainly a \"scrolls-like\" right down to the jank and stiffness. Skyrim released in 2011 and that was fine then. Now it just feels bad. Attacks are clunky as hell and it's impossible to tell how much range you actually have with your weapons or spells, animations are floaty and lack the punch they so desperately try to portray. The story's presentation is awfully flat with the great King Arthur boring me to tears. I'm sure the game has its redeeming qualities (or maybe TES fans are just that badly whipped) but I felt absolutely no drive to continue past the intro. I'm sure it doesn't help that I'm rather ambivalent on Arthurian legend, but I was hoping the game would have SOME hook besides that.\n\nThe screenshots look pretty and the rapid cutaways of the trailer do too, but once you sit down and get to see it unfold in motion, it just feels unfinished, like they missed the last 10% of development involving just polishing and making the game feel good to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is an average game at best. Hard to recomend it over Oblivion. It does not come close to Skyrim in any way. 2011 vanilla Skyrim is better. Instead of buying this boo boo game, heres what you do. If you own Skyrim play another playthrough with 1000 mods active. If you dont own Skyrim, wait for winter sale, buy for $9.99, install, download 1000 mods and have fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love the game but every time I try to continue a saved game, the game tells me all the saved game slots are corrupt. Reinstalling the game fixes this issue but, for obvious reasons, I'm not planning to reinstall the game every time I want to play. If there is a fix for this issue - I'd give this game an enthusiastic thumbs up!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How is this game out of beta when you cannot complete a a main quest? Also has constant micro stutters every few seconds no matter the graphics setting even though have current gpu. In it's current state I cannot recommend this game as you will reach a point and wont be able to progress to finish the game and that is if you dont mind the constant stutters/frame skipping.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't know what it is. this game has everything that should have made me love it but I hate everything about it, not for me I guess, just feels bad I played more than two hours now can't even refund it oh well sucks to suck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Starts off strong, only to quickly show its cracks after the initial area: irrelevant choice making, inconsistent voice acting (voice actors unintentionally pronouncing the same word differently in the same dialogue, actors restarting their sentences after a mistake); a very narrow set of viable builds, due to how certain weapons and stats work; awful hitboxes that aren't properly represented by their triggers' corresponding VFXs; an easily broken economy. All in all, it loses its steam around 4-6 hours into the game and it never recovers.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I want to recommend this game, but I encountered a massive game breaking bug which prevented main quest progression.\r\n\r\nBug details: A key NPC would not show up at a specific spot at night. Others had this issue, I had tried their solutions (fast travelling between areas, exhausting all dialogue with other NPCs). Nothing Worked. I had to install a mod that enables console commands to fix it. It took hours to fix it. I even spawned the NPC at the location and it still didnt work. I ultimately had to force objectives to complete (and deactivate a optional objective). Then force the next quest to start, and now everything seems fine except that bugged quest remains in my quest log (with no objectives).\r\n\r\nOther than that, the game is fantastic. Graphically it may not have high-poly models or 4k textures, but it has a strong art design. I really like some of the armour sets you can get and the design of the Kamalot army (think Late Western Roman armor mixed with some medieval armour).\r\n\r\nCombat is like skyrim but with the dodging, parrying, and precision mods baked in.\r\n\r\nQuesting is solid. A lot of quests have multiple outcomes. You'll have to explore and talk to NPCs to uncover them. Really only the main quest is spoon fed to you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to like this game everything felt really fleshed out in the demo which btw is about 1.5 to 2 hours long. so, if you buy the game and are like \"man i really want to do that demo part again\" i would say don't. as soon as you are out of the demo area this game falls apart HARD. stealth is worthless in this game you cannot sneak effectively unless you wear almost zero armor and i got to the point where my stealth skill was maxed. archery in this game i don't think could be worse like if they get hit it's cool then once they know you are shooting it's dodge dodge dodge dodge parry (THE ARROW). the hit boxes are there sometimes? also, what is up with the fog? like if you can't get the technical stuff right just make the game look worse instead of being like \"man i think people would only like to see 50ft\". voice acting sucks, premise is silly, camelot whatever is like you had an opportunity and said \"nah we're good.\" idk it reminded me of atomfall in almost every terrible way.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played this game when it first came out and spent about 50 hours in it, came to the later parts of Act 2. By then I had experienced two hardlocks in two different side quests which did put me off of the game. Then I actually experienced smt similar in the main questline and since it is not a mainstream AAA game, there are so few guidelines etc. as to how to solve those issues. I shelved it for the time being. Then they announced the mighty big patch right? Game got much better right?!? NO! It literally falls to 20ish fps whenever I try to aim with a bow, hitboxes get bugged mid combat as my sword just goes through enemies and when I dash back, my character actually dashes forward. Before you say maybe your gamepad is old, this is the only game where it happens. I literally just finished Dark Souls 1 and God of War with the same gamepad. I am sorry but maybe bringing goofy stuff like flying pets and some other things were not supposed to be the priority of the game right now? I am really sad about the state of the game really. I'd say I hope they solve these issues but smt tells me they never will. As far as I can say, this game had it's brief popularity as the \"New Oblivion\" and now its abandoned and forgotten. I guess you could try it at a sale but not on a full price.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Performance took a hit once you get into the open world and combat doesn't feel great (played magic).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is divided up into 3 regions. After completing all the quests in the first region, there came a point where I had to deal with this group that were defending a temple. Apparently it's the ONLY way to progress on to the second region. The group was arroagent, rude, unlikable  and, apparently, unkillable! The game forces you to deal with this quest in a very specific way. You are not allowed to deviate from the story at all. You are completely railroaded. And I just didn't want to deal with this group at all. They were so incredibly unlikable, I just wanted to kill them all, but as I mentioned, they are \"protected by plot\" and unkillable. Fuck this game. I refuse to be railroaded to such a degree. I want an OPEN WORLD where I can go where I want and do what I want. No, this game wants you to play it's very specific storyline in a very specific way and robs the player of all agency. Life is too short to waste on a game like this. I'm off to find a better game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "such a cool game, I wanna get into it but the games so unoptimized and it looks like a smeared painting.\r\n\r\nKinda garbo. Wish I could get my 50$ back...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have really tried liking this game. The world is pretty interesting but that's about it. The combat is ok but the rest is not great. Constant stutters and low performance on a very strong rig. Characters are hideous and the game itself is just a bit boring. Wait for a crazy discount.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a very good example of a game that didn't do anything terrible, but didn't do anything impressive either. Combat is solid, but not ground breaking. Plot and voice acting are okay, but never amazing.\r\n\r\nI get that it's supposed to be a world in decay, but it feels empty and the map feels like a checklist instead of something interesting to visit. I haven't seen a PoI that made me think \"that looks cool, I want to visit it\", more drawn to them because there isn't anything interesting in between PoIs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "in its current state I cannot recommend. I can turn all of my settings all the way down to low and there is zero fps improvement. Not even 1 frame. At least add frame generation if you don't want to optimize the game. The game itself is great. But I cannot look past how bad the performance is. Can't even get above 100 fps and I'm using a 5070 for crying out loud. Fix your game!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is no bad but have too many problems and other thing is is not a Skyrim style sorry but not this game is not close to skyrim. this game too many problems and zero mods that make the game better. Skyrim SE now for me with the mods it looks better, run better, have better animation combat and magic animations better fights and better boss fight. this game only runs att 120fp for me inside places caves, house etc... but outside drop hard to 60fps not even other open world from Unreal Engine drop that low for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Left mouse button uses right hand in the game. Right mouse button uses left. Refuses to change it. \n\nNot recommended. Legit annoying beyond fuck. Can't even mod it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game felt kinda clunky. I don't know how to put it by it feels unpolished every step of the way. For example,  I haven't used the time slow ability in the first boss fight and the tip on the right of the screen didn't go away. That's just one small thing, but there's lots of them.\n\nI also don't enjoy the grimdark-weird style, so maybe the game just isn't for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bruh. Game plays like a Skyrim ripoff and story goes off the rails real quick; seems like a mistranslated shitass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its kind of clunky and some bugs are terrible maybe game ending?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "An attempted improvement over games like Skyrim? But somehow managed to have more glitches than Bethesda even, its almost impressive the complete lack of bothering to make hitboxed consistent or even possible to hit enemies from afar with the bow. By ~20 hours in I still hadn't shot any person, bear, wolf, deer or otherwise from far enough away to need to aim the bow above them to account for gravity, not for lack of trying. It seems like once the arrow leaves the 10 feet around your character it no longer exists and instead just alerts them to your presence and wastes the arrow. Good effort, poor execution.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wasn't enough for me to be sold. Game is fine and worth it but not if you play a lot of these games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of those games that needs a neutral score. 5/10 \nSkyrim from Temu. The only thing that comes to mind to summarize this game. It would've been fine if core elements were polished.\nMelee- junky \nBows- awful and weird\nMagic- okay?...\n3rd person- dont even ask about it\nSoundtrack- some old dude moaning...\nWorld build like a thrown glued together assets. Turn around the corner and you see how bad it is.\nVisuals are only good in basically 2-3 corridors and rooms that are shown in the trailer.\n\nThe only polished thing is UI. A real shame that we are getting this weak of an rpg 14y after Skyrim release.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks, don't let these nostalgia baiters tell you different in the reviews. This is one of the worst games I've ever played. It looks and feels unfinished. The HUD and font choice is just laughably bad. Skyrim blows this game out of the water in every aspect. That's why you're here right? The Skyrim comparisons? Just go replay Skyrim. You can't even mod this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There is no option for change or invert mouse buttons.\r\nUnacceptable for a 2025 game in my opinion.\r\nI cannot play it, I ask for refound",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "biggest POS skyrim wanna be i have ever seen. it takes everything great with these kinda games and shits all over it. its mediocre. possibly an asset flip im not 100% sure but the core gameplay is trash and a waist of time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I made a toon.... did the tutorial (*almost 2 hours - no more refund*), traveled and picked up a dozen quests..... NOW no clue where to go,  what to do, and how to do it. Quests not showing up on the compass, or the map... what a waste of $40.00. Do not recommend!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Melee is suffering. I made it to the second area and it's just as bad. Really feels like dev preferred ranged combat- because it seems like all forms of ranged combat do way more damage than melee and are way more survivable. I am continually questioning \"am I supposed to be like 20 levels higher here?\" because it takes like 10-30 hits to down basic enemies, and they kill me in like 2-4 and I'm heavily invested into strength and endurance and armor, and am wearing the absolute best armor rating I've found, probably some stuff I wasn't even supposed to get since I wiped out the Del Riata. Also group combat is very common - and although parrying and blocking interact with multiple enemies at a time, melee attacks, at least 1-h, do not... going pure melee really sucks unless I'm missing something - I would love to know in the comments what I'm missing here.\n\n-traveling and environment-\nI'm getting really sick of tromping back and forth over the same areas. You can't fast travel to every poi on the map, only to certain ones - so that's getting pretty old walking through the same static area for the hundredth time. So many areas are designed in a way that makes them very tedious to traverse, especially ones where you can't pull up a map. I wish you could just climb... I've experienced a lot of \"Wow, that looks like something I could explore over there, I wonder if it's worth it...oh, a chest with an onion and 2 coins.\"\n\n-bosses-\nJust huge bags of hitpoints that do huge damage with the tiny attack variety they have. No phases. Nothing interesting.\n\n-story-\n[Subjective warning] The first 2 main areas were weird and interesting. By the time I got to the swamps I'm kinda sick and disinterested in quest abd123 \"I know you just want to do simple thing but i can't because someplace is spooky and i need you to go there and spooky out the spooky then come back and I'll give you another chore to do\". The characters don't really have any personality. None of this feels meaningful or changes anything. I really stopped caring anymore about what's going on and am speed clicking through pointless dialog. I don't want to refund, but man, I can't say it's good but at least the dev tried to do something different and it does count for something in my book.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This title is rooted from rich RPG lineage however their realisation of a digital paid product, fidelity level including performance levels is severely limited. And this consequence can fast become the consumer's burden which should never be the case.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Still feels like early access\nToo many game breaking issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is a hole in which a dev put a skeleton, if you go down this hole, you can never get out. If you afk right after you go down, your autosaves will all be in this hole. Preventing you from doing anything else. For this reason alone I dislike this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a Skyrim game that does a fairly good job with a strong opening. The game gives you the option to skip the last third of it.\n\nThe red death is the big opener but nobody cares about. Imagine Medieval Europe, nobody cares the plague is happening.You escape quarantine, starting the game in a distant outpost. You spend your time helping the people of Camelot. The Outpost Commander has told everyone to stop doing their jobs which has caused major problems. Turns out he's been away for some time ploting treason with savages who haven't been mentioned until now. The commander invites you to commit treason and political assassination. You go to meet the guy you're supposed to assassinate as he's in the process of executing some deserters and conspirators, as expected. He tells you he's aware of the plot and has been sent here to deal with it and to restore order to the hinderlands. So Camelot is already on top of the insurrection, no worries. You meet the Knight amid his flawless victory.  He tells you that he likes you and to go back to the settlement, appoint the second as the new CO and tell the men to get back to their duties.  Order is restored.\n\nApparently that isn't what the game wanted you to do and doesn't even acknowledge that you did it. At the beginning of the Third Act you run into some girl who asks you what happened to those guys you killed in the First Act, and you can't even acknowledge your decision. You have to respond as if you made the choice that the game expected you to make and that they were all still alive, safely plotting insurrection.\n\nVery often dialog is giving you multiple options to say the same thing. You start running into LGBT issues on more than a few occasions. It shows up but you're already thirty hours into the game. You get a quest to help a porn distributor to recover confiscated merchandise. The church confiscates the Porn intending to burn it. You've got to save the Porn. \n\nYou find a guy T-posing. He was a musician that annoyed a magician. The magician gives you the cure which burns his insides as if he was on fire. You can either conclude with him, that he deserved it, or you can tell him that the druid just having a bad day, that he's actually a very nice guy. \n\nFinally you help this guy forgive himself for helping locate and genocide his own race to the point of near extinction. You are given four dialog options each one to tell him he should stop feeling bad about what he did.\n\nThe Second act is about turning the magical wards back on and saving Camelot from the Plague and the Magical incurrsion. The wards have worked  for 6 centuries and will probably work for another, but if you give it to Camelot to turn all of the wards back on nobody turns any of the wards on, and if you give it to the governor he only turns his ward on and nobody else's. \n\nYou can actually just skip the thrid act. Tht is an available option. The Savages from the first act get remembered. You have to do some side quests for them. The Side quests are completely stand alone. They don't have anything to do with what comes before or after. You're helping with the insurrection again. You have to convince the tribes to gather and participate. They actually don't care. They express zero interest. Not that they're afraid.  They don't care. It's not an issue for them. They should have picked one of these quests and made that act three, but they didn't. \n\nOn one the quests the chief did some magic and made himself the best. He spends his time sitting, being the  best. The tribe tried to elect a different chief but best cheif killed him in one blow. You have to talk to some giants. They're in hard to reach areas. They give you an overblown speech. You fight a common mob enemy. They tell you how great you are and you repeat on the other side of the map. You fight the best chief and right before you best him he stops you and asks \"who do you want to be chief now,\" then you tell him before killing him ending the fight. If you pick option A they'll help you, if B no. This quest has nothing to do with anything else in the game. It is in the main story line. All of the tribe quests are like this.\n\nAnother quest, everyone is trying to take a nap. You got to help them nap. You go to dream world, get asked to kill a low level mob at some location, repeat. Turns out a Giant is making them nap becaue Camelot killed her children. The giants where just decorations before. You were just talking to a bunch of giants who thought you were the coolest guy ever. Now this giant is saying you killed all the children. Then the game asks you if you would like to free the giants. I say, \"sure, I guess.\"\n\nYou do all of this running around to get all the tribes together to have an insurrection. I spent the entire game not wanting to commit treason, but here I am. You do that and it doesn't matter if you got them all or none because you give them a nuc.\n\nWhere does the once and future king fit in? Well he fits in at the beginning of act 1 and the end of act 3. The only character that expresses any actual interest is the dude who gets you out of quarantine. Nobody else cares. Arthur black-pill trauma dumps on you. By the end of the game he expresses humanity is the problem. He and humanity should be allowed to die.\n\nHow's the game play? Mid. Enemies kept sinking into the ground so I couldn't find them to loot them. There's no highlighting. Kept the same loadout until the end where the op stuff invalidates your +16 weapons. That's 60k to upgrade.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "combat sucks ass in this game good story though",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Combat in this game is the worst thing i`ve have ever seen",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Maybe a bit too much like Skyrim.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BOOOOORRRRRINNNNGGGGGG\n\n\nEdit: wowwie zowwie! thanks for the free steam points :3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "there is a sevear lack of blance in this game from items to enemies.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have beaten the main storyline and have found myself so angry about the quality of the game past the first act that I have decided to post a negative review outlining my frustrations for the world to see. Spoilers ahead. \n\nThis game was so obviously thrown out too early. When I first got the game and was playing it, I was absolutely awe-stricken by the first act. I thought the various dungeons were awesome, the sidequests were engaging, the area was fun to explore, and the main story was riveting. Moreover, I thought the lore was exceptional. I was super excited to play this because it reminded me so much of something like Enderal, which I absolutely loved playing as I found Skyrim to be a severely lackluster game as far as story, quests, and dungeon maps were concerned. \n\nThe first part of the game had some great pacing and writing. It had several characters that seemed pretty deep and complex. And the conflicts seemed multi-faceted and interesting. Then came the second act. \n\nThe second act was atrocious. The beginning was good enough, I suppose. But I found myself getting more and more bored by each passing sidequest. Every single one comprised of \"Go talk to this guy, walk here, talk to that guy, walk back, talk to this guy, walk back\". Over and over and over again on repeat. Then I started noticing how disjointed the questlines were- as if someone hadn't playtested the actual quests. I'll give you an example. \n\nThere were several instances where in order to progress in the main storyline, you had to speak with a character and get them to do something for you. I'd say there were about five-eight of these, especially near the end of the second act. You'd go to said NPC and they would essentially go, \"I'm not talking to you about that\" when you pick the dialogue option for the main quest. Okay. Weird. So then you go through their dialogue and find out that their toe hurts or something. They start going on about their toe. You check your main questline again- it just says go talk to the NPC. You try again to talk about the main quest. \"I'm not talking to you about that\". So the only thing you have to do is their sidequest about their toe. \n\nYou go off to do their toequest, come back, talk to them about their toe, they go, \"Thanks for fixing my toe.\" And you get XP. The prompt still exists for the main quest- but now when you click it, they go, \"Ah yes, I shall talk to you about this now.\" \n\nIt's so bizzare when you start noticing how often it's happening because none of these toequests are tied in to the main storyline in any way whatsoever. One would expect this toequest to trigger when you talk to them about the main quest- i.e., \"I can't help you with your main quest, my toe hurts!\" -update in main quest to indicate you must fix their toe before you continue the main quest-. But it doesn't really bother me until it becomes apparent that this isn't some kind of, \"Ah, you don't want us to hold your hand! This is dynamic questgiving!\" BS, but a lack of playtesting. \n\nThere is a part where you need to go on a toequest and the sequence is as follows: \n- Locate NPC in the castle\n- Try to talk to NPC about main quest, refuses\n- Talks about toequest\n- Leaves castle to go back to an area you already cleared earlier to talk to an NPC you already talked to earlier in the game, there is no teleporter, you must walk there.\n- get an item that NPC had this entire time and could've easily given you earlier because this NPC is basically omniscient.\n- go back to castle to talk to first NPC to give item to\n- npc tells you to meet them somewhere 50 feet to the left of the building you were just in\n- go to the altar you need to meet them at and speak to NPC\n- loading screen triggers\n- you are literally standing in the same spot you were just standing in but there's a dream filter on it\n- you talk to the NPC again\n- have like 4 lines of dialogue where you make a choice that does not matter what you pick \n- loading screen\n- NPC thanks you for fixing their toe\n- NPC DISAPPEARS \n- you must now walk back to NPCs house \n- speak to NPC about main quest\n- NPC goes \"Yeah I'll help you now\"\n- progress main quest.\n\nI mean this is ridiculous. Why this is on two separate questchains that require you to, at the end, have a whole separate conversation with the NPC is an enigma. Why the hell doesn't the main quest just proc after you finish the sidequest? Well, because the programmers can't figure out how to hook the two quests together. So you have to go walk back and have an additional conversation because it's literally two progress lines. Like wtf is that?\n\nThen as you get into act 3, you start realizing that the dialogue was written out of order and no one playtested it. You have a scene where Arthur goes on a toddler meltdown because he hates one of his descendants. Literally exit the main area, talk to him again because he says he wants to talk to you, and he goes on about how he agrees with what his descendant did. Like wtf. \n\nWhen you get to act 3, you go to the main quest area and it basically tells you can skip all of act 3 if you feel like you're strong enough to end the game. Queue the most bugged, HP-tank, disappointing dungeon in your life where you fight like 6 giants and 12 guardians who have more health than is even reasonable. But don't worry, if you are a mage, you can easily run through it in an hour or two by just summoning stuff and having the enemies glitch themselves into walls or get trapped on ledges and let you bleed them to death. \n\nSo then you get to the end where you get to pick several ending options. Well, don't get too excited because they didn't actually write enough of the endings to make any of it make sense. It goes on this end sequence where it retells you the choices you made throughout the game (Wastelands 3 style). Except none of them fit together. So things will happen in the ending that are completely contradictory to each other. For example- I destroyed Kamelot. And yet 2/3rds of the endings go, \"And then Kamelot did this, and Kamelot thrived, and Kamelot funded this thing\" and it's like... I killed Kamelot, how are they doing any of this? I also gave the soul to an NPC, so they go on about how that NPC changed the whole fabric of the world and how happy everyone was- then immediately goes, \"That NPC went with so and so on the quest to the holy grail and no one ever heard of him again\"... when that quest for the holy grail happened immediately after act 2. Lol. So he changed the world and everyone loved him but no one saw him. Okay. \n\nAnd that's just the blatantly bad programming/technical issues. I didn't even touch on the writing which heavily nosedives into absolute garbage. Arthur becomes this whiny idiot and every single cutscene is just people telling him what an idiot he is in a red background. Like the cutscenes at the onset of the game were impressive and dynamic- you can tell that they just kinda gave up. And every single plot point is hammered on over and over and over again into infinity where you start skipping dialogue because everyone's just saying the same BS over and over again. Arthur actually gets to a point where he goes, \"Idc what you do, I'm a big idiot anyway. :(\" when you make a decision. Then later becomes a boss to kill you if you don't do what he wants??? I mean there is no consistency. There is no cohesion. The characters kind of all have the same opinions about everything despite wanting marginally different things. \n\nThis game was poor. Beyond poor. The first act was an easy 8/10+ experience and the second and third acts were so horrible that it brought this game to well below a 1/10. It is unfinished, there are bugged quests, there are quests that don't even tell you what to do next, and the story is crap. They should not have released it in this state and anyone giving this junk a very positive has only played the beginning of the game. Absolute dogwater.\n\nEDIT: Also, I played 37.9 hours. Lol.",
      "voted_up": false,
      "votes_helpful": 113
    },
    {
      "review": "Why is this game steam deck verified? I️ just got onto the initial island and I️ constantly get sustained frame drops to around 20fps. I’ve turned all settings to the lowest possible with the same result. I️ actually do like the game, but I️ mainly got it because it was steam deck verified. This is extremely frustrating and now I️ can’t even return it.",
      "voted_up": false,
      "votes_helpful": 102
    },
    {
      "review": "As is, the game is really fun. It's got very cool thematics and is basically Skyrim but with (somewhat) better writing, more actual decisions and more character build depth. Plus gameplay is deeper and more cinematic. That said it's less polished and clearly rougher. But damn it just oozes that atmosphere and aesthetic. Plus it hammers in the idea of \"no good guys, just people.\" very well.\n\nWhy am I hitting thumbs down? Because it's probably not going to STAY that way. Since release (and before) the devs have not been focused on fixes and optimization. Instead they nerf everything that is \"too good\" and kill any powerful, synergetic builds or items. Treating it much like a competitive MMO rather than a singleplayer experience that already has a difficulty setting. Did you enjoy being a crit-fishing rogue? Not allowed. A mage that uses their mana bar as a shield? Overpowered and removed. Use the sleep status? \"The strongest status in the game.\" Set to 0%.\n\nWhatever the gameplay looks like now, it probably won't in a few weeks or months. It'll likely be homogenized numbers hell where nothing is allowed to be too powerful or dynamic. You've been warned.\n\nI hope to retract this review, but that's what it looks like right now.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its one of those cases where the game is good but i cannot recommend it, art direction is great, love the grim dark world they made, lot of good ideas, graphics are dated tho its not a big deal to me, gameplay is ok if a bit stiff, game has a good lifespan and replayability with NG+\nNow the reason why i cant recommend it, its still full of bugs, badly optimized, its doesnt run well and alot of people complain about stutters among other things, now when it come to patches devs seem to think its a good idea to focus on meaningless item nerfs again and again in a single player pve RPG instead of working on optimization, and the final gut punch for me : true ending is bugged too, after 106h of gameplay having done everything the game had to offer, turning every stone and exploring ever m² of the map, i couldnt select the true ending option at the end even while having the required item in my inventory and having visited every single secret area and every tomb and having done every single dialogue, just bugged.\nFinishing the game on this note felt sour and for all those reasons i cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I went back and forth on this for a long time, but ultimately when I saw the Devs were asking for steam nominations for \"Outstanding story-rich game\" it pushed me over the edge to Do Not Recommend.\r\n\r\nI'll start by saying I enjoyed most of my experience. If you're looking for ~20ish hours of fun, RPG, Dark Arthurian legend I think this is a great offering. I've heard other people say it's like an Elders Scroll game and I generally agree that it reminds me of skyrim in its game loop. I think this combat is better, and having played from start as both a mage and a 2H I felt both presented different experiences. I found the lore interesting, and the world different from many others. In short, if you liked skyrim I think there's a lot here for you.\r\n\r\nHowever, I think the game steadily struggles the farther it goes. The game is broken into Three Acts (zones) and a finale. The first Act was a lot of fun, I wasn't blown away by the art or characters but I find myself engaged at every point. I found exploring interesting, and I was full of questions. Based on the complete %'s about half of people who buy the game don't make it past the first act, and I think someone could sink a dozen or so hours into this first part and still have things to do, or alt choices to make.\r\n\r\nThe Second act is not as tight as the first, but what it lacks in story and intrigue about the world it makes up in a better zone. There's more to find, the area feels dense full of hidden secrets, long side quests, and dense bounty tasks. In both of my play throughs my Builds really came alive early in this Zone as I got access to more interesting items. It's not as tight though because the structure of the narrative gameplay starts to wear me thin. At about 25-30 hours I began getting really tired of every NPC expositing at me. The game has a lot of characters, and few are endearing and even fewer are interesting. Most everyone is some form of 'weak' a point that is hammered home constantly by that over the shoulder voice. Additionally, by this point a fair amount of the Intrigue has been built up but very little paid off. There are long segments where characters explain things to the player that the player has already had them explained by other required mains story conversations. While people do forget things this being optional 'remind me' would have been preferred. \r\n\r\nIf the game had \"ended\" there I would have written a recommendation. My complaints thus far are minor in the grand scheme. I would give this a B, which I think is a completely fine grade for the price on offer. But then we had the Third Act and Zone and it tumbled far.\r\n\r\n% wise at the time of me writing this only 20% of players reached this point. I point this out because I think most people stop before this point and have a pretty good impression. The Third Act is a step down in all categories. The Writing takes a noteable quality dip, and as a story game I will focus on that in a moment. Combat wise the enemies are nearly all rehashes, some are even the same model. There is less to do compared to the other zones and far less to discover. Most of the build changing items are in the Second Act so if like me you were really invested in level-growth you're now just grinding levels. On that topic, the sudden jump in enemy raw stats between act 2/3 felt much greater than 1/2 which was a shock. Despite being high level and well geared I got wacked around by some base enemies while crushing some of the elite/minibosses. The area felt widely miss-balanced in terms of combat.\r\n\r\nThe third area is also the most visually uninteresting of all the others. The Second Act area stands out as the best but the third is boring to look at and an absolute chore to find your way around in. The layouts are neither natural nor inspired, which is a shame given how strong some areas were in the previous acts. As I sit here I immediately come to mind with many areas throughout the game that had me on the edge of my seat, none of them being in this part of the game.\r\n\r\nOkay- I've written a lot, but I've done so because as I said at the start I was on the fence. So dear reader perhaps you've gone this far and decided you think this sounds fun and fine and I wish you the best. \r\n\r\n...\r\n\r\nSo that final act story huh? There are characters that give the wrong directions to locations, they describe things incorrectly, there are quests that seemingly jump to their conclusion and multiple dialogue trees that lead nowhere. The amount of times I picked a dialogue option to have the character react as if I asked or said the opposite was infuriating. I also personally detest being forced to ask a clarifying question about information I do already know before being allowed to continue. It's even worse when I have to ask it just for the EXACT same information to relayed that was relayed before I asked. This final batch of characters are some of the worst in the game- I'm supposed to care about them but I hadn't yet encountered a feeling of such repulsion as these four. Yes I managed to gather them all, how that worked I'm still lost. Answers to problems that seem obvious are somehow the 'wrong' answer, characters seem to flip their beliefs and emotions on a dime, in some instances they straight up lie but not in a way that feels intention more like a mistake.\r\n\r\nThe game spends so much time in Act2 beating me over the head with \"aren't these lads just useless huh' and when I got to Act3 I was shocked how little the game condemned any of these feckless children. Also, the amount of time Act3 spends referring to a character who said a grand total of 30words to me in Act1 was mind blowing. On my first playthru, following the guidance of the quests, I didn't talk to that guy- why would I? On my second playthrough i did, and I have a slightly better understanding of why so many Act3 Characters refer to him... except I don't find him to be an interesting character so I don't really care. Lastly, I didn't pickup a Dark Kalemot story to spend it with this faction. Between this faction and the environment we went from 'a take on elder scrolls' to a 'discount skyrim ripoff'. But, to make these weak characters worse the game presents an option to select one- which like, either add everyone or no one. If I had to pick someone (which I didn't have to) the obvious best spice boi isn't even on this list? If you're gonna let me curveball let me Curveball not this wet noddle. Yes- I have replayed back through and picked different options to see how final plays out. \r\n\r\nMy character even knows he's sick of all this. You can skip the political elements and go straight for the item in Act3 and if you do your dialogue option is something like \"I'm sick of avalon.\" Bro, me, too. But, the story doesn't answer fundamental questions. In fact it raises more in the final moments, and I mean final final moments, instead of clearing things up. I really can't explain of displeasing it is to do tons of side content to get as clear of a picture as I can only to find contradictions and huge gaps in the final third. I went online today to read through guides, wiki, writeups, and vids to double check my knowledge and there's a plethora of handwaving or inaccuracies between online sources too.\r\n\r\nTldr; this is a good game. I like it. But, I'm really frustrated by how the ball drops in the third act and poorly the \"Story Rich\" part of this game wraps up and presents itself.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Althrough I appreciate the incredible scenery and atmosphere in the game, for me the game is pretty much unplayable. The combat is just so unfun - it's tedios, sluggish, boring and every fight seems like a chore you have to force youself to do in order to progress. Melee is hard in all the wrong ways - you feel like a fragile, slow beating dummy while enemies run circles around you teleporting 10+ meters forward to hit you, jumping back and throwing stuff at you, while you are simply too slow and sluggish to react. Mage is just an autoclicker - keep clicking until enemy dies, rinse and repeat.\r\nIf you completely remake combat to be fast-paced and fun (speed up my chracter in every regard like x3 times), then exploration just might become worth the hassle.\r\n\r\nAt this stage the game is too much of a chore to play, and will likely see player numbers drop to triple-digits very soon, with devs sticking to their guns and unable to compromise on combat mechanics.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "334 hours spent but it's a no-buy right now\n\nThe game WAS great, and worth the money, but dev is still making significant enough changes to balancing that you'd be wasting your time playing right now only to have your time and effort zero'd out by their clumsy methods of balancing and seeming ignoring of anyone not in their inner-discord-circle.\n\nMy suggestion is to wishlist it, and wait a year and then purchase and play. By then all of the rug-pulled-out-from-under-you changes their discord boot-kissers suggest will have settled in and the experience should be smooth.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I remember when this game launched and there was a significant amount of hype around it, particularly with streamers. It's on sale today and I had nothing to do because I'm home sick with the flu so I thought I'd give it a shot. I had great expectations based on the user reviews but it appears my taste doesn't align with most of these other players. I'm currently far enough into the game that I can no longer request a refund; unfortunately I thought if I pushed through the game for long enough it would start to improve as the story progressed.\r\n\r\nNo such luck.\r\n\r\nI feel mislead by the ratings, and I also feel mislead by the \"open world\" description because it doesn't feel particularly open so far; rather it feels like a bunch of interconnected zones filled with stuff and enemies. The combat is okay-ish, but parrying feels sluggish and unresponsive. Ranged combat feels equally unsatisfying and unless you are close it is unclear whether a target is in range of spells or arrows.\r\n\r\nPerformance is fine, graphics quality is fine, but the art style doesn't resonate with me and I get the distinct vibe that assets were not necessarily crafted specific to this game, or by human artists for that matter. It was a surprise to learn this game is using the Unity engine because I own other Unity games where the graphics and art style are wonderful. Unfortunately this game's art style actually ruins the immersion for me.\r\n\r\nThe game feels unfinished and before writing this review I had to check to see if it was still in Early Access. Clothing articles clip through other clothing articles. The UI screens are clunky and unintuitive. Dashing to avoid getting hit by enemies in this game is weird and unfortunately the most effective way to survive extended fights. I've experienced dash in other games such as Cyberpunk 2077 but this game's dash seems excessive by comparison, even with the 3-dash cool-down in place.\r\n\r\nI could forgive all of the above if the voice acting and story were top-notch, but as someone who grew up reading Arthurian legends I actually rather hate the story so far and I'm unimpressed by the premise behind it. I especially hate the style used to depict King Arthur's spirit; yes it looks like medieval armor but it makes King Arthur look more like Sauron from the LotR films than the Once and Future King. The background music is also quite depressing and got on my nerves after the 2nd hour.\r\n\r\nAll I was hoping for today was something that might hold my interest for the next few weeks but I've already reached the point where I'm ready to move on to something else. I'm a bit disappointed in myself for picking up this game; next time I'll do a bit more research before I shell out this much cash.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "It's a great game until you reach act2. \r\nIt's fetch quest after fetch quest.\r\ni really want to say go get this game but alas.. it is not enough.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Balance is all over the place, many quests just don´t work and it´s clear that this game needs to be at least patch 1.5 to be even close to finished.\n\nDon´t buy yet unless you want to pay for beta access",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's ok at best. So many things are never explained. The combat is not good: melee is practically impossible because even when parrying you take damage and there is no healing except for potions and you will not have enough of them to play melee. Maybe much later in the game it's viable when you manage to get life leech, but starting as a fighter is a big mistake.\nAlso you never know which enemies and quests are supposed to be for your level. In some caves enemies will one hit you, others are ok. Some quests are manageable, other again one hits...\nNo indicator whatsoever who you should attack and who not / what level/strength anything is. Spend most of my playtime running around and testing different areas to fight and not die instantly.\nAll items I find require about 3-4 times more stats to use than I have.\nReducing difficulty from 3/5 to 2/5 made combat ridiculously easy to the point where I don't even think about my skillset or armor any more.\nFinally I was again and again asked to make decisions whose side to take, who to kill or support, without any information. everyone just said \"the other one is the bad guy\". Maybe that is realistic, but in real life you might be able to gather more information, here you are not apparently, making it annoying to choose.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I can't really recommend this game. I had some fun there and here, but most of it was due to the jank, bonk with a club? the enemies fly 50 ft into the air. Launch a spell? The enemies fly 50 ft into the air. Shoot with a greatbow? You get it.\n\nThe world exploration is honestly boring, you find some location? Surprise, its the identical cave number 87, like seriously, 70% of locations in this game are caves.\n\nThe dialogue system is just bad, its just \"ask question\" and \"proceed with quest\", the dialogue animations are also exactly like Oblivion, yk, the game that is almost old enough to drink?\n\nThe quests are all fetch quests, that sometimes try TOO hard to be edgy, like that quest from alchemists that feature a young girl after the experiments that turned her into a tree. Is there a choice? Not really, you can ignore her and let her be a tree, or you can go to an opossite side of the map to kill a very easy boss to let her die, wow. Revolutional.\n\nThe main story is actually not bad, Has some choices, and actually enjoyable parts to uncover lore on.\n\nGameplay is not terrible but not good either, its more engaging than Skyrim atleast. Build variety is there, can't complain about that, the jank makes it more fun aswell.\n\nSome gamplay mechanics are just completely useless. What's the point of parrying when you can just bonk really hard? What's the point of king's soul when it takes ages to recharge? What's the point of alchemy when cooking exists? What's the point of spending money on houses when it offers absolutely no storage OR convinience? Whats the point of horses when you can run just as fast if you just level up atlethics?\nThe game is just not hard enough to engage with these mechanics, even on max difficulty.\n\nThe game failed to scratch my itch for both an RPG and a combat focused game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really enjoyed first part of the game - Horns of the South. I played on veteran difficulty, it was hard, but very enjoyable. I did all side quests and reached level 22. Then I entered Cunnacht and it's like I did everything before for nothing. Every bloody monster just one-shots me, my equipment provides zero protection, my weapons barely scratch enemies.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would give the game a neutral rating.\n\nPluses:\n\n+ for the developers’ effort and the heart they put into the game. For the wonderfully chosen music by the band Danheim, if I’m not mistaken.\n+ for the interesting dialogue branches and the liveliness of conversations.\n  In the modern industry, this game stands out positively for its ideological component.\n\nBut unfortunately, I couldn’t keep playing.\n\nEven on the highest settings, I couldn’t feel the liveliness of the world, the combat, or the interactions.\nDuring all 2 hours of playing in first-person view, I couldn’t shake the feeling that I wasn’t a character, but rather a flying video camera in a world made of papier-mâché.\nYes, the game has beautiful landscapes, especially when we enter the alternate reality, with nicely executed sky textures. But the world itself and moving through it don’t give the feeling of being in a living world.\n\nTwice I started a new game and tried to immerse myself in the world and gameplay, but unfortunately, I couldn’t find strong connection points with the game.\n\nAs a gamer with 30 years of experience who grew up on role-playing games, I can say that the game didn’t make me fall in love with it, even though I wanted to.\n\nI believe the game is let down by weak technical aspects, weak graphics, and poor physics.\nThis greatly hinders immersion.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really liked the demo of this game but I feel like I have just missed something. The difficulty curve hit me like a ton of bricks and I was truly enjoying the first area until the last boss. Alongside this, the game (as much as I really enjoyed the story so far) feels half cooked. It feels like a 360/PS3 era open world, with generic NPC characters that look similar and empty environments. I really enjoyed the dungeon areas and felt that this is where a lot of the design effort was placed, and unfortunately the demo is very much a dungeon area that was well worked on, whereas for the most part of the game play I experienced, you will be in the open world area. \r\n\r\nMaybe I am not the demographic for this game, and it sucks because I really enjoyed the previous Tainted Grail game, and hoped to experience more of the lore, but I have now uninstalled and don't intend to play it again.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fun game for as long as I was able to play it. Got about 7 hours in then was met with basically a game breaking bug. Could not walk at more than a snails pace. I went through every fix I could find online as apparently I'm not the only one to run into this. It's been a problem since the game came out with no attention paid by the devs. Feel free to take the gamble it won't happen to you, but for a \"finished\" game at $47 I'm pretty pissed off.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game. It's got great music, and I love the story. Voice acting is good as well in a lot of parts. Also the art design of everyone is really cool. I looked forward to thsi a lot since we got the taste of the world in Conquest, and it did not disappoint. \r\n\r\nBut the combat is not great. Act 1 does decently, but Act 2 and Act 3 both suffer majorly from damage sponges, which really drags the vibe down. \r\n\r\nAnd also the ending. It doesn't matter what you pick, the ending slides go on exactly the same. Nothing is resolved, nothing is mentioned one way or another. And that is what pushes it from slightly positive to slightly negative.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game is very OK, for the most part. Very Elder Scrolls inspired and similar gameplay, but tries to be darker and grittier. The reason I'm giving this a negative review is because, while the game doesn't do anything exceptionally, it does several things very poorly. The inventory management is rough, with no option to sell gear of a specific quality or lower, and the weight limits are pretty low for how much loot the game throws at you, leading to frequent vendor visits to spend 5 minutes each time going through and clicking each individual item you want to sell. The story is alright, nothing to write home about. Basically a bunch of thousand year old men pointing fingers at each other, each insisting that they're the one telling you the truth. The magic is very dull, basically boiling down to either an elemental projectile, melee aoe, or small projectile aoe. There are some more interesting spells with activation requirements, such as deal 1000 fire damage in order to charge a rain of fire, but they are generally ineffective and worthless.\r\n\r\nThe worst part, in my opinion, is the game tries to commit a little too hard to the \"RPG choices with consequences\" aspect, considering the choices that matter you have almost no way of knowing you are even making a choice until it's too late. Every undead attacks you on sight, so it makes sense when you walk into a dungeon and see an undead, you kill it, but don't kill that ONE or you brick a questline because oh he was friendly and you needed to talk to him to progress the quest. Accidentally click through dialogue a little too fast? Don't worry, since the way to progress dialogue is the same way you attack, you'll just kill the NPC when you finish talking to them and probably brick another quest. Oh you pet the sleeping croakmaw? well it bit off your left arm and now for the rest of the game you can't dual wield, use a shield, or use two-handed weapons. Better hope you notice it immediately, since the auto-saves in the game are extremely buggy.\r\n\r\nThis is actually what made me quit. My autosaves are autosave 1, 3, and 7, and that's it. It just keeps overwriting those 3. I had changed the frequency to once every minute because I had issues with previous encounters where I needed a recent save to reload, but for some reason the game hadn't autosaved in over 3 hours. So now if I don't notice I need to reload within 3 minutes, I'm completely screwed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is an average game at best. Hard to recomend it over Oblivion. It does not come close to Skyrim in any way. 2011 vanilla Skyrim is better. Instead of buying this boo boo game, heres what you do. If you own Skyrim play another playthrough with 1000 mods active. If you dont own Skyrim, wait for winter sale, buy for $9.99, install, download 1000 mods and have fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Absolutely baffled by \"Very Positive\": this is what happened to our expectations after years and years of game studios' abuse. The game is janky, unfinished and unbalanced starting right from the prologue. Melee combat is boring and unresponsive: rag-dolling enemies with 2H is fun, but it gets stale very quickly and there's zero depth to it both in terms of mechanics and skill progression. Spells are uninspired: there are handful of straight-up dmg spells with dot status-effects and they just get upgraded by the next-tier spells that function exactly the same, only with different animations and bigger numbers.  No build variety at all: you get your standard warrior-rogue-mage and that's pretty much it: any synergy for hybrid builds is almost non-existent. Comparison to Skyrim is valid, but IMO Skyrim is far from a perfect game itself plus it's almost 15 years old at this point. Final verdict: buy only if you're very desperate for that Skyrim feel and even then I'd wait for a discount.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Act 1 is interesting, Act 2  starts feeling like they lost the plot and just stated putting in fluff to keep content going, Act 3 is more of Act 2 style fluffing. If they compressed this game, it would probably be great. There are good moments in Act 2 and 3, but it just feels like a grind/running simulator.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Skyrim mod for 40$ 3/10. \n\nScore: 3/10 - Not Recommended\n\nThe game feels unfinished, technically unstable, and mechanically shallow.\n\nVisually, the game resembles RPGs from more than a decade ago. Textures are repetitive, geometry is simple, and lighting is inconsistent. The world is largely empty, with long stretches of terrain that contain little to no meaningful content. Exploration often feels like running through wide, unpopulated spaces.\n\nThe story lacks engagement and emotional weight. NPCs have no personality, no unique interactions, and no memorable traits. Dialogue is flat and functional at best. Characters feel static, with no sense of belonging to a living world.\n\nClass balance is poorly executed. On higher difficulty settings, the mage is practically the only viable class. Melee and hybrid builds fall off quickly. Stealth is completely dead in the water and non-viable\n\nPhysics create additional problems. Fire spells launch enemies into the air, sometimes 20-30 meters away. When a quest boss is involved, this leads to situations where the body lands in tall grass, behind terrain, or outside the immediate zone, forcing reloads because the required loot cannot be retrieved.\n\nCharacter progression is basic and lacks impactful choices. Loot is repetitive and unbalanced. \n\nCrafting and alchemy have almost no practical purpose. Potions offer minor benefits, and crafting materials accumulate without meaningful use. The in-game economy is fundamentally broken: items valued at 1000 coins sell for 50, and crafted items sell for similarly low amounts. After finally locating a crafting station and producing a full batch of armor pieces, the total profit barely reached 200 coins. \n\nAt some point I stopped selling anything whatsoever and just stored all the crap I've found it in my camp stash.\n\nThe game suffers from numerous bugs: enemies launching into the sky, clipping through terrain, getting stuck in geometry, losing aggro randomly, and breaking combat loops. Collision issues, disappearing bodies, and unstable physics further contribute to the impression of an unfinished build.\n\nConclusion\n\nThe game shows potential, but its current state is unbalanced, technically weak, and lacking depth across all major systems. I don't recommend it, even for discounted price.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I am tacitly not recommending because the game is a lot of fun, but is also equal parts frustrating and flawed. The final nail in the coffin was that I was about halfway through the game and my save became corrupted and unplayable. I have never had this issue with any game before and while i have not played the most games, I have played a fair few so this is an unacceptable issue for me. \n\nI would be willing to try a game from this developer in the future to see what they can do with a better budget and improvements because honestly, the game does hint at some good design and philosophy. I was so caught up with side quests that getting to the main quest later did feel natural and acceptable. I normally do not enjoy first person but this actually felt quite good to me for some reason, encouraging me to give it more of a shot in the future in other titles. \n\nThe game does feel janky, and IYKYK and so that is a problem, especially at 40 dollars. The lack of polish is totally fine, but the jank is unfortunate. Fighting a bear that glitched up into a tree is quite hilarious but also shouldnt happen. You can certainly get used to and accept the jank, but it also is unignorable that it is absolutely there, That aside the menus can be a bit unorganized and frustrating but are not absolute garbage. More or less anything bad about this game is acceptable on some level, but is more worth a $25 and under pricepoint, not $40. All that side, if not for the save corruption that completely blocked me from being able to play any furhter meaning I would have to start again, I would have recommended, but that is a show stopper for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don’t buy this game unless you want to stop progress due to bad game development. Because of their bounty system it happens that you cannot remove the bounty on you and progress with the game. Happens to a lot of people in different areas. BTW you get a bounty just by being close to a place and when you get it you cannot progress anymore on the same save. Checked on-line and had so many people with the same issues 4months ago and still not fixed.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I'd like to give it a neutral rating, because from my research into the game the devs certainly gave it depth and effort (aside from the balance, apparently), but since I have to choose...\n\nLook, it's certainly a \"scrolls-like\" right down to the jank and stiffness. Skyrim released in 2011 and that was fine then. Now it just feels bad. Attacks are clunky as hell and it's impossible to tell how much range you actually have with your weapons or spells, animations are floaty and lack the punch they so desperately try to portray. The story's presentation is awfully flat with the great King Arthur boring me to tears. I'm sure the game has its redeeming qualities (or maybe TES fans are just that badly whipped) but I felt absolutely no drive to continue past the intro. I'm sure it doesn't help that I'm rather ambivalent on Arthurian legend, but I was hoping the game would have SOME hook besides that.\n\nThe screenshots look pretty and the rapid cutaways of the trailer do too, but once you sit down and get to see it unfold in motion, it just feels unfinished, like they missed the last 10% of development involving just polishing and making the game feel good to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's janky and runs terribly. However, beneath it all there is a decent game and while I don't recommend this one, I would keep an eye out for future entries.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game continues to fall off the more you play it. Quests are awful. Hard to get invested in any character. Magic is outlawed canonically, while everyone, everywhere uses magic. Combat is weak. In game economy is broken. Most leveling occurs incidentally. The maps arent clever, and finding items is arbitrary. other dead characters died where they did so that the fact that their left-behind item has a \"reason\" to be somewhere it shouldnt. none of npcs have any real character to them. bodies, and their items, fly all over the screen for no reason and often become unretrievable or now take backtracking to go get. its ok. its temu oblivion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While the game is certainly playable, the performance is quite poor, especially for the visuals. It feels way more intensive than it should be. Beyond that I'm just not a fan of the combat. The skeleton of a good game is certainly present here, but it's marred by unreliable movement, bugs, and various other technical issues. I can imagine some people still really liking what's here in spite of all the issues, but I bounced off Tainted Grail hard.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game runs pretty poorly, poorly optimized. Mid tier content combat wise in my opinion as well. It is a game I want to like, but it just does not deliver.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish i could give this game a positive review, and there are many many things to like about it. I started playing it and thought i wouldnt stop until i finished it, however at the end of the first act there is an immesion breaking oversight that ruined it for me.\n\n\n!!!SPOILERS AHEAD!!!\n\nAt the end of the first act you get to chose if you wanna side with Camelot or the Rebels, the game kinda leads you to side with the rebels, so i did, after killing the camelot force that has come to kill the rebels you are told to head to a cave to get a big lore reveal, the lore reveal apprently paints Camelot in the bad light, except it doesnt, they were losing a war and resorted to unethical experiments and lo and behold they won because of them, once thats done one of the main rebels comes to try and make you to do his bidding, at this point i was kinda sick of the rebels and i wanted to side with Camelot, reloaded a save killed the rebels and if you do that you dont get the cave info. Once thats finished you get to awaken another part of Arthur and when that happens you get a cutscene and multiple conversations that make zero sense unless you know the cave lore, you get dialog as if you saw what was in the cave, except you didnt, its like they forgot to add the cutsene for ONE OF THE TWO PLAYABLE PATHS??????!\n\nThis ruinied it for me, since in my personal opinion if there is this big of a fuck up in ACT 1, what can i expect in the other acts, i lost all interest and if i could i would refund the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is a stuttery mess. Basically unplayable, crashes frequently. I tried to refund but steam won't let me. Dark Arthurian Fantasy Scrolls-like sounds awesome on paper, but the game runs so poorly that I haven't been able to enjoy it at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great potential, but buggy and incomplete. The devs have not fixed the performance issues that have plagued the game since day 1. It's been two months since the last update and I'm tired of waiting for this game to be playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the game but every time I try to continue a saved game, the game tells me all the saved game slots are corrupt. Reinstalling the game fixes this issue but, for obvious reasons, I'm not planning to reinstall the game every time I want to play. If there is a fix for this issue - I'd give this game an enthusiastic thumbs up!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How is this game out of beta when you cannot complete a a main quest? Also has constant micro stutters every few seconds no matter the graphics setting even though have current gpu. In it's current state I cannot recommend this game as you will reach a point and wont be able to progress to finish the game and that is if you dont mind the constant stutters/frame skipping.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't know what it is. this game has everything that should have made me love it but I hate everything about it, not for me I guess, just feels bad I played more than two hours now can't even refund it oh well sucks to suck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Starts off strong, only to quickly show its cracks after the initial area: irrelevant choice making, inconsistent voice acting (voice actors unintentionally pronouncing the same word differently in the same dialogue, actors restarting their sentences after a mistake); a very narrow set of viable builds, due to how certain weapons and stats work; awful hitboxes that aren't properly represented by their triggers' corresponding VFXs; an easily broken economy. All in all, it loses its steam around 4-6 hours into the game and it never recovers.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I want to recommend this game, but I encountered a massive game breaking bug which prevented main quest progression.\r\n\r\nBug details: A key NPC would not show up at a specific spot at night. Others had this issue, I had tried their solutions (fast travelling between areas, exhausting all dialogue with other NPCs). Nothing Worked. I had to install a mod that enables console commands to fix it. It took hours to fix it. I even spawned the NPC at the location and it still didnt work. I ultimately had to force objectives to complete (and deactivate a optional objective). Then force the next quest to start, and now everything seems fine except that bugged quest remains in my quest log (with no objectives).\r\n\r\nOther than that, the game is fantastic. Graphically it may not have high-poly models or 4k textures, but it has a strong art design. I really like some of the armour sets you can get and the design of the Kamalot army (think Late Western Roman armor mixed with some medieval armour).\r\n\r\nCombat is like skyrim but with the dodging, parrying, and precision mods baked in.\r\n\r\nQuesting is solid. A lot of quests have multiple outcomes. You'll have to explore and talk to NPCs to uncover them. Really only the main quest is spoon fed to you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to like this game everything felt really fleshed out in the demo which btw is about 1.5 to 2 hours long. so, if you buy the game and are like \"man i really want to do that demo part again\" i would say don't. as soon as you are out of the demo area this game falls apart HARD. stealth is worthless in this game you cannot sneak effectively unless you wear almost zero armor and i got to the point where my stealth skill was maxed. archery in this game i don't think could be worse like if they get hit it's cool then once they know you are shooting it's dodge dodge dodge dodge parry (THE ARROW). the hit boxes are there sometimes? also, what is up with the fog? like if you can't get the technical stuff right just make the game look worse instead of being like \"man i think people would only like to see 50ft\". voice acting sucks, premise is silly, camelot whatever is like you had an opportunity and said \"nah we're good.\" idk it reminded me of atomfall in almost every terrible way.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played this game when it first came out and spent about 50 hours in it, came to the later parts of Act 2. By then I had experienced two hardlocks in two different side quests which did put me off of the game. Then I actually experienced smt similar in the main questline and since it is not a mainstream AAA game, there are so few guidelines etc. as to how to solve those issues. I shelved it for the time being. Then they announced the mighty big patch right? Game got much better right?!? NO! It literally falls to 20ish fps whenever I try to aim with a bow, hitboxes get bugged mid combat as my sword just goes through enemies and when I dash back, my character actually dashes forward. Before you say maybe your gamepad is old, this is the only game where it happens. I literally just finished Dark Souls 1 and God of War with the same gamepad. I am sorry but maybe bringing goofy stuff like flying pets and some other things were not supposed to be the priority of the game right now? I am really sad about the state of the game really. I'd say I hope they solve these issues but smt tells me they never will. As far as I can say, this game had it's brief popularity as the \"New Oblivion\" and now its abandoned and forgotten. I guess you could try it at a sale but not on a full price.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Performance took a hit once you get into the open world and combat doesn't feel great (played magic).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is divided up into 3 regions. After completing all the quests in the first region, there came a point where I had to deal with this group that were defending a temple. Apparently it's the ONLY way to progress on to the second region. The group was arroagent, rude, unlikable  and, apparently, unkillable! The game forces you to deal with this quest in a very specific way. You are not allowed to deviate from the story at all. You are completely railroaded. And I just didn't want to deal with this group at all. They were so incredibly unlikable, I just wanted to kill them all, but as I mentioned, they are \"protected by plot\" and unkillable. Fuck this game. I refuse to be railroaded to such a degree. I want an OPEN WORLD where I can go where I want and do what I want. No, this game wants you to play it's very specific storyline in a very specific way and robs the player of all agency. Life is too short to waste on a game like this. I'm off to find a better game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "such a cool game, I wanna get into it but the games so unoptimized and it looks like a smeared painting.\r\n\r\nKinda garbo. Wish I could get my 50$ back...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have really tried liking this game. The world is pretty interesting but that's about it. The combat is ok but the rest is not great. Constant stutters and low performance on a very strong rig. Characters are hideous and the game itself is just a bit boring. Wait for a crazy discount.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a very good example of a game that didn't do anything terrible, but didn't do anything impressive either. Combat is solid, but not ground breaking. Plot and voice acting are okay, but never amazing.\r\n\r\nI get that it's supposed to be a world in decay, but it feels empty and the map feels like a checklist instead of something interesting to visit. I haven't seen a PoI that made me think \"that looks cool, I want to visit it\", more drawn to them because there isn't anything interesting in between PoIs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "in its current state I cannot recommend. I can turn all of my settings all the way down to low and there is zero fps improvement. Not even 1 frame. At least add frame generation if you don't want to optimize the game. The game itself is great. But I cannot look past how bad the performance is. Can't even get above 100 fps and I'm using a 5070 for crying out loud. Fix your game!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is no bad but have too many problems and other thing is is not a Skyrim style sorry but not this game is not close to skyrim. this game too many problems and zero mods that make the game better. Skyrim SE now for me with the mods it looks better, run better, have better animation combat and magic animations better fights and better boss fight. this game only runs att 120fp for me inside places caves, house etc... but outside drop hard to 60fps not even other open world from Unreal Engine drop that low for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Left mouse button uses right hand in the game. Right mouse button uses left. Refuses to change it. \n\nNot recommended. Legit annoying beyond fuck. Can't even mod it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game felt kinda clunky. I don't know how to put it by it feels unpolished every step of the way. For example,  I haven't used the time slow ability in the first boss fight and the tip on the right of the screen didn't go away. That's just one small thing, but there's lots of them.\n\nI also don't enjoy the grimdark-weird style, so maybe the game just isn't for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bruh. Game plays like a Skyrim ripoff and story goes off the rails real quick; seems like a mistranslated shitass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its kind of clunky and some bugs are terrible maybe game ending?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "An attempted improvement over games like Skyrim? But somehow managed to have more glitches than Bethesda even, its almost impressive the complete lack of bothering to make hitboxed consistent or even possible to hit enemies from afar with the bow. By ~20 hours in I still hadn't shot any person, bear, wolf, deer or otherwise from far enough away to need to aim the bow above them to account for gravity, not for lack of trying. It seems like once the arrow leaves the 10 feet around your character it no longer exists and instead just alerts them to your presence and wastes the arrow. Good effort, poor execution.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wasn't enough for me to be sold. Game is fine and worth it but not if you play a lot of these games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of those games that needs a neutral score. 5/10 \nSkyrim from Temu. The only thing that comes to mind to summarize this game. It would've been fine if core elements were polished.\nMelee- junky \nBows- awful and weird\nMagic- okay?...\n3rd person- dont even ask about it\nSoundtrack- some old dude moaning...\nWorld build like a thrown glued together assets. Turn around the corner and you see how bad it is.\nVisuals are only good in basically 2-3 corridors and rooms that are shown in the trailer.\n\nThe only polished thing is UI. A real shame that we are getting this weak of an rpg 14y after Skyrim release.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks, don't let these nostalgia baiters tell you different in the reviews. This is one of the worst games I've ever played. It looks and feels unfinished. The HUD and font choice is just laughably bad. Skyrim blows this game out of the water in every aspect. That's why you're here right? The Skyrim comparisons? Just go replay Skyrim. You can't even mod this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There is no option for change or invert mouse buttons.\r\nUnacceptable for a 2025 game in my opinion.\r\nI cannot play it, I ask for refound",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "biggest POS skyrim wanna be i have ever seen. it takes everything great with these kinda games and shits all over it. its mediocre. possibly an asset flip im not 100% sure but the core gameplay is trash and a waist of time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I made a toon.... did the tutorial (*almost 2 hours - no more refund*), traveled and picked up a dozen quests..... NOW no clue where to go,  what to do, and how to do it. Quests not showing up on the compass, or the map... what a waste of $40.00. Do not recommend!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Melee is suffering. I made it to the second area and it's just as bad. Really feels like dev preferred ranged combat- because it seems like all forms of ranged combat do way more damage than melee and are way more survivable. I am continually questioning \"am I supposed to be like 20 levels higher here?\" because it takes like 10-30 hits to down basic enemies, and they kill me in like 2-4 and I'm heavily invested into strength and endurance and armor, and am wearing the absolute best armor rating I've found, probably some stuff I wasn't even supposed to get since I wiped out the Del Riata. Also group combat is very common - and although parrying and blocking interact with multiple enemies at a time, melee attacks, at least 1-h, do not... going pure melee really sucks unless I'm missing something - I would love to know in the comments what I'm missing here.\n\n-traveling and environment-\nI'm getting really sick of tromping back and forth over the same areas. You can't fast travel to every poi on the map, only to certain ones - so that's getting pretty old walking through the same static area for the hundredth time. So many areas are designed in a way that makes them very tedious to traverse, especially ones where you can't pull up a map. I wish you could just climb... I've experienced a lot of \"Wow, that looks like something I could explore over there, I wonder if it's worth it...oh, a chest with an onion and 2 coins.\"\n\n-bosses-\nJust huge bags of hitpoints that do huge damage with the tiny attack variety they have. No phases. Nothing interesting.\n\n-story-\n[Subjective warning] The first 2 main areas were weird and interesting. By the time I got to the swamps I'm kinda sick and disinterested in quest abd123 \"I know you just want to do simple thing but i can't because someplace is spooky and i need you to go there and spooky out the spooky then come back and I'll give you another chore to do\". The characters don't really have any personality. None of this feels meaningful or changes anything. I really stopped caring anymore about what's going on and am speed clicking through pointless dialog. I don't want to refund, but man, I can't say it's good but at least the dev tried to do something different and it does count for something in my book.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}