{
  "positive": [
    {
      "review": "Highly recommend, great game, very deep and engaging. Lots of strategy involved, great civilisation variety, prolific playerbase. Lots of different ways to play, in classic 1v1 ranked, various multiplayer formats (including 8-player free-for-all), really nice campaigns and challenging scenarios vs AI. I've played 2k hours and not going to stop!",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Add Persian empire DLC , so many Persian are playing this game ( Sfavid Dynasty)",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "As a former StarCraft 2 player, this game is so much fun. Much more relaxing to play casually and exciting to play competitively, but from all the things that stand out the most to me for what makes this game so great is its immersion, which is not something you expect out of an RTS. Not only are the graphics nice, but I absolutely love all of the decorative elements that generate (ie. small yards next to houses) that make the landscape constantly dynamic and interesting. From an immersion perspective, however, the decorative details pale in comparison to the expertly crafted audio experience. This game truly defines its own category of a S+ tier audio design. The background music for each civ, the gibberish units speak with accents based on civ(never gets old), the battle crys, the elephants and cannons, and the little cowbell sound when your scout finds a sheep. This game puts you in a different world and keeps you there.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I don’t play multiplayer at all, so the campaign is everything for me, and honestly, it’s more than enough. It feels like taking a history class, but in the most enjoyable and engaging way possible. The missions are fun, the storytelling is great, and the extra documentary-style videos are a fantastic touch that make the whole experience even richer. For someone who just wants a strong single-player journey, this delivers exactly what I hoped for.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Looks and feels really good. Yet to understand all the game mechanics",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great RTS, probably the most polished release since Starcraft 2.\n\nIt's essentially Age of Empires 2 but better. Civs are no longer carbon copies of each other and have unique elements to their playstyles (unlike Age 2 where every Civ was more or less the same with some units replaced with a unique unit). Generic unit models and buildings are also unique for civs which adds so much to the flavor of the game. For example, the generic archer has a unique model across the Mongols, Chinese, French, Abassid, Delhi, etc. You also no longer have the problem of, say, Chinese or Japanese sharing an \"Asian\" structure tileset (always bothered me how the Koreans in Age 2 had very Chinese looking buildings).\n\nAlthough sometimes it is difficult to tell units apart in an army composition. For the most part units tend to look pretty similar to one another so I'm having to rely on the group selection icons at the bottom to isolate unit types.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Um dos melhores jogos de estratégia, sem falar que é um clássico. Não precisa dizer mais nada.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The campaigns are fun, the civs feel distinct, and the pacing hits that sweet spot between chill and intense. Not perfect AI can be wonky and multiplayer matchmaking could use work",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AoE 4 is the best edition of Age of Empires. The only missing part is auto-scout for my scouts but I still love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly an amazing game. It really captures that classic AoE feeling while still adding fresh mechanics that make every match feel exciting. The campaigns are fun and well made, and each civilization has it\"s own style that actually matters in gameplay. The visuals are clean, the soundtracks are great, and big battles look awesome.\nIf you love strategy games, building up an empire from nothing, and watching huge armies clash, this one is totally worth playing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "My regret in buying this game is not buying it along with the DLC.. believe me when you have never played age of empires before, you will be addicted to this one game. even without DLC, it is certain that you will get more than 500 hours in your hands, you don't have to be afraid that this game will make your head dizzy, because the tutorial in this game will be conveyed unconsciously when you play campaign mode",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun RTS, not too difficult to pick up, good amount of players",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "on xbox live I have 4,000 hours on this game since release.. I took a year break then bought the game again on steam.. now after a couple weeks I have 200 hours on steam.. I can't escape this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An utter blast from the past, offering a high quality game that is sure to delight and remind you of the old days. The game offers a good zoom for your little screen people and plenty of mods which fix devs issue on the 200 max cap or lack of enough resources for my 4-6 hour sessions. My only complaint is how they force the expansions in your game for you to scroll over while taking up storage, but not actually allowing you to use until purchased. I only have the base game, but HAVE to see what I do not own. This alone ensures I NEVER buy the addons and eventually will uninstall due to space/annoyance. Besides this, the actual game is pretty fun. Wish they had a \"follow\" option for units like they used to, but we all know games are only getting crappier. Iv'e put tons of time in this game, and do not regret buying the base. I just like it less and less with each \"expansion\" they force.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, many variabilities. Minor camera issues that will be probably solved in future like too close zoom on mountains in some maps. But, overall, 4/5 stars game. Not affraid to recommend .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RTS games are difficult especially when you have never spent much time playing them like myself. It requires a lot of time, but it's satisfying to defeat an enemy after learning how to manage an economy and train military to conquer the battlefield. Age of Empires was attractive with its accuracy of history, story telling, and military units looked like loads of fun to learn. It's been a blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game I like how different nations, have not only special units, but you manage to capture and show their strengths back in history, like Mongols for example their nomadic nature, how religions and importance of them is also introduce in the game, and the game is also not very easy you can very well challenge yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game in my childhood and it still feels amazing. If you enjoy strategy and co-op with friends, this is definitely the game I’d recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love at first sight. it's beautiful, the mechanics are easy enough to learn, you can have hundreds of troops, and it has real educational value. after you finish a level you can watch a short documentary, and the historical battles and campaigns are really neat. it also has singleplayer, and normal and ranked multiplayer. I 100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the biggest minus of this whole game is that it constantly crashes (closes). how annoying it is! WHY, after such a long period of time, couldn't the servers be properly configured so that it doesn't crash? The worst part is that it only crashes during the most successful matches. When I'm doing well and have a good development, I immediately encounter errors and the game closes. This doesn't happen during poor matches... It's as if it was intentionally designed! and nowhere, absolutely nowhere, is there an exact answer as to why the game crashes and how to fix it. I've tried all the advice on the internet... it doesn't matter, even if I delete the game...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At a time when strategy games are thin on the ground this updated title is really good and well worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable for the most part, and very well made, for the most part. Reason I say this is because any progress being subject to online verification means campaign progress can be lost just because no reason, if your network disconnects during a single player skirmish it's wasted time and effort because no progress, as if it should matter for single player. I've had to replay half the Norman campaign already just because whatever reason. All in all, worst network integration I've ever seen in a game, absolutely loathsome even. Definitely not a feature. Other than that, very enjoyable and very well made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As far as new RTS games, this stands at the top gameplay wise, nicely polished, often updated with new empires and just fun all around. Historical campaigns are actually amazing, please do try them out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good RTS game. No need for overcomplicated description.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good fun. Easy to pick up, and hard to master. Would recommend the DLC for crucible if you like single player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This feels like classic age of empires but with all the extras that you want. Troops on wall, factions play fundamentally different from each other. I absolutely love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My absolute favourite RTS set in the medieval/pre modern era. I can't find anything to fault about  it, the continued development and expansions have improved on the one thing I initially thought was lacking, which was faction choice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although still overshadowed by Age of Empires II (AoE2), AoE4 tries to blend the best of its two predecessors (AoE2, AoE3 and AoM) by balancing between having unique civilizations and common units/tactics. This makes for good civilization replayability, especially if you pruchase the expansions.\r\n\r\nThe expansions demonstrate the developer's desire to keep building on this base with new civilizations and campaigns, with the latest ones favouring civilization over campaign content. Some players may dislike this, although the variant civilizations increase replayability.\r\n\r\nAll-in-all a fun and worthwhile experience, if still eclipsed by AoE2 (as all Age of Empires games are to certain extent).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tiene lo mejor del 2 y lo mejor del 3, hasta ahora esta muy entretenido, me alegro de haberle dado una oportunidad, lo recomiendo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AOE4 is actually a really good game for RTS newcomers. It has a QOL addition that shows idle villagers on UI. And this small addition makes all the difference. I tried playing AOE2 and I found the lack of this information on UI stressful :D\r\n\r\nThe campaigns are nice. Historical details and accuracy are interesting. Although they are not very immersive since there are huge time skips.\r\n\r\nOverall AOE4 is probably the best RTS for newcomers. It hooked me unlike other AOE versions. Though I can see myself playing AOE2 later, after getting better in AOE4 :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loving the game. It was gifted to me a couple months ago from a good friend and I am already platinum pushing diamond. You just have to keep at it and watch some the info on youtube of gameplay and build orders. Good luck everyone. Check out my AOE4 world. Im moving up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very historic indeed, though I can't verify the information they have provided, but it appears to be accurate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best RTS ever designed. It is slower and more complex than Starcraft. You will have to manage 4 major resources instead of 2. You will progress through 4 tech tiers instead of 3. There are 22 factions instead of 3, with some similarities between them.\nMy favorite part is the procedural map generation. The mapping system for this game is incredibly varied and dynamic. Each map style provides a very different type of metagame.\nGood defensive options for turtling up if you like that style. Siege is an important strategic layer in Age of Empires.\nStarcraft gives a faster tighter game while Age of Empires gives a slower more complex game. All RTS fans should experience both.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do recommend this overall, but please devs, for the love of the gods, allow multiplayer games to save so random checksum errors don't blow up an entire multiplayer  game with friends.  That's the biggest reason I stopped playing so much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The single player content is very good. I didn't delve too deeply into the multiplayer though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. Integrates fantastic historic scenarios from the Mongols, The Rus, The Normans, and the French. Flawless integration of cut scene historic animations and gameplay. I played the tutorial and got a bit discouraged. After 2 maps I was hooked.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very interesting and beautiful RTS based roughly in the Middle Ages. I like its reference to actual history, great civilisation, as well as the challenging gameplay. It's not an easy game, but it's fun to play and master.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak game 10/10. its basically clash of clans on crack imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Age of Empires series have been the games of my life, having played them constantly troughout the years. AOE 4 is truly a very entertaining game which sometimes makes me feel like i am 5 yo again playing AOE 2 on my brothers computer waiting for him to wake up from sleep so he can write me the cheat codes for resources.\nI would love to see more and more civs added to the game, even tough the new DLC got released as i feel new civs and new stuff always keep the game fresh and make you constantly have to adapt to new playstyles and mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing RTS. Having played since SC and Red alert 2, this game scratches that classic itch with its campaign and crucible modes. Multiplayer is a blast with friends, or solo as the game usually gets balanced to a pretty good spot. The graphics and sound are super immersive, overall absolutely a must buy if you are an RTS player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have carpal tunnel but I still play this game at like 200apm so I can imagine that I'm beasty (im bronze)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Age of Empires is still one of the most rewarding RTS games due to the detailed civilization structures and diverse strategies players can craft based on which civilizations they choose to master.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best of all Age of Empires games - has vibes of all of them with great graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The campaign is super interesting, fun to play, educative, and practice you well for the game, which isn't that easy to be good at",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good ol' age of empires 2 but better. \r\nIn my opinion better direction then aoe3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game kingdom, best visual, graphics, histoty. I liked it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first saw AoE 4, I thought I wouldn't really enjoy this, as a die-hard fan of the second game. But a huge surprise, the campaigns are very fun and varied, a great interpretation of real history. Compared to AoE 2, it's not a dull grind on higher difficulties, where you have to absurdly spam units or the computer overwhelms you. If you like intelligent games, with very nice gameplay, where your head doesn't explode from absurd micromanagement, then this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um dos meus RTS favoritos com toda certeza. No lançado, o jogo era bem desbalanceado e tinha uns bugs e exploits irritantes que me deixavam com raiva, mas depois de algumas atualizações o jogo ficou muito mais jogável. Da forma como as coisas encaminham, acredito que o jogo só irá melhorar. No momento que estou fazendo está avaliação, o jogo está um ótimo preço em promoção. Então, nem precisa pensar muito antes de comprar. Só verifica se a tua máquina atende aos requisitos para rodar e mete bala.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad game once you get past all of the commentary. And you figure out how to shut off the annoying UI voice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing RTS that has many different play styles and a great strategy game with friends. 9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems really fun, like a cross between mini documentaries, clash of clans, and some RTS games I've played. If you like history I think you'll love the campaign in this game, though you'll definitely enjoy it either way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Technically my first AOE. I played little bit of AOE2 when I was young but memory is fuzzy. Great game that keeps you on your toes. Really need to allocate 100% of your focus so you don't drop your APM.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its hard to tell if the gameplay surpassed the legendary GOTE2.\nIts a pleasant game however and there are frequent updates.\nThe graphic is good and there are good mechanics.\nUnfortunately saves are continuously broken by updates as if it is normal while it is not.\nYou have to redo the champaign every now and then since for some reasons they just erase your progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Multiplayer game to play with friends and Strangers also.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, if you're looking for a strategy game, it's one of the best. While many say it's a drop compared to the older versions, I think it's made good progress in terms of gameplay and graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game with quality graphics, the only downside being the broken new dlcs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "General aesthetic is very satisfying even upon starting the game. For the lack of specifics, all the available content is overall great. Some maps are weird to play on but still fun. It all depends on group numbers really. I'm no good on my own but I play well with a group of 3 others and we all have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Love AoE franchise and this is a great addition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing the Age of Empires series since I was a kid, I love this game, 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best and simple ,\"have fun\", strategy game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As Aoe Franchise Fan and Player its not bad at all \nmore realistic than AOE 3 but still has some problem i dont know why really but When i play AOE 3 and AOE 2 its feel more competitive and harder than AOE4 i guess Probably its because the game almost not getting many new player \n\nanyway its good game and worth to try it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seriously, if you're looking for an amazing RTS, stop scrolling and buy Age of Empires IV. This game is just straight-up fun and an incredible modern take on the classic formula.\r\n\r\nThe multiplayer is absolutely fantastic! It's super addictive. Each civilization feels genuinely unique (way beyond just swapping unit skins), which keeps the online ladder constantly fresh and exciting. The rush of evolving your economy, raising an army, and outsmarting your opponent feels better than ever.\r\n\r\nThis is the game that finally scratches that competitive RTS itch I've had since the good old Warcraft III and StarCraft II days. It brings that deep strategy and high-stakes competitive atmosphere, but with the awesome historical flavor and civ variety that AoE is known for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love history, aoe4 takes a new approach to games, especially with educating you while playing campaigns. Balancing is still a bit of an issue for online play, but overall enjoyable experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game throws me back to when I used to play Age of Empires 2 as a kid. Each civilization brings a great amount of variety to the game play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As good as you can expect, fantastic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game to play with friends. Easy to play with a wine, both casually or intensely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite RTS game series just got better! But be aware that when playing this type of game, time flies very fast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The classic Age of Empires experience. \r\n\r\nI find myself coming back to it again and again from time to time, its civilizations and armies are diverse, and its world and maps design are beautiful. Never gets boring to me. \r\n\r\nOverall: Amazing. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It took a few years to flesh out but right now this is one of the most enjoyable modern RTS games out there. If you are a fan of AoE 2 or Starcraft 2 then you will most likely enjoy this. The graphics are decent, sound design is great and the battles are quite immersive. Game mechanics are improved to modern standards - very SC2 like. Single player campaigns are really well done. Shame there arent more of them. Unlike AoE2 the civs look very different from each other so this time the differences arent just in their stats but they are very distinct visually too.\r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best RTS games out right now, but they nerfed the best civ.\n\nGoodbye Lan Cancer ;(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game that a lot of strategy and is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it on Gamepass before for hundreds of hours; it's a good game. Very good in fact. DLC is just... so barren compared to previous AoE titles... especially in SP content. Really my only negative.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overthinker and in the zone stoned.. perfect game .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having played AOE from day 1 release many years back it continues to push the boundaries of AOE fun! \nHighly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game has a lot of depth, as such it is hard for me to give an accurate review on my current playtime. \r\nthat aside the game has many stand-out qualities that make me want to leave a positive review.\r\n- genuine care into the polish and historical aspects of the game\r\n- the performance is quite stable and the system requirements are reasonable. however i experienced stuttering occasionally, especially when queuing up multiple movement commands\r\n- the gameplay follows the classic formula that is complex enough to provide a fun challenge but not so complex that it becomes tiring. it is easy to learn but hard to master, meaning it provides many hours of replayability",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Clean interface with easy multiplayer setup.\r\nGreat improvement on a classic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play French, make Knights, use them to run down villagers all game.\r\n\r\nHistorically accurate and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite RTS games to date. I've never had performance issues or really any technical problems. The variety of civs really makes for a lot of replayability and diversity in play styles. An instant classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Campaigns. Different playstyles for each civilization makes the game highly replayable and addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PVP is really hard but the campaign is amazing. I really like the cinematics. They've done an amazing job",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Compared to the previous versions of this game its beautiful and plays smoothly, with the following key differences:\n\nBad: unit control is reduced, no guard or follow. Fewer formations.\n\nGood: Beautiful. Has multiplayer vs AI which is amazing! Buildings no longer fully block paths (no house walls)\n\nEverything else is your standard AOE stuff, if you like the franchise, you'll like this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "La vida de un crítico es sencilla en muchos aspectos. Arriesgamos poco y tenemos poder sobre aquellos que ofrecen su trabajo y su servicio a nuestro juicio. Prosperamos con las críticas negativas, divertidas de escribir y de leer. Pero la triste verdad que debemos afrontar es que en el gran orden de las cosas, cualquier basura tiene más significado que lo que deja ver nuestra crítica.\nPero en ocasiones el crítico sí se arriesga cada vez que descubre y defiende algo nuevo. El mundo suele ser cruel con el nuevo talento. Las nuevas creaciones, lo nuevo, necesita amigos. Anoche experimente algo nuevo, un extraordinario juego de una fuente singular e inesperada. Decir solo que las civilizaciones y las mecánicas han desafiado mis prejuicios sobre lo que es un buen juego, subestima la realidad. Me han tocado en lo más profundo.\n\nPronto jugaré Age Of Mythology, Hambriento",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool game. I'm coming from StarCraft 2 and I really enjoy campaign and challenges. Hotkeys are super cool as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game. If you enjoy RTSs and historical games, you'll probably going to like this one too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game keeps adding more and more CIVS and improvements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game clears StarCraft 2 when it comes to multiplayer teamplay. It's not even close with how much more intricacies there are in this game. Even though I have 1500 hours in the game, I still feel like most matches are unique to this day. And with how many lessons the matches teach you, it doesn't get stale easily.\r\n\r\nIf you are looking for a singleplayer experience though, with a good campaign and all that, then SC2 is still the winner to this day imo. The campaign of this game is not even worth trying in my opinion.\r\n\r\nBut if you're in the needs of an RTS to play with the boys, then this is probably the best you are gonna get in this genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tbh, i recommend this game, it has great graphics and gameplay is smooth and ofc the story mode, i like it. It's very cool game overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say? If you love old Age Of Empires, you will love this, takes some time to understand how everything works, but its amazing game! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good but you can't reconnect under any circumstances, and its really bad if your internet goes down for a second, specially when you're at the peak of the game's epic moment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a combination of Age of Empires 2 and Age of Empires 3.\nThey NAILED the sounds effects and how every civilization talks. \n\nOverall gameplay is pretty good.\nUnbalanced ? Yes.\nSound design, top-notch. \n\nCampaign overall is pretty good, cinematic and overall campaign design feels unique and not boring. \nI do not care about the history it tells though, because Microsoft often makes mistakes.\nIf you're a fan of AoE2 ? Buy it.\nIf you're a fan of AoE3 ? Buy it.\n\nAlso, whoever designed the music for British civ deserves a raise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite fun.  Not the same game play as Age of Empires II, but definitely close.  Each faction feels more specialized than in AoE II.  I'd definitely recommend it as a solid and engaging RTS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing. As now, the state of the game is superb. One of the best AOE ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best RTS since Starcraft 2 and best RTS on the market right now. The base game, and all DLC, are a no brainer for any RTS fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice strategy game, friendlier for beginners in the pvp section than other RTS, but still nonetheless an RTS that requires skill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyed the documentary style campaign and the experience from the series comes together to make great gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like all the variations of the game. It will take a long time to run through all of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! I love the graphics, gameplay, and community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with constant updates. I used to play a lot of AOE 2 and 3 when I was a child, and AOE4, in my opinion, is a great improvement if you take away the nostalgia factor. Overall, it’s a great series — a must-play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy addictive game. Got me back into online multiplayer, incredibly fun to play solo or with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "excellent nostalgitc rts that reminds me of my early childhood only 150 or so years ago\nthe great world war has begun again",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Have to withdraw my recommendation for the game, since the latest DLC introduced severe crashing issues for a broad suite of players on different hardware and Windows versions. Avoid for the time being. Devs are unresponsive to the issues, so check in Discussions or the AOE4 reddit to see if the issues have been corrected before buying. Suggest coming back after New Year's.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "I have been playing this game for 3+ years and it has been great until now.\n\nUnfortunately the game now feels abandoned. They have just released the most UNBALANCED DLC ever, introducing a sub-civ Golden Horde which completely breaks the game. It is so extremely broken that everyone now abuse it. Last DLC they did that at least they fixed it the same week. But this time, they have just left it like that, running on its 3rd week. The game is left in a HORRIBLE state. Unplayable.\n\nHence, due to this, I can no longer recommend this game even though I used to love it. \n\nDO NOT BUY. I will uninstall soon.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I will delete/update this review after the following is \"fixed\":\n\nIn my over 600 hours in this game I mostly played nomad ffa. First in custom lobbies and later on as quick matches once they added this mode officially.\n\nI really like the chaos and unforgiving nature of megarandom maps. No two matches are the same. Sometimes you have a godlike spawn and roll over the lobby, sometimes you have to make the best out of some wasteland around you and get rolled over. Or you improvise good and convert a bad start into a great victory. Sometimes you spawn all alone and sometimes you find yourself in between five other players. It was and still is highly addicting. The opposite of SBMM if you will. Sure some megarandom map spawns are utter garbage, but that is very rare and the need to make the best out of the situation a new match throws you in made me a better player overall.\n\n\nSince the last big update I mostly quit playing all together as they added two new maps to the nomad map pool that are pre made. It takes away most of the randomness. I know where ressources are, I know where enemies will probably build and also I know which civs will perform good or bad on those maps. Gone are the days of chaos, improvisation and triumphant victory.\n\nAs this mode is my overall aoe4 experience and they took it away I personally can't recommend this game right now if you are any like me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The latest DLC was undercooked and has tons of Issues affecting multiplayer. There are game breaking bugs and incredibly poor balance with the new DLC CIVS and the old existing CIVS.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game constantly lags and freezes(AMD 9800X3D, Nvidia 4080 with latest drivers), impossible to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was in a pretty good state before the Dynasties of the East DLC, but got completely ruined by bugs and severe balance issues in the DLC. 3 weeks after the DLC release, team games are pretty much unplayable because of all the bug abuse going on, still no patch or even a word of a patch. Such a shame.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I miss the character-driven stories from AoE II and III, I find very little engagement with a narrator talking over the gameplay in the past tense.\r\n\r\nIt's also ridiculous that there's no longer a tactical pause option. I don't want to feel rushed and pressured when multiple things are going on at once, if I wanted to feel rushed and pressured I'd go to work rather than playing video games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not good, not optimized, unintuitive UI, popups, modern BS\r\n\r\nI'd rather play II or even III, but they deprecated the versions I bought on Steam already - versions I was already buying for the second time, each.   Retroactive enshittification.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "900 Hours in, I can tell you this much, if you don't buy DLC, you will end up with weaker Civs. It's almost becoming a pay to win game, each new DLC adds a CiV that is overpowered beyond ridiculousness, not suitable for competitive play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a long-time lover of Age of Empires II, I was excited when this was announced as a spiritual successor.\n\nHowever, one single factor ruined it all for me - and, I think, for other \"old\" fans of the series: [b]competitive multiplayer[/b].\nEverything in the game seems to be designed around competitive multiplayer, leaving single player as a pretty empty experience. \n\nHere's a breakdown of what contributes to this feeling.\n- Everything is supposed to be fast. Don't keep the Town Center idle! Hotkeys! Get on with it! No more taking your time and building up a city, efficiency is all that matters.\n\n- Single player savegames becoming invalid because of the new patch with the rebalances for multiplayer? You've got to be kidding me.\n\n- Single player missions are pretty dull, repetitive and the tutorials basically explain you how to practice competitive multiplayer strategies.\n\n- Units strategies are all based around very precise rock-paper-scissors like mechanics, but in \"real\" situations, well... more often than not it's just: build a big old army and throw it at the enemy. It all becomes a random messy melee anyway.\n\n- Units aren't very characterized. In AoE II you could easily tell a Long Swordsman from a Two-Handed Swordsman, or a Pikeman from an Halberdier. They looked and felt like an upgrade, and they had few essential stats that made very clear how stronger they were. Now they are all like... parameters. Congratulations, you have upgraded your melee infantry! Now you have units that look the same and it's not entirely clear what has changed unless you're into hardcore competitive play.\n\n- Same goes for buildings. They aren't really that recognizable, and the dull all-blue-and-gold UI doesn't help.\n\n- One million uninteresting things supposedly made to maximise engagement for multiplayer. Bonuses, events, unlockables, XP points... a reflection of the social media era.\n\nOn the positive side, the short documentary videos about Medieval warfare are very nice and interesting... but that's pretty much all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "With the current state of the game I cannot recommend it. \r\n\r\nI have over 500 hours played in the past 4-5 months. Obviously I enjoy it. \r\n\r\nBut this latest patch and DLC is a disaster. Every faction released is blatantle of shamelessly overpowered/broken in one way or another. \r\n\r\nThe Devs are well aware of the issues, but considering they have still not managed to nerf the HOL which has been a problem since their release in the LAST dlc gives me no hope that they are competent enough to balance this new mess they've forged.  \r\n\r\nThe game is unfun and not worth your money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "matchmaking bad\nping bad\ndlc's clickbait\nunbalanced totally\n\n\nWhen comes to 2 good opponent and both know how to make stable economy... Only power diffrence comes from buffs of the troops. Really far from strategy. \n\nWhich game in 2025 doesnt have reconnect button in ranked games?\n\nIt could be good weekend snack. Thats all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is pretty standardly what you would expect, but this game came out in 2021, and I'm playing it in 2025 - and the game can't keep track of which campaign missions I've beaten and what things I've unlocked. It is very frustrating to finish a campaign level, click continue, and have the game load up a mission you beat six missions ago. \n\nNormally I wouldn't let a single bug cause a negative review, but c'mon. Game saves? That's basic stuff.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Old enough to call itself, \"Anniversary Edition,\" and still feeling like an unpolished 1.0 release.\r\n\r\nThe quality of life features are what doom AoE4.  Or rather, their lack thereof.  Building a skirmish requires you to tab through multiple pages and hand configure everything, every game, because it resets everything to defaults instead of saving your previous settings.  A bunch of common functions, include Select Next Idle Villager, and Build Farm, do not have hotkeys and hotkeys for them cannot be set.  A lot behaviors that have been in the series since at least Age of Empire 2, back in 1999, are absent here, like Villagers understanding that only one of them can work a farm at time.\r\n\r\nIf this were an AoE clone, that might fly.  But this is a main line Age of Empires game.  The 2007 release of Age of Empires 3, as well as AoE2 Definitive Edition and Age of Mythology Retold all have features that this game is missing.\r\n\r\nNo single bad QoL is backbreaking, but they all pile up.  Converting your villagers from hunting to farming is something that was no big deal in any game except this one, where it's an APM nightmare.  Only being able to select all of your idle villagers at once is another thing that makes gameplay so much more difficult than it needs to be.\r\n\r\nAnd then the aggressive Live Service monetization butts in, making it loud and clear what civs and game modes that your peasant ass doesn't have access to, just for that little extra upthrust middle finger.\r\n\r\nBottom line is that there are four Age of Empires games currently being maintained on Steam, and somehow, the one with 14 extra years of game design experience to inform is that worst by a clear margin.  Age of Empires 4 isn't a bad game, but it definitely isn't a good one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First time I saw a game sell an \"anniversary edition\" that includede none of the DLC which were release up untill that anniversary, hand rubbing money grabber move",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I know progression and cosmetic unlocks aren't the main reason to play a game, but it kills my enthusiasm to have my campaign progress reverted or challenges not registered. No, I don't have Steam Cloud enabled. It's endemic to this game. After searching for answers in forums I've found that this bug is a frequent and longstanding one. Disgusting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly regret buying it, prefer Age of Mythology. This one is pretty boring as heck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "CRASH CRASH CRASH\n\nI've enjoyed this game enough to have played it for over 2200 hours, but now its just pure frustration! Ten minutes and crash...I'll save every 5 min as if that's anyway to enjoy a game. So I guess I'll take a break and uninstall. If it works for you that's great. I don't dislike the game but its only a game if you can play it. I don't know if they're working on the problem.  It doesn't look like it effects the majority....they only give me a yes or no so I'm force to say NO....chances are that it will work on your system and you'll have fun with it and a small chance it wont...up to you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is good but the AI is dumb i love playing vs ai, but the ai keep camping inside base and the most annoying they wont build stone wall at all. hope theu fixed the AI system",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games are long and i do enjoy it but the game keeps crashing when the players are loading in and i recieve a ban every single time that part is not fun in the slightest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got this game recently and it has been a fantastic game for RTS. I've never gotten to enjoy AOE2 but the graphics are so dated that I find this game to be much more visually appealing and I enjoy it a lot so far. I enjoy PVP and I played mostly team games and FFA. I started playing pretty much right as this DLC comes out. Before I know it there is a menace in team games and FFA that is straight up ruining the games. Entire teams have to feudal all in to stop them from getting imperial, FFA lobbies either team up against them or the lobby doesn't care and loses to them anyway. I'm about done with the game until a patch comes out. Considering how long it has taken that patch I don't have much hope for the future of this game. I don't recommend until this patch comes out and they start to hot patch things when they are broken upon release, such as this stupidly OP broken(golden horde)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "CRASH every single time around 15 mins into the game. Check the Steam community discussions and you’ll see it’s affecting everyone. We are a party of x8 and all affected. Devs don’t care issue gone on a month. Seems they took the money from the new DLC and walked away. AVOID unless you like to buy broken games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Loved the multiplayer on youtube channels, that got me to buy it...but with overpriced DLC's and a steep learning curve, I found myself not wanting to play this game no matter how much I want to play it! You will sink hours of madness in the single player version just to realize how hard it is and not even want to play multiplayer and waste days of your life getting destroyed by diehards online to learn the hard way. I have been waiting for years now it seems for the DLC to be a reasonable price to find some reason to get back into it but It just doesn't happen!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have over 600 hours in this game and today I can no longer recommend it. The new DLC introduces a real pay-to-win element; the new civilizations (Mongols and Indians) are intentionally far too powerful, capable of easily winning 1v3s, making it pointless to play anything else. Furthermore, I'm experiencing numerous server connection issues. It's a shame because the new single-player mode was interesting, and I chose to support the developers by buying this DLC, even though it was obvious that the Macedonians should have been fully Scandinavian and the Mughals South Asian. I absolutely do not recommend buying or playing this game at this time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was a good game but lack of balance for updates means dont waste your money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, the game is primarily focused on multiplayer. For an RTS, the combat and economics lack depth. Chess is lacking. Only in multiplayer does build order become important, but the level of complexity remains unclear. I don't know if it's a worthy successor to the previous installments, but it's very similar. The campaign bored me so much that I gave up halfway through the third nation. Furthermore, the game still has bugs, and after updates, I lost my saves.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck your malicious DLCs. Half my game is just locked behind a paywall. If I didnt buy the DLC, don't show it in my game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don’t buy it if you are a solo player, because the developers did not add Empires for free — the Empire feature only comes with a DLC.\r\nThere are only 2–3 offline modes that are fun, but not for a long time, and the available empires are so limited that you eventually get bored.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nothing new and exiting. just minor improvement in graphics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was looking forward to having an improved AOE 2, but sadly the mechanics and game play feel sloppy, troop movement and builds aren't the same, having a training cap and building cap doesn't add to game play. I will stick to AoR 2 for a while longer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disappointing, a clear downgrade from AoE II and AoE III, not including the paid DLCs...\nIf you want to play this because you liked the previous games, don't, it's a waste of money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really want to love this game, but it makes it so difficult.\n\n• To start, you can save during the game, but it's pretty much useless since every update breaks save files. This alone is reason enough for a bad review.\n\n• The gameplay is extremely different from previous titles, it seems to me like it is focused on seasons and super fast competitive multiplayer, rather than a more strategic growth and single player campaigns.\n\n• Troops just do whatever they want, whenever they want. There are no stances like offensive or defensive; it is hard to control individual troops and seems like developers want you to just throw \"everyone in\" every time. The worst is the 'stand ground' because it only works once! If you move the troop, stand ground is turned off.\n\n• Played the first campaign, it felt more like a documentary lesson/class rather than a map with goals where you are free to play. Spent half of the time watching cut scenes from a documentary with a monotonous boring narrator instead of playing (nothing like AoE2 videos, which I like and looked forward to).\n\n• Then of course there is the whole civilisation variant thing, which feels like a lazy approach towards adding new civilisations. \"Jeanne d'Arc\" civilisation. Complete nonsense.\n\n• I love the aesthetics of the game (except for the terrible interface, both in-game and menus), but half of the units and icons look the same, making it very hard to distinguish different types of units.\n\nYou have the pointless xp/level up and masteries, timed events and seasons, the awful and complicated UI, no game speed or pause (even for single player), amongst other things....\n\nSorry but cannot recommend it. Unless you are looking for the fast-paced e-sports send-all-men-to-the-battle-at-once type of thing, just go play any of the other 'Ages' games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played the game for more than 300 hours online, but I prefer playing singleplayer.\n\nFor more than a year I am unable to play AoE IV properly in offline mode, because the game is hellbent on sending my data to Microshaft and creaming itself, whenever I try to play offline.\n\nPerformance is constantly tanking on both my PCs with constant stutters and FPS in the lower double digits, but everything's fine, when I am online.\n\nI contacted World's Edge support twice, telling them what's wrong. They affirmed the bug, but I did not get any better. I even tried using the direct route via Discord and ended up getting ignored there as well.\n\nI am not keen playing online, I am not intrested in those FOMO inducing events and seasons World's Edge is pushing. Ignoring bugs but churning out those Variant Civ DLC is just the cherry on top.\n\nWould recommend, If not for the abysmal performance issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played for 41 hours and recent updates now makes the game unplayable. Cannot load the game as crashes on loading. The forums show many like me and the devs doing nothing for a fix.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they started giving player cool down for when the game crashes and kicks you out. now you have to wait 15 mins to play. used to just do it in ranked now its on quickmatch to. great job breaking the game. maybe play test before you make units that literally break the game Elite Torguud simulator is all this game is. what a shame how cheese this game can be",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AOE3 was much better than this. Also, post purchasing this game, half of the teams are not available as they are part of different releases and DLC. I bought it due to a good experience with AOE3 but this one is more of a disappointment",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It crashes when playing with my friend sometimes, WTF dudes. How to ruin an experience, and I can't join back the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First off this game has been absolutely phenomenal for a long time. I have 300 hours on it but recent updates have made this game unplayable. RIP AOE. It's been fun. I don't know if you will encounter the same issues as me, but there is major lag in the game now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has one really frustrating issue. Every time Age of Empires IV gets an update, I can’t load my manually saved skirmish games in single-player mode anymore. It says the save is not supported in the new version. It’s really annoying to lose progress like that after every update.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game always freezes, now, whatever they did yesterday, the game freezes after 2 minutes. Pathetic, as it was a good game!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Annoying for a casual player. I just want a relaxing single player game without the AI spamming raiding parties every 12 seconds",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've played 2 games from Relic so far, extensively : Company of Heroes 3 and AoE4. Both suffer from a major problem. Everytime they release a DLC, they make the latest DLC broken in order to sell it more. Right now the game is unplayable (and has been for a month) due to Golden Horde, whenever they reach Imperial Age they can pump non stop heavy cavalry at no cost and literally 1v4 the game (since they dont rely on ressources and just put out one of the best heavy cav unit). It's literally over by the time they reach Imperial age, or you have to rush them early game. Anyway, they are doing the exact same thing with Company of Heroes 3, where the latest DLC is broken too, which you need to win simple games. This scumbag practice needs to stop. Don't pick this up unless you're willing to buy the DLCs, but you'll be fucked if you don't want to buy the next ones.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Excluding the Turkish gaming community and Turkish content creators from the beta process is disgusting. Whoever is responsible for managing the community there should know they don't deserve their salary. You can't use Microsoft like a government agency and project your personal issues onto your work. Get a grip.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Latest DLC patch wiped out my campaign progress after a cloud sync. Apparently a known issue for the new Crucible feature, but is affecting other features as well.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cons:\r\n1. stupid, ridiculous zoom-in even in \"pAnOrAmIc mOdE\"\r\n2. too many paid DLCs, all these nations should have been included in base game\r\n3. cars in videos instead of lore/history-friendly reconstruction\r\npros:\r\n1. nostalgy\r\n2. videos are still cool",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA doesn't give 2 Fs about game issues to the point that they don't bother replying on official forums and just send canned responses that just blame you. I've tried this on multiple PCs and internet connections, and cannot play multiplayer. Years worth of forum posts about the same issue and EA clearly DOES NOT CARE WHATSOEVER BECAUSE F YOU, THAT'S WHY.\r\n\r\nDon't give these people your money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game ignores the Turkish gaming community. There are many errors in the Turkish translation. Furthermore, they did not consider Turkish publishers in order to prioritize Beta verisons of dlcs'.\n\nI hope they try to attention for this comments...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Devs have no idea what they want to do with this game and its clear. New civilizations are just lazy and clearly don't have effort put into them anymore. It was a good game but it's just terrible now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I only like the team games, but there are so many trolls it is barely playable. Very often you would try to play a ranked game and get trolled few times in a row. Of course, the support does not care.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matchmaking in this game sucks. The civs are all unbalanced these devs dont update and patch broken civs quick enough. Crappy cheap dlcs that are just reused asset flips. This is why rts is a dead genre. Healing elephants and Golden horde are proof these devs are insane.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you are a simulator town building player, do not buy this game. Somebody somewhere tried to be smart and messed up the whole exswperience. 100% NO, SORRY I BOUGHT IT!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're not going to play the new DLC countries, don't even play the game.\n\nThe differences are incredible. Basic English, France, etc. are so inadequate compared to countries that can do everything at the highest level.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst AoE game of all and by far. Avoid at all cost, even original Age of Empires 1 was way better than this. Looks horrible, is completely dumbed down and bugged as hell.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bug off and fix your localization. People are buying this game for its legacy, playing for hours with passion and trying to enrich the community and what you do in return? Lazy ai made localizations, discrimination against certain content creators etc. Stop being a d*k. Do your job properly instead of being a small indie company like punks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WORST Anti Aliasing i've ever seen in a game. Even AOE3DE Looks much better with its temporal Antialiasing. AOE4 is unplayable to me until they fix the AA. Foliage looks horrible, everything is flickering. even Nvidia Control panel cant fix this issue. not playing until patched.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely the ugliest AoE game I have ever played. And the worst game I have played in 2025\n\nThe game is incredibly unoptimized.\nThe graphics are just plain ugly, it does not even feel like a real AoE game.\nSettings are absolutely useless, I cannot make the game zoom out, can't improve graphics, can't improve sharpness or bloom, the whole game mixes colors in a dizying manner.\nI can't even refund the game, despite it apparently not working half the time..\n\nJust.. no..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is okay Ai has had improvement and the maps are pretty cool. ultimately though the game is incredibly buggy be prepared for multiple disconnects from their online services, time outs or connection losses during games. As well as the oh so loved \"Fatal Scar Error\" that black screens your game and crashes it. Instead of dropping recycled DLC civs that really arent worth the cost nor have any singular uniqueness to them why dont you fix the core of your game so it can actually be FCKIN PLAYED. Incredibly frustrating getting no support from the dev teams on the game breaking bugs. like who tf wants to build their base for 30 mins just to have this shi crash or time out right before the action starts. At this point after the recent DLC update the game is not playable, crashes literally every single game weather its a timeout issue from their online service, a desynq issue between other players or the fatal scar error black screen of death. Use all that money from your DLC dump and fix your fckn product.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i wouldn't say its a bad game, but i fail to see what they improve on from the third installment.\n\ni would prefer age of empires 3 over this one.\n\nand its not even like the graphics is much better.\n\ni didnt play the campaign yet, just a skirmish match. if you wanna buy it for the campaign i assume its alright in terms of entertainment.\n\nif you buy it for the skirmish and you already have age of empires 3, just stick to the third one and save your money for something else.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am a little conflicted as to whether to leave a positive review here or not - because it is a game I enjoy a lot. But i really wish the devs would work on a native controller input (a la AOM Retold) in a future patch so i can play on steam deck. its already ported to xbox and ps5 now so how hard can it be?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "October updates to AI are stupid.  All players from each team  attacking me all the time. Really dumb.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unbalanced dogshit. devs have the audacity to ask for more money on the newest dlc when the 1st dlc delivered the same amount of content and the 2nd less content",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "with the recent patch i cant even run the game. please fix it. thanks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love AoE series, i really do. But this one hits very different. There are many nations, but most of them are locked behind paywall. \n\nI didn't feel any uniqueness between each nation, there are no significant system that makes each nation unique (such as Dutch's bank in AoE 3). or maybe i just salty because there are many paywall? even the arena. Hmmm",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn’t feel like age of empires 1, 2 or 3. It plays like StarCraft 2, feels very fast passed and micro manage oriented but doesn’t have the tools games like StarCraft have that make this gameplay possible. \n\nI admittedly haven’t played since launch, maybe things changed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst game i have ever played, the controls are complete ass. the game is unbalanced asf. Worst use of money i have ever done",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unable to play.  Chose the default video settings.  Some of the cinematics played fine.\r\nTrying to control 100 units seems to be too much.  Already failed 3 times in different ways.\r\n1. Program froze after completing 2nd campaign.  2. Program reported a program to Microsoft.\r\n3. Program froze again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "JUST PATCH THE MATCH MAKING, YOUR GAME HAS BAD MATCHMAKING AND WE GOT PENALTIES FOR DOGGING TO YOUR GAME AND CRASH EVERY GAME JUST PATCH THE MATCHMAKING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ITS BORING GAME , AGE OF EMPIRE 2 THE OLD GAME IS BETTER ... IN THIS AGE OF EMPIRE 4 YOU CAN MAKE ONLY 200 UNITS NO MORE AND YOU CANT MAKE YOUR OWN GAME HOW EVER YOU WANT \r\n ( UNLIMITED UNITS , FREE BUILDING , ENDLESS GAME .. ATC ) .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not buy this, or anything from Steam anymore. Steam has resorted to dirty tactics to make money. I have had 2 issues from Steam this year that I categorize as stealing. They either do not provide you with the product you bought, and refuse to refund the missing item, or they lie about their policy to get sales from customers they never would have gotten if their store was honest. \r\nDo not trust the so called 2 hour refund limit! Steam will lie and say you played longer than you did. Even if you have evidence you asked for a refund less than 2 hours after buying the game. Steam will just start lying and saying your played 4-5 hours, even if you bought it less than 2 hours ago. \r\nThis is the way steam conducts business now. I would buy this anywhere but on Steam!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No skirmish diplomacy, so i wont buy DLC.. It just means less depth and dynamics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are not fixing known bugs. Mansa Quarry has been known to be bugged and unkillable for weeks and they haven't fixed it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just want everyone know ,the new patch did not fix the crucible perk point issues. straight up lying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They keep tweaking the ai now hard is impossable and intermediate is very hard. Play on easy or you wont have any fun i guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Taunts are annoying and disrespectful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why were the leading Turkish content creators (Yellowish, iby_aoe) excluded from the beta again? Why is the Turkish community being ignored???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy, quite slow, not how I remember Age of Empires at all..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love playing AoE3 but this game is slow to progress because there's so much to do. The shortcut keys are way too hard to memorise and even harder to reassign. AoE4 is not worth my time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the competitive pvp to this feels like death by a thousand cuts, so id steer away cause its infinitely more frusterating and less satisfying than starcraft 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game crashes to the desktop or freezes on multiple occasions. This is a common bug that is not addressed by the developers despite numerous reports. And yes if that happens you lose your ranking.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad optimization, the recommended specs are a lie.. \nI have higher specs than the recommended ones listed and i still need much higher specs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only bought it because the old games where good. Would never again buy this version.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "retarded game, miss the time of AOE III lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TRASH GAME!\nFUCK UR DLC TRASH!\nNO ONE CAN WIN AGAINST GOLDEN HORDE,, ARE U STUPIDDD DEV???????????????????????\n\nFUCK GAME!\nTRASH!!!!!!\nSTUPID GAME!!!!!!!\n\nGUYS PLEASE DONT PLAY THIS STUPID TRASH NOT BALANCE GAME...\nEVERY MATCH U MEET GOLDEN HORDE, U CANT WIN!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They added makies before bulgarians. i dont think theyll add em",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there is no way they take so much time on fixing bugs with the new dlc this is dumb",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After the latest patch every match is a desync",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesnt work downloaded it and it doesnt play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Constantly crashes, devs still haven't patched this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is the crucible a dlc?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shitty game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crash crash crash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes everytime",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SINCE THE LAST PATCH IT'S BEEN LAGGING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "STOP MAKING DLC FACTION OP",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Need to fix Golden Hoard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "لعبة الزنوه",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "will remove  this review when GH is nerfed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "awful if your new",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yok",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why were the leading Turkish content creators (Yellowish, iby_aoe) excluded from the beta again? Why is the Turkish community being ignored???",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}