{
  "positive": [
    {
      "review": "UHH def not addicted. Pretty good game. Is fun f2p but there is so much qol and ease of access with p2w. 7.8/10 would recommend. Creator does use fomo on stuff which is a little :( but eh whatever. 4/10 on that part.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "I really like this game and have played it free to pay and buying packs on various accounts. The game is free to play friendly however I do think there should be an option to limit pack pop ups or disable them all together. Some folks want to play f2p and getting barraged by the pop ups will turn them off of the game.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Easily the best idle game out there. No true pay to win as you're only really playing against yourself and what convenience there is behind a pay wall is entirely optional though VERY convenient. True box price is $5 for the auto pickup pack, see if you like the game and make that your only expense if you're a hard line anti-whale.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "I already played it on iOS when it first came out and i really liked it, so I convinced my boyfriend to try it after it dropped on PC. Now he avoids even looking at me and started leaving me on read. i dont know why? did i do something wrong here?",
      "voted_up": true,
      "votes_helpful": 40
    },
    {
      "review": "very cool idle MMO game inspired by maplestory. has thousands of minigames and things to do in this game. feels like the content never runs out in this game and me likey seeing my number go up ooga booga",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This is the only idle game that gets updated often enough to keep up with my deteriorating dopamine receptors",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Very entertaining and fun, a huge time sink. I wouldn't call it 100% free, but the only thing I would consider necessary to buy is the autoloot for $5, which would basically be the cost of the game.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It's a fun little time waster. If you enjoy idle games, this might just be worth a try. Not sure if it is as P2W as some reviews do say but you can get away without spending anything.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I really dislike mobile style monetization, that being said this game actually hits the mark.  It's a lot of fun, has a ton of content.  Would I like to go back to 1999 where a game like this would have been $30 day 1 and thats it?  Sure, but I cant.  Idleon is fun, you probably don't want to start this addiction but once you do youll enjoy it.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "IdleOn is the perfect game if you’ve ever thought, “Wow, I sure wish I had another full-time job, except this one pays me in sticks, bugs, and emotional instability.” Every day I log in and the game hands me 47 new tasks and zero instructions. And I say “thank you.” Because I am weak.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Enjoyable time sink.  No need for pay to win.  Premium currency drops in game, best rewards available to everyone.  Great pass time.  Developer still very active with the game and consistently dropping new free content.  I recommend this to anyone who's looking for something they can pop in and while away spare moments, then get sucked in find all the mini-games keep you busier than a free game should.\n\nEnjoy!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Probably the best Management Idler game ever. it is a MUST PLAY.\n\nThe only issue I have with this game is that it replicates an ONLINE MMO akin to MapleStory\nI'm an old supporter of Lavaflame2 When he just had Idle Skilling on mobile, and that felt like the best Idle game ever and it might still be, but having to move around a lot with a limited inventory, only getting the gist of how some things work, then having to jump into another sub-category that you have to spec and focus on, then another, then another.\n\nIt OVERWHELMS me and yes, I know I can take the game at my own pace so its MY FAULT/PROBLEM.\n\nI also feel like the friend bonus stuff sucks cus im a loner, all I can do is join a random group until it dies off and repeat the process, never actually having anyone in the friends list.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I think it's a good game. The creator is constantly working on new content, being very good at posting about new features on the official Idleon discord as well. I know people complain about the game feeling like you need to do pay to win, but you can do this game completely free to play, it of course takes longer time to get through things, but if you do the quests in game you earn gems and such, which helps you along the way.\n\nI've been playing it for some years now, and I would for sure recommend it if you're looking for an idle game that is not just idle, as there is a lot more content behind this game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "My first idle title, having fun, love the pixel heavy aesthetic and humor.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a very nice chill and yet fun RPG game to play.\nDon't knock it just because it's a Mobile Game, I'm not fond of Mobile Games yet this is a really good one for once.\n\nIt's very Chill and AFK friendly, the more you play the more there is to do, and at some point the game actually becomes more Active than AFK with so much to do.\n\nI have to mention the Cash Shop, it's a given for any game if they have one.\nThe Cash Shop is mostly optional and will not stop you from playing the game.\nYou can earn Gems simply by playing the game to use in the Cash Shop.\nPeople will/may say that it's P2W, but I feel that's a personal Opinion and for me it feels more Pay 2 Rush, and is simply Optional.\nDon't confuse P2W with Pay 2 Rush/Skip.\n\nAside from that, it's a great game to just chill on a side screen or actively play and can be played on Mobile while away from PC.\n\nIt's Free give it a try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Easily my favorite Idle game. There are many, [i]many[/i]  different things to do that will keep me occupied for a long time to come. The sense of humor found throughout the game is pretty great, and the game overall has a 'variety is the spice of life' theme that keeps it from getting stale.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I download this game because it reminds me of old Maple Story before all the changes. The game is fun to play but I can see the game going the P2W route.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'm by no means far into this game (World 2) but it's fun time waster that I've been enjoying slowly working my way though. It feels a bit P2W but I'm mainly interested in just slowly gaining all the Steam achievements more than anything else.\nSo far really enjoying the music and graphics. It also seems that the creator consistently updates which is a plus.\nHad some annoying bugs though where the game will just randomly crash. Haven't played it at all on mobile yet so unfortunately can't comment on any potential issues for that but will do so in the future and edit this review as needed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a nice balance between active and idle/afk game play. You are your own guild in an MMO. Having everyone do their jobs to advance. I played Lava's Idle Skiller and this game is so much better in every way. The community is great, always helping people understand the aspects of the game.\r\n\r\nI also love Lava's sense of humor. All the references and just pure organized randomness always makes the game experience more enjoyable. \r\n\r\nP.S. the auto loot is worth it. Its basically the cost of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game, spent way to many hours just on steam... Dont look at my mobile hours..",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "idle game with deep progression lots of little things to keep number going up.\r\ndoes have some p2w stuff but its not needed to progress",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Another Idle game, but this one come with humour, many different mechanics, and is actually a game. Not pay to win, and the payment options are reasonable and not over the top. LavaFlame2 has really made something unique and if you need something to kill time I do recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game good, cash shop & pets is real rough, ignore it all after picking up auto loot and get some free weekly gems for the upgrades over time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very great,played for hours,multiple character gameplay makes sure you always have somthing to do,still not better then terraria",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "11/10 best idle game ive played in a long time. the one i have stuck with the longest as well i believe.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is great. Starts extremely complex and complicated, and doesn't get any easier. Oh, whats this? I upgraded my pancake recipe now I do 5x more damage? Lovely.... 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Been dumping countless hours between Steam and mobile for years. Been here since iOS release and I haven't stopped.\n\nA single player game with MMO feel. Cute and simple art BUT doesn't feel like the cheap pixel art (you know what I'm talking about)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I like this game!\r\n\r\nIt's nice that in the beginning you can play this game fairly activly or idlely without any real downsides, even so it is by heart an idle game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got this game from the Free-to-Play section here on Steam, and it has not disappointed. There are constant updates and it has a very lively community around it, though I don't really participate in that. Great little idle game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game it was kinda hard at first but now it's fairly easy since I learned what I'm doing... 10 out of 10 would recommend for others to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good idle game, still figuring out a few mechanics but that's what Reddit and the wiki is for :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with lots of complexity it starts to feel repetative by world 3 but its broken up by new mechanics being unlocked in each world like alchemy and construction the only problem i have with the game is the severly delayed updates brought to ios making on the go progression impossible but if youre only going to be playing on pc then you should be all good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A well-made idle game, the pressure to buy mtx is not that high because you can do pretty much anything, just don't mind the slower pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for those who doesn't have much time for actively playing a game but still want to have something to take your mind out of work/study for a few minutes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that had a developer involved. Always a plus. A sit back and chill game that you can play forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sit down and relax. \nCreate characters and they will do everything for you. \nYou just have to think and give commands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, alot to do and very very grindy. The community is great and the dev is lovely",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a cute and fun idle RPG!  Gives Starbound vibes and lots of mini games inside.  Dev does lots of community events and streams.  Large Discord community.  Recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I feel like Idleon covers most if not all aspects of most if not all idle games on the gaming market there's an activity or grind for everybodies heart to desire it's absolutely incredible Idle game I have played idle games since 2015 between classic clickers like Cookie Clicker all the way to the more \"complex\" RPG style games like Idle Heroes. Yes does this game come with lucrative micro transactions of course it does its a free Idle game one of the most aggressive markets for that consumerism. I've bought most of all I can from this game because 1# I love it and want to support the future 2# Most of all the purchases you can make in this game provide real benefits saving tons of hours and hours of grinding. All and all ever since I landed on Idleon I haven't found the need to find any other game to fill my free time there is always I mean always something I can do in Idleon to progress my account especially with the Tome system urging players to push their account to the limits to reap the rewards of being the top percentile of players. Also all you IDLEON IS A P2W scam because you can't reach Top .1% in Tome its literally an idle game you're not pvping anyone or even pveing with anyone all the content is possible without the Tome nametags it just takes longer. Idleon in my eyes is strictly P2P. Thank you Lava for all your time and effort you've put into Idleon I look forward to spending more of my time playing a quality game! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this game on Steam Deck, even though it says it's not the best to, I think it works amazingly fine! This game is hilariously funny and you can have a lot of characters, whether they're just for idle farming or for many different attempts to accomplish different tasks.\n\n   IdleOn is not very buggy in my opinion, the only downside for me is on Steam Deck, you can change the screen size as if it were an app you can shrink which is funny on Steam Deck.\n\n   Otherwise, I highly recommend this game for anyone looking for a fulfilling RPG game, especially since the developer doesn't make these games for money, he simply makes it for fun and for your entertainment. (Please note that this game is also LGBTQ friendly, as you can pick 4 genders at the start, Female, Male, Both, or Other, giving it a respectful side!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy playing this game. It's good enough to kill time occasionally, only 1-2 things I want. Please add a feature to change character names and move characters so they can be categorized. It might be a bit useless, but I think it's necessary. Hopefully you'll add it in the future. Or does this feature exist and I haven't unlocked it yet?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive played over 50 idle games, this game is by far the best in my opinion.\nalways new and intresting updates the dev listen to the players\nive played this game for like 4 years and i still having fun and its FREE!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to just let run in the background or let your ADHD run wild.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an idle game i have to actually interact with 1 STAR!!! \r\n\r\nall jokes aside very enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty addicting gameplay loop of building up your AFK capacity. It requires active gameplay, but once you finished a session of playing, you leave it to idle on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun and addictive games I've played in quite some time. \n\nIt keeps your attention for hours on end w/ near endless content.\n\nDev is very friendly and open when communicating which just added to the appeal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "playtime is low cuz i play on mobile, but man is this the one of the best games ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's such a good game, I've been playing ever since it released and it just keep on improving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for the last couple of week, it's definitely different from what I'm used to playing - typical CSGO and Rocketleague player - but it's got me hooked. Quests, Multiple Characters, no Idle Time Cap so you can go afk for however long and still level up and get resources. \n\nOnly sitting at World 5 right now, but that's a skill/time issue. There's so much to learn and a really good community to be a part of, even the discord is surprisingly active with a lot of late-game and experienced players that often help you through difficult tasks.\n\nOther than a few quality of life bugs and other small details that might need a touch-up on, its a really engaging and relentless game. Cant wait for more updates!\n\nA massive recommendation for any new players, GriffyBit has a Free-2-Play series going on at the moment, so far 9 episodes about an hour long each on average and he plays on a fresh account while explaining how to effectively/efficiently play the game as he progresses through each world - if you want to understand the game in further depth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has quickly become an obsession.  I can't think of another idle game with so much depth of content.  I rarely spend real world $ in FtP games but the cost<benefit is undeniable.  Get.  On.  This.  Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game. Love to play but it is a grind. Labor of Love for sure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have been playing this game for a few years now and i still do enjoy this game and its constant updates. but will say that it does have its flaws it has ads that do pop up when you go into towns that block too much of the screen. As well as the further you get into the game the longer the grind to get to the next world. You most likely will end up being behind some of the future updates that you will get to experience later if you choose to stick with it. \n\n(For the cliff notes on this game. Its alright but still rough around the edges and needs some optimizing but a good idler in my opinion.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Elder Days are gone. The Middle Days are passing. The Younger Days are beginning. The time of the Elves is over, but our time is at hand: the world of Men, which we must rule. But we must have power, power to order all things as we will, for that good which only the Wise can see. \n\nI said we, for we it may be, if you will join with me. A new Power is rising. Against it the old allies and policies will not avail us at all. There is no hope left in Elves or dying Númenor. This then is one choice before you. before us. We may join with that Power. It would be wise, Gandalf. There is hope that way. Its victory is at hand; and there will be rich reward for those that aided it. As the Power grows, its proved friends will also grow; and the Wise, such as you and I, may with patience come at last to direct its courses, to control it. We can bide our time, we can keep our thoughts in our hearts, deploring maybe evils done by the way, but approving the high and ultimate purpose: Knowledge, Rule, Order; all the things that we have so far striven in vain to accomplish, hindered rather than helped by our weak or idle friends. There need not be, there would not be, any real change in our designs, only in our means\n\nOnly one hand at a time can wield the One, and you know that well, so do not trouble to say we! But I would not give it, nay, I would not give even news of it to you, now that I learn your mind. You were head of the Council, but you have unmasked yourself at last. Well, the choices are, it seems, to submit to Sauron, or to yourself. I will take neither. Have you others to offer?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best idle game i played in my entire life, i started 4 years ago and i did not stop enjoying playing this beautiful game, i recomand this game all day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spent too much time with my friends gambling. It's good, though there is a bug right now which makes the siege breaker premium hat not be bought properly. I do not say this to discredit LavaFlame2, the maker of this game, but as to warn others to avoid buying it until that bug is fixed since then you would have 500 gems less, just like me. Overall a good game though, have been playing this for 2 years now on mobile and Steam and it's always a blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend found the game and showed it to me. It obviously reminded me of MapleStory, so I gave it a try. I still haven't missed one day of playing now for 2 months... I crave it more and more everyday, send help.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's so much to do in this idle game. Perfect for busybodies and no-lifers alike with the amount of content in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game overwhelming to start with, but if you seriously get into it, it's a game that's realy fun for a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this Game, the dev team really care about the community and the feedback they are given!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i absolutely love this game. ive been playing in for the past 10 months everyday. please add an option for android users to sign in with IOS. i unfortunately didnt realize the repercussion to making an account with IOS then switching to android :( other than that amazingly fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've enjoyed playing IdleOn for the last year.  It is fun to have in the background, check on it occasionally and then move on to something else.  I like the various skills and minigames that are fun to play but also most are challenging in a rhythm type vibe or the such.  Anyways, check it out if you like idle-type games and you may also enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best idle game on market! Must play if you like RNG and tons of time to enjoy this perfect art style! Dev is very active in community and always explains his updates on stream!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great pixel game and I don't want everything to explode. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "maplestory meets runescape in a grindy idle game that i cant seem to spot micromanaging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game lost my life to the beans they won and i lost my wallet in this game sadly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a free game this has been amazing! This is litterally a game with sooooo much to it. Definently give it a shot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Behold! A class an talent based game for people with a busy schedule! You will collect several characters, assign them classes, and tell them to do things while you afk/log out. Come back, assign points, use gathered materials, start them up for the next day. There are also minigames and some benefit for \"active\" play. Really though, that isn't why you're playing idle games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have played this game alot on phone and gotta say it better on pc you can say the game is \"pay to win\" but honestly its a really chilled out game where i dont think theres a point in buying the \"faster progressing\" things outside of actually just supporting the creators",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best idle game of the world, this game has so much attention to detail. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is quite good\r\nalthough it can confuse someone many times over and the quests can be tricky,its fun!\r\nalways something to do something to plan something to discover and upgrade\r\ni LOVE it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best game if you wanna train your leadership skills in terms of getting certain tasks done as fast and efficiently as possible - managing multiple character at once, making sure they contribute towards your goal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very relaxing games to sit back and relax, crossplatform on mobile as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly the best time-waster of all time.\nMaking progress in this game feels supremely satisfying, especially when interacting with the community. Comparing, sharing notes and tips, it's a game that plays like a single-player game and a multi-player game at once if you reach out to the community! The fact that it's all ran by one dev should make this game serve as the 'gold standard' for other indie games!\n\nThough despite all the hype I'm giving it, it's not without flaws. It's utterly difficult for a new player to understand without searching for content creators to help explain certain systems in detail and can get utterly confusing to people who don't like playing a 'numbers' game while they kick back. Definitely a game for casual spreadsheet enjoyers that don't want to involve themselves in anything overly competitive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game caters for everyone, active or idle you will make progress!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have spent an insane amount of time playing this game.  Sometimes I can pop in and spend an hour just checking on all the toons, sometimes it’s a 12 hour day doing quests, achievement hunting, or just improving my toons.  I love that you can have multiples of toons to do the grind.  Also love how much of the developer we see as a community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really grindy game , if u have a ton of time to afk in the game or just want a game which u will play once or twice a day then this should be your choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great game to stick to long term and great community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun game, that you have to grind it, it is a lot of fun to play with your friends😣😪",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dont get confused by the Idle part in the name, the game is rather active with the vast majority of content available. With this being said, still recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun for the MMO junkie that doesn't have the time anymore. (But it is def no life-able)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good idle rpg game\r\n\r\n+\r\n-great art\r\n-unique system with multiple characters\r\n-a lot of stuff to do\r\n-a lot of skills, attacks\r\n-nearly all things you do get you something\r\n-big numbers look really cool\r\n\r\n-\r\n-it has inventory management (not to bad but annoying at times)\r\n-its doesnt feel like an mmo. you see the players on the map and theres guilds but you dont really \r\n  interact with them except for dungeons and maybe tiny things like the one W2 boss fight or small quests\r\n-its an idle game which means that it takes a lot of time to get anything\r\n\r\noveral 8-9/10 could be a little better but its still great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got so bored one day I played this, got bored from playing it, the next day got money to play a different game. Though it was fun for a bit; better than nothing, besides it's free, no harm no foul.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game since it can keep grinding while im busy working i dont need to micro manage it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IdleOn is like an idle version of MapleStory. It is fun, cute, and has a lot of things to do maybe too much. Your characters level up even when you are not playing, which feels great. If you love doing quests like I do, this game is amazing. Many quests give very good rewards, and some even give you extra stats or useful buffs, so finishing them feels really worth it. But if you want very cute outfits, MapleStory is still better. IdleOn does not have many nice cosmetic options.\n\nThe controls can also feel strange. Switching from mouse movement to keyboard does not always work, and sometimes the keyboard does not respond at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IdleOn is really fun and relaxing. It’s perfect if you just want to take a break and enjoy a chill game at your own pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Idle game I've ever played, basically infinite content and never gets boring.\r\n\r\nCan get overwhelming and IT IS P2W. But you will only feel the P2W heavy aspects much later in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun for a bit. Kill a bit of time. But ultimately it lost my interest after like a week or so. Conceptually there's some fun stuff in here. Considering it is free I'd say: give it a whirl.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Legend of Idleon is honestly one of the best idle games I’ve ever played.\nIt’s cute, funny, and super addictive in a chill way. You build a whole team of characters that grind for you even when you’re offline, and the progression always feels rewarding.\n\nIt’s simple, it’s silly, and it just hooks you.\nDefinitely a masterpiece in the idle genre. BEST GAME EVER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just forget about the game and come back a year later, 10/10, would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely fantastic idle/active game that I've spent countless days playing. Give it a shot! If you like idlers you won't be disappointed!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i mean, it's an RPG idle game, but the MMO is meeting random players i guess \nXDDD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hey. Nice game to get lost in time and spend it switching chars)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, with a lot of systems to work through. Monetization model needs some rework probably, although I'm guilty of succumbing to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice idle game which has become less and less idle XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IdleOn - The Idle RPG is a fantastic idle game that even after 2k hours im still nowhere near finished. i can do nothing but be positive about everything from the artstyle to the (yes i know its an idle game) gameplay\n\nIf i should say anything negative over the game its that the game isnt actually free but 5 bucks as you practically have to buy the autoloot feature.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Idleon on = grind it on\n\nnot really an idle game, as there ist a lot of micromanagement. Fun mechanics, worlds and artstyle though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just sit back and relax. Chill idle game, can also leave it open in the background. Dunno what else to say. Its pretty chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super addictive, with lots of content and cute pixel art. \nThe only downside is the p2w bundles, but the rest is pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I love the fact you can swap to so many characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great progression, fun gameplay and a great game to chill and relax while you are snuggling with your cat on your chest looking at your top monitor. Could use some better guides for getting new gear but overall a great game!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I have near 25,000 hours in this game, the Dev has consistantly lied about the game since before steam launch, This game went from a will never be pay2win to you cant compete if you dont buy the monthly Fomo stuff, limited events with best items in game that never come back. A Giveaway pet that wasnt going to be p2w and have small bonuses which has one of the best bonuses ingame now",
      "voted_up": false,
      "votes_helpful": 241
    },
    {
      "review": "A Love-Hate Relationship: From Great Game to Cash Grab\nI loved this game and will probably always love it, but lately, playing it feels like a constant struggle. I cannot recommend this game to new players as the developer continuously makes the experience worse for both new and endgame players. I will change my review if the situation improves.\n\nThe core issue is that the developer has shifted focus from creating a fun experience to aggressively monetizing progress. What was once a delightful incremental game has become a blatant grind and a heavy-handed push toward pay-to-win mechanics.\n\n📢 Updates (Follower Progression)\nUPDATE: The New Reality (Reinstalled to Check) I installed the game again, hoping things had changed for the better. The very next day, a new patch dropped, introducing a new real-money currency. This new system put roughly hundreds of dollars worth of pay-to-win benefits behind this currency, giving access to some of the most broken advantages in the game with no way to grind it in-game.\n\nThe developer also never fixed a major technical flaw I complained about ages ago (a progression limit), instead simply capping it at a ridiculously low number considering the current power creep. Capping the number-go-up dopamine in an incremental game is a sin.\n\nAdding insult to injury, I ran into a bizarre bug where random screen elements would open a link to the developer's stream. My initial review still stands: the developer is still prioritizing questionable decisions.\n\nUPDATE 2: Censorship Confirmed I was quickly banned from the game's community forum for making a single, critical post about the recent paywall additions. This kind of heavy-handed censorship confirms the developer's unwillingness to take valid feedback.\n\nUPDATE 3: Banned for Feedback Shortly after writing my original notes, I was banned from the game's official chat for criticizing the latest patch and how it negatively affects free-to-play players, failing to deliver on promised fixes.\n\n👍 The Good (What I Loved)\nExcellent Progression Systems: The game offers deep and engaging mechanics to constantly strive for improvement.\n\nUnique Character Control: The ability to manage multiple characters without constant active grinding is cool and efficient.\n\nSatisfaction of Scale: Resource management and hoarding billions of items creates a genuine feeling of power.\n\nVisual Appeal: The pixel art style is great, and the monsters are interesting and quirky.\n\nConstant Goals: There is always something new to strive for and systems to min-max.\n\nUncapped Progress: Most core systems, like character levels, have no limit, which is the heart of an incremental game.\n\nCommunity: The player base is generally nice and helpful.\n\n👎 The Bad (The P2W Shift)\nEscalating Costs to Compete: Each new world significantly increases the amount of store currency you must spend to maintain a competitive edge, with some updates offering massive power boosts only via spending.\n\nAggressive Currency Nerfs: The acquisition of the in-game store currency is constantly being nerfed. A major boss that used to reward a decent amount of the currency now drops a fraction of that.\n\nMore Store Purchases, Less F2P Currency: The developer continually adds more store purchases with each patch while simultaneously reducing the rate at which players can earn the currency for free.\n\nIgnoring Critical Bugs for Months: Despite promises of QOL and bug-fix focused patches, the most crippling, long-standing bugs (like mobile progression overflow) are consistently ignored.\n\nQOL = Nerfs in Disguise: Many \"Quality of Life\" updates end up being major nerfs with minor cosmetic improvements. Recent party-finding QOL, for example, completely broke the system.\n\nEndgame Punishment: Endgame players are repeatedly nerfed in damage and overall progression.\n\nDeveloper's Ego and Refusal to Listen: A lot of the frustrating problems stem from the developer's refusal to accept help or listen to the smart, talented programmers within the community.\n\nPoor Communication and Emotional Responses: The developer's communication is lacking, and his responses to criticism are often emotionally charged or dismissive (e.g., suggesting players just \"don't use\" a flawed feature).\n\n💀 The Ugly (The Environment)\nZero Tolerance for Criticism: Any form of negative feedback is deemed \"toxic\" by the developer and often results in an immediate ban.\n\nHistory of Censorship: The developer has a track record of censoring his critics, taking down community videos, demanding name changes from content creators, and banning people for petty reasons.\n\nArbitrary Bans: Active, long-time community members and even staff have been suddenly banned for minor or unclear reasons, demonstrating a severe lack of transparency and an authoritarian management style.\n\nDeveloper's Priorities: The developer adds features he \"wants\" rather than what the game needs, spending time on minor cosmetic additions while core systems remain broken.\n\nToxic Requirement to Compete: To exploit developer oversights (bugs that often provide massive advantages for months), you are effectively required to be active in the community chats. This forces players to navigate an unpredictable and often hostile environment just to stay competitive.\n\nCheater Immunity: Cheaters are able to roam the game freely, while legitimate players are banned for criticism.\n\nI urge those who get deeply invested in their games to proceed with extreme caution if you still decide to try this game.",
      "voted_up": false,
      "votes_helpful": 133
    },
    {
      "review": "its decently fun but the trend of the developer is going towards being a money grab, i brang it up on the official discord and was promptly banned. if you are ok with constant popups then you will have fun but i fear how long itll take before you need to pay to be able to progress at all.\n\nEdit: to respond to the developers comments in short. The last time i talked on that discord before that thread was in 2023, no staff contacted me and the only reason i even knew i was removed was because of looking for the patch notes. (More detailed explanation in the comments)",
      "voted_up": false,
      "votes_helpful": 194
    },
    {
      "review": "The developer employes scummy practices to try milking players for money, and it's gotten to be too annoying. Happy to say I've never spent a cent on this and never will; anyone who gives even $5 is a sucker.\n\n[list]\n  [*]The developer purposely did not add a despawn timer for loot on the ground so that the game uses memory until it crashes in order to \"encourage\" people to spend real money on the auto-loot feature. The game is unplayable at a certain point without this feature unless you babysit it.\n  [*]Every single day you open the game you have to carefully close 2-3 popups telling you to buy the new $20 pets. If you accidentally click on one, it will clear the screen of anything on the ground, including premium currency that may have been dropped overnight.\n  [*]Apple rejected this game because the pet gambling feature went against their policy, so the developer made it so that there's a 4-year pity timer on the free rolls so that it's technically no longer gambling. If you actually wait the full 4 years though, you'll find out that you still need to pay money to actually unlock the pet.\n  [*]The dev employs other dark patterns like adding purchase confirmations to free items in order to condition you to click through them without thinking. He then places these free items next to absurdly expensive, completely useless cosmetics. Presumably, this is so people accidentally waste their premium currency (which he constantly makes harder to get, by the way) and since there is no way to contact the developer, they'll simply have to buy more.\n[/list]\n\n[b]EDIT:[/b] I appreciate that the developer corrected my factual inaccuracies--however, please notice that he is nitpicking small details instead of addressing the main points.\n\n[list]\n  [*]Loot may technically despawn eventually but it is well past the point of reason. Your computer fans WILL spin up like they're trying to take off, the game WILL become a slideshow to the point the internal clock will desync and your daily reset timer will drift (or at least that's the explanation I've heard for why my timer keeps drifting), and it MAY crash on low-end PCs. The developer [i]could[/i] cause loot to group into piles or disappear sooner, but intentionally doesn't do this.\n  [*]I had previously stated that clicking the daily purchase popup would clear your offline games, but the developer has correctly pointed out that this doesn't happen since the popup only appears in town. However he did not address the fact that many achievements cause you to earn premium currency, and instead of putting these straight into your bag or \"wallet\" like a normal game, the game drops these on the ground which means they [i]will[/i] be cleared if you click on a popup.\n [*]Here he is nitpicking my wording--Apple may not have rejected the game for the gambling, but that may simply be because he made the change in alignment with their policy before submitting it. Either way, the outcome is the same--the free pity timer is ludicrously long for no good reason.\n  [*]Again, he has nothing to say about the dark pattern of asking if you would like to purchase something for free (why would that need a confirmation box?) or the fact that there's no way to contact him since he doesn't check his email. He's just claiming \"players wanted free items\" which doesn't even address the point.\n[/list]",
      "voted_up": false,
      "votes_helpful": 208
    },
    {
      "review": "Aight, the game is good, fun and addictive.\r\nBut people are NOT joking when they say the developer is greedy, in fact they are understating it. People saying that \"God forbid a developer wants to earn some money on his game\", sure i get that.. But lets bring some examples on the table.\r\n\r\nSo firstly, obviously if you wanna play the game at the minimum, you need to throw money into the first bundle for the primary feature of auto loot pickup while AFK.\r\n\r\nThe shop by itself adds CRAZY upgrades, we're talking several 10000x stat increases through various means.\r\nThen there's the limited availability bundles which adds unoptainable features for F2P that are broken beyond belief. The shop is mandatory unless you're fine with never ever \"completing\" the current game and surely not with extra added content. Speaking of, also all the added contents always adds features to the shop, thus, reasons for developing. \r\nBy playing the game, you can tell how many are buying these bundles and how many FOMO whales there is, so obviously he is making cash while being ONE guy eating all the profits.\r\n\r\nAlso Ingame, there's quests which requires him to visit his youtube channel, obviously this is for $$$.\r\nThen here's the f****ed up part. He does weekly+ twitch streams where he does raffles for players who has spend money in his shop while simultaneously begging for twitch prime subs/subs and then do exclusive raffles for subs as well, and then he f****** run ads every 5 mins... He does not f*** around when it comes to figuring out ways to make them $$$.\r\n\r\n\r\nSomething is terribly wrong with this guy or he is in massive debt and can't keep up... My fair bet is he's got a gambling problem and just can't make up for it... The game certainly shows he knows A LOT about gambling.",
      "voted_up": false,
      "votes_helpful": 97
    },
    {
      "review": "After playing this for almost 5 years, I've watched it go from a fun passion project to a FOMO gambling game. It's essentially single player, so in the end it doesn't really matter and you don't need to buy anything to play it, but it leaves a bad taste in my mouth. You can tell a lot of the new mechanics are built in with dependence on the cash shop. As was the previous update.\r\n\r\nThe dev has a sore spot for this type of sentiment it appears. Lava, I'm sure you can find a way to monetize the game without it being so predatory.",
      "voted_up": false,
      "votes_helpful": 92
    },
    {
      "review": "I dont usually leave reviews but after engaging with the comunity about the killroy changes which were uncapped since their release and other greedy choices in recent updates (such as the bonuses for having 5 copies of a nametag) I ended up being muted by him without a motive just simply to silence any backlash about the updates.",
      "voted_up": false,
      "votes_helpful": 124
    },
    {
      "review": "You can probably tell by my playtime that I don't like having to write this review, but alas.  \n\nThe game has tons of charm, content, and fun to be had for nerdier folks that like to optimize their numbers going up, but it is marred by everything surrounding it, from excessive and predatory monetization to awful community mismanagement.  \n\n[h2]The positives:[/h2] \n\nThe art style is incredibly charming, with every map featuring a new adorable creature you must murder for the sake of loot and progression. The music is likewise lovely to listen to, though you'll likely be muting it if you play long-term. The writing is full of dorky references and jokes, which can sometimes be a little cringy, but they're fun and the game doesn't take itself too seriously, which I personally am quite fond of.  \n\nThe game's progression is incredibly deep and layered, but you always have a simple goal to help keep you moving forward: kill enough enemies to progress to the next map, all the way until the world's boss, so you can open the next world. This keeps the game from becoming too overwhelming too quickly.  \n\nEach world (7 at the time of writing) has 3 main skills (7 currently only has 1, with more coming soon), with additional secondary mechanics also being spread throughout. Skills in the same world tend to be interlinked with eachother, creating a feedback loop of improvement, which makes working on each skill satisfying and rewarding. Later skills also often improve ones from previous worlds, meaning each world continues to stay relevant even as you unlock new ones. All of this, alongside additional subsystems, which tend to be more independent, and getting to manage up to 10 characters all at once, each with their own proficiencies, means you've always got something to do to improve your account, and it makes for a fun game of managing what you should improve next to maximize your gains.  \n\n[h2]The negatives:[/h2]  \n\nThe game is incredibly buggy. Mobile players especially tend to receive the worst of this due to the limitations of the mobile client, things like damage and experience rates rolling over into the negative, sometimes locking them out of the game entirely due to crashes. The performance can also be pretty terrible at times. No game is perfect, and bug fixes do happen every so often, but it's prevalent enough to be a significant mark on the game.  \n\nThe late game experience is full of unpleasant game mechanics and optimizations that take the joy out of progression. Things like Tower Defense taking literal hours for a single wave, because the enemies can't kill you, so you just have to wait until your puny damage kills them to set a new high score (which comes with account benefits). Or \"Candy clicking\", using Time Candy to obtain billions of materials which you can't reasonably hold all at once, which means you have to repeatedly fill up your inventory, then stash it to your bank (p2w mechanic, will cover shortly), to then improve your stats dramatically beyond what a player who does not engage in this tactic can reasonably achieve. Or the excessive overreliance on daily logins and activities, where opening the game for five minutes matters more than actually playing it sometimes, and makes Golden Stopwatches, which function simply to trigger a daily reset, one of the most powerful and sought after consumables in the whole game.  \n\nThe game is incredibly pay to win. A mechanic in World 4 checks various statistics across your entire account, and gives you a score, which is then compared to other players. As of 1.0, this mechanic now gives extremely powerful rewards, which, coupled with the immense power of cash-exclusive benefits, makes this p2w in the purest sense of the phrase.  \n\nAs for the benefits themselves, they come in layers. First is the gem shop, which is technically accessible to everyone. However, gems can be purchased, the benefits in the shop are very powerful, and the developer has been continuously, silently nerfing the ability of players to earn gems for free, making purchasing gems more and more enticing. Especially once considering that there's a rotating \"fomo shop\" that's incredibly difficult to buy out regularly if you do not purchase gem packs, even without having to think about the permanent content.  \n\nThen there's the gem packs themselves. Each one offers some kind of item equippable by your characters, and also often come with permanent account boosts. Some of them are as simple as multipliers to various stats, some come with unique mechanics and benefits to specific skills or subsystems. As of world 7, any package that comes with a Trophy or Nametag now essentially comes with another account boost, as these items are no longer required to be equipped, and work across the entire account. Not all packs are made equal, but pretty much every pack in the last 2 years has dramatically increased the gap between a free player and someone who purchases every new pack, with seemingly no intent to change that. The results of this gap can be pretty clearly felt in World 7, where huge penalties are in place to slow down progression, but paying players can overcome them much easier because their damage, drop rates and even AFK gains are multiplied by absurd amounts, and they have a surplus of gems to spend on the new gem shop upgrades to improve their skilling and obtain gains much faster.  \n\nCompanions get their own section because fuck gambling. This is technically accessible to everyone, but non-paying players get to try the roulette [i]once a week[/i]. The only way to get more spins is to pay real money for crystals, which are just green colored gems with no free alternative. Each companion comes with account boosts, with the common ones being really mediocre if not outright useless, and the rare ones being very strong and desirable. The free player, of course, will get 90% commons, with duplicates being very common, which free players get absolutely no use out of. Paying players can actually trade their pets with others or gift them, and they also have access to a pity system, meaning they will eventually get what they want, even if it costs them $200 to do so. Disgusting mechanic and it's not getting any better even 2 years later.  \n\nAll of this complaining I've done already would not fly in the game's official Discord server, as the developer is incredibly fond of censorship of dissenting opinions. With how complicated the game gets later on, it lives and dies by its community, which the developer has no issue trampling on, as a major contributor to the wiki has recently been banned with no reason given and no ability to appeal. The fallout is going to be very interesting to see.  \n\n[h2]Conclusion:[/h2]  \n\nIt's a game I love dearly, but I refuse to financially support, because what happens outside of just the game itself matters to me, and what's happening is incredibly foul and indefensible. It's fun to hop on whenever a new update arrives, but I'll inevitably get burnt out again doing my 30th day of wage slaving for a meager sum of gems and become disillusioned by the game yet again. Don't play this unless you have money to throw around or have an easier time tolerating bullshit than most people.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "This game used to be the best Idle game in both on steam/mobile and here's why:\r\n- Great music\r\n- Great gameplay despite many bugs or confusing description\r\n- There is so much to do\r\n- NO PRESTIGE/RESPECT. Yes number just keep GROWING (BIG HAPPY)\r\n- Is a $4.99 game. If you plan to play this game \"seriously\" pre world 7. Just get the Auto loot pack else you can forget about playing this game.\r\n\r\n\r\nWhy I won't recommend playing this game after world 7 (ver 1.0) release and here's why:\r\n- Companion mechanics that was introduced in 2023 is the 1st ever mechanic that you can't BUY using free gems (which you could farm) that have OP mechanics that will change the way you play the game or until you get lucky and get \"King Doot\". \r\n- World 7 introduces the most FOMO + P2W mechanics that requires multiple nametags for tremendous of gains (rougly 500% gains provided you maxed all nametags)\r\n- Shadow nerf ways to farm gem\r\n- Devs shifting focus from making a new fun mechanics to P2Progress mechanics that incentivize spending real money or gambling\r\n- 30/11/2025 introduces another FOMO + P2W mechanic called (Hat Rack)\r\n- Break promises or constaint lies (world 7 releases, less clicker mechanics etc)\r\n- Voicing out/critic the game/dev will results in ban both on Discord or Reddit",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "While progressing through the game initially feels rewarding, the amount of p2w and powercreep added in each progressive update is ridiculous. The dev continues to gate powerful bonuses behind paid bundles and every piece of new content seems to exist just to powercreep previous mechanics.",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "If you are looking for an overall pleasant experience, you aren't going to find it here, not anymore at least.\nThis game is really \"Death From A Thousand Cuts,\" for me.\n\nbugs: seldom gets fixed.\n\nthe dev. simply doesn't know what \"optimisation,\" means. and this game is from start to finish, in dire need of it.\njust walking around, can cause lag. killing a single mob - lag. essentially every single action you can perform, can cause lag, because actual optimisation is a myth, or something, in the devs. mind.\nso prepare for rather lag-infested gameplay, regardless of what you do. - smooth gameplay is not something that I have, regardless of what I do, including just walking around.\n\nwhich makes you want to avoid other players on mere principle, cause they will eat your frames regardsless of PC prowess overhead!\nI only have a 12th gen i5-12400F CPU and an RTX 3070 grfx. card. but using 50% of my CPU and less than 25% of the GPU, I literally have ~2 FPS in idleon. this can be caused by players alone!\nand neither the NVMe system disc or NVMe steam/idleon disc is stressed, nor is anything else of my system.\n\nthe optimisation problem however, really occurs when you have certain game features with so much stuff happening, that even without players present, the game itself, can't handle it, and now you are losing frames, which literally hampers your progress! I did better with less stats because I didn't lose frames, than I did with significantly better stats, because of a lot of lost frames! and died prematurely as a result, and got nothing for my daily attempt.\n\nthe amount of FOMO (Fear Of Missing Out) that this game is using, is insane!\nthe amount of gambling mechanics there is at play here, is equally insane!\n\neven something that should be free, costs 5 USD: Auto-Loot.\nYes, a game that is literally about amassing hundreds of millions of items, does not include automatically picking up your loot.\nThis loot will also auto-vanish after 60 minutes. ohhh, you were fortunate enough to roll that 1 : 1'000'000 chance (yes, some items in the early-game really has this low drop chance) item and you failed to pick it up yourself, well, better luck next time!\n\nBundles that this game has, amounts to several hundreds of USD. bundles you can't pick between as you wish. no, you need to purchase them in order! for 20 USD each.\nso a specific bundle could literally cost you 100 USD because you need to buy the 4 prior bundles first.\nthese tends to grant a very! powerful permanent buff to your account, and some times a very powerful piece of gear!\nnone of which can be acquired by any other means.\n\nThere is a pet system in this game, that when first introduced got declined by Apple and thus failed its launch on iOS devices.\nthis got fixed by introducing a pity system. (that for the first line of pets (Legacy pets) will take you 200 rolls (equal to 200 weeks of playing the game for free))\nI only just today got my first free legendary legacy pet (more than a full year of rolls (plenty of my guild mates has yet to hit their first one)\n(this one pet is so powerful and such a huge QOL improvement that it basially has to be experienced to really fathom how powerful and big QOL improvement it truly is))\nThese sets of pets also gets rolled out of the game. so for all new players, the second set of pets, you will need to acquire by trading with other players, using pets that you both can acquire.\nBut only pets that you purchase with real money, is tradeable.\nyou cannot earn this currency for free.\n\nthis on top of the steady nerf to free gems acquisition.\n\nbut of course there are exclusive FOMO pets: you weren't around when they were a thing - sucks to be you.\nadding to those: there are: \"you need to subcribe to the devs. twitch stream, and watch his streams to even qualify for optaining them.\" pets. while also having to suffer ads. (just for a very low chance of ever getting one of these pets)\nyou need to win the roll against everyone else who also rolls, and you can of course have more than one of them, so no: \"well, eventually everyone else will have one, and I'll win by default.\" - nope, not happening.\n\nAdding to this is an Arcade with a lot of powerful bonus' to, pretty much every single aspect of the game, that rolls between different sets of bonus', by a \"game update\" time-scale (this could be weekly, monthly, yearly, or even bi-yearly). which again, means you will be waiting a VERY! long time before you will have had a chance to even get all of these bonus'.\n\nThe dev. has also stated that (and I quote!): \"I like the idea of seasonal events. And enjoy seasonal content.\"\n(which is why we have the events that we do)\nboth Collins Dictionary and Cambridge Dictionary will argue that this is something that we do not have or get, since the events do not occur within a set time frame. a seasonal summer event, would need to occur every summer, for it to qualify for being 'seasonal', else it's just a themed event.\n\nthese events, even if they return, do not return with the same stuff. so, you missed out - you missed out! - sucks to be you! so yea, that insanely nice permanent bonus that other players have - you can't get!\non top of that is a feature in w4 literally making you compete against other players for some permanent bonus'. which involves you being amongst the top 0.1% of players!\nand the more of these FOMO things you are missing that counts, the more points you need to acquire in other areas of the game, of course, even more points than other people who has these FOMO things available to them, have.\nadd to that, the amount of people who literally cheats in the game. (seeing a level 60 fully equipped with level 200 gear makes such a thing very obvious)\nand yea, nothing is being done about this in any capasity. again, you will be competing against such players, for that bonus at the 0.1% of players threshold.\n\nthis was also something the dev. said, when he added the mechanic that he wouldn't do. the whole: which percentage of players you were amongst were: \"just for fun.\"\nI guess: \"just for fun,\" in dev. speak means: 'a relentless competition, even against non-legit players.' (anyone who has played any modern FPS game, legit, will state that: playing against such individuals is anything but fun)\n--\n\non a different note however: the amount of daily, weekly, and bi-weekly stuff to do is a very long list, futher made anoying by not have a single weekly reset.\n\nso be prepared to need a list in order to keep track of stuff you need to do on a daily and weekly basis.\n\nthis is a: this thing resets on thuesday. this other thing on thursday.\nbasically there is a weekly reset for something, every single day.\nand the list just keeps growing.\nhypothetically: with enough time - the day will be too short to do every single daily task in idleon.\n\nalready now, depending on your focus, you are spending a couple of hours, on daily stuff.\nso, for the average gamer - your gameplay will eventually consist of doing nothing but dailies.\n\none anoying bug though is: charactor amnisea!\na feature in w3 will have you equipping various bonus' along with a \"curse\" (a debuff). and often times, your charactor simply has forgotten what they had equipped. e.g.: extra carry capacity. you can now carry 2000 green spores per inventory slot. next time you log on to that charactor, you can only carry 800 green spores per inventory slot. despite knowing full well that it was 2000 when you logged out. going back to town and re-equipping the buff (literally un-equipping and re-equipping) and all of a sudden, you can stash together 2000 green spores in the same slot, which means: your character literally forgot that he had something equipped.\nyou will unlock stuff to have 20% (eventually even more) of all the effects at all times, if not using any. but even this, doesn't actually solve the problem. because remembering you have nothing equipped is still too much to remember, and this has existed for years!",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "I left this game a long time ago.\nWhenever I read about it, I only see people mentioning how bad and greedy the developer is. Which is true.\nWhen someone criticizes him or his game, they get banned from the discord, despite spending thousands of dollars. \nI heard about a guy who spent $10K trying to get the King Doot pet, without getting it. He was banned from the discord and was never heard from again by friends. He most likely ended it.\n\nThe developer is most certainly exploiting people with gambling addictions. How many have to die to put an end to this? And to the fan boys keeping this game alive, no. I don't even wanna hear your delusional cope. To the \"Mostly Positive\" reviews, I know you pay for these.",
      "voted_up": false,
      "votes_helpful": 88
    },
    {
      "review": "It was okay until they forced ads for microtransactions that cover half of your screen and the only way to close it so it doesn't interfere with normal gameplay is to click it to view the microtransaction store. They don't have an X to close or hide it... you literally have to click it or have half of your screen blocked.\n\nDon't waste your time with this game... there are better idle games out there.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "This game used to be great. World 1 through World 4 was a dream, a proper challenge, and was fun to progress. The micro transactions and monetisation were always a bit much but it's just become so much worse over time.\n\nThe introduction of the pet system was the beginning of the end with overpowered benefits being locked behind incredibly low chance RNG (originally without a pity system) that highly encouraged spending. Now more and more crazy multipliers are being locked behind actual money purchases and not even possible with premium currency. There is now a very explicit divide in the playerbase between those who spend and those who don't and it makes the community aspect of the game unenjoyable. \n\nThis final release of world 7 nerfed one of the main ways to earn premium currency in game each week (killroy). This method actually required a massive investment of ingame premium currency to ramp up and was an incredibly endgame method but even then the dev has decided to remove it. No refund of the invested premium currency either to somewhat lessen the blow. \n\nThis game was something special and I spend a couple hundred over the years to support the dev but their greed has ruined what this game once was. I am very sad to see how things have turned out and I can no longer recommend this game.\n\nTLDR\nGreed by devs has ruined this game",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "An amazing game with an immense amount of work put into it, ruined by the presence of microtransactions.  There is no part of this game that cannot be sped up by spending ludicrous amounts of money on it. Until the dev (lava) makes a serious change I will not be coming back.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "No game integrity after years of waiting. \n\nI’ll keep this simple, it’s a fun game with lots of great animations and funny story. My biggest issue is the game has tons of micro transaction, beyond normal standards it pretty much make it pay-to-win. Nothing is required to buy in the game but the upgrades save lots of time and add major quality of life advancements if you don’t. \n\nSo, are you a whale with lots of money? Great! Spend your money… but the majority of players just use cheat engine to modify the in game currency ‘gems’. It takes 2 minutes to modify your game data to get unlimited pay-to-win gems to just buy everything that would cost hundreds if not thousands of dollars. \n\nThere is no integrity in the game so your hard work and achievements mean nothing. As an experiment I was able to get to world 3 in 2 days by duping time candies and gems.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Of course the dev had the audacity to add \"exclusive\" pets, its not like some stuff is already gatekeepen by paying.\nOh and let's not silence the word of the people",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "It's really disappointing to see the game I once liked turned into a P2W cesspool akin to mobile games.\n\nI first played IdleOn in late 2021. The progression was great, the graphics and design of the game felt good, and the Dev seemed to care a lot about the growing playerbase. The systems were good and fair. Since the game was free, in-game monetisation was done through a premium currency used to buy perks that help make the experience easier and shorter to cut back on some idle aspects of the game. This currency could be obtained completely F2P, so any player would eventually be able to benefit from these buffs and account upgrades, which further motivated players as a goal to work towards if they wanted to save their money. There were some strictly paid purchases in the form of \"account packs\" that give certain permanent bonuses or cosmetics that give account buffs, but these were fairly minor and seen as a way to support the dev. The most common one being \"auto-loot\", which was commonly regarded as being the \"paid\" version of the game, allowing you to truly idle in a lot of elements was regarded as fair.\n\nOn popular holidays, new premium packs would release, each hovering around their $20 USD mark, providing benefits, becoming increasingly stronger as the packs released. In my opinion, this is where it all started going downhill. A bit later, pets are introduced into the game, companions that give you account wide powerful bonuses that are rolled through a gacha system. There was a pity system, and free users would get one roll a week, but anyone caring for leader-board positions would quickly realise that whaling for them was the only option. As the months went by, more predatory and time-gated systems were introduced, including holiday-themed gacha wheels and limited time shops, all encouraging players into giving in and purchasing the in-game currency as to not miss out on these once in a lifetime purchases. It was specifically targeted towards players who suffer from the fear of missing out, which felt scummy and unfair, as a few years ago, we had been promised that money would never dictate the direction the game would take.\n\nAs the months continued to pass by, more paid systems would be introduced, more gacha pets, more gambling. It became a cesspool of how quickly you could spend your money. Each new pack would essentially double your account strength, being able to skip massive portions and completely outscale anyone that chose not to. This being a community driven game let to people being felt cheated and manipulated just to keep up with everyone. If you wanted some limited items or bonuses, you were FORCED to pay for them, despite it appearing as obtainable completely free.\n\nAnd we're here today. The game is good. If you can play it with a singleplayer mindset or with some friends and not worry about all the other things and don't get affected by FOMO, then it's a good idle rpg to get into. Be prepared for the long run, because it would take literal years to obtain some things; where a simple 20 dollars completely negates the grind entirely. My review is a negative one, because I am tired of pretending that these predatory tactics aren't an issue being normalised, especially in a game that was once so pure.\n\nIt's really disappointing to see the game I once liked turned into a P2W cesspool akin to mobile games.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Cash shop is the definition of pay 2 win and pay for super Convenience (Example: Auto loot)",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Overall Scummy game using a LOT of gacha mechanics and gambling. Many of the games requires of leaving the game on to do things is very typical of idle games, but this has WAAAY too much micro managing. Don't expect to get anywhere idling.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Game originated from dopamine F2P rush to FOMO P2W rush upon release of W7. Though the game is addictive , awesome and cool, do not get into this game unless you want to dump thousands of hours into the game, run it 24/7, whale hard, and still get behind from Day 1 players and mega-whales that somehow always have all limited edition stuffs that are sorted through raffles.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i have been playing for 606 years, and then my laptop broke, i switched laptops and now all my data is gone, and the dev just said ''data gone? impossible (unless you switch steam devices lol, then its just perma gone) this is very dumb and annoying.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Early on when this game was first released, I loved it. It was the perfect balance of not being too overbearing and being interesting enough to want to play actively as opposed to mostly playing idle, ironically enough. \n\nThe content was great, the progression felt good- but at some point with all of the updates, it became more of a chore than an enjoyable session with each log in. With every additional world there became some new systems to master which of course required a lot of time to complete and always made me felt set back as I encroached towards whatever end game was considered at the time. \n\nIf I recall correctly this game was much inspired by Maplestory, and much like Maplestory, it seemed to has lost its appeal, charm, and simplicity it once had early on in development.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "A waste of time compared to other idle/clicker games. Awful quest design, relying on juvenile humour and unreasonable objectives to complete. Every so often when in town the game also will blare a massive ad banner to purchase MTX/premium currency that has no way of being turned off. Finally once you get to around world 4 the game becomes a non-stop micromanaging hell of trying to complete 50 seperate daily objectives spread across your 7-10 characters you have unlocked. \nWould not recommend.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "P2W cash grab developer, now begging on discord to write a positive review. Maybe stop the P2W packs if you want to change the reviews.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Just a note, most of my playtime is on the phone client because this is more of an \"active\" game than an idler, and I want to actually actively play actual games.  This is also a negative towards the game: you have 10 characters who can all get gains while not logged in (as you can only have one logged in at a time) and this can be 200%+ the time they're offline (i.e. 2 days per day) but you get an insane amount more progress by just AFKing with auto toggled on.  Like, more than all other 9 characters getting double gains combined.\n\nThis (negative review) is something that's been building for a long time.  The time to start playing the game was years ago, as every patch brings a new nerf to something that gave people advantages that they'd been using since the last patch or longer.  Balance, in this regard, is driven more by dev greed than anything that is beneficial or fun to the players.\n\nTo give you an example of an early nerf: \"Gems\" are the premium currency.  You have the ability to gain gem drops from bosses.  There exists a class that can gain double drops from kills.  You could gain gems and double them, by killing bosses on that class.  The amount of bosses you can fight is limited per-day, either because they have a respawn timer or you must gain keys in order to fight them, and only so many can be claimed.  This was double or arguably triple nerfed: First, a per-kill limit was added.  Then, a daily limit was added which as far as I can tell tapers off.  This means if you were somebody that did not abuse this, all of the keys and summoning items you had saved up have become useless in that regard.  Finally, additional difficulties of bosses were added - you need additional keys to summon them, and eventually unique and desirable drops were added for those variants specifically.  So tl;dr: If you got in early, you could have earned literally tens of thousands of dollars worth of the premium currency, for free, by fighting the bosses - using completely intended mechanics that the dev decided he didn't like.  This is no longer possible.  The ideal solution it seems to me would have been to scale gem prices as you advance worlds.  This did happen.  Gems were not made more affordable, however, just less accessible.\n\nI have spent money on the game because I once found it an interesting take on a numbers-go-up formula, but the recent changes are just awful.  I've picked up on some talk regarding tackling cheaters, who have been rampant (and likely still are) one currency was added some time ago which is confirmed server-side, but there's also nothing to stop you from just cheating in the rewards you'd buy from it, as I've seen account \"reviews\" of people who have done just that - example, having a contest-exclusive pet, when they were not announced to be a winner.  Before trading was enabled, by the way.  I have also seen players in-game using equipment that is supposed to be exclusive to the dev himself.  I do believe there's an option of \"shadow-banning\" where those players, at some point, simply can no longer be seen or interact with others.  However, this point is important because the latest world feels, more like any other, to be balanced around people who have impossible stats.  Your own stats have been knocked down considerably in progressing in the new world due to massive bloat, meaning your progress as a legitimate player is a snail's pace.\n\nWhat's really aggravated me is the recent changes to statues.  They are now entirely gained actively.  Before, you could gather a lot of specific statues by being idle - the resource-based ones scaled to an insane degree compared to the kill-based ones (which, the \"drop chance\" in this game is another long-standing issue that has intentionally never been addressed) that is to say, they were able to be gathered easily.  A new mechanic was added, where if you gather 1,000,000 of a statue (quite a high amount) you can get a point for a new market.  Since the resource statues were moved to kills, this has become inaccessible for a long time for a lot of the players.  If you weren't there already - oops!  This is just one of many such changes that feel designed for a select portion of the playerbase that is beyond endgame, and has been beyond endgame, for literal years.  Oh by the way - the previously easily accessible statues are gone but you can spend like $30 for 2x statue drops!.. which still wouldn't put you at the amount people were earning before.\n\nSo, short of it is: I would not encourage anyone to start this game now.  I would not have encouraged anyone to start when I did, and it's only been more nerfed since.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Use to really enjoy this game and I didnt mind buying some bundles to support the dev. \nBut 20$ price tag is absurd. \nThe solo dev has made the game extremely P2W almost requiring you to buy every bundle if you ever want to progress. \nReleases world 7, with 3! new 20$ bundles. A week later releases another extremely over powered bundle for 25$.  Keeps increasing the prices cause he knows people are dumb enough to buy it to make there numbers bigger in an irrelevant game. This was a fun idle game that got ruined by greed and FOMO. \nHighly recommend you spend your money on actual games. Think about this Hollowknight Silksong is 20$. For 20$ you can actually PLAY a game. Dont spend 20$ make numbers bigger in a idle game that you will eventually never play again. Do not recommend 1 Star, Game actually sucks.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "메이플 느낌\n\n게임성은 모바일 게임을 그냥 컴퓨터로 하는 느낌입니다.\n\n번역은 100% 번역이 아닌 일부 번역+ 번역기 번역도 몇몇 있는 것 같습니다.\n\n초반은 그럭저럭한데 점점 현질유도가 심해집니다.\n\n자유롭게 키우고 맵 중간중간 미니게임도 있어 컨테츠는 나쁘지않지만.\n현질 유도와 캐릭터 강화를 위한 노가다 심지어 맵하나 넘어갈떄도 그 맵에 몬스터 몇마리 이상 잡아야 오픈이됩니다.\n\n캐릭터 한명을 키우려면 여러 강화 자재가 필요한데 모든 캐릭터 아이템 공유가 가능해 여러 캐릭터로 자재 몰빵해서 한 캐릭터 키우기가 가능합니다.\n\n가볍게 하기에는 여러모로 빡센 게임입니다.  현질+ 노가다 좋아하시면 추천드립니다.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Don’t let my hours fool you. The game incentivizes “AFK” play, meaning it’s designed to sit open in the background while you do other things. There is actually little to do in the game outside of micromanaging poorly designed systems, and seeing numbers get bigger.\r\n\r\nIt can help pass the time when you’re bored, but it isn’t a good game. Lots of game-breaking bugs, major systems feel half-finished & repetitive, monetization is predatory, and player time is usually disrespected.\r\n\r\nHere are some examples that I've tried to explain in a way that you can understand if you're new.\r\nTLDR though; play if you want, but when you hit the point that you need Autoloot? Quit, and just go play maplestory. Nexon will treat you better. (Shocking, I know.)\r\n\r\nExamples of Problems\r\n- Daily minigames and multipliers\r\nYou can build up reward multipliers by skipping a day, but two major issues ruin the system. If you crash (and crashes are common) you lose the run and the multiplier. And because the minigames are pure RNG, a single bad roll can also make you the run and the multiplier. Days of multiplier buildup just gone with very little (Or nothing) you've gained. The game also literally insults you when you fail, which gets old fast.\r\n\r\n- Severe lag\r\nWhen the game lags, it slows to a crawl and behaves as if you’re offline. Attacks cast slower, kills drop, UI interactions break, and the game can freeze your entire PC until you restart. For something meant to run in the background, this really should have been fixed years ago.\r\n\r\n- Pay-to-win\r\nI don’t mind P2W packs since I treat them like I would a FFXIV subscription, but the presentation of most P2W elements is just awful. For example a past event introduced a limited-time nametag with major drop-rate multiplier. If you didn’t play or gamble for it during that event, tough luck. You’ll never reach the same progression curve as people who did. Oh, and you also needed to gamble enough (with money) to have won it 5 times since the newest updates introduced a \"stacking\" system for name tags. You wouldn't have known this at the time though.\r\n\r\n- Gambling everywhere\r\nPets are obtained through RNG rolls where high-tier pets drastically change gameplay, and you will likely never get them unless you're willing to spend at-least $50+. Events always have a “Wheel” with only a couple worthwhile prizes, and the best ones are never brought back into the game. The game advertises “guaranteed” rewards for F2P, but unless you bought packs or extra spins, you couldn’t actually meet the threshold. This creates constant FOMO and pushes players toward spending even more money. Not to mention that past events had a guaranteed win system that repeated. Once you got the guarantee the counter reset. Now the most recent event completely removed that system. You get 1 guarantee. After? You gotta gamble a LOT.\r\n\r\n- QoL problems\r\nMany systems are outdated or poorly designed. Some require repetitive clicking (Or tapping on mobile) for long periods which I am sure is not good for your wrist. Newer systems rarely have a reset option, so a single uninformed mistake permanently locks you out of progress. \r\n\r\n- Artificial progression walls\r\nThere are many fake walls, but the best example are the new \"MasterClasses\". These are the final job advancement for a specific class. They do not release with a way to gain the class's currency while offline. Instead if you want to get class currency you need to exclusively play them, and then when the next update is dropped that's when the offline mechanic is introduced. It's a system clearly designed around artificial inconvenience just so players don't progress as fast on these classes. The most ironic thing about it is that usually you can catch up to people who have played that class actively since released because of how the offline mechanism works; so unless you REALLY wanna play the class; don't bother. Just wait for the next update.\r\n\r\n- Developer relations\r\nThe developer removes negative reviews anywhere he can, and he'll also ban whoever said them too if possible. Giveaways used to be cosmetic; now they grant permanent account boosts and are often given preferentially to Twitch subscribers or Discord users who advertise for the game (Via the tag system.) Arcade currency multipliers are determined through twitch chat “games” where the developer rarely actually polls the chat for answers; he just picks them arbitrarily based on the most \"common\" answer he sees which strangely enough is usually the wrong answer.\r\nOne recent example of this was him playing omok with the chat. Chat was gonna lose every game so he decided to just give a 1.8x multiplier instead of continuing to play. There was some backlash (And the game was surging in popularity at the time) so he decided to alter that multiplier the next day up a 2.2x multiplier. If you had saved up arcade currency for months (Or spent money to get more currency), and spent that currency to gamble the day it was 1.8x then too bad so sad. There was no retroactive application or anything like that. You just lost out on 22% of what you should've had to begin with. \r\nOh, and if that wasn't bad enough all of the newest Arcade bonuses also cost 10x more than all of the other ones. This is a new change, and I believe was designed around incentivizing people to gamble with money instead of F2P currency. Generally there are just a lot of patterns that show a consistent disregard for players/money/time.\r\n\r\n- Multiplatform issues\r\nThe game claims it has cross-platform support, but that only works early game and only if you’re not logged into another device. You must manually cloud save or you'll lose progress with no warning. Mobile also suffers from number overflow bugs that can convert offline gains into negative values and permanently delete resources. Damage overflow still happens as well, but is now more of an end-game issue because of the latest update.\r\n\r\nThere are more issues: misleading claims about F2P premium currency access, overpromised roadmaps, and the fact that autoloot is effectively mandatory. But the problem is just that the game constantly wastes your time, pressures you with gambling, and offers little respect or reward in return. \r\n\r\nIf you do choose to try it, treat it like a throwaway idle title and avoid anything involving premium currency, wheels, or other gambling mechanics. Gambling is a very easy thing to become addicted to, and this game tries its best to be that addiction.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Idleon is a genuinely fun and creative idle MMO at its core, with tons of depth and charm in its gameplay systems. However, the monetization is extremely aggressive. There’s no PvP or leaderboard competition, so technically it’s a single-player experience—but the pay-to-win and FOMO-driven shop mechanics make it feel very predatory.\n\nThe biggest issue is the lack of any real catch-up system for missed limited-time packs or exclusive items. If you don’t buy them when they appear, you simply fall behind forever. This caters to the type of person who is prone to gambling and guilt driven purchasing decisions. \n\nIf you’ve got disposable income and don’t mind spending, it can be a great long-term idle game. But for true free-to-play players, it’s unfortunately not very friendly or sustainable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great artstyle, Great Concept. Great base game.\r\n\r\nBut if you want to be f2p and chill, the game is going to force you to click into the microtransaction shop twice per day with NO option to turn it off",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it's high time i let go of this cashgrab clownfest. Between the obnoxious amount of game breaking bonuses you have to pay real money for and the new packs dropping every week that you would need to buy to max out your bonuses this game demands you put a good 50€ à month in if you want to max out your account. i had dropped it before thelatest big update, thinking feedback would be taken and stuff would change, but no it's as cashgrabby as ever. cherry on top is that some grind mechanics have now been nerfed for the players so we get less rewards that allows us to bypass some of the moneylocked content. out of this world level greed.\nStop playing before you get absorbed in its disgusting fomo machine.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Great Idle game that will give you hours and hours of things to grind actively. A lot of dopamine.\r\n\r\nHowever, recent developments have seen the rise of predatory techniques: limited time lootboxes, competitive PVP (tome score) that transformed a pay to speed to a pay to win.\r\n\r\nI unfortunately spent hundreds of dollars when it was still pay to speed, and I regret it now that the dev has decided to head in this direction. Beware",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The first world is fun and well paced. You will constantly unlock new stuff, meet new enemies and you will feel like progress is being made with every action .... but it just goes down after that. \n\nHit chances can go from 100% to 20% in the next map, requirements are scalled to ridiculous levels (kill 20,000 of these mobs to progress) and the upgraddes are less and less meaningful (sometimes even like 0.005% upgrade for 2 hours worh of currencies).\n\nWhat really broke the camel's back for me was when this always online game didn't save my progress and a 1:100,000 item that dropped for my main was missing the next time I logged in.\n\n\nEdit: I have to admit, that it is stupidly addictive",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm writing this to express my frustration with the direction this game has taken. I was one of the early players, and back then it was genuinely fun and full of potential. After taking a two-year break, I returned to an ad-filled mess with legendary pets that are basically nonexistent unless you either gamble for a tiny weekly chance over hundreds of weeks or pay real money.\n\nThe monetization has become downright predatory. The “auto collect bundle” is another example it feels less like an optional feature and more like a requirement if you want to progress at a normal pace without micromanaging the game every 10 minutes. Without it, items pile up, cause lag, and slow your progress dramatically. Meanwhile, someone willing to spend a few hundred dollars can surpass 99.9% of legitimate players at a ridiculous speed.\n\nThat’s my piece. I used to think much more highly of this game, but sadly, it has changed for the worse.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The idea of the game is great but every single little thing has micro transactions attached to it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Used to be a great dopamine factory game that played similar to a stripped down idle Maplestory. There were some very small purchases necessary like auto loot. Dev used to have a message about never selling out and going p2w as a mission statement which was wiped. I stopped playing when some of the more egregious whale baiting p2w updates were added. Apparently it's only gotten worse. The amount of power you can swipe to get is pretty wackadoodle. Would have been fine if the game was a p2w micro transaction paradise to begin with but the compromising of his original intentions/morals left a bad taste in my mouth.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I don't know if its just me, but the whole design of the game just leaves a bad taste in my mouth. You have to do so much to attain nothing, unless you pay for the game to hand you progression in a \"limited time offer\" before immediately serving you another road block.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "̶I̶ ̶h̶a̶d̶n̶'̶t̶ ̶p̶l̶a̶y̶e̶d̶ ̶t̶h̶e̶ ̶g̶a̶m̶e̶ ̶b̶e̶f̶o̶r̶e̶ ̶i̶t̶s̶ ̶o̶f̶f̶i̶c̶i̶a̶l̶ ̶r̶e̶l̶e̶a̶s̶e̶ ̶o̶n̶ ̶S̶t̶e̶a̶m̶,̶ ̶b̶u̶t̶ ̶t̶h̶e̶ ̶g̶a̶m̶e̶ ̶i̶s̶ ̶r̶e̶a̶l̶l̶y̶ ̶c̶o̶m̶p̶l̶e̶t̶e̶.̶ ̶I̶t̶ ̶c̶a̶n̶ ̶d̶e̶f̶i̶n̶i̶t̶e̶l̶y̶ ̶b̶e̶ ̶p̶l̶a̶y̶e̶d̶ ̶i̶d̶l̶e̶,̶ ̶b̶u̶t̶ ̶y̶o̶u̶ ̶c̶a̶n̶ ̶e̶a̶s̶i̶l̶y̶ ̶s̶p̶e̶n̶d̶ ̶h̶o̶u̶r̶s̶ ̶p̶l̶a̶y̶i̶n̶g̶ ̶m̶i̶n̶i̶-̶g̶a̶m̶e̶s̶ ̶o̶r̶ ̶o̶p̶t̶i̶m̶i̶z̶i̶n̶g̶ ̶y̶o̶u̶r̶ ̶s̶t̶r̶a̶t̶e̶g̶y̶,̶ ̶a̶n̶d̶ ̶a̶l̶l̶ ̶t̶h̶i̶s̶ ̶w̶h̶i̶l̶e̶ ̶I̶'̶m̶ ̶o̶n̶l̶y̶ ̶a̶t̶ ̶t̶h̶e̶ ̶b̶e̶g̶i̶n̶n̶i̶n̶g̶ ̶o̶f̶ ̶t̶h̶e̶ ̶g̶a̶m̶e̶.̶ ̶I̶ ̶r̶e̶c̶o̶m̶m̶e̶n̶d̶ ̶i̶t̶ ̶t̶o̶ ̶a̶l̶l̶ ̶f̶a̶n̶s̶ ̶o̶f̶ ̶i̶d̶l̶e̶ ̶g̶a̶m̶e̶!̶ ̶G̶i̶v̶e̶ ̶i̶t̶ ̶a̶ ̶t̶r̶y̶!̶\n\nLost Discord giveaway: I won a giveaway on Discord, but the message was deleted and replaced with another, causing me to lose the reward.\n\nCharacter bug: One of my characters experienced a bug after receiving a random class. Normally, changing class requires a significant amount of premium currency and can only be done once per account. I used this option, but it caused my class quests to become completely bugged, and all class quest difficulty levels are now unlocked on my character.\n\nExcessive content: The game has so much content that it’s impossible to fully complete it without a nearly full-time commitment. And the paid content gives far too many bonuses.\n\nNonexistent support: It is impossible to contact the developers directly. The only support channel is Discord, where hundreds of bug reports are posted daily but remain unresolved. Meanwhile, new features continue to be added regularly.\n\nDoes that make me salty? Probably.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when world 6 update was brought in my game was reset to the beginning, now world 7 part 1 and my game gets reset to Jan 1 2025. Offers cloud save, but has no way of accessing it. Lava your game sucks, you suck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has an insane amount of FOMO and pay to win. With the new world/full game release, it seems like the new content is balanced around the extreme bonuses that you get from paying real money.\n\nThe progressions is mostly linear, albeit overwhelming in the scale and number of mechanics, until you hit a wall that requires you to backtrack to previous content for months. It exasperates the feelings of having to pay money to continue progressing in a steady pace. Many of the MTX items directly speed up the various mechanics to reduce the overall need to backtrack. Cutting a grind of months down to weeks or even days.\n\nWorld 7 introduced new MTX sailing benefits that make the original time gate of a month, take only a few hours. Other examples include a rotating shop of account wide benefits like 1.5X more XP or total damage or total AFK efficiency. These benefits are so massive, you can't help but feel FOMO. With how the items/bundles disappear and may not show up again for months or years, you are heavily incentivized to buy them right away.\n\nUntil many of these issues are addressed directly,  I cannot recommend this game as it is incredibly greedy in scope.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried this game about 4 years ago. Gave it another shot after full release only to find that I got a buuuunch of items since away. I got ALL of them, thousands, at once. They were across the ground. I sifted through as best I could- but there was no TRASH option. Nothing that allowed me to organize properly. Checking the Gem Shop cleared the entire screen... so that's all gone. It's just not fun and missing such a simple mechanic, I'm annoyed and perma-uninstalling.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Lost all progress accumulated over 4 years after selecting log in and steam sync, and nothing happens until I finish the tutorial. Finally, I came to the character screen but everything was missing. Tried again, did not work. Looked through discussions and it seems like the devs don't care enough to respond to players with similar issues.\r\n\r\nDone with this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After seeing those glowing reviews claiming this game was more addictive than my mom's lasagna, I decided to dive in without breaking the bank. Building and farming? Hell yeah! It’s like the game is giving you a dopamine high just for collecting stuff while you’re AFK. But here’s where it gets real: after dropping zillions of coins on upgrades, you realize the stats are a total rip-off. I retired just shy of 700 levels across all characters, and let me tell you, it felt like I was playing a game where the house always wins.\n\nI’m super glad I didn’t drop a cent on this buggy mess that gaslights you into thinking you’re having fun. It’s like they put the rigged part right in the title but forgot to spell it out for us mindless players. This addicting game has the absolute worst coding I have ever seen in my entire life—every little thing you do is unintuitive. If something works one way, you can be absolutely sure the exact same thing but in a new area will work in a different, more annoying way. Let me remind you one more time, buggy buggy. \n\nDo not get addicted to this spaghetti-coded mess, no matter how fun seeing those numbers go up is. Good super luck.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "if you are gonna have free steam launch giveaway rewards  either dont give them when someones inv is full or make it come back after i go to my inv  cause now i miss out on free loot cause of terrible design and theres no place to post complaints to admins or get it fixed sooo bad design",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i lost both of my wives and their children (the children weren't mine) my neighbors dog, parents home and some random house elf's extra sock trying to keep up with the microtransactions in this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I exclusively downloaded this game to get the 5 minutes required to roast this dev for not only biting Maplestory’s ENTIRE aesthetic in a garbage tier bootleg attempt that would offend generative AI, but also managing to somehow two-up Nexxon and Korean MMO devs in making the most hostile monetization and progression system imaginable\n\nPSA: You can use cheat engine for infinite gems, the dev is a certified retrad what is this 2008 like holy moly dude Golden Gate is right over there, you can't even be a scumbag predator properly 😂",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Quite literally doesnt work, you can enter the game but you cant log in or create an account, looking on the forums apparently its a known thing?? yeah no, doesnt work...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tl;dr: Don't spend a dime, only play this game if you're really bored and want to see numbers go up (there's plenty of other idle games for that though).\n\nI recommend playing this game at some point (when you're REALLY bored), but I don't recommend spending anything on it so I'm marking this as a \"No\". \n\nLots of bugs which, while they can crop up due to this game being on 4 different platforms, they just aren't fixed in any reasonable amount of time to where the Mobile platform was unplayable for about an entire week. Every content update seems to bring 3 times the amount of bugs compared to the amount of content, which unless it's a new World being added, the new content is filler at best.\n\nTons of microtransactions which range from pretty pointless to drastically speeding up progression in specific point of the game. There's an old gacha system in the form of Companions which give you a passive buff, the newer Companions are thankfully tamer in comparison to the older ones, with the older King Doot Companion being such a desirable game-changer that the pet-trade chat in Discord has dozens upon dozens of daily trade requests for the King Doot Companion, mostly because you might likely spend hundreds of dollars if you want it sometime within the next 3-4 years. 3-4 years because you can only roll for a companion for free once every WEEK and you need to roll 200 times for pity to give you King Doot. Tier 5 treats (250 crystals each) have the best odds and give that pity feature so if you got horrifically unlucky and paid for it getting the \"best value\" pack on crystals ($44.99 for 4100 crystals) would come out to almost $550 to hit pity, down to probably about $500 recycling any extra pets you got for more crystals. This doesn't include tax and definitely isn't worth the investment. I don't even want to get into the rest of the microtransactions (there's so many bundles that there's a TIER LIST for them saying what's worth and what's not).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very indepth idle game, bordering on not being Idle at all. Feels more like an MMORPG, with a constant stream of unlocks that grow and expand on other unlocks to form an interconnected web of systems that all have a place in the ecosystem. Constant dopamine and activitys.\n\nBe warned - 5$ for autoloot is more-or-less the price of entry, but the game is worth that 5$'s. Most P2W is to progress quicker and you even end up cheapening the experience a bit for yourself by skipping mechanics and grinds.\n\n-Edit-\n\nThe game itself is fantastic. I could write a whole summary on it, others have covered it. The game itself isn't the issue, the issue is the monetization. When I started there was p2w and some FOMO, but it was manageable. As of the past few weeks the game has ramped up predatory practices to the degree I was legitimately worried (and still am) that the solo dev LavaFlame2 might have been/be cashing out. Instead of a pack every few weeks there's a new pack every 2-3 days. New ramping forms of p2w that eclipse the older p2w methods to get whales to shell out more and more. RNG gacha gambling with the wheel event with extremely powerful rewards.\n\nThere is no standard, one-size-fits-all level where Pay-to-win becomes \"too much\". For some, being able to buy any power is considered too much p2w. For me, releasing gamebreaking bonuses and companions with the threat that they will never return on a 2-3 day limited time promotion is too much. Removing an entire pet (And pets in this game are INCREDIBLY powerful, with some giving game-changing mechanics you CANNOT get without having the pet) that can leave the shop at any time with the dev being non-commitial to whether or not that they will return, and even alluding to the fact they WILL NEVER return again is just too much. \n\nThe game is a gem, the system are great and it's an incredibly special experience. I have paid a fair bit of money for the game, and have not until this point regretting my purchase, but this is just completely and utterly disgusting. He's a solo-dev that makes an absolutely absurd amount of money is entitled to get paid for his work and even implement some P2W if her'd like, but these FOMO practices lately are not just disgusting on their own but especially disgusting given the complete and lack of NEED to employ this. People will spend money on the game without the FOMO, without the 2-3 day pack rotations, without the threat of things leaving the shop and never returning. This isn't Ubisoft or EA or anything like that, it's a single guy who is absurdly wealthy and doesn't NEED to do any of this to ensure generation wealth for himself. I can only conclude he's doing it for pure greed, because it sure as hell doesn't benefit you as a player of the game in any shape or form.\n\nI would have to say I don't reccomend the game. If you had asked me a few weeks ago, I'd have warned you a bit about P2W but reccomended the game for the excellence that it accomplished in a really niche genre. Now? I cannot reccomend the game. For all the reasons I listed, for the dev asking people to reccomend the game on steam to artificially inflate the ratings.\n\nI've spent a fair bit, I like the game and honestly am a bit of a hypocrite because I'll keep playing it, but had I know a few weeks after I had started playing he would have started to do what he did I probably wouldn't have even started playing. If you're considering playing the game, make your own decision but keep the negative reviews in mind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have attempted to have my account deleted (twice) by emailing support@lavaflame2.com and included the information asked for. however it will be 66 days as of tomorrow since i have made the first request and still find that my account still exists. I am not sure if this is because the account i am asking to be deleted is connected to my steam account, however i have not gotten a response regarding my questions either so...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love the game and I've played for 4+ years, long enough to watch a rising indie dev (not a solo dev unless you don't count outsourcing music and some art assets as cheating) get corrupted by his own success. Everything sold in the shops is either earnable by playing or will likely be earnable for free eventually, but not soon. Stealth nerf get added in with the patch, never make it into the notes, and almost always make the game harder for newer players while creating a logarithmically scaling gap with older players who became strong enough to abuse systems beyond what Lava could dev a solution too. I've spent a few hundred USD on the game supporting, but have since stopped my support (other than adding to player count) when the game direction started going into places I didn't approve of. I'm too invested to drop Idleon until Maplestory Classic comes out (at least I'm already aware what horrible fate lies down that road), but I can't recommend new players joining unless they plan on investing heavily or don't mind being perma-years behind. This comment made in response to a dev plea for Steam reviews to change the 'Mostly Positive'to a 'Very Positive'",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "P2W and alot of shadownerfs, also dev bans any criticism",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The Game is fun but the developer is devious and treats his players like 5 year olds.\nLast update was huge and great, but something that didn't appear in the patch notes is how the gem drops got nerfed so hard, and of course so much stuff was added to the gem store.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2] Updated Review [/h2]\n\nWell, I still quite enjoy the gameplay. But the p2w has suddenly skyrocketed. New huge packs coming every few days, lots of fomo, and changing them out so quickly people are worried about missing them. \n\nI was fine with a pool of packs that rotate every few weeks, even a few being the \"price of entry\" on a free game. This is just stupid greed though. I still don't think any of it is required to progress, but man it's a bad look on the dev to exploit his players like this. \n\n[h2] Gameplay [/h2]\n\nIdleon is one of the most in depth idle games I've ever played. It's the ultimate progression game - every world comes with new mini idle games that provide overall stats and progression to your account. \n\nYou get to control up to 10 characters (that you have to progress to unlock, obviously). While one is mining the ore you need, the other can be pushing worlds to progress, and another can be farming materials you need. It all comes together in a very satisfying way and gives me everything I love about maplestory progression and runescape leveling, but able to grind without clicking on a new tree every 10 seconds.\n\nThere also is a TON of content - this game has been out for years. Some people don't like this, as they won't be end game immediately, but it gives you tons to do and lots of progression to make.\n\n[h2] In game purchases [/h2]\n\nThere are many complaints about p2w in this review section. I would say that the game probably needs a baseline of at least the pack that provides autoloot, which is 5$. Personally, I don't mind a small paywall in a free to play game, as obviously developers need to support themselves somehow.\n\nThat being said, there are some greedier packs and mechanics. But in my opinion, it's really mild compared to many \"freemium\" games. This isn't afk arena that's encouraging you to spend 100$ every time you hit a new milestone. There are 20$ packs that rotate in every couple of weeks or when a major pack drops. Generally, these have good value and come with cosmetics. Gems are actually extremely farmable if you bother to do quests or even just farm.\n\nBut none of it is required at all to progress - you will powerscale on your own just fine. Paying will skip the time spent grinding . As there are no competitive aspects to the game this doesn't bother me. If you don't have good self control, maybe skip this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they try to hard to be funny and self aware in the dialog and it comes off cringe, annoying and completely takes you out of the experience.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "An \"MMO\" where you can cheat with Cheat Engine or injected cheats to do basically anything, including skipping paying real money for microtransactions. The fact that dev is so incompetent, he cannot guard his own income, should be a clear signal to not play this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Tried to pick this game back up, but had to go into files to delete something. Wasn't super clear and just deleted all of my data and all my progress just vanished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "*goes to play game\n\"that name is already taken, choose another\"\nwhat kind of idle game needs unique character names to even start? what the hell is the point of linking my steam account if i cant use my name? i get not allowing several characters to have the same name, but if i open the game, and cant make ONE character because \"that name is already taken\", thats kinda bullshit",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Predatory microtransactions made to FOMO people with no impulse control",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "microtransactions and laggy af for no reason",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Dialogue writing is pretty cringe, and there's constant frame drops",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "IF you want to Sync your Steam account to your Google Account and even take 5 minute to Logout and Log of your Other device like Android just don't - you will lose a month of progress or Week of progress\n\nCloud Syncing on browser Remain Broken after World 7 3 Week in. Be Wary About Losing Progress",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ok, so the primary sin this game commits is a absolutely TERRIBLE user interface.\nAnd one of the ways the UI is particularly bad is the way it fails to make it easy to manage multiple characters.\nEverything from inventory management to quest progression is just a terrible chore the more you play.\nIt seems not too bad at first. Quirky even. And it's free, so who cares right? But then as you add more characters and try to keep their quest progress and equipment straight, the glaringly obvious problems just make it painful to keep going.\nThere is no way I would ever give any money (in the form of microtransactions, since that's how it's monetized) to the people making this thing without a SIGNIFICANT rewrite of the entire UI.\n\nI appreciate the way they layer on mechanic after mechanic to give you things to optimize and grind and progress past. But 90% of this game is using the UI to optimize and progress things, and that makes the UI a SUPER important part of the game. I'm frankly amazed at how bad the UI is given that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its fun to have while I fish, but later it's less idle and more full on babysitting 12+ characters that will eat your time. One of my close budz got hooked by the drip feed progression and now has been psychologically tricked into checking everyday for 2+ hours. These mechanics are design to highjack your time.\n\nEdit: The new updates push for more monetization",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Idle game where you have to click 99% of time, abnormal donate shit",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its a huge time vaccum and I enjoyed the login dopamine when I did play but the fact it wiped my 45 hours of gameplay and made me start fresh during one of their updates is enough for me to review this negatively",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unless you like getting screwed over by spaghetti codes and conscious decision to start off new content with the lowest quality of life possible. (I'm one of them)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game has a lot of personality and there is obvious passion from the developer, but ultimately it ends up feeling like a collection of time wasting mini games and gambling which could be acceptable if it didn't require constant attention and active playing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game based on the explotative MMORPG is explotative, who knew?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has and continues to become progressively more pay to win with every update",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is an Idle game and is free, do I like it? Meh. Will I play it more? Possibly for the Achievements.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun for a bit, but the amount of pay to win mechanics and ads in the game caused it to lose its splendor quite fast.\nThe most egregious of those are the pets that you either have to buy from packs (only real money) or get from lootboxes (1 per week, with more rare pets taking literal years to get). These give huge permanent buffs that either greatly increase your power in some way or improve QoL. There is a way to trade pets, but that only applies to bought lootpacks/pets...\nThe ads would not be as bad, if there was a way to close them. It seems that every day, you get at least one ad for the currently sold packs (usually several in a row). They take up half of your screen and do not have a close button. The only way to get rid of them is to click on them and then exit the rmt shop.\nThere's also other things like a lot of QoL upgrades being locked behind gem purchases, which in fairness you can slowly earn, but if you take into account the aforementioned problems, it just doesn't feel good. \nThe game has a somewhat solid base that some people could honestly spend thousand of hours on, even F2P, but for me, it's sadly a Not Recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Quality of updates have been going significantly down for a long time now, content is half-assed, plain boring, or straight up missing.\nPerformances are atrocious for what it is, a 2d pixel art idle game shouldn't take up to 8GB of memory and go below 30fps at random.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The developer of this game is quickly becoming the next PirateSoftware. The monetization of this game is also incredibly, egregiously predatory and pay-to-win. Lava's an insecure freak and bans anyone for any criticism. Thank god there are ways to play without spending on this freak's game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've had some fun times with this game but there's just too many issues for me to recommend it.\n\n1. Heavy use of non-cosmetic microtransactions. While the game is technically free-to-play, you can pour hundreds of dollars into it for things that give you substantial gameplay advantages. One of these, the autoloot package, is considered by many players to be pretty much required for progression beyond a certain point, so many people consider accounts that have bought it to still be \"free-to-play\" accounts. Another argument frequently brought up is that the game is supposedly a single-player game, and thus, the microtransactions are not an issue. I believe that if it truly were single-player, there would be no problem with me modding the game to give myself those bonuses to make my experience more enjoyable, but modding is a bannable offense. (Additionally, there are several parts of the game that actively require or at least heavily reward co-op gameplay with others.)\n2. Heavy use of FOMO (fear of missing out) to promote constant engagement. The game frequently uses limited-time events to encourage players to log in every day and push for more gems/event minigame plays or risk permanently missing out on bonuses and falling behind everyone else (which wouldn't bother me as much if not for the next point.) I feel like this is somewhat manipulative and reminds me a lot of Nintendo's practices with limited-time giveaways of mythical Pokemon (except that I have more of an issue with this, because unlike with Pokemon, it's significantly harder and grounds for an account ban to mod your account to have the limited-time bonus.)\n3. Many of my interactions with the community have been pretty unpleasant. Lots of experienced players will look down on and criticize others for not playing the game the way it \"should\" be played. I wouldn't mind this as much, if not for the fact that it's a multiplayer game which basically requires engaging with the community to at least some degree, and the wiki is often outdated, particularly around the time of recent updates, with the reasoning that they don't want to spoil new players, and people can just go to the Discord for information.\n4. There are lots of pitfalls you can make that end up hampering your progress that are either irreversible or will hamper your attempts to make progress, such as mis-spending prisma bubbles, buying Laboratory Bling before acquiring enough of the chips/jewels it will replace in rotation, or using Fisharoo Reset too frequently on Poppy. If this were a single-player game that could be played locally, this wouldn't be an issue, since you could simply have backup savefiles.\n\nIf IdleOn were a game that could be played locally, with minor wireless and co-op features, and there weren't rules against modding, I would enjoy the game a lot more and would probably be leaving a positive review, because that would mitigate almost all of my issues with the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got scammed by the devs, was suppossed to get 900 free gems with my purchase (new player incentive) didn't receive any. joined their discord, the mod/dev there told me to write to an email with proof of purchase. did that, never got a answer. sent a second mail, still the same. to this day i haven't received anything. so spare yourself some trouble, don't play this horribly scammy game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. My spent hours can tell a little bit about it.\n\nThough I can't afford to put money on it. Without regional pricing, everything ends up being ridiculously expensive for Brazilian players. If prices were a little lower here, I would occasionally buy some things. For now I'm just f2p and I feel like I'm missing something here. \n\nIt's an idle game, which you would expect to grind and farm for long time. But it feels broken when you're f2p because it takes WAY LONGER for simple and essential things. \nThere are a lot of mechanics which is a cool feature, but when you're free-to-play you should keep all of them in mind so you don't miss anything that can make you have to wait for days again for a missed mechanic.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hey, don't ignore the people complaining about the bugs and how harsh the \"shop\" items are. The gap between f2p ($5 minimum spend really) vs people who spend $100 is drastic. Each $100 spend brings you into a completely different tier of the game. With so many gambling and gacha mechanics, expect to be bombarded by FOMO and other psychological devices to get you to spend money.\n\nIf you don't mind those things, and you also don't mind a dev who seemingly keeps backtracking on his word when it comes to community sentiment and health, then sure, hope on in because it's still a fun game. Just expect to spend weeks doing something that a player who has paid will complete in a matter of hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun, but p2w and cashshop is getting more and more insane with each new update to the point of questioning if you can even have a chance without paying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to love the game, but now seems like all the good stuff is soft locked in behind a paywall. \nYes you can work towards it... but its been 80 weeks, still havent been \"lucky enough\" to unlock on of the best things puppet in game - There now rotating bundle so if you miss your luck, your done.\n\nIt used to be a game with something to look foward to work and build, but now you can just get cheesed by someone buying out the game. Defeats the purpose. I liked when it was more accessory oriented, and helpers. Not mandatory purchase in order to make deccent progress.\n\nThat and having mandatory \"check the dev\" stream to unlock permanent reward (tome) and have the game open for 240h to unlock this... yeah it's an idle game, but it feels so grindy now. everything to keep the game active and bloat the number. it aint enjoyable anymore. it used to be a casual game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is really grindy. If you like games like these play it, It got really boring after world 1.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed this game, but I can no longer recommend it because of the pay-to-win updates, and the free rewards got significantly nerfed so we have to pay to make progress in the game. And also instead of fixing a bunch of issues and bugs, devs prefer to make more cash grabbing cosmetics.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "thought this was some random idle game it adds online for no reason other than look at me with fancy gear give money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yes and no?\r\n\r\nThis game is fun, but its fallen into the never ending void of micotranactions. There are way to many in this game, and they get shoved in your face daily as well, also the dev nerfs things, then sells the solution to the problem he just created?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Short list after long time of \"idling\".\n\n- A Lot of unfinished or otherwise stub content.\n- Heavy on pay-to-win after companions update. And yes, you don't need them. But damn aren't those buffs just game breakingly powerful.\n- You need 3rd party services to fully play the game, as it leaves a lot of information hidden.\n- A lot of so called FoMo stuff.\n - Yet another game going 1.0 when it's a beta 0.9 at best.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to like IdleOn, but man… this game is just awful. It starts out fun for a few hours, then you hit wall after wall unless you’re willing to throw money at every single new pack they release. It feels like the whole game is designed around pushing you into buying microtransactions instead of actually playing.\n\nProgression is painfully slow, everything is paywalled, and every update comes with another overpriced bundle you basically need if you don’t want to fall behind. It stops being a game and starts feeling like a cash grab.\n\nIf you don’t plan on buying every pack that drops, don’t even bother. Waste of time and definitely not worth the price. Total disappointment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "HEAVY pay to win. In fact, pay to progress. Takes heavy grinding just to get anywhere, even to get small stuff, and honestly, it's not worth spending your time on it. Play some other game lol\n\nI hacked it and I don't regret it even if I'm shadow banned on there. Totally worth it, dopamine levels are up, satisfaction is up, and no need to spend and waste my time on days and weeks jus to reach the next portal\n\nNot worth it lol",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the concept of this game is great. unfortunately its plagued with gacha gambling and pay to win mtx trash. i get its a free game but the entire fan base considers the \"base price\" to be the 5 dollar auto loot system. we should be able to obtain everything in game and not have to purchase advantages.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too much of a gambling game with way too many ways to spend money. A pretty enjoyable idler if you play it and talk with no one but very clearly a pay to get better numbers sort of game. Some of the more recent changes have shown that more every time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "couldnt even freaking log in after not playing for years. couldnt even freaking log in. my account wouldnt even freaking log in. nobody can log in.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately after update game is unplayable now - constant crashes (whitescreen) after 3-5 minutes of active play... and we have no info if its issue is beeing fixed in forseable future.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not idle enough i have to click yikes. also why cant i skip the spin wheel thing it takes like 200 years each time i spin the gacha wheel wtf",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Preface: I've made it to world 2 so far. \n\nThere's so many systems. I mean SO many systems. This wouldn't be a problem, but there's really not much explanation to them. From a cursory glance:\n\n- The main game (fighting, crafting, mining, woodcutting)\n- Arcade\n- Orion (Why do you have to spam different buttons a thousand times for this by the way. In the talent menu for your skills you can choose x1, x5, x10, x25, and max to distribute points faster, why can't you do it here?) (Also the \"Select a Megafeather for details\" is broken. It only shows the details of the latest megafeather you bought)\n- Obols\n- Stamps\n- Statues\n- Cards\n- Family\n- Alchemy\n- Bonus Ballot\n- Killroy's Slaughterhouse\n- Pets\n- I know that many more are unlocked in the future\n\nThe game drops them in your lap with little explanation. Looks like there's a lot of P2W systems in there too. They literally have a tab called \"PAY 2 WIN\" in the Alchemy screen.\n\nCan't recommend a game that releases itself as '1.0' when the most basic things are awful to navigate:\n\n- If you want to craft things, it fills up your inventory or stash. You then have to manually grab it out of your stash then sell it one by one by dragging it to the sell shop. And again, why not a \"craft all\" button.\n- There's sometimes players covering the town screens, even when I change servers that have a low population. They are absolutely everywhere and they cover shops and interactibles in town. Note: this only happens during certain times of the day when it's busy. Game sometimes CHUGS in these situations too.\n- I can't see other world maps. If I'm in world 1 and want to go to world 2, I have to go to the world 1 town, walk through the portal to world 2 and THEN I can see the world 2 map.\n- No way to make text dialogue spawn instantly, have to wait for the text to scroll.\n- Changing the stash from big mode to small mode always closes it.\n- No way to search or filter items in inventory or stash - this is made more frustrating because there is so much junk everywhere.\n- The 'help' menu (it's called 'hints') doesn't really explain much or delve into systems at all. Some systems are just not there at all.\n- I understand this is has a 'mobile-first' approach, but you can't double click items to use them, you have to click and hold to use things. There's no feedback that it is time to let go, sometimes I wouldn't hold it long enough and nothing happens. \n- You can't craft items from stash unless you go into your stash, find the items it requires and craft it at least once from your inventory. Would be nice if the game told you if you also had the item in your stash from crafting menus, it only shows you what's currently in your inventory. This leads to you opening menus back and forth.\n- You can only open one menu at a time\n\nI really do love the idea of being able to unlock multiple characters and have them make your entire account stronger as a whole, make them specialise into different things, some can farm materials from mining, woodcutting, others can fight. The pixel art and animation is great too. Music is fine, dialogue is highly skippable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "when i played it, it felt like how maple story first looked before it was upgraded.. yesh i played old school maple story lol...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the most fun idle games ive ever played. Also one of the most aggressively monetized. Ive spent money here which is something i usually dont do on ftp idle games, but i felt the quality of the game was worth it. However, despite spending over well $60, more than the price of a AAA game, I am still greeted with popups that linger for 30+ seconds and cannot be closed advertising bundles every single time i launch the game. This most recent update added 3 new bundles, all with exclusive pets. They are $10, $20, and $30 respectively. This by itself is the price of a AAA game. This is for a single update. The dev continues locking more and more bonuses behind paywalls. To engage with any content in the game even semi efficiently you have to shell out a good bit of money. It sucks that such a fun game is plagued with such heavy monetization. You can play the game without spending money, but it will take literally years longer to do things than people who spend. \n\nIf you have poor impulse control I would not recommend playing unless you are very wealthy. If you can whale out with no effect on your bank account this is genuinely one of the most fun idle games out there, by far. If you dont have extra cash sitting around I would recommend avoiding because your progress will be slow unless you pay $100-$150 to get the best bundles.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I gave this a try during my work breaks.\nBad optimization could be overlooked but forced ads, nope, thanks!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes randomly with a white screen and you lose progress. Seems decent otherwise. Some of the pop up ads are a bit annoying and you can't close them until you click on them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "boring just not satisfying and window mode is buggy",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boing tbh and unable to play.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}