{
  "positive": [
    {
      "review": "I was incredibly excited when this game was first announced, but its launch… well, let’s just say it didn’t go the way anyone hoped. The initial release was packed with technical and design issues - poor performance, frequent crashes, clunky movement, overwhelming enemy placement, and some truly frustrating questlines. It was rough enough that I decided to skip the game entirely at launch.\n\nTo their credit, the developers didn’t quit. Over the next two years, they listened to community feedback, released update after update, and gradually turned things around. By the time the 2.0 version arrived, a huge amount had been fixed or improved, and several new features were added. That’s when I finally felt confident enough to dive in.\n\nPerformance still isn’t perfect, but it’s far better than it used to be. After lowering reflection and global illumination to medium, I was able to play smoothly - and I haven’t had a single crash in over 66 hours of gameplay.\n\nIt’s true the game doesn’t have the ultra-polished, razor-sharp combat that FromSoftware is known for, and I think that’s a big part of why it initially received so much negativity. Expectations were sky-high, and anything less than perfection was destined to disappoint. But judged on its own merits, the game is absolutely worth playing if you enjoy Soulslikes.\n\nVisually, it’s fantastic. The world is drenched in a dark, Gothic atmosphere that’s a joy to explore. The difficulty is challenging without crossing into “break your controller” territory, and the overall journey feels rewarding and well-paced.\n\nUltimately, Lords of the Fallen is a strong choice for players who enjoy Souls-inspired games and want something fresh within the genre. Just don’t expect it to be a FromSoftware title - and you’ll likely have a great time.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Great game. Nearly every moment feels handcrafted to deliver impact, whether emotional or exciting. There’s a sense of artistry behind each set piece and quiet moment. You can feel the effort behind every detail. The result is a consistently exceptional experience.\n\nHad such a blast playing this 100% worth trying, especially since the game offers a free friends pass.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Impressive improvement from the first one, enjoyable and beautiful, i found the difficulty fantastic, not too hard or too easy, overall a good adventure worth a try, and i have to say, the parry system is phenomenal.\n\nIt isnt a perfect game, it has a few flaws (map design could be better!), a little bit of stuttering, but overall is good.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "At first, the game was buggy when it came out, but now it has become one of the best souls-like titles. They’re trying to update this type of game with new mechanics and improved movement. Some people may not like these changes, but it’s as good as any other RPG souls-like game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This title appeals primarily to players who want to try a souls-like game for the first time with one of their friends.\n\nOne reason for this is that the game offers a “Friend's Pass” meaning that only one person needs to purchase the game. Unfortunately some features are not available to the other player but this does not hinder progress or shared gaming fun.\n\nThe games difficulty level is great, not too hard and not too easy - even more noticeable in co-op than when playing alone. It is a really enjoyable and entertaining adventure which is a big improvement on the first part.\n\nIt is not perfect but then what is? ;)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Man what a game! It really is a great souls like, I enjoyed it a lot. The art style is just phenomenal, the sound design, the soundtrack and the overall theme just a chefs kiss. It is not perfect, the enemies are repeating themselves more often than not and having to be in Umbral is annoying sometimes, but only because I looove to explore and look at the areas, they are so well made.\n\nIt is definitely easier than a Dark Souls/Elden Ring, but I actually like that. Doesn't have to be sweaty all the time and the last 4-5 bosses made me rage, so overall good experience. \n\nRecommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Veterans of the more difficult FromSoftware games will enjoy this game. It has an interesting and unique set of character classes, your usual panoply of difficult boss encounters, and traditional gothic trappings to go with them.\r\n\r\nThe biggest selling point of this game, however, is the Friend Pass that this game offers. You can play this game all the way through with another friend and they don't even need to buy the game if they play with you. It also runs surprisingly well on decent hardware with the use of in-engine supported upscaling.\r\n\r\nI'd say if you want something tough to play with a friend or if you're a difficult RPG fan, give it a shot.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fighting enemies feels good, roaming around and exploring especially late game areas is nice. These are big accomplishments on their own and enough for me to recommend the game. \r\n\r\nHowever, I wish there were more item diversity; other than weapon scaling and weapon type, like strength scaling sword or agility scaling sword, there are very few unique weapons, and the unique ones are same as normal weapons except they cast a spell at the end of their combo attacks. On top of this, finding and unlocking its specials for some of them are very obscure. Another complaint would be how precise the npc quests are where it is very easy to fail. However these are minor things compared to how does gameplay feels.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has all the hallmarks of a good game if you are a fan of Souls-like titles. Yes, it had a bad start, a regrettable one, BUT the devs did what few do: they acknowledged their mistakes and rectified them. The overhaul was a tremendous improvement and deserves praise on its own. The atmosphere and the music were good to begin with, and now it plays as well as it looks, in my humble opinion. Recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun and catchy game, a little bit confusing sometimes, but overall very good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "These devs are one of my favorites if not my favorite. They fight against all this stupid BS being added into games and just wanted to make a banger game, and they did! They also spoke out completely against people celebrating a horrible event in september and said they would fire anyone who supported that horrible event. Good on you guys!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A very fun soulslike with a unique twist (there are 2 worlds) and devs that care.\r\nThe combat flow is fun, melee and shield, dual wielding, magic, or 2handing it flows so nicely.\r\nExploring the layered worlds was interesting, but i tended to stay in the rogar realm more often than not.\r\nProgression is pretty quick for most builds and you can get satisfyingly strong pretty quick.\r\nThe bosses are interesting and mostly very unique, if not the most difficult fights.\r\nAll in all the game is fun and the devs are still listening to the community and even added a weapon for the anniversary recently.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my first souls like game. \r\nHave only played the multiplayer part in this game and wanted to experience everything in the game. \r\nThe game is soooo beautiful, everything from the gothic aesthetics of the buildings to the dark bloody vibes in the game. Even some of the music feels amazing to fight to. \r\nI have enjoyed every part of this game. \r\n\r\nThough the minus of the game is surely the bugs the game has - especially in multiplayer.\r\nBut hopefully all those bugs will eventually get fixed. \r\nThe sorting of armor and inventory could also be done better, so it's easier knowing what u have multible off and easier to find what u are looking for basicly. \r\n\r\nbut overall .. beautiful game .. \r\n             ⋆༺𓆩⚔𓆪༻⋆",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is extremely well made. One of the best games I've played this year and I'm thankful to the devs for making this masterpiece. \nMoney well spent!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I recommend this game to any soulsborne player. My first souls was Elden Ring - which may be a very different experience from most souls players. I absolutely explored the entire game, searching and killing just about every boss in it, before doing the same in bloodborne, and Dark souls 1, which I'm currently working on, for those of you who want my experience in the og soulsborne games.\r\n\r\nThis game offers the same style with a slight bit of handicap - as well as something that no soulsborne that From Software ever developed: seamless multiplayer. If you do this option, I suggest the hardest multiplayer parameters, as the game can be somewhat easy for a veteran souls player (mind you, there still is some challenge to the game). Now, if you don't care about traditional souls-like difficulty, then definitely buy this game and make your friend get the friend pass - The story draws you in, the gameplay itself is very smooth, and all aspects of roleplaying are balanced. Just make sure you click the 'shared progression' in the settings, as the only thing I would complain about in the game is the lack of teaching the player about different settings, when there are so many that one could benefit from. I only wish that there was more content, as at the time of writing this, my dad and I have beat the game on what I think would be the more time consuming ending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great souls like with unique mechanic; the Umbral. The launch was horrid, but the Devs stuck to hit, giving it lots of love, and listening to the player base. Honestly, the biggest gripe I have with this game is the camera angles. Getting killed because the lock on feature shoves the camera into a wall, not being able to see ANYTHING past the walls of special effects, like Fire blades, Ice walls, ect. The worst part is this screws you over if you have a big weapon, and use elemental buffs on it. It's honestly not that bad, just takes getting use too, and dealing with the couple of times it gets you killed in crucial moments. Other gripe I have is that most Weapons are all types, without much else different besides stats, elements and scaling. In the second one, I hope they add something akin to the Ash of War system Elden ring adopted, so that you can mix and match weapons with different skills.\r\nMy favorite part is how much effort they put in the distant environments, and some of the current ones. I like the high places in the game that overview the lands, and you can see all the buildings, lava trails, towers...all in the distance. They really put in effort in it. The umbral is cool as well, but in some areas it just...seems bland. Some. Some areas the umbral is horrifying, like the prison, where there are just Maws with eyes in them  at the bottom of the water.\r\nAll and all, A great souls-like, that stands out on its own. Can't wait for the 2nd one, once it releases on steam. Won't be buying anything from Epic. I like my library in one spot.\r\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Winner! This game is worth every penny! My wife and i have played through to the end and it was an absolute blast! We have tried other souls likes and ended up giving up due to insane difficulty and just being miserable. This game felt well balanced. It does have issues but multiplayer is a gem!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All around a great souls like game the game is hard but not so hard you dead at every encounter. The inclusion of the friend pass is amazing be able to play the whole game basicly start to finish with friends for free as long as one of you owns the full game overall great game great time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A single statement: 'It's a good game'\nTo elaborate this is a souls-like game that takes a more gothic approach,\nthe gameplay takes the wheel, so don't expect amazing face expresions.\n\nI recommend choosing a build before you start playing the game, like the 'Umbral Death Knight':\nhttps://thelordsofthefallen.wiki.fextralife.com/Builds\n\nPraise the Devs for giving free updates instead of adding them as DLC.\n\nSome stats cap early and doesn't give more payoff after reaching certain limits, check this for more info:\nhttps://thelordsofthefallen.wiki.fextralife.com/Stats\n\nBasically offensive stats cap at 50 (Strength, Agility, Radiance & Inferno) and defensive ones at 40 (Endurance & Vitality)\nUmbral is the combination of 'Radiance & Inferno' stats.\n\nSome questlines are exclusive and requires multiple playthroughs, I advice you to check the ones you need before you reach their starting areas:\nhttps://thelordsofthefallen.wiki.fextralife.com/NPCs\n\nTe best questline is 'Way of the Bucket', try to follow it to get some help during boss fights:\nhttps://www.youtube.com/watch?v=AIJaK_qtK40&list=PLwKum4Ud-roHarS67_HaQ7S_KD19Z_roJ\n\nSouls-like games aren't for everyone but this one is quite fun with its 'Umbral Lamp' mechanics both in combat and in explorations.\nIf you like the genre, give it a try. This one looks like it was made with both love and passion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quality gameplay, challenging bosses, aesthetic on point. I highly recommend this game if you enjoy souls games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's some good fights in this and the outfits are ritzy. I don't fully understand the story because occasionally the dialogue and descriptions are baffling, and the umbral memories aren't very helpful. The game loop is like an imitation of Dark Souls 2 with a whole lot of quality-of-life features. We all love endless co-op. \r\nNext time let me feed fleshy corpse bits to the dog",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has easily the most gothic ambiance, and most premium weapon and armor designs I have seen. The game is oozing with ambiance and honestly I would recommend it for just that alone. The game play is also good but the boss battles left a bit to be desired.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great job done by developers, since release game improved tenfold. Atmosphere, aesthetics, armors, umbral mechanics, level design, spells - everything is 10/10. Just hope if this IP gets next game - it should have harder bosses, since locations themselves were usually harder than the bosses of said locations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great soulslike with nice story and good combat. Devs show they care about this game and listen to community feedback. \nCant wait to play the LoF II.\n\n𝑰𝒏 𝑳𝒊𝒈𝒉𝒕 𝒘𝒆 𝒘𝒂𝒍𝒌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, co op works well enough that its fun to play with a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want to experience a world soaked in atmosphere, gothic architecture, haunting soundscapes, and a constant sense of beauty intertwined with dread, this is a game for you. Visually, every environment feels intricately built, and the dual-world mechanic between Axiom and Umbral is amazing. \r\n\r\nBoss battles are intense and memorable, and the sense of progression feels satisfying and victories are hard-earned but extremely rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite being released a little over 22 years ago and with a new game underway, they never forgot to update and include new content over those 2 years. The lamp mechanic is a very fun twist on the soulsborne formula that it feels refreshing to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a lot that I like about it.  If you like soulborne games, give it a go. The developers listened to the community feedback and really put the work into this to make it great after a lack luster launch.  I have not had the reported performance issues, and in some ways I like the game better than Elden Ring.  Go ahead and light your torches now. If you ever played Soulreaver (I know that's going back) and liked having to go into the nether realm to solve puzzles or to get to other locations and you enjoyed that you will like that element of this game. The coop is great and the friend pass alone makes me want to support this company's product.  All in all if you can catch it on sale or even a code from another site I think and fan of this style of game should give it a shot. I got it for $15 and I would have paid more in retrospect. Even bought a copy for a friend after we friend passed it for a few days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game in 2025 and it was good!! Runs very well on the Steam Deck. Nice art. Love the boss battles. If you like Souls like games, give this one a chance!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Геймплей  и графоний в игре отличные. Но хватает багов, а сюжет в стиле любого соулслайка - нихрена не понятно и денег на нормальные диалоги и кат-сцены не хватило.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy this game, first soul based game ive played, and absolutely enjoy the inferno build!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the only souls like I like. Fun Coop, and you can play basically the whole game with friends unlike Elden Ring. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The umbral mechanic is done very well, bringing another dimension (literally) to gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommend game for souls fans, interconnected maps, good builds, difficult level is lower but challenging.\n\nOverall a good experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, combat is fun, areas and enemy placement are well designed, even has good replay value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The developers of this game have continued to improve this project until it has become the great game it is today. Great level design, great mechanics, tough and diverse enemies, and fun boss battles. Every thing you look for in a souls-like with its own quirks and identity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great intro to souls-like with a friend. From what I've heard their Co-Op shared progression is unlike most Souls-like games and I think this is a good entry for me into these soulslike games where I can start playing this and work my way through the harder ones out there solo. Great with friends and the free friend pass is nice and I hope more games do that sort of thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent as of today, especially in terms of art direction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a hard game to review... You can tell the devs put a lot of heart and soul into this game and wanted it to be good. In the end this game is more a love letter to DS1 then it's own creative work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After all the reviews and update... the game is still not ground-breaking but it's actually pretty fun and immersive. The coop campaign is really well built for this kind of game, we had a great time playing it with my friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great souls-like game. This one you can actually play in coop without being annoying. The lack of direction at times to complete the main quest was bothersome tho. And the fact that doing one thing pretty early on in the game did lock me into one of the endings.\n\nBut overall I had a blast and am looking forward to any of their future games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lords of the Fallen is a better souls like than the most souls-likes out there excluding the FromSoftware titles. FIRST OF ALL, the game has a friend's pass, which is insane in 2025, mad respects! Secondly, It feels a little off at the beginning, the characters' weight feels slightly wrong but you get used to it. I found myself unable to find balance here and there but tbh, i booted this game right after 100%ing Dark Souls, so it's only fair that i felt that way a little bit. The underworld could have been utilized a little better too, it's such a mind-blowing feature, reminded me of the Titan Fall 2's infamous time-swap mechanic. I was a little disappointed with how underwhelmingly it was used in some places. But overall, i'd say this is a 8/10 souls game especially after the 2.0 update. I made one of my friends boot up the game with my friend's pass, WHICH IS AWESOME THAT THEY GOT THAT HONESTLY, and try a souls-like genre with me. This game is a better alternative to start the genre since it isnt that brutal honestly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played through this game start to finish so many times its kind of crazy but, ( while yes it is one of the easiest souls like games on the market ) I absolutely love this game it helped me get into souls games and other souls like games. The world looks amazing and has very unique mechanics that you don't see often. I will say that one ending boss fight was super disappointing and just felt rushed and tossed together. Other than that give it a try there is ALOT of lore your can learn from all the exploration from the massive world you can run through. More fights and combat I love than I don't like. Don't play the previous version of this game just play this one the updates I have seen them do to make some improvements to massive leaps. They listened and changed give this game a fair shot and it might surprise you. If you play souls games or harder souls like games this may not be for you it might just be a lil too easy but fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought the game after Patch 2.0. I played solo, and it was fun. Lords of the Fallen will satiate your thirst for a good Souls-like experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice graphics bosses could be a bit harder but fun game and lots of stuff to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is in the best state it's ever been and I'm glad the DEVs are still doing things to improve the game. I love the full multiplayer, being able to play the whole game with a friend has been super fun. \n\nYes the game still has some visual issues, multiplayer interaction problems, but is overall still fun and some of the bugs are pretty funny. \n\nIf you're worried about the game it's understandable but in my opinion it's def worth trying. Plus they have a friend's pass so they can join your game for free which is awesome and was super fun to get some of my friend's to give the game a try even though they were worried and skeptical about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game that only got better with subsequent updates. New Game +0 in incredible for trying out new builds and finishing up the esoteric quests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a wonderful game.\nA different world people don't mistake this game for dark souls it is souls game yes but \nthe game has so many good qualities \n1) Rich story\n2) unique world with the umbral (Lamp)\n3) Amazing music/ soundtracks\n4) a lot and fun classes to pick\n\nI think that is enough from the positive things it has sadly my main language is not English so i have a bit of a problem putting into words everything i could and can and feel about this game Hope people will give it a try it is not a bad game at all,\n1-2 things i did find bad was sometimes the fights felt clunky either boss or random monsters and the other would be the following attacks from the enemies or unreasonable range for some specific enemies that is all from me\nStay righteous stay safe guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Souls acessível - Lords of the Fallen é uma verdadeira surpresa. Fico extremamente chateado por não ter apostado mais cedo neste jogo e acima de tudo um título ideal para quem deseja entrar no mundo Souls (Dark, Demon's, Elden....) sem desejar partir constantemente o comando. \r\n\r\nArte, som, gameplay é realmente único e merece bem maior destaque. Fico feliz pela aposta numa sequela que irei agarrar assim que estiver disponível. Se tiveres amigos com quem jogar, basta que um tenha a cópia o que torna este jogo uma das melhores compras que poderás fazer para jogo Co-Op. \r\n\r\nJoga, explora, pratica e derrota inimigos em dois distintos mundos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Don't know why but i always accidently find souls-lite games, this game was one of them I'm glad I stuck with it, I find this game so much fun. and the friend-pass allowing my friends to play while I'm the only one who owns the game allows them to try the game for long extended game sessions with me,\n\ni just hope this game can last a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sick game and is amazing to play coop with friends and is so fun to make your own class and style up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy playing this game. If you download the friends pass you will not be able to progress very far into the game unless you buy the full version. If you have a friend who does have the full game you can play together and will be able to play the full game. I do find it challenging and the bosses are hard to beat, but they aren't so hard that it will take you many attempts. They only take a few attempts usually and I really enjoy the thrill of finally beating a boss that we have been trying to beat for a while. However there is not many ways to get better armor though and I have been stuck in my starting equipment for a long time. There is a lot of new weapons to unlock. In summary I recommend this game to anybody that is somewhat new to these types of games and it is good for people with experience too 8.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent Souls-like game. Far more detailed than its 2014 predecessor, more mystical, darker, more brutal, and more impressive. The two games now only share a few minor similarities, but the new Lords of the Fallen is poised to become serious competition for Dark Souls. The game no longer tries to be a mere contender, but instead showcases spectacular and well-thought-out elements that easily rival Dark Souls.\nI loved the ongoing and steady improvements - 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big thanks to the devs for making a huge improvement on the game. Still not perfect with some bugs but a good game to have nonetheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want it to be, this game is quite chill with a friend or two. I feel like the jump of going from solo to multiplayer in difficulty is not high at all which can be a big plus for some people that enjoy the graphics of a Souls-like but can't bear the difficulty. The weapon and armour design looks phenomenal and can make you feel very powerful (and ofc you are.... until that one boss). Anyway, I recommend it a lot. It's definitely up there with other games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, Co-op good, better then when it first released.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, its not perfect. That is okay. It is a competent soulslike, and a solid alternative to Dark Souls as a game. Takes alot of solid ideas, makes them work, and makes up some new stuff too, like the whole idea of the Umbral just confuses me how they even programmed it. A solid soulslike, with fun combat, and unique mechanics. Bosses are meh, but some are strong bossfights and others SUCK. Solid game overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so fucking good \n\none complaint i have is that the friends pass is kinda janky but thats forgiven\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid game that has come a long way from its roots in the best ways",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would never have played this game, if it wasnt for the solid co-op that they made so only 1 person needed to own the game.\r\n\r\nI wish more games had this, since it made a single purchase into 3, since we all wanted to play it solo too, when we were done with our co-op run",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has only ever been improving over time, especially since the 2.0 update. Definitely worth picking up before LOTF 2 releases",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best soulslike i've played and it's not even close, the gameplay, bosses and everything is just so perfect. i can't wait for LOTF 2 because i'm sure it'll be even better than this one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visually, it’s beautiful and a huge step up from when it was first launched. The difficulty feels spot-on — not too hard, not too easy — and the adventure as a whole is definitely worth diving into. I also have to say, the parry system is great.\n\nLords of the Fallen is an absolute blast. It’s incredibly satisfying to plow through mobs and take down bosses with that weighty, souls-like combat. The game really shines in co-op — running through areas together, exploring, and helping each other with tough bosses makes the whole experience twice as fun.\n\nIt’s not a perfect game, though. Some areas have glitches, and navigating certain zones can be confusing or frustrating at times. But even with those flaws, it’s still a fantastic time.\n\nOverall: 8/10 — highly recommended, especially if you enjoy challenging action RPGs or a great co-op experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun coop game just wish it did not scale down the power of your attacks so hard when together me and a buddy played lvl 1 to 50 together and feel like the damage is the same as lvl 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6.5/10 why?\nPros:\ngood exploration, the lamp is very original and a good addition to the souls like experience.\nCons:\nbesides the explorations the game is average to below average in everything else. Combat mechanis are meh. if you are looking for epic boss fights this is not your game, almost all bosses you can first time them, no sense of acomplishment.\nbuy it on sale if you want to cross this one off the list of finished souls like games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After the many updates this game has, it deserves its place in the soulslike podium stage and worth it for every person who wants to try a different approach to the soulslike genre. Waiting to see what the sequel will bring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The world looks great and exploring it was fun, even though I'd get lost quite often. It feels refreshing playing a souls game with these type of graphics, reminds me of playing the demon souls remake. The variation in enemies could be better, and I wouldn't mind some tougher boss fights. Overall solid game and looking forward to the 2nd one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First of all, I'm impressed by the dev's ability to remake an entire game. They could've scrapped the idea, but instead chose to remake the idea for the series. The lore is amazing and I'm excited for the next game! In Radiance, Judgement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great to play with friends, but there are major problems with the mechanics themselves.\n\nPVE: Great \nPVP: Dogshit\n\nzero scaling worth a shit with online play when levels do not matter when invading OR BEING INVADED. Maxed Meta slaves can genuinely invade your game from level 1 and while there is SOME scaling for damage, it doesn't matter when you compare it to their defensive stats and options for fighting. Currently you will see every meta aura on every invasion or invader, and its always the same. big defenses, spinning flails and frame traps that are really only able to be dealt with if you can take a portion of the damage (spoiler, you can't unless you're on the same playing field as them with buffs and end game options. the ONLY upside to this issue is the ability to turn off being invaded, and that's not a fix at all in my opinion, its just a band-aid that removes content from the entire community due to poor decisions on balancing. for context the soul series has a percentage above and below your level that can invade you, a more or less even playing field, allowing for actual fights no matter what level or area you're in, thats all LOTF needed to make PVP enjoyable, but even with 90% of the game being so deeply souls coded, they missed the most important part of the system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the 2.0 version of this game, with full co-op with a friend. As a co-op souls experience I thought it was really fun. The combat is pretty good, and the game is beautiful (albeit rather demanding to run). Level design was pretty good to, with secrets and unlockable shortcuts making return visits a lot quicker.\n\nThe souls 'gimmick' of this game is the second world overlayed unto the regular world. I thought this concept was really cool, but the implementation needs some work in a sequel. First an foremost, every map's umbral region has a similar look and feel, save one area that has a cool golden glow in umbral. Second, the same enemies appear in the umbral realm in every map, with a few exceptions in the earlier maps. This results in 50% of the game looking the same and playing the same with the same enemies spawning in, made the game feel more stale than it really is. Also, although the boss designs are very cool and inspired, I felt that the fights themselves were fairly mechanically simple. tbh I'd say it is excusable since this is their second attempt as a souls like, but I thought I'd mention it. The bosses aren't terrible, but they also aren't especially difficult.\n\nThere is a souls-esque multiplayer component to the game, where other players can invade to defeat you, and I thought it was really fun. I got steamrolled in the first half, but as I learned the game better, got better gear and made actual builds, I slowly started becoming the stomper instead of the stompee. Also death is not punished too hard in this game, since you can place temporary save points often. It is a really good system imo, when I experienced a trap related deaths or when a random invasion caught me off guard it wasn't the end of the world because I never lost a discouraging amount of progress.\n\nLast but not least, I found that the world they've built is very interesting, but the story is a little vague, and especially the NPC quests were very difficult to follow. I would find an item and not know why I was able to hand it over to an NPC, nor where they would go if they moved. A lot of souls likes do this so it's by no means a big mark against this game, but again I felt it worth noting, especially since there is an interesting story and interesting NPCs, it's just hard to learn what's going on, and what choices are the \"right\" choices to make as the story progresses.\n\nAll in all I had a good time with the game, and although I can not judge it as a single player experience, I'd say if you have a friend that is willing to play a souls-like with you then this is a really fun time. I am really looking forward to seeing what they do with the sequel, as seamless co-op was not part of the original design for this game, but I expect the sequel will account for it more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game looks great and the fighting is great as well but if anyone have played like any Dark Souls games or Elden Ring then the bosses out here in the game looks silly and weak once u build ur character up a bit it just becomes way too easy but the grind is good and I did have another friend to play with so i had a lot of fun and really liked the story so far. I only got 1 ending so far might try to get the other 2 endings later on for now i am kinda done with the game. I will highly recommend the game to all the players who wants to try souls like games for the first time i guess. I will give it a solid 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While it has its flaws, like some really stupid bosses, game is really fun, combat is engaging and for me atmosphere is phenomenal. I would give this game \"must play\" rating, no excuses.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game some of the graphics are not as good as the others and it stutters a little bit here and there but it is a great game over all and would def recommend to all others that like souls like games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember playing this back then and thought it was pretty unoptimized, glad they made the game better after 2.0\n\nHave to say the game is great! most bosses have fun variety, and the level design is top notch gorgeous, and what made it most fun for me are the builds you can work with, the combat is great even though I haven't tried the pvp. The Umbral realm mechanic is technically amazing to experience, love how you can switch through them to find secret loot and passages, though I'm not big on horror so at times its pretty scary. Not sure what it is though but by the end of the game everything does get a bit stale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the on the best souls games i have ever played. \r\nThe atmosphere and level design is so good.\r\n\r\nMy ranking so far:\r\n\r\n1. Dark Souls Remastered\r\n2. Dark Souls 3 \r\n3. Elden Ring\r\n4. Lords of the Fallen\r\n5. Lies of P\r\n6. Dark Souls 2 SOTFS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this game serves as a great entry to the souls-like genre. Not too difficult, especially with coop. And even if you don't have a buddy to team up with, for certain bosses you can request an NPC. Also, the game is great visually. I liked the different realms and the general setting as well, although a little more variety would've gone a long  way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere and the gameplay is superb.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent Souls-Like, de belles zones des armes et armures variées avec tout un panel de sorts qui lui l'est tout autant.\r\n\r\nPetits soucis d'optimisations pour ma part mais j'ai réussi à gagner pas mal de frames en retirant l'overlay steam si jamais ça peux aider.\r\n\r\nVraiment très bon jeu l'un des meilleur souls-like ♥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never played it on release.  Started with 2.0 and I have to say, while it's not perfect (few games are) it's absolutely phenomenal.\r\n\r\nThis is the peak of Dark Souls 1/Bloodborne style world/level design.  \r\nThe way the world loops in on itself.\r\nThe combat is fantastic. \r\nThe buildcrafting is excellent.\r\nThe drip is immaculate.\r\nThe lore is sick.\r\nThe game is just oozing with atmosphere.\r\n\r\nIf you want Dark Souls 4.5, here you go.  You have it right here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has come a long way since it's launch. While it's pretty easy as far as souls-likes go, it has some great combat mechanics that make for a very fun core. Movement is quick, responsive, and smooth. Level design that feels oppressive and rewarding at the same time, linking many areas in unexpected ways--only Dark Souls 1 and Sekiro have done it better imo (Forsaken Fen is NOT part of this praise). Each weapon class feels unique in its moveset and the ability to mix-and-match your movesets mid-combo feels awesome. It has the best ranged/casting/throwing control scheme in the genre such that even the thickest of bonk-builds have fun throwing rocks and spears. A block system that utilizes a rally-healing to keep sword-and-board engaging but also rewards perfect blocking, which deflects on an opponent's posture bar for a riposte. All of these work well in PvP, where scaling is much better now too which feels great in the ranges of lvl 30 to 150, anecdotally since October 2025 balance patch. PvP is off by default and can be opted-in, which means all these encounters are with people who want that experience.\n\nHowever, as great as the movement and combat feels, all weapons within a class share the same moveset. Only fully upgraded boss weapons and some quest weapons get a unique attack, although 2 or 3 weapons stand above the rest as being overtuned. Bosses are easy, but can be replayed at any time. All the non-Remembrance bosses show up as regular enemies shortly after or later in the game. Enemies fall into three factions, of which 80% of them you meet early on, so later sections can only add one new enemy if you're lucky. This enemy variety is easily the biggest issue with the game, especially as most of these enemies fall over under a soft breeze. Considering holding back weapon upgrades as you progress otherwise even big enemies will die in one hit.\n\nOverall it's a very fun, co-op oriented introduction to the souls-like genre. I think it's the most accessible of its type and the friend's pass is excellent value. Lack of enemy variety is a disservice to its combat system, but at least everything is fun to fight with and the game provides near-unlimited respecs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the first one so had some reluctance on this but it was really good. I didn't experience it at launch which is I guess where some of the less than positive reviews must have came from. This is a great game to add to the list of successful soulslikes in my book.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game's good, though there are some \"buts\". \n\nAs for positives, the levels design is REALLY good, it has a soulslike bread and butter of labyrinthine maps, but the game manages to avoid the classic toxic elements that so many others feel the unquenchable need to include just because FromSoftware does. That means LotF doesn't have the \"mandatory\" poison level designed strictly to make you as miserable as possible as you drudge for 2 hours knee-deep in poison. It doesn't have the second \"mandatory\" high-elevation level of mobs shooting at you from half across the map while other mobs jump out from behind crates to attempt to knock you down. This alone is such a breath of fresh air in a genre that is mostly trying to outdo the competition in how much you can break the players' balls rather than try something new and unique.\n\nNow, LotF does have something that is absolutely new and unique - the lamp mechanic. This is not a simple gimmick, the world is actually split into 2 dimensions that almost fully overlap - and they do that in real time. It's not a simple switch/lever mechanic that actually just reloads the world without you noticing, you can actually just flash the lamp for a second and see mobs in the second dimension, and they can see you and try to drag you there when you do. All that ties perfectly into the level and the entire world design and is easily the game's strongest point. The game is worth playing just for that alone.\n\nThe game sadly also has 2 fairly big negatives. First, the walking animation. Oh, the walking animation. Especially with great weapons, it looks so artificial. The weapons actually look like inflatable sticks (only while walking, though they do look and feel like they have weight when swinging), but that's not even the worst part - that would be the fact that there are no footsteps and the character moves so fast that it feels like it's just hovering a few milimetres above ground. I don't know how that was approved, you'd think in a game where you mostly are running around, the animation needs to be mostly perfect.\nSecond, the difficulty level. I've played the game in 2025, I've seen mentions that it was extremely hard when it just came out back in 2023 - unfortunately, that is not the case anymore. The game is by FAR the easiest soulslike I've ever played, it is actually just trivial - great weapons allow you to kill most bosses within several hits (4 was my record while playing the game normally, I'm pretty sure I could go down to 2 or 3 with some min-maxing), and then later in the game you get access to an item that allows you uninterruptable charged attacks while the damage you take while charging is coverted to recoverable health - which means you're essentially immortal as long as you don't die while charging the attack. That completely breaks the game and while obviously you don't have to use that build, the fact it's allowed at all is baffling. I suspect it wouldn't be much harder with other builds, though - the bosses really don't deal much damage and have little HP.\n\nIf you can overlook both of these issues, though, the game is really worth playing just for the lamp mechanic, which is actually a small revolution in a genre that is getting pretty stale with the gameplay and map designs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like souls-likes the game's alright.\n\nThe movement feels pretty janky at times and i don't undertand whats happening at any point in the game.\n\nThe game has a good character creator tho, i like it a lot. Also the coop its alright.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have not played too much of the Dark Souls series, so I would say I have a fairly neutral opinion on what the game is for what it is. It's baffling this game got so much hate either way because, as a standalone game without comparison, it hits plenty of marks. I can't speak for the launch because I have only played v2.0. \n\nThat notion aside, LOF has fresh ideas and is very accessible for newcomers to the genre because it's in a sweet spot when it comes to difficulty (I did play plenty of Souls-likes that at the very least felt much harder than LOF). For example, the bosses get hard, and you'll need to learn patterns, but not so hard you'll be stuck on them for days or will be in need of watching someone on YouTube do it to learn the moveset of said boss. It's a true modern game when it comes to graphics while surprisingly also performing fairly smoothly. It has been forever since I have been so impressed by the looks of a game; the matter of detail in the textures of the map, the theme and art style, the stellar lighting effects, the enemy designs... clearly the developers cared about what they were making. \n\nAll things considered, if you like dark fantasy and adventure games that are of acceptable difficulty, then just ignore the gatekeepers and buy it! This game won't disappoint!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good.  Its much better than i expected.  I wasnt a fan at first, but its grown on me, and the combat is much better than it was the first time i tried it.  It seems easier than Elden Ring but the combat is familiar.  After finishing the game I can confidently say give this game a try.  I felt this game was easier than most soul likes i have played.  Sikero, Khazan, Wuchang, Wu Kong, Elden Ring, Etc.  Doesnt mean its not enjoyable, in NG+ there are modifiers to increase the difficulty.  This game got alot of hate but its worth revisiting, as i did.  I'm glad i did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game deserves some love. I bought at launch and couldn't play, thinking my own computer was to blame. I've since learned that the release was rough - this, among many other things, the devs have fixed.\n\nIt's a blast, scratching the itch I've had since DS3 which I've replayed enough times to really appreciate something fresh. On the surface it's re-flavored dark souls, with essentially every key gameplay similarity down to the leveling and item upgrade mechanics. Tons of weapons and armor in my experience so far, with the character build options you'd expect from such a similar title. Exhausting dialogue, checking every corner for shinies, reloading areas to move npcs around, the whole shebang.\n\nHowever, the Umbral lamp mechanic certain adds a new layer to the gameplay to both compbat and exploration. A very fresh experience that I'm enjoying a lot. Combat mostly feels great.\n\nI have few gripes, I would have liked to see more enemy variety and there are a few level design choices that had me scratching my head. However if you're looking for a soulslike, you can't really go wrong here. Props to the devs for pouring into resolving the issues at launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like dark souls 2 this is your game, devs update for the total of 12 people who are still playing it which is awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a solid souls-like.. Next to Lies of P, Lords if the Fallen pays homage to Dark Souls in the best ways and delivers. If you've only played Elden Ring this might be a little different than what you're used to. I really enjoyed the seamless multiplayer option.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic intro into the core soulslike genre for any curious souls. It comes with all the bells and whistles such as rpg based stat builds, to metroidvania maps and secrets, to completely broken buggy tedious completely mindless in design, quests that hide the best loot or even endings behind the vaguest of requirements.\r\n\r\nWith the various different modifiers available from your very first run, its a sure win for best casual coop romp through hellish soulslike on market. Enjoy the cemented souls design in all its radiant ups and infernal downs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a solid 7.8/10. Not bad but not extraordinary. It has some nice mechanics like the umbral realm and the abilities associated to it. The game does tend to feel a bit hard to figure out quests for sometimes, but it is overall a solid package for the price. High hopes for the sequel !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Criminally underrated game, arguably better than a lot of soulsborne games. \r\n+ insanely good map & level design\r\n+ very satisfying combat \r\n+ shadow realm is extremely unique and makes the game play out so different. \r\n+ 2nd life like in sekiro if you die in human form\r\n\r\n- little repetitive enemies (ng+ has option to randomize them so W)\r\n- bosses are easier than DS1 bosses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What to say, the game is pretty awesome in a lot of aspects, but there also a lot of room for improvements, inventory managements for once and quest designed would be another one. I understand going in blind to not spoil yourself but I missed some quest in the most stupid way possible. \r\n\r\nLuckily, I didn't run into any bugged quests, I think the recent update have fixed all of them, it just the progressions and fail condition were so obscure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fresh take on the souls like genre but with a way better coop system. Having a blast so far with my a friend on a shared progression coop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aside from the Fromsoft lineup of SoulsBorne/ Elden Ring games, this is by far one of the best Souls-likes in the genre that I have played! If feels like a mix between DS3, Bloodborne, and its own original thing. Very fun in solo or co-op. I havnt tried pvp yet though, so I have no opinion on that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have enjoyed many souls-like games but this one is my favorite for co-op, the combat is pretty fun and the areas are disorienting but fun and rewarding to explore, the bosses are cool and the story is engaging. Overall the game is a 9/10 love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ja, aber es ist zu leicht.\r\n\r\nLords Of The Fallen möchte ein Soulslike sein - ist es auch.\r\nKlassische dystopische Fantasywelt mit verschiedenen Enden und Dark Souls Mechaniken.\r\n\r\n- Die Performance ist nicht optimal.\r\n- Quests sind verwirrend, mit sehr viel Rückverfolgung behaftet und sofortigem Questabbruch für das NG, falls man zu früh die nächste Tür öffnet. Ohne Guide kaum zu schaffen.\r\n- Bosse werden sofort nach dem Bosskampf als normale Gegner recycled und die allgemeine Gegnervielfalt ist nicht gerade hoch.\r\n- Die einzigartigen Bosskämpfe sind vom Gameplay in Ordnung, nur fast alle für meinen Geschmack einfach zu vorsichtig im Umgang mit dem Spieler - die Kämpfe sind zu leicht und die Lernkurve eher flach. Mit einem zugeholten NPC teilweise trivial.\r\n\r\nEs gibt jedoch viele QoL Features, die das ganze positiv abrunden, wie z.B.\r\n- Modifikationen für's NG (Randomizer, weniger Leuchtfeuer, voraufgewertetes Loot, etc.)\r\n- Die Möglichkeit innerhalb eines NGs dieses zurücksetzen, und seinen Charakter im aktuellen Zustand behalten zu können, ist mit das größte QoL um Quests zu vervollständigen, ohne einen neuen Charakter erstellen oder ins NG+ für härtere Gegner gehen zu müssen.\r\n- Die Waffenvielfalt ist hoch und es lässt sich eigentlich mit fast jeder etwas anfangen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but a little expensive in my opinion even with 50% discount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots to love here if you're a fan of games like Dark Souls and/or Elden Ring. Very interesting concept with the Umbral Realm. Combat feels very good and it isn't so hard (as of yet) that I want to bounce my head off of the desk.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok, i've been into this genre since the release of demon souls all those years ago. \nMany have come along to the souls like genre but very few fit the bill. \nThis game at launch lost me when i seen the reviews so i didn't purchase it, however with the 2.0 release after a bit of info digging i decided it was time to try this title the worst that could happen is that it disappointed me like 90% of the others that tried to live up to souls.\n\nHere's my review, I'm now about to click over to my third straight playthrough.\nTo the dev's - thank you for all you've done here.\nTo everyone else - Just buy the F$#KING game you will not regret it.\n\n10/10 will pet dog again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lord of the Fallen  Review\n\nWhen I first played Lord of the Fallen on my old Steam account, I actually found it quite enjoyable. However, the performance issues were pretty bad at the time. Now that I’ve come back to try it again, I can say the developers have really improved the performance. The game now runs smoothly, and I no longer have to worry about stutters or FPS drops.\n\nAs for the gameplay if you’ve ever played any Soulsborne titles from FromSoftware, this is a game you shouldn’t miss. Lord of the Fallen includes many mechanics that fans of Demon’s Souls, Bloodborne, Dark Souls 1–3, or even Sekiro would find familiar. I often see people saying that the controls feel too complicated or that the regular enemies are too tough. But honestly, to me, that’s perfectly normal this is a Souls-like game, after all. If it were easy, that would be strange, wouldn’t it?\n\nI’m trying to be as neutral as possible here I’m not trying to overpraise it. I’ve played many Souls-like games before, starting with Dark Souls 1, then Demon’s Souls back on the PS3, followed by Bloodborne, Sekiro, and finally Elden Ring. But Lord of the Fallen really gives that familiar Souls-like atmosphere while still offering its own unique feel. So if you’re looking for a fresh take on the genre, I’d definitely recommend giving it a try.\n\nOh, and I almost forgot the online system is surprisingly good for a modern Souls-like. In most FromSoftware games, if you or your friend dies (or when the boss dies), everyone gets sent back to their own world, right? It’s kind of annoying because you have to summon your friend again every time, and some areas don’t even allow co-op at all (any Elden Ring players will know what I mean).\n\nBut Lord of the Fallen does it differently you can play with your friend from start to finish. Even if one of you dies, the other can revive them, and if both of you die, you’ll simply respawn together at the last checkpoint. Sounds much better, doesn’t it? On top of that, you can even disable invasions, so if you just want to enjoy the journey with your friend without interruptions, you can.\n\nIf you love Souls-like adventures and want to experience one that lets you explore the entire journey side by side with a friend, Lord of the Fallen is absolutely worth trying.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Got to play Co op with my friend, Constant crashing and clipping through the map to my death.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I got this game to play with my friend but due to bugs where the guest doesnt get the healing upgrades, or the lantern upgrades,....or the boss souls\\armor\\weapons, i can not recommend this game until the bug is fixed i will not change the review until then. If there is seemless co-op then both players should be able to do everything the other does or at least be able to get non story mode items.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i just couldnt play anymore. i cant be arsed finishing it. for the most part everything about this game is fine. the combat feels weighty and theres numerous spells and builds to chose from. but what made me stop playing and uninstalled was the god awful level design. some of the worst ive ever seen in a game. most of the time your running around in circles with no idea where your supposed to go next. you have a moth trail thats supposed to guide you to the next area except it doesnt work, and god forbid you try to read any of those atrocious maps the game gives you. good second go around after the disaster that was the first game but just doesnt hit the mark. il be avoiding the sequal like the plague. thanks for reading and hope this helped. xx",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i have no idea whats going on here but im not getting any sound in cutscenes, not the opening game cutscene or the first story cutscene.\nI've looked it up and it seems to be a rare bug? all my sound settings are as they should be. and verified files. sad to give a bad review without even getting to play the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game clips, disconnects, and crashes far too frequently playing co-op... very sad.. is a fun game but this part makes it nigh unplayable for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is fine for a casual playthrough and is an ok soulslike at best.\r\n\r\nBUT, if you're someone that strives for 100% completion, STAY AWAY FROM THIS ONE.\r\nThis is such a chore with achievements such as ''Collect all armor'' Collect all weapons'' ''Find all Stigmas'' ''Collect all XYZ''.\r\n\r\nAn ok Soulslike brought down by baffling design choices and lackluster enemy variety.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "kinda lame, whole game running around using lamp on every wall there is, literally.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game doesn't really want me to play it.\r\n\r\nI got the game initially on PS5 on launch day, the performance and FPS was very very bad, from drops to stutters and even crashes which are quite rare on consoles. I pushed my way like a valiant Crusader and made it end game, then the random invading started, the end game area which made the game crash every 5 minutes, and many late game trophies got bugged. On the first major update my save was wiped and I said goodbye to it.\r\n\r\nHow about Steam, well let me tell you this, the game is really an upgrade both visually and combat wise compared to the 2014 game, I really enjoy the story, the NPC's, the side quests, everything is good.\r\n\r\nMy problem ? why I can recommend this game:\r\n\r\nReason 1 - Performance \r\nEven 2 years since launch, the game is riddled  with bugs, performance drops and crashes, I was thinking PC might be better optimized but no, it has the same issues as on consoles.\r\n\r\nReason 2 - Trophy/Achievements \r\nMany trophies from this game get bugged, don't pop or they just lock you out without any reason, I had the same issue on Byron not getting his trophy even though I did all steps exactly in order, same for Hero Worship, exact issues I encountered on the PS5 as well, and this is just 2 trophies, you randomly get locked out of many others just because...reasons.\r\n\r\nAll in all the game is a completionist's nightmare riddled with many random bugs and misses, and the performance remains atrocious even 2 years since launch. If you only care about the story I guess you can go ahead and try it out, but if you want to do any sides or 100% it, its a hard pass.\r\n\r\nI cannot recommend the game in it's current state, let's hope Lords Of The Fallen 2 is better from all points of view, I really enjoyed the game but everything described above made me never want to touch it again and remember this is coming from someone who purchased the game on 2 separate platforms with Deluxe edition.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like Dark Souls, then this is right up your alley! I personally do not know, but my friend does and he enjoys the heck out of that game and this game! We tried to do a Co-op game where I got to play with him as he had paid for the game, and it is NOT my jam. The graphics are alright, it is definitely a fever dream of a hellscape so that is what you are pretty much running around in. I found the game play jarring, having to press and hold more buttons down than I am use to just to switch between tools was a bit much for me. Also, picked a ranger themed class but fair warning if you do as it appears finding ARROWS is limited so yea... Enjoy swinging that axe. To me this game is if you started to play Diablo but instead of story-line quests you are dropped in towards the middle on a battlefield and was told \"GO!\" without any context. \r\n\r\nIt could be different not on Co-op, but I'm not going to waste my money on a game I don't see myself enjoying. If you like this game, awesome! Not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I feel like this would be a great game if it had more time to cook. The environmental artists did an amazing job on the world. The items & upgrades allow for some really interesting builds. Some areas really shine in how they're designed. The map is all interconnected and fascinating to explore. Some enemies are really fun to fight, big fights where you can read each individual enemy and you feel smart as you time your dodges/blocks/attacks. But generally enemies feel really spammy. The problem is not that it's hard, I'd say the whole game is not that challenging for it's genre. The problem is that it's just not interesting to fight. \n\nThere's the occasional crash, random disconnect, blacked out cutscenes, getting stuck in the terrain or bosses that don't trigger. But that's nothing a restart doesn't fix. It's the sync issues that are a big problem. Due to sync bugs the partner misses important upgrades or loot, quickly falling behind.\n\nIts worth giving it a try if you can get it cheaply and have a friend to play with. Despite all the issues I still enjoyed playing it with my mate. But I'd probably recommend waiting for the sequel",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I need to give this a no because of how it is promoted as a souls like. At launch that was too true. The game was brutal. However after some updates, maybe 2.0, the game has been nerfed behind belief. I was not sure at first but having found out for sure I am brute forcing everything just to see if I can. Just too easy no need for any strategy. In fact strategy gets me killed more against bosses. Normal enemies can swarm me and just can't kill me. I am just sad that it is so dull of a \"souls like\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible, frustrating game. It’s far too cryptic about where you’re supposed to go, and not in a mysterious, intriguing way. Leaves you stuck 90% of the time just trying to figure out how to progress. Co-op is clunky and far from seamless. There’s almost no variety in enemies, and the ghostly, umbral world the game keeps forcing you into is the most visually dull experience I've ever seen in a game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game to have a shared progression coop experience with my friend on PS5. The first 10 hours or so were mostly smooth, with only a few glitches that weren't a pain to deal with. After that, it just kept getting worse and worse. Constant glitches, crashing, frame drops, a few times my PC even restarted by itself. I've tried lowering my graphics down to the lowest possible setting, limiting to 60 FPS, verifying file integrity, reinstalling gpu drivers, reinstalling the game. Nothing. Now I can't even go a minute into a boss fight without the game crashing.\n\nFor reference my system has a ryzen 5 7600x3d and an rtx 4070 super. This should be more than capable of running this game at a stable rate.\n\nIt's really such a shame because I love the atmosphere of this game and when it was working it was a smooth and fun experience. I'm not sure how the experience is when doing coop on the same platform, but if you're planning on buying this game to play with a friend on another platform, I'd steer clear until there's a fix.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game.\nNarrow passages, to much constantly swapping back and forth from the regular to the Umbral realm-should’ve just made the game entirely out of the umbral realm since you’re going to spend 75% of the game in there.\n\nGame is a soulslike but is constantly in your face telling you that it has its own identity.\nShortcuts don’t make sense since chances are you’re not going to go back that way. \nAnd for the love of god tooooo many locked doors and contraption puzzles that it’s downright tedious.\nEarlier I got a key and opened a door only to be met with a contraption that it wouldn’t work until I solved its puzzle.\nI will not be replaying this game ever in my life. \nI’m going to beat just for bragging rights but it has not been a fun experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got to play it with my friend who's very fond of soulslikes. It… wasn't enjoyable. It's not a bad game, though I didn't find it enjoyable. Most of the time it was frustration – filled with lags, bugs and crashes. I've only played coop and I wouldn't recommend it. I don't know much about singleplayer tho. Solid idea, not fun execution.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "combat feels awful and clunky, game design is boring and annoyingly religious, hell nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent game, unfortunately even with all the ingredients that make a good souls like, it is lacking the engagement and thrill when it all comes together.\nPaladin's Burden : Summarises the Dev's poor choices.\nEbb and Wayfarer : Fight in alley and spam attacks before the NPC kill you, wildy poor design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2] An enjoyable experience for about a dozen hours until the lack of enemy variety bored me [/h2] \n\nThe game isn't terrible by any means. Graphics are absolutely gorgeous and environments are quite interesting to explore and go through. Very interconnected design, though can get exhaustingly complex at times. Animations are OK, definitely janky and a bit stiff but tolerable nonetheless (aside from the spear animations, those are horrendous). Voice acting is moderately weak but story doesn't matter in a game like this anyways. \n\nI enjoyed my time with this game but whilst exploring an expansive castle level I got hit with the unmistakable feeling of sheer boredom. It was caused by an abundance of enemies that are almost all reused from the very first level onward. Basic mage stick guy, two-handed mace guy, crossbow dude, one-handed mace shield guy and some dogs over and over and over again. \n\nThe Umbral Realm is even worse about this. It's just a bunch of waddling zombies and occasionally a fat fly, rare sickle dudes and a few big guys who only take damage from behind. But it's just 99% waddling zombies which gets very old, very quick. \n\nEnemies you encounter as minibosses are quickly turned into mob types that are littered throughout the next levels, only adding to the tedium as you become more familiar with them. One of the worst offenders is a large two-handed weapon type of enemy that has a few distinct models but each one uses the same exact moveset. \n\nI'm no stranger to reused enemies, I love Elden Ring and it has plenty of recolored / reused enemies. But ER nonetheless has a vast quantity more enemy variety compared to this game. Even Limgrave and Weeping Peninsula alone has probably triple the amount of enemy variety compared to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In a game like this dodging is ALL. If the commands are unreliable the game value drops much. Nice on every aspect but as long as control sucks I cannot give this game a positive value. Unlucky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time on this game.\r\nAt first I played through half the game singleplayer on xbox gamepass, but then dropped it because it simply was not fun and EXTREMELY frustrating.\r\nI picked up the game on a steam sale, as I saw they introduced a friend pass system to play through the whole game in \"seemless\" coop. Let me tell you. The coop is not seemless. It had many issues and bugs.\r\n\r\nALL bosses in this game are either a gank or a gimmic fight. The final boss is legit a JOKE. It's actually sad how bad it is.\r\n\r\nPlease don't waste your time on this game. It simply is not fun at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly boring. Boss design is so lame. Fighting the same 5 enemies over and over again. Full of areas where you get mobbed while also dealing with ranged attacks. Barely better than the original. Waste of time and money. Do not buy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Welp, 94 hours later (Just on \"Lords of the Fallen 2.0\" and this game is fully done. Everything, all items collected, iron man modes done. all quests. I can say, my advice to players asking if they should try it........skip it and wait for Lords of the Fallen 2, but watch reviews first to see if it'll be worth it,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played & finished, because I lost a bet.\r\n\r\nMost similar to dark souls 2, without any of the wall-hitting or targeting issues. A whole lot of running around in a big map unlocking checkpoints, so you can go back to heal to unlock more checkpoints.\r\n\r\nNot great, puzzles are never hard, only annoying. You can get lost a lot for no result, luckily with some areas you can use the butterfly guide.\r\n\r\nEvery time you start to enjoy an area, it gets dragged on too long. Boss fights are the same way, you start to enjoy it, then you realise those were all the moves (5 moves max). None of them are hard outside of burn gimmicks that cheese your health.... Which tracks as most of them become regular enemies.\r\n\r\nWouldn't recommend, but it isn't as awful as Dark Souls II",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you've been the original FromSoft Souls series and Elden Ring, the gameplay and combat will feel similar but shallow. If not, then I encourage you to try Dark Souls 3 instead of this.\n\nJust like DS3 and the other games that came before Elden ring, it is not an open world. In the case of Lords of the Fallen however, the level design is very bland and the parallel \"shadow world\" doesn't make the experience richer, it makes very annoying. Everything about this game is annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some of the most boring mechanics I’ve ever seen in a Souls-like. Why would anyone think it’s a good idea to implement loot that literally kills you when you pick it up, with no way to tell if it’s real unless you’ve already been there and looted the place? The first five hours were pretty enjoyable, but then it just went downhill. Fifteen hours in, and it’s nothing but enemy reskins. The game has become a chore rather than anything else. I’ll finish it, but it’s going to be painful.\nps : the enemies that are only designed to push you off the ledge are also a pain in the arse...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly don't even waste your time to give it a chance. played through the whole game hoping it would get better, but there were only 2 actual souls like bosses, the rest just use dumb gimmics and AOE's the whole time. And every boss becomes a normal enemy like 2 meters outside their arena. The final was just a enemy wave type fight of normal enemys?????????????????\r\nI played on the friends pass with someone, and most of the mechanics didn't work for me because of that. \r\n1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is SO MUCH shit wrong in this game I don't even know where to start. I just finished the game hoping that my love for this game will not die, but here I am leaving this post.\r\n\r\nThe whole game is bugged, sometimes some mechanics works and sometimes they don't. I had to reboot it at least five times just last week to even make it open. And it's not like I have a cheap PC, it costed me 6300$ to build it. \r\n\r\nIf you like knowing a story's game, then don't play Lords of The Fallen. It really have no meaning whatsoever and it's really difficult to follow. You're constantly looking for important NPC everywhere on the map. They always end on a random hallway you went one time. (And believe me, Youtube was my best friend at that time, cause there's no logic. You can't just guess, there is no logical clues even if you TRY to follow the story.) Same thing for some important loots, they get on random places that doesn't even get mentioned in the lore. \r\n\r\nI died a lot of time because the room I just went just disappeared and I went under the map. I lost all my vigor and couldn't recover them. \r\n\r\nIt's even more bugged on co-op. Playing with someone else is HELL.\r\n\r\nThe end is really disapointing. It's like they didn't even wanted to finish it. Also there is supposed to have 3 different endings but once you claim ONE beacon, you just fucked up it all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Constant disconnects in multiplayer make this a 100% not buy if you plan to play co op.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is in a completely unplayable state.\nGet the books to give to the vendor to unlock the item and no item unlocks, the only fix is to either finish the game and go NG+ or just start a new game and try again.\nOnly bonk-build works.\nOther than that, exploration is limited, boss battles are simple.\nIf you want a Co-Op version of a game similar to Elden Ring, there isn't one. Maybe Remnant 2, but definitely not this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't care if they add a version 200.0. The enemies are garbage, but you have to love them, because it's the same 3 enemies copy and pasted throughout this entire game. They jump you and gank you, and when you finally make it to the boss, you steamroll it. If you want to play a game that gives you almost 0 satisfaction for accomplishing things, play this game. JUST FINISHED IT THE ENDING IS DOGWATER THE FINAL BOSS IS A 0/10 😭😭😭",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wouldn't recommend this game except for ultra die hard Dark Souls fans in seek of a souls like. The developers have apparently updated his game so it's better and doesn't include identity politics anymore, and yet it doesn't make it a good game neither. It's pretty average.\n\nLevel design is very annoying because of it being way too much labyrinthine, heavily corridor-like, and with the usual camera problems coming with it. Exploring areas is not satisfying, even tiresome, and too often for ending up backtracking a lot without knowing really where to go next. It's the real challenge of the game, not even the bosses, and to the point of being annoying enough to just leave and uninstall the game.\n\nGame's difficulty is too uneven. Most of the time you just run on the game, and suddenly the game becomes way harder and even frustrating for no good reason.\n\nOtherwise, as a good UE-based game, it stutters very often with huuuuuge frame drops in your \"base\", and the snowy area particularly has beyond garbage performances.\n\nAll in all, this game achieves at least one thing very well. It just made me want to play Elden Ring again. Game's atmosphere is good, and combats are satisfying, at least when they are not too visually messy and cluttered, as is the case with some bosses. Game's ending is... disappointing to the least.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful and a good clone of Dark Souls, but the tediousness of the swamp maze finished it for me early.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game made me realize why I'm done with Souls-like game. The time is too often not well spent. On some level, this is a shame because the artwork of this game was kinda cool, as were the cynical vibes of primitive religious fanatism and mindf***ery (Adyr's rant at the end was pretty flavorful too). But the mechanics were clunky as fuck and not artful at all. There was too much needlessly unrealistic absence of movement cancel and too much absence of impact feedback on hit. And the absence of a map, and the eventual moth trail that stops working ... Jesus f****g Christ ...\nNo next enemy auto lock on ... Why ?!  Just why ?!\nIt does not add any \"realism\" to the fight , it just plain subtracts from it. AND it renders the whole fight, the whole scene, just UNPLEASURABLY AWKWARD AND UNARTFUL.\n \nThe drudgery and un-artfulness of battling enormous enemies  with such poor mechanics renders the whole experience unrewardingly tedious. The physics of it so defy logic that if you add on top of that that odd unresponsiveness or artificial clunkiness this game had, it's just not enjoyable.\n7700X with a 4080 ... so it wasn't my rig.\n I don't find the labor intensive equipment shuffling to **p r e c i s e l y** tailor it to enemies or bosses strength\\weaknesses to be worthwhile when you can die so quicky. Defeating a boss becomes so partly dependent on positional luck on any given attempt that it robs you of sometimes legit, pleasurably artful and successful combat hit streak by getting killed way too often because of punishing 1-2 hit kill shot coupled with clunky movement mechanics that get you stuck on the environment or simply because of the needlessly awkward \"run\" activation mechanic. \nI mentioned getting stuck on the environment, this game is something else in that department considering how it impedes fluidity of gameplay. The game feels very unpolished.\nIt's actually incredible how little games have improved the refining and granularity of motion in the environment over the years despite that much of  an increase in compute power ... it's actually pathetically sloppy.\n\nThese games rob you of the pleasure of sinking in the artwork and storyline ... often the very means this artform is meant to provide escape from life's daily drudgery. The average gamer is getting older, and I don't see why the offer of artificial tediousness masquerading as difficulty could much further provide worthwhile ARTFUL and pleasurable reward\\effort ratio.\n\nIs it simply because this game wasn't a 'AAA' title ? I don't know ... it's a shame because there were a lot of qualities to the artwork,  enemy and environment designs, but it seems to have been grafted on a sloppy dime-a-dozen unpolished cash grab structure ... \nIt's been said before : \"You got to respect a player's time\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't recommend this game whatsoever. I've tried it 3 times and just cant get into it at all, its a shame because I do like the aesthetic and weapon/armor design but that doesn't make a good game. Play Elden ring or lies of P Instead Thank Me Later.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It plays like about the same as other souls like games. The new mechanic doesn't do it for me. I feel like it just makes the game more annoying. It just makes it more of a puzzle everytime you explore. The rolls also feel really weird. Overall it's fine but doesn't compare to any of the FromSoftware titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was a major disappointment coming from a soulsborne fan. If you're thinking of picking this game up, just replay Dark Souls or Elden Ring don't bother with this garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not that fun, the combat feels floaty and stiff, even DS1 from 2011 is more polished in comparison.\n\nThe umbral mechanics makes thing tedious and complicated.\n\nPerformance still falls short, too many framedrops.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The original aped Dark Souls, this one apes Elden Ring. The combat is so-so, the level layouts are often confusing, and the fact that you do the alternate dimension thing doesn't do any favors. There's some sick character designs in this one though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit movement and no weight in attacks shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good:\r\n-Cool armor designs\r\n-Umbral light mechanic/shifting between dimensional planes\r\n-Combat/enemy telegraphs are ok. Enemies flinch when you expect them to.\r\n-Impressive visuals\r\n\r\nBad:\r\n-Not enough bonfire placements, resulting in long, time-wasting jogs back to your point of death.\r\n-You can't pause the game, so you can't switch out consumables without being attacked.\r\n-You end up spending more time in the umbral plane because if you don't, you might miss out on key paths, items, or even vendors (in the your hideout for example).\r\n-The game doesn't really explain much with regards to the quest items or currency you get or people you meet. There were times I didn't know you were suppose to hand in quest items to certain people, or times a vendor randomly popped up in the main hideout hub, or times certain people in the hub could do certain things like upgrade your health if you talk to them enough. Some hand-holding on the initial on-boarding/intro of the game/intro of new mechanics would easily fix this.\r\n-The map items are useless and indecipherable. What are we suppose to do with it? It's just random drawings of certain areas of the maps with no sense of navigation.\r\n\r\nThe deaths and frustrations I've experienced in this game are a result of poor design choices, not mistakes. I could've continued playing this game if it didn't waste my time with bullshit long runs with no bonfires. Coupled with bullshit enemy placements designed to grief you, they happen so often enough for me to stop playing all together. \r\n\r\nConsidering this is suppose to be a \"2.0\" version of the game, I can't imagine what this game was like on release.\r\n\r\n5/10, just straight up bad execution of good ideas.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "##########\r\n## General ##\r\n##########\r\nOverall, the feel of the game is nice. Decent storytelling, gameplay is smooth and fun. There are loads of weapons and builds to try out.\r\n\r\nGeneral: 7/10 \r\n\r\n##############\r\n##  Level Design ##\r\n##############\r\nThis is the most horribly designed game I have ever played in my life. Hands down. Not only are the levels built like a maze, but the entire game is this way too. The amount of times you need to backtrack makes the game not fun. I have never played a game that feels so disorganized. Any time you have players think, \"I just can't wait to be done with this game,\" you're doing it wrong. I can't tell you the hours I've wasted backtracking in this game. Getting around is more of a chore than having fun exploring. I find myself sprinting through levels just to get done quickly so I don't get lost and have to remember the 10,000th place I've been that *might* be the right place to go next. It's made me not want to finish the game or play the next one when it comes out. I truly hope this is fixed in the next iteration. It's like the devs thought: \"I don't know how to make this game seem longer, so let's just make them guess where to go.\" There are many times where you'll go down a path and progress, only to find that's just one area that you needed to go. So now you have to backtrack to a different location, find another path, progress there which may or may not unlock a shortcut for a different area, then rinse and repeat. Over and over again. It's like the game was designed with 10 different devs coming up with their own ideas and then they mashed them together at the last minute and hoped that the levels connected.\r\n\r\nLevel Design: 0/10\r\n\r\n###########\r\n##  Combat  ##\r\n###########\r\nI've found the combat to be very, very fun in this game. They do dual-wielding right and I personally love the 2H axe moveset. I've always been a fan of Unga Bunga builds and this game has a lot of great weapons for that. Besides that, there are weapons for any playstyle and there are great builds for ranged combat, spellcasting, or assassin type classes.\r\n\r\nCombat: 8/10\r\n\r\n##########\r\n##  Bosses ##\r\n##########\r\nThe bosses are hit or miss. There are some very fun boss fights. Most provided a decent challenge, but they were no where on the difficulty level of Dark Souls or other Soulslike games. The main gripe I have with the bosses (spoiler free) is there was one with ads, which was completely unnecessary. It's spoiler free because I can't even remember the boss's name, which leads to my next point. The bosses are extremely unmemorable. I will never forget fighting the Nameless King, Darkeater Midir, Consort Radahn, etc. But if you ask me who was the hardest or most fun fight in this game I would be grasping at straws trying to remember anyone's name.\r\n\r\nBosses: 5/10\r\n\r\n############\r\n##  Summary  ##\r\n############\r\nThough I really enjoyed the story, the lore, the gameplay, and the combat quite a lot, the level design was an absolute killer for me. There's no way I could recommend this game as a result. It makes it beyond frustrating where playing the game feels like a chore.\r\n\r\nOverall: 5/10, would not recommend; only if you think you'll enjoy the combat long enough to where the frustration of backtracking for countless hours on the levels makes you quit playing, then go for it. There are much better options out there than this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dev's censor discussions. Game is mediocre, at best.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Recommended... Mixed\nLords of the Fallen is a beautiful, ambitious Soulslike with some genuinely great moments… and some very rough ones.\n\nPros:\nStunning visuals and atmosphere\nThe dual-world mechanic (Axiom/Umbral) is unique and really cool\nA few bosses are genuinely fantastic (Tancred/Reinhold, Sundered Monarch, Pieta)\nGood entry-level Soulslike difficulty early on\n\nCons:\nDifficulty curve is inconsistent — random late-game enemies hit harder than bosses\nToo many mimics, too many knockback deaths, too much mob spam\nSeveral bosses are gimmicks instead of real fights\nThe final boss is extremely anticlimactic\nStory never builds to a satisfying payoff\n\nI genuinely enjoyed parts of it the world is gorgeous and some fights are amazing but the second half becomes frustrating for the wrong reasons, and the ending completely failed to deliver the “epic final boss” feeling.\n\nIf you love Soulslikes and can tolerate uneven design, it’s worth a try.\nIf you’re looking for Elden Ring or Lies of P-level polish… this won’t scratch that itch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too much bug, goddamn waste of money & time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I will no longer play games that need a third party agreement for any reason to play a game I purchase. Stop doing this!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whoever developed this game needs to learn how to not make it crash during EVERY DAMN CUTSCENE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oh wait im about to have fun!! No, wait. It crashed again :\\\nBuggiest souls-like ever. I do not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game could be compared to fetal loss",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuck in the floor, cannot get out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "failed promises and mediocre at best",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boş oyun asla almayın",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not good. Not good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game blows",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy mess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "optimized like dohsjt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "дерьма",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage Coop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like DS2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "RELEASE ME!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "huh?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Although I beat the game and am excited for Lords of the Fallen 2, there are 3 reasons to why I cannot recommend this game. None of them are a big issue in and of themselves, however, when together and compounded in this 25-hours title, really detract from the overall experience. \r\nGive my review a read and decide for yourself, the game is fun but these were my gripes:\r\n\r\nReason 1 - Quest progression and main story choices - this game's quests and even the main story is clearly inspired by dark souls' annoying teleporting NPCs with weird random item requirements and the ability to lock you out of quests (you can miss out on vendors, gear, endings). This game takes it up a notch, failing a quest here is so easy that I would recommend a new player to follow a build guide just so they don't need to start a new game+ to get a spell or unlock a weapon's special attack. trust me! you'll need a walkthrough.\r\n\r\nReason 2 - Visual clarity and level design - this game has a parallel world mechanic, (similar to *that level* in Titanfall 2) where the other world has hidden areas and items in addition to some areas only being accessible through the Umbral world, as it is called. This would be fine if there was a reason to play in the normal world. As it stands, all you get is and extra life, Sekiro style. I cannot tell how many items I missed because they only exist in the Umbral which forced me to play every level twice. By the end of the game, I was playing every level in the other world. OK! so what's the issue you may ask? when in the Umbral, the level is covered in fungi and a horrid blue tint and fog, although it looks fantastic (this game really is beautiful) for an interactive media, the lack of visual clarity means that enemies blend in with the environment, you miss items, areas or simply get lost due to not being able to find your bearings. I had to scour the internet in order to find a way to turn off this volumetric fog and all the modern-day visual artifacts that plague DLSS infested games. I suggest you do the same! not to mention, while in the Umbral, areas which have distinctive themes all end up looking so similar to each other that you couldn't tell what differentiates one area from the other.\r\n\r\nReason 3 - Enemy variety. simply put this game doesn't have enough enemies that challenge how you play, this may be a personal belief which could lead to a bias of mine, but I do think enemies in any video game should serve a purpose, to test their players quick thinking, strategy and flexibility. This game gets a praise in terms of enemy placement, they are all amazingly positioned, keeping you on toes, but the variety is just not enough! by hour 10, you've seen every enemy the game has to offer, and they don't offer much of a challenge either, you can stagger them to death, when you don't out-right kill them in 2 hits.\r\n\r\nPraises - the game is very big, well worth you money; it looks stunning once you get past the issues I mentioned; weapon variety is crazy; every build is viable if you don't fail their respective questlines; and the other world mechanic, although flawed, is breath of fresh air into the genre.\r\n\r\nthanks for reading!",
      "voted_up": false,
      "votes_helpful": 361
    },
    {
      "review": "Combat just isn't fun. \r\n\r\nIts like 80% the quality of a Fromsoft game, but its missing the 20% that make the difference between annoying difficulty and fun difficulty. \r\n\r\nEnemies are a slog, rather than a challenge. They're slow and predictable and make up for that by being HP sponges, always outnumbering you and having so much stagger/poise/stability that they just power through all your attacks, even fully charged heavy attacks.\r\n\r\nLots of other small grievances, but all of it can be summed up as 'fun idea, poor execution'. Overused ambushes, lame puzzles, endlessly reused enemies, reliance on superarmor/AoE attacks, ranged enemies chunking half your HP, levels looking so samey you get lost, half the bosses get reused as normal enemies later.\r\n\r\nAnd the worst thing is its not even _that_ bad. Its just good enough to keep you playing through all the obnoxious dumb gotcha's and conflicting game design until you're halfway through the game and you realize you haven't had fun since the the hushed saint. The game's not even hard, its just tedious.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "This game was fun in terms of combat and pvp 1v1s, but let me tell what an atrocity of an experience this was with my friend in Co-op. We kept getting crashes, lag spikes, freeze lags, teleportations and the most important my friend had 20% chance of actually joining my game, if it failed then he'd sit in a black screen for eternity until he alt+f4's his game, which also takes him 10 minutes to reboot the game.\r\n\r\nThe pvp in this game was horrible as well, where lvl 200 players would join against my character's level 50. Damage wasn't scaled properly and the damage the magic does in this game was really OP to the point where anything oneshots you, forgot to mention that players were spamming the same magic attack every 1.5 seconds for 30 seconds straight.\r\n\r\nThe ending boss was so bad, no epicness, no big fight, just killing small minions that kills the boss' hp and then it just ends in a very anti-climatic way. It was absolutely trash.\r\n\r\nI give the game a 4/10 for all the lags, for the fps drops throughout the whole playthrough with my friend in Co-op, for the pvp unbalances, for the constant crashes and for a horrible final boss.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Got to play Co op with my friend, Constant crashing and clipping through the map to my death.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I don't think it's a bad soulslike, just an average one. It's got some unique mechanics like the lamp, but the surprisingly easy difficulty of the game, mixed with the terrible level design (had to look at guides for an hour cause the game wasn't clear on where to go multiple times) really kinda killed my enjoyment of it. I'd wait for a sale and try it for yourself if you're in the mood for a soulslike copy.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Overall was a painful game to complete. When I first bought it I played it until I realised the enemies are just carbon copied from one area to the next so the variety is super small. Gave it another go last month but forced myself through it. Be prepared for boring bosses (some are really cool but most are dreadful), lack of enemy variety, spongy enemies, and poor enemy placements. Overall if you're a souls fan I'd give it a go but don't expect anything near Dark Souls or Lies of P etc. The developers think they have something great but 90% of the time they're delusional.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The game clips, disconnects, and crashes far too frequently playing co-op... very sad.. is a fun game but this part makes it nigh unplayable for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I got this game to play with my friend but due to bugs where the guest doesnt get the healing upgrades, or the lantern upgrades,....or the boss souls\\armor\\weapons, i can not recommend this game until the bug is fixed i will not change the review until then. If there is seemless co-op then both players should be able to do everything the other does or at least be able to get non story mode items.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Unpolished mediocrity.\n\nGame struggles to load areas to the point it can load and unload objects, enemies, ladders and even floor you're standing on several times. Depending on instance severity, borderline unplayable and will result in player death or being stuck in geometry.\nIt is atrocious in optimization, game will lag out over time and eventually crash even on high-end machines; on my machine, it runs with perfectly smooth framerate for about twenty minutes, then starts to lag in new and old areas alike until it becomes a slideshow. Detestable.\nGraphics are mismatched. On medium quality, armor can be vastly more detailed than a satchel on that same piece of armor and a buckler you're holding. Additionally, water looks like low-poly pixel slag that cannot be seen through despite having fancy light shining back onto rocks around it implying this water should not only look much better, but be clear in the first place. And that's \"medium\" setting. Worse even, on \"low\" setting some renders are still incredibly high-resolution for absolutely no good reason; I can only bring myself playing this game with a friend, and he suffers consistent stutters throughout because apparently game really thinks \"low\" setting should still be a post-processing nightmare with shiny armors, even if it's gonna give first boss scout tf2 hands in its cutscene.\nWhy is this game made in unreal engine? It has no reason to. If game is tearing at the seams regardless of machine, then perhaps it's better off with a simpler, less demanding tool.\nVoice acting is, for a lack of a better word, shit. Very rarely a character is tolerable to listen to, and they've a case of completely forgetting whom they're voice acting when speaking their vendor lines. Some particular cases make me feel like I'm visiting a 4th grade literature class. Which is to say, not good.\nWriting is.. nonexistent. The opening cinematic has the most stock narrative and delivery one could ever imagine. There is absolutely nothing original about it, and it sounds like some teenage kid played some of them souls games and decided that he wants a fanfic of his own.\nTutorial is broken. Messages appear on world trigger and tutorial section will loop you back onto a message you've already seen. Additionally, tutorial popup can get stuck and you will not see further popups unless you go to menu. The popup is very large, too; it obstructs a lot of view which was unfortunate to have while being invaded in a narrow passage section.\nThe covenants are grindy as hell. Intentional or not, but the lamp covenant was well designed to find on your own - lamp will go crazy around that area, which intuitively makes you discover it, working perfectly as a hidden tutorial; so clearly someone on design team knows how to make an interesting game, but with the rest being so trashy it's hard to appreciate such a touch. If anything, it is sad.\nAreas look incredibly samey and blend into one another. The shadow world thing is an interesting gimmick but isn't being used to its potential. Appreciate the attempt, though.\nIn coop, you can get locked away from your host by a boss-room trigger wall. Apparently there's supposed to be a prompt to enter it, but I didn't get it, being helplessly stuck behind it without being able to join a section of map until host finally found the boss. Amazing.\nIf you fall, there's a decent chance your lost souls will be at the location you landed, not the location you fell from! Floors unloading doesn't make it any better.\nMatchmaking takes ages for me, despite my machine loads areas incredibly fast. What's the deal with that?\nUser interface is inconsistent at best. Controls lose focus when clicking on some elements, rendering buttons useless unless you click on \"correct\" area. Some menus don't respect clicking and you have to use keyboard, and vice versa.\nPrecise aiming is supposed to show some kind of a trajectory trail, but it seems to be absent for me.\nCombat could be good, but it seems there is no variation between movesets of same-class weapons; you don't even have clumsy movement for using weapon without meeting stat requirements! That is not a good thing. The movesets aren't bad but lack of variety makes them run dry quick. There's also perfect blocks and counters (or at least what felt like one) and that does salvage it for me. Probably first thing on the list I'm not completely negative about.\n\nMusic is alright. Sometimes things look alright.\nMovement feels speedy and combat isn't that bad.\nBut alas, rpg \"souls-like\" slop.\n\nBut floors unloading and killing both me and my friend, that is what ultimately made me leave a negative review.\nI could tolerate all the rest but if game fails to render collision for a floor? Yeah, no, this is where I draw the line.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I had the Friend Pass version of this game to play co-op with a friend of mine. From the beginning, I experienced numerous technical problems with the game, from audio refusing to work on boot to numerous glitches and performance issues (falling through the world, lighting and texture bugs, one area just refused to load for us entirely). My computer isn't old but this game still fully crashed it half a dozen times and exacerbated a PSU issue that required replacement and repair. Even after I repaired it, it still crashes my computer. \r\n\r\nOn top of the technical issues, the game suffers from samey enemies and uninspired level design. It's worth crawling through with a friend, but it's not worth fighting all these technical issues. After it hard crashed my computer the last time, I'm not interested in finishing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lords of the Fallen is a solid Souls-like that definitely has its moments of brilliance, but it’s held back by repetitive design, limited enemy variety, and the occasional cheap-feeling mechanic. It’s still fun overall, though it never quite lives up to its full ambition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't like anti-cheat. I play offline because I enjoy story but not grinding - I don't have lots of time so I sometimes modify the game. Disappointed.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game is fine for a casual playthrough and is an ok soulslike at best.\r\n\r\nBUT, if you're someone that strives for 100% completion, STAY AWAY FROM THIS ONE.\r\nThis is such a chore with achievements such as ''Collect all armor'' Collect all weapons'' ''Find all Stigmas'' ''Collect all XYZ''.\r\n\r\nAn ok Soulslike brought down by baffling design choices and lackluster enemy variety.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do not recommend Lords of the Fallen after 14 hours getting to the halfway point. After numerous patches the game finally runs good but not perfect. Credit to the developers for not abandoning the game after its buggy launch. The game's excellent art direction is wasted on clunky gameplay and overly cryptic narrative. The alternate world design is cool in concept but wasted in implementation. As a result entering the umbral realm feels like a chore. The umbral mechanic also causes a lot of the stuttering and frametime instability.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lords of the Fallen is a souls-like that could have been enjoyable.\n\nIt's not too difficult and it has an interesting mechanic that makes you switch between parallel worlds.\n\nThe musics are [i]very[/i] nice.\n\nGraphically, [u]when you can see anything[/u], it's beautiful.\n\nAnd that's the chief issue with the game.\n\nI've tried every setting and every trick players have attempted and documented online: most of the time I can't see a thing.\nSometimes it is so bad that I only know I'm fighting an enemy because I'm hearing noises and I've got it locked on.\nYou'll have normal visibility, see a room, enter through the door and suddenly it's pitch-black.\n\nThat huge problem aside, the game has also a few bugs were you'll get stuck in place for no apparent reason and will have to walk back and/or jump around to progress. Not ideal when you are fighting.\n\nAnother thing that I didn't like is how limited the exploration felt. Quite often felt I could have tried jumping over something to reach a potentially hidden path (or fall to my death) but it's impossible: either you are blocked by an invisible wall, either you drop and die. There is no in between.\n\nThere are three ending and I've got the normal one. It was a bit underwhelming.\n\nThere is a New Game Plus, but I never want to play it ever again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lords of the Fallen tries to patch over the usual weaknesses of Souls-likes, but its fixes don’t hold. Too often, it devolves into a tedious walking simulator, forcing players to trek long distances just to retry a boss. This repetition breaks immersion and undercuts the cinematic feel it aims for.\n\nOn the plus side, combat feels faster and more aggressive than in many Souls-likes. Unfortunately, that edge is buried under awful mapping; labyrinthine, needlessly confusing, and more frustrating than rewarding.\n\nOverall, the game doesn’t rise above its genre’s problems. I don’t recommend it.\n\n\nEDIT: After finishing Lords of the Fallen, my first impression stands; only worse. The game still forces endless corpse runs that turn into a dull walking simulator, gutting any cinematic flow. Combat may be faster than typical Souls-likes, but it’s wasted on a miserable, confusing map design that feels like it was built to annoy rather than challenge.\n\nAnd then there are the traps. Who the fuck thought it was a good idea to shove a trap in your face every three minutes? It doesn’t add tension, it adds tedium. It’s not clever, it’s not fun, it’s just lazy design.\n\nAfter 25 hours, I can say with certainty: this game isn’t worth your time. I don’t recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even though Lords of The Fallen 2 has some neat ideas and SHOULD be a good game ON PAPER - I couldn't ever bring myself to call it good, I'm sorry.\n\nThe game looks... burnt. It feels burnt. Everything is kind of over-detailed but at the same time you can't make anything out. Animations, movements - everything feels 'jagged', an enemy may travel through a footbal field in 1 swing, whereas YOUR attacks send you forward SO LITTLE - most enemies will get out of your range by just breathing.\n\nThe story is the typical SoulsBorne vague depressing religious drivel, except it's terribly written and even less interesting than you could imagine. Bad god is bad, good god is good but kinda bad too. Myegh. Tragedy can only go so far before it becomes monotonous.\n\nThe alternative world had a lot of potential, but in the end... It's just there. You can't progress through a part of a level? You probably need to go into the other world. Don't stay there too long or you'll die. 'Puzzles' are... barebones-y, I don't know what to tell you. It's not pleasant to explore the 'Umbral' because enemies constantly spawn everywhere, you have a disgusting array of effects on your screen and some bugs crawling sounds are present ALL THE TIME. It is PHYSICALLY draining to walk through the second world. I GET that it's a bad place, but damn. Imagine suffering for 50% of the game just because of all the visual and audial noise.\n\nOh yeah, not to mention game-breaking bugs like entire buildings/floors/walls blinking in and out of existence until you clip through and fall into infinity.\n\nThere are VERY FEW redeemable qualities this game has, and in my opinion - none of them are worth forgiving LOF2 her detriments.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still no FOV slider for offline play. I like the game but my nausea starts to kick in within 15 and it gets progressively worse. Weird, as I have no problem playing most PC VR games and mods with no problems, including Cyberpunk. \n\nSomehow the devs can’t add a way to change fov while people using cheat engine tables can. Don’t want to mess with CE myself. \n\nDidn’t refund but can’t recommend, wish I could.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I beat this game. Don't play it.\r\n\r\nThe level design is atrociously bad. Paths go absolutely nowhere and literally every Dark Souls-esque \"shortcut\" is completely useless - why do I need a shortcut from one rest spot to get back to the previous one when I can warp between them? The layout of areas meanders around and makes it difficult to see when you've actually made progress, especially since there are paths that run off everywhere and lead to nothing.\r\n\r\nIt has some incredibly cool concepts and QoL stuff that had me really hopeful - the \"two worlds\" thing seems especially cool, but it just absolutely craps the bed when it comes to using it. The entire Umbral World looks exactly the same no matter where you are and it's just DULL. The cross-platform invasions and co-op seems like a great idea, in fact the co-op could be, I haven't tried it, but invasions have no level matching, meaning every time it happened to me it was someone with endgame gear. I can imagine how annoying that is from their perspective too, wanting a challenge and ending up taking a gamble every invasion on whether it'll be a waste of time.\r\n\r\nIt's also pretty dreadfully easy. I struggled with one boss fight that you are designed to lose TWICE throughout the game. When I finally got to fight it properly, it lasted about a minute and a half and presented no challenge at all.\r\n\r\nI wanted to like it. I'd heard good things. The only thing I can say I enjoyed about it is that loading it up and watching something on another monitor was pretty chill.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is in terrible condition lots of bugs.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The game itself is pretty fun. The umbral realm concept is interesting, since it unlocks a whole new way of traversing the map. Enemy and boss designs are spot on, although I do wish there were more enemy varieties instead of a simple reskin. The world design can be a bit meh with plenty of the maps looking like Blighttown without the poison swamp. One of the things that prevents me from recommending this game is some of the boss mechanics. It'll either be an honest, straight up fight or an infuriating gank squad made up of pretty annoying common enemies. The gimmick itself is easy to understand, but with a bunch of touch-starved beasts up your bum, it's actually quite a chore to do. \r\n\r\nTL;DR\r\nSmart boss mechanics? This is Lords of the Fallen, brostate. You'll either have an easy bossfight or you're getting jumped.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I rarely write steam reviews but I had to get it out of my system. Stopped playing this game after that joke of a boss called „The Hollow Crow“. If you want to play an actual good soulslike game, get Lies of P and Overture. Here you basically have no enemy variety – you keep fighting the same but reskinned zombies, crossbow dudes, axe wielding dudes and dogs over and over again. No memorable zones like Anor Londo, just generic dark fantasy paths and mazes. The umbral mechanic seemed interesting at first, but quickly turned out to be frustrating and constantly stopped the gameplay flow. If this is the highly praised state of the game after the overhaul patch 2.0, than I am glad that I did not play this mess at launch. This game is Dark Souls 2’s weird cousin.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's two main things that I found bad about this game. One is the character creator and the other is the combat.\n\nThe first thing we see of most games are character creators. Yet a lot of game designers neglect them, this one is not the worst I've seen but it's close to be. It is impossible to make a normal human, the eyeballs are unattached from the eyelids, some textures clip and you have very little options on what you can do. I'd rather have four or five good faces to pick from, and no customization options, than so many noses and eyes that all look bad.\n\nNow combat. It's weird. You can run towards an enemy and swing many times and your hits will miss for some strange reason, as if the hitbox of your weapon is tiny. Its an arpg, I shouldn't need to use the lock on system to be able to hit something. Also movement is janky, rolls are slow, everything is slow even in characters without heavy armor or heavy weapons.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i have no idea whats going on here but im not getting any sound in cutscenes, not the opening game cutscene or the first story cutscene.\nI've looked it up and it seems to be a rare bug? all my sound settings are as they should be. and verified files. sad to give a bad review without even getting to play the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got to play it with my friend who's very fond of soulslikes. It… wasn't enjoyable. It's not a bad game, though I didn't find it enjoyable. Most of the time it was frustration – filled with lags, bugs and crashes. I've only played coop and I wouldn't recommend it. I don't know much about singleplayer tho. Solid idea, not fun execution.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "combat feels awful and clunky, game design is boring and annoyingly religious, hell nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent game, unfortunately even with all the ingredients that make a good souls like, it is lacking the engagement and thrill when it all comes together.\nPaladin's Burden : Summarises the Dev's poor choices.\nEbb and Wayfarer : Fight in alley and spam attacks before the NPC kill you, wildy poor design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2] An enjoyable experience for about a dozen hours until the lack of enemy variety bored me [/h2] \n\nThe game isn't terrible by any means. Graphics are absolutely gorgeous and environments are quite interesting to explore and go through. Very interconnected design, though can get exhaustingly complex at times. Animations are OK, definitely janky and a bit stiff but tolerable nonetheless (aside from the spear animations, those are horrendous). Voice acting is moderately weak but story doesn't matter in a game like this anyways. \n\nI enjoyed my time with this game but whilst exploring an expansive castle level I got hit with the unmistakable feeling of sheer boredom. It was caused by an abundance of enemies that are almost all reused from the very first level onward. Basic mage stick guy, two-handed mace guy, crossbow dude, one-handed mace shield guy and some dogs over and over and over again. \n\nThe Umbral Realm is even worse about this. It's just a bunch of waddling zombies and occasionally a fat fly, rare sickle dudes and a few big guys who only take damage from behind. But it's just 99% waddling zombies which gets very old, very quick. \n\nEnemies you encounter as minibosses are quickly turned into mob types that are littered throughout the next levels, only adding to the tedium as you become more familiar with them. One of the worst offenders is a large two-handed weapon type of enemy that has a few distinct models but each one uses the same exact moveset. \n\nI'm no stranger to reused enemies, I love Elden Ring and it has plenty of recolored / reused enemies. But ER nonetheless has a vast quantity more enemy variety compared to this game. Even Limgrave and Weeping Peninsula alone has probably triple the amount of enemy variety compared to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In a game like this dodging is ALL. If the commands are unreliable the game value drops much. Nice on every aspect but as long as control sucks I cannot give this game a positive value. Unlucky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time on this game.\r\nAt first I played through half the game singleplayer on xbox gamepass, but then dropped it because it simply was not fun and EXTREMELY frustrating.\r\nI picked up the game on a steam sale, as I saw they introduced a friend pass system to play through the whole game in \"seemless\" coop. Let me tell you. The coop is not seemless. It had many issues and bugs.\r\n\r\nALL bosses in this game are either a gank or a gimmic fight. The final boss is legit a JOKE. It's actually sad how bad it is.\r\n\r\nPlease don't waste your time on this game. It simply is not fun at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just a few reasons why I can't recommend this game:\n-The trash mobs are significantly hard than the bosses. Most bosses will be defeated on the first attempt. This is a massive red flag for a souls like game.\n-The camp fire system they have is jank in LOTF because they refused to create an interactive map.\n-Map design is okay, but you can stumble into near endgame zones in the first to get slaughtered repeatedly.\n-Your game path is locked in the first hour when you don't know what you're doing, leading to dozens of wasted hours in a throwaway play through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AVOID THIS GAME: Buggy mess, might brick your PC, pretty mediocre.\n\nMy co-op playthrough with a friend was riddled with absurd and gamebreaking bugs: from crashing our whole PCs, crashing to desktop, migraine-inducing light and sound flickering problems, characters randomly falling through the floor texture, entire areas breaking, etc.\n\nThis game somehow bricked my friend's whole ass power supply after multiple crashes, and then nearly broke a brand new replacement before we decided to just give up.\n\nWhen it comes to gameplay: It's about what you expect from a mediocre souls clone -- mushy controls/movement, low enemy variety, poor level design and forgettable music and story. The core dimension-hopping mechanic is more frustrating and tedious than engaging, the game would be better off without it. DEFINITELY not worth slogging through all the bugs and risking your computer over. The apparently \"shared\" co-op progression is totally broken with many key items and mechanics just straight up never being accessible to the 2nd player.\n\nHow this game is still in such an abysmal state two whole years after launch is beyond me. Embarrassing. \n\nYou guys owe my friend a power supply.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having played it for a while, I cannot recommend this game. It's just simply not fun. Elden Ring and other games are worth the money. I'm not even going to bother trying to beat it.  \n\nit has a interesting difficulty that is similar to souls game,  the leading issue with it is the UI is not fun.  The Lamp is boring, it's way too clunky, and the spells to gear interactions suck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "friend bought it and told me its shit.\ni was like \"nah mate, it has koop, let's try.\"\nan hour in we were both agreeing on the shittiness of the game and uninstalled.\nthanks for that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly boring. Boss design is so lame. Fighting the same 5 enemies over and over again. Full of areas where you get mobbed while also dealing with ranged attacks. Barely better than the original. Waste of time and money. Do not buy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not a bad game by any means it just fails to stand out in a crowded souls-wannabe market. For $20 or less I'd absolutely recommend getting it just with average expectations. The graphics are fine, the souls knockoffery is exactly what you'd expect. My biggest gripes are the very thick console feeling, the fairly bad camera controls and general lack of anything new or innovative. The enemies are pretty generic, the classes/weapons/moves generic, their only claim of distinction is the realm hopping which is mostly used in extremely simple puzzle and, at risk of showing my age, nothing that wasn't done before going back to the Ocarina of Time \n\nAll in all I don't regret purchasing the game on sale. Just don't expect it to be something defining; it's a good enough way to waste some tome, nothing more nothing less.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you've been the original FromSoft Souls series and Elden Ring, the gameplay and combat will feel similar but shallow. If not, then I encourage you to try Dark Souls 3 instead of this.\n\nJust like DS3 and the other games that came before Elden ring, it is not an open world. In the case of Lords of the Fallen however, the level design is very bland and the parallel \"shadow world\" doesn't make the experience richer, it makes very annoying. Everything about this game is annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some of the most boring mechanics I’ve ever seen in a Souls-like. Why would anyone think it’s a good idea to implement loot that literally kills you when you pick it up, with no way to tell if it’s real unless you’ve already been there and looted the place? The first five hours were pretty enjoyable, but then it just went downhill. Fifteen hours in, and it’s nothing but enemy reskins. The game has become a chore rather than anything else. I’ll finish it, but it’s going to be painful.\nps : the enemies that are only designed to push you off the ledge are also a pain in the arse...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly don't even waste your time to give it a chance. played through the whole game hoping it would get better, but there were only 2 actual souls like bosses, the rest just use dumb gimmics and AOE's the whole time. And every boss becomes a normal enemy like 2 meters outside their arena. The final was just a enemy wave type fight of normal enemys?????????????????\r\nI played on the friends pass with someone, and most of the mechanics didn't work for me because of that. \r\n1/10",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}